<!-- retain these comments for translator revision tracking -->
<!-- Original version: $Revision: 1.5 $ -->
<chapt id="choosing">Scegliere una distribuzione Debian

<p>Ci sono molte diverse distribuzioni Debian. Scegliere la
distribuzione Debian adatta &egrave; una decisione importante. Questa sezione
fornisce alcune informazioni utili per gli utenti che desiderano fare la
scelta pi&ugrave; adatta per il loro sistema e inoltre risponde ad alcune
possibili domande che potrebbero nascere al momento della scelta. Non
parla del "perch&eacute; si dovrebbe scegliere Debian" ma piuttosto di "quale
distribuzione di Debian scegliere".

<p>Per maggiori informazioni sulle distribuzioni disponibili si veda
<ref id="dists">.

<sect>Quale distribuzione Debian (stable/testing/unstable) &egrave; meglio per me?

<p>La risposta &egrave; piuttosto complessa. Dipende veramente da cosa si
ha in mente di fare. Una soluzione potrebbe essere chiedere ad un amico
che usa Debian. Ma ci&ograve; non significa che non &egrave; possibile prendere una
decisione in modo autonomo. Di fatto, si dovrebbe essere in grado di
fare una scelta una volta completata la lettura di questo capitolo.</p>

<p><list>

<item><p>Se la sicurezza o la stabilit&agrave; sono aspetti di una qualche
importanza: installare stable. Punto. Questa &egrave; la scelta consigliata.</p>

<item><p>Se si &egrave; un nuovo utente che deve installare su una macchina
desktop, iniziare con stable. Parte del software &egrave; piuttosto vecchia, ma
&egrave; l'ambiente di lavoro con meno bachi. Si potr&agrave; facilmente passare alla
pi&ugrave; moderna unstable una volta che si &egrave; pi&ugrave; sicuri di s&eacute;.</p>

<item><p>Se si &egrave; un utente desktop con un po' di esperienza in Linux e
che non ha problemi ad affrontare un baco sporadico una volta ogni tanto,
usare unstable. Ha tutto il software pi&ugrave; recente e all'avanguardia ed i
bachi sono solitamente risolti prontamente.</p>

<item><p>Se si gestisce un server, specialmente uno per cui la stabilit&agrave;
&egrave; un requisito importante o che &egrave; esposto ad Internet, installare
stable. Questa &egrave; di gran lunga la scelta pi&ugrave; sicura e affidabile.</p>

</list>

<p>Le domande che seguono forniscono, si spera, ulteriori dettagli su
queste scelte.
Dopo aver letto tutte queste FAQ, se ancora non si &egrave; in grado di
prendere una decisione, optare per la distribuzione stable.</p>

<sect1>&Egrave; stato suggerito di installare stable, ma in essa l'hardware
pincopallino non viene rilevato o non funziona. Cosa fare?

<p>Provare a cercare nel web usando un motore di ricerca e vedere se
qualcun altro &egrave; in grado di farlo funzionare in stable. La maggior parte
dell'hardware dovrebbe funzionare senza problemi in stable. Se per&ograve; si
ha dell'hardware recentissimo e all'avanguardia, questo potrebbe non
funzionare con stable. Se questa &egrave; la situazione, si pu&ograve; voler
installare unstable o aggiornare il sistema ad essa.</p>

<p>Per i portatili, <url id="http://www.linux-on-laptops.com/"> &egrave; un
sito web molto buono per vedere se qualcun altro &egrave; stato in grado di
farli funzionare con Linux. Il sito non &egrave; specifico per Debian, ma ci&ograve;
nonostante &egrave; una risorsa preziosissima. Non conosco un sito
web simile per i desktop.</p>

<p>Un'altra opzione sarebbe chiedere nella mailing list debian-user
inviando un messaggio di posta elettronica a
debian-user@lists.debian.org . &Egrave; possibile inviare messaggi alla lista
anche senza essere iscritti. Gli archivi possono essere letti via <url
id="http://lists.debian.org/debian-user/">. Informazioni relative
all'iscrizione alla lista sono reperibili all'indirizzo degli
archivi. &Egrave;
caldamente consigliato porre le proprie domande sulla mailing-list
piuttosto che su <url id="http://www.debian.org/support" name="irc">; i
messaggi della mailing-list sono archiviati perci&ograve; la soluzione ai
propri problemi potr&agrave; aiutare altri nella stessa situazione.</p>

<sect1>Nelle differenti distribuzioni ci sono versioni diverse dei pacchetti?

<p>S&igrave;. Unstable ha le versioni pi&ugrave; recenti, ma i suoi pacchetti
non sono ben testati e potrebbero avere bachi.</p>

<p>D'altro canto, stable contiene versioni vecchie dei pacchetti, ma
esse sono ben testate ed &egrave; meno probabile che abbiano un qualche baco.</p>

<p>I pacchetti in testing sono una via di mezzo tra questi due estremi.</p>

<sect1>Le distribuzioni stable contengono pacchetti veramente
datati. Basta guardare Kde, Gnome, Xorg o persino il kernel: sono molto vecchi. Perch&eacute;?

<p>Beh, questo pu&ograve; essere vero. L'et&agrave; dei pacchetti in stable dipende da
quando &egrave; stato fatto l'ultimo rilascio. Dato che di solito trascorre
pi&ugrave; di 1 anno da un rilascio all'altro, stable potrebbe contenere
versioni vecchie dei pacchetti. Tuttavia sono state testate per diritto
e per rovescio. Si pu&ograve; dire a ragion veduta che i pacchetti non hanno
alcun baco importante noto, falle di sicurezza, ecc. I pacchetti in
stable si integrano perfettamente gli uni con gli altri. Queste
caratteristiche sono molto importanti per server di produzione che
devono essere in funzione 24 ore al giorno, 7 giorni alla settimana.

<p>I pacchetti in testing o unstable, d'altra parte, possono avere bachi
nascosti, falle di sicurezza, ecc. Inoltre alcuni pacchetti in testing e
unstable potrebbero non funzionare come atteso. Di solito le persone che
lavorano su una singola macchina desktop preferiscono avere l'insieme di
pacchetti pi&ugrave; recente e moderno. Unstable &egrave; la soluzione adatta per loro.</p>

<p>Come si pu&ograve; vedere, la stabilit&agrave; e l'estrema modernit&agrave; sono ai capi
opposti dello spettro. Se &egrave; necessaria la stabilit&agrave;, installare la
distribuzione stable. Se si vuole lavorare con i pacchetti pi&ugrave; recenti,
allora installare unstable.</p>

<sect1>Se si decidesse di passare ad un'altra distribuzione, sarebbe
possibile?

<p>S&igrave;, ma &egrave; un processo unidirezionale. Si pu&ograve; fare il passaggio stable
--&gt; testing --&gt; unstable. La direzione inversa invece non &egrave;
"possibile". Perci&ograve; &egrave; bene essere sicuri se si ha intenzione di
installare unstable o di aggiornare il sistema ad essa.</p>

<p>In realt&agrave;, se si &egrave; esperti, si &egrave; disposti a spenderci del tempo, si
&egrave; molto cauti e si sa quello che si sta facendo, allora potrebbe essere
possibile passare da unstable a testing e successivamente a stable. Gli
script di installazione non sono pensati per fare questo; perci&ograve;, nel
farlo, i propri file di configurazione potrebbero andar perduti e...

<sect1>Potete dirmi se installare testing o unstable?

<p>Questa &egrave; una questione piuttosto soggettiva. Quando si deve decidere
tra unstable e testing non esiste una risposta perfetta, ma solo una
ipotesi ragionata. Il mio personale ordine di preferenza &egrave; Stable, Unstable e
Testing. La questione &egrave; in questi termini:</p>

<p><list>

<item>Stable &egrave; solida come una roccia. Non si rompe.

<item><p>Testing si rompe meno di frequente di Unstable, ma quando lo fa
ci vuole parecchio tempo prima che le cose vengano aggiustate. A volte
possono volerci giorni e a volte mesi.</p>

<item>Unstable cambia molto e si pu&ograve; rompere in qualunque
momento. Tuttavia, le cose vengono risolte spesso in un paio di giorni
ed ha sempre le ultime versioni dei pacchetti software per Debian.

</list>

<p>Ci sono per&ograve; situazioni in cui sarebbe meglio seguire testing invece
di unstable. L'autore si &egrave; trovato in una di queste situazioni a causa
della transizione di gcc da gcc3 a gcc4. Stava cercando di installare il
pacchetto <package>labplot</package> su una macchina con unstable e
l'installazione non era l&igrave; possibile perch&eacute; alcune delle dipendenze
avevano gi&agrave; fatto il passaggio a gcc4 ed alcune no. Il pacchetto in
testing per&ograve; era installabile su una macchina testing dato che i
pacchetti che aveveno fatto la transizione a gcc4 non avevano ancora
raggiunto testing.</p>


<sect1>&Egrave; stato detto che testing si pu&ograve; rompere. Cosa significa?

<p>A volte, un pacchetto pu&ograve; non essere installabile tramite gli
strumenti di gestione dei pacchetti. Altre volte, un pacchetto pu&ograve;
proprio non essere disponibile: forse &egrave; stato (temporaneamente) rimosso
a causa di bachi o di dipendenze non soddisfatte. Altre volte ancora, un
pacchetto si installa ma non si comporta nel modo corretto.</p>

<p>Quando ci&ograve; avviene, si dice che la distribuzione &egrave; rotta (almeno per
quel che riguarda il pacchetto in questione).</p>

<sect1>Come mai testing pu&ograve; essere rotta per mesi? Le soluzioni
introdotte in unstable non passano direttamente in testing?

<p>Le soluzioni dei bachi e le migliorie introdotte nella distribuzione
unstable passano in testing dopo un certo numero di giorni. Diciamo che
la soglia &egrave; di 10 giorni. I pacchetti in unstable passano in testing
solo quando non ci sono segnalazioni di bachi critici per il rilascio
che li riguardano. Se viene segnalato un baco critico per il rilascio
riguardante un pacchetto in unstable, questo non passa a testing allo
scadere dei 10 giorni.</p>

<p>L'idea &egrave; che, se il pacchetto ha dei problemi, questi vengono
scoperti da coloro che usano unstable e vengono risolti prima che il
pacchetto entri in testing. Ci&ograve; mantiene testing in uno stato usabile
per la maggior parte del tempo. Nel suo insieme il concetto &egrave;
impeccabile, a mio parere. Ma le cose non sono sempre cos&igrave;
semplici. Prendiamo per esempio la situazione seguente:</p>

<p><list>

    <item>Immaginiamo di essere interessati al pacchetto XYZ.
    <item>Ipotizziamo che al 10 giugno la versione in testing sia
    XYZ-3.6 e in unstable sia XYZ-3.7.
    <item>Dopo 10 giorni, XYZ-3.7 da unstable migra in
testing.
    <item>Perci&ograve; il 20 di giugno sia testing sia unstable hanno nei
    loro repository XYZ-3.7.
    <item>Diciamo che un utente della distribuzione testing vede che &egrave;
    disponibile un nuovo pacchetto XYZ e aggiorna la propria versione
    XYZ-3.6 a XYZ-3.7.
    <item>Ora diciamo che il 25 giugno qualche utente di testing o
    unstable scopre che c'&egrave; un baco critico per il rilascio in XYZ-3.7 e
    lo segnala nel BTS.
    <item>Il manutentore di XYZ corregge il baco e carica la versione
    corretta in unstable, diciamo il 30 giugno. Qui &egrave; stato ipotizzato
    che ci vogliano 5 giorni prima che il manutentore corregga il baco e
    carichi la nuova versione. Il numero 5 non deve essere preso
    letteralmente: potrebbe essere di pi&ugrave; o di meno a seconda del grado
    di severit&agrave; del baco critico in questione.
    <item>L'entrata in testing di questa versione nuova in unstable, XYZ-3.8, &egrave;
    pianificata per il 10 luglio.
    <item>Ma il 5 luglio qualcun altro scopre un altro baco critico per
    il rilascio in XYZ-3.8.
    <item>Diciamo che il manutentore di XYZ risolve questo nuovo baco
    critico e carica la nuova versione di XYZ dop 5 giorni.
    <item>Allora il 10 luglio testing ha XYZ-3.7 mentre unstable
ha XYZ-3.9.
    <item>L'entrata in testing di questa nuova versione XYZ-3.9 &egrave; ora
    ripianificata per il 20 luglio.
    <item>Dato che si usa testing e dato che XYZ-3.7 &egrave; affetta da un
    baco, sar&agrave; probablimente possibile usare XYZ solo dopo il 20 luglio.
    Cio&egrave; fondamentalmente ci si &egrave; ritrovati con una versione guasta di
    XYZ per circa un mese.

</list>

<p>La situazione pu&ograve; complicarsi ulteriormente se, per esempio, XYZ
dipende da 4 altri pacchetti. Ci&ograve; potrebbe risultare in una
distribuzione testing inutilizzabile per mesi. Lo scenario dipinto
sopra, inventato dall'autore, pu&ograve; avverarsi nella vita reale. Ma ci&ograve; &egrave; raro.

<sect1>Dal punto di vista di un amministratore, quale distribuzione
richiede pi&ugrave; attenzioni?

<p>Una delle ragioni principali per cui molte persone scelgono Debian
invece di altre distribuzioni Linux &egrave; il fatto che richiede molto poca
amministrazione. Le persone vogliono un sistema che semplicemente funzioni.
In generale si pu&ograve; dire che stable richiede molto poca manutenzione mentre
testing e unstable richiedono una manutenzione costante da parte
dell'amministratore. Se si usa stable, tutto ci&ograve; di cui ci si deve
preoccupare &egrave; il tenere traccia degli aggiornamenti di sicurezza. Se si
usa testing o unstable &egrave; una buona idea tenersi al corrente dei nuovi
bachi scoperti nei pacchetti installati, delle nuove risoluzioni di
bachi, delle funzionalit&agrave; introdotte, ecc.</p>

<!-- Removed, since the pictures cannot be added in the SGML code
<p>The following pictures, from <url id="http://exon.dyndns.org/releasepics/"
name="Matthew Exon"> illustrate the maintenance trauma the various distribution
options might cause you over time.  The graph provides a qualitative (but not
quantitative) picture of the amount of time administrators might be spending.
</p>
-->

<sect1>Cosa succede quando viene fatto un nuovo rilascio?

<p>Questa domanda non aiuta a scegliere una distribuzione Debian, ma
prima o poi verr&agrave; fatto di porsela.

<p>La distribuzione stable &egrave; attualmente &releasename;; la prossima
versione stable si chiamer&agrave; &testingreleasename;. Consideriamo il caso
particolare di ci&ograve; che avverr&agrave; quando &testingreleasename; verr&agrave;
rilasciata come nuova versione stable.</p>

<p><list>
    <item> oldstable = &oldreleasename;; stable = &releasename;; testing = &testingreleasename;; unstable =
sid
    <item>Ci si riferisce ad unstable sempre come a sid
    indipendentemente dal fatto che venga fatto o meno un rilascio.
    <item>I pacchetti migrano continuamente da sid a testing (cio&egrave;
    &testingreleasename;). I pacchetti in stable (cio&egrave; &releasename;)
    per&ograve; rimangono gli stessi tranne che per gli aggiornamenti di sicurezza.
    <item>Dopo un certo periodo testing viene congelata nello
    stato di freeze; ma continuer&agrave; ad essere chiamata testing. A questo
    punto nessun pacchetto nuovo pu&ograve; migrare da unstable a testing a
    meno che non contenga la soluzione ad un baco critico per il
    rilascio (RC).
    <item>Quando testing &egrave; in freeze, tutte le nuove risoluzioni dei
    bachi introdotte devono essere controllate manualmente dai membri
    del team per il rilascio. Ci&ograve; viene fatto per assicurare che non vi
    sar&agrave; alcun problema serio sconosciuto nella versione testing congelata. 
    <item> I bachi RC nella "testing congelata" vengono ridotti a zero.
    <item>La "testing congelata" senza bachi RC viene rilasciata come
    nuova versione stable. Nel nostro esempio, questo nuovo rilascio
    stable sar&agrave; chiamato &testingreleasename;.
    <item>A questo punto si avr&agrave; oldstable = &releasename;, stable =
    &testingreleasename;. Il contenuto di stable e della "testing
    congelata" &egrave; a questo punto lo stesso.
    <item>Viene fatto il fork di una nuova testing dalla stable attuale.
    <item>I pacchetti iniziano ad arrivare da sid in testing e la comunit&agrave; Debian
    lavora ora per fare il prossimo rilascio stable.
</list>

<sect1>Ho un desktop/cluster in funzione con installata Debian. Come
fare a sapere quale distribuzione &egrave; in esecuzione?

<p>Nella maggior parte dei casi scoprirlo &egrave; molto semplice. Guardare il
file <file>/etc/apt/sources.list</file>. Ci sar&agrave; una voce simile alla seguente:

<example>
deb http://ftp.us.debian.org/debian/ unstable main contrib 
</example>

<p>Il terzo campo ("unstable" nell'esempio precedente) indica la
distribuzione Debian a cui il sistema sta attualmente facendo riferimento.</p>

<p>Si pu&ograve; anche usare <prgn>lsb_release</prgn> (disponibile nel
pacchetto <package>lsb-release</package>). Se si esegue tale programma
in un sistema unstable si ottiene:

<example>
$ lsb_release  -a
LSB Version:    core-2.0-noarch:core-3.0-noarch:core-3.1-noarch:core-2.0-ia32:core-3.0-ia32:core-3.1-ia32
Distributor ID: Debian
Description:    Debian GNU/Linux unstable (sid)
Release:    unstable
Codename:   sid
</example>

<p>Tuttavia non &egrave; sempre cos&igrave; facile. Alcuni sistemi possono avere file
<file>sources.list</file> con voci multiple che corrispondono a
distribuzioni diverse. Ci&ograve; pu&ograve; accadere se l'amministratore tiene
traccia di pacchetti diversi da distribuzioni Debian diverse. Questa
azione viene spesso chiamata apt-pinning. Questi sistemi possono avere
in esecuzione un mix di distribuzioni.

<sect1>Al momento sto usando stable. Posso passare a testing o
unstable? Se s&igrave;, come?

<p>Se si sta attualmente usando stable, allora nel file
<file>/etc/apt/sources.list</file> il terzo campo sar&agrave; o &releasename; o
stable. &Egrave; necessario cambiarlo e mettere la distribuzione che si vuole
usare. Se si vuole usare testing, allora modificare il terzo campo di
<file>/etc/apt/sources.list</file> in testing. Se si vuole usare
unstable, allora modificare il terzo campo in unstable.

<p>Attualmente testing si chiama &testingreleasename;. Perci&ograve;, se si
cambia il terzo campo di <file>/etc/apt/sources.list</file> in
&testingreleasename;, si user&agrave; anche in questo caso testing. Quando
&testingreleasename; diventer&agrave; stable, per&ograve;, si continuer&agrave; ad usare
&testingreleasename;.</p>

<p>Unstable si chiama sempre Sid. Perci&ograve; se si cambia il terzo campo di
<file>/etc/apt/sources.list</file> in sid, si user&agrave; unstable.

<p>Attualmente Debian offre aggiornamenti di sicurezza per testing ma
non per unstable, dato che le risoluzioni dei problemi in unstable
vengono direttamente fatte all'archivio principale. Perci&ograve; se si usa
unstable assicurarsi di rimuovere dal file
<file>/etc/apt/sources.list</file> le righe relative agli aggiornamenti
di sicurezza .

<p>Se &egrave; disponibile un documento con le note di rilascio per la
distribuzione a cui si sta per fare l'aggiornamento (anche se non ne &egrave;
ancora stato fatto il rilascio) sarebbe saggio leggerlo, dato che
potrebbe fornire informazioni su come fare l'aggiornamento.

<p>Ci&ograve; nonostante, una volta fatti i cambiamenti detti sopra si pu&ograve;
eseguire <file>aptitude update</file> e poi installare i pacchetti
desiderati. Notare che l'installazione di un pacchetto da una
distribuzione diversa pu&ograve; aggiornare automaticamente met&agrave; del
sistema. Se si installano pacchetti specifici si finir&agrave; per avere in
esecuzione un sistema con un mix di distribuzioni.

<p>Potrebbe essere meglio in alcune situazioni aggiornare semplicemente
l'intero sistema alla nuova distribuzione eseguendo <prgn>apt-get
dist-upgrade</prgn>, <prgn>aptitude safe-upgrade</prgn> o <prgn>aptitude
full-upgrade</prgn>. Per maggiori informazioni, leggere le pagine di
manuale di apt e aptitude.

<sect1>Attualmente sto usando testing (&testingreleasename;). Cosa
succeder&agrave; quando verr&agrave; fatto un rilascio? Continuer&ograve; ad usare testing o
la macchina user&agrave; la nuova distribuzione stabile?

<p>Dipende dalle voci nel file <file>/etc/apt/sources.list</file>. Se si
sta attualmente usando testing, tali voci saranno simili a una di queste
due:


<example>
deb http://ftp.us.debian.org/debian/ testing main
</example>

o

<example>
deb http://ftp.us.debian.org/debian/ &testingreleasename; main
</example>

<p>Se nel terzo campo in <file>/etc/apt/sources.list</file> c'&egrave;
"testing" allora si continuer&agrave; ad usare testing anche dopo un avvenuto
rilascio. Perci&ograve; dopo che &testingreleasename; sar&agrave; rilasciata, si star&agrave;
usando una nuova distribuzione Debian che avr&agrave; un nome in codice
diverso. I cambiamenti potrebbero non essere evidenti all'inizio, ma lo
diverranno non appena nuovi pacchetti passeranno dalla distribuzione
unstable a testing.</p>

<p>Se per&ograve; il terzo campo contiene "&testingreleasename;" allora si
user&agrave; stable (dato che &testingreleasename; sar&agrave; allora la nuova
distribuzione stable).</p>

<sect1>Sono ancora confuso. Cosa hai detto che devo installare?

<p>Se non si &egrave; sicuri, la scelta migliore sarebbe l'installazione della
distribuzione stable.</p>

<sect>E per quanto riguarda Knoppix, Linex, Ubuntu e altre?

<p>Non sono Debian; sono <em>basate su Debian</em>. Bench&eacute; ci siano
molte somiglianze e cose in comune tra di esse, vi sono anche differenze
fondamentali.</p>

<p>Tutte queste distribuzioni hanno i propri meriti e sono adatte a
particolari tipi di utenti. Per maggiori informazioni, consultare la 
pagina sulle <url
id="http://www.debian.org/misc/children-distros" name="distribuzioni
software basate su Debian"> disponibile sul sito web di Debian.


<sect1>So che Knoppix/Linex/Ubuntu/... &egrave; basata su Debian. Perci&ograve; dopo
l'installazione sull'hard disk, posso usare con essa gli strumenti "apt" per i
pacchetti?

<p>Queste distribuzioni sono basate su Debian. Ma non sono Debian. Sar&agrave;
comunque possibile usare gli strumenti apt per i pacchetti facendo
puntare il file <file>/etc/apt/sources.list</file> agli archivi di
queste distribuzioni. Ma non si star&agrave; in quel caso usando Debian, si
star&agrave; usando una distribuzione diversa. Non sono la stessa cosa.</p>

<p>Nella maggior parte delle situazioni, se si usa una distribuzione si
dovrebbe rimanere legati ad essa e non mescolare pacchetti da altre
distribuzioni. Molti problemi di funzionamento comuni derivano dall'uso
di una distribuzione insieme al tentativo di installare pacchetti Debian
da altre distribuzioni. Il fatto che usino lo stesso tipo di formato e
lo stesso nome (.deb) non significa che siano automaticamente compatibili.

<p>Knoppix, ad esempio, &egrave; una distribuzione Linux progettata per essere
avviata da un CD Live mentre Debian &egrave; progettata per essere installata
sull'hard disk. Knoppix &egrave; molto bella se si desidera sapere se un
particolare hardware funziona o se si vuole provare a vedere come
&egrave; un sistema Linux, ecc.; Knoppix &egrave; adatta a scopi dimostrativi mentre
Debian &egrave; progettata per essere in funzione 24 ore al giorno, 7 giorni su
7. In pi&ugrave; sia il numero dei pacchetti disponibili, sia il numero di
architetture supportate di Debian sono estremamente pi&ugrave; grandi di quelli
di Knoppix.</p>

<p>Se si desidera Debian, la cosa migliore &egrave; installare Debian sin
dall'inizio. Anche se &egrave; possibile installare Debian passando per altre
distribuzioni, come Knoppix, la procedura richiede esperienza. Se si sta
leggendo questa FAQ &egrave; lecito ipotizzare che si &egrave; alle prime armi sia con
Debian sia con Knoppix. In questo caso, ci si risparmier&agrave; un sacco di
problemi futuri se si installer&agrave; subito Debian.</p>

<sect1>Ho installato Knoppix/Linex/Ubuntu/... sul mio hard disk. Ora ho
un problema. Cosa devo fare?

<p>&Egrave; sconsigliato usare i forum Debian (mailing list o IRC) per chiedere
aiuto perch&eacute; le persone daranno suggerimenti pensando che si stia usando
un sistema Debian e le "soluzioni" fornite potrebbero non essere adatte
alla distribuzione che si sta usando; potrebbero persino peggiorare il
problema.

<p>Usare prima i forum della distribuzione specifica che si sta usando. Se
non si ottiene aiuto o l'aiuto ottenuto non risolve il problema, si pu&ograve;
provare a chiedere nei forum Debian, ma tenere a mente l'avvertimento
dato nel paragrafo precedente.

<sect1>Sto usando Knoppix/Linex/Ubuntu/... e ora voglio usare
Debian. Come migro a Debian?

<p>Considerare il passaggio da una distribuzione basata su Debian a
Debian come qualsiasi altro passaggio da un sistema operativo ad un
altro. Si dovrebbe fare il backup di tutti i dati e reinstallare il
sistema operativo da zero. Non si deve cercare di "aggiornare" a Debian
usando gli strumenti di gestione dei pacchetti dato che ci si potrebbe
ritrovare con un sistema non funzionante.

<p>Se tutti i propri dati utente (cio&eacute; la propria <file>/home</file>) sono
in una partizione separata la migrazione a Debian &egrave; in realt&agrave; piuttosto
semplice, basta semplicemente dire al sistema di installazione di
montare (ma non riformattare) quella partizione al momento della
reinstallazione. &Egrave; sempre caldamente consigliato fare il backup di tutti i
propri dati oltre che della configurazione del sistema precedente (cio&egrave; <file>/etc/</file> e, forse, <file>/var/</file>).
