<!-- retain these comments for translator revision tracking -->
<!-- Original version: $Revision: 1.26 $ -->
<chapt id="getting">Ottenere ed installare &debian;

<p>La documentazione ufficiale con le istruzioni per l'installazione &egrave;
  la <url
id="http://www.debian.org/releases/stable/installmanual" name="Guida
  all'installazione di Debian GNU/Linux">. Qui vengono fornite alcune
  note aggiuntive su come ottenere ed installare &debian;.

<sect id="version">Qual &egrave; la versione pi&ugrave; recente di Debian?

<p>Attualmente ci sono tre versioni di &debian;:
<taglist>
  <tag><em/Il rilascio &release;, alias distribuzione "stable" o &releasename;/
    <item>Questo &egrave; software stabile e ben testato, cambia se vengono
    incorporate soluzioni a problemi di sicurezza e usabilit&agrave;.
 
  <tag><em/La distribuzione "testing", attualmente chiamata &testingreleasename;/
    <item>Qui &egrave; dove vengono messi i pacchetti che saranno rilasciati come prossima "stable";
    hanno stati testati un po' in unstable ma possono non essere ancora adatti ad essere
    rilasciati. Questa distribuzione &egrave; aggiornata pi&ugrave; frequentemente della "stable", ma non
    della "unstable".
  <tag><em/La distribuzione "unstable"/
    <item>Questa &egrave; la versione attualmente in fase di sviluppo; &egrave;
    aggiornata continuamente. Si possono recuperare i pacchetti dall'archivio
    "unstable" su ogni sito FTP Debian e usarli per aggiornare
    il proprio sistema in ogni momento, ma non bisogna aspettarsi che il sistema sia
    utilizzabile o stabile come prima: ecco perch&eacute; &egrave; chiamata
    "<strong/unstable (instabile)/"!
</taglist>

<p>Si veda <ref id="dists"> per maggiori informazioni.

<sect id="updatestable">Esistono aggiornamenti dei pacchetti in "stable"?

<p>Nessuna nuova funzionalit&agrave; viene aggiunta al rilascio stabile. Una
volta che una versione di Debian viene rilasciata ed etichettata come
"stable", avr&agrave; solo gli aggiornamenti di sicurezza. Cio&egrave; solo i
pacchetti in cui &egrave; stata trovata dopo il rilascio una vulnerabilit&agrave; in
termini di sicurezza saranno aggiornati. Tutti gli aggiornamenti di
sicurezza vengono forniti attraverso <url name="security.debian.org"
id="ftp://security.debian.org">.</p>

<p>Gli aggiornamenti di sicurezza servono ad un solo scopo: fornire
soluzioni per vulnerabilit&agrave; nella sicurezza. Non sono un metodo per
infiltrare cambiamenti ulteriori nel rilascio stabile senza passare
dalla normale procedura del punto di rilascio. Di conseguenza, le
soluzioni per i pacchetti con problemi di sicurezza non aggiornano il
software. Il Team per la sicurezza di Debian far&agrave; invece il backport
delle soluzioni necessarie nella versione del software distribuita in
"stable".</p>

<p>Per maggiori informazioni sul supporto per la sicurezza si legga la
<url name="Security FAQ" id="http://www.debian.org/security/faq"> o
il <url name="Debian Security Manual"
id="http://www.debian.org/doc/manuals/securing-debian-howto/">.

<sect id="boot-floppies">Dove/Come si possono trovare i dischi di installazione Debian?

<p>Si possono ottenere i dischi d'installazione scaricando i file
appropriati da uno dei <url name="mirror Debian"
id="http://www.debian.org/mirror/list">.

<p>Per maggiori informazioni sulle immagini di CD e DVD si faccia riferimento a <url name="Debian GNU/Linux su CD"
id="http://www.debian.org/CD">.

<sect id="cdrom">Come installare Debian da CD-ROM?

<p>Installare Debian da CD &egrave; semplicissimo: configurare il proprio
sistema in modo che si avvii da CD, inserire il CD e riavviare. Il
sistema avr&agrave; allora in esecuzione l'installatore Debian. Per maggiori
informazioni si veda la <url
id="http://www.debian.org/releases/stable/installmanual" name="Guida
all'installazione di Debian GNU/Linux">.

<sect id="cdimage-symlinks">Perch&eacute; il CD-ROM ufficiale del rilascio
"stable" contiene collegamenti simbolici "frozen" e "unstable"? Pensavo
che questo CD contenesse solo "stable"!

<p>Le immagini dei CD ufficiali di Debian contengono effettivamente
collegamenti simbolici quali:

<example>
 /dists/frozen -> &releasename;/
 /dists/stable -> &releasename;/
 /dists/testing -> &releasename;/
 /dists/unstable -> &releasename;/
</example>

<p>in modo da poter funzionare quando il file sources.list ha voci come

<example>
 deb cdrom:[&lt;nome come sull'etichetta del cd&gt;]/ unstable main
 [...]
</example>
.

<p>Il fatto che siano presenti questi collegamenti simbolici
<em>non</em> significa che l'immagine &egrave; di
"unstable" o "testing" o altro.  Si legga l'etichetta del CD in
<file>/.disk/info</file> per scoprire quale versione di Debian esso
contenga. Questa informazione &egrave; presente anche nel file
<file>/README.txt</file> sul CD.

<p>Si legga <url id="http://www.debian.org/releases/"> per scoprire
quali siano gli attuali rilasci "stable" e "testing".

<sect id="remoteinstall">&Egrave; possibile ottenere ed installare Debian direttamente da un sito
  Internet remoto?

<p>S&igrave;. Si pu&ograve; avviare il sistema di installazione Debian da un insieme di file
scaricabili dal nostro sito FTP e dai suoi mirror.

<p>Si pu&ograve; scaricare una piccola immagine di CD, creare da essa un CD avviabile,
installare da esso il sistema di base ed il resto dalla rete. Per maggiori informazioni
si veda <url id="http://www.debian.org/CD/netinst/">.

<p>Si possono anche scaricare dei file immagine di floppy disk ancora pi&ugrave; piccoli, creare
da essi dei dischetti avviabili, avviare la procedura di installazione ed ottenere il resto di
Debian dalla rete.

<sect id="alternativebootinstaller">Esistono strategie alternative per
avviare l'installatore di sistema?

<p>S&igrave;. Oltre che da CD o DVD, si pu&ograve; installare Debian GNU/Linux avviando da
dischetti floppy, penne USB, direttamente da hard disk o usando l'avvio
di rete TFTP. Per l'installazione su pi&ugrave; computer &egrave; possibile fare
installazioni completamente automatiche. N.B.: non tutti i metodi sono
supportati da tutte le architetture. Una volta avviato l'installatore,
il resto del sistema pu&ograve; essere scaricato dalla rete o installato da
supporti locali. Per maggiori informazioni si veda la <url
id="http://www.debian.org/releases/stable/installmanual" name="Guida
all'installazione di Debian GNU/Linux">.
