<!DOCTYPE debiandoc PUBLIC "-//DebianDoc//DTD DebianDoc//EN" [
 <!entity % shareddata   SYSTEM "../dselect-beginner.ent" > %shareddata;
]>

<!-- original revision: 1.24 -->

<!-- 
  Document conventions:
          Purpose:			Tag to use:
          -------------------------------------------------------------
          file, directory, partition	<file>
          program, command		<prgn>, <manref>
          program input and output	<tt>
          key input			<em>, <example> for longer ones
          variable			<var>
          package			<package>
-->

<!-- Corrected and completed translation by Joerg Jaspert joerg@debian.org -->
<!-- should be in sync with english version 1.24 -->

<debiandoc>
  <book>
    <titlepag>
      <title>
<prgn>dselect</prgn> Dokumentation f&uuml;r Anf&auml;nger
      <author>
        <name>St&eacute;phane Bortzmeyer und andere</name>
        <email>debian-doc@lists.debian.org</email>
      </author>
      <abstract>
Dieses Dokument enth&auml;lt eine kurze Anleitung f&uuml;r alle, die
<prgn>dselect</prgn>, das Debian-Paket-Verwaltungs-Frontend, zum ersten
Mal verwenden.  Es erg&auml;nzt <url name="Installation Manual for &debian;
&release;"
	  id="&url-install-manual;">.
      </abstract>
    </titlepag>

    <toc detail="sect1">

    <chapt id="intro">Einleitung

      <p>
Beachten Sie, dass neuere Versionen dieser Datei unter <url
id="&url-dselect-beginner;"> zu finden sind.</p>

      <p>
Diese Datei dokumentiert <prgn>dselect</prgn> f&uuml;r Einsteiger-User und
beabsichtigt, Ihnen bei der erfolgreichen Installation von Debian zu
helfen. Es versucht nicht, alles zu erkl&auml;ren, also lesen Sie die
Hilfe-Fenster wenn Sie <prgn>dselect</prgn> zum ersten Mal
verwenden.</p>

      <p>
Wenn Sie Debian so schnell wie m&ouml;glich zum laufen bekommen m&ouml;chten,
sollten Sie <prgn>dselect</prgn> nicht verwenden :-). Die Debian
Installationsprozedur erlaubt Ihnen das Programm <prgn>tasksel</prgn>
auszuf&uuml;hren, welches einige generelle Paketzusammenstellungen,
sogenannte Tasks, enth&auml;lt die Sie ausw&auml;hlen und installieren k&ouml;nnen.
</p>

      <p>
<prgn>dselect</prgn> wird verwendet um die Pakete auszuw&auml;hlen, die Sie
installieren m&ouml;chten (derzeit gibt es &num-of-distrib-pkgs; Pakete in
der Debian Version &release;).  Es l&auml;uft w&auml;hrend der
Installation und da es ein sehr m&auml;chtiges und auch komplexes Tool ist,
kann es f&uuml;r gutes und schlechtes verwendet werden; einige Vorkenntnisse
davon werden w&auml;rmstens empfohlen. Die achtlose Verwendung von
<prgn>dselect</prgn> kann Ihr System nachhaltig sch&auml;digen.</p>

      <p><prgn>dselect</prgn> f&uuml;hrt Sie wie folgt durch den Paket
      Installationsprozess:

<list>
	  <item>W&auml;hlen Sie die zu verwendende Zugriffsmethode.
	  <item>Update der Liste der verf&uuml;gbaren Pakete, wenn m&ouml;glich.
	  <item>Anfrage welche Pakete Sie auf Ihrem System haben m&ouml;chten.
	  <item>Installation und Upgrade der gew&uuml;nschten Pakete.
	  <item>Konfiguration aller unkonfigurierten Pakete.
	  <item>Entfernen ungewollter Software.
</list>

Nachdem ein Schritt erfolgreich beendet wurde kommen Sie zum n&auml;chsten.
F&uuml;hren Sie die Schritte der Reihe nach aus, ohne einen zu &uuml;berspringen.</p>

      <p>
Da und dort werden wir in diesem Dokument dar&uuml;ber sprechen, wie man eine
andere Shell &ouml;ffnet. Unter Linux k&ouml;nnen Sie 6 verschiedene Konsolen oder
Shells gleichzeitig haben. Wechseln Sie zwischen den einzelnen Shells
durch dr&uuml;cken der <em>Linken_Alt-Taste und F1</em> bis
<em>Linken_Alt-Taste undF6</em>, und loggen Sie sich in der neuen Shell
ein und arbeiten dort normal weiter.  Die
Konsole, welche vom Installationsproze&szlig; verwendet wird, ist Konsole 1,
auch bekannt als tty1, dr&uuml;cken Sie also <em>Linke_Alt-Taste undF1</em>
wenn Sie zu diesem Prozess zur&uuml;ckkehren m&ouml;chten.</p>
    </chapt>

    <chapt id="main">Nachdem <prgn>dselect</prgn> gestartet wurde
      <p>
Nachdem Sie in <prgn>dselect</prgn> sind, kommt folgender Bildschirm:

<example>
Debian `dselect' Paket-Verwaltungs-Frontend.

   0. [A]ccess    W&auml;hlen Sie die gew&uuml;nschte Zugangsmethode.
   1. [U]pdate    Update der verf&uuml;gbaren Pakete, wenn m&ouml;glich. 
   2. [S]elect    Anfrage welche Pakete Sie auf Ihrem System m&ouml;chten.
   3. [I]nstall   Installation und  Upgrade der gew&uuml;nschten Pakete. 
   4. [C]onfig    Konfiguration von unkonfigurierten Paketen. 
   5. [R]emove    Entfernen unerw&uuml;nschter Software.
   6. [Q]uit      dselect beenden.

[some other stuff]
</example>

Lassen Sie uns diese einen nach dem anderen ansehen.</p>

      <sect id="access">``Access''
	<p>
Das ist der Zugangs-Bildschirm:

<example>
dselect - Liste der Zugangsmethoden
  Abbrev.        Beschreibung
  cdrom          Installation von CD-ROM.
* multi_cd       Installation von CD-ROM Set.
  nfs            Installation von einem NFS Server (noch nicht gemounted).
  multi_nfs      Installation von einem NFS Server (CD-ROM Set verwenden) (noch nicht gemounted).
  harddisk       Installation von einer Festplattenpartition (noch nicht gemounted).
  mounted        Installation von einem bereits gemounteten Dateisystem.
  multi_mount    Installation von einer gemmounteten Partition mit wechselndem Inhalt.
  floppy         Installation von Disketten.
  apt            APT Acquisition [Datei,http,ftp]
</example></p>

	<p>
Hier teilen wir <prgn>dselect</prgn> mit wo sich unsere Pakete
befinden. Ignorieren Sie die Reihenfolge in der Sie erscheinen. Es ist
sehr wichtig, dass Sie die richtige Installationsmethode w&auml;hlen.  Sie
m&ouml;gen einige weitere Methoden aufgelistet bekommen, oder weniger, oder
in einer anderen Reihenfolge; Machen Sie sich deshalb keine Sorgen.  In
der folgenden Liste beschreiben wir die verschiedenen Methoden:</p>

<p><taglist>
	    <tag>apt</tag>
	    <item><p>
Eine der besten Optionen um von einem lokalen Mirror des
Debian Archivs oder &uuml;bers Netzwerk zu installieren.  Diese Methode
verwendet das ``apt'' (siehe auch <manref name="apt" section="8">)
System um eine komplete Analyse der Abh&auml;ngigkeiten und Reihenfolgen zu
erstellen, darum ist es sehr wahrscheinlich dass die Pakete in der optimalen
Reihenfolge installiert werden.</p>

	      <p>
Die Konfiguration dieser Methode ist einfach und eindeutig. Sie k&ouml;nnen
eine beliebige Anzahl verschiedener Quellen, ob lokal mit <tt>file</tt>
URLS (lokale Festplatte, NFS Verzeichniss), <tt>http</tt> URLS oder
<tt>ftp</tt> URLs verwenden. Sie k&ouml;nnen mit <prgn/apt-cdrom/ auch
CD-ROM/DVD Medien zur Installation nutzen.</p>
	      <p>
Bitte lesen Sie auch das <manref name="sources.list" section="5">
Handbuch f&uuml;r weitere Informationen &uuml;ber das Format der
<file>/etc/apt/sources.list</file> Datei.</p>

<p>Wenn Sie einen Proxy Server f&uuml;r HTTP oder FTP (oder f&uuml;r beides) haben,
vergewissern Sie sich, dass Sie die <tt>http_proxy</tt> oder
<tt>ftp_proxy</tt> Variablen gesetzt haben.  Setzen Sie diese von Ihrer
Shell aus, bevor Sie dselect starten, z.B.:
<example>
# export http_proxy=http://gateway:3128/
# dselect
</example></p>
	    </item>
	    
	    <tag>multi_cd</tag>
	    <item>
<p>
Ziemlich gross und kraftvoll, allerdings ist diese komplexe Methode der
anzuratende Installationsweg f&uuml;r Debian mit einem CD-Set. Jede dieser
CD's sollte Informationen &uuml;ber die Pakete auf ihr und in allen anderen
fr&uuml;heren CD's enthalten (in der Datei <file>Packages.cd</file>).  Wenn
Sie diese Methode zum ersten Mal verwenden, seien Sie sicher, dass die
verwendete CD-ROM nicht gemounted ist.  Legen Sie die letzte
<em>binary</em> Disk des Sets (wir ben&ouml;tigen nicht die Source-CD's) ins
Laufwerk und beantworten Sie die Ihnen gestellten Fragen:
<list>
		  <item>Ort des CD-ROM Laufwerks
		  <item>Best&auml;tigung dass Sie ein Multi-CD Set verwenden
		  <item>Den Ort der Debian Distribution auf den Disketten
		  <item>[ Optional ] Den Ort der Paket-Dateien
</list></p>
	      <p>
Nachdem Sie die verf&uuml;gbare Liste aktualisiert und die zu installierenden
Pakete ausgew&auml;hlt haben, unterscheidet sich die Multi-CD Methode von der
normalen Prozedur. Sie m&uuml;ssen f&uuml;r jede CD einmal "[I]nstall" ausw&auml;hlen.
Ungl&uuml;cklicherweise, durch die Limitierung von dselect, ist es
nicht m&ouml;glich Sie nach jedem Schritt aufzufordern eine neue Disk
einzulegen; gehen Sie folgendermassen vor

<list>
		  <item>Legen Sie die CD in Ihr CD-ROM Laufwerk.
		  <item>W&auml;hlen Sie "Installieren" im dselect Men&uuml;.
		  <item>Warten Sie bis dpkg die Installation von dieser CD
	abgeschlossen hat (es kann Installation erfolgreich oder
	m&ouml;gliche Fehler bei der Installation liefern. Machen Sie sich
	&uuml;ber diese derzeit keine Gedanken).
	  <item>Dr&uuml;cken Sie [<em>Enter</em>] um zum dselect Hauptmen&uuml; zur&uuml;ckzugelangen. </p>
		  <item>Wiederholen Sie mit der n&auml;chsten CD im Set...
</list></p>
	      <p>
Es kann notwendig sein, den Installationsvorgang mehr als einmal
auszuf&uuml;hren um die Reihenfolge der Paketinstallation zu gew&auml;hrleisten -
manche, fr&uuml;her installierte Pakete k&ouml;nnten sp&auml;ter installierte Pakete
ben&ouml;tigen um ordnungsgem&auml;&szlig; konfiguriert zu werden.</p>
	      <p>
Einen ``[C]onfigure'' Schritt zu machen wird empfohlen, um Pakete,
welche in diesem Stadium gescheitert sind, zu reparieren.</p>
	    </item>

	    <tag>multi_nfs, multi_mount</tag>
	    <item><p>
Diese sind der Multi_Cd Methode sehr &auml;hnlich und sind Verfeinerungen des
Themas Kopieren mit wechselnden Datentr&auml;gern, zum Beispiel wenn Sie von
einem Multi-Cd Set installieren, welches via NFS von dem CD-ROM Laufwerk
einer anderen Maschine installiert wird.</p>
	    </item>

	    <tag>floppy</tag>
	    <item>
<p>	      F&uuml;r Leute ohne CD-ROM Laufwerk oder Netzwerkzugang. Nicht
mehr als funktionsf&auml;hige Installations Option anzuraten, wenn Sie
traditionelle Disketten verwenden, sollte aber mit LS/120 oder
Zip-Laufwerken noch gehen. Spezifizieren Sie den Ort Ihres
Diskettenlaufwerks, danach legen Sie die Disketten ein. Die erste sollte
die Paketdateien enthalten.  Diese Methode ist langsam und k&ouml;nnte f&uuml;r
Media-Probleme unzuverl&auml;ssig sein.</p>
	    </item>

<![ IGNORE [ <tag>ftp</tag>
	    <item>
<strong>ABGELEHNTE METHODE -- verwenden Sie stattdessen apt. Versuchen Sie diese Methode nur wenn alles andere
fehlschl&auml;gt!</strong>
	      <p>

Sie werden aufgefordert die Adresse eines FTP-Servers, ob Sie Passives FTP (f&uuml;r FTP
&uuml;ber einen Proxy) verwenden m&ouml;chten, eine Username/Passwort Kombination, den Pfad zum Debian
Verzeichnis, die Liste der Distributionen die Sie m&ouml;chten und einen Platz um die Paketdateien
herunterzuladen (relativ zu /var/lib/dpkg/methods/ftp)., anzugeben.
	      <p>
Das Setup Skript wird dann sofort versuchen, eine Verbindung zum Remote Server herzustellen und die Paketdateien etc. zu holen,
danach wird dselect die Verbindung beim Starten der Installation erneut aufbauen.
	      <p>
Wenn Sie &uuml;ber eine Firewall arbeiten m&uuml;ssen, sollte diese Methode gut funktionieren und sie ist ideal f&uuml;r Personen
mit wenig lokalem Speicherplatz.]]>

<![ IGNORE [ <tag>http</tag>
	    <item>
<strong>ABGELEHNTE METHODE -- verwenden Sie stattdessen apt. Versuchen Sie diese Methode nur wenn alles andere
fehlschl&auml;gt!</strong>
	      <p>
Wie `FTP', verwendet allerdings eine Mischung aus <tt>http:</tt>,
<tt>ftp:</tt> und <tt>file:</tt> URIs um die Debian Dateien zu finden. Sie k&ouml;nnen sie verwenden, um unterschiedliche
Proxies f&uuml;r <tt>http:</tt> und <tt>ftp:</tt> URIs zu verwenden, wenn notwendig. Sehr n&uuml;tzlich, wenn ein lokaler Proxy
die Paketdateien f&uuml;r mehrere User zwischenspeichert, oder wenn der Mirror nur HTTP Zugriff und kein FTP erlaubt.]]>

	    <tag>nfs</tag>
	    <item><p>
<strong>ABGELEHNTE METHODE -- verwenden Sie stattdessen apt oder multi_nfs. Versuchen Sie diese Methode nur wenn alles andere
fehlschl&auml;gt!</strong></p>
	      <p>
Dies ist eine einfache Installationsmethode, mit einfachen
Anforderungen: geben Sie die Adresse des NFS-Servers an, den Ort der
Debian Distribution auf dem Server und (m&ouml;glicherweise) die
Paketdatei(en). Danach wird <prgn>dselect</prgn> die einzelnen Sektionen
vom Server installieren. Langsam, aber einfach; verwendet nicht die
richtige Reihenfolge, daher ben&ouml;tigt es mehrere Durchl&auml;ufe des
``[I]nstall'' und/oder des ``[C]onfigure'' Schrittes.
Offensichtlich nur f&uuml;r NFS basierte Installationen.</p>
	    </item>

	    <tag>Festplatte</tag>
	    <item><p>
<strong>ABGELEHNTE METHODE -- verwenden Sie stattdessen apt oder
multi_mount. Versuchen Sie diese Methode nur wenn alles andere
fehlschl&auml;gt!</strong></p>
	      <p>
Geben Sie das Laufwerk, welches verwendet werden soll, an und den Ort
der Debiandateien auf dieser Partition.  Langsam und einfach. Verwendet
nicht die richtige Reihenfolge, daher ben&ouml;tigt es mehrere Durchl&auml;ufe des
``[I]nstall'' und/oder des ``[C]onfigure'' Schrittes.  Nicht
anzuraten, weil die `apt'' Method diese Funktionalit&auml;t unterst&uuml;tzt, mit
der richtigen Reihenfolge.</p>
	    </item>

	    <tag>mounted</tag>
	    <item><p>
<strong>ABGELEHNTE METHODE -- verwenden Sie stattdessen apt oder
multi_mount. Versuchen Sie diese Methode nur wenn alles andere
fehlschl&auml;gt!</strong></p>
	      <p>
Spezifizieren Sie nur den/die Ort(e) der Debiandateien in Ihrem
Dateisystem. M&ouml;glicherweise die einfachste Methode, aber
langsam. Verwendet nicht die richtige Reihenfolge, daher ben&ouml;tigt es
mehrere Durchl&auml;ufe des ``[I]nstall'' und/oder des ``[C]onfigure''
Schrittes.</p>
	    </item>

<![ IGNORE [ <tag>mountable</tag>
	    <item>
<strong>ABGELEHNTE METHODE -- verwenden Sie stattdessen apt oder multi_mount. Versuchen Sie diese Methode nur wenn alles andere
fehlschl&auml;gt!</strong>
	      <p>
Eine komplexere Methode als ``mounted'', und ein gutes St&uuml;ck schneller -- es durchsucht nur die ben&ouml;tigten Pakete.
Es gibt Ihnen mehr Kontrolle &uuml;ber die Installations Optionen als andere Methoden, ben&ouml;tigt aber mehr Setup.  ]]>

	    <tag>cdrom</tag>
	    <item><p>
<strong>ABGELEHNTE METHODE -- verwenden Sie stattdessen multi_cd. Dies
Methode funktioniert nicht mit multiplen CD-Sets, so wie die in Debian
&release; inkludierten.</strong></p>
	      <p>
Designed f&uuml;r Single-CD installationen, fragt Sie diese einfache Methode
nach dem Ort Ihres CD-ROM Laufwerkes, dem Ort der Debian Distribution
auf der Disk und danach (wenn notwendig) dem Ort der Paketdatei(en) auf
der Disk.  Simpel aber ziemlich langsam. verwendet nicht die richtige
Reihenfolge, daher ben&ouml;tigt es mehrere Durchl&auml;ufe des ``[I]nstall''
und/oder des ``[C]onfigure'' Schrittes.  Nicht anzuraten, weil es
annimmt, dass sich die Distribution auf einer einzelnen CD-ROM befindet,
was nicht mehr der Fall ist.  Verwenden Sie stattdessen die `multi_cd''
Methode.
</p>
	    </item>
	  </taglist>

	<p>
Sollten Sie Probleme haben -- vielleicht kann Linux Ihre CD-ROM nicht lesen,
Ihr NFS-Mount funktioniert nicht oder Sie haben vergessen auf welcher Partition sich die 
Pakete befinden -- haben Sie mehrere M&ouml;glichkeiten:

<list>
	    <item>
	      &Ouml;ffnen Sie eine weitere Shell. L&ouml;sen Sie das Problem und wechseln Sie danach zur&uuml;ck zur Haupt Shell.
	    <item>
	      Beenden Sie <prgn>dselect</prgn> und f&uuml;hren Sie es sp&auml;ter
erneut aus. M&ouml;glicherweise m&uuml;ssen Sie auch, um das Problem zu l&ouml;sen, den
Computer herunterfahren. Das ist in Ordnung, wenn Sie allerdings
<prgn>dselect</prgn> wieder starten, machen Sie dies als Root. Es
startet nach dem ersten Mal aber nicht mehr automatisch.
</list>

	<p>
Nachdem Sie die Zugangsmethode gew&auml;hlt haben, fordert Sie
<prgn>dselect</prgn> auf, den pr&auml;zisen Ort der Pakete anzugeben. Wenn
das nicht beim ersten Versuch klappt, dr&uuml;cken Sie <em>Control-C</em> und
wechseln Sie zur&uuml;ck zum ``Access'' Men&uuml;.

	<p>
Nachdem Sie hier fertig sind, kommen Sie zur&uuml;ck zum Haupt-Bildschirm.

      <sect id="update">``Update''
	<p>
<prgn>dselect</prgn> liest die <file>Packages</file> oder die
<file>Packages.gz</file> Dateien von Ihrem Mirror und erstellt eine
Datenbank auf Ihrem System mit allen verf&uuml;gbaren Paketen. Das kann
einige Zeit in Anspruch nehmen.

      <sect id="select">``Select''
	<p>
Bleiben Sie am Ball. Hier passiert alles. Das Ziel dieses Schrittes ist
die Auswahl der zu installierenden Pakete.</p>
	<p>
Dr&uuml;cken Sie <em>Enter</em>. Wenn Sie eine langsame Maschine haben, kann es
passieren, dass der Bildschirm leer wird und f&uuml;r 15 Sekunden schwarz
bleibt, dr&uuml;cken Sie dann nicht auf irgendwelche Tasten, sondern bleiben
Sie ruhig.</p>
	<p>
Das erste, was am Bildschirm erscheint, ist die Seite 1 der Hilfedatei.
Sie kommen zu jeder Zeit in die Hilfe durch dr&uuml;cken von <em>?</em> im
``Select'' Bildschirm und bl&auml;ttern durch die Hilfe Bildschirme durch
Dr&uuml;cken der <em>.</em> (Punkt) Taste.</p>
	<p>
Bitte seien Sie vorbereitet, eine Stunde oder so zu investieren, um
damit umgehen zu k&ouml;nnen. Wenn Sie zum ersten Mal in den ``Auswahl''
Bildschirm wechseln, treffen Sie <strong>KEINE</strong> Auswahl --
dr&uuml;cken Sie nur <em>Enter</em> und sehen Sie sich die Abh&auml;ngigkeitsprobleme
an. Versuchen Sie diese zu l&ouml;sen.  Wenn Sie zur&uuml;ck zum Hauptbildschirm
kommen, gehen sie nochmal ins <ref id="select">.</p>
	<p>
Bevor Sie tiefer eintauchen, beachten Sie diese zwei Punkte:
<list>
    <item>
	      Um den ``Select'' Bildschirm, nachdem alle Einstellungen
gemacht wurden, wieder zu schlie&szlig;en, dr&uuml;cken Sie <em>Enter</em>. Dadurch
kehren Sie, sofern es keine Probleme mit der getroffenen Auswahl gibt,
zum Hauptbildschirm zur&uuml;ck. Andernfalls werden Sie aufgefordert, das
Problem zu beheben. Wenn Sie mit allen gezeigten Bildschirmen
zufrieden sind, dr&uuml;cken Sie <em>Enter</em> um auszusteigen.
	    <item>
	      Probleme sind normal und k&ouml;nnen durchaus erwartet
werden. Wenn Sie Paket <var>A</var> ausw&auml;hlen und dieses Paket ben&ouml;tigt
Paket <var>B</var> um zu funktionieren, dann warnt <prgn>dselect</prgn> Sie und
wird Ihnen normalerweise auch eine L&ouml;sung vorschlagen. Wenn das Paket
<var>A</var> mit dem Paket <var>B</var> in Konflikt steht (d.h., wenn
Sie sich gegenseitig ausschlie&szlig;en) werden Sie aufgefordert sich zwischen
den beiden zu entscheiden
</list></p>

<p>Lassen Sie uns die zwei obersten Zeilen des ``Select'' Bildschirms
ansehen.

<example>
dselect - Liste des Hauptpakets (Verf&uuml;gbark., Wichtigkeit)    mark:+/=/- verbose:v help:?
EIOM Pri Sektion  Paket      Inst.Ver    Verf&uuml;gbark.ver   Beschreibung
</example></p>

<p>
Dieser Header erinnert uns an einige der Spezialtasten:

<taglist>
	    <tag><tt>+</tt>
	    <item>
	      Ein Paket f&uuml;r die Installation ausw&auml;hlen.

	    <tag><tt>=</tt>
	    <item>
	      Setzen Sie ein Paket auf hold -- n&uuml;tzlich bei kaputten
Paketen. Sie k&ouml;nnen eine &auml;ltere Version erneut installieren und Sie auf
hold setzen, w&auml;hrend Sie auf das Erscheinen der neuen Version warten.
(Diese Dinge passieren mit einem stabilen Debian System selten.)

	    <tag><tt>-</tt> Entfernen eines Pakets.

	    <tag><tt>_</tt>
	    <item>
	      Ein Paket komplett entfernen: Entfernen des Pakets und der
	      Konfigurationsdatei.

	    <tag><tt>i,I</tt>
	    <item>
	      Zwischen den Konsolen wechseln (im unteren Teil des
	      Bildschirms).

	    <tag><tt>o,O</tt>
	    <item>
	      Zwischen den Sortieroptionen w&auml;hlen (im oberen Teil des
	      Bildschirms).

	    <tag><tt>v,V</tt>
	    <item>
	      Ein pr&auml;gnanter/wortreicher Schalter. Wenn Sie diese Taste
dr&uuml;cken, finden Sie heraus was die Buchstaben EIOM in der zweiten Zeile
bedeuten. Hier ist eine Zusammenfassung:
<example>
Flag   Bedeutung            M&ouml;gliche Werte
E      Fehler               Space, R, I
I      Installierter Status Space, *, -, U, C, I
O      Altes Zeichen        *, -, =, _, n
M      Zeichen              *, -, =, _, n
</example>
(Beachten Sie, dass Gross- und Kleinschreibung relevant ist.)
	  </taglist></p>

	<p>
Anstatt dies alles hier auszusprechen, verweise ich Sie auf die Hilfe
Bildschirme, wo Ihnen das alles erkl&auml;rt wird.  Ein Beispiel:</p>
<p>
Sie starten <prgn>dselect</prgn> und sehen eine Zeile wie diese:

<example>
EIOM Pri  Sektion  Paket     Beschreibung
  ** Opt  misc     loadlin   ein Ladeprogramm (l&auml;uft unter DOS) f&uuml;r LINUX kernels
</example></p>
<p>
Das bedeutet, dass loadlin ausgew&auml;hlt war, als Sie <prgn>dselect</prgn>
das letzte Mal gestartet haben und dass es noch immer ausgew&auml;hlt ist,
aber es ist nicht installiert. Warum nicht?  Die Antwort kann nur sein,
dass das loadlin-Paket physisch nicht vorhanden ist, das bedeutet es
muss in Ihrem Mirror fehlen.</p>
	<p>
Die Information welche <prgn>dselect</prgn> verwendet um die richtigen
Pakete zu installieren ist in den Paketdateien vergraben (die Sachen,
welche Sie im Schritt [U]pdate heruntergeladen haben). Diese Dateien
werden von den Paketen selbst generiert.</p>
	<p>
Nichts auf der Welt ist perfekt und deshalb passiert es manchmal, dass
die Abh&auml;ngigkeiten der Pakete inkorrekt sind, was zu einer Situation
f&uuml;hren kann, die <prgn>dselect</prgn> einfach nicht l&ouml;sen kann. Wie auch
immer, Sie k&ouml;nnen aus so einer Schleife entkommen, indem Sie <em>Q</em>
und <em>X</em> dr&uuml;cken.


<taglist>
	    <tag><em>Q</em>
	    <item>
	      Eine &Uuml;berbr&uuml;ckung. Zwingt <prgn>dselect</prgn>, die
vorhandenen Abh&auml;ngigkeiten zu ignorieren und dass zu tun, was Sie
spezifiziert haben. Das k&ouml;nnte sich nat&uuml;rlich auch als keine gute Idee
herausstellen.

  <tag><em>X</em>
	    <item>
	      Verwenden Si <em>X</em> wenn Sie total verloren sind. Es
	      setzt die Dinge auf den Anfangsstand zur&uuml;ck und beendet
	      das Programm.

</taglist></p>

	      <p>
Tasten, welche Ihnen helfen <em>nicht</em> verloren zu gehen (!) sind
<em>R</em>, <em>U</em> und <em>D</em>.

<taglist>
	    <tag><em>R</em>
	    <item>
	      L&ouml;scht jede Auswahl in diesem Bereich. Wirkt sich nicht
	      auf eine vorherige Auswahl aus.

	    <tag><em>U</em>
	    <item>
	      Wenn <prgn>dselect</prgn> &Auml;nderungen vorgeschlagen hat und
Sie weitere &Auml;nderungen vorgenommen haben, stellt <em>U</em> die
Einstellungen von <prgn>dselect</prgn> wieder her.

	    <tag><em>D</em>
	    <item>
	      Entfernt die von <prgn>dselect</prgn> getroffene Auswahl
	      und beh&auml;lt nur die von Ihnen ausgew&auml;hlten.
</taglist></p>

	<p>
Ein Beispiel folgt. Das <package>xmms</package> Paket (ausgew&auml;hlt weil
es eine Menge Abh&auml;ngigkeiten hat) ist abh&auml;ngig von diesen Paketen:

<list>
	    <item><package>libc6</package>
	<item><package>libglib1.2</package>
	<item><package>libgtk1.2</package>
	<item><package>xlibs</package>
</list></p>

	<p>
Die folgenden Pakete sollten ebenfalls installiert sein. Diese sind
nicht unbedingt notwendig:

<list>
	<item><package>libaudiofile0</package>
	<item><package>libesd0</package> 
        <item><package>libgl1</package>
	<item><package>libmikmod2</package>
	<item><package>libogg0</package>
	<item><package>libvorbis0</package>
	<item><package>libxml1</package>
        <item><package>zlib1g</package>
</list>
</p>
<!-- We'll ignore the Suggests: line for the sake of brevity. -->

	<p>
Wenn ich also das <package>xmms</package> Paket ausw&auml;hle, bekomme ich
folgenden Bildschirm:

<example>
dselect - recursive package listing                  mark:+/=/- verbose:v help:?
EIOM Pri Section  Package      Description
  _* Opt sound    xmms         Versatile X audio player that looks like Winamp
  _* Opt libs     libglib1.2   The GLib library of C routines
  _* Opt libs     libgtk1.2    The GIMP Toolkit set of widgets for X
  _* Opt libs     libmikmod2   A portable sound library
  _* Opt libs     libogg0      Ogg Bitstream Library
  _* Opt libs     libvorbis0   The OGG Vorbis lossy audio compression codec.
</example>

(Andere Pakete k&ouml;nnen erscheinen, abh&auml;ngig davon was sich bereits auf
Ihrem System befindet).  Sie werden bemerken, dass alle ben&ouml;tigten
Pakete f&uuml;r mich ausgew&auml;hlt wurden, zusammen mit den empfohlenen.</p>
	
	<p>
Die <em>R</em> Taste stellt die Einstellungen auf den Anfangswert
zur&uuml;ck.

<example>
dselect - recursive package listing                  mark:+/=/- verbose:v help:?
EIOM Pri Section  Package      Description
  __ Opt sound    xmms         Versatile X audio player that looks like Winamp
  __ Opt libs     libglib1.2   The GLib library of C routines
  __ Opt libs     libgtk1.2    The GIMP Toolkit set of widgets for X
  __ Opt libs     libmikmod2   A portable sound library
  __ Opt libs     libogg0      Ogg Bitstream Library
  __ Opt libs     libvorbis0   The OGG Vorbis lossy audio compression codec.
</example>

Um zu entscheiden, dass Sie das <package>xmms</package> Paket nicht
m&ouml;chten, dr&uuml;cken Sie <em>Enter</em>.</p>

	<p>
Die <em>D</em> Taste stellt Dinge so wie sie zum ersten Mal ausgew&auml;hlt
waren:

<example>
dselect - recursive package listing                  mark:+/=/- verbose:v help:?
EIOM Pri Section  Package      Description
  _* Opt sound    xmms         Versatile X audio player that looks like Winamp
  __ Opt libs     libglib1.2   The GLib library of C routines
  __ Opt libs     libgtk1.2    The GIMP Toolkit set of widgets for X
  __ Opt libs     libmikmod2   A portable sound library
  __ Opt libs     libogg0      Ogg Bitstream Library
  __ Opt libs     libvorbis0   The OGG Vorbis lossy audio compression codec.
</example></p>

	<p>
Die <em>U</em> Taste stellt die <prgn>dselect</prgn> Auswahl wieder her:

<example>
dselect - recursive package listing                  mark:+/=/- verbose:v help:?
EIOM Pri Section  Package      Description
  _* Opt sound    xmms         Versatile X audio player that looks like Winamp
  _* Opt libs     libglib1.2   The GLib library of C routines
  _* Opt libs     libgtk1.2    The GIMP Toolkit set of widgets for X
  _* Opt libs     libmikmod2   A portable sound library
  _* Opt libs     libogg0      Ogg Bitstream Library
  _* Opt libs     libvorbis0   The OGG Vorbis lossy audio compression codec.
</example></p>


	<p>
Ich schlage vor, jetzt die vorgegebenen Einstellungen zu verwenden --
Sie haben reichlich M&ouml;glichkeiten sp&auml;ter weitere hinzuzuf&uuml;gen.</p>
	<p>
Wie auch immer Sie sich entscheiden, dr&uuml;cken Sie <em>Enter</em> um zu
akzeptieren und kehren Sie zum Hauptbildschirm zur&uuml;ck.  Wenn dies zu
ungel&ouml;sten Problemen f&uuml;hrt, kommen Sie automatisch in einen anderen
Problem-L&ouml;sungs-Bildschirm.</p>
	<p>
Die <em>R</em>, <em>U</em>, und <em>D</em> Tasten sind sehr hilfreich in
``was w&auml;re wenn'' Situationen.  Sie k&ouml;nnen beliebig experimentieren und
dann alles wiederherstellen und von neuem beginnen. Sehen Sie sie aber
<em>nicht</em> als Glaskasten mit der Aufschrift ``Bei Gefahr
einschlagen.''</p>
	<p>
Nachdem Sie Ihre Auswahl im ``Select'' Bildschirm getroffen haben,
dr&uuml;cken Sie die <em>I</em> Taste um ein grosses Fenster anzuzeigen,
<em>t</em> um zum Anfang zur&uuml;ckzukommen und danach verwenden Sie die
<em>Page-Down</em> Taste um sich schnell Ihre Einstellungen
anzusehen. Auf diesem Weg k&ouml;nnen Sie die Resultate Ihrer Arbeit sehen
und eklatante Fehler erkennen.  Einige Leute haben unabsichtlich ganze
Gruppen von Paketen de-selektiert und den Fehler erst bemerkt als es
bereits zu sp&auml;t war. <prgn>dselect</prgn> ist ein <em>sehr</em>
m&auml;chtiges Tool, also verwenden Sie es sorgf&auml;ltig.</p>

	<p>
Sie sollten nun diese Situation haben:

<example>
package category     status

required             all selected
important            all selected
standard             mostly selected
optional             mostly deselected
extra                mostly deselected
</example></p>

	<p>
Gl&uuml;cklich? Dr&uuml;cken Sie <em>Enter</em> um den ``Select'' Prozess zu
beenden. Sie k&ouml;nnen zur&uuml;ckgehen und ``Select'' nochmals ausf&uuml;hren wenn
Sie m&ouml;chten.</p>
      </sect>

      <sect id="install">``Install''
	<p>
<prgn>dselect</prgn> l&auml;uft w&auml;hrend der gesamten Installation von
&num-of-distrib-pkgs; Paketen und installiert die ausgew&auml;hlten. Erwarten
Sie, dass Sie einige Entscheidungen treffen m&uuml;ssen.</p>
	<p>
Der Bildschirm scrollt ziemlich schnell auf einer schnellen
Maschine. Sie k&ouml;nnen ihn Stoppen/Starten mit der Taste
<em>Control-s</em>/<em>Control-q</em> und am Ende bekommen Sie eine
Liste aller nichtinstallierten Pakete.  Wenn Sie eine Aufzeichnung &uuml;ber
alles was passiert behalten m&ouml;chten, verwenden Sie die gebr&auml;uchlichen
Unix Programme, wie zum Beispiel <manref name="tee" section="1"> oder
<manref name="script" section="1">.</p>
	<p>
Es kann passieren, dass ein Paket nicht installiert werden kann, da es
von einem anderen zu installierenden, jedoch noch nicht installiertem
Paket, abh&auml;ngig ist. Die L&ouml;sung daf&uuml;r ist "Install" nochmals laufen zu
lassen.  Es wurde beobachtet das es manchmal notwendig war es 4 mal
laufen zu lassen bis alles gepasst hat. Dies h&auml;ngt von Ihrer
Erfassungsmethode ab; mit der APT-Methode werden Sie normalerweise
"Install" nicht nocheinmal ausf&uuml;hren m&uuml;ssen.</p>
      </sect>

      <sect id="configure">``Configure''
	<p>
Die meisten Pakete wurden in Schritt 3 konfiguriert, ausstehende k&ouml;nnen
nun hier konfiguriert werden.</p>
      </sect>

      <sect id="remove">``Remove''
	<p>
Entfernt installierte, jedoch nicht l&auml;nger ben&ouml;tigte Pakete.</p>
      </sect>

      <sect id="quit">``Quit''
	<p>
Verl&auml;sst <prgn>dselect</prgn>.</p>
	<p>
Ich schlage vor, <file>/etc/cron.daily/find</file> zu diesem Zeitpunkt
auszuf&uuml;hren, da Sie eine Menge neuer Dateien auf Ihrem System
haben. Danach k&ouml;nnen Sie <prgn>locate</prgn> verwenden um irgendwelche
Dateien zu finden.</p>
      </sect>
    </chapt>

    <chapt id="conclusion">Ein paar Hinweise zum Abschlu&szlig;
      <p>
Sie bekommen einen &Uuml;berblick &uuml;ber die Gr&ouml;&szlig;e eines Paketes durch
zweimaliges dr&uuml;cken von <em>i</em> und ansehen des Feldes "Gr&ouml;&szlig;e". Das
ist die Gr&ouml;&szlig;e des komprimierten Paketes, das heisst, das unkomprimierte
Pakete ist um einiges gr&ouml;&szlig;er (siehe auch ``Installed-Size'', Angabe in
Kilo-bytes, um sie zu erfahren).</p>
      <p>
Die Installation eines neuen Debian Systems ist eine relativ komplexe
Aufgabe, aber <prgn>dselect</prgn> kann Ihnen dabei helfen, wenn Sie
sich die Zeit nehmen um zu lernen wie man es handhabt.  Lesen Sie die
Hilfeseiten und experimentieren Sie mit <em>i, I, o,</em> und
<em>O</em>. Verwenden Sie die <em>R</em> Taste. Es ist alles da, aber es
liegt an Ihnen es effektiv zu nutzen.</p>
    </chapt>

    <chapt id="glossary">Glossar
      <p>
Die nachfolgenden Ausdr&uuml;cke sind generell hilfreich f&uuml;r Sie, vor
allem wenn Sie Debian installieren.

<taglist>

	  <tag>Paket, Package
	<item>
	    Eine Datei, welche alles beinhaltet um ein spezielles
	    Programm zu installieren und auszuf&uuml;hren.
	<p>
Debian Packete haben das <var>.deb</var> als Suffix. Jedes Paket hat
einen Namen und eine Version.  Die Version besteht aus der realen
Version (`upstream') und der Debian &Uuml;berarbeitung - getrennt durch einen
Bindestrich (`-').</p>
	<p>
Hier sind einige Beispiele f&uuml;r Namen von Paketen:
	<list>
		<item><file>efax_08a-1.deb</file>
	  <item><file>lrzsz_0.12b-1.deb</file>
	  <item><file>mgetty_0.99.2-6.deb</file>
	  <item><file>minicom_1.75-1.deb</file>
	  <item><file>term_2.3.5-5.deb</file>
	  <item><file>uucp_1.06.1-2.deb</file>
	  <item><file>uutraf_1.1-1.deb</file>
	  <item><file>xringd_1.10-2.deb</file>
	  <item><file>xtel_3.1-2.deb</file>
	</list></p>

    <tag>dpkg
	<item>
	    Das Programm, welches Pakete behandelt, heisst
<prgn>dpkg</prgn>.  <prgn>dselect</prgn> ist ein Frontend f&uuml;r
<prgn>dpkg</prgn>.  Erfahrene Benutzer verwenden oft <prgn>dpkg</prgn>
um Pakete zu installieren oder zu entfernen da es schneller ist.

    <tag>Paket Scripte, Maintainer scripts
	<item>
	    Die Programme (normalerweise Shell Scripts) welche dpkg vor
und nach der Installation jedes Paketes aufruft. Sie sind normalerweise
versteckt, allerdings k&ouml;nnen manche Warnungen anzeigen oder Fragen
stellen.

</taglist></p>
    </chapt>
  </book>


<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:nil
sgml-shorttag:t
sgml-namecase-general:t
sgml-general-insert-case:lower
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:2
sgml-indent-data:nil
sgml-parent-document:nil
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
-->
