Repository: lurdan/trans-ddp
Catalog: release-notes/*/about.po
Languages: be, de, fi, it, ja, lt, nb, nl, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: Session logs created using <command>script</command>, as described in <xref linkend="record-session"/>.
be: Пратаколы сесіі, атрыманыя з дапамогай праграмы <command>script</command> (гл. <xref linkend="record-session"/>).
de: Upgrade-Protokolle, erstellt mit Hilfe des Befehls <command>script</command> (wie in <xref linkend="record-session"/> beschrieben).
fi: Ohjelmalla <command>script</command> tehdyt istunnon lokit, kuten kerrottiin kohdassa<xref linkend="record-session"/>.
it: Le trascrizioni delle sessioni al terminale, ottenuti con <command>script</command>, come descritto in <xref linkend="record-session"/>.
ja: <command>script</command> を使用して作成したセッションのログ。<xref linkend="record-session"/> で説明します。
lt: Atnaujinimo seanso žurnalas sukurtas naudojantis <command>script</command>, kaip aprašyta <xref linkend="record-session"/>.
nb: Sesjonslogger fra <command>script</command>, som beskrevet i <xref linkend="record-session"/>.
nl: Sessielogboeken die gemaakt zijn met <command>script</command>, zoals beschreven in <xref linkend="record-session"/>.
pl: Logi sesji utworzone za pomocą <command>script</command>, zgodnie z opisem w <xref linkend="record-session"/>.
pt: A sessão faz o registo (log) utilizando o <command>script</command>, conforme é descrito em <xref linkend="record-session"/>.
pt_br: Registros da sessão criados usando o comando <command>script</command>, conforme descrito na <xref linkend="record-session"/>.
ro: Jurnalul sesiunii folosind <command>script</command>, după cum este descris în <xref linkend="record-session"/>.
ru: Журналы сеанса работы с помощью <command>script</command>, как это описано в <xref linkend="record-session"/>.
sk: Záznamy relácie pomocou príkazu <command>script</command> popisuje <xref linkend="record-session"/> .
sv: Sessionsloggar från <command>script</command>. Läs mer om detta i <xref linkend="record-session"/>.
vi: Bản ghi phiên chạy được tạo dùng <command>script</command>, như diễn tả trong <xref linkend="record-session"/> .

source: Your <systemitem role="package">apt</systemitem> logs, available at <filename>/var/log/apt/term.log</filename> or your <command>aptitude</command> logs, available at <filename>/var/log/aptitude</filename>.
be: Пратаколы сістэмы <systemitem role="package">apt</systemitem>, якія знаходзяцца ў файле <filename>/var/log/apt/term.log</filename>, альбо пратаколы праграмы <command>aptitude</command>, якія месцяцца ў каталогу <filename>/var/log/aptitude</filename>.
de: Ihre <systemitem role="package">apt</systemitem>-Logdateien, die Sie unter <filename>/var/log/apt/term.log</filename> finden, oder Ihre <command>aptitude</command>-Logdateien, die unter <filename>/var/log/aptitude</filename> zu finden sind.
fi: <systemitem role="package">apt</systemitem>:n lokit tiedostosta <filename>/var/log/apt/term.log</filename> tai <command>aptitude</command>:n lokit tiedostosta <filename>/var/log/aptitude</filename>.
it: I registri di <systemitem role="package">apt</systemitem>, disponibili in <filename>/var/log/apt/term.log</filename>, o i registri di <command>aptitude</command>, disponibili in <filename>/var/log/aptitude</filename>.
lt: <systemitem role="package">apt</systemitem> darbo žurnalą, esantį faile <filename>/var/log/apt/term.log</filename> arba <command>aptitude</command> darbo žurnalą, esantį faile <filename>/var/log/aptitude</filename>.
nb: Ditt system sine <systemitem role="package">apt</systemitem> logger, tilgjengelig i <filename>/var/log/apt/term.log</filename> eller loggene til <command>aptitude</command>, tilgjengelig i <filename>/var/log/aptitude</filename>.
nl: Uw <systemitem role="package">apt</systemitem>-logboeken, beschikbaar onder <filename>/var/log/apt/term.log</filename> of uw <command>aptitude</command>-logboeken, beschikbaar onder <filename>/var/log/aptitude</filename>.
pl: Logi menedżera <systemitem role="package">apt</systemitem> dostępne w <filename>/var/log/apt/term.log</filename> lub dzienniki <command>aptitude</command>, z <filename>/var/log/aptitude</filename>.
pt: Os seus logs do <systemitem role="package">apt</systemitem>, estão disponíveis em <filename>/var/log/apt/term.log</filename> ou os seus logs do <command>aptitude</command>, que estão disponíveis em <filename>/var/log/aptitude</filename>.
pt_br: Seus logs do <systemitem role="package">apt</systemitem>, disponíveis em <filename>/var/log/apt/term.log</filename> ou seus logs do <command>aptitude</command>, disponíveis em <filename>/var/log/aptitude</filename>.
ro: Jurnalele <systemitem role="package">apt</systemitem>, disponibile în <filename>/var/log/apt/term.log</filename> sau jurnalele <command>aptitude</command>, disponibile în <filename>/var/log/aptitude</filename>.
ru: Журнал работы <systemitem role="package">apt</systemitem> из файла <filename>/var/log/apt/term.log</filename> или журналы <command>aptitude</command> из каталога <filename>/var/log/aptitude</filename>.
sk: Vaše záznamy <systemitem role="package">apt</systemitem> dostupné v <filename>/var/log/apt/term.log</filename> alebo vaše záznamy <command>aptitude</command> dostupné v <filename>/var/log/aptitude</filename>.
sv: Dina <systemitem role="package">apt</systemitem>-loggar, tillgängliga i <filename>/var/log/apt/term.log</filename> eller dina <command>aptitude</command>-loggar, tillgängliga i <filename>/var/log/aptitude</filename>.
vi: Các bản ghi <systemitem role="package">apt</systemitem> ở<filename>/var/log/apt/term.log</filename>, hoặc các bản ghi <command>aptitude</command> ở <filename>/var/log/aptitude</filename>.
zh_tw: 可由 <filename>/var/log/apt/term.log</filename> 取得您的 <systemitem role="package">apt</systemitem> 日誌，或是由 <filename>/var/log/aptitude</filename> 取得您的 <command>aptitude</command> 日誌。

source: You should take some time to review and remove any sensitive and/or confidential information from the logs before including them in a bug report as the information will be published in a public database.
be: Перад тым, як дададаць гэтыя пратаколы да справаздачы, варта перагледзець іх і выдаліць прыватныя звесткі з улікам таго, што дасланая інфармацыя будзе апублікаваная ў адкрытым доступе.
de: Sie sollten sich ein wenig Zeit nehmen, um die Informationen zu prüfen und sensible bzw. vertrauliche Daten aus den Logdateien zu löschen, bevor Sie die Informationen dem Fehlerbericht anhängen, da der gesamte Bericht mit Ihren Anhängen öffentlich gespeichert und einsehbar sein wird.
fi: Lokeista olisi etsittävä ja poistettava arkaluontoiset ja/tai luottamukselliset tiedot ennen niiden liittämistä vikailmoitukseen, koska ne kirjataan julkiseen tietokantaan.
it: Prima di inviare le informazioni contenute nei file di registro è opportuno verificare che non vi siano informazioni che si ritengono private, poiché tutta la segnalazione verrà inserita in un database pubblico.
ja: バグ報告に情報を含める前に、慎重に扱うべき情報や機密情報がログに含まれていないかある程度時間をかけて検査し、ログから削除してください。なぜなら、バグ報告に含まれる情報は公開データベースで公表されるからです。
lt: Prieš įdėdami darbo žurnalus į pranešimą apie atnaujinimą, peržiūrėkite juos ir pašalinkite asmeninę ir slaptą informaciją, nes šie žurnalai bus paskelbti viešai prieinamoje duomenų bazėje.
nb: Du bør passe på å ikke inkludere sensitiv eller konfidensiell informasjon fra dine loggfiler i en slik feilrapport, ettersom slike feilrapporter blir gjort offentlig tilgjengelig.
nl: U dient de tijd te nemen om alle gevoelige en/of vertrouwelijke informatie van de logboeken na te kijken en te verwijderen, alvorens ze te publiceren als bugrapport. Dit omdat de informatie in een publieke database wordt gepubliceerd.
pl: Przed umieszczeniem logów, powinno się poświęcić nieco czasu na usunięcie z nich wszystkich prywatnych i/lub poufnych informacji, ponieważ zostaną one udostępnione w dostępnej publicznie bazie danych.
pt: Você deve tomar algum tempo para rever e remover qualquer informação sensível e/ou confidencial dos logs antes de os incluir num relatório de bug já que a informação será publicada numa base de dados pública.
pt_br: Você deve levar algum tempo para revisar e remover qualquer informação sensível e/ou confidencial dos logs antes de incluí-los no relatório de bug pois a informação será disponibilizada em um banco de dados público.
ro: Ar trebui să vă faceți timp să revizuiți jurnalele și să ștergeți orice informații sensibile și/sau confidențiale înainte să le includeți în raport, deoarece acestea vor fi publicate într-o bază de dată publică.
ru: Обязательно просмотрите и удалите всю личную и/или конфиденциальную информацию из журналов, перед тем как включать их в сообщение об ошибке, так как эта информация будет занесена в доступную всем базу данных.
sk: Pozn.: Mali by ste venovať nejaký čas tomu, aby ste skontrolovali, či spolu so záznamami neodosielate akékoľvek citlivé alebo dôverné informácie a odstrániť ich zo správy, pretože tieto informácie budú verejne prístupné.
sv: Du bör ta dig tid att granska och ta bort eventuellt känslig och/eller konfidentiell information från loggfilerna innan de inkluderas i en felrapport eftersom informationen kommer att publiceras i en publik databas.
vi: Người dùng cũng nên bỏ chút thời gian xem lại và gỡ bỏ khỏi bản ghi bất kỳ thông tin vẫn nhạy cảm hay mật, trước khi bao gồm bản ghi trong một báo cáo lỗi, vì thông tin được đệ trình sẽ được xuất bản trong một cơ sở dữ liệu công cộng.
zh_tw: 在錯誤回報裡引用這些資訊之前，您應該花點時間去重新檢視這些資訊，並移除任何 敏感 及/或 私密 資料。因為這些資訊將會發佈在公共的資料庫上。

source: Sources for this document
be: Зыходныя файлы гэтага дакументу
de: Quelltext dieses Dokuments
fi: Tämän ohjelman lähteet
it: Sorgenti di questo documento
ja: この文書のソース
lt: Šio dokumento išeities tekstai
nb: Kilder brukt i dette dokumentet
nl: Broncode voor dit document
pl: Źródła niniejszego dokumentu
pt: Fontes para este documento
pt_br: Código fonte deste documento
ro: Sursele acestui document
ru: Исходный текст этого документа
sk: Zdroje tohto dokumentu
sv: Källor för det här dokumentet
vi: Nguồn của tài liệu này
zh_tw: 這份文件的來源資訊

source: The source of this document is in DocBook XML<indexterm><primary>DocBook XML</primary></indexterm> format. The HTML version is generated using <systemitem role="package">docbook-xsl</systemitem> and <systemitem role="package">xsltproc</systemitem>. The PDF version is generated using <systemitem role="package">dblatex</systemitem> or <systemitem role="package">xmlroff</systemitem>. Sources for the Release Notes are available in the SVN repository of the <emphasis>Debian Documentation Project</emphasis>. You can use the <ulink url="&url-svn-release-notes;">web interface</ulink> to access its files individually through the web and see their changes. For more information on how to access the SVN please consult the <ulink url="&url-ddp-svn-info;">Debian Documentation Project SVN information pages</ulink>.
be: Арыгінал гэтага дакументу складзены ў фармаце DocBook XML<indexterm><primary>DocBook XML</primary></indexterm>. Версія ў фармаце HTML створаная з дапамогай праграм <systemitem role="package">docbook-xsl</systemitem> і <systemitem role="package">xsltproc</systemitem>. Версія ў фармаце PDF створаная з дапамогай праграм <systemitem role="package">dblatex</systemitem> або <systemitem role="package">xmlroff</systemitem>. Зыходныя файлы змешчаныя ў SVN-сховішчы <emphasis>Праекту дакументацыі Debian</emphasis>. Праглядзець асобныя файлы і гісторыю іх зменаў можна з дапамогай <ulink url="&url-svn-release-notes;">вэб-інтэрфэйсу</ulink>. Дадатковыя звесткі аб доступе да SVN утрымліваюцца на <ulink url="&url-ddp-svn-info;">старонках інфармацыі SVN праекту дакументацыі Debian</ulink>.
de: Die Quellen für dieses Dokument liegen im DocBook-XML<indexterm><primary>DocBook XML</primary></indexterm>-Format vor. Die HTML-Version wird mit <systemitem role="package">docbook-xsl</systemitem> und <systemitem role="package">xsltproc</systemitem> erstellt. Die PDF-Version wird mit <systemitem role="package">dblatex</systemitem> oder <systemitem role="package">xmlroff</systemitem> erstellt. Die Quellen der Veröffentlichungshinweise sind im SVN-Depot des <emphasis>Debian-Dokumentationsprojekts</emphasis> verfügbar. Sie können die <ulink url="&url-svn-release-notes;">Web-Oberfläche</ulink> nutzen, um die einzelnen Dateien und ihre Änderungen einzusehen. Für weitere Informationen zum Umgang mit SVN (Subversion) beachten Sie bitte die <ulink url="&url-ddp-svn-info;">SVN-Informationsseiten</ulink> des Debian-Dokumentationsprojekts.
fi: Tämän ohjeen lähdekoodi on muodossa DocBook XML<indexterm><primary>DocBook XML</primary></indexterm>. HTML-muotoinen ohje tuotetaan pakettien <systemitem role="package">docbook-xsl</systemitem> ja <systemitem role="package">xsltproc</systemitem> avulla. PDF-muotoinen ohje tuotetaan paketin <systemitem role="package">dblatex</systemitem> tai paketin <systemitem role="package">xmlroff</systemitem> avulla. Lähdekoodi on saatavilla <emphasis>Debian Documentation Project</emphasis>in SVN varastoalueelta. Yksittäisen tiedoston voi katsoa netistä <ulink url="&url-svn-release-notes;">selainkäyttöliittymällä</ulink> jolloin näkee myös muutoshistorian. Lisätietoja SVN:n käytöstä löytyy <ulink url="&url-ddp-svn-info;">Debian Documentation Projektin SVN ohjesivuilta</ulink>.
it: I sorgenti di questo documento sono in formato DocBook XML <indexterm><primary>DocBook XML</primary></indexterm>. La versione in HTML viene generata usando <systemitem role="package">docbook-xsl</systemitem> e <systemitem role="package">xsltproc</systemitem>. La versione in PDF viene generata usando <systemitem role="package">dblatex</systemitem> o <systemitem role="package">xmlroff</systemitem>. I sorgenti delle note di rilascio sono disponibili nell'archivio SVN del <emphasis>Debian Documentation Project</emphasis>. È possibile utilizzare l'<ulink url="&url-svn-release-notes;">interfaccia web</ulink> per accedere ai singoli file tramite il web e vedere le rispettive modifiche. Per maggiori informazioni su come accedere a SVN, consultare le <ulink url="&url-ddp-svn-info;">pagine su SVN del Debian Documentation Project</ulink>.
ja: この文書のソースは DocBook XML<indexterm><primary>DocBook XML</primary></indexterm> 形式です。HTML 版は、<systemitem role="package">docbook-xsl</systemitem> と <systemitem role="package">xsltproc</systemitem> を使用して生成しています。PDF 版は、<systemitem role="package">dblatex</systemitem> や <systemitem role="package">xmlroff</systemitem> を使用して生成しています。リリースノートのソースは <emphasis>Debian ドキュメンテーションプロジェクト (Debian Documentation Project)</emphasis> の SVN リポジトリにあります。ウェブから<ulink url="&url-svn-release-notes;">ウェブインターフェース</ulink>を使って個々のファイルにアクセスでき、変更を参照できます。SVN へのアクセス方法に関してさらに詳しく知りたい場合は、<ulink url="&url-ddp-svn-info;">Debian ドキュメンテーションプロジェクトの SVN 情報ページ</ulink>を参照してください。
lt: Šio dokumento išeities tekstai yra DocBook XML <indexterm><primary>DocBook XML</primary></indexterm> formate. HTML versija sukurta naudojant <systemitem role="package">docbook-xsl</systemitem> ir <systemitem role="package">xsltproc</systemitem>. PDF versija sukurta naudojant <systemitem role="package">dblatex</systemitem> arba <systemitem role="package">xmlroff</systemitem>. Išeities tekstai yra prieinami <emphasis>Debian'o dokumentacijos projekto</emphasis> SVN repozitorijoje. Galite naudoti <ulink url="&url-svn-release-notes;">tinklapio sąsają</ulink>, norėdami gauti prieigą prie atskirų failų per tinklą ir peržiūrėti jų pakeitimus. Dėl išsamesnės informacijos apie tai, kaip prieiti prie SVN repozitorijos prašom skaityti <ulink url="&url-ddp-svn-info;">Debian'o dokumentacijos projekto SVN puslapius</ulink>.
nb: Kilden til dette dokumentet er i DocBook XML<indexterm><primary>DocBook XML</primary></indexterm> format. HTML versjonen er lagd med <systemitem role="package">docbook-xsl</systemitem> og <systemitem role="package">xsltproc</systemitem>. PDF versjonen er lagd med <systemitem role="package">dblatex</systemitem> eller <systemitem role="package">xmlroff</systemitem>. Kilden til Release Notes er tilgjengelig i SVN hos <emphasis>Debian Documentation Project</emphasis>. Du kan bruke <ulink url="&url-svn-release-notes;">web interface</ulink> for å få tilgang til enkeltfilene på nettet for å se på endringer i dem. For mer informasjon om hvordan du bruker SVN ta en titt på <ulink url="&url-ddp-svn-info;">Debian Documentation Project SVN information pages</ulink>.
nl: De broncode van dit document is in Docbook XML<indexterm><primary>DocBook XML</primary></indexterm>-formaat. De HTML-versie is gegenereerd met behulp van <systemitem role="package">docbook-xsl</systemitem> en <systemitem role="package">xsltproc</systemitem>. De PDF-versie is gegenereerd met behulp van <systemitem role="package">dblatex</systemitem> of <systemitem role="package">xmlroff</systemitem>. Broncode voor de release-opmerkingen zijn beschikbaar in het SVN-archief van het <emphasis>Debian Documentatie Project</emphasis>. U kunt de <ulink url="&url-svn-release-notes;">web-interface</ulink> gebruiken om de bestanden individueel te raadplegen en veranderingen te bekijken. Meer informatie over toegang tot het SVN-archief kunt u vinden op de <ulink url="&url-ddp-svn-info;">SVN informatiepagina's van het Debian Documentatie Project</ulink>.
pl: Źródła niniejszego dokumentu są przechowywane w formacie DocBook XML<indexterm><primary>DocBook XML</primary></indexterm>. Wersja HTML jest generowana za pomocą <systemitem role="package">docbook-xsl</systemitem> i <systemitem role="package">xsltproc</systemitem>. Wersja PDF jest tworzona przy użyciu <systemitem role="package">dblatex</systemitem> lub <systemitem role="package">xmlroff</systemitem>. Źródła informacji o wydaniu są dostępne jako repozytorium SVN <emphasis>Projektu Dokumentacji Debiana</emphasis>. Można użyć <ulink url="&url-svn-release-notes;">interfejsu WWW</ulink> aby uzyskać dostęp do poszczególnych plików przez sieć i przeglądnąć naniesione zmiany. Więcej informacji o uzyskiwaniu dostępu do SVN znajduje się na <ulink url="&url-ddp-svn-info;">stronach informacji o SVN Projektu Dokumentacji Debiana</ulink>.
pt: O código-fonte deste documento está no formato DocBook XML<indexterm><primary>DocBook XML</primary></indexterm>. A versão em HTML é gerada utilizando o <systemitem role="package">docbook-xsl</systemitem> e o <systemitem role="package">xslproc</systemitem>. A versão em PDF é gerada utilizando <systemitem role="package">dblatex</systemitem> ou o <systemitem role="package">xmlroff</systemitem>. O código-fonte para as Notas de Lançamento está disponível no repositório SVN do <emphasis>Projecto de Documentação Debian</emphasis>. Pode utilizar o <ulink url="&url-svn-release-notes;">interface web</ulink> para aceder aos seus ficheiros individuais através da web e ver as suas alterações. Para mais informações acerca de como aceder ao SVN por favor consulte as <ulink url="&url-ddp-svn-info;">páginas SVN do Projecto de Documentação Debian</ulink>.
pt_br: O código fonte deste documento está no formato DocBook XML<indexterm><primary>DocBook XML</primary></indexterm>. A versão HTML é gerada usando <systemitem role="package">docbook-xsl</systemitem> e <systemitem role="package">xsltproc</systemitem>. A versão PDF é gerada usando <systemitem role="package">dblatex</systemitem> ou <systemitem role="package">xmlroff</systemitem>. Os códigos fonte das notas de lançamento estão disponíveis no repositório SVN do <emphasis>Projeto de Documentação Debian</emphasis>. Você pode usar a <ulink url="&url-svn-release-notes;">interface web</ulink> para acessar seus arquivos individualmente através da web e ver suas mudanças. Para mais informações sobre como acessar o SVN, por favor, consulte as <ulink url="&url-ddp-svn-info;">páginas de informação sobre o SVN do Projeto de Documentação Debian</ulink>.
ro: Sursele acestui document sunt în format DocBook XML<indexterm><primary>DocBook XML</primary></indexterm>. Versiunea HTML este generată folosind <systemitem role="package">docbook-xsl</systemitem> și <systemitem role="package">xsltproc</systemitem>. Versiunea PDF este generată folosind <systemitem role="package">dblatex</systemitem> sau <systemitem role="package">xmlroff</systemitem>. Sursele pentru Notele de lansare sunt disponibile în depozitul SVN al <emphasis>Proiectului de documentație Debian</emphasis> (Debian Documentation Project). Puteți folosi <ulink url="&url-svn-release-notes;">interfața web</ulink> pentru a accesa individual fișierele și să vedeți modificările acestora. Pentru mai multe informații despre accesarea SVN-ului vă rugăm să consultați <ulink url="&url-ddp-svn-info;">Paginile cu informații despre SVN-ul Proiectului de documentație Debian</ulink>.
ru: Исходный текст данного документа написан в формате DocBook XML<indexterm><primary>DocBook XML</primary></indexterm>. HTML-версия создана с помощью <systemitem role="package">docbook-xsl</systemitem> и <systemitem role="package">xsltproc</systemitem>. PDF-версия создана с помощью <systemitem role="package">dblatex</systemitem> или <systemitem role="package">xmlroff</systemitem>. Исходный текст документа доступен в SVN <emphasis>проекта документирования Debian</emphasis>. Для доступа к отдельным файлам и для просмотра изменений вы можете использовать <ulink url="&url-svn-release-notes;">веб-интерфейс</ulink>. Подробней о доступе к SVN см. <ulink url="&url-ddp-svn-info;">страницы проекта документирования Debian</ulink>.
sk: Tento dokument je vo formáte DocBook XML<indexterm><primary>DocBook XML</primary></indexterm>. HTML verzia sa generuje pomocou <systemitem role="package">docbook-xsl</systemitem> a <systemitem role="package">xsltproc</systemitem>. PDF verzia sa generuje pomocou <systemitem role="package">dblatex</systemitem> alebo <systemitem role="package">xmlroff</systemitem>. Zdrojové súbory Poznámok k vydaniu sú dostupné v SVN úložisku <emphasis>Dokumentačného Projektu Debian</emphasis>. Na prístup k jednotlivým súborom a prezeranie ich zmien môžete použiť <ulink url="&url-svn-release-notes;">webové rozhranie</ulink>. Ďalšie informácie o prístupe k SVN nájdete na <ulink url="&url-ddp-svn-info;">stránkach o SVN Dokumentačného Projektu Debian</ulink>.
sv: Källan till detta dokument är formaterad med DocBook XML<indexterm><primary>DocBook XML</primary></indexterm>. HTML-versionen skapas med <systemitem role="package">docbook-xsl</systemitem> och <systemitem role="package">xsltproc</systemitem>. PDF-versionen skapas med <systemitem role="package">dblatex</systemitem> eller <systemitem role="package">xmlroff</systemitem>. Källor för Kommentarer till utgåvan finns tillgängliga i SVN-förrådet för <emphasis>Debian Documentation Project</emphasis>. Du kan använda <ulink url="&url-svn-release-notes;">webbgränssnittet</ulink> för att komma åt dess filer individuellt via webben och se ändringar i dem. För mer information om hur man kommer åt SVN-förrådet, läs <ulink url="&url-ddp-svn-info;">SVN-sidorna för Debian Documentation Project</ulink>.
vi: Mã nguồn của tài liệu này theo định dạng DocBook XML<indexterm><primary>DocBook XML</primary></indexterm>. Phiên bản HTML được tạo ra dùng <systemitem role="package">docbook-xsl</systemitem> và <systemitem role="package">xsltproc</systemitem>. Phiên bản PDF được tạo ra dùng <systemitem role="package">dblatex</systemitem> hay <systemitem role="package">xmlroff</systemitem>. Nguồn của Ghi chú Phát hành cũng sẵn sàng trong kho SVN của <emphasis>Dự án Tài liệu Debian</emphasis>. Người dùng có thể sử dụng <ulink url="&url-svn-release-notes;">giao diện Web</ulink> để truy cập đến mỗi tập tin riêng thông qua Web và thấy các thay đổi. Để tìm thêm thông tin về cách truy cập đến kho SVN, xem <ulink url="&url-ddp-svn-info;">các trang Thông tin SVN của Dự án Tài liệu Debian</ulink>.
