Repository: lurdan/trans-ddp
Catalog: release-notes/*/about.po
Languages: be, de, fi, it, ja, lt, nb, nl, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: en
be: be
de: de
fi: fi
it: it
ja: ja
lt: lt
nb: nb
nl: nl
pl: pl
pt: pt
pt_br: pt_BR
ro: ro
ru: ru
sk: sk
sv: sv
vi: vi
zh_tw: zh_TW

source: Introduction
be: Уводзіны
de: Einführung
fi: Johdanto
it: Introduzione
ja: はじめに
lt: Įvadas
nb: Innledning
nl: Inleiding
pl: Wstęp
pt: Introdução
pt_br: Introdução
ro: Introducere
ru: Введение
sk: Úvod
sv: Introduktion
vi: Giới thiệu
zh_tw: 引言

source: This document informs users of the &debian; distribution about major changes in version &release; (codenamed &releasename;).
de: Dieses Dokument informiert Benutzer der &debian;-Distribution über entscheidende Änderungen in Version &release; (Codename &Releasename;).
it: Questo documento fornisce informazioni agli utenti della distribuzione &debian; sui cambiamenti principali nella versione &release; (nome in codice &releasename;).
ja: この文書は &debian; ディストリビューションのユーザに、バージョン &release; (コードネーム &releasename;) での大きな変更点を知らせるものです。
nl: Dit document voorziet gebruikers van de &debian; distributie van informatie over grote veranderingen in versie &release; (codenaam &releasename;).
pl: Niniejszy dokument informuje użytkowników dystrybucji &debian; o głównych zmianach w wersji &release; (nazwa kodowa &releasename;).
pt_br: Este documento dá aos usuários da distribuição &debian; informações sobre grandes mudanças na versão &release; (codinome &releasename;).
ro: Acest document informează utilizatorii distribuției &debian; despre schimbările majore din versiunea &release; (cu nume de cod &releasename;).
ru: Данный документ информирует пользователей дистрибутива &debian; об основных изменениях в выпуске &release; (&releasename;).
sv: Detta dokument upplyser användarna av &debian;-distributionen om större förändringar i version &release; (kodnamn &releasename;).

source: The release notes provide information on how to upgrade safely from release &oldrelease; (codenamed &oldreleasename;) to the current release and inform users of known potential issues they could encounter in that process.
be: У звестках аб выпуску даводзіцца, як карэктна абнавіць сістэму з папярэдняй версіі &oldrelease; (кодавая назва "&oldreleasename;") да новага выпуску. Таксама апісваюцца вядомыя патэнцыйныя праблемы, якія варта прыняць да ўвагі падчас абнаўлення.
de: Die Hinweise zur Veröffentlichung bieten Informationen, wie ein sicheres Upgrade von Version &oldrelease; (Codename &Oldreleasename;) auf die aktuelle Veröffentlichung durchgeführt werden kann und informieren die Benutzer über bekannte potenzielle Probleme, die während des Upgrades auftreten können.
fi: Julkistusmuistiosta löytyy tietoa turvallisesta päivittämisestä julkaisusta &oldrelease; (koodinimeltään &oldreleasename;) nykyiseen julkaisuun ja kertoo päivityksen yhteydessä mahdollisesti esiin tulevista pulmista.
it: Le note di rilascio forniscono informazioni su come aggiornare in modo sicuro dalla versione &oldrelease; (nome in codice &oldreleasename;) alla versione attuale e informano gli utenti sui possibili problemi conosciuti in cui potrebbero incorrere durante tale processo.
ja: このリリースノートでは、リリース &oldrelease; (コードネーム &oldreleasename;) から今回のリリースへの安全なアップグレード方法や、その際ユーザが遭遇する可能性がある既知の問題点についての情報をユーザに提供しています。
lt: Laidos informacijoje aprašoma kaip saugiai atnaujinti &oldrelease; („&oldreleasename;“) laidą į dabartinę ir naudotojai informuojami apie žinomas potencialias problemas, galinčias kilti šio proceso metu.
nb: Dette dokumentet forklarer hvordan man på en sikker måte oppgraderer fra versjon &oldrelease; (kodenavn &oldrelease;) til den aktuelle versjonen, og informerer også om de vanligste problemene man kan støte på.
nl: De release-opmerkingen voorzien in informatie over hoe u veilig kunt opwaarderen vanaf uitgave &oldrelease; (codenaam &oldreleasename;) naar de huidige uitgave en informeren gebruikers over mogelijke moeilijkheden die ze kunnen ondervinden tijdens dat proces.
pl: Informacje o wydaniu zawierają wskazówki na temat bezpiecznej aktualizacji z wydania &oldrelease; (nazwa kodowa &oldreleasename;) do wydania bieżącego oraz informacje o znanych, potencjalnych błędach, na które mogą natrafić użytkownicy w trakcie tego procesu.
pt: As notas de lançamento disponibilizam informação acerca de como actualizar de forma segura a partir do lançamento &oldrelease; (com o nome de código &oldreleasename;) para o lançamento actual e informar os utilizadores acerca de potenciais problemas que possam encontrar no processo.
pt_br: As notas de lançamento fornecem informações sobre como atualizar de forma segura a partir da versão &oldrelease; (codinome &oldreleasename;) para a versão atual e dá aos usuários informações sobre potenciais problemas conhecidos que eles possam encontrar nesse processo.
ro: Notele de lansare furnizează informații despre cum se poate actualiza în siguranță de la versiunea &oldrelease; (cu nume de cod &oldreleasename;) la versiunea curentă și informează utilizatorii despre potențiale probleme ce pot fi întâlnite în decursul actualizării.
ru: В информации о выпуске описывается процесс безопасного обновления с выпуска &oldrelease; (&oldreleasename;) до текущего выпуска, и известные потенциальные проблемы, с которыми могут столкнуться пользователи при обновлении.
sk: Poznámky k vydaniu poskytujú informácie o tom ako bezpečne aktualizovať systém z predošlého vydania &oldrelease; (kódové označenie &oldreleasename;) na aktuálne vydanie a informujú používateľov o známych potenciálnych problémoch, s ktorými by sa mohli stretnúť počas aktualizácie.
sv: Dokumentet kommer att förklara hur man på ett säkert sätt uppgraderar från utgåvan &oldrelease; (kodnamn &oldreleasename;) till den aktuella utgåvan och informerar om kända potentiella problem som kan uppstå i den processen.
vi: Ghi chú Phát hành thì cung cấp thông tin về cách nâng cấp an toàn từ bản phát hành &oldrelease; (tên mã « &oldreleasename; ») lên bản phát hành hiện thời, và cho người dùng biết về các vấn đề được biết có thể gặp trong quá trình đó.

source: You can get the most recent version of this document from <ulink url="&url-release-notes;"></ulink>. If in doubt, check the date on the first page to make sure you are reading a current version.
be: Найноўшая версія гэтага дакумента публікуецца на <ulink url="&url-release-notes;"></ulink>. Калі Вы не ўпэўненыя ў актуальнасці версіі, якую чытаеце, праверце дату на першай старонцы дакумента.
de: Die neueste Version dieses Dokuments erhalten Sie unter <ulink url="&url-release-notes;"></ulink>. Im Zweifelsfall prüfen Sie das Datum auf der ersten Seite, um sich zu vergewissern, dass Sie eine aktuelle Version lesen.
fi: Tämän julkaisun uusin versio on saatavilla osoitteesta <ulink url="&url-release-notes;"></ulink>. Varmista ensimmäisen sivun päiväyksestä lukevasi nykyversiota.
it: È possibile ottenere la versione più recente di questo documento da <ulink url="&url-release-notes;"></ulink>. Nel dubbio, controllare la data del documento nel frontespizio e assicurarsi di avere a disposizione una versione recente.
ja: この文書の最新版は、<ulink url="&url-release-notes;"></ulink> から取得できます。疑わしい場合は、最初のページにある文書の日付をチェックし、最新版を読んでいるかを確認してください。
lt: Šio dokumento naujausiąją versiją galite rasti adresu <ulink url="&url-release-notes;"></ulink>. Jei abejojate, pasižiūrėkite datą pirmajame puslapyje ir įsitikinkite, kad skaitote nepasenusią versiją.
nl: U kunt de meest recente versie van dit document verkrijgen vanaf <ulink url="&url-release-notes;"></ulink>. Controleer bij twijfel de datum op de eerste pagina om er zeker van te zijn dat u een recente versie leest.
pl: Najbardziej aktualną wersję dokumentu można pobrać z <ulink url="&url-release-notes;"></ulink>. W razie wątpliwości, proszę sprawdzić datę na pierwszej stronie, aby upewnić się, że niniejsza wersja jest aktualna.
pt: Pode obter a versão mais recente deste documento a partir de <ulink url="&url-release-notes;"></ulink>. Em caso de dúvida, verifique a data na primeira página para se assegurar que está a ler uma versão actualizada.
pt_br: Você pode obter a versão mais recente deste documento na <ulink url="&url-release-notes;"></ulink>. Em caso de dúvida, verifique a data na primeira página do documento para ter certeza de que você está lendo uma versão atualizada.
ro: Cea mai recentă versiune a acestui document se poate obține de la <ulink url="&url-release-notes;"></ulink>. În cazul în care aveți îndoieli, verificați data pe prima pagină a documentului și asigurați-vă că citiți o versiune actuală.
ru: Самая последняя версия этого документа доступна на странице <ulink url="&url-release-notes;"></ulink>. Если не уверены, посмотрите дату на первой странице и убедитесь, что читаете актуальную версию.
sk: Najnovšia verzia tohto dokumentu je vždy dostupná na <ulink url="&url-release-notes;"></ulink>. Ak si nie ste istý či čítate aktuálnu verziu, skontrolujte dátum na prvej stránke a uistite sa, že čítate aktuálnu verziu.
sv: Du kan få tag på senaste versionen av detta dokument på <ulink url="&url-release-notes;"></ulink>. Du kan säkerställa att du läser den senaste versionen av dokumentet genom att jämföra datumen på första sidan.
vi: Người dùng có thể lấy phiên bản mới nhất của tài liệu này ở <ulink url="&url-release-notes;"></ulink>. Chưa chắc thì kiểm tra ngày tháng trên trang đầu, để tìm biết nếu tài liệu đó là một phiên bản hiện thời không.

source: Note that it is impossible to list every known issue and that therefore a selection has been made based on a combination of the expected prevalence and impact of issues.
be: Майце на ўвазе, што апісаць абсалютна ўсе вядомыя праблемы немагчыма, таму сітуацыі адбіраліся ў залежнасці ад меркаванай распаўсюджанасці іх узнікнення і цяжару магчымых наступстваў.
de: Beachten Sie, dass es unmöglich ist, alle bekannten Probleme aufzulisten; deshalb wurde eine Auswahl getroffen, basierend auf einer Kombination aus der zu erwartenden Häufigkeit des Auftretens und der Auswirkung der Probleme.
fi: Huomaa, että on mahdotonta luetella kaikkia tunnettuja pulmia. Valinta on suoritettu arvioidun yleisyyden ja vaikutuksen mukaan.
it: È impossibile elencare ogni possibile problema conosciuto, pertanto è stata fatta una selezione basata su probabili gravità e diffusione.
ja: 既知の問題点をすべてリストアップすることは不可能なので、問題点の予想される広がり具合と影響の大きさの両方に基づいて取捨選択していることに注意してください。
lt: Tenka pažymėti, kad čia neįmanoma išvardinti visų galimų problemų ir todėl buvo pasirinktos tik tos, kurios gali kilti dažniausiai ir daryti didžiausią poveikį.
nb: Det er umulig for oss å ta med alle ting som kan gå galt, så derfor har vi bare tatt med et utvalg basert på kombinasjonen av hyppigst forekommende og alvorlighet.
nl: Het is helaas onmogelijk om elke bekend aandachtspunt hier te vermelden: daarom is een selectie gemaakt, gebaseerd op een combinatie van hoe vaak men verwacht dat het voorkomt en de ernst ervan.
pl: Proszę zwrócić uwagę, że nie da się opisać każdego znanego błędu a ich wybór opisany w tym dokumencie opiera się na spodziewanej powszechności występowania i wagi problemów.
pt: Repare que é impossível listar todos os problemas conhecidos, e por isso foi feita uma selecção baseada na combinação da prevalência esperada e impacto desses problemas.
pt_br: Note que é impossível listar todos os problemas conhecidos e portanto uma seleção foi feita baseada numa combinação da quantidade esperada e do impacto desses problemas.
ro: Țineți cont că este imposibil să menționăm fiecare problemă cunoscută și de aceea a fost făcută o selecție pe baza preponderenței și impactului așteptat.
ru: Заметим, что здесь невозможно перечислить все известные проблемы, и поэтому были выбраны только те, которые, как ожидается, могут возникнуть у большинства людей, и которые оказывают наибольшее влияние в целом.
sk: Majte na pamäti, že nie je možné uviesť každý známy problém a preto boli tu uvedené problémy vybrané na základe očakávanej frekvencie výskytu a závažnosti.
sv: Observera att det är omöjligt att lista alla kända problem och därför har ett urval gjorts baserat på en kombination av den allmänna förekomsten och problemets inverkan.
vi: Ghi chú rằng không thể liệt kê được mọi vấn đề đã biết, vì thế chúng tôi cố gắng chọn những vấn đề thường gặp nhất và có tác động lớn nhất.
zh_tw: 請注意到，要列出所有的已知問題是不可能的任務。因此，這些都是在經過篩選之後，被認為是普遍存在且重大的問題。

source: Please note that we only support and document upgrading from the previous release of Debian (in this case, the upgrade from &oldrelease;). If you need to upgrade from older releases, we suggest you read previous editions of the release notes and upgrade to &oldrelease; first.
be: Калі ласка, звярніце ўвагу, што мы забяспечваем падтрымку і апісанне толькі працэсу абнаўлення з папярэдняга выпуску Debian (у гэтым выпадку абнаўлення з версіі "&oldrelease;"). Каб зрабіць абнаўленне з больш старых версій, варта спачатку звярнуцца да адпаведных звестак аб выпусках і абнавіць сістэму да "&oldrelease;".
de: Bitte gestatten Sie uns die Anmerkung, dass wir lediglich ein Upgrade von der letzten Version (in diesem Fall &oldrelease;) auf die aktuelle unterstützen können. Falls Sie ein Upgrade von einer älteren Version durchführen müssen, empfehlen wir dringend, die Veröffentlichungshinweise der vorherigen Versionen zu lesen und zuerst ein Upgrade auf diese Versionen durchzuführen.
fi: Huomaa, että tuettu ja dokumentoitu on vain päivitys Debianin edellisestä julkaisusta (tässä tapauksessa julkaisusta &oldrelease;). Jos on päivitettävä vanhemmista versioista, on syytä lukea vanhat julkistusmuistiot ja päivittää ensin versioon &oldrelease;.
it: Si noti anche che vengono forniti solo il supporto e la documentazione relativi all'aggiornamento dalla versione precedente di Debian (in questo caso l'aggiornamento da &oldrelease;). Se si deve aggiornare il sistema da versioni antecedenti, si suggerisce di leggere le edizioni precedenti delle note di rilascio e di aggiornare dapprima a &oldrelease;.
ja: Debian の 1 つ前のリリースからのアップグレード (この場合、&oldrelease; からのアップグレード) のみがサポート・記述されていることに注意してください。さらに古いリリースからのアップグレードが必要な場合は、過去のリリースノートを読み、まず &oldrelease; へとアップグレードすることをお勧めします。
lt: Atkreipkite dėmesį, kad šiame dokumente aprašomas tik atnaujinimas iš ankstesnės Debian laidos (t.y. iš &oldrelease;). Jei jums reikia atnaujinti iš dar ankstesnės laidos, siūlome paskaityti ankstesnių laidų aprašymus ir pirma atlikti atnaujinimą iki &oldrelease; laidos.
nb: Merk at vi kun støtter og dokumenterer hvordan man oppgraderer fra den forrige stabile versjonen av Debian (i dette tilfellet er det &oldrelease;). Hvis du vil oppgradere fra en enda eldre versjoner så foreslår vi at du leser tidligere dokumentasjon på hvordan man oppgraderer versjonene i mellom, og begynner med å oppgradere til &oldrelease; først
nl: Merkt u op dat wij enkel het opwaarderen vanaf de vorige uitgave van Debian (in dit geval, opwaardering vanaf &oldrelease;) ondersteunen en documenteren. Als u vanaf oudere uitgaven moet opwaarderen, raden wij u aan vorige edities van de release-opmerkingen te lezen en eerst op te waarderen naar &oldrelease;.
pl: Proszę zauważyć, że wspierana i udokumentowana jest jedynie aktualizacja z poprzedniej wersji Debiana (w tym przypadku, z &oldrelease;). W przypadku aktualizacji ze starszych wydań, sugerujemy uprzednie zapoznanie się z poprzednią wersją informacji o wydaniu i aktualizację do &oldrelease;.
pt: Por favor note que apenas suportamos e documentamos a actualização a partir do anterior lançamento de Debian (neste caso, a actualização a partir de &oldreleasename;). Se necessitar de actualizar a partir de lançamentos mais antigos sugerimos-lhe que leia as edições anteriores das notas de lançamento e que actualize primeiro para &oldrelease;.
pt_br: Por favor, note que só damos suporte e documentamos a atualização a partir de uma versão anterior do Debian (nesse caso, a atualização a partir da versão &oldrelease;). Se você precisa atualizar a partir de versões mais antigas, nós sugerimos que você leia as edições anteriores das notas de lançamento e atualize para a versão &oldrelease; primeiro.
ro: Vă rugăm să țineți cont că suportăm și documentăm doar actualizări de la versiunea precedentă de Debian (în acest caz actualizări de la &oldrelease;). În cazul în care trebuie să actualizați de la versiuni mai vechi vă sugerăm să citiți edițiile precedente ale notelor de lansare și să actualizați mai întâi la &oldrelease;.
ru: Обратите внимание, что теперь поддерживается и описывается только обновление с предыдущего выпуска Debian (то есть, этот документ описывает обновление с &oldrelease;). Если вам требуется обновить систему с более старого выпуска, обратитесь к ранним редакциям этого документа или сначала выполните обновление до &oldrelease;.
sk: Prosím, majte na pamäti, že aktualizácia je podporovaná a zdokumentovaná iba z predošlého vydania Debianu (v tomto prípade z vydania &oldreleasename;). Ak potrebujete vykonať aktualizáciu zo staršieho vydania, mali by ste si prečítať Poznámky k vydaniu predošlého vydania a najprv aktualizovať na &oldreleasename;.
sv: Observera att vi endast ger stöd för och dokumenterar uppgraderingen från den tidigare utgåvan av Debian (i det här fallet, uppgradering från &oldrelease;). Om du behöver uppgradera från äldre utgåvor föreslår vi att du läser tidigare versioner av kommentarerna för utgåvan och uppgraderar till &oldrelease; först.
vi: Ghi chú rằng chúng tôi chỉ hỗ trợ và mô tả trong tài liệu quá trình nâng cấp từ bản phát hành Debian trước (trong trường hợp này, nâng cấp từ &oldrelease;). Nếu người dùng cần phải nâng cấp từ một phiên bản cũ hơn, hãy đọc phiên bản Ghi chú Phát hành tương ứng và nâng cấp lên &oldrelease; trước tiên.
zh_tw: 請注意到，在此只會提供及記述從上一個 Debian 發行版本進行升級的資訊。（也就是說，由 &oldreleasename; 進行升級）。如果您必須從更為早期的發行版進行升級的話，我們建議您能參閱舊有的發行情報，並先升級至 &oldreleasename;。

source: Reporting bugs on this document
be: Як паведаміць аб памылках у гэтым дакуменце
de: Fehler in diesem Dokument berichten
fi: Tämän ohjeen vioista ilmoittaminen
it: Segnalare errori in questo documento
ja: この文書に関するバグを報告する
lt: Kaip pranešti apie klaidas šiame dokumente
nb: Rapportere feil i dette dokumentet
nl: Rapporteren van fouten in dit document
pl: Zgłaszanie błędów w tym dokumencie
pt: Relatar erros neste documento
pt_br: Reportando bugs neste documento
ro: Raportarea problemelor din acest document
ru: Как сообщить об ошибке в этом документе
sk: Ako oznamovať chyby v tomto dokumente
sv: Rapportera fel i det här dokumentet
vi: Thông báo lỗi về tài liệu này
zh_tw: 回報這份文件的錯誤

source: We have attempted to test all the different upgrade steps described in this document and to anticipate all the possible issues our users might encounter.
be: Мы паспрабавалі праверыць усе магчымыя крокі па абнаўленні сістэмы, апісаныя ў гэтым дакуменце, і прадбачыць усе праблемы, з якімі могуць сутыкнуцца нашы карыстальнікі.
de: Wir haben versucht, die einzelnen Schritte des Upgrades in diesem Dokument zu beschreiben und alle möglicherweise auftretenden Probleme vorherzusehen.
fi: Kaikki tässä ohjeessa kuvatut päivityksen vaiheet on pyritty testaamaan ja myöskin kaikki esiin tulevat pulmat on pyritty ennakoimaan.
it: Abbiamo cercato di verificare tutti i vari passi dell'aggiornamento che vengono descritti in questo documento e abbiamo anche cercato di identificare ogni possibile problema nel quale si potrebbe incorrere.
ja: 私たちは、この文書で説明されているすべての異なるアップグレード手順を試し、また、ユーザが直面する可能性のある、すべての問題を予想しました。
lt: Stengėmės atlikti visus galimus atnaujinimo žingsnius, aprašytus šiame dokumente ir kartu bandėme numatyti visas galimas problemas, su kuriomis gali tekti susidurti naudotojams.
nb: Vi har forsøkt å teste alle skritt i dette dokumentet, vi har også forsøkt å beskrive alle mulige feil som kan oppstå når man oppgraderer.
nl: Wij hebben getracht alle verschillende opwaardeerstappen die in dit document beschreven staan te testen en op alle mogelijke problemen die onze gebruikers zouden kunnen ondervinden te anticiperen.
pl: Próbowaliśmy przetestować wszystkie możliwe kombinacje poszczególnych kroków aktualizacji opisanych w tym dokumencie i przewidzieć wszystkie możliwe błędy, na jakie mogą natrafić nasi użytkownicy.
pt: Nós procuramos testar todos os diferentes passos de actualização descritos neste documento e também tentamos antecipar todos os possíveis problemas que os nossos utilizadores possam encontrar.
pt_br: Nós tentamos testar todos os diferentes passos de atualizações descritos neste documento bem como antecipar todos os possíveis problemas que nossos usuários possam encontrar.
ro: Noi am încercat să testăm toți pașii descriși în acest document și să anticipăm toate posibilele probleme pe care utilizatorii noștrii le-ar putea întâmpina.
ru: Мы пытались провести все возможные этапы обновления, описанные в этом документе, а также попытались предвидеть все возможные проблемы, с которыми могут столкнуться пользователи.
sk: Pokúsili sme sa otestovať všetky rozličné kroky aktualizácie popísané v tomto dokumente a tiež sme sa pokúsili predvídať všetky možné problémy, s ktorými sa naši používatelia môžu stretnúť.
sv: Vi har försökt att testa alla steg i uppgraderingen som beskrivs i det här dokumentet. Vi har också försökt förutse alla möjliga problem som kan inträffa för våra användare.
vi: Chúng tôi đã cố gắng thử tất cả các bước nâng cấp khác nhau được diễn tả trong tài liệu, và để đoán trước tất cả các vấn đề mà người dùng có thể gặp.
