Repository: lurdan/trans-ddp
Catalog: release-notes/*/about.po
Languages: be, de, fi, it, ja, lt, nb, nl, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: This document informs users of the &debian; distribution about major changes in version &release; (codenamed "&releasename;").
be: Гэты дакумент утрымлівае інфармацыю для карыстальнікаў дыстрыбутыву &debian; аб прынцыповых зменах у версіі &release; (кодавая назва "&releasename;").
fi: Tämä julkistusmuistio kertoo &debian; -jakelun käyttäjille version &release; suurista muutoksista (version koodinimi on "&releasename;").
nb: Dette dokumentet informerer brukerene av &debian; distribusjonen om de større endringene i versjonen &release; (kodenavn "&releasename;").
pt: Este documento informa os utilizadores da distribuição &debian; acerca das maiores alterações na versão &release; (com o nome de código "&releasename;").
sk: Tento dokument informuje používateľov distribúcie &debian; o hlavných zmenách vo verzii &release; (kódové označenie „&releasename;“).
zh_tw: 這份文件讓 &debian; 發行版的使用者能夠知道在 &release;（代碼 "&releasename;"）裡的一些重大改變。

source: The release notes provide information on how to upgrade safely from the release &oldrelease; (codenamed &oldreleasename;) to the current release and inform users of known potential issues they could encounter in that process.
zh_tw: 這份發行情報提供了如何才能平順得由 &oldrelease;（代碼 "&oldreleasename;"）升級到最新發行版的資訊，以及讓使用者知道在這個過程中可能會遭遇到的潛在問題。

source: You can get the most recent version of this document from <ulink url="&url-release-notes;"></ulink>. If in doubt, check the date of document at the first page and make sure you are reading a current version.
zh_tw: 您可以由 <ulink url="&url-release-notes;"></ulink> 取得這份文件的最新版，若無法確定，請檢查本文第一頁上的日期，並確定您所閱讀的是最新版本。

source: We have attempted to test all the different upgrade steps described in this document and we have also tried to anticipate all the possible issues our users might encounter.
zh_tw: 我們已盡其所能得去測試所有在本文中所提及的各式各樣升級步驟，同時我們也試著去假想使用者可能會遭遇到的所有問題。

source: Nevertheless, if you think you have found any bug in this documentation (incorrect information or information that is missing), please file a bug in the <ulink url="&url-bts;">bug tracking system</ulink> against the <systemitem role="package">release-notes</systemitem> package.
zh_tw: 儘管如此，如果您認為您找到了在本文中的任何錯誤，（不正確或未包含的資訊），請到 <ulink url="&url-bts;">錯誤回報系統</ulink> 向 <systemitem role="package">release-notes</systemitem> 套件發送錯誤回報。

source: TODO: check status of #494028 about apt-get vs. aptitude TODO: any more things to add here?
nb: Husk: Sjekk status på #494028 angående apt-get vs. aptitude Husk: Er det flere ting å huske på?
zh_tw: 待辨：check status of #494028 about apt-get vs. aptitude 待辨：any more things to add here?

source: The status of your package database before and after the upgrade: <command>dpkg</command>'s status database available at <filename>/var/lib/dpkg/status</filename> and <command>aptitude</command>'s package state information, available at <filename>/var/lib/aptitude/pkgstates</filename>. You should have made a backup before the upgrade as described at <xref linkend="data-backup"/> , but you can also find backups of this information in <filename>/var/backups</filename>.
zh_tw: 您的套件資料庫在升級前後的狀況：記錄 <command>dpkg</command> 的狀況的資料庫可於 <filename>/var/lib/dpkg/status</filename> 取得；而 <command>aptitude</command> 的套件狀態資訊可於 <filename>/var/lib/aptitude/pkgstates</filename> 取得。您應該在升級之前先根據 <xref linkend="data-backup"/> 裡的說明進行備份，但您也可以在 <filename>/var/backups</filename> 裡找到這些資訊的備份資料。

source: Session logs using <command>script</command>, as described in <xref linkend="record-session"/>.
zh_tw: 根據 <xref linkend="record-session"/> 裡所說明的，使用 <command>script</command> 所記錄下來的歷程資訊。

source: The source of this document is in DocBook XML<indexterm><primary>DocBook XML</primary></indexterm> format. The HTML version is generated using <systemitem role="package">docbook-xsl</systemitem> and <systemitem role="package">xsltproc</systemitem>. The PDF version is generated using <systemitem role="package">dblatex</systemitem> or <systemitem role="package">xmlroff</systemitem>. Sources for the Release Notes are available in the SVN repository of the <emphasis>Debian Documentation Project</emphasis>. You can use the <ulink url="&url-svn-release-notes;">web interface</ulink> to access its files individually through the web and see their changes. For more information on how to access the SVN please consult the <ulink url="&url-ddp-svn-info;">Debian Documentation Project SVN pages</ulink>.
zh_tw: 這份文件的原始文字是採用 DocBook XML <indexterm><primary>DocBook XML</primary></indexterm> 格式。而 HTML 版是使用 <systemitem role="package">docbook-xsl</systemitem> 以及 <systemitem role="package">xsltproc</systemitem> 產生的。PDF 版則是使用 <systemitem role="package">dblatex</systemitem> 或 <systemitem role="package">xmlroff</systemitem> 產生的。本發行情報的原始檔案可由 <emphasis>Debian 文庫專案</emphasis> 的 SVN 檔案庫中取得。您可以經由網路在 <ulink url="&url-svn-release-notes;">網頁介面</ulink> 自行取得這些資料，並檢視它們的更新歷程。請您到 <ulink url="&url-ddp-svn-info;">Debian 文庫專案的 SVN 頁面</ulink> 取得如何存取 SVN 的一些更詳盡資訊。

source: Nevertheless, if you think you have found a bug (incorrect information or information that is missing) in this documentation, please file a bug in the <ulink url="&url-bts;">bug tracking system</ulink> against the <systemitem role="package">release-notes</systemitem> package.
nb: Hvis du finner en feil (enten inkorrekt informasjon eller manglende informasjon) i dette dokumentet, så vær vennlig å rapporter dette som en feil i <ulink url="&url-bts;"> feilrapportsystemet</ulink> mot <systemitem role="package">release-notes</systemitem> pakken.
pt: Não obstante, se achar que encontrou qualquer bug nesta documentação (informação incorrecta ou informação em falta), por favor arquive o bug no <ulink url="&url-bts;">sistema de seguimento de bugs (bts)</ulink> contra o pacote <systemitem role="package">release-notes</systemitem>.
sk: Ak si napriek tomu myslíte, že ste našli akúkoľvek chybu (nesprávne alebo chýbajúce informácie) v tejto dokumentácii, prosím oznámte chybu do <ulink url="&url-bts;">systému sledovania chýb</ulink> voči balíku <systemitem role="package">release-notes</systemitem>.

source: The status of your package database before and after the upgrade: <command>dpkg</command>'s status database available at <filename>/var/lib/dpkg/status</filename> and <command>aptitude</command>'s package state information, available at <filename>/var/lib/aptitude/pkgstates</filename>. You should have made a backup before the upgrade as described at <xref linkend="data-backup"/>, but you can also find backups of this information in <filename>/var/backups</filename>.
nb: Tilstanden på din pakke database før og etter oppgraderingen: <command>dpkg</command> sin status er tilgjengelig i <filename>/var/lib/dpkg/status</filename> og <command>aptitude</command> sin status er tilgjengelig i <filename>/var/lib/aptitude/pkgstates</filename>. Du bør ta en sikkerhetskopi før oppgraderingen som beskrevet i <xref linkend="data-backup"/>, du burde også ha en kopi liggende i <filename>/var/backups</filename>.
pt: O estado da sua base de dados de pacotes antes e após a actualização: a base de dados do estado do <command>dpkg</command> disponível em <filename>/var/lib/dpkg/status</filename> e a informação do estado dos pacotes do <command>aptitude</command>, disponível em <filename>/var/lib/aptitude/pkgstates</filename>. Você deverá ter feito uma cópia de segurança antes da actualização conforme é descrito em <xref linkend="data-backup"/>, mas também poderá encontrar cópias de segurança desta informação em <filename>/var/backups</filename>.
sk: Stav vašej databázy balíkov pred a po aktualizácii: stavová databáza <command>dpkg</command> je dostupná v <filename>/var/lib/dpkg/status</filename> a stavová databáza <command>aptitude</command> je dostupná v <filename>/var/lib/aptitude/pkgstates</filename>. Pred aktualizáciou by ste mali vykonať zálohovanie ako popisuje <xref linkend="data-backup"/>, ale zálohy týchto informácií môžete tiež nájsť vo <filename>/var/backups</filename>.
