Repository: lurdan/trans-ddp
Catalog: release-notes/*/about.po
Languages: be, de, fi, it, ja, lt, nb, nl, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: Nevertheless, if you think you have found a bug (incorrect information or information that is missing) in this documentation, please file a bug in the <ulink url="&url-bts;">bug tracking system</ulink> against the <systemitem role="package">release-notes</systemitem> package. You might want to review first the <ulink url="&url-bts-rn;">existing bug reports</ulink> in case the issue you've found has already been reported. Feel free to add additional information to existing bug reports if you can contribute content for this document.
de: Falls Sie dennoch einen Fehler in diesem Dokument gefunden haben (fehlerhafte oder fehlende Informationen), senden Sie bitte einen entsprechenden Fehlerbericht über das Paket <systemitem role="package">release-notes</systemitem> an unsere <ulink url="&url-bts;">Fehlerdatenbank</ulink>. Sie können auch zunächst die <ulink url="&url-bts-rn;">bereits vorhandenen Fehlerberichte</ulink> lesen für den Fall, dass das Problem, welches Sie gefunden haben, schon berichtet wurde. Sie dürfen gerne zusätzliche Informationen zu solchen bereits vorhandenen Fehlerberichten hinzufügen, wenn Sie Inhalte zu diesem Dokument beitragen können.
it: Ciononostante, se si ritiene di aver trovato un qualsiasi errore in questa documentazione (informazioni non corrette o mancanti), si invii una segnalazione al <ulink url="&url-bts;">sistema di tracciamento dei bug</ulink> per il pacchetto <systemitem role="package">release-notes</systemitem>. Prima di inviare la segnalazione si dovrebbe verificare se tra le <ulink url="&url-bts-rn;">segnalazioni d'errore esistenti</ulink> non sia già presente il problema trovato. Chiunque è libero di aggiungere delle informazioni alle segnalazioni esistenti in modo da contribuire al contenuto di questo documento.
ja: それにもかかわらず、この文書にバグ (不正確な情報や抜け落ちている情報) を見つけたと思う場合には、<systemitem role="package">release-notes</systemitem> パッケージに対するバグ報告として、<ulink url="&url-bts;">バグ追跡システム</ulink>に提出してください。あなたが発見した問題が既に報告されている場合に備え、まずは<ulink url="&url-bts-rn;">既存のバグ報告</ulink>を確認してみると良いでしょう。もしこの文書にさらに内容を付加できるのであれば、どうぞ遠慮なく既存のバグ報告へ情報を追加して下さい.
nl: Denkt u dat u toch nog een probleem (foutieve of ontbrekende informatie) heeft gevonden in deze documentatie, dient u deze dan alstublieft in bij het <ulink url="&url-bts;">bug tracking system</ulink> tegen het pakket <systemitem role="package">release-notes</systemitem>. Het wordt aangeraden eerst <ulink url="&url-bts-rn;">bestaande bugrapporten</ulink> na te kijken, voor het geval dat het probleem dat u heeft gevonden al is gemeld. Voelt u zich vrij om extra informatie aan bestaande bugrapporten toe te voegen als u inhoud aan dit document kunt bijdragen.
pl: Niemniej, w przypadku znalezienia błędu (nieprawidłowej lub brakującej informacji) w niniejszej dokumentacji, proszę zgłosić błąd w <ulink url="&url-bts;">systemie śledzenia błędów</ulink> wobec pakietu <systemitem role="package">release-notes</systemitem> (po angielsku). Wcześniej, można przejrzeć <ulink url="&url-bts-rn;">listę istniejących zgłoszeń błędów</ulink>, aby uniknąć duplikatów. Proszę nie wahać się przed dodawaniem dodatkowych informacji do istniejących zgłoszeń błędów, jeśli poprawi to zawartość tego dokumentu. Informacje o błędach w samym tłumaczeniu uwag do wydania prosimy przesyłać na polskojęzyczną listę debian-l10n-polish.
pt_br: Apesar disso, se você acredita ter encontrado um bug (informação incorreta ou informação que está faltando) nesta documentação, por favor, registre um bug no <ulink url="&url-bts;">sistema de rastreamento de bugs</ulink> para o pacote <systemitem role="package">release-notes</systemitem>. É aconselhável que você reveja primeiro os <ulink url="&url-bts-rn;"> relatórios de bugs existentes</ulink> caso a questão que você encontrou já tenha sido relatada. Sinta-se livre para acrescentar informações adicionais aos relatórios de bugs existentes, se você puder contribuir com conteúdo para este documento.
ro: Totuși, dacă credeți că ați depistat o problemă (informații incorecte sau informații care lipsesc) în această documentație, vă rugăm să înregistrați un raport de problemă în <ulink url="&url-bts;">sistemul de raportare a problemelor</ulink> pentru pachetul <systemitem role="package">release-notes</systemitem>. În primul rând ar trebui să consultați <ulink url="&url-bts-rn;">rapoartele existente</ulink> în caz că problema găsită a fost deja raportată. Nu ezitați să adăugați informații suplimentare la rapoarte existente dacă puteți contribui conținut pentru acest document.
ru: Тем не менее, если вы думаете, что нашли ошибку в этом описании (есть неправильная или отсутствующая информация), пожалуйста, отправьте сообщение об ошибке в пакете <systemitem role="package">release-notes</systemitem> в <ulink url="&url-bts;">систему отслеживания ошибок</ulink>. Не забудьте сначала просмотреть <ulink url="&url-bts-rn;">существующие сообщения об ошибках</ulink>, возможно, о вашей проблеме уже известно. В этом случае вы можете послать дополнительную информацию к существующему сообщению об ошибке.
sv: Hur som helst, om du tror att du hittat ett fel (information som inte är rätt eller information som saknas) i detta dokument, vänligen lämna en felrapport i <ulink url="&url-bts;">felrapporteringssystemet</ulink> mot paketet <systemitem role="package">release-notes</systemitem>. Du bör först kontrollera de <ulink url="&url-bts-rn;">existerande felrapporterna</ulink> för att säkerställa att felet inte redan har hittats och blivit rapporterat. Kan du bidra med ytterligare information för dokumentet i en felrapport är du välkommen att göra så.

source: We appreciate, and encourage, reports providing patches to the document's sources. You will find more information describing how to obtain the sources of this document in <xref linkend="sources"/>.
de: Wir begrüßen Fehlerberichte, die Patches für den Quellcode des Dokuments anbieten und möchten Sie sogar ermuntern, solche einzureichen. Mehr Informationen darüber, wie Sie den Quellcode bekommen, finden Sie in <xref linkend="sources"/>.
it: Le segnalazioni con correzioni per i sorgenti del documento sono apprezzate e incoraggiate. In <xref linkend="sources"/> sono disponibili ulteriori informazioni su come ottenere i sorgenti di questo documento.
ja: 私たちは、この文書のソースへのパッチを含めた報告を歓迎・推奨します。このドキュメントのソースの取得方法の記述については <xref linkend="sources"/> で、より詳細な情報を見つけることができるでしょう。
nl: Wij waarderen en moedigen rapporten aan die verbeteringen aandragen voor de broncode van dit document. Meer informatie over het verkrijgen van de broncode van dit document kunt u vinden in <xref linkend="sources"/>.
pl: Cenimy i zalecamy zgłoszenia zawierające łatki do źródeł tego dokumentu. Więcej informacji o pobieraniu ich można znaleźć w <xref linkend="sources"/>.
pt_br: Apreciamos, e encorajamos, relatórios fornecendo patches para o código fonte deste documento. Você encontrará mais informações sobre como obter o código fonte deste documento na <xref linkend="sources"/>.
ro: Apreciem și încurajăm rapoarte care conțin și un petic (patch) pentru sursele documentului. Veți găsi mai multe informații despre cum se obțin sursele acestui document în <xref linkend="sources"/>.
ru: Мы были бы очень благодарны, если к сообщению была бы приложена заплата, исправляющая исходный текст документа. О том, где взять исходный текст данного документа, написано в <xref linkend="sources"/>.
sv: Vi uppskattar, och uppmuntrar, rapporter med rättelser till dokumentets källor. Du kan hitta mer information som beskriver hur du får tillgång till källan för detta dokument på <xref linkend="sources"/>.

source: Contributing upgrade reports
be: Як падзяліцца уласным досведам
de: Upgrade-Berichte zur Verfügung stellen
fi: Päivitysraporteilla avustaminen
it: Fornire resoconti di aggiornamento
ja: アップグレードについての報告をする
lt: Atnaujinimo pranešimų pateikimas
nb: Bidra med oppgraderingsrapporter
nl: Opwaardeerrapporten bijdragen
pl: Wysyłanie sprawozdań aktualizacji
pt: Contribuir com relatórios de actualização
pt_br: Contribuindo com relatórios de atualização
ro: Contribuirea cu rapoarte de instalare
ru: Предоставление отчёта об обновлении
sk: Ako posielať správy o aktualizácii
sv: Bidra med uppgraderingsrapporter
vi: Đóng góp báo cáo nâng cấp
zh_tw: 提交升級報告

source: We welcome any information from users related to upgrades from &oldreleasename; to &releasename;. If you are willing to share information please file a bug in the <ulink url="&url-bts;">bug tracking system</ulink> against the <systemitem role="package">upgrade-reports</systemitem> package with your results. We request that you compress any attachments that are included (using <command>gzip</command>).
be: Мы запрашаем усіх карыстальнікаў дзяліцца карыснай інфармацыяй адносна працэсу абнаўлення з "&oldreleasename;" да "&releasename;". Калі Вы жадаеце далучыцца да абмену досведам, дашліце сваю справаздачу праз <ulink url="&url-bts;">сістэму кантролю памылак</ulink> ў фармаце паведамлення аб памылцы пакета <systemitem role="package">upgrade-reports</systemitem>. Усе дададзеныя файлы трэба сціскаць з дапамогай праграмы <command>gzip</command>. Заўвага перакладчыкаў: згаданыя справаздачы варта запаўняць па англійску альбо звяртацца ў электронную рассылку debian-l10-belarusian@lists.debian.org, каб абмеркаваць магчымасць дапамогі з перакладам.
de: Wir begrüßen jede Information von unseren Benutzern, die sich auf ein Upgrade von &Oldreleasename; auf &Releasename; bezieht. Falls Sie solche Informationen bereitstellen möchten, senden Sie bitte einen Fehlerbericht mit den entsprechenden Informationen über das Paket <systemitem role="package">upgrade-reports</systemitem> an unsere <ulink url="&url-bts;">Fehlerdatenbank</ulink>. Wir bitten Sie, alle Anhänge, die Sie Ihrem Bericht beifügen, zu komprimieren (mit dem Befehl <command>gzip</command>).
fi: Kaikki käyttäjiltä tuleva tieto päivityksestä julkaisusta &oldreleasename; julkaisuun &releasename; on tervetullutta. Jos haluat avustaa, jaa kokemuksesi vikailmoituksella <ulink url="&url-bts;">vianseurantajärjestelmään</ulink> paketille <systemitem role="package">upgrade-reports</systemitem>. Pyydämme pakkaamaan kaikki liitteet (ohjelmalla <command>gzip</command>).
it: Ogni informazione dagli utenti inerente l'aggiornamento da &oldreleasename; a &releasename; è benvenuta. Se si desidera condividere informazioni, compilare una segnalazione nel <ulink url="&url-bts;">sistema di tracciamento dei bug</ulink> per il pacchetto <systemitem role="package">upgrade-reports</systemitem> con i risultati ottenuti. È richiesto che ogni eventuale allegato venga compresso usando <command>gzip</command>.
ja: &oldreleasename; から &releasename; へのアップグレードに関連するユーザからの情報はどんなものでも歓迎します。情報を共有するのを厭わない場合は、<systemitem role="package">upgrade-reports</systemitem> パッケージに対するバグ報告として、アップグレードの結果を含めて<ulink url="&url-bts;">バグ追跡システム</ulink>に提出してください。報告に添付ファイルを含める場合は、(<command>gzip</command> を使用して) 圧縮するようお願いします。
lt: Tikimės bet kokios informacijos iš naudotojų apie atliktą atnaujinimą iš &oldreleasename; į &releasename;. Jei norite pasidalinti šia informacija, praneškite savo atnaujinimo rezultatus <ulink url="&url-bts;">riktų sekimo sistemoje</ulink> kaip paketo <systemitem role="package">upgrade-reports</systemitem> riktą. Prašom suspausti bet kokius prie pranešimo prisegamus failus (naudojantis <command>gzip</command>).
nb: Vi tar gjerne i mot informasjon fra dere brukere angående hvordan det gikk når dere oppgraderte fra &oldreleasename; til &releasename;. Hvis dere er villige til å dele denne informasjonen, så rapportere dette i <ulink url="&url-bts;"> feilrapportsystemet</ulink> mot pakken <systemitem role="package">upgrade-reports</systemitem> . Vi ber deg å komprimere eventuelle vedlegg med kommandoen <command>gzip</command>.
nl: Wij waarderen alle informatie van gebruikers, die gerelateerd is aan opwaarderingen vanaf &oldreleasename; naar &releasename;. Indien u bereid bent informatie te delen, dient u dan alstublieft een bug met uw resultaten in bij het <ulink url="&url-bts;">bug tracking system</ulink> tegen het pakket <systemitem role="package">upgrade-reports</systemitem>. We verzoeken u om alle bijlagen te comprimeren (met behulp van <command>gzip</command>).
pl: Z chęcią przyjmiemy każdą informację (w języku angielskim) od użytkowników, związaną z aktualizacjami z wydania &oldreleasename; do &releasename;. Aby wysłać swoje informacje, proszę zgłosić błąd w <ulink url="&url-bts;">systemie śledzenia błędów</ulink> w odniesieniu do pakietu <systemitem role="package">upgrade-reports</systemitem> dołączając swoje wyniki. Prosimy skompresować załączniki (za pomocą programu <command>gzip</command>).
pt: É bem-vinda qualquer informação relatada dos utilizadores relacionada com actualizações a partir da &oldreleasename; para &releasename;. Se está disposto a partilhar informação por favor arquive um bug, com os seus resultados, no <ulink url="&url-bts;">sistema de seguimento de bugs (bts)</ulink> contra o pacote <systemitem role="package">upgrade-reports</systemitem>. Nós pedimos-lhe que comprima quaisquer ficheiros que sejam incluidos em anexo (utilizando o <command>gzip</command>).
pt_br: Nós apreciamos quaisquer informações dos usuários relacionadas a atualizações do &oldreleasename; para o &releasename;. Se você está interessado em compartilhar informação, por favor, registre um bug no <ulink url="&url-bts;">sistema de rastreamento de bugs</ulink> para o pacote <systemitem role="package">upgrade-reports</systemitem> com os seus resultados. Nós pedimos que você compacte quaisquer anexos que venha a incluir (usando o <command>gzip</command>).
ro: Orice informații de la utilizatori despre actualizări de la &oldreleasename; la &releasename; sunt binevenite. Dacă doriți să contribuiți informații vă rugăm să înregistrați un raport de problemă în <ulink url="&url-bts;">sistemul de raportare a problemelor</ulink> pentru pachetul <systemitem role="package">upgrade-reports</systemitem> cu rezultatele dumneavoastră. Vă rugăm comprimați orice atașamente incluse folosind <command>gzip</command>.
ru: Мы рады любой информации о проведённом обновлении с &oldreleasename; до &releasename; от пользователей. Если вы хотите поделиться своим опытом, отправьте сообщение об ошибке в пакете <systemitem role="package">upgrade-reports</systemitem> в <ulink url="&url-bts;"> систему отслеживания ошибок</ulink>, описав результаты. Пожалуйста сжимайте все прикладываемые к сообщению файлы (с помощью <command>gzip</command>).
sk: Vítané sú všetky informácie od používateľov, ktoré sa týkajú aktualizácie z &oldreleasename; na &releasename;. Ak ste ochotný podeliť sa o tieto informácie, nahláste prosím chybu s vašimi výsledkami do <ulink url="&url-bts;">systému sledovania chýb</ulink> voči balíku <systemitem role="package">upgrade-reports</systemitem>. Žiadame, aby ste všetky prípadné prílohy skomprimovali (pomocou <command>gzip</command>).
sv: Vi välkomnar all information från användare som relaterar till uppgraderingar från &oldreleasename; till &releasename;. Om du vill ge oss information kan du skicka in den genom en felrapport via <ulink url="&url-bts;">felrapporteringssystemet</ulink> mot paketet <systemitem role="package">upgrade-reports</systemitem> med dina erfarenheter. Vi önskar att du komprimerar eventuella bilagor som inkluderats (med gzip).
vi: Chúng tôi hoan nghênh các bạn đóng góp thông tin về tiến trình nâng cấp từ &oldreleasename; lên &releasename;. Nếu bạn muốn chia sẻ thông tin, hãy gửi một báo cáo lỗi dùng <ulink url="&url-bts;">hệ thống theo dõi lỗi</ulink> đối với gói tên <systemitem role="package">upgrade-reports</systemitem>, bao gồm kết quả của tiến trình. Cũng có thể đính kèm tập tin, miễn là bạn nén tập tin (dùng <command>gzip</command>) trước khi đính kèm báo cáo.
zh_tw: 我們十分歡迎使用者回報有關由 &oldreleasename; 升級至 &releasename; 的任何資訊。如果您願意分享這些資訊，請到 <ulink url="&url-bts;">錯誤回報系統</ulink> 將您的成果向 <systemitem role="package">upgrade-reports</systemitem> 套件發送錯誤回報。我們希望您能先將所有附加檔案（使用 <command>gzip</command>）壓縮後再進行傳送。

source: Please include the following information when submitting your upgrade report:
be: Справаздача аб абнаўленні абавязкова мусіць утрымліваць наступныя звесткі:
de: Bitte fügen Sie Ihrem Upgrade-Bericht folgende Informationen bei:
fi: Ilmoita seuraavat tiedot lähettäessäsi päivitysraporttia:
it: Quando si invia un resoconto di aggiornamento è necessario includere le seguenti informazioni:
ja: アップグレードについての報告を提出する際には、以下の情報を含めてください。
lt: Prašom įtraukti į pateikiamą pranešimą apie atnaujinimą šią informaciją:
nb: Vennligst inkluder følgende informasjon når du sender inn en oppgraderingsrapport:
nl: Voegt u alstublieft de volgende informatie bij wanneer u uw opwaarderingsrapport indient:
pl: Do swojego zgłoszenia prosimy dołączyć następujące informacje:
pt: Quando submeter o seu relatório de actualização por favor inclua a seguinte informação:
pt_br: Por favor, inclua as seguintes informações quando enviar seu relatório de atualização:
ro: Vă rugăm includeți următoarele informații când trimiteți un raport de actualizare
ru: Пожалуйста включите в отправляемое сообщение следующую информацию:
sk: Prosím, uveďte pri posielaní správ o aktualizácii nasledovné údaje:
sv: Inkludera följande information när du skickar in din uppgraderingsrapport:
vi: Hãy bao gồm thông tin theo đây khi đệ trình báo cáo nâng cấp:
zh_tw: 在遞交您的升級報告時，請包含以下資訊：

source: TODO: any more things to add here?
de: TODO: muss hier noch was ergänzt werden?
it: TODO: altro da aggiungere qui?
ja: TODO: ここに何か付け加える?
nl: TEDOEN: nog meer hier toe te voegen?

source: The status of your package database before and after the upgrade: <command>dpkg</command>'s status database available at <filename>/var/lib/dpkg/status</filename> and <systemitem role="package">apt</systemitem>'s package state information, available at <filename>/var/lib/apt/extended_states</filename>. You should have made a backup before the upgrade as described at <xref linkend="data-backup"/>, but you can also find backups of <filename>/var/lib/dpkg/status</filename> in <filename>/var/backups</filename>.
de: Den Status Ihrer Paketdatenbank vor und nach dem Upgrade: Die Statusdatenbank von <command>dpkg</command> finden Sie unter <filename>/var/lib/dpkg/status</filename>, die Paketstatusinformationen von <systemitem role="package">apt</systemitem> unter <filename>/var/lib/apt/extended_states</filename>. Sie sollten vor dem Upgrade eine Sicherung dieser Daten erstellen (wie unter <xref linkend="data-backup"/> beschrieben). Sie können Sicherungen von <filename>/var/lib/dpkg/status</filename> aber auch in <filename>/var/backups</filename> finden.
it: Lo stato del proprio database dei pacchetti prima e dopo l'aggiornamento: il database di <command>dpkg</command> dello stato dei pacchetti, disponibile in <filename>/var/lib/dpkg/status</filename> e il database di <systemitem role="package">aptitude</systemitem> dello stato dei pacchetti, disponibile in <filename>/var/lib/apt/extended_states</filename>. Prima di aggiornare si dovrebbe aver effettuato una copia di sicurezza, come descritto in <xref linkend="data-backup"/>, ma è anche possibile trovare copie di <filename>/var/lib/dpkg/status</filename> in <filename>/var/backups</filename>.
ja: アップグレード前後のパッケージデータベースの状態。<filename>/var/lib/dpkg/status</filename> にある <command>dpkg</command> の状態データベースと、<filename>/var/lib/apt/extended_states</filename> にある <systemitem role="package">apt</systemitem> のパッケージ状態情報です。<xref linkend="data-backup"/> で説明するように、アップグレードを実行する前にバックアップをとっておくべきですが、<filename>/var/lib/dpkg/status</filename> のバックアップは <filename>/var/backups</filename> にもあります。
nl: De status van uw pakketdatabase voor en na de opwaardering: de statusdatabase van <command>dpkg</command>, beschikbaar onder <filename>/var/lib/dpkg/status</filename> en de toestandsinformatie van <systemitem role="package">apt</systemitem>, beschikbaar onder <filename>/var/lib/apt/extended_states</filename>. Het is aan te raden een reservekopie te maken voor het opwaarderen, zoals beschreven in <xref linkend="data-backup"/>, maar u kunt ook reservekopieÃ«n van <filename>/var/lib/dpkg/status</filename> vinden in <filename>/var/backups</filename>.
pl: Status bazy pakietów przed i po aktualizacji: status bazy danych <command>dpkg</command> dostępny w <filename>/var/lib/dpkg/status</filename> i informacje o stanie pakietów <systemitem role="package">apt</systemitem>, zawarte w pliku <filename>/var/lib/apt/extended_states</filename>. Przed aktualizacją powinno się wykonać kopię zapasową, zgodnie z <xref linkend="data-backup"/>, lecz kopię <filename>/var/lib/dpkg/status</filename> można znaleźć również w <filename>/var/backups</filename>.
pt_br: O estado da sua base de dados de pacotes antes e depois da atualização: a base de dados de estados do <command>dpkg</command> está disponível em <filename>/var/lib/dpkg/status</filename> e a informação do estado dos pacotes do <systemitem role="package">apt</systemitem> está disponível em <filename>/var/lib/apt/extended_states</filename>. Você deve ter feito backup antes da atualização conforme descrito na <xref linkend="data-backup"/>, mas você também pode encontrar backups do <filename>/var/lib/dpkg/status</filename> em <filename>/var/backups</filename>.
ro: Starea bazei de date cu pachete înainte și după actualizare: baza de date de stare a programului <command>dpkg</command> disponibilă în <filename>/var/lib/dpkg/status</filename> și baza de date de stare a pachetelor a pachetului <systemitem role="package">apt</systemitem>, disponibilă în <filename>/var/lib/apt/extended_states</filename>. Ar fi trebuit să faceți o copie de siguranță înainte de actualizare, după cum e descris în <xref linkend="data-backup"/>, dar puteți găsi copii de siguranță pentru <filename>/var/lib/status</filename> în <filename>/var/backups</filename>.
ru: Состояние вашей базы данных пакетов до и после обновления: база данных <command>dpkg</command> содержится в файле <filename>/var/lib/dpkg/status</filename>, а <command>apt</command> &mdash; в файле <filename>/var/lib/apt/extended_states</filename>. Перед обновлением выполните резервное копирование согласно описанию <xref linkend="data-backup"/>, помимо этого, вы можете найти резервные копии <filename>/var/lib/dpkg/status</filename> в каталоге <filename>/var/backups</filename>.
sv: Statusen för paketdatabasen före och efter uppgraderingen: <command>dpkg</command>s statusdatabas finns tillgänglig i <filename>/var/lib/dpkg/status</filename> och <systemitem role="package">apt</systemitem>s statusinformation för paket finns i <filename>/var/lib/apt/extended_states</filename>. Du bör göra en säkerhetskopia före uppgraderingen, vilket beskrivs på <xref linkend="data-backup"/>, men du kan också hitta säkerhetskopior av <filename>/var/lib/dpkg/status</filename> i <filename>/var/backups</filename>.
