Repository: lurdan/trans-ddp
Catalog: release-notes/*/installing.po
Languages: be, de, fi, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: The installation media are now provided with an application that allows preparing the system to install Debian from Microsoft Windows environments.
be: Цяпер носьбіты з сістэмай усталявання утрымліваюць праграму, якая дазваляе падрыхтаваць сістэму да ўсталявання Debian з асяродку Microsoft Windows.
fi: Asennustaltiolla on nyt sovellus joka valmistelee järjestelmän siten, että Debianin voi asentaa Microsoft Windowsista.
ja: Microsoft Windows 環境から、Debian をインストールする準備を行うためのアプリケーションが、このインストールメディアで提供されるようになりました。
lt: Įdiegiklis dabar tiekiamas su programa, kuri leidžia parengti Debian sistemos įdiegimą Microsoft Windows aplinkoje.
nb: Installasjonsmedia inkluderer nå et program som gjør det mulig å starte installasjonen av Debian direkte fra Microsoft Windows.
sv: Installationsmediet levereras med ett program som gör det möjligt att förbereda systemet för att installera Debian direkt från Microsoft Windows.
vi: Các vật chứa cài đặt giờ có sẵn một ứng dụng cho phép chuẩn bị hệ thống để cài đặt Debian từ môi trường kiểu MS Windows.

source: <acronym>SATA</acronym> <acronym>RAID</acronym> support
be: Падтрымка <acronym>SATA</acronym> <acronym>RAID</acronym>
de: <acronym>SATA</acronym>-<acronym>RAID</acronym>-Unterstützung
fi: <acronym>SATA</acronym> <acronym>RAID</acronym> -tuki
ja: <acronym>SATA</acronym> <acronym>RAID</acronym> サポート
lt: <acronym>SATA</acronym> <acronym>RAID</acronym> palaikymas
nb: Støtte for <acronym>SATA</acronym> <acronym>RAID</acronym>
ru: Поддержка <acronym>SATA</acronym> <acronym>RAID</acronym>
sk: Podpora <acronym>SATA</acronym> <acronym>RAID</acronym>
sv: Stöd för <acronym>SATA</acronym> <acronym>RAID</acronym>
vi: Hỗ trợ <acronym>RAID</acronym> kiểu <acronym>SATA</acronym>

source: Early upgrade of packages with security fixes
be: Своечасовае абнаўленне пакетаў з заплаткамі бяспекі
de: Frühes Paket-Upgrade zur Behebung von Sicherheitsproblemen
fi: Tietoturvavikojen pikapäivitys
ja: セキュリティ上の修正も含めて、パッケージを早期に更新
lt: Ankstesnis paketų su saugumo pataisymais atnaujinimas
nb: Tidlig oppgradering av pakker med sikkerhetsfiks.
ru: Заблаговременное обновление пакетов, имеющих проблемы с безопасностью
sk: Včasná aktualizácia balíkov s bezpečnostnými záplatami
sv: tidig uppgradering av paket med säkerhetslagningar.
vi: Nâng cấp sớm gói chứa sự sửa chữa bảo mật

source: When used with functional network access, the installer will upgrade all packages that have been updated since the initial release of &releasename;. This upgrade happens during the installation step, before the installed system is booted.
be: Пры наяўнасці дзейснага доступу да сецiва праграма ўсталявання абновіць усе пакеты, якія змяніліся з часу пачатковага выпуску "&releasename;". Гэта адбываецца на этапе ўсталявання сістэмы, да таго, як яна будзе загружаная.
fi: Jos nettiyhteys toimii, päivittää asennin kaikki paketit joista on tullut uusi versio julkaisun &releasename; alkuperäisin julkaisun jälkeen. Tämä päivitys tehdään asennusvaiheessa, ennen kuin asennettu järjestelmä käynnistetään.
ja: 有効なネットワークへのアクセスが可能な場合、インストーラは、&releasename; の最初のリリース以降に更新されたパッケージをすべてアップグレードします。このアップグレードは、インストールされたシステムが起動される前、つまり、インストールの段階で発生します。
lt: Įdiegimo metu esant prieigai prie interneto, įdiegiklis atnaujins visus paketus, kurie buvo atnaujinti nuo pradinio &releasename; išleidimo. Šis atnaujinimas vyksta įdiegimo metu prieš įkeliant (boot) įdiegtą sistemą.
nb: Hvis et fungerende nettverk er tilgjengelig under installasjonen, så vil alle pakker som har blitt oppdatert siden utgivelsen av &releasename; bli oppgradert. Dette skjer under selve installasjonen, før systemet starter opp for første gang.
sv: När en fungerande nätverksanslutning tillhandahålls kommer installeraren att vilja uppgradera alla paket som har blivit uppgraderade sedan den första utgåvan av &releasename;. Denna uppgradering sker i installationssteget, före systemet startas.
vi: Khi dùng với truy cập mạng hoạt động, bản cài đặt sẽ nâng cấp tất cả các gói đã được cập nhật kể từ bản phát hành &releasename; đầu tiên. Nâng cấp này xảy ra trong bước cài đặt, trước khi hệ thống đã cài đặt được khởi động.

source: As a consequence, the installed system is less likely to be vulnerable to security issues that were discovered and fixed between the release time of &releasename; and the installation time.
be: У выніку змяншаецца верагоднасць таго, што ўсталяваная сістэма будзе мець праблемы бяспекі, якія былі выяўленыя і выпраўленыя паміж выпускам "&releasename;" і момантам усталявання.
de: Als Konsequenz daraus ist das installierte System wahrscheinlich weniger anfällig für Sicherheitslücken, die in der Zeit zwischen der Veröffentlichung von &Releasename; und der Installation entdeckt und behoben wurden.
fi: Tämän ansiosta asennettu järjestelmä on vähemmän haavoittuva &releasename;:n julkaisun ja asennushetken välillä löytyneille ja korjatuille tietoturvavioille.
ja: 結果として、インストールされたシステムは、&releasename; のリリースからインストールされるまでの間に発見・修正されたセキュリティ問題の脆弱性にされされる危険が低くなります。
lt: Taigi, mažiau tikėtina, kad sistema turės saugumo problemų, kurios buvo pastebėtos ir ištaisytos laikotarpyje tarp &releasename; išleidimo ir diegimo momento.
nb: Som en konsekvens av dette, så er det ferdige installerte systemet mye tryggere, ettersom alle feilfikser som har kommet siden &releasename;, nå kommer med i ditt nye system.
ru: В результате, установленная система будет более защищённой, так как проблемы с безопасностью, обнаруженные между выпусками &releasename;, будут устранены уже во время установки.
sk: To má za dôsledok, že nainštalovaný systém pravdepodobne obsahuje menej bezpečnostných zraniteľností, ktoré boli odhalené a opravené od vydania &releasename; a tiež skrátenú dobu inštalácie.
sv: Genom detta är det nyligen installerade systemet mindre troligen utsatt för säkerhetshot som har upptäckts och lagats mellan första utgåvan av &releasename; och installations mediet.
vi: Kết quả là hệ thống đã cài đặt ít có thể bị lỗ hổng bảo mật do vấn đề được phát hiện và sửa chữa kể từ phát hành &releasename;.

source: Support for <emphasis>volatile</emphasis>
be: Падтрымка зменлівых пакетаў (<emphasis>volatile</emphasis>)
de: Unterstützung für <emphasis>volatile</emphasis>
fi: <emphasis>volatile</emphasis>-tuki
ja: <emphasis>volatile</emphasis> のサポート
lt: Tankiai besikeičiančių paketų (<emphasis>volatile</emphasis>) palaikymas
nb: Støtte for <emphasis>volatile</emphasis>
ru: Поддержка часто меняющихся пакетов (<emphasis>volatile</emphasis>)
sk: Podpora <emphasis>volatile</emphasis>
sv: Stöd för <emphasis>volatile</emphasis> (ung. ombytlig)
vi: Hỗ trợ <emphasis>volatile</emphasis>

source: The installer can now optionally set up the installed system to use updated packages from <literal>volatile.debian.org</literal>. This archive hosts packages providing data that needs to be regularly updated over time, such as timezones definitions, anti-virus signature files, etc.
be: Па жаданні праграма ўсталявання можа наладзіць сістэму для працы са сховішчам зменлівых пакетаў <literal>volatile.debian.org</literal>. Пакеты, якія завуцца <quote>зменлівымі</quote>, утрымліваюць інфармацыю, што мусіць час ад часу абнаўляцца, і для якой не мае сэнсу выкарыстанне састарэлых версій (добрым прыкладам з'яўляюцца азначэнні зонаў часу, сігнатуры антывірусаў і г.д.).
fi: Haluttaessa asennettu järjestelmä käyttää päivitettyjä paketteja julkaisusta <literal>volatile.debian.org</literal>, asennin tekee tarvittavat asetukset. Tässä pakettivarastossa on paketteja jotka on päivitettävä säännöllisin väliajoin, kuten aikavyöhykemääritykset, virustorjunnan tunnistetiedot, jne.
ja: このインストーラは、オプションとして <literal>volatile.debian.org</literal> のパッケージを利用してシステムをセットアップできます。このアーカイブは、タイムゾーンの定義やアンチウイルスソフトのパターンファイルなど、時間とともに定期的な更新が必要なデータを含むパッケージを提供しています。
lt: Įdiegiklis dabar gali (jei tai pasirinksite) nustatyti, kad įdiegta sistema naudotų atnaujinimus ir iš <literal>volatile.debian.org</literal>. Šiame archyve saugomi paketai, kuriuose yra reguliariai besikeičiantys duomenys, pavyzdžiui, laiko zonų apibrėžimai, antivirusinių programų signatūrų failai ir pan.
nb: Du kan under installasjonen velge om du vil at ditt nye system skal settes opp til å også bruke pakker fra <literal>volatile.debian.org</literal>. Dette pakkearkivet inneholder pakker som det er naturlig å oppdatere ofte, slik som pakker som inneholder informasjon om definisjoner av tidssoner, antivirus signatur filer, osv.
sv: Installeraren kan nu som alternativ ställa in det installerade systemet att uppgradera paket från <literal>volatile.debian.org</literal>. Arkivet hanterar paket som tillhandahåller data som behöver uppdateras regelbumdet, exempelvis definitioner av tidszoner och signaturfiler för antivirus mm.
vi: Bản cài đặt giờ có tùy chọn thiết lập hệ thống đã cài đặt để sử dụng các gói cập nhật từ máy phục vụ <literal>volatile.debian.org</literal>. Kho này chứa các gói cung cấp dữ liệu mà yêu cầu cập nhật định kỳ, v.d. lời xác định múi giờ và tập tin chữ ký chống vi-rút.

source: New boot menu for Intel x86 and AMD64
be: Новае меню загрузки для Intel x86 ды AMD64
de: Neues Startmenü für Intel x86 und AMD64
fi: Uusi käynnistysvalikko Intel x86 ja AMD64 -laitealustoille
ja: Intel x86 と AMD64 用の新しいブートメニュー
lt: Naujas įkėlimo (boot) meniu Intel x86 ir AMD64 platformoms
nb: Ny oppstartemeny for Intel x86 og AMD64
ru: Новое загрузочное меню для Intel i386 и AMD64
sk: Nové menu zavádzača pre x386 a amd64
sv: Ny uppstartsmeny för Intel x86 och AMD64
vi: Trình đơn khởi động mới cho Intel x86 và AMD64

source: An interactive boot menu was added to make the choice of specific options and boot methods more intuitive for users.
be: Інтэрактыўнае меню загрузкі дапамагае зрабіць выбар спецыфічных параметраў і спосабаў загрузкі больш інтуітыўным.
de: Es wurde ein interaktives Startmenü hinzugefügt, um die Auswahl von spezifischen Optionen und Boot-Methoden für den Benutzer intuitiver zu machen.
fi: Vuorovaikutteisen valikon ansiosta erikoisvalitsimien ja käynnistystapojen valinta on havainnollisempaa.
ja: 詳細なオプションや起動方法を、ユーザがより直感的に選択出来るように、対話的なブートメニューが追加されました。
lt: Atsirado interaktyvus įkėlimo meniu, leidžiantis naudotojams lengviau pasirinkti specialius įkėlimo parametrus ir įkėlimo metodus.
nb: En interaktiv oppstartsmeny er lagd for å kunne støtte et mer intuitivt system for spesielle valg og oppstartsmetoder.
ru: Появилось интерактивное загрузочное меню, позволяющее настроить некоторые специальные параметры и выбрать метод загрузки.
sk: Bolo pridané menu zavádzača, aby bola voľba metód zavedenia systému a pridávanie volieb intuitívnejšie pre používateľa.
sv: En interaktic uppstartsmeny har lagts till för att förenkla användandet av specifika alternativ och uppstartsmetoder för användaren.
vi: Một trình đơn khởi động tương tác đã được thêm để làm cho việc đặt các tùy chọn riêng và phương pháp khởi động là trực giác hơn cho người dùng.

source: New ports
be: Новыя ўвасабленні
de: Neue Portierungen
fi: Uusia siirroksia
it: Nuovi port
ja: 新たな移植版
lt: Nauji perkėlimai (ports)
nb: Nye prosessorvarianter
pl: Nowe porty
ru: Новые переносы
sk: Nové porty
sv: Nya portar
vi: Bản chuyển mới

source: The armel architecture is now supported. Images for i386 Xen guests are also provided.
be: Цяпер падтрымліваецца архітэктура armel. Таксама даступныя адбіткі для i386 Xen guests.
de: Die Armel-Architektur wird jetzt unterstützt. Außerdem werden Images für i386-Xen-Gastsysteme angeboten.
fi: Laitealusta armel on nyt tuettu. Saatavilla on otokset myös i386 Xen-vieraille.
ja: armel アーキテクチャがサポートされました。i386 Xen 用のゲストイメージも提供されます。
lt: Dabar palaikoma ir armel architektūra. Taip pat pateikiami atvaizdai i386 Xen mašinoms-svečiams.
nb: Prosessorvarianten armel er nå støttet. Installasjonsmedier for i386 Xen gjest er også støttet.
ru: Теперь поддерживается архитектура armel. Также предоставляются образы гостевых машин i386 Xen.
sk: Architektúra armel je teraz podporovaná. Tiež sú poskytnuté hosťovské i386 Xen obrazy.
sv: Arkitekturen armel ingår numera i floran med arkitekturer som Debian fungerar på. Avbildningar för i386 Xen-gäster tillhandahålls också.
vi: Kiến trúc armel giờ được hỗ trợ. Cũng cung cấp các ảnh cho khách Xen i386.

source: Support for hardware speech synthesis devices
be: Падтрымка апаратных сінтэзатараў маўлення
de: Unterstützung für Hardware-Sprachausgaben
fi: Tuki puhesyntetisaattorilaitteille
ja: ハードウェア音声合成デバイスのサポート
lt: Aparatinių kalbos sintezės įrenginių palaikymas
nb: Støtte for hardware baserte talesynteser
ru: Поддержка устройств речевого синтеза
sk: Podpora zariadení na hardvérovú syntézu reči
sv: Stöd för hårdvarubaserade talsyntesenheter.
vi: Hỗ trợ thiết bị phần cứng tổng hợp tiếng nói

source: Several devices designed to provide hardware speech synthesis are now supported by the installer, therefore improving its accessibility for visually-impaired users. <indexterm><primary>visually-impaired users</primary></indexterm>
be: Праграма ўсталявання цяпер падтрымлівае некаторыя прылады для апаратнага сінтэзу маўлення, што мусіць дапамагчы карыстальнікам са слабым зрокам. <indexterm><primary>Карыстальнікі са слабым зрокам</primary></indexterm>
de: Mehrere Geräte, die Hardware-Speech-Synthesis zur Verfügung stellen, werden jetzt vom Installer unterstützt, was für sehbehinderte Nutzer den Zugang zum Installer verbessert. <indexterm><primary>sehbehinderte Nutzer</primary></indexterm>
fi: Asennin tukee nyt useita puhesyntetisaattorilaitteita, parantaen näin esteettömyyttä näkövammaisille. <indexterm><primary>näkövammaiset</primary></indexterm>
ja: ハードウェア音声合成を提供するよう設計されたいくつかのデバイスが、インストーラでサポートされました。これにより、視覚障害のあるユーザへのアクセシビリティが向上しました。<indexterm><primary>visually-impaired users</primary></indexterm>
lt: Dabar įdiegiklis palaiko keletą aparatinių kalbos sintezės įrenginių, taigi pagerėjo jo taikymas sutrikusio regėjimo naudotojams. <indexterm><primary>sutrikusio regėjimo naudotojai</primary></indexterm>
nb: Flere enheter som sørger for hardware basert talesyntese er nå støttet for bruk sammen med Debian Installer, noe som bedrer støtten for bruker med nedsatt syn. <indexterm><primary>brukere med nedsatt syn</primary></indexterm>
ru: Теперь программа установки поддерживает некоторые устройства синтеза речи, что делает её более доступной для пользователей с плохим зрением. <indexterm><primary>пользователи с плохим зрением</primary></indexterm>
sk: Inštalátor teraz podporuje niekoľko zariadení určených na hardvérovú syntézu reči, čo zlepšuje jeho prístupnosť zrakovo postihnutým používateľom. <indexterm><primary>visually-impaired users</primary></indexterm>
sv: Ett flertal enheter för hårdvarubaserad talsyntes kan nu användas tillsammans med installeraren, detta förbättrar tillgängligheten för användare med synnedsättning. <indexterm><primary>synnedsättning</primary></indexterm>
vi: Vài thiết bị được thiết kế đổ cung cấp chức năng phần cứng tổng hợp tiếng nói giờ được bản cài đặt hỗ trợ, vì vậy cải tiến khả năng truy cập cho người dùng thị lực kém. <indexterm><primary>người dùng thị lực kém</primary></indexterm>

source: Support for <literal>relatime</literal> mount options
be: Падтрымка параметра мацавання <literal>relatime</literal>
de: Unterstützung für die mount-Option <literal>relatime</literal>
fi: Tuki liitosvalitsimelle <literal>relatime</literal>
ja: <literal>relatime</literal> マウントオプションをサポート
lt: Palaikomi <literal>relatime</literal> prijungimo parametrai
nb: Støtte for monteringsalternativet <literal>relatime</literal>
ru: Поддержка параметров монтирования <literal>relatime</literal>
sk: Podpora volieb mount <literal>relatime</literal>
sv: Stöd för monteringsalternativet <literal>relatime</literal>.
vi: Hỗ trợ các tùy chọn gắn kết <literal>relatime</literal>

source: The installer can now set up partitions with the <literal>relatime</literal> mount option, so that access time on files and directories is updated only if the previous access time was earlier than the current modify or change time.
be: Цяпер праграма ўсталявання можа наладжваць для падзелаў дыску параметр мацавання <literal>relatime</literal>, які дазваляе змяняць час доступу да файлаў і каталогаў толькі ў тым выпадку, калі папярэдні час доступу быў меншы за час змены файла.
fi: Asennin osaa nyt tehdä tiedostojärjestelmät käyttämään valitsinta <literal>relatime</literal>, jolloin tiedostojen ja hakemistojen lukemisaikaleimaa päivitetään vain jos se oli aikaisempi kuin sisällön tai hakemistotietueen muutosaikaleima.
ja: このインストーラでは、<literal>relatime</literal> マウントオプションを付けるようパーティションをセットアップ出来ます。これは、以前のアクセス時刻が現在の修正もしくは変更時刻よりも前の場合だけ、ファイルやディレクトリへのアクセス時刻を更新するというものです。
lt: Įdiegiklis dabar leidžia nustatyti disko skirsnių prijungimą su <literal>relatime</literal> parametrais, leisdamas kreipties į failus ar katalogu laiko žymę atnaujinti tik jei ankstesnės kreipties laikas buvo ankstyvesnis negu esamas duomenų ar metaduomenų pakeitimo laikas.
nb: Debian Installer kan nå sette opp partisjoner med monteringsalternativet <literal>relatime</literal>, dette innebærer at tidsstempelet for sist bruk av filen kun oppdateres hvis tidligere tidstempel er tidligere enn gjeldende tid for endring eller modifikasjon.
sv: Installeraren kan nu ställa in partitioner med monteringsalternativet <literal>relatime</literal>, detta innebär att tidsstämpeln för åtkomsttid för filer och kataloger bara uppdateras om den tidigare angivna tidsstämpeln var i förfluten tid relativt till den som ska anges med modifieringskommandot.
vi: Bản cài đặt giờ có khả năng thiết lập phân vùng với tùy chọn gắn kết <literal>relatime</literal> để mà thời gian truy cập đến tập tin và thư mục được cập nhật chỉ nếu thời gian truy cập trước nằm trước thời gian sửa đổi hiện thời.

source: NTP clock synchronization at installation time
be: Сінхранізацыя гадзінніка праз NTP падчас усталявання
de: NTP-Uhrzeit-Synchronisation während der Installation
fi: Kello aikaan NTP:llä asennusvaiheessa
ja: インストール時の NTP 時刻同期
lt: Laikrodžio sinchronizavimas su NTP įdiegimo metu
nb: Klokkesynkronisering med NTP under installasjon
ru: Синхронизация часов по NTP во время установки
sk: Synchronizácia času pomocou NTP počas inštalácie
sv: Klocksynkronisering med NTP vid installationstillfället
vi: Đồng hồ NTP đồng bộ vào lúc cài đặt

source: The computer clock is now synchronized with NTP servers over the network during installation so that the installed system immediately has an accurate clock.
be: Падчас усталявання гадзіннік камп'ютэра сінхранізуецца праз сеціва з серверамі NTP, у выніку чаго ўсталяваная сістэма адразу мае дакладна наладжаны гадзіннік.
de: Die Uhr des Rechners wird jetzt während der Installation mit NTP-Servern im Netzwerk (oder Internet) synchronisiert, so dass das installierte System unmittelbar eine korrekte Uhrzeit hat.
fi: Tietokoneen kello asetetaan nyt verkon NTP-palvelimilta saatuun oikeaan aikaan asennusvaiheessa, jolloin asennetussa järjestelmässä on heti tarkka kellonaika.
ja: コンピュータの内部時計は、インストール中にネットワーク越しに NTP サーバと同期されます。したがって、インストールされたシステムは、すぐに正確な時刻を示します。
lt: Kompiuterio laikrodis dabar sinchronizuojamas su NTP serveriais per tinklą diegimo metu, kad įdiegtos sistemos laikrodis iškart būtų teisingai nustatytas.
nb: Datamaskinens klokke blir nå synkronisert med en NTP server over nettverk under installasjonen, slik at det nye systemet har helt nøyaktig klokke.
ru: Часы компьютера теперь синхронизируются с NTP серверами по сети во время установки, что позволяет сразу получить в устанавливаемой системе точное время.
sk: Hodiny počítača sa teraz aktualizujú s NTP servermi prostredníctvom siete počas inštalácie, takže nainštalovaný systém má okamžite presný čas.
sv: Datorns klocka synkrosniserad med NTP-servrar över nätverket vid installtionen så att det installerade systemet omedelbart har korrekt tid angiven.
vi: Đồng hồ máy tính giờ được đồng bộ với máy phục vụ NTP (giao thức thời gian mạng) qua mạng trong khi cài đặt, để hệ thống đã cài đặt cũng ngay có một đồng hồ đúng.

source: New languages
be: Новыя мовы
de: Neue Sprachen
fi: Uudet kielet
it: Nuove lingue
ja: 新しい言語
lt: Naujos kalbos
nb: Nye språk
pl: Nowe języki
pt: Novos idiomas
pt_br: Novos idiomas
ro: Limbi noi
ru: Новые языки интерфейса
sk: Nové jazyky
sv: Nya språk
vi: Ngôn ngữ bổ sung
zh_tw: 新語系
