Repository: lurdan/trans-ddp
Catalog: release-notes/*/installing.po
Languages: be, de, fi, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: All operands are optional.
be: Усе складнікі з'яўляюцца неабавязковымі
de: Alle Operanden sind optional.
ja: どの項目も省略可能です。
lt: Visi operandai yra neprivalomi.
nb: Alle operatorer er valgfrie.
ru: Все части необязательны.
sk: Každý z operandov je nepovinný
sv: Alla operatorer är valbara.
vi: Mọi toán tử đều vẫn tuỳ chọn.
zh_tw: 所有的運算元都是可有可無的。

source: <varname>driver</varname>
be: <varname>драйвер</varname>
de: <varname>Treiber</varname>
ja: <varname>ドライバー</varname>
ru: <varname>драйвер</varname>
sk: <varname>ovládač</varname>
sv: <varname>drivrutin</varname>
vi: <varname>trình_điều_khiển</varname>

source: The driver for the employed Braille display. Here, you must enter either a code consisting of two letters or the word <literal>auto</literal>. If this argument is not entered, the automated recognition is activated by default.
be: Драйвер для брайлеўскага дысплэю, які выкарыстоўваецца. Тут неабходна увесці код з двух літар альбо слова <literal>auto</literal>. Калі параметр адсутнічае, ўжываецца рэжым аўтаматычнае выяўлення.
ja: 使用する点字ディスプレイのドライバです。ここでは、2 文字のコードもしくは <literal>auto</literal> という単語を入力する必要があります。この引数が入力されなかった場合は、デフォルトで自動認識が有効になります。
lt: Naudojamo Brailio rašto ekrano tvarkyklė. Čia turite įvesti arba kodą, susidedantį iš dviejų raidžių, arba žodį <literal>auto</literal>. Jei šis argumentas ir nėra įrašytas, automatizuotas nustatymas yra numatytasis.
nb: Driveren for den aktuelle Braille leselist. Her må du enten oppgi en to-bokstavers kode eller ordet <literal>auto</literal>. Hvis du ikke oppgir noe her, så blir automatisk gjenkjenning benyttet.
sv: Drivrutinen för punktskriftsvisaren. Ange en kod som består av två tecken eller ordet <literal>auto</literal>. Om du inte anger något argument komer automatisk igenkänning att användas.
vi: Trình điều khiển cho thiết bị hiển thị chữ nổi đang được dùng. Bạn nên thay thế chuỗi <varname>trình_điều_khiển</varname> bằng hoặc một mã ký tự đôi hoặc từ <literal>auto</literal> (tự động). Không nhập đối số này thì chức năng tự động nhận ra được kích hoạt theo mặc định.

source: <varname>device</varname>
be: <varname>прылада</varname>
de: <varname>Gerät</varname>
ja: <varname>デバイス</varname>
ru: <varname>устройство</varname>
sk: <varname>zariadenie</varname>
sv: <varname>enhet</varname>
vi: <varname>thiết_bị</varname>

source: The device can be entered as relative to /dev/ as well as an absolute specification.
be: Назва файлу прылады можа быць вызначаная адносна дырэкторыі /dev, або як абсалютная назва файла.
de: Der Anschluss kann sowohl relativ zu /dev/ als auch als absolute Angabe eingegeben werden.
ja: デバイスは、/dev/ からの相対パスでも、絶対パスでも入力出来ます。
lt: Įrenginys gali būti įrašytas arba santykinai katalogo /dev/ atžvilgiu, arba pilnas kelias.
nb: Enheten kan oppgis relativt til /dev/ eller som en absolutt lokasjon.
ru: Устройство можно вводить относительно каталога /dev/ или в виде абсолютного пути.
sk: Zariadenie môžete zadať relatívne k /dev/ ako aj s absolútnou cestou.
sv: Enheten kan anges relativt från /dev/ eller som en absolut sökväg.
vi: Thiết bị có thể được nhập như tương đối với thư mục <filename>/dev/</filename>, cũng như một đặc tả tuyệt đối.
zh_tw: 裝置可以如此輸入：使用 /dev 下的相對路徑，或是使用絕對路徑。

source: <varname>table</varname>
be: <varname>табліца</varname>
de: <varname>Tabelle</varname>
ja: <varname>点字表</varname>
ru: <varname>таблица</varname>
sk: <varname>tabuľka</varname>
sv: <varname>tabell</varname>
vi: <varname>bảng_chữ</varname>

source: Defines the Braille table for the desired language. By default, the US table is employed.
be: Вызначае табліцу Брайля для патрэбнай мовы. Калі параметр адсутнічае, ўжываецца амерыканская табліца.
ja: 希望する言語の点字表を指定します。デフォルトでは、US の点字表が使われます。
lt: Nurodo norimos kalbos Brailio lentelę. Numatytoji yra amerikiečių lentelė.
nb: Angir ønsket Braille tabell for valgt språk. Som standard så er det amerikansk tabell som brukes.
sv: Anger punktskriftstabell för aktuellt språk. Standardvalet är amerikansk tabell.
vi: Xác định bảng chữ nổi cho ngôn ngữ đã muốn. Mặc định là dùng bảng Mỹ.

source: Examples
be: Прыклады
de: Beispiele
ja: 例
lt: Pavyzdžiai
nb: Eksempler
ru: Примеры
sk: Príklady
sv: Exempel
vi: Ví dụ
zh_tw: 範例

source: brltty=ht,ttyS0,de
vi: brltty=ht,ttyS0,vi

source: The Handy Tech Driver is used. The Braille display is connected to Com1. The German Braille table is used.
be: Ужываецца драйвер Handy Tech. Дысплэй далучаны да порту Com1. Нямецкая табліца.
ja: Handy Tech Driver が使われます。点字ディスプレイは、Com1 に接続されています。ドイツ語の点字表が使われます。
lt: Naudojama tvarkyklė Handy Tech. Brailio ekranas yra prijungtas prie nuosekliosios jungties COM1. Naudojama vokiečių Brailio lentelė.
nb: Handy Tech driveren brukes. Braille leselist er koblet opp på serieport Com1. Tysk Braille tabell er brukt.
sv: Här används Handy Tech Driver. Punktskriftsvisaren är ansluten på kommunikationsport 1. Den tyska punktsskriftstabellen används.
vi: Dùng trình điều khiển Handy Tech Driver. Màn hình chữ nổi được kết nối đến cổng Com1. Cũng dùng bảng chữ nổi tiếng Việt dựng sẵn.

source: brltty=,,de
vi: brltty=,,vi

source: Here, only the German Braille table is specified. Therefore, BrlTTY will try to find a Braille display at a <acronym>USB</acronym> port.
be: Вызначанае толькі ўжыванне нямецкай табліцы. Адпаведна, BrlTTY паспрабуе самастойна знайсці брайлеўскі дысплэй, далучаны да порту <acronym>USB</acronym>.
ja: ここでは、ドイツ語の点字表のみ指定されています。したがって、BrlTTY は <acronym>USB</acronym> ポートから点字ディスプレイを探そうとします。
lt: Čia nurodyta tik vokiečių Brailio lentelė. Todėl BrlTTY stengsis rasti Brailio ekraną, prijungtą prie <acronym>USB</acronym> jungties.
nb: Her er bare tysk tabell oppgitt. BrlTTY forsøker her da å finne Braille leseren på <acronym>USB</acronym> porten.
sv: Här specificeras endast att den tyska punktskriftstabellen ska användas. BrlTTY kommer därför att försöka hitta en punktskriftsvisare på en <acronym>USB</acronym>-port.
vi: Ở đây thì chỉ xác định bảng chữ nổi tiếng Việt. Vì vậy, trình BrlTTY sẽ thử tìm màn hình chữ nổi trên một cổng <acronym>USB</acronym>.

source: Install &debian; with a hardware speech synthesis
be: Усталяванне &debian; з дапамогай апаратнага сінтэзу маўлення
de: Installieren Sie &debian; mit Hardware-Sprachausgaben
ja: ハードウェア音声合成を利用して &debian; をインストール
lt: &debian; diegimas naudojant aparatinę kalbos sintezę
nb: Installer &debian; med en hardware basert talesyntese
ru: Установка &debian; с помощью устройств речевого синтеза
sk: Nainštalovať &debian; s hardvérovou syntézou reči
sv: Installera &debian; med hårdvara för skärmuppläsning
vi: Cài đặt &debian; với thiết bị tổng hợp tiếng nói

source: Support for hardware speech synthesis is only available in the textual version of the installer. For size reasons, however, it is enabled along with support for the graphical installer, which needs more space anyway. You thus need to select the <computeroutput>Graphical install</computeroutput> entry in the boot menu.
be: Падтрымка апаратнага сінтэзу маўлення магчымая толькі ў тэкставым рэжыме праграмы ўсталявання. Але з прычыны памеру яна ўключаецца разам з рэжымам графічнага ўсталявання, які ў любым адно патрабуе дадатковага месца. Адпаведна, для актывацыі рэжыму трэба абраць пункт меню загрузкі <computeroutput>Усталяванне ў графічным рэжыме</computeroutput>.
ja: ハードウェア音声合成のサポートは、テキストバージョンのインストーラでのみ有効です。しかしながら、サイズ上の理由から、どうしても多くの容量が必要なグラフィカルインストーラのサポートで有効になっています。そのため、ブートメニューのエントリで <computeroutput>Graphical install</computeroutput> を選択する必要があります。
lt: Aparatinės kalbos sintezės palaikymas yra įjungtas tik tekstiniame įdiegiklio veikimo režime.
nb: Støtte for hardware basert talesyntese fungerer kun sammen med tekstversjonen av Installeren. På grunn av plasshensyn, så finnes dette kun på installasjonsmedier som også inneholder den grafiske Installeren. Du må derfor velge <computeroutput>Graphical install</computeroutput> i oppstartsmenyen.
sv: Stöd för hårdvara som läser upp skärminnehållet finns bara i textversionen av installeraren. Av utrymmesskäl finns detta dock bara på installationsmedia som även innehåller den grafiska installeraren. Du måste därför välja <computeroutput>Grafisk installation</computeroutput> i uppstartsmenyn.
vi: Hỗ trợ phần cứng tổng hợp tiếng nói chỉ sẵn sàng trong phiên bản dựa vào ký tự của trình cài đặt. Vì lý do kích cỡ, tuy nhiên, nó được hiệu lực cùng với hỗ trợ trình cài đặt kiểu đồ họa, mà cũng chiếm nhiều sức chứa hơn. Do đó bạn cần phải chọn mục <computeroutput>Cài đặt đồ họa</computeroutput> trong trình đơn khởi động.

source: Hardware speech synthesis can not be automatically detected. You thus need to append the <userinput>speakup.synth=driver</userinput> boot parameter to tell Speakup which driver it should use. <userinput>driver</userinput> should be replaced by the driver code for your device, see <ulink url="&url-speakup-driver-codes;"></ulink> for a list. The textual version of the installer will then be automatically selected, and support for the speech synthesis will be automatically installed on the target system.
be: Аўтаматычнае выяўленне апаратнага сінтэзатару маўлення не падтрымліваецца, таму трэба дадаць параметр загрузкі <userinput>speakup.synth=driver</userinput>, каб паведаміць праграме Speakup, які драйвер выкарыстоўваць. Замест слова <userinput>driver</userinput> трэба ўвесці код драйвера для Вашай прылады (гл. спіс кодаў на старонцы <ulink url="&url-speakup-driver-codes;"></ulink>). Пасля гэтага адбудзецца аўтаматычны пераход у тэкставы рэжым усталявання, а ў выніковую сістэму (таксама аўтаматычна) будзе даданая падтрымка сінтэзу маўлення.
ja: ハードウェア音声合成は自動的に検出することはできません。そのためブートパラメータに <userinput>speakup.synth=driver</userinput> を追加して、どのドライバを使用すべきか教える必要があります。<userinput>driver</userinput> は使用しているデバイスに合ったドライバで置き換える必要があるので、<ulink url="&url-speakup-driver-codes;"></ulink> のリストを参照してください。テキストバージョンのインストーラは自動的に選択され、音声合成のサポートはターゲットシステム上に自動的にインストールされます。
lt: Aparatinės kalbos sintezės įranga negali būti automatiškai aptikta. Todėl reikia pridėti įkėlimo parametrą <userinput>speakup.synth=driver</userinput>, tuo pasakant, kokia tvarkyklė turi būti naudojama. Žodis <userinput>driver</userinput> turėtų būti pakeistas konkretaus įrenginio kodu, kurių sąrašą žiūr. čia: <ulink url="&url-speakup-driver-codes;"></ulink>. Tuomet bus automatiškai pasirinkta tekstinė įdiegiklio versija ir kalbos sintezės palaikymas bus automatiškai įdiegtas diegimo metu.
nb: Støtte for hardware basert talesyntese kan ikke oppdages automatisk. Du må derfor tilføye som parameter hvilken Speakup driver som skal brukes ved å bruke <userinput>speakup.synth=driver</userinput>. Du må bytte ut <userinput>driver</userinput> med korrekt driver for din enhet, se <ulink url="&url-speakup-driver-codes;"></ulink> for en liste over hvilke som er tilgjengelige. Den tekstbaserte versjonen vil bli valgt, og støtte for talesyntese vil automatisk bli installert på ditt system.
sk: Hardvérovú syntézu reči nie je možné zistiť automaticky. Preto musíte pridať zavádzací parameter <userinput>speakup.synth=driver</userinput>, aby ste dali vedieť programu Speakup ktorý ovládač má použiť. <userinput>ovládač</userinput> nahraďte označením ovládača, <ulink url="&url-speakup-driver-codes;"></ulink> obsahuje ich zoznam. Potom sa automaticky vyberie textová verzia inštalátora a na cieľový systém sa automaticky nainštaluje podpora syntézy reči.
sv: Stöd för hårdvarubaserad uppläsning kan inte aktiveras automatiska. På grund av detta måste du ange <userinput>speakup.synth=drivrutin</userinput> som uppstarts-flagga för att ange vilken drivrutin för hårdvarubaserad uppläsning som ska användas.<userinput>drivrutin</userinput> ska ersättas med den namnet på den drivrutin som används för din enhet. En komplett lista med fungerande drivrutiner finns på <ulink url="&url-speakup-driver-codes;"></ulink>. Nu kommer textversionen av installeraren att startas och stöd för skärmuppläsning att installeras på systemet.
vi: Cũng có thể tự động phát hiện phần cứng tổng hợp tiếng nói. Vì vậy bạn cần phải phụ thêm tham số khởi động <userinput>speakup.synth=trình_điều_khiển</userinput> để báo phần mềm Speakup nên dùng trình điều khiển nào. Chuỗi <userinput>trình_điều_khiển</userinput> nên được thay thế bằng mã trình điều khiển cho thiết bị tổng hợp tiếng nói, xem <ulink url="&url-speakup-driver-codes;"></ulink>

source: There has been a lot of development on the Debian Installer since its first official release with &debian; 3.1 (<quote>sarge</quote>) resulting in both improved hardware support and some exciting new features.
de: Es wurde am Debian-Installer seit seinem ersten offiziellen Erscheinen in &debian; 3.1 (<quote>Sarge</quote>) viel entwickelt, was zu verbesserter Hardware-Unterstützung sowie einigen spannenden neuen Funktionen führt.
ru: Всё время с последнего официального выпуска &debian; 3.1 (sarge) велась активная разработка программы установки Debian. В результате улучшилась работа с аппаратным обеспечением и были добавлены новые захватывающие возможности.
sk: Debian Installer prešiel množstvom vývoja od svojho prvého oficálneho vydania v &debian; 3.1 („sarge“), čo prinieslo zlepšenú poporu hardvéru aj niektoré vzrušujúce nové vlastnosti.

source: The installation media are now provided with an application that allows preparing the system to install Debian, from Microsoft Windows environments.
de: Die Installationsmedien bieten jetzt ein Hilfsprogramm, das in den Microsoft Windows-Umgebungen läuft und erlaubt, vorbereitende Schritte für eine Debian-Installation durchzuführen.
ru: На установочном носителе теперь есть приложение, которое позволяет подготовить систему к установке Debian из окружения Microsoft Windows.
sk: Inštalačné nosiče teraz obsahujú aplikáciu, ktorá umožňuje pripraviť systém na inštaláciu Debianu z prostredia Microsoft Windows.

source: When used with a functional network access, the installer will upgrade all packages that were updated since the initial release of &releasename;. This upgrade happens during the installation step, before the installed system is booted.
de: Bei Verwendung mit einem funktionsfähigen Netzwerkzugang wird der Installer für all die Pakete ein Upgrade auf den neuesten Stand durchführen, für die seit der ursprünglichen Veröffentlichung von &Releasename; eine Aktualisierung veröffentlicht wurde. Dieses Upgrade findet noch während der Installation statt, bevor das neu installierte System bootet.
ru: Если при использовании имеется доступ к сети, программа установки обновит все пакеты, у которых есть обновления считая от начального выпуска &releasename;. Это обновление произойдёт во время установки, перед тем как установленная система будет загружена.
sk: Keď použijete inštalátor s fungujúcim pripojením k sieti, aktualizuje všetky balíky, ktoré boli od pôvodného vydania &releasename; aktualizované. Táto aktualizácia sa deje počas inštalačného kroku predtým, než sa nový systém zavedie.

source: The installer can now optionally setup the installed system to use updated packages from <literal>volatile.debian.org</literal>. That archive hosts packages that provide data that needs to be regularly updated over time, such as timezones definitions, anti-virus signature files, etc.
de: Der Installer kann jetzt optional das zu installierende System so einrichten, dass aktualisierte Pakete von <literal>volatile.debian.org</literal> verwendet werden. Dieses Archiv beherbergt Pakete, deren enthaltene Daten über die Zeit regelmäßig aktualisiert werden müssen, wie Zeitzonen-Definitionen, Antiviren-Signatur-Dateien usw.
ru: Теперь по вашему желаю программа установки может настроить в устанавливаемой системе обновление пакетов с <literal>volatile.debian.org</literal>. В этом архиве хранятся пакеты, которые содержат регулярно изменяющиеся со временем данные, например, описание часовых поясов, файлы антивирусных баз данных и т.д.
sk: Inštalátor teraz dokáže voliteľne nastaviť inštalovaný systém tak, aby používal aktualizované balíky z <literal>volatile.debian.org</literal>. Tento archív obsahuje balíky, ktoré poskytujú údaje, ktoré je potrebné často aktualizovať ako definície časových pásiem, súbory so signatúrami antivírusov atď.

source: The installer can now setup partitions with the <literal>relatime</literal> mount option, allowing access time on files and directories to be updated only if the previous access time was earlier than the current modify or change time.
de: Der Installer kann jetzt Partitionen mit der mount-Option <literal>relatime</literal> einrichten, was ermöglicht, die Zeitangabe des letzten Zugriffs auf eine Datei oder ein Verzeichnis nur dann zu aktualisieren, wenn die vorherige Zugriffszeit vor der aktuellen Modifikations- oder Änderungszeit liegt.
ru: Теперь программа установки настраивает разделы с параметром монтирования <literal>relatime</literal>, который позволяет обновлять метку времени доступа файлов и каталогов только, если предыдущая метка доступа указывает на время раньше, чем текущие метки время изменения данных или метаданных.
sk: Inštalátor teraz dokáže nastaviť diskové oblasti so zapnutou voľbou <literal>relatime</literal>, čo umožňuje aktualizovať čas prístupu k adresárom a súborom iba ak bol predošlý čas prístupu skorší ako aktuálny čas zmeny.

source: Thanks to the huge efforts of translators, Debian can now be installed in 63 languages (50 using the text-based installation user interface and 13 supported only with the graphical user interface). This is five languages more than in &oldreleasename;. Languages added in this release include Amharic, Marathi, Irish, Northern Sami, Serbian. Due to lack of translation updates, one language has been dropped in this release: Estonian. Another language that was disabled in &oldreleasename; has been reactivated: Welsh.
de: Dank des großen Einsatzes der Übersetzer kann Debian nun in 63 Sprachen installiert werden (50 davon nutzen die textbasierte Installationsoberfläche und 13 werden nur von der grafischen Benutzeroberfläche unterstützt). Das sind fünf Sprachen mehr als bei &Oldreleasename;. Die hinzugefügten Sprachen sind: Amharisch, Marathi, Irisch, Northern Sami und Serbisch. Aufgrund fehlender Aktualisierungen der Übersetzung musste eine Sprache aus dieser Version herausgenommen werden: Estnisch. Eine andere Sprache, die aus &Oldreleasename; herausgenommen worden ist, wurde nun wieder aktiviert: Walisisch.
ru: Благодаря огромным усилиям переводчиков, установку Debian теперь можно выполнять на 63 языках (50 через текстовый пользовательский интерфейс программы установки и 13 только через графический пользовательский интерфейс). Это на пять языков больше, чем было в &oldreleasename;. Языки, добавленные в этом выпуске: амхарский, маратхи, ирландский, северный сами, сербский. В этом выпуске из-за недостаточной поддержки обновлений перевода был убран эстонский. Ещё один язык, который был заблокирован в &oldreleasename;, вновь доступен: велш.
sk: Vďaka obrovskej snahe prekladateľov je teraz možné Debian inštalovať v 63 jazykoch (50 pomocou textového rozhrania inštalátora a 13 podporovaných iba v grafickom rozhraní). To je o päť jazykov viac ako vo vydaní &oldreleasename;. Jazyky pridané v tomto vydaní sú amharčina, maráthčina, írčina, severná saamčina a srbčina. Z dôvodu nedostatočnej aktualizácie prekladu bol v tomto vydaní jeden jazyk vypustený: estónčina. Ďalší jazyk, ktorý bol vypustený v &oldreleasename; bol znova aktivovaný: waleština.

source: The languages that can only be selected using the graphical installer as their character sets cannot be presented in a non-graphical environment are: Amharic, Bengali, Dzongkha, Gujarati, Hindi, Georgian, Khmer, Malayalam, Marathi, Nepali, Punjabi, Tamil and Thai.
de: Die folgenden Sprachen können nur ausgewählt werden, wenn der grafische Installer verwendet wird, da ihre Zeichensätze in einer nicht-grafischen Umgebung nicht darstellbar sind: Amharisch, Bengalisch, Dzongkha, Gujarati, Hindi, Georgisch, Khmer, Malayalam, Marathi, Nepalesisch, Pandschabisch, Tamillisch und Thailändisch.
ru: Языки, которые можно выбрать только в графическом интерфейсе программы установки, так как их наборы символов нельзя отобразить в не графическом окружении: амхарский, бенгальский, дзонг-кэ, гуджарати, хинди, грузинский, кхмерский, малаялам, маратхи, непальский, пунджаби, тамильский и тайский.
sk: Jazyky, ktoré je možné vybrať iba pomocou grafického inštalátora, pretože ich znakové sady nie je možné vykresliť v negrafickom prostredí, sú: amharčina, bengálčina, dzongkä, gudžarátčina, hindčina, gruzínčina, khmérčina, malajálamčina, maráthčina, nepálčina, pandžábčina, tamilčina a thajčina.

source: Install &debian; with a braille display
de: Installieren Sie &debian; mit einer Braillezeile
ru: Установка &debian; с помощью дисплея Брайля
sk: Nainštalovať &debian; s braillovým displejom
zh_tw: 使用 braille（盲人點字）顯示器來安裝 &debian;
