Repository: lurdan/trans-ddp
Catalog: release-notes/*/installing.po
Languages: be, de, fi, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: Thanks to the huge efforts of translators, Debian can now be installed in 63 languages (50 using the text-based installation user interface and 13 supported only with the graphical user interface). This is five languages more than in &oldreleasename;. Languages added in this release include Amharic, Marathi, Irish, Northern Sami, and Serbian. Due to lack of translation updates, one language has been dropped in this release: Estonian. Another language that was disabled in &oldreleasename; has been reactivated: Welsh.
be: Дзякуючы велізарным высілкам перакладчыкаў, праграма усталявання Debian зараз даступная на 63 мовах (50 моваў падтрымліваюць тэкставы інтэрфэйс праграмы ўсталявання, і 13 моваў падтрымліваюць графічны інтэрфэйс). У параўнанні з "&oldrelease;" дадалося пяць новых моваў: амхарская, ірландская, маратхі, паўночнасаамская ды сербская. Адна мова (эстонская) была выдаленая з-за недахопу актуальных перакладаў. Яшчэ адна мова (уэльская), якая была адключаная ў "&oldreleasename;", ізноў зроблена даступнай.
fi: Kiitos kääntäjien jättimäisen työpanoksen voidaan Debian nyt asentaa 63 kielellä (50 kielellä tekstikäyttöliittymää käyttävällä asentimella ja 13 kieltä jotka on tuettu vain graafisessa asentimessa). Tämä on viisi kieltä enemmän kuin julkaisussa &oldreleasename;. Tässä julkaisussa lisättyihin kieliin kuuluvat amhara, marathi, iiri, pohjoissaame ja serbia. Yksi kieli on jätetty tästä julkaisusta pois koska käännöstä ei ole saatettu ajan tasalle: viro. Julkaisussa &oldreleasename; pois käytöstä ollut kieli on otettu takaisin: kymri
ja: 翻訳者の多大な努力により、Debian は、63 の言語 (50 の言語はテキストユーザインターフェースで利用でき、13 の言語はグラフィカルユーザインターフェースでのみサポートされています) でインストールできるようになりました。&oldreleasename; より 5 言語増えたことになります。このリリースで追加された言語は、アムハラ語、マラーティー語、アイルランド語、北サーミ語、セルビア語です。エストニア語の翻訳は更新されなかったため、このリリースではサポートされなくなりました。他の言語として、&oldreleasename; では無効になっていたウェールズ語が復活しました。
lt: Vertėjų pastangų dėka, Debian'as dabar gali būti įdiegtas 63 kalbomis (50 naudojant paprastą tekstinę naudotojo sąsają ir 13 naudojant tiktai grafinę naudotojo sąsają). Tai yra penkiomis kalbomis daugiau negu, &oldreleasename;. Ši laida papildyta šiomis kalbomis: amharų, marathų, airių, šiaurės sami ir serbų. Šioje laidoje dėl nepakankamo vertimo atnaujinimo pašalintas estų kalbos palaikymas. Kita kalba, kuri buvo išjungta laidoje &oldreleasename;, buvo atgaivinta - tai valų kalba.
nb: Takket være den enorme innsatsen til oversetterene, så kan Debian nå installeres på 63 forskjellige språk (50 via det tekstbaserte grensesnittet, og 13 kun via det grafiske grensesnittet). Dette er 5 språk flere enn det som var støttet i &oldreleasename;. Nye språk som nå er støttet inkluderer Amharisk, Marathi, Irsk, Nordsamisk, Serbisk. På grunn av utdaterte oversettelser så er støtten for å installere med Estisk fjernet. Et språk som falt ut i &oldreleasename; pga utdaterte oversettelse er nå tilbake: Kymrisk (Walisisk).
sv: Tack vare en enorm insats av översättare kan Debian nu bli installerad i 63 olika språk (50 via det textbaserade gränssnittet och 13 endast via det grafiska gränssnittet). Detta är fem språk fler än &oldreleasename; Nya språk i den här utgåvan, Amhariska, Marathi, Iriska, Nordsamiska och Serbiska. På grund av otillräcklig uppdatering har ett språk fått tas bort i denna utgåva: Estniska. Ett språk har återaktiverats sedan &oldrelease; Kymriska (Walesiska).
vi: Nhờ sự cố gắng rất lớn của các người dịch, giờ có thể cài đặt Debian bằng 63 ngôn ngữ khác nhau (50 dùng giao diện người dùng cài đặt dựa vào văn bản, và 13 được hỗ trợ chỉ với giao diện người dùng đồ họa do hình tượng phức tạp). Tổng số này là nhiều hơn &oldreleasename; theo năm ngôn ngữ. Các ngôn ngữ được thêm vào trong bản phát hành này bao gồm tiếng Am-ha-ríc, tiếng Ma-ra-thi, tiếng Bắc Xa-mi và tiếng Xéc-bi. Do bản cập nhật dịch còn thiếu, một ngôn ngữ bị bỏ trong bản phát hành này: tiếng Ex-tô-ni. Tuy nhiên, một ngôn ngữ bị tắt trong &oldreleasename; đã được kích hoạt lại: tiếng Ouen-s.

source: The languages that can only be selected using the graphical installer as their character sets cannot be presented in a non-graphical environment are: Amharic, Bengali, Dzongkha, Gujarati, Hindi, Georgian, Khmer, Malayalam, Marathi, Nepali, Punjabi, Tamil, and Thai.
be: Спіс моваў, якія падтрымліваюцца толькі графічным інтэрфэйсам (бо сімвалы гэтых моваў немагчыма адлюстраваць у тэкставым рэжыме): амхарская, бенгальская, гуджарацкая, грузінская, дзонг-кэ, кхмерская, малаялам, маратхі, непальская, пунджабская, тамільская, тайская ды хіндзі.
fi: Kielet jotka voidaan valita vain graafista asenninta käytettäessä koska niiden merkistöä ei voi näyttää ei-graafisessa ympäristössä ovat: amhara, bengali, bhutani, gud&zcaron;arati, hindi, gruusia, khmer, malajalam, marathi, nepali, pand&zcaron;abi, tamili ja thai.
ja: 以下の言語は、非グラフィカル環境では文字セットが存在しないため、グラフィカルインストーラのみが選択できます。アムハラ語、ベンガル語、ゾンカ語、グジャラート語、ヒンディー語、グルジア語、クメール語、マラヤーラム語、マラーティー語、ネパール語、パンジャブ語、タミール語、タイ語。
lt: Kalbos, kurias galima pasirinkti tiktai naudojant įdiegiklio grafinę naudotojo sąsają, kadangi jų rašmenų simbolių negalima atvaizduoti negrafinėje aplinkoje: amharų, bengalų, botijų, gudžaratų, hindi, gruzinų, khmerų, malajalių, marathų, nepalų, pendžabų, tamilų ir tajų.
nb: Språk som kun kan brukes sammen med det grafiske grensesnittet, ettersom de har et tegnsett som ikke kan representeres i et rent tekstbasert grensesnitt er Amharisk, Bengali, Dzongkha, Gujarati, Hindi, Georgisk, Khmer, Malayalam, Marathi, Nepali, Punjabi, Tamil og Thai.
sv: Språk som bara kan väljas via den grafiska installationsmetoden på grund av att deras tecken inte kan visas i en ickegrafisk miljö är: Amhariska, Bengali, Dzongkha, Gujarati, Hindi, Georgiska, Khmer, Malayalam, Marathi, Nepali, Punjabi, Tamil och Thai.
vi: Những ngôn ngữ chỉ có thể được chọn dùng trình cài đặt đồ họa (vì bộ ký tự không hiển thị được trong môi trường khác đồ họa) là: tiếng Am-ha-ríc, tiếng Băng Gan, tiếng Đdông-kha, tiếng Gu-gia-ra-ti, tiếng Hin-đi, tiếng Gi-oa-gi-a, tiếng Khơ-me, tiếng Ma-lay-am, tiếng Ma-ra-thi, tiếng Ne-pan, tiếng Pun-gia-bi, tiếng Ta-min và tiếng Thái.

source: Simplified country choice
be: Спрошчаны выбар краінаў
de: Vereinfachte Länderauswahl
fi: Maan valinta yksinkertaisempi
ja: 簡単化された国名選択
lt: Supaprastintas šalies pasirinkimas
nb: Enklere valg av land
ru: Упрощённый выбор страны
sk: Zjednodušený výber krajiny
sv: Förenklat landsval
vi: Đơn giản chọn quốc gia

source: The country choice list is now grouped by continents, allowing an easier selection of country, when users don't want to pick the ones associated with the chosen language.
be: Спіс выбару краінаў цяпер згорнуты па кантынентах, што дазваляе лягчэй абраць патрэбны пункт, калі карыстальнік незадаволены вынікам аўтаматычнага вызначэння краіны на падставе абранай мовы.
de: Die Liste zur Auswahl des Landes ist jetzt nach Kontinenten gruppiert; dies erlaubt eine einfachere Auswahl des gewünschten Landes, wenn der Benutzer nicht eines der Länder auswählen möchte, die der gewählten Sprache zugeordnet sind.
fi: Maaluettelo on nyt ryhmitelty mantereiden mukaan, jolloin maan valinta on helpompaa kun ei haluta valita kielen mukaan määräytyvää maata.
ja: 選択した言語に関連付けられた国名以外を選びたい場合に簡単に選択出来るよう、国名選択リストは大陸ごとにグループ化されました。
lt: Šalių sąrašas dabar sugrupuotas pagal žemynus, leidžiantis lengvesnį šalies pasirinkimą, kai naudotojas nenori išsirinkti vienos iš šalių, asocijuojamos su pasirinkta kalba.
nb: Listen med valgbare land er gruppert etter kontinenter, noe som gjør det enklere å velge ett annet land enn det som er naturlig for valgt språk.
ru: Список стран теперь сгруппирован по континентам, что облегчает выбор страны, когда пользователи не хотят выбирать страну на основе указанного языка.
sk: Zoznam s výberom krajiny je teraz zoskupený podľa kontinentov, čo umožňuje jednoduchší výber krajiny, keď si používateľ neželá zvoliť krajinu asociovanú so zvoleným jazykom.
sv: Listan med valbara länder är grupperad efter kontinenter vilket gör det enklare att välja land om användaren inte vill välja ett land som kopplats till ett särskilt språk.
vi: Danh sách lựa chọn quốc gia giờ nhóm lại theo lục địa, thì làm cho dễ hơn chọn quốc gia khi người dùng không muốn chọn một quốc gia tương ứng với ngôn ngữ đã chọn.

source: Automated installation
be: Аўтаматызаванае ўсталяванне
de: Automatisierte Installation
fi: Asennuksen automatisointi
it: Installazione automatizzata
ja: 自動インストール
lt: Automatizuotas įdiegimas
nb: Automatisk installasjon
pl: Instalacja automatyczna
pt: Instalação automatizada
pt_br: Instalação automatizada
ro: Instalarea automată
ru: Автоматическая установка
sk: Automatizovaná inštalácia
sv: Automatisk installation
vi: Tự động cài đặt
zh_tw: 自動安裝

source: Some changes mentioned in the previous section also imply changes in the support in the installer for automated installation using preconfiguration files. This means that if you have existing preconfiguration files that worked with the &oldreleasename; installer, you cannot expect these to work with the new installer without modification.
be: З пэўных зменаў, узгаданых у папярэдняй главе, таксама вынікаюць змены ў падтрымцы праграмай усталявання рэжыму аўтаматычнага ўсталявання з дапамогай файлаў папярэдняй наладкі. Старыя файлы папярэдняй наладкі, якія працавалі з &oldreleasename;, хутчэй за ўсё запатрабуюць зменаў, каб новая праграма ўсталявання магла выкарыстоўваць іх.
de: Viele der bisher genannten Änderungen ziehen auch Änderungen für die Funktion des Installers nach sich, automatisierte Installationen mit Hilfe vorkonfigurierter Dateien durchzuführen. Das bedeutet, dass Sie nicht davon ausgehen können, dass alte Vorkonfigurationsdateien, die mit &Oldreleasename; funktioniert haben, nun auch mit dem neuen Installer funktionieren, zumindest nicht ohne Anpassungen.
fi: Jotkin edellisessä luvussa mainituista muutoksista tarkoittavat muutoksia myös asentimen tuessa asennuksen automatisoinnille valmiita vastauksia käyttämällä. Tämä tarkoittaa, että &oldreleasename;:n asentimen kanssa toimineen valmiiden vastausten tiedoston ei voi olettaa muutoksitta toimivan uuden asentimen kanssa.
it: Alcuni cambiamenti menzionati nella sezione precedente implicano anche modifiche al supporto nell'installatore per installazioni automatizzate con l'uso di file di preconfigurazione. Ciò significa che se si possiedono file preconfigurati che funzionavano con l'installatore di &oldreleasename; non ci si può attendere che questi funzionino anche con la nuova versione senza modifiche.
ja: 前のセクションで述べたとおりインストーラに多数の変更が加えられたので、インストーラによる、事前設定ファイルを使用した自動インストールのサポートにも変更がありました。つまり、&oldreleasename; のインストーラで動いた既存の事前設定ファイルがあっても、修正を加えずにそれが新しいインストーラで動くことは期待できません。
lt: Kai kurie pakeitimai minėti aukščiau, taip pat palietė ir automatizuoto įdiegimo palaikymą įdiegiklyje, naudojant išankstinių nustatymų failus. Tai reiškia, kad jeigu jau turite esamus išankstinių nustatymų failus, kurie dirbo su &oldreleasename; įdiegikliu, negalite tikėtis, kad jie veiks ir su nauju įdiegikliu be pakeitimų.
nb: Noen av endringene som er nevnt ovenfor innebærer også endringer i støtten for automatisk installasjon med prekonfigurerte filer. Dette betyr at hvis du bruker prekonfigurerte filer som tidligere virket med &oldreleasename; Installer, så kan du ikke automatisk forvente at disse virker med den nye Installeren uten å først ha gjort de nødvendige endringene.
pl: Część zmian opisanych w poprzednim rozdziale implikuje również zmiany w obsłudze automatycznych instalacji, za pomocą wstępnie skonfigurowanych plików. Oznacza to, że jeśli posiada się wstępnie skonfigurowane pliki działające z wydaniem &oldreleasename; instalatora, nie należy oczekiwać, że będą również działać z nowym instalatorem bez potrzeby modyfikacji.
pt: Algumas das alterações mencionadas na secção anterior implicam também alterações no suporte ao instalador para a instalação automática utilizando ficheiros pré-configurados. Significa que não pode esperar que ficheiros pré-configurados que funcionem com o instalador da &oldreleasename; funcionem também com o novo instalador sem qualquer modificação.
pt_br: Algumas mudanças mencionadas na seção anterior também implicam em mudanças no suporte do instalador para instalação automatizada utilizando arquivos de pré-configuração. Isso significa que se você tiver arquivos de pré-configuração que funcionaram com o instalador &oldreleasename;, você não pode esperar que esses funcionem com o novo instalador sem modificação.
ro: Unele din modificările menționate în secțiunea precedentă implică și modificări în suportul pentru instalări automate folosind fișiere de preconfigurare. Acest lucru înseamnă că dacă aveți fișiere de preconfigurare care au funcționat cu programul de instalare din &oldreleasename; nu vă puteți aștepta ca acestea să funcționeze fără modificări cu noul program de instalare.
ru: Множество изменений, упомянутых в предыдущем разделе, также затронули и автоматическую установку с помощью файла ответов. Это означает, что если у вас уже есть файлы ответов, которые работали с программой установки &oldreleasename;, то не ждите, что они будут работать с новой программой установки без изменений.
sk: Niektoré zmeny spomenuté v predošlej sekcii tiež majú vplyv na podporu automatickej inštalácie na základe vopred zostavených konfiguračných súborov. To znamená, že ak máte existujúce vopred zostavené konfiguračné súbory, ktoré fungovali v inštalátore &oldreleasename;, nemôžete očakávať, že budú bezo zmien fungovať v novom inštalátore.
sv: Några ändringar som nämns ovan innebär också förändringar i stödet för automatisk installation med förinställda filer. Detta innebär att om du har förinställda filer som fungerat för installeraren för &oldreleasename; så kan du inte förvänta dig att dessa fungerar med den nya installeraren utan att redigeras.
vi: Vài thay đổi được diễn tả trong phần trước cũng ngụ ý thay đổi trong hỗ trợ của bản cài đặt để tự động cài đặt dùng tập tin cấu hình sẵn. Có nghĩa là nếu bạn có tập tin cấu hình sẵn đã tồn tại mà hoạt động được với bản cài đặt &oldreleasename;, tập tin như vậy sẽ không hoạt động với bản cài đặt mà không sửa đổi.

source: The <ulink url="&url-install-manual;">Installation Guide</ulink> has an updated separate appendix with extensive documentation on using preconfiguration.
be: <ulink url="&url-install-manual;">Кіраўніцтва па ўсталяванні</ulink> утрымлівае асобны абноўлены дадатак з пашыранай дакументацыяй адносна выкарыстання механізму папярэдніх наладак (preconfiguration).
de: Der <ulink url="&url-install-manual;">Installations-Leitfaden</ulink> enthält einen aktualisierten Anhang mit ausführlicher Dokumentation über die Verwendung der Vorkonfiguration.
fi: <url id="&url-install-manual;" name="Asennusohjeessa"> on nyt erillinen päivitetty liite jossa valmiiden vastausten käyttö kuvataan seikkaperäisesti.
it: La <ulink url="&url-install-manual;">Guida all'installazione</ulink> include un'appendice separata aggiornata con una documentazione estesa sull'uso di preconfigurazioni.
ja: 事前設定の使用方法に関する豊富な文書を含んだ最新の付録が<ulink url="&url-install-manual;">インストールガイド</ulink>に付けられました。
lt: <ulink url="&url-install-manual;">Įdiegimo vadove</ulink> yra atnaujintas atskiras priedas su išsamiais paaiškinimais apie išankstinių nustatymų failų naudojimą.
nb: <ulink url="&url-install-manual;">Installasjonsguiden</ulink> har et tillegg med utfyllende dokumentasjon på hvordan prekonfigurasjon kan brukes.
pl: <ulink url="&url-install-manual;">Przewodnik po instalacji</ulink> zawiera zaktualizowany dodatek opisujący szczegółowo używanie wstępnej konfiguracji.
pt: O <ulink url="&url-install-manual;">Guia de Instalação</ulink> tem um apêndice separado actualizado com documentação extensiva sobre como utilizar a pré-configuração.
pt_br: O <ulink url="&url-install-manual;">Guia de Instalação</ulink> possui um apêndice atualizado separado com uma extensa documentação sobre como usar a pré-configuração.
ro: <ulink url="&url-install-manual;">Ghidul de instalare</ulink> conține acum o anexă separată și actualizată cu documentație extinsă despre folosirea preconfigurărilor.
ru: В <ulink url="&url-install-manual;">руководстве по установке</ulink> теперь есть отдельное приложение, в котором подробно описывается использование автоматической настройки.
sk: <ulink url="&url-install-manual;">Inštalačná príručka</ulink> obsahuje samostatnú aktualizovanú prílohu s rozsiahlou dokumentáciou týkajúcu sa vopred zostavenej konfigurácie.
sv: <ulink url="&url-install-manual;">Installationsguiden</ulink> har en separat bilaga med omfattande dokumentation om hur förinställningar ska användas.
vi: <ulink url="&url-install-manual;">Sổ tay Cài đặt</ulink> chứa một Phụ lục riêng đã cập nhật mà diễn tả chi tiết quá trình cấu hình sẵn.

source: Install &debian; with a Braille display
be: Усталяванне &debian; з дысплэем Брайля
ja: 点字ディスプレイを使って &debian; をインストール
lt: &debian; diegimas naudojant Brailio ekraną
nb: Installer &debian; med en Braille leselist
sv: Installera &debian; med en punktskriftsvisare
vi: Cài đặt &debian; để hiển thị chữ nổi

source: You can install &debian; &release; (&releasename;) with a Braille display. The Braille display must be connected to a <acronym>USB</acronym> or a serial port. If your Braille display is connected to a <acronym>USB</acronym> port and the American Braille table is supposed to be used, you can press <keycap>Enter</keycap> in the boot menu. The screen reader BrlTTY is standardized to search for Braille displays at the <acronym>USB</acronym> port and uses the American Braille table. If the Braille display is connected to a serial port or if you want to use a different Braille table, you have to press the <keycap>Tab</keycap> key in the boot menu first. Then, you can configure the screen reader BrlTTY with the kernel parameter brltty.
be: Усталяванне в &debian; &release; (&releasename;) магчымае з ужываннем брайлеўскага дысплэя. Дысплэй мусіць быць далучаны да камп'ютэра праз <acronym>USB</acronym> альбо паслядоўны порт. Калі дысплэй Брайля далучаны да порту <acronym>USB</acronym> і мяркуецца ўжываць амерыканскую табліцу Брайля, дастаткова націснуць клавішу <keycap>Увод</keycap> у меню загрузкі. Праграма працы з экранам BrlTTY наладжаная на пошук брайлеўскіх дысплэяў, далучаных праз <acronym>USB</acronym> і працу з амерыканскай табліцай. Калі ж дысплэй далучаны да паслядоўнага порту, альбо плануецца выкарыстоўваць альтэрнатыўную табліцу Брайля, неабходна спачатку націснуць клавішу <keycap>Tab</keycap> у меню загрузкі. Пасля гэтага можна наладзіць BrlTTY праз параметр ядра brltty.
ja: &debian; &release; (&releasename;) は、点字ディスプレイを使ってインストールすることもできます。点字ディスプレイは、<acronym>USB</acronym> もしくはシリアルポートに接続されている必要があります。お使いの点字ディスプレイが <acronym>USB</acronym> ポートに接続されていて、米国の点字表を使うようになっているなら、起動メニューで <keycap>Enter</keycap> を押すだけです。スクリーンリーダの BrlTTY は、<acronym>USB</acronym> ポートに接続されている点字ディスプレイを探し、米国の点字表を使うように標準化されています。点字ディスプレイがシリアルポートに接続されていたり、別の点字表を使いたい場合は、起動メニューで最初に <keycap>Tab</keycap> キーを押してください。そうすれば、brltty カーネルパラメータを使うことで、スクリーンリーダの BrlTTY を設定できます。
lt: Galite įdiegti &debian; &release; (&releasename;) naudodami Brailio ekraną. Brailio ekranas turi būti prijungti prie <acronym>USB</acronym> arba nuosekliosios jungties. Jei Brailio ekranas yra prijungtas prie <acronym>USB</acronym> jungties ir numatoma naudoti amerikiečių Brailio lentelę, galite tiesiog paspausti <keycap>Enter</keycap> klavišą įdiegiklio įkėlimo meniu. Ekrano skaitymo įrenginys BrlTTY yra nustatytas ieškoti Brailio ekrano prijungto prie <acronym>USB</acronym> naudoja amerikiečių Brailio lentelę. Jei Brailio ekranas yra prijungtas prie nuosekliosios jungties arba jei norite naudoti kitą Brailio lentelę, turite pirma paspausti <keycap>Tab</keycap> klavišą įdiegiklio įkėlimo meniu. Tada galite nustatyti ekrano BrlTTY skaitytuvą naudodami branduolio parametrą brltty.
nb: Du kan installere &debian; &release; (&releasename;) med en Braille leselist. Braille leselisten må være koblet til med <acronym>USB</acronym> eller serieport. Hvis din Braille leselist er koblet til via <acronym>USB</acronym> og du ønsker å bruke amerikansk Braille tabell, så trenger du bare å trykke <keycap>Enter</keycap> når du er inne i oppstartsmenyen. Skjermleseren BrlTTY forsøker som standard å lete etter Braille leselist på <acronym>USB</acronym> porten og bruker amerikansk Braille tabell. Hvis din Braille leselist er koblet til på serieporten, eller om du ønsker å bruker en annen Braille tabell, så må du trykke på <keycap>Tab</keycap> tasten i oppstartsmenyen først, deretter kan du konfigurerer din skjermleser BrlTTY via kjerne parameteren brltty.
sv: &debian; &release; (&releasename;) kan installeras med hjälp av en punktskriftsvisare. Punktskriftsvisaren måste anslutas till en <acronym>USB</acronym>- eller serieport. Om din punktskriftsvisare är ansluten till en <acronym>USB</acronym>-port och du har för avsikt att använd den amerikanska punktskriftstabellen kan du trycka <keycap>vagnretur</keycap> vid uppstartsmenyn. Punktskriftsvisaren BrlTTY kommer i standardläget att visas på <acronym>USB</acronym>-porten och använder den amerikanska punktskriftstabellen. Om punktsktiftsvisaren är ansluten till en serieport eller om du vill använda en annan punktskriftstabell måste du först trycka på <keycap>tab</keycap>-tangenten i uppstartsmenyn. Därefter kan punktskriftsvisaren BrlTTY anpassas via kärn-flaggan brltty.
vi: Bạn cũng có thể cài đặt &debian; &release; (&releasename;) để hiển thị chữ nổi (Braille: chữ cho người mù). Màn hình chữ nổi phải được kết nối đến một cổng kiểu <acronym>USB</acronym> hay nối tiếp (serial). Nếu màn hình chữ nổi được kết nối đến một cổng <acronym>USB</acronym> và nên dùng bảng chữ nổi Mỹ (American Braille) thì bạn có thể bấm phím <keycap>Enter</keycap> khi trong trình đơn khởi động. Chương trình đọc màn hình BrlTTY được đặt theo mặc định để quét các cổng <acronym>USB</acronym> tìm màn hình chữ nổi, và sử dụng Bảng Chữ Nổi Mỹ. Nếu màn hình chữ nổi được kết nối đến một cổng nối tiếp, hoặc nếu bạn muốn sử dụng một bảng chữ nổi khác, bạn cần bấm phím <keycap>Tab</keycap> (để thay thế phím Enter) khi trong trình đơn khởi động. Sau đó bạn có thể cấu hình trình đọc màn hình BriTTY dùng tham số hạt nhân <userinput>brltty</userinput>.

source: For the parameter, the following syntax is valid:
be: Для параметра дазволены наступны сінтаксіс:
de: Für diesen Parameter gilt die folgende Syntax:
ja: パラメータでは、以下の構文が有効です。
lt: Parametro perdavimui naudojama tokia sintaksė:
nb: Følgende syntaks er gyldig for brltty:
ru: Для значения параметра используется следующий синтаксис:
sk: Pre parameter platí nasledovná syntax:
sv: Flaggan tar följande syntax:
vi: Đối với tham số này, cú pháp theo đây cũng hợp lệ:
zh_tw: 關於參數，可以使用以下語法：

source: brltty=<replaceable>driver</replaceable>,<replaceable>device</replaceable>,<replaceable>table</replaceable>
be: brltty=<replaceable>драйвер</replaceable>,<replaceable>прылада</replaceable>,<replaceable>табліца</replaceable>
de: brltty=<replaceable>Treiber</replaceable>,<replaceable>Gerät</replaceable>,<replaceable>Tabelle</replaceable>
ja: brltty=<replaceable>ドライバー</replaceable>,<replaceable>デバイス</replaceable>,<replaceable>点字表</replaceable>
ru: brltty=<replaceable>драйвер</replaceable>,<replaceable>устройство</replaceable>,<replaceable>таблица</replaceable>
sk: brltty=<replaceable>ovládač</replaceable>,<replaceable>zariadenie</replaceable>,<replaceable>tabuľka</replaceable>
sv: brltty=<replaceable>drivrutin</replaceable>,<replaceable>enhet</replaceable>,<replaceable>tabell</replaceable>
vi: brltty=<replaceable>trình_điều_khiển</replaceable>,<replaceable>thiết_bị</replaceable>,<replaceable>bảng_chữ</replaceable>
