Repository: lurdan/trans-ddp
Catalog: release-notes/*/installing.po
Languages: be, de, fi, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: en
be: be
de: de
fi: fi
it: it
ja: ja
lt: lt
nb: nb
pl: pl
pt: pt
pt_br: pt_BR
ro: ro
ru: ru
sk: sk
sv: sv
vi: vi
zh_tw: zh_TW

source: Installation System
be: Сістэма ўсталявання
de: Installationssystem
fi: Asennusjärjestelmä
it: Sistema d'installazione
ja: インストールシステム
lt: Įdiegimo sistema
nb: Installasjonssystem
pl: System instalacyjny
pt: Sistema de Instalação
pt_br: Sistema de instalação
ro: Sistemul de instalare
ru: Система установки
sk: Inštalačný systém
sv: Installationssystem
vi: Hệ thống Cài đặt
zh_tw: 系統安裝

source: The Debian Installer is the official installation system for Debian. It offers a variety of installation methods. Which methods are available to install your system depends on your architecture.
be: Афіцыйнай сістэмай усталявання Debian з'яўляецца Debian Installer, які прапаноўвае некалькі магчымых шляхоў усталявання. Набор спосабаў усталявання, даступных у канкрэтным выпадку, залежыць ад архітэктуры сістэмы.
de: Der Debian-Installer ist das offizielle Installationssystem für Debian. Er bietet verschiedene Installationsmethoden an. Welche dieser Methoden für Ihr System zur Verfügung stehen, hängt von der verwendeten Architektur ab.
fi: Debianin asennin on virallinen asennusjärjestelmä Debianille. Asennin tarjoaa useita asennustapoja. Tiettyyn järjestelmään tarjolla olevat tavat riippuvat arkkitehtuurista.
it: L'installatore Debian è il sistema d'installazione ufficiale per Debian. Offre molti metodi d'installazione, la cui disponibilità dipende dall'architettura del proprio sistema.
ja: Debian Installer は公式の Debian インストールシステムです。このインストーラは、様々なインストール方法を提供しています。お使いのシステムにインストールするのにどの方法が利用できるかは、使っているアーキテクチャに依存します。
lt: Debian'o įdiegiklis (diegimo programa) yra oficiali Debian'o įdiegimo sistema. Ji siūlo įvairių įdiegimo metodų, priklausomai nuo kompiuterio architektūros.
nb: Debian Installer er det offisielle installasjonssystemet for Debian. Debian Installer støtter flere forskjellige måter å installere på, hvilke som er tilgjengelig for ditt system, er avhengig av din prosessorvariant.
pl: Instalator Debiana (Debian Installer) jest oficjalnym systemem instalacji w przypadku Debiana. Oferuje on wiele metod instalacji. To, które z nich są dostępne, zależy od używanej architektury.
pt: O Instalador Debian é o sistema oficial de instalação da Debian. Oferece uma variedade de métodos de instalação. Os métodos que se encontram disponíveis para instalar o seu sistema depende da sua arquitectura.
pt_br: O Instalador Debian é o sistema de instalação oficial para o Debian. Ele oferece vários métodos de instalação. Os métodos disponíveis para instalar seu sistema dependem da sua arquitetura.
ro: Programul de instalare Debian este sistemul de instalare oficial pentru Debian. Acesta oferă o varietate de metode de instalare. Metodele disponibile pentru instalarea sistemului depind de arhitectura sistemului dumneavoastră.
ru: Debian Installer (программа установки) является официальной системой установки Debian. Она предлагает широкий выбор методов установки. Список доступных методов зависит от архитектуры компьютера.
sk: Debian Installer je oficiálny inštalačný systém Debianu. Ponúka rôzne spôsoby inštalácie. Metódy inštalácie dostupné pre váš systém závisia na architektúre, ktorú používate.
sv: Debian Installer är det officiella installationssystemet för Debian. Det tillhandahåller en mängd installationsmetoder, vilka som fungerar på ditt system beror på dess arkitektur.
vi: Bản Cài đặt Debian là hệ thống cài đặt chính thức của Debian. Nó cung cấp vài phương pháp cài đặt khác nhau. Những phương pháp sẵn sàng cài đặt vào hệ thống của người dùng thì phụ thuộc vào kiến trúc.
zh_tw: Debian Installer 是 Debian 的官方安裝系統。它提供了多種不同的安裝方式。您可以依據您硬體架構的不同而有種種不同的安裝方式可供選擇。

source: Images of the installer for &releasename; can be found together with the Installation Guide on the <ulink url="&url-installer;">Debian website</ulink>.
be: Адбіткі ўсталявальніка для &releasename; разам з "Кіраўніцтвам па ўсталяванні" можна знайсці на <ulink url="&url-installer;">сайце Debian</ulink>.
de: Images des Installers für &Releasename; finden Sie zusammen mit dem Installations-Leitfaden auf der <ulink url="&url-installer;">Debian Webseite</ulink>.
fi: Asentimen otokset julkaisulle &releasename; ja Asennusohje löytyvät <url id="&url-installer;" name="Debianin seittisivustosta">.
it: Le immagini dell'installatore per &releasename; possono essere trovate, insieme alla guida all'installazione, sul <ulink url="&url-installer;">sito web di Debian</ulink>.
ja: &releasename; 用のインストーラのイメージは、インストールガイドとともに <ulink url="&url-installer;">Debian のウェブサイト</ulink>にあります。
lt: Įdiegiklio atvaizdus &releasename; distributyvui, o taip pat ir įdiegimo vadovą galima rasti <ulink url="&url-installer;">Debian'o tinklapyje</ulink>.
nb: Installasjonsmedier for &releasename; ligger sammen med Installasjonsguiden på <ulink url="&url-installer;">nettsiden til Debian</ulink>.
pl: Obrazy instalatora wydania &releasename; są dostępne razem z przewodnikiem po instalacji na <ulink url="&url-installer;">stronach Debiana</ulink>.
pt: As imagens do instalador para a &releasename; podem ser encontradas juntamente com o Guia de Instalação no <ulink url="&url-installer;">website Debian</ulink>.
pt_br: Imagens do instalador para o &releasename; podem ser encontradas juntamente com o Guia de Instalação no <ulink url="&url-installer;">site web do Debian</ulink>.
ro: Imaginile programului de instalare pentru &releasename; pot fi găsite împreună cu Ghidul de instalare pe <ulink url="&url-installer;">situl Debian</ulink>.
ru: Образы программы установки для &releasename; и руководство по установке можно найти на <ulink url="&url-installer;">веб-сайте Debian</ulink>.
sk: Obrazy inštalátora pre &releasename; nájdete spolu s Inštalačnou príručkou na <ulink url="&url-installer;">webe Debianu</ulink>.
sv: Avbilder av installeraren för &releasename; kan hittas tillsammans med installationsguiden på <ulink url="&url-installer;">Debian webbplats</ulink>.
vi: Các ảnh chứa bản cài đặt cho &releasename; nằm cùng với Sổ tay Cài đặt ở <ulink url="&url-installer;">địa chỉ Web của Debian</ulink>.
zh_tw: 可以在 <ulink url="&url-installer;">Debian 站台</ulink> 上同時取得 &releasename; 的安裝影像檔以及安裝指引。

source: The Installation Guide is also included on the first CD/DVD of the official Debian CD/DVD sets, at:
be: "Кіраўніцтва па ўсталяванні" таксама прысутнічае на першым дыску афіцыйных набораў CD/DVD з Debian :
de: Der Installations-Leitfaden ist ebenso der ersten CD/DVD des offiziellen Debian-CD/DVD-Satzes beigefügt unter:
fi: Asennusohje on myös mukana ensimmäisellä rompulla Debianin romppuissa tiedostossa
it: La guida all'installazione è inclusa anche nel primo CD/DVD dei set ufficiali di Debian, in:
ja: インストールガイドは、Debian 公式 CD/DVD セットの 1 枚目の CD/DVD 内の、次の場所にも含まれています。
lt: Įdiegimo vadovas taip pat patalpintas oficialaus CD/DVD diskų rinkinio pirmajame diske. Jį rasite čia:
nb: Installasjonsguiden finnes også på den første cd/dvd-platen, i katalogen
pl: Przewodnik po instalacji jest również dołączony do pierwszego CD/DVD oficjalnego zestawu CD/DVD Debiana w:
pt: O Guia de Instalação está também incluído no primeiro CD/DVD do conjunto oficial de CD/DVDs Debian, em:
pt_br: O Guia de Instalação também está incluído no primeiro CD/DVD dos conjuntos de CDs/DVDs oficiais do Debian, disponíveis em:
ro: Ghidul de instalare mai este inclus și pe primul CD/DVD din oricare din seturile oficiale de CD-uri/DVD-uri Debian la:
ru: Руководство по установке также включено на первый CD/DVD из официального набора Debian CD/DVD. Его можно найти в:
sk: Inštalačná príručka sa tiež nachádza na prvom CD/DVD oficiálnej sady CD/DVD Debianu na adrese:
sv: Installationsguiden finns också inkluderad på den första cd-/dvd-skivan av de officiella cd-/dvd-skivorna:
vi: Sổ tay Cài đặt cũng có sẵn trên đĩa CD/DVD thứ nhất của bộ đĩa Debian chính thức, ở :
zh_tw: 安裝指引也同時會包含在 Debian 官方的 CD/DVD 集裡的第一張 CD/DVD 的：

source: /doc/install/manual/<replaceable>language</replaceable>/index.html
be: /doc/install/manual/<replaceable>en</replaceable>/index.html
de: /doc/install/manual/<replaceable>Sprache</replaceable>/index.html
fi: /doc/install/manual/<replaceable>kieli</replaceable>/index.html
lt: /doc/install/manual/<replaceable>lt</replaceable>/index.html
nb: /doc/install/manual/<replaceable>nb</replaceable>/index.html
ro: /doc/install/manual/<replaceable>limbă</replaceable>/index.html
ru: /doc/install/manual/<replaceable>ru</replaceable>/index.html
sv: /doc/install/manual/<replaceable>språk</replaceable>/index.html
vi: /doc/install/manual/<replaceable>vi</replaceable>/index.html

source: You may also want to check the <ulink url="&url-installer;index#errata">errata</ulink> for debian-installer for a list of known issues.
be: Таксама можа быць карыснай старонка <quote><ulink url="&url-installer;index#errata">працы над памылкамі</ulink></quote> праграмы ўсталявання, якая ўтрымлівае спіс вядомых праблем.
de: Beachten Sie bitte auch die <ulink url="&url-installer;index#errata">Errata</ulink> für den Debian-Installer bzgl. bekannter möglicher Probleme.
fi: Kannattaa tarkistaa myös debianin asentimen <url id="&url-installer;index#errata" name="virheluettelosta"> tunnetut viat.
it: Si possono anche verificare le <ulink url="&url-installer;index#errata">errata corrige</ulink> dell'installatore Debian per un elenco di problematiche note.
ja: これまでに知られている問題点を列挙した debian-installer の<ulink url="&url-installer;index#errata">正誤表</ulink>も確認しておくとよいでしょう。
lt: Taip pat verta pasižiūrėti Debian'o įdiegiklio žinomų problemų sąrašą <ulink url="&url-installer;index#errata">errata</ulink>.
nb: Du burde sjekke listen over kjente skrivefeil på <ulink url="&url-installer;index#errata">errata</ulink>
pl: Można również zapoznać się z <ulink url="&url-installer;index#errata">erratą</ulink> programu debian-installer, aby poznać listę znanych błędów.
pt: Pode também querer verificar a <ulink url="&url-installer;index#errata">errata</ulink> do debian-installer para ver uma lista de problemas conhecidos.
pt_br: Também pode ser do seu interesse verificar a <ulink url="&url-installer;index#errata">errata</ulink> do debian-installer que contém uma lista de problemas conhecidos.
ro: Ar fi bine să verificați și <ulink url="&url-installer;index#errata">erata</ulink> Programului de instalare Debian pentru o listă a problemelor cunoscute.
ru: Также следует ознакомиться со списком <ulink url="&url-installer;index#errata">известных ошибок</ulink> программы установки.
sk: Tiež si môžete pozrieť zoznam známych problémov s debian-installer - <ulink url="&url-installer;index#errata">errata</ulink>.
sv: Du kanske även vill se <ulink url="&url-installer;index#errata">errata</ulink> för debian-installer för en lista över kända problem.
vi: Khuyên người dùng cũng đọc danh sách <ulink url="&url-installer;index#errata">errata</ulink> tìm danh sách các vấn đề được biết.
zh_tw: 您還可以到 <ulink url="&url-installer;index#errata">戡誤表</ulink> 上查看 debian-installer 的一些已知問題之列表。

source: What's new in the installation system?
be: Што новага ў сістэме ўсталявання?
de: Was ist neu im Installationssystem?
fi: Mitä uutta asennusjärjestelmässä?
it: Cosa c'è di nuovo nel sistema di installazione?
ja: インストールシステムの最新情報
lt: Kas naujo įdiegimo sistemoje?
nb: Hva er nytt i installasjonssystemet?
pl: Co nowego w systemie instalacyjnym?
pt: O que há de novo no sistema de instalação?
pt_br: Quais as novidades do sistema de instalação?
ro: Ce este nou în sistemul de instalare?
ru: Что нового в системе установки?
sk: Čo je nové v inštalačnom systéme?
sv: Vad är nytt i installationssystemet?
vi: Hệ thống cài đặt có gì mới?
zh_tw: 安裝系統有何改變？

source: There has been a lot of development on the Debian Installer since its first official release with &debian; 3.1 (sarge) resulting in both improved hardware support and some exciting new features.
be: Пачынаючы з першай афіцыйный версіі Debian Installer для выпуску &debian; 3.1 (sarge), распрацоўка праграмы адбывалася даволі актыўна. У выніку была палепшаная падтрымка апаратных сродкаў і забяспечан шэраг цікавых новых магчымасцяў.
fi: Debianin asenninta on kehitetty paljon sitten sen ensimmäisen virallisen julkaisun &debian; 3.1:ssä (sargessa). Laitetuki on parantunut ja uusia jännittäviä ominaisuuksia on lisätty.
ja: Debian Installer は、&debian; 3.1 (<quote>sarge</quote>) での初めての公式リリース以降も活発に開発されています。その結果、ハードウェアサポートが改良され、ワクワクするような新機能がいくつか追加されました。
lt: Visą laiką nuo pirmojo oficialaus Debian'o įdiegiklio su &debian; 3.1 (<quote>sarge</quote>) išleidimo jis buvo aktyviai tobulinamas, todėl pagerėjo aparatinės įrangos palaikymas ir buvo pridėta naujų funkcijų.
nb: Siden den første offisielle utgivelsen av Debian Installer i &debian; 3.1 (sarge) så har det blitt lagt ned et betydelig arbeid med Debian Installer, noe som har resultert i bedre hardware støtte samt en rekke nye spennende egenskaper.
pt: Houve muito desenvolvimento no Instalador Debian desde o seu primeiro lançamento oficial com a &debian; 3.1 (sarge) resultando tanto em melhorias no suporte de hardware bem como em algumas excitantes novas funcionalidades.
pt_br: Muito desenvolvimento foi feito no Instalador Debian desde seu primeiro lançamento oficial com o &debian; 3.1 (sarge), o que resultou tanto em melhorias no suporte a hardware quanto em alguns novos recursos muito interessantes.
ro: Programul de instalare Debian a avut parte de multe schimbări de la prima sa lansare oficială odată cu &debian; 3.1 (sarge), rezultând atât în suport mai bun pentru hardware cât și capabilități noi, interesante.
sv: Det har skett en hel del utvckling av Debian Installer sedan dess första officiella utgivning med &debian; 3.1 (sarge) som resulterat i både förbättrat hårdvarustöd och ett antal nya spännande funktioner.
vi: Có rất nhiều phát triển trong Bản Cài Đặt Debian kể từ lần phát hành chính thức đầu tiên với &debian; 3.1 (sarge), kết quả là cả hai cải tiến hỗ trợ phần cứng và một số tính năng mới để kích thích.

source: In these Release Notes we'll only list the major changes in the installer. If you are interested in an overview of the detailed changes since &oldreleasename;, please check the release announcements for the &releasename; beta and RC releases available from the Debian Installer's <ulink url="&url-installer-news;">news history</ulink>.
be: У межах "Звестак аб выпуску" апісваюцца толькі самыя значныя змены ў сістэме ўсталявання. Калі Вас цікавіць больш дэтальны агляд зменаў з часу &oldreleasename;, запрашаем пазнаёміцца з паведамленнямі аб выпусках бэта-версій і рэліз-кандыдатаў "&releasename;". Гэтыя паведамленні даступныя на старонцы <ulink url="&url-installer-news;">архіву навінаў Debian Installer</ulink>
de: In diesen Hinweisen zur Veröffentlichung werden wir lediglich die großen Veränderungen am Installer auflisten. Falls Sie an einem detaillierten Überblick über die Änderungen seit &Oldreleasename; interessiert sind, beachten Sie bitte die Ankündigungen (Release Announcements) für &Releasename; beta und die RC-Veröffentlichungen unter <ulink url="&url-installer-news;">Neuigkeiten zum Debian Installer</ulink>.
fi: Tässä julkistusmuistiossa luetellaan vain asentimen suuret muutokset. Katsaus yksityiskohtaisiin muutoksiin &oldreleasename;:n jälkeen löytyy julkaisun &releasename; beta- ja RC-julkaisuista, jotka ovat saatavilla Debianin Asentimen <url id="&url-installer-news" name="vanhoista uutisista">.
it: In queste note di rilascio sono elencati solo i principali cambiamenti dell'installatore. Per una panoramica dei dettagli delle modifiche da &oldreleasename;, consultare gli annunci dei rilasci beta e RC di &releasename;, disponibili nella <ulink url="&url-installer-news;">cronologia delle notizie dell'installatore Debian</ulink>.
ja: このリリースノートでは、インストーラにおける変更点のうち主要なもののみをリストアップします。&oldreleasename; 以降になされた詳細な変更一覧の概要に興味がある場合は、Debian Installer の<ulink url="&url-installer-news;">ニュースの履歴</ulink>で閲覧可能な、&releasename; 用ベータ版やリリース候補版 (RC) のリリースアナウンスを参照してください。
lt: Šiose laidos pastabose aprašysime tik pagrindinius įdiegiklio programos pokyčius. Jei įdomu, kas konkrečiai pasikeitė po &oldreleasename; išleidimo, pasižiūrėkite &releasename; beta ir RC laidų anonsus Debian'o įdiegiklio <ulink url="&url-installer-news;">naujienų istorijoje</ulink>.
nb: I disse utgivelsesnotatene kommer vi bare til å liste opp de største endringene i Debian Installer. Hvis du er interessert i en mer detaljer oversikt over endringer siden &oldreleasename;, så les pressemeldingene for &releasename; beta og RC utgivelsene som er tilgjengelige fra Debian Installer sitt <ulink url="&url-installer-news;">nyhets arkiv</ulink>.
pl: W niniejszych uwagach do wydania zamieszczamy jedynie główne zmiany w instalatorze. Szczegółowy przegląd zmian od chwili wydania &oldreleasename; znajduje w ogłoszeniach wydań beta i RC dystrybucji &releasename;, w <ulink url="&url-installer-news;">archiwalnych wiadomościach</ulink> instalatora Debiana.
pt: Nestas Notas de Lançamento apenas listamos as maiores mudanças no instalador. Se estiver interessado numa visão dos detalhes das mudanças desde a &oldreleasename;, por favor veja os anúncios de lançamento da &releasename; beta e lançamentos RC disponíveis a partir do <ulink url="&url-installer-news;">histórico de notícias</ulink> do Instalador Debian.
pt_br: Nas notas de lançamento nós iremos listar somente as grandes mudanças do instalador. Se você está interessado nas mudanças detalhadas desde o &oldreleasename;, por favor, verifique os anúncios de lançamento das versões beta e RC do &releasename; disponíveis a partir do <ulink url="&url-installer-news;">histórico de notícias</ulink> do Instalador Debian.
ro: În Notele de lansare vom menționa doar modificările majore din programul de instalare. Dacă vă interesează o vedere de ansamblu a modificărilor detaliate începând cu &oldreleasename;, vă rugăm să vedeți anunțurile de lansare ale Programului de instalare Debian, versiunile &releasename; beta și RC disponibile la <ulink url="&url-installer-news;">istoricul știrilor</ulink>.
ru: В информации о выпуске мы опишем только основные изменения в программе установки. Если вы хотите узнать что именно изменилось по сравнению с &oldreleasename;, обратитесь к анонсам выпуска &releasename; beta и RC, доступным из <ulink url="&url-installer-news;">старых новостей</ulink> о программе установки Debian.
sk: V týchto Poznámkach k vydaniu uvedieme iba hlavné zmeny inštalátora. Ak vás zaujíma podrobný prehľad zmien od &oldreleasename;, pozrite si prosím oznámenia o vydaní &releasename; beta a RC dostupné z <ulink url="&url-installer-news;">histórie noviniek</ulink> Debian Installer.
sv: I dessa Kommentarer till utgåvan kommer vi endast att lista de större ändringarna i installeraren. Om du är intresserad av en översikt över detaljerade ändringar sedan &oldreleasename; se utgåveinformationen för beta- och RC-utgåvorna på Debian Installers <ulink url="&url-installer-news;">nyhetsarkiv</ulink>.
vi: Trong Ghi chú Phát hành này chỉ liệt kê những thay đổi chính trong bản cài đặt. Nếu người dùng quan tâm đến toàn cảnh về những thay đổi chi tiết kể từ &oldreleasename;, hãy kiểm tra các thông cáo phát hành đối với những bản phát hành B và RC của &releasename; mà sẵn sàng từ trang Web <ulink url="&url-installer-news;">lịch sử tin tức</ulink> của Bản Cài Đặt Debian.
zh_tw: 在本發行情報裡，我們只會列出在安裝程式裡的一些重大改變。如果您想知道在 &oldreleasename; 之後它的一些詳盡的改變列表，請檢閱在 Debian Installer 的 <ulink url="&url-installer-news;">新聞歷程</ulink> 上有關 &releasename; beta 及 RC 版發行公告。

source: Major changes
be: Асноўныя змены
de: Bedeutende Änderungen
fi: Suuret muutokset
it: Cambiamenti principali
ja: 主要な変更点
lt: Pagrindiniai pokyčiai
nb: Større endringer
pl: Główne zmiany
pt: Maiores alterações
pt_br: Grandes mudanças
ro: Schimbări majore
ru: Основные изменения
sk: Hlavné zmeny
sv: Stora ändringar
vi: Thay đổi chính
zh_tw: 主要改變

source: Support for loading firmware during installation
be: Падтрымка загрузкі фірмовых прашывак падчас усталявання
de: Unterstützung für das Nachladen von Firmware während der Installation
fi: Tuetaan laiteohjelmiston lataamista asennuksen aikana
ja: インストール中のファームウェアのロードをサポート
lt: Mikroprogramų (firmware) įkėlimo palaikymas įdiegimo metu
nb: Støtte for innlasting av fastvare(firmware) under installasjonen
ru: Поддержка загрузки микропрограмм (firmware) во время установки
sk: Podpora načítania firmvéru počas inštalácie
sv: Stöd för att läsa in inbäddad mjukvara under installationen.
vi: Hỗ trợ nạp phần vững trong khi cài đặt

source: It is now possible to load firmware binary files from removable media when they're provided externally to Debian installation media.
be: Цяпер магчыма загружаць бінарныя файлы прашывак з вонкавых носьбітаў, калі яны распаўсюджваюцца асобна ад носьбіту з сістэмай усталявання Debian.
de: Es ist jetzt möglich, binäre Firmware-Dateien von einem Wechseldatenträger nachzuladen, wenn diese nur außerhalb des Debian-Installationsmediums zur Verfügung stehen.
fi: Konekielisiä laiteohjelmistotiedostoja joita ei ole Debianin asennustaltiolla on nyt mahdollista ladata irrotettavalta taltiolta.
ja: Debian のインストールメディア以外で提供されているファームウェアのバイナリファイルが、リムーバブルメディアからロード出来るようになりました。
lt: Dabar galima iš keičiamų nešėjų įkelti mikroprogramų dvejetainius failus, tiekiamus ne Debian'o įdiegiklyje.
nb: Det er nå mulig å laste inn binære fastvare filer fra flyttbare media tilgjengelig utenfor Debian Installer installasjonsmedia.
ru: Теперь возможно загружать двоичные файлы микропрограмм со сменных носителей, которые поставляются отдельно от Debian.
sk: Teraz je možné načítať binárne súbory s firmvérom z prenosných nosičov ak sú externe poskytnuté na inštalačnom nosiči Debianu.
sv: Det är nu möjligt att läsa in inbäddad mjukvara i binär form från ett flyttbart media som tillhandahålls utanför Debians installations media.
vi: Giờ có thể nạp các tập tin nhị phân phần vững từ vật chứa rời được cung cấp ngoài với vật chứa cài đặt Debian.

source: Support for installation from Microsoft Windows <indexterm><primary>Microsoft Windows</primary></indexterm>
be: Падтрымка ўсталявання з асяродку Microsoft Windows <indexterm><primary>Microsoft Windows</primary></indexterm>
de: Unterstützung, eine Installation von Microsoft Windows <indexterm><primary>Microsoft Windows</primary></indexterm> aus zu starten
fi: Tuki asennukselle Microsoft Windowsista <indexterm><primary>Microsoft Windows</primary></indexterm>
ja: Microsoft Windows からのインストールをサポート
lt: Įdiegimo iš Microsoft Windows <indexterm><primary>Microsoft Windows</primary></indexterm> palaikymas
nb: Støtte for å installere direkte fra Microsoft Windows <indexterm><primary>Microsoft Windows</primary></indexterm>
ru: Поддержка установки из Microsoft Windows <indexterm><primary>Microsoft Windows</primary></indexterm>
sk: Podpora inštalácie z Microsoft Windows <indexterm><primary>Microsoft Windows</primary></indexterm>
sv: Stöd för installation från Microsoft Windows <indexterm><primary>Microsoft Windows</primary></indexterm>
vi: Hỗ trợ cài đặt từ MS Windows<indexterm><primary>Microsoft Windows</primary></indexterm>
