Repository: lurdan/trans-ddp
Catalog: release-notes/*/installing.po
Languages: be, de, fi, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: You can install &debian; &release; (&releasename;) with a braille display. The braille display must be connected to a <acronym>USB</acronym> or a serial port. If your braille display is connected to a <acronym>USB</acronym> port and the American braille table is supposed to be used, you can press <keycap>Enter</keycap> in the boot menu. The screen reader BrlTTY is standardized to search for braille displays at the <acronym>USB</acronym> port and uses the American Braille table. If the braille display is connected to a serial port or if you want to use a different braille table, you have to press the <keycap>Tab</keycap> key in the boot menu first. Then, you can configure the screen reader BrlTTY with the kernel parameter brltty.
de: Sie können &debian; &release; (&releasename;) mit einer Braillezeile installieren. Dafür muss das Gerät an einem <acronym>USB</acronym>- oder seriellen Anschluss angeschlossen sein. Wenn Ihre Braillezeile mit einem <acronym>USB</acronym>-Anschluss verbunden ist und die amerikanische Brailleschrift genutzt werden soll, können Sie im Boot-Menü einfach <keycap>Enter</keycap> drücken. Der Screenreader (das Bildschirmleseprogramm) BrlTTY ist so voreingestellt, dass er nach Braillezeilen am <acronym>USB</acronym>-Anschluss sucht und die amerikanische Brailleschrift verwendet. Wenn die Braillezeile mit einem seriellen Anschluss verbunden ist oder Sie eine andere Brailleschrift nutzen wollen, müssen Sie im Boot-Menü erst die <keycap>Tab</keycap>-Taste drücken. Dann können Sie den Screenreader BrlTTY mit dem Kernel-Parameter brltty konfigurieren.
ru: Вы можете выполнить установку &debian; &release; (&releasename;) с помощью дисплея Брайля. Дисплей Брайля должен быть подключён к <acronym>USB</acronym> или последовательному порту. Если дисплей Брайля подключён к <acronym>USB</acronym>-порту и предполагается использовать американскую таблицу Брайля, то вы можете просто нажать <keycap>Enter</keycap> в загрузочном меню. По умолчанию, устройство чтения с экрана BrlTTY ищет дисплей Брайля на портах <acronym>USB</acronym> и использует американскую таблицу Брайля. Если дисплей Брайля подключён к последовательному порту, или вы хотите использовать другую таблицу Брайля, то сначала нажмите клавишу <keycap>Tab</keycap> в загрузочном меню. После этого вы сможете настроить устройство чтения с экрана BrlTTY через параметр ядра brltty.
sk: Môžete nainštalovať &debian; &release; (&releasename;) s braillovým displejom. Braillov displej musí byť pripojený na <acronym>USB</acronym> alebo sériový port. Ak je váš braillov displej pripojený na <acronym>USB</acronym> a má sa používať americká braillova tabuľka, môžete stlačiť <keycap>Enter</keycap> počas zavádzacieho menu. Čítačka obrazovky BrlTTY štandardne hľadá braillove displeje na <acronym>USB</acronym> porte a používa americkú braillovu tabuľku. Ak je braillov displej pripojený na sériový port alebo chcete používať inú braillovu tabuľku, musíte najprv stlačiť v závádzacom menu kláves <keycap>Tab</keycap>. Potom môžete nastaviť čítačku obrazovky BrlTTY parametrom jadra brltty.
zh_tw: 您可以使用 braille（盲人點字）顯示器來安裝 &debian; &release; (&releasename;)。這台點字顯示器必須使用 <acronym>USB</acronym> 或串列埠來進行連線。如果您的點字顯示器是以 <acronym>USB</acronym> 連線，並計劃要使用美國點字表，您可以在安裝選單上按下 <keycap>Enter</keycap>。螢幕讀取程式 BrlTTY 預設是在 <acronym>USB</acronym> 埠上搜尋點字顯示器，並使用美國點字表。若您的點字顯示器是以串列埠連線，或您想要使用其它的點字表，您必須先在安裝選單上按下<keycap>Tab</keycap> 鍵，然後再利用 kernel 參數 brltty 來設定螢幕讀取程式 BrlTTY。

source: The driver for the employed braille display. Here, you must enter either a code consisting of two letters or the word <literal>auto</literal>. If this argument is not entered, the automated recognition is activated by default.
de: Der Treiber für die angeschlossene Braillezeile. Hier müssen Sie einen Code aus zwei Buchstaben oder das Wort "auto" eingeben. Wenn dieser Operand nicht eingegeben wird, ist die automatische Erkennung eingeschaltet.
ru: Драйвер используемого дисплея Брайля. Здесь вы должны ввести, или код, состоящий из двух букв, или слово <literal>auto</literal>. Если эта часть не указана, то по умолчанию используется автоматическое определение.
sk: Ovládač použitého braillovho displeja. Tu musíte zadať buď kód pozostávajúci z dvoch písmen alebo slovo <literal>auto</literal>. Ak nie je tento argument zadaný, aktivuje sa automatické rozpoznávanie.

source: Defines the braille table for the desired language. By default, the US table is employed.
de: Definiert die Brailleschrift für die gewählte Sprache. Als Standard ist die amerikanische Brailleschrift eingestellt.
ru: Задаёт таблицу Брайля желаемого языка. По умолчанию применяется американская таблица (US).
sk: Definuje braillovu tabuľku požadovaného jazyka. Štandardne sa používa tabuľka americkej angličtiny.
zh_tw: 指定想要使用的點字表語系。預設上，會使用 US 點字表。

source: The Handy Tech Driver is used. The braille display is connected to Com1. The German braille table is used.
de: Der Treiber für eine Handy Tech Braillezeile wird verwendet. Die Braillezeile ist über Com1 angeschlossen. Die deutsche Brailleschrift wird verwendet.
ru: Используется драйвер Handy Tech. Дисплей Брайля подключён к Com1. Используется немецкая таблица Брайля.
sk: Použije sa ovládač Handy Tech. Braillov displej je pripojený na port Com1. Použije sa nemecká braillova tabuľka.
zh_tw: 使用 Handy Tech Driver。該點字顯示器被連線為 Com1。使用德國點字表。

source: Here, only the German braille table is specified. Therefore, BrlTTY will try to find a braille display at a <acronym>USB</acronym> port.
de: Hier wird lediglich die deutsche Brailleschrift festgelegt. Daher wird BrlTTY versuchen, die Braillezeile am <acronym>USB</acronym>-Anschluss automatisch zu erkennen.
ru: Здесь указана только немецкая таблица Брайля. Поэтому, BrlTTY попытается найти дисплей Брайля на <acronym>USB</acronym> портах.
sk: Tu je uvedená iba nemecká braillova tabuľka. Preto sa BrlTTY pokúsi nájsť braillov displej na <acronym>USB</acronym> porte.
zh_tw: 在此，只指定為使用德國點字表。因此，BrlTTY 會試著在 <acronym>USB</acronym> 埠上尋找點字顯示器。

source: Support for hardware speech syntheses is enabled only along support for graphical installer. You thus need to select the <computeroutput>Graphical install</computeroutput> entry in the boot menu.
de: Die Unterstützung für Hardware-Sprachausgaben wird nur zusammen mit dem graphischen Installer aktiviert. Sie müssen daher den Eintrag <computeroutput>Graphical install</computeroutput> im Boot-Menü auswählen.
ru: Поддержка устройств речевого синтеза включена только в графическом интерфейсе программы установки. Поэтому следует выбрать <computeroutput>Графический установщик</computeroutput> в загрузочном меню.

source: Hardware speech syntheses can not be automatically detected. You thus need to append the <userinput>speakup.synth=driver</userinput> boot parameter to tell Speakup which driver it should use. <userinput>driver</userinput> should be replaced by the driver code for your device, see <ulink url="&url-speakup-driver-codes;"></ulink> for a list. The textual version of the installer will then be automatically selected, and support for the speech synthesis will be automatically installed on the target system.
de: Die Hardware-Sprachausgabe kann nicht automatisch erkannt werden. Sie müssen daher den Boot-Parameter <userinput>speakup.synth=Treiber</userinput> anhängen, um Speakup mitzuteilen, welcher Treiber es verwenden soll. <userinput>Treiber</userinput> sollte durch die Treiberkennzeichnung für Ihr Geräte ersetzt werden, schauen Sie auf die Liste unter <ulink url="&url-speakup-driver-codes;"></ulink>. Dann wird automatisch die Textversion des Installers ausgewählt und die Unterstützung für die Sprachausgabe wird automatisch im Zielsystem installiert.
ru: Устройства речевого синтеза не могут быть обнаружены автоматически. Поэтому следует добавить параметр загрузки <userinput>speakup.synth=драйвер</userinput> для указания Speakup какой драйвер следует использовать. <userinput>Драйвер</userinput> нужно заменить соответствующим кодом вашего устройства, см. список <ulink url="&url-speakup-driver-codes;"></ulink>. При этом будет выбран текстовый интерфейс программы установки, и в устанавливаемую систему будет добавлена поддержка устройств речевого синтеза.

source: /doc/install/manual/<replaceable>language</replaceable>/index.html
it: /doc/install/manual/<replaceable>lingua</replaceable>/index.html
ja: /doc/install/manual/<replaceable>言語</replaceable>/index.html
pl: /doc/install/manual/<replaceable>język</replaceable>/index.html
pt_br: /doc/install/manual/<replaceable>idioma</replaceable>/index.html

source: Support for hardware speech synthesis is enabled only along support for graphical installer. You thus need to select the <computeroutput>Graphical install</computeroutput> entry in the boot menu.
sk: Podpora hardvérovej syntézy reči je zapnutá iba spolu s podporou grafického inštalátora. Preto musíte vybrať v zavádzacom menu položku <computeroutput>Grafická inštalácia</computeroutput> entry in the boot menu.

source: Dropped platforms
pt: Plataformas removidas
ro: Platforme ne mai suportate

source: Support for the Alpha ('alpha'), ARM ('arm') and HP PA-RISC ('hppa') architectures has been dropped from the installer. The 'arm' architecture is obsoleted by the ARM EABI ('armel') port.
pt: Suporte para as arquitecturas Alpha ('alpha') e ARM('arm') foi removido do instalador, o segundo devido a ter sido tornado obsoleto pelo port armel

source: Support for kFreeBSD
pt: Suporte para kFreeBSD
ro: Suport pentru kFreeBSD

source: The installer can be used to install the kFreeBSD instead of the Linux kernel and test the technology preview. To use this feature the appropriate installation image (or CD/DVD set) has to be used.
pt: O instalador pode ser usado para instalar o kFreeBSD em vez do kernel Linux e testar a previsão da tecnologia. Para usar esta característica a imagem de instalação adequada (ou conjunto de CD/DVD) tem que ser usada.
ro: Programul de instalare poate fi utilizat pentru a instala kFreeBSD în locul nucleului Linux pentru a testa această previzualizare tehnologică. Pentru a utiliza această caracteristică trebuie să utilizați imaginea de instalare potrivită (sau setul de CD-uri/DVD-uri).

source: New supported platforms
it: Nuove piattaforme supportate
pl: Nowo obsługiwane platformy
pt: Novas plataformas suportadas
pt_br: Novas plataformas suportadas
ro: Platforme nou suportate

source: The installation system now supports the following platforms:
it: Adesso il sistema d'installazione supporta le seguenti piattaforme:
pl: System instalacyjny obsługuje obecnie następujące platformy:
pt: O sistema de instalação suporta agora as seguintes plataformas:
pt_br: O sistema de instalação agora suporta as seguintes plataformas:
ro: Sistemul de instalare suportă acum următoarele platforme:

source: Marvell's Kirkwood platform:
it: Piattaforma Kirkwood di Marvell:
pl: Platforma Kirkwood Marvella:
pt: Plataforma Marvell Kirkwood:
pt_br: Plataforma Kirkwood da Marvell:
ro: Platforma Marvell Kirkwood:

source: QNAP TS-110, TS-119, TS-210, TS-219, TS-219P and TS-419P
it: QNAP TS-110, TS-119, TS-210, TS-219, TS-219P e TS-419P
pl: QNAP TS-110, TS-119, TS-210, TS-219, TS-219P i TS-419P
pt: QNAP TS-110, TS-119, TS-210, TS-219, TS-219P e TS-419P
pt_br: QNAP TS-110, TS-119, TS-210, TS-219, TS-219P e TS-419P
ro: QNAP TS-110, TS-119, TS-210, TS-219, TS-219P și TS-419P

source: Marvell SheevaPlug and GuruPlug
it: Marvell SheevaPlug e GuruPlug
pl: Marvell ShevaPlug i GuruPlug
pt: Marvell SheevaPlug e GuruPlug
pt_br: Marvell SheevaPlug e GuruPlug
ro: Marvell SheevaPlug și GuruPlug

source: Marvell OpenRD-Base, OpenRD-Client and OpenRD-Ultimate
it: Marvell OpenRD-Base, OpenRD-Client e OpenRD-Ultimate
pl: Marvell OpenRD-Base, OpenRD-Client i OpenRD-Ultimate
pt: Marvell OpenRD-Base, OpenRD-Client e OpenRD-Ultimate
pt_br: Marvell OpenRD-Base, OpenRD-Client e OpenRD-Ultimate
ro: Marvell OpenRD-Base, OpenRD-Client și OpenRD-Ultimate

source: HP t5325 Thin Client (partial support)
it: HP t5325 Thin Client (supporto parziale)
pl: HP t5325 Thin Client (obsługa częściowa)
pt: HP t5325 Thin Client (suporte parcial)
pt_br: Thin Client HP t5325 (suporte parcial)
ro: HP t5325 Thin Client (suportată parțial)

source: GRUB 2 is the default bootloader
pt: GRUB 2 é o sistema de arranque padrão
ro: GRUB 2 este încărcătorul de sistem implicit

source: The bootloader that will be installed by default is <systemitem role="package">grub-pc</systemitem> (GRUB 2).
pt: O sistema de arranque que será instalado como padrão é o <systemitem role="package">grub-pc</systemitem> (GRUB 2).
ro: Încărcătorl de sistem instalat implicit este <systemitem role="package">grub-pc</systemitem> (GRUB 2).

source: Help during the installation process
pt: Ajuda durante o processo de instalação?
ro: Ajutor pe timpul procesului de instalare

source: The dialogs presented during the installation process now provide help information. Although not currently used in all dialogs, this feature would be increasingly used in future releases. This will improve the user experience during the installation process, especially for new users.
pt: Os diálogos apresentados durante o processo de instalação apresentam agora informações de ajuda. Apesar de actualmente não ser usado em todos os diálogos, esta característica será mais usada em lançamentos futuros. Isto irá melhorar a experiência do utilizador durante o processo de instalação, especialmente para novos utilizadores.
ro: Dialogurile prezentate pe timpul procesului de instalare oferă acum și informații ajutătoare. Deși caracteristica nu este folosită în toate dialogurile, ea va fi folosită mai mult în lansările viitoare. Aceasta va îmbunătății experiența utilizatorilor pe timpul procesului de instalare, în special pentru utilizatorii noi.

source: Installation of Recommended packages
pt: Instalação de pacotes Recomendados
ro: Instalarea pachetelor recomandate

source: The installation system will install all recommended packages by default throughout the process except for some specific situations in which the general setting gives undesired results.
pt: O sistema de instalação irá instalar todos os pacotes recomendados por pré-definição ao longo de todo o processo, excepto em situações específicas em que esta opção geral produz resultados indesejados.
ro: Sistemul de instalare va instala implicit toate pachetele recomandate de-a lungul procesului, cu excepția unor situații specifice în care configurarea generală produce rezultate nedorite.

source: Automatic installation of hardware-specific packages
pt: Instalação automática de pacotes específicos para hardware
ro: Instalarea automată a pachetelor specifice unui anumit echipament

source: The system will automatically select for installation hardware-specific packages when they are appropriate. This is achieved through the use of <literal>discover-pkginstall</literal> from the <systemitem role="package">discover</systemitem> package.
pt: O sistema irá automaticamente seleccionar para instalação pacotes específicos para o hardware quando apropriado. Isto é conseguido através do uso do <literal>discover-pkginstall</literal> do pacote <systemitem role="package">discover</systemitem> package.
ro: Sistemul va alege automat pentru instalare, atunci când este necesar, pachetele specifice unui anumit echipament. Acest lucru este obținut prin intermediul <literal>discover-pkginstall</literal> din pachetul <systemitem role="package">discover</systemitem>.

source: Support for installation of previous releases
pt: Suporte para instalação de lançamentos anteriores
ro: Suport pentru instalarea lansărilor precedente

source: The installation system can be also used for the installation of previous release, such as &oldreleasename;.
pt: O sistema de instalação pode também ser usado para instalar o lançamento anterior, como o &oldreleasename;
ro: Sistemul de instalare poate fi de asemenea utilizat pentru instalarea lansărilor precedente, cum ar fi &oldreleasename;.

source: Improved mirror selection
pt: Selecção de mirror melhorada
ro: Selecție sit-alternativ îmbunătățită

source: The installation system provides better support for installing both &releasename; as well as &oldreleasename; and older releases (through the use of archive.debian.org). In addition, it will also check that the selected mirror is consistent and holds the selected release.
pt: O sistema de instalação apresenta suporte melhorado para instalar tanto o &releasename; como o &oldreleasename; e lançamentos mais antigos (através do uso do archive.debian.org). Além disto, irá também verificar que o mirror escolhido é consistente e mantém o lançamento seleccionado.
ro: Sistemul de instalare oferă suport mai bun pentru instalarea atât a &releasename; a &oldreleasename; cât și a lansărilor mai vechi (folosind archive.debian.org). În plus, va verifica dacă situl alternativ folosit este consecvent și deține lansarea aleasă.

source: Changes in partitioning features
pt: Alterações nas funcionalidade de particionamento
ro: Modificări ale caracteristicilor de partiționare

source: This release of the installer supports the use of the ext4 file system and it also simplifies the creation of RAID, LVM and crypto protected partitioning systems. Support for the reiserfs file system is no longer included by default, although it can be optionally loaded.
pt: Este lançamento do instalador suporta o uso do sistema de ficheiros ext4 e também simplifica a criação de sistemas RAID, LVM, e sistemas protegidos por encriptação. Suporte para o reiserfs já não é incluído como padrão, apesar de poder ser carregado opcionalmente.
ro: Această lansare a programului de instalare suportă folosirea sistemului de fișiere ext4 și simplifică de asemenea crearea sistemelor de partiționare RAID, LVM și partițiilor criptate. Suportul pentru sistemul de fișiere reiserfs nu mai este includ în mod implicit, dar poate fi încărcat opțional.

source: Support for loading firmware debs during installation
pt: Suporte para carregamento de debs de firmware durante a instalação
ro: Suport pentru încărcarea de pachete cu microcod în timpul instalării

source: It is now possible to load firmware package files from the installation media in addition to removable media, allowing the creation of PXE images and CDs/DVDs with included firmware packages.
pt: É agora possível carregar ficheiros de pacotes de firmware a partir do media de instalação além de media amovível, permitindo a criação de imagens PXE e CDs/DVDs com pacotes de firmware incluídos.
ro: Este posibil acum să încărcați pachete cu microcod de pe mediul de instalare, în plus față de mediile detașabile, permițând crearea de imagini PXE și CD-uri/DVD-uri cu pachete cu microcod incluse.

source: Starting with Debian &release;, non-free firmware has been moved out of main. To install Debian on hardware that needs non-free firmware, you can either provide the firmware yourself during installation or use pre-made non-free CDs/DVDs which include the firmware. See the <ulink url="http://www.debian.org/distrib">Getting Debian section</ulink> on the Debian website for more information.
pt: A partir do Debian &release;, o firmware não-livre foi removido do main. Para instalar o Debian em hardware que necessita de firmware não-livre, pode fornecer o firmware durante a instalação ou usar CDs/DVDs não-livres, pré-feitos que incluem o firmware. Veja a <ulink url="http://www.debian.org/distrib">secção Getting Debian</ulink> no website do Debian para mais informações.
ro: Începând cu lansarea Debian &release;, microcodul proprietar a fost înlăturat din main. Pentru a instala Debian pe echipament ce necesită microcod proprietar, fie oferiți dumneavoastră microcodul în timpul procesului de instalare sau folosiți CD-uri/DVD-uri nelibere gata realizate, ce includ acest microcod. Vizitați <ulink url="http://www.debian.org/distrib">secțiunea Obțineți Debian</ulink> de pe situl Debian, pentru mai multe informații.

source: Thanks to the huge efforts of translators, &debian; can now be installed in 70 languages. This is seven more languages than in &oldreleasename;. Most languages are available in both the text-based installation user interface and the graphical user interface, while some are only available in the graphical user interface.
pt: Graças aos enormes esforços dos tradutores, &debian; pode agora ser instalado em 70 idiomas. São mais sete idiomas que no &oldreleasename;. A maior parte dos idiomas estão disponíveis tanto na interface de texto como na interface gráfica do instalador, enquanto que alguns estão apenas disponíveis na interface gráfica.
pt_br: Graças aos enormes esforços dos tradutores, &debian; agora pode ser instalado em 70 idiomas. Isso significa sete idiomas a mais do que na &oldreleasename;. A maioria dos idiomas estão disponíveis para instalação tanto em interface baseada em texto quanto em interface gráfica, enquanto alguns só estão disponíveis em interface gráfica.

source: Languages added in this release include:
it: Le lingue aggiunte in questa versione includono:
pl: W niniejszym wydaniu dodano następujące języki:
pt: Idiomas adicionados neste lançamento incluem:
pt_br: Os idiomas acrescentados nesta versão incluem:
ro: Limbile adăugate la această lansare includ:

source: Asturian, Estonian, Icelandic, Kazakh and Persian have been added to the graphical and text-based installer.
pt: Asturiano, Estónio, Islandês, Cazaque e Persa foram adicionados ao instalador em modo texto e em modo gráfico.
pt_br: Asturiano, Estoniano, Islandês, Cazaque e Persa foram adicionados ao instalador em modo gráfico e modo texto.

source: Kannada, Lao, Sinhala and Telugu have been added to the graphical installer.
pt: Kannada, Lao, Sinhala e Telugu foram adicionados ao instalador gráfico.
pt_br: Canarês, do Lao, Singalês e do Telugu foram adicionados ao instalador gráfico.

source: Thai, previously available only in the graphical user interface, is now available also in the text-based installation user interface too.
pt: Tailandês, anteriormente apenas disponível na interface gráfica, está agora também disponível no modo texto.
pt_br: Tailandês, anteriormente apenas disponível na interface gráfica, agora está também disponível no modo texto.
ro: Limba thai, disponibilă în trecut doar în modul de instalare grafic , este disponibilă acum și în modul text de instalare.

source: Due to the lack of translation updates two languages were dropped in this release: Wolof and Welsh.
pt: Devido a falta de actualizações de tradução dois idiomas foram eliminados neste lançamento: Wolof e Galês.
pt_br: Devido à falta de atualizações de tradução dois idiomas foram descontinuados nesta versão: Wolof e Galês.
ro: Datorită lipsei actualizărilor la traduceri, două limbi nu mai sunt disponibile în această versiune: wolof și welsh.
