Repository: lurdan/trans-ddp
Catalog: release-notes/*/installing.po
Languages: be, de, fi, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: The languages that can only be selected using the graphical installer as their character sets cannot be presented in a non-graphical environment are: Amharic, Bengali, Dzongkha, Gujarati, Hindi, Georgian, Kannada, Khmer, Malayalam, Marathi, Nepali, Punjabi, Tamil and Telugu.
pt: Os idiomas que podem ser apenas seleccionados no instalador gráfico, já que os seus conjuntos de caracteres não podem ser apresentados num ambiente não-gráfico são: Amárico, Bengali, Dzongkha, Gujarati, Hindi, Georgiano, Kannada Cambojano, Malaiala, Marati, Nepalês, Punjabi, Tâmil e Telugu.
pt_br: Os idiomas que só podem ser selecionados usando o instalador gráfico, já que seus conjuntos de caracteres não podem ser apresentados num ambiente não-gráfico, são: Amárico, Bengali, Dzongkha, Gujarati, Hindi, Georgiano, Kannada, Khmer, Malaiala, Marathi, Nepalês, Punjabi, Tamil e Telugu.
ro: Limbile care pot fi selectate doar folosind modul de instalare grafic, deoarece caracterele lor specifice nu pot fi prezentate într-un mediu non-grafic, sunt: amharic, bengali, dzongkha, gujarati, hindusă, georgiană, khannadă, khmeră, malayalam, marathi, nepaleză, punjabi, tamilă și telugu.

source: Improved localisation selection
pt: Selecção de localização melhorada
ro: Selectare simplificată a localizării

source: The selection of localisation-related values (language, location and locale settings) is now less interdependent and more flexible. Users will be able to customize the system to their localisation needs more easily while still make it comfortable to use for users that want to select the locale most common for the country they reside in.
pt: A selecção de valores relacionados com a localização (idioma, localização e definições regionais) é agora menos interdependente e mais flexível. Os utilizadores podem escolher o sistema de acordo com as suas necessidades de localização mais facilmente enquanto se mantém confortável para que os utilizadores escolham as definições mais comuns para o seu país.
ro: Alegerea valorilor ce țin de localizare (limbă, loc și configurări locale) este acum mult mai puțin interdependentă și mult mai flexibilă. Utilizatorii vor putea să personalizeze sistemul după nevoile lor de localizare cu mai multă ușurință, permițând în același timp celorlați utilizatori să aleagă preferințele locale potrivite țării în care locuiesc.

source: Additionally, the consequences of localisation choices (such as timezone, keymap and mirror selection) are now more obvious to the user.
pt: Além disso, as consequências das escolhas de localização (como o fuso horário, mapa de teclado e selecção de mirror) são agora muito mais óbvias para o utilizador.
ro: În plus, consecințele opțiunilor de localizare (zona de timp, harta de taste și situl-alternativă) sunt acum mult mai evidente utilizatorului.

source: Live system installation
pt: Instalação do sistema Live

source: The installer now supports live systems in two ways. First, an installer included on live system media can use the contents of the live system in place of the regular installation of the base system. Second, the installer may now be launched while running the live system, allowing the user to do other things with the live system during the install. Both features are built into the Debian Live images offered at <ulink url="http://cdimage.debian.org/" />.
pt: O instalador agora suporta sistemas live de duas formas. Primeiro, o instalador incluido em média de sistemas live pode utilizar o conteúdo do sistemas live em lugar da usual instalação do sistema base. Em segundo, o instalador pode agora ser lançado enquanto corre o sistema live, permitindo ao utilizador fazer outras coisas com o sistema live durante a instalação. Ambas as funcionalidades estão nas images Debian Live oferecidas em <ulink url="http://cdimage.debian.org/" />.

source: Intel Storage System SS4000-E
ro: Sistemul de stocare Intel SS4000-E

source: Thanks to the huge efforts of translators, &debian; can now be installed in 67 languages. This is three more languages than in &oldreleasename;. Most languages are available in both the text-based installation user interface and the graphical user interface, while some are only available in the graphical user interface.
ro: Mulțumită eforturilor uriașe ale traducătorilor, &debian; poate di instalat acum în 67 de limbi. Cu trei limbi în plus față de &oldreleasename;. Majoritatea limbilor sunt disponibile atât la instalarea în mod text cât și la cea cu interfață grafică, în timp ce unele sunt disponibile doar la instalarea cu interfață grafică.

source: Asturian, Estonian, Kazakh and Persian have been added to the graphical and text-based installer.
ro: Limbile asturiană, estoniană, cazacă și persană au fost adăugate la programul de instalare în mod text și grafic.

source: Kannada and Telugu have been added to the graphical installer.
ro: Limbile kannada și telugu au fost adăugate la modul grafic de instalare.

source: There has been a lot of development on the Debian Installer since its first official release with &oldreleasename; resulting in both improved hardware support and some exciting new features.
zh_tw: 自從 Debian Installer 在 &oldreleasename; 發行了首次的官方版本後，針對硬體支援及一些有趣的新功能方面又經歷了大量的開發工作。

source: More flexible partitioning
zh_tw: 更有彈性的分割程式

source: It is now possible to set up file systems on an <acronym>LVM</acronym> volume using guided partitioning.
zh_tw: 現已可以利用分割引導程式，在檔案系統上使用 <acronym>LVM</acronym> Volume。

source: The installer is also able to set up encrypted file systems. Using manual partitioning you have the choice between <literal>dm-crypt</literal> and <literal>loop-aes</literal>, using a passphrase or a random key, and you can tune various other options. Using guided partitioning, the installer will create an encrypted <acronym>LVM</acronym> partition that contains any other file systems (except <filename>/boot</filename>) as logical volumes.
zh_tw: 安裝程式現也可以設定加密檔案系統。若使用手動分割磁碟，您可以選擇使用 <literal>dm-crypt</literal> 或是 <literal>loop-aes</literal>，使用密語或隨機的密鑰，同時您還可以調整其它各式各樣的選項。使用分割引導程式，安裝程式將會建立一個加密 <acronym>LVM</acronym> 分割區，它包含了其它的檔案系統（除了 <filename>/boot</filename> 之外）的 Logical Volumes。

source: Graphical user interface
zh_tw: 圖形安裝介面

source: If you prefer a graphical user interface, try booting the installer with <literal>installgui</literal>.
zh_tw: 如果您比較喜歡使用圖形介面，請試著以 <literal>installgui</literal> 來啟動安裝程式。

source: The functionality of the graphical installer is almost identical to the regular installer, only the presentation differs. There is one exception: the graphical frontend does not support setting up encrypted partitions using random keys.
zh_tw: 除了在外表上，圖形介面的安裝程式和一般安裝程式的功能幾乎沒有任何差別。但只有一個地方不同：使用圖形介面的安裝程式無法將加密分割區設定為使用隨機金鑰。

source: The major advantage of the graphical user interface is that it supports more languages than the regular user interface (newt). Information about the graphical installer and the most important differences between the graphical and regular installer are documented in an appendix in the installation guide.
zh_tw: 圖形使用者介面的主要優勢是它比文字介面 (newt) 支援了更多語系。您可以在安裝程式指引的附錄中找到圖形安裝程式之相關資訊及圖形安裝程式和文字安裝程式之間的眾多差異。

source: The graphical user interface is not available for all architectures.
zh_tw: 並不是所有的系統平台都有圖形介面可用。

source: Rescue mode
zh_tw: 救援模式

source: You can use the installer to solve problems with your system, for example when it refuses to boot. The first steps will be just like a regular installation, but the installer will not start the partitioner. Instead it will offer you a menu of rescue options.
zh_tw: 您可以利用安裝程式來修復您系統上一些像是無法開機的問題。剛開始的步驟會和一般的安裝步驟極為類似，但安裝程式不會啟動磁碟分割程式，取而代之的它會提供一個列有救援選項的選單。

source: Activate the rescue mode by booting the installer with <literal>rescue</literal>, or by adding a boot parameter <literal>rescue/enable=true</literal>.
zh_tw: 請以 <literal>rescue</literal> 啟動安裝程式，或是在開機時加上 <literal>rescue/enable=true</literal> 參數，就能啟動救援模式。

source: Using sudo instead of root account
zh_tw: 使用 sudo 來取代 root 帳號

source: During expert installations you can choose to not set up the root account (it will be locked), but instead set up <command>sudo</command> so that the first user can use that for system administration.
zh_tw: 在 expert 安裝模式中，您可以選擇不要設定 root 帳號（讓它因而被鎖上）。取而代之的是設定 <command>sudo</command>，讓第一個使用者可以利用它來進行系統管理。

source: Simplified mail configuration
zh_tw: 簡化的郵件設定

source: Desktop selection
zh_tw: 選擇桌面

source: The installation system will install a GNOME desktop as the default desktop if the user asks for one.
zh_tw: 如果使用者需要的話，安裝系統將會安裝 GNOME 桌面做為預設的桌面環境。

source: There are also separate CD images available that install the KDE or Xfce desktop environment by default.
zh_tw: 同時，也個別提供了預設上就會安裝 KDE 或 Xfce 桌面環境的 CD 影像檔。

source: Thanks to the huge efforts of translators, Debian can now be installed in 47 languages using the text-based installation user interface. This is six languages more than in &oldreleasename;. Languages added in this release include Belarusian, Esperanto, Estonian, Kurdish, Macedonian, Tagalog, Vietnamese and Wolof. Due to lack of translation updates, two languages have been dropped in this release: Persian and Welsh.
zh_tw: 感謝翻譯者們的辛勤努力，若使用文字介面模式安裝時，Debian 支援了 47 種語系。這比之前的 &oldreleasename; 再多出 6 種語系。新增的語系包括了白俄羅斯語、世界語、愛沙尼亞語、庫爾德語、馬其頓語、塔加啦語、越南語和窩羅夫語。而因為缺乏翻譯的更新，在這個發行版中有兩個語系被廢棄了：波斯語及威爾斯語。

source: If the graphical user interface is used, an additional eleven languages are supported. These languages can only be selected using this installer as their character sets cannot be presented in a non-graphical environment. The new languages are: Bengali, Dzongkha, Gujarati, Hindi, Georgian, Khmer, Malayalam, Nepali, Punjabi, Tamil and Thai.
zh_tw: 如果使用的是圖形介面，將會再支援額外 11 種語系。只能在該安裝程式中選取這些語系是因為它們的字元集無法在非圖形介面上顯示。這些新增語系包含了：孟加拉語、宗卡語、古吉拉特語、印地語、喬治亞語、高棉語、馬拉雅蘭語、尼泊爾語、旁遮普語、坦米爾語及泰語。

source: Users that do not wish to use any locale can now select <emphasis>C</emphasis> as their preferred locale in the installer's language selection. More information on language coverage is available at the <ulink url="&url-d-i-i18n;">d-i languages list</ulink>.
zh_tw: 如果不想使用任何區域資訊的使用者現在可以在安裝程式的語系中選擇 <emphasis>C</emphasis> 做為偏好的區域資訊。更多的語系的相關資訊可以由 <ulink url="&url-d-i-i18n;">d-i 語系列表</ulink> 上取得。

source: Simplified localization and timezone selection
zh_tw: 區域語系及時區選擇上的簡化

source: Configuration of language, countries and timezones has been simplified to reduce the amount of information needed from the user. The installer will now guess what the system's country and timezone is based on the language selected, or will provide a limited selection if it cannot. Users can still introduce obscure combinations if need be.
zh_tw: 語系、國家和時區的設定現已經過簡化以減少使用者必須輸入的資料次數。安裝程式現在會根據所選取的語系自動判斷系統的國家及時區，或是在無法判斷時提供精簡的選擇列表。但使用者在必要時還是可以使用模糊的組合。

source: Improved system-wide localization
zh_tw: 全域系統在區域化上的改良

source: Most of the internationalization and localization tasks that were previously handled by the <systemitem role="package">localization-config</systemitem> tool are now included in the stock Debian installer or in packages themselves. This means that selection of a language will automatically install packages necessary for that language (dictionaries, documentation, fonts...) in both standard and desktop environments. Configuration that is no longer handled automatically includes the papersize configuration and some advanced X Windows keyboard settings for some languages.
zh_tw: 以前由 <systemitem role="package">localization-config</systemitem> 工具所負責的大部份的國際化及區域化之主題現在已包含於 Debian 安裝工具之中或是包含於該套件裡。也就是說，在標準及桌面環境裡，選擇某一個語系會自動得安裝該語系所需的像是辭典、文件、字型... 等等套件。有些像是紙張大小的設定以及某些語系的部份進階 X Windows 鍵盤設置已不再被自動設定了。

source: Note that language-specific packages will only be installed automatically if they are available during the installation.
zh_tw: 請注意到，只有在安裝過程中就能取得各語系特定的套件之時，這些套件才會被自動安裝進來。

source: A lot of the changes mentioned in the previous section also imply changes in the support in the installer for automated installation using preconfiguration files. This means that if you have existing preconfiguration files that worked with the &oldreleasename; installer, you cannot expect these to work with the new installer without modification.
zh_tw: 在之前的章節中所提到的眾多改變，其中也包含了在安裝程式裡利用事先準備好的設定檔來進行自動安裝。這意謂著，如果您手上有著用來和 &oldreleasename; 安裝程式搭配使用的事先準備好的設定檔，若未經修改將難以和新的安裝程式搭配使用。

source: The good news is that the <ulink url="&url-install-manual;">Installation Guide</ulink> now has a separate appendix with extensive documentation on using preconfiguration.
zh_tw: 好消息是，在 <ulink url="&url-install-manual;">安裝指引</ulink> 上有獨立的附錄，上有如何使用事先準備好的設定檔之大量資訊。

source: The &releasename; installer introduces some exciting new features that allow further and easier automation of installs. It also adds support for advanced partitioning using <acronym>RAID</acronym>, <acronym>LVM</acronym> and encrypted <acronym>LVM</acronym>. See the documentation for details.
zh_tw: &releasename; 版的安裝程式也包含了一些允許更為多樣且更容易進行自動安裝之新奇功能。它也新支援了一些進階的磁碟分割方式，像是使用 <acronym>RAID</acronym>、<acronym>LVM</acronym> 及加密的 <acronym>LVM</acronym>。請參關相關文件以取得更詳盡的資訊。

source: Popularity contest
zh_tw: 熱門套件競賽

source: The installation system will again offer to install the <systemitem role="package">popularity-contest</systemitem> package. This package was not installed by default in &oldreleasename; but it was installed in older releases.
zh_tw: 安裝系統將會再次安裝 <systemitem role="package">popularity-contest</systemitem> 套件。在 &oldreleasename; 裡，預設上並不會安裝這個套件，但會在更舊的系統上被安裝。

source: <systemitem role="package">popularity-contest</systemitem> provides the Debian project with valuable information on which packages in the distribution are actually used. This information is used mainly to decide the order in which packages are included on installation CD-ROMs, but is also often consulted by Debian developers in deciding whether or not to adopt a package that no longer has a maintainer.
zh_tw: <systemitem role="package">popularity-contest</systemitem> 能夠向 Debian 專案提供在發行版中哪些套件正在被使用著的這個極有價值資訊。這個資訊主要是用來決定該將哪些套件放入安裝光碟的優先順序。而且 Debian 的開發者也常常根據它的報告來決定是否該放棄某個已經沒有維護者的套件。

source: Information from <systemitem role="package">popularity-contest</systemitem> is processed anonymously. We would appreciate it if you would participate in this official survey, helping to improve Debian.
zh_tw: 由 <systemitem role="package">popularity-contest</systemitem> 所提交的報告是匿名進行的。我們將會非常感激於如果您能參與這個官方的調查工作，這將有助於促使 Debian 進步。

source: There has been a lot of development on the Debian Installer since its previous official release with &debian; &oldrelease;, resulting in both improved hardware support and some exciting new features.
it: L'installatore Debian ha fatto molti passi avanti dalla precedente versione rilasciata ufficialmente con &debian; &oldrelease;, raggiungendo un migliore supporto all'hardware e alcune nuove e interessanti funzionalità.

source: Support for the 'armhf' and 's390x' architectures has been added to the installer.
it: È stato aggiunto all'installatore il supporto per le architetture «armhf» e «s390x».
pl: Instalator obsługuje teraz architektury <quote>armhf</quote> i <quote>s390x</quote>.

source: Software speech support
it: Supporto per il software di sintesi vocale
pl: Obsługa syntezatorów mowy
pt_br: Suporte a software de síntese de voz

source: &debian; can be installed using software speech, for instance by visually impaired people who do not use a Braille device. This is triggered simply by typing <literal>s</literal> and <literal>Enter</literal> at the installer boot beep. More than a dozen languages are supported.
it: &debian; può essere installata usando software di sintesi vocale, per esempio da persone ipovedenti che non usano un dispositivo Braille. Ciò può essere attivato semplicemente scrivendo <literal>s</literal> e <literal>Invio</literal> al bip dell'avvio dell'installatore. È supportata più di una dozzina di lingue.

source: Thanks to the huge efforts of translators, &debian; can now be installed in 74 languages, including English. This is three more languages than in &oldreleasename;. Most languages are available in both the text-based installation user interface and the graphical user interface, while some are only available in the graphical user interface.
it: Grazie agli enormi sforzi dei traduttori, &debian; può ora essere installato in 74 lingue, compreso l'inglese, vale a dire tre lingue in più rispetto a &oldreleasename;. La maggior parte delle lingue è disponibile sia con l'interfaccia testuale sia con l'interfaccia grafica, mentre alcune sono disponibili solo con l'interfaccia grafica.

source: Welsh has been re-added to the graphical and text-based installer (it had been removed in &oldreleasename;).
it: La lingua gallese è stata aggiunta di nuovo alla versione grafica e testuale dell'installatore (era stata rimossa in &oldreleasename;).

source: Tibetan and Uyghur have been added to the graphical installer.
it: Le lingue tibetana e uigura sono state aggiunte alla versione grafica dell'installatore.

source: The languages that can only be selected using the graphical installer as their character sets cannot be presented in a non-graphical environment are: Amharic, Bengali, Dzongkha, Gujarati, Hindi, Georgian, Kannada, Khmer, Malayalam, Marathi, Nepali, Punjabi, Tamil, Telugu, Tibetan and Uyghur.
it: Le lingue che possono essere selezionate solo usando l'installatore grafico, in quanto i loro set di caratteri non possono essere presentati in modalità non-grafica, sono: amarico, bengalese, dzongkha, gujarati, hindi, georgiano, kannada, khmer, malayalam, marathi, nepalese, punjabi, tamil, telegu, tibetano e uiguro.

source: Network configuration
it: Configurazione di rete
pl: Konfiguracja sieci

source: The installer now supports installation on IPv6-only networks.
it: Adesso il sistema d'installazione supporta l'installazione su reti che forniscono solo IPv6.
pl: System instalacyjny obsługuje obecnie instalację w sieciach działających wyłącznie z IPv6.

source: It is now possible to install over a WPA-encrypted wireless network.
it: È ora possibile installare su una rete wireless cifrata con WPA.
pl: Możliwe jest zainstalowanie systemu korzystając z sieci bezprzewodowej z szyfrowaniem WPA.

source: Default filesystem
it: File system predefinito
pl: Domyślny system plików

source: <literal>ext4</literal> is the default filesystem for new installations, replacing <literal>ext3</literal>.
it: <literal>ext4</literal> è il file system predefinito per le nuove installazioni, al posto di <literal>ext3</literal>.
pl: W nowych instalacjach domyślnym systemem plików stał się <literal>ext4</literal>, zastępując stosowany wcześniej <literal>ext3</literal>.

source: The <literal>btrfs</literal> filesystem is provided as a technology preview.
it: Il file system <literal>btrfs</literal> è fornito come anteprima tecnologica.
pl: System plików <literal>btrfs</literal> jest dostępny jako pokaz przedpremierowy.

source: UEFI boot
it: Avvio da UEFI

source: It is now possible to install PCs in UEFI mode instead of using the legacy BIOS emulation.
it: È ora possibile installare i PC in modalità UEFI invece di usare la vecchia emulazione BIOS.

source: Note that this does not include support for UEFI Secure Boot.
it: Notare che questo non include il supporto per il Secure Boot UEFI.

source: &debian; can now be installed using software speech, for instance by visually impaired people who do not use a braille device. This is triggered simply by typing <literal>s</literal> and <literal>Enter</literal> at the installer boot beep. More than a dozen languages are supported.
pt_br: O &debian; agora pode ser instalado usando software de síntese de voz, por exemplo, por pessoas com deficiência visual que não usam um dispositivo braille. Esse recurso é acionado simplesmente digitando <literal>s</literal> e <literal>Enter</literal> após o bip de inicialização do instalador. Mais de doze idiomas são suportados.
