Repository: lurdan/trans-ddp
Catalog: release-notes/*/issues.po
Languages: be, de, fr, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sv, zh_tw

source: The compatibility binary is not suitable for interactive use, so as system administrator, adjust the login shell of your Korn Shell users. For minimal service interruption, do this before the upgrade of the O.S.: manually install the <systemitem role="package">mksh</systemitem> package and change the login and/or interactive shells of users that use <command>pdksh</command> to <command>mksh</command>. Furthermore, you're encouraged to copy <filename>/etc/skel/.mkshrc</filename> into their home directories: this provides some shell functions like <command>pushd</command>, <command>popd</command> and <command>dirs</command> and a nice
fr: Le binaire de compatibilité n'est pas adapté à l'utilisation interactive, donc vous devez, en tant qu'administrateur système, ajuster l'interpréteur de commandes de vos utilisateurs Korn Shell. Pour une interruption de service minimale, faites cela avant la mise à niveau du système d'exploitation : installez le paquet <systemitem role="package">mksh</systemitem> manuellement et remplacez les interpréteurs de connexion et/ou interactifs des utilisateurs de <command>pdksh</command> par <command>mksh</command>. De plus, nous vous encourageons à copier <filename>/etc/skel/.mkshrc</filename> dans leur répertoire personnel : ce fichier fournit quelques fonctions telles que <command>pushd</command>, <command>popd</command> et <command>dirs</command> ainsi qu'un joli
pl: Ten plik wykonywalny zachowujący kompatybilność nie jest odpowiedni do stosowania interaktywnego, dlatego administrator systemu powinien zmienić odpowiednio powłokę logowania swoich użytkowników korzystających z powłoki Korna. W celu zmniejszenia czasu niedostępności usługi proszę wykonać to przed aktualizacją całego systemu, tzn. proszę ręcznie zainstalować pakiet <systemitem role="package">mksh</systemitem> i zmienić powłoki logowania i/lub interaktywne użytkowników, korzystających z <command>pdksh</command> na <command>mksh</command>. Zaleca się również skopiowanie pliku <filename>/etc/skel/.mkshrc</filename> do ich katalogów domowych, co udostępnia pewne funkcje powłoki, takie jak <command>pushd</command>, <command>popd</command> i <command>dirs</command> oraz przyjemny
pt_br: O executável de compatibilidade não é adequado para uso interativo, então, como administrador de sistema, ajuste o shell de login dos seus usuários do Korn Shell. Para interrupção mínima do serviço, faça isso antes da atualização do SO: instale manualmente o pacote <systemitem role="package">mksh</systemitem> e mude o login e/ou shells interativos dos usuários que utilizem <command>pdksh</command> para <command>mksh</command>. Além disso, encorajamos que você copie o <filename>/etc/skel/.mkshrc</filename> em seus diretórios pessoais: isso proporciona algumas funções do shell como <command>pushd</command>, <command>popd</command> e <command>dirs</command> e um agradável

source: (shell prompt).
fr: (invite de commande).
pl: (znak zachęty powłoki).
pt_br: (prompt do shell).
ru: (приглашение командной строки).
sv: (skalprompt).

source: Puppet 2.6 / 2.7 compatibility
fr: Compatibilité de Puppet 2.6 et 2.7
pl: Kompatybilność Puppet 2.6 / 2.7
pt_br: Compatibilidade puppet 2.6 / 2.7
ru: Совместимость Puppet 2.6 / 2.7
sv: Puppet 2.6 / 2.7 kompabilitet

source: When upgrading a Puppet managed system from squeeze to wheezy, you must ensure that the corresponding puppetmaster runs at least Puppet version 2.7. If the master is running squeeze's <systemitem role="package">puppetmaster</systemitem>, the managed wheezy system will not be able to connect to it.
fr: Lors de la mise à niveau de Squeeze vers Wheezy d'un système géré par Puppet, assurez-vous que le puppetmaster correspondant utilise au moins la version 2.7. Si le maître fonctionne avec le <systemitem role="package">puppetmaster</systemitem> de Squeeze, le système géré sous Wheezy ne sera pas capable de s'y connecter.
pl: Przy aktualizacji systemu zarządzania Puppet z wydania squeeze do wheezy należy upewnić się, że na odpowiednim puppetmaster działa co najmniej wersja 2.7. Jeśli master korzysta z wersji <systemitem role="package">puppetmaster</systemitem> z wydania squeeze, system zarządzający wheezym nie będzie mógł się z nim połączyć.
pt_br: Quando atualizar um sistema de gerenciamento Puppet do squeeze para o wheezy, você deve garantir que o puppetmaster correspondente funcione, pelo menos, na versão 2.7 do Puppet. Caso o mestre esteja executando o <systemitem role="package">puppetmaster</systemitem> do squeeze, o sistema gerenciado do wheezy não será capaz de conectar ao mesmo.

source: Such a combination will lead to the following error message during a <command>puppet agent</command> run:
fr: Une telle combinaison entraînera le message d'erreur suivant au lancement de <command>puppet agent</command> :
pl: Objawem wystąpienia takiego zestawienia będzie następujący błąd przy uruchomieniu <command>puppet agent</command>:
pt_br: Tal combinação levará à seguinte mensagem de erro durante uma execução do <command>agente puppet</command>:
ru: При такой комбинации запуск <command>puppet agent</command> вызовет следующую ошибку:

source: Could not retrieve catalog from remote server: Error 400 on SERVER: No support for http method POST
fr: Could not retrieve catalog from remote server: Error 400 on SERVER: No support for http method POST (« Impossible de récupérer le catalogue depuis le serveur distant : erreur 400 sur SERVEUR : pas de prise en charge pour la méthode http POST »)
pt_br: Não foi possível recuperar o catálogo do servidor remoto: Erro 400 no SERVIDOR: Não há suporte para o método POST do http
sv: Kunde inte hämta katalog från fjärrserver: Fel 400 på SERVER: Inget stöd för http-metoden POST (Could not retrieve catalog from remote server: Error 400 on SERVER: No support for http method POST )

source: In order to resolve this issue the puppetmaster must be upgraded. A 2.7 master is able to manage a 2.6 client system.
fr: Afin de résoudre ce problème, le puppetmaster doit être mis à niveau. Un maître en version 2.7 est capable de gérer un client en version 2.6.
pl: W celu rozwiązania problemu konieczna jest aktualizacja puppetmaster. Master w wersji 2.7 może zarządzać systemem klienckim w wersji 2.6.
pt_br: Para resolver esse problema o puppetmaster deve ser atualizado. Um mestre 2.7 é capaz de gerenciar um sistema cliente 2.6.
ru: Для решения этой проблемы требуется обновить puppetmaster. Мастер 2.7 позволяет управлять и клиентской частью версии 2.6.
sv: För att lösa detta problem ska puppetmaster uppgraderas. En 2.7 master kan hantera ett 2.6-klient-system.

source: Multiarch implications for the toolchain
fr: Implication du multiarch sur la chaîne de compilation
pl: Skutki wprowadzenie wieloarchitekturowości dla zestawów narzędzi programistycznych
pt_br: Implicações da multiarquitetura para o <quote>toolchain</quote>
ru: Последствия введения мультиархитектуры для инструментов сборки

source: The introduction of multiarch (as described in <xref linkend="multiarch"/>) changes the paths for some files, which may break assumptions made by toolchain components. &debian;'s toolchain has been updated, but users trying to build or use external compilers might need to be aware of this.
fr: L'introduction du multiarchitecture (telle que décrite dans <xref linkend="multiarch"/>) modifie les chemins de certains fichiers, ce qui pourrait rendre fausses des suppositions faites par les composants de la chaîne de compilation. La chaîne de compilation de &debian; a été mise à jour, mais les utilisateurs tentant de compiler ou d'utiliser des compilateurs externes peuvent avoir besoin de le savoir.
pl: Wprowadzenie wieloarchitekturowości (opisanej w rozdziale <xref linkend="multiarch"/>) zmieniło część ścieżek niektórych plików, co może naruszyć założenia przyjęte przez składniki narzędzi programistycznych do tworzenia oprogramowania. W przypadku systemu &debian; dokonano odpowiednich aktualizacji, lecz użytkownicy budujący pakiety samodzielnie lub używający zewnętrznych kompilatorów, powinni być świadomi zmian.
pt_br: A introdução da multiarquitetura (como descrito na <xref linkend="multiarch"/>) muda os caminhos de alguns arquivos, que podem quebrar suposições feitas pelos componentes do <quote>toolchain</quote>. O <quote>toolchain</quote> do &debian; foi atualizado, mas os usuários que tentam construir ou usar compiladores externos podem precisar estar cientes disso.
ru: При введении мультиархитектуры (описано в <xref linkend="multiarch"/>) изменились пути к некоторым файлам, которые могут не соответствовать предположениям, сделанным в инструментах сборки. Инструменты сборки &debian; были обновлены, но пользователям, пытающимся собрать и использовать сторонние компиляторы, нужно это учитывать.

source: Some hints to work around these issues can be found in <filename>/usr/share/doc/libc6.1/NEWS.Debian.gz</filename> and in bugreport <ulink url="&url-bts;637232">#637232</ulink>.
fr: Quelques pistes pour contourner ces problèmes peuvent être trouvées dans <filename>/usr/share/doc/libc6.1/NEWS.Debian.gz</filename> et dans le rapport de bogue <ulink url="&url-bts;637232">nº 637232</ulink>.
pl: Pewne wskazówki (w języku angielskim) na temat obejścia tych problemów można znaleźć w pliku <filename>/usr/share/doc/libc6.1/NEWS.Debian.gz</filename> i w zgłoszeniu błędu <ulink url="&url-bts;637232">#637232</ulink>.

source: Some hints to work around these issues can be found in <filename>/usr/share/doc/libc0.1/NEWS.Debian.gz</filename> and in bugreport <ulink url="&url-bts;637232">#637232</ulink>.
fr: Quelques pistes pour contourner ces problèmes peuvent être trouvées dans <filename>/usr/share/doc/libc0.1/NEWS.Debian.gz</filename> et dans le rapport de bogue <ulink url="&url-bts;637232">nº 637232</ulink>.
pl: Pewne wskazówki (w języku angielskim) na temat obejścia tych problemów można znaleźć w pliku <filename>/usr/share/doc/libc0.1/NEWS.Debian.gz</filename> i w zgłoszeniu błędu <ulink url="&url-bts;637232">#637232</ulink>.

source: Some hints to work around these issues can be found in <filename>/usr/share/doc/libc6/NEWS.Debian.gz</filename> and in bugreport <ulink url="&url-bts;637232">#637232</ulink>.
fr: Quelques pistes pour contourner ces problèmes peuvent être trouvées dans <filename>/usr/share/doc/libc6/NEWS.Debian.gz</filename> et dans le rapport de bogue <ulink url="&url-bts;637232">nº 637232</ulink>.
pl: Pewne wskazówki (w języku angielskim) na temat obejścia tych problemów można znaleźć w pliku <filename>/usr/share/doc/libc6/NEWS.Debian.gz</filename> i w zgłoszeniu błędu <ulink url="&url-bts;637232">#637232</ulink>.

source: Cyrus SASL SQL backends
fr: Backends SQL Cyrus SASL
pl: Backend SQL Cyrus SASL
pt_br: Backends do SQL do Cyrus SASL

source: Configuration of SQL engine backends for Cyrus SASL, as provided in the <systemitem role="package">libsasl2-modules-sql</systemitem> package, has changed from database specific configuration (e.g. <literal>mysql</literal>) to the generic <literal>sql</literal> auxprop plugin.
fr: La configuration des backends SQL pour Cyrus SASL, telle que fournie dans le paquet <systemitem role="package">libsasl2-modules-sql</systemitem>, achangé d'une configuration spécifique à une base de données (par exemple <literal>mysql</literal>) vers le greffon auxprop générique <literal>sql</literal>.
pl: Konfiguracja backendu silnika SQL do Cyrus SASL udostępnianego przez pakiet <systemitem role="package">libsasl2-modules-sql</systemitem> została zmieniona ze specjalnej konfiguracji bazy danych (np. <literal>mysql</literal>) do standardowej wtyczki auxprop <literal>sql</literal>.
pt_br: A configuração dos backends do motor do SQL para o Cyrus SASL, como fornecida no pacote <systemitem role="package">libsasl2-modules-sql</systemitem>, mudou de configuração específica de banco de dados (por exemplo, <literal>mysql</literal>) para o plugin auxprop <literal>sql</literal> genérico.

source: Configuration files for applications using SASL have to be updated, for example:
fr: Les fichiers de configurations pour les applications utilisant SASL doivent être mises à jour, par exemple :
pl: Konieczna jest aktualizacja plików konfiguracyjnych do aplikacji używających SASL np.:
pt_br: Os arquivos de configuração para aplicativos usando SASL têm que ser atualizados, por exemplo:

source: should be replaced by:
fr: devrait être remplacé par :
pl: należy zastąpić wpisem:
pt_br: deve ser substituído por:

source: In addition, the SQL query (if used) needs to have <literal>%u</literal> replaced with <literal>%u@%r</literal>, because user and realm are now provided separately.
fr: De plus, la requête SQL (si utilisée) nécessite de remplacer <literal>%u</literal> par <literal>%u@%r</literal> car user et realm sont maintenant fournis séparément.
pl: Dodatkowo konieczne jest zastąpienie <literal>%u</literal> przez łańcuch <literal>%u@%r</literal> w zapytaniu SQL (jeśli jest ono używane), ponieważ użytkownik i dziedzina (ang. realm) są teraz udostępniane oddzielnie.
pt_br: Além disso, a consulta SQL (se utilizada) precisa ter o <literal>%u</literal> substituído por <literal>%u@%r</literal>, porque o usuário de o realm agora são fornecidos separadamente.

source: Firmware for network and graphics drivers
fr: Micrologiciel pour le réseau et pilotes graphiques
pl: Oprogramowanie układowe do sterowników sieciowych i graficznych
pt_br: Firmware para controladores gráficos e de rede

source: Some hardware drivers, including drivers for (wired or wireless) network cards, as well as the driver for ATI/AMD graphics chipsets, require loadable firmware in order to operate properly.
fr: Certains pilotes matériels, dont les pilotes pour les cartes réseau (filaires ou sans fil), ainsi que le pilote pour les cartes graphiques ATI/AMD, nécessitent un micrologiciel chargeable afin de fonctionner correctement.
pl: Część sterowników sprzętowych, m.in sterowniki do kart sieciowych (przewodowych i bezprzewodowych) i sterowniki do czipów kart graficznych ATI/AMD do poprawnego funkcjonowania wymaga załadowania oprogramowania układowego (tzw. firmware).
pt_br: Alguns controladores de hardware, incluindo controladores para placas de rede (com ou sem fio), assim como o controlador para chipsets gráficos ATI/AMD, exigem firmware carregável para funcionar corretamente.

source: That firmware is often not free software, and as such only available for the non-free archive, in the <systemitem role="package">firmware-linux</systemitem> and <ulink url="http://packages.debian.org/search?keywords=firmware&amp;searchon=names&amp;suite=&releasename;&amp;section=all">other</ulink> packages.
fr: Ce micrologiciel est souvent non libre et n'est donc disponible que dans l'archive non-free, dans les paquets <systemitem role="package">firmware-linux</systemitem> et <ulink url="http://packages.debian.org/search?keywords=firmware&amp;searchon=names&amp;suite=&releasename;&amp;section=all">autres</ulink>.
pt_br: Esse firmware muitas vezes não é software livre e, como tal, só está disponível pelo repositório non-free, nos pacotes <systemitem role="package">firmware-linux</systemitem> e <ulink url="http://packages.debian.org/search?keywords=firmware&amp;searchon=names&amp;suite=&releasename;&amp;section=all">outros</ulink>.

source: The <systemitem role="package">knetworkmanager</systemitem> package has been deprecated, and replaced by <systemitem role="package">plasma-widget-networkmangement</systemitem> in the new KDE Plasma Workspace.
pt_br: O pacote <systemitem role="package">knetworkmanager</systemitem> tornou-se obsoleto, e foi substituído pelo <systemitem role="package">plasma-widget-networkmangement</systemitem> no novo espaço de trabalho KDE Plasma.

source: Should you be using the deprecated <command>knetworkmanager</command> standalone application, you should be prepared to do some manual configuration afterwards. On upgrade, you might need to manually add plasma-widget-networkmanagement to your panel or desktop.
pt_br: Caso você esteja usando o aplicativo independente <command>knetworkmanager</command> que é obsoleto, você deve estar preparado para fazer algumas configurações manuais posteriormente. Durante a atualização, você pode precisar adicionar manualmente a widget de gerenciamento de rede do plasma ao seu painel ou área de trabalho.

source: Some hints to workaround these issues can be found in <filename>/usr/share/doc/libc6.1/NEWS.Debian.gz</filename> and in bugreport <ulink url="&url-bts;637232">#637232</ulink>.
pt_br: Algumas dicas de como contornar esses problemas podem ser encontradas em <filename>/usr/share/doc/libc6.1/NEWS.Debian.gz</filename> e no relatório de bug <ulink url="&url-bts;637232">#637232</ulink>.
ru: Некоторые решения проблем можно найти в <filename>/usr/share/doc/libc6.1/NEWS.Debian.gz</filename> и сообщении об ошибке <ulink url="&url-bts;637232">#637232</ulink>.

source: Some hints to workaround these issues can be found in <filename>/usr/share/doc/libc0.1/NEWS.Debian.gz</filename> and in bugreport <ulink url="&url-bts;637232">#637232</ulink>.
pt_br: Algumas dicas de como contornar esses problemas podem ser encontradas em <filename>/usr/share/doc/libc0.1/NEWS.Debian.gz</filename> e no relatório de bug <ulink url="&url-bts;637232">#637232</ulink>.
ru: Некоторые решения проблем можно найти в <filename>/usr/share/doc/libc0.1/NEWS.Debian.gz</filename> и сообщении об ошибке <ulink url="&url-bts;637232">#637232</ulink>.

source: Some hints to workaround these issues can be found in <filename>/usr/share/doc/libc6/NEWS.Debian.gz</filename> and in bugreport <ulink url="&url-bts;637232">#637232</ulink>.
pt_br: Algumas dicas de como contornar esses problemas podem ser encontradas em <filename>/usr/share/doc/libc6/NEWS.Debian.gz</filename> e no relatório de bug <ulink url="&url-bts;637232">#637232</ulink>.
ru: Некоторые решения проблем можно найти в <filename>/usr/share/doc/libc6/NEWS.Debian.gz</filename> и сообщении об ошибке <ulink url="&url-bts;637232">#637232</ulink>.

source: The <systemitem role="package">knetworkmanager</systemitem> package has been deprecated, and replaced by <systemitem role="package">plasma-widget-networkmanagement</systemitem> in the new KDE Plasma Workspace.
pl: Pakiet <systemitem role="package">knetworkmanager</systemitem> stał się przestarzały i został zastąpiony przez <systemitem role="package">plasma-widget-networkmanagement</systemitem> w nowym KDE Plasma Workspace.

source: # mount -o remount <replaceable>filesystem</replaceable>
pl: # mount -o remount <replaceable>system-plików</replaceable>

source: That firmware is often not free software, and as such only available from the non-free archive, in the <systemitem role="package">firmware-linux</systemitem> and <ulink url="http://packages.debian.org/search?keywords=firmware&amp;searchon=names&amp;suite=&releasename;&amp;section=all">other</ulink> packages.
pl: Oprogramowanie układowe często nie jest wolnym oprogramowaniem i co za tym idzie jest dostępne wyłącznie w części non-free repozytorium, w pakiecie <systemitem role="package">firmware-linux</systemitem> i <ulink url="http://packages.debian.org/search?keywords=firmware&amp;searchon=names&amp;suite=&releasename;&amp;section=all">innych</ulink> pakietach.

source: Debian &release; includes several browser engines which are affected by a steady stream of security vulnerabilities. The high rate of vulnerabilities and partial lack of upstream support in the form of long term branches make it very difficult to support these browsers with backported security fixes. Additionally, library interdependencies make it impossible to update to newer upstream releases. As such, browsers built upon the webkit, qtwebkit and khtml engines are included in &Releasename;, but not covered by security support. These browsers should not be used against untrusted websites.
de: Debian &release; enthält mehrere Browser-Engines, die einem ständigen Ansturm von Sicherheitsproblemen ausgesetzt sind. Die hohe Rate von Anfälligkeiten und die teilweise fehlende Unterstützung seitens der Originalautoren in Form von langfristig gepflegten Programmversionen machen es sehr schwierig, für diese Browser Sicherheitsunterstützung auf Basis von rückportierten Fehlerkorrekturen anzubieten. Zusätzlich machen es Abhängigkeiten zwischen beteiligten Bibliotheken unmöglich, auf neuere Upstream-(Orignal-)Versionen hochzurüsten. Browser, die auf den Engines <quote>webkit</quote>, <quote>qtwebkit</quote> und <quote>khtml</quote> aufbauen, sind daher in &Releasename; zwar enthalten, es besteht jedoch für sie keine Sicherheitsunterstützung. Diese Browser sollten nicht für Verbindungen zu vertrauensunwürdigen Websites verwendet werden.
ru: В Debian &release; включено несколько браузерных механизмов (browser engines), для которых постоянно находят большое количество уязвимостей. Из-за этого и частичного отсутствия авторской поддержки предыдущих версий возникают большие сложности с переносом исправлений безопасности в старые версии. Также из-за библиотечных зависимостей невозможно произвести обновление до новых версий. В силу этого, браузеры, созданные на основе механизмов webkit, qtwebkit и khtml, включены в &Releasename;, но не обладают полной поддержкой безопасности. Данные браузеры лучше не использовать для просмотра ненадёжных сайтов.
sv: Debian &release; innehåller flera webbläsarmotorer som påverkas av en strid ström av säkerhetshål. Den stora mängden fel och den partiella bristen på stöd uppströms i form av långsiktiga utvecklingsgrenar gör det mycket svårt att ha stöd för dessa webbläsare med bakåtporterade säkerhetslagningar. Dessutom gör biblioteksberoenden det omöjligt att uppdatera dessa till nyare versioner. Webbläsare utvecklade på webkit, qtwebkit- och khtml-motorerna ingår i &Releasename; men täcks inte av säkerhetsstödet. Dessa webbläsare ska inte användas tillsammans med webbplatser du inte litar på.

source: Xulrunner has had a history of good backportability for older releases over the previous release cycles. Chromium &mdash;while built upon the Webkit codebase&mdash; is a leaf package, which will be kept up-to-date by rebuilding the current Chromium releases for stable.
de: Xulrunner hat in der Vergangenheit über die letzten Veröffentlichungszyklen eine gute Rückportierbarkeit für ältere Versionen bewiesen. Chromium ist &ndash; obwohl es auf der Webkit-Codebasis aufbaut &ndash; ein mehrteiliges Paket, das aktuell gehalten wird, indem die letzten Chromium-Veröffentlichungen jeweils für Stable neu gebaut werden.
ru: В предыдущих выпусках прошлые версии Xulrunner переносились хорошо. Chromium, хотя и основан на Webkit, является отдельным пакетом, и для стабильного выпуска будет обновляться пересборкой актуальных версий Chromium.
sv: Xulrunner har en lång historia med bra stöd för bakåtporteringar för äldre utgåvor i de föregående cyklerna med utgåvor. Chromium &mdash; som bygger på kodbasen för Webkit &mdash; är ett lövpaket och kommer att hållas uppdaterad genom att den aktuella stabila utgåvan av Chromium tillhandahålls.

source: By default, some accessibility tools are not enabled in the GNOME display manager (<systemitem role="package">gdm3</systemitem>). In order to enable zooming or a visual keyboard, the simplest way is to enable the <quote>shell</quote> greeter.
ru: По умолчанию, некоторые специальные возможности (accessibility tools) не включены в экранном менеджере GNOME (<systemitem role="package">gdm3</systemitem>). Простейшим способом включить лупу или экранную клавиатуру является включение приглашения <quote>shell</quote>.
