Repository: lurdan/trans-ddp
Catalog: release-notes/*/issues.po
Languages: be, de, fr, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sv, zh_tw

source: <command>bootlogd</command> has moved from <systemitem role="package">sysvinit-utils</systemitem> to a separate <systemitem role="package">bootlogd</systemitem> package. If you wish to continue using bootlogd, you need to install the <systemitem role="package">bootlogd</systemitem> package. Note that the configuration file <filename>/etc/default/bootlogd</filename> and its option <literal>BOOTLOGD_ENABLE</literal> no longer exist; if you do not wish to run bootlogd, remove the <systemitem role="package">bootlogd</systemitem> package.
de: <command>bootlogd</command> wurde von <systemitem role="package">sysvinit-utils</systemitem> in ein separates <systemitem role="package">bootlogd</systemitem>-Paket verschoben. Wenn Sie bootlogd weiter verwenden möchten, müssen Sie das Paket <systemitem role="package">bootlogd</systemitem> installieren. Beachten Sie, dass die Konfigurationsdatei <filename>/etc/default/bootlogd</filename> sowie deren Option <literal>BOOTLOGD_ENABLE</literal> nicht mehr existieren; wenn Sie nicht möchten, dass bootlogd ausgeführt wird, entfernen Sie das <systemitem role="package">bootlogd</systemitem>-Paket.
fr: <command>bootlogd</command> a été déplacé de <systemitem role="package">sysvinit-utils</systemitem> dans un paquet <systemitem role="package">bootlogd</systemitem> séparé. Si vous souhaitez continuer à utiliser bootlogd, vous aurez besoin d'installer le paquet <systemitem role="package">bootlogd</systemitem>. Veuillez noter que le fichier de configuration <filename>/etc/default/bootlogd</filename> et son option <literal>BOOTLOGD_ENABLE</literal> n'existent plus : si vous ne souhaitez pas exécuter bootlogd, supprimez le paquet <systemitem role="package">bootlogd</systemitem>.
pl: Polecenie <command>bootlogd</command> zostało przeniesione z pakietu <systemitem role="package">sysvinit-utils</systemitem> do oddzielnego - <systemitem role="package">bootlogd</systemitem>. Aby używać w dalszym ciągu bootlogd, konieczna jest instalacja pakietu <systemitem role="package">bootlogd</systemitem>. Proszę zwrócić uwagę, że plik konfiguracyjny <filename>/etc/default/bootlogd</filename> i jego opcja <literal>BOOTLOGD_ENABLE</literal> obecnie nie istnieją. Aby nie używać bootlogd, należy po prostu usunąć pakiet <systemitem role="package">bootlogd</systemitem>.
pt_br: O <command>bootlogd</command> foi movido do <systemitem role="package">sysvinit-utils</systemitem> para um pacote separado <systemitem role="package">bootlogd</systemitem>. Se você deseja continuar usando bootlogd, você precisa instalar o pacote <systemitem role="package">bootlogd</systemitem>. Note que o arquivo de configuração <filename>/etc/default/bootlogd</filename> e sua opção <literal>BOOTLOGD_ENABLE</literal> não existem mais; se você não deseja executar o bootlogd, remova o pacote <systemitem role="package">bootlogd</systemitem>.
ru: Команда <command>bootlogd</command> перемещена из пакета <systemitem role="package">sysvinit-utils</systemitem> в отдельный пакет <systemitem role="package">bootlogd</systemitem>. Если вы хотите продолжить использование bootlogd, установите пакет <systemitem role="package">bootlogd</systemitem>. Заметим, что файл настройки <filename>/etc/default/bootlogd</filename> и его параметр <literal>BOOTLOGD_ENABLE</literal> больше не существуют; если вы не хотите запускать bootlogd, удалите пакет <systemitem role="package">bootlogd</systemitem>.
sv: <command>bootlogd</command> har flyttat från <systemitem role="package">sysvinit-utils</systemitem>-paketet till ett separat <systemitem role="package">bootlogd</systemitem>-paket. Om du vill fortsätta använda bootlogd behöver du installera <systemitem role="package">bootlogd</systemitem>-paketet. Observera att konfigurationsfilen <filename>/etc/default/bootlogd</filename> och dess inställning <literal>BOOTLOGD_ENABLE</literal> inte längre existerar. Om du inte vill köra bootlogd, ta bort <systemitem role="package">bootlogd</systemitem>-paketet.

source: <filename>/etc/mtab</filename> and <literal>_netdev</literal>
fr: <filename>/etc/mtab</filename> et <literal>_netdev</literal>
pl: <filename>/etc/mtab</filename> i <literal>_netdev</literal>
pt_br: <filename>/etc/mtab</filename> e <literal>_netdev</literal>
ru: Файл <filename>/etc/mtab</filename> и <literal>_netdev</literal>
sv: <filename>/etc/mtab</filename> och <literal>_netdev</literal>

source: The file <filename>/etc/mtab</filename>, used to store the list of currently mounted filesystems, has been changed to be a symbolic link to <filename>/proc/mounts</filename>. For almost every case, this change will result in a more robust system since the list can never become inconsistent with reality. However, if you use the <literal>_netdev</literal> option in <filename>/etc/fstab</filename> to indicate that a filesystem is a network filesystem requiring special handling, this will no longer be set in <filename>/proc/mounts</filename> after rebooting. This will <emphasis>not</emphasis> cause problems for standard network filesystems such as <acronym>NFS</acronym>, which do not rely on the <literal>_netdev</literal> option. Filesystems which are <emphasis>unaffected</emphasis> by this issue are <literal>ceph</literal>, <literal>cifs</literal>, <literal>coda</literal>, <literal>gfs</literal>, <literal>ncp</literal>, <literal>ncpfs</literal>, <literal>nfs</literal>, <literal>nfs4</literal>, <literal>ocfs2</literal> and <literal>smbfs</literal>. For filesystems which <emphasis>do</emphasis> rely on <literal>_netdev</literal> for correct unmounting at shutdown, for example when using an <acronym>NBD</acronym>, a static mtab will be the only way to use <literal>_netdev</literal> in wheezy. If you have such a setup, then after completing the upgrade to wheezy restore a static <filename>/etc/mtab</filename> by doing the following:
fr: Le fichier <filename>/etc/mtab</filename>, utilisé pour stocker la liste des systèmes de fichiers actuellement montés, a été remplacé par un lien symbolique vers <filename>/proc/mounts</filename>. Dans pratiquement tous les cas, cette modification rendra le système plus robuste puisque la liste ne peut jamais être incohérente. En revanche, si vous utilisez l'option <literal>_netdev</literal> dans <filename>/etc/fstab</filename> pour indiquer qu'un système de fichiers est un système de fichiers en réseau nécessitant une gestion particulière, cette option ne sera plus présente dans <filename>/proc/mounts</filename> après un redémarrage. Cela ne causera <emphasis>pas</emphasis> de problème avec les systèmes de fichiers en réseau standard tels que <acronym>NFS</acronym>, qui ne se base pas sur l'option <literal>_netdev</literal>. Les systèmes de fichiers <emphasis>non</emphasis> atteints par ce problème sont <literal>ceph</literal>, <literal>cifs</literal>, <literal>coda</literal>, <literal>gfs</literal>, <literal>ncp</literal>, <literal>ncpfs</literal>, <literal>nfs</literal>, <literal>nfs4</literal>, <literal>ocfs2</literal> et <literal>smbfs</literal>. Pour les systèmes de fichiers qui <emphasis>utilisent</emphasis> <literal>_netdev</literal> pour se démonter correctement lors de l'extinction, par exemple en utilisant un <acronym>NBD</acronym>, un mtab statique est le seul moyen d'utiliser <literal>_netdev</literal> dans Wheezy. Si vous avez une telle installation, alors restaurez un <filename>/etc/mtab</filename> statique après la mise à niveau vers Wheezy en procédant comme suit :
pl: Plik <filename>/etc/mtab</filename>, używany do przechowywania listy aktualnie zamontowanych systemów plików stał się dowiązaniem symbolicznym do <filename>/proc/mounts</filename>. W prawie każdym przypadku poprawi to niezawodność systemu, ponieważ zniknie potencjalne zagrożenie niespójności tej listy z rzeczywistością. Jednak w przypadku używania opcji <literal>_netdev</literal> w swoim pliku <filename>/etc/fstab</filename> (do wskazania, że dany system plików jest systemem sieciowym, wymagającym specjalnego traktowania), nie będzie ona dłużej ustawiana w <filename>/proc/mounts</filename> po ponownym uruchomieniu systemu. <emphasis>Nie</emphasis> spowoduje to problemów w przypadku standardowych, sieciowych systemów plików, takich jak <acronym>NFS</acronym>, które nie polegają na opcji <literal>_netdev</literal>. Systemy plików, których <emphasis>nie dotknie</emphasis> ten problem to: <literal>ceph</literal>, <literal>cifs</literal>, <literal>coda</literal>, <literal>gfs</literal>, <literal>ncp</literal>, <literal>ncpfs</literal>, <literal>nfs</literal>, <literal>nfs4</literal>, <literal>ocfs2</literal> i <literal>smbfs</literal>. W przypadku systemów plików, które <emphasis>polegają</emphasis> na opcji <literal>_netdev</literal> w celu poprawnego odmontowania w trakcie zamykaniu systemu, np. przy wykorzystaniu <acronym>NBD</acronym>, statyczny plik mtab będzie jedynym wyjściem, aby używać opcji <literal>_netdev</literal> w wheezym. Należy wówczas, po zakończeniu aktualizacji do wydania wheezy, przywrócić statyczny plik <filename>/etc/mtab</filename>:
pt_br: O arquivo <filename>/etc/mtab</filename>, usado para armazenar a lista de sistemas de arquivos montados atualmente, foi alterado para ser um link simbólico para <filename>/proc/mounts</filename>. Para quase todos os casos, essa mudança resultará em um sistema mais robusto uma vez que a lista nunca pode se tornar inconsistente com a realidade. Entretanto, caso você use a opção <literal>_netdev</literal> no <filename>/etc/fstab</filename> para indicar que o sistema de arquivos é um sistema de arquivos de rede exigindo um tratamento especial, isso não será mais definido no <filename>/proc/mounts</filename> após a reinicialização. Isso <emphasis>não</emphasis> causará problemas para sistemas de arquivos de redes padrão tais como <acronym>NFS</acronym>, que não precisa da opção <literal>_netdev</literal>. Os sistemas de arquivos que <emphasis>não são afetados</emphasis> por esse problema são <literal>ceph</literal>, <literal>cifs</literal>, <literal>coda</literal>, <literal>gfs</literal>, <literal>ncp</literal>, <literal>ncpfs</literal>, <literal>nfs</literal>, <literal>nfs4</literal>, <literal>ocfs2</literal> e <literal>smbfs</literal>. Para sistemas de arquivos que <emphasis>precisam</emphasis> de <literal>_netdev</literal> para desmontagem correta ao desligar, por exemplo, ao utilizar um <acronym>NBD</acronym>, um mtab estático será a única forma de usar <literal>_netdev</literal> no wheezy. Caso você tenha tal configuração, então, após concluir a atualização para wheezy restaure um <filename>/etc/mtab</filename> estático fazendo o seguinte:
ru: Файл <filename>/etc/mtab</filename>, используемый для хранения списка смонтированных файловых систем, был заменён символьной ссылкой на <filename>/proc/mounts</filename>. Почти во всех случаях это изменение приводит к более жизнестойкой системе, так как в действительность список никогда не может стать некорректным. Однако, если вы используете параметр <literal>_netdev</literal> в <filename>/etc/fstab</filename> для указания того, что файловая система является сетевой файловой системой, которой требуется специальное обращение, то он больше не будет установлен в <filename>/proc/mounts</filename> после перезагрузки. Это <emphasis>не</emphasis> вызовет проблем со стандартными сетевыми файловыми системами, такими как <acronym>NFS</acronym>, которые не используют параметр <literal>_netdev</literal>. Файловые системы, которые <emphasis>не заменят</emphasis> этого изменения: <literal>ceph</literal>, <literal>cifs</literal>, <literal>coda</literal>, <literal>gfs</literal>, <literal>ncp</literal>, <literal>ncpfs</literal>, <literal>nfs</literal>, <literal>nfs4</literal>, <literal>ocfs2</literal> и <literal>smbfs</literal>. Для файловых систем, <emphasis>полагающихся</emphasis> на <literal>_netdev</literal> для правильного размонтирования при выключении, например <acronym>NBD</acronym>, возвращение обычного файла mtab является единственным способом использования <literal>_netdev</literal> в wheezy. Если это ваш случай, то после завершения обновления до wheezy восстановите обычный файл <filename>/etc/mtab</filename>:
sv: Filen <filename>/etc/mtab</filename> innehöll förr en lista med de monterade filsystemen, den har nu blivit en symbolisk länk till <filename>/proc/mounts</filename>. I nästan alla fall innebär detta ett mer robus system eftersom listan inte kan bli fel mot verkligheten. Dock, om flaggan <literal>_netdev</literal> används i <filename>/etc/fstab</filename> för att indikera att filsystemet är ett nätverksfilsystem som kräver specialhantering kommer den inte att vara satt i <filename>/proc/mounts</filename> efter omstart. Detta kommer <emphasis>inte</emphasis> innebära problem för standardfilsystem som <acronym>NFS</acronym>, eftersom de inte behöver <literal>_netdev</literal>-flaggan. Filsystem som <emphasis>inte påverkas</emphasis> av detta är <literal>ceph</literal>, <literal>cifs</literal>, <literal>coda</literal>, <literal>gfs</literal>, <literal>ncp</literal>, <literal>ncpfs</literal>, <literal>nfs</literal>, <literal>nfs4</literal>, <literal>ocfs2</literal> och <literal>smbfs</literal>. För filsystem som <emphasis>behöver</emphasis> <literal>_netdev</literal>-flaggan för att avmonteras korrekt vid nedstängning av systemet, exempelvis vid användning av <acronym>NBD</acronym>, är en statisk mtab enda vägen för att använda <literal>_netdev</literal>-flaggan i wheezy. Om du har en sådan installation ska du avslutningsvis efter uppgraderingen till wheezy återställa en statisk <filename>/etc/mtab</filename> genom att göra följande:

source: Edit <filename>/etc/init.d/checkroot.sh</filename>, and comment out these lines:
fr: Modifiez <filename>/etc/init.d/checkroot.sh</filename> et commentez ces lignes :
pl: Edytując plik <filename>/etc/init.d/checkroot.sh</filename> i dodając znak komentarza <literal>#</literal> przed następującymi wierszami:
pt_br: Edite o <filename>/etc/init.d/checkroot.sh</filename> e comente estas linhas:
ru: Измените <filename>/etc/init.d/checkroot.sh</filename>, удалив комментарий из строк:
sv: Redigera filen <filename>/etc/init.d/checkroot.sh</filename> och kommentera bort dessa rader:

source: If you have rebooted the system, and <filename>/etc/mtab</filename> is now a symbolic link:
fr: Si vous avez redémarré le système et si <filename>/etc/mtab</filename> est maintenant un lien symbolique :
pl: W przypadku, gdy już uruchomiono system ponownie, a plik <filename>/etc/mtab</filename> stał się już dowiązaniem symbolicznym, należy wykonać:
pt_br: Caso você tenha reinicializado o sistema, e o <filename>/etc/mtab</filename> agora seja um link simbólico:
ru: Если вы перезагрузили систему и файл <filename>/etc/mtab</filename> стал символьной ссылкой:
sv: Om du har startat om systemet så är <filename>/etc/mtab</filename> ny en symbolisk länk:

source: Re-add the <literal>_netdev</literal> option by remounting the affected filesystems:
fr: Rajoutez l'option <literal>_netdev</literal> en remontant les systèmes de fichiers affectés :
pl: Następnie dodać opcję <literal>_netdev</literal> montując odpowiednie systemy plików ponownie:
pt_br: Adicione novamente a opção <literal>_netdev</literal> remontando os sistemas de arquivos afetados:
ru: Верните параметр <literal>_netdev</literal>, перемонтировав затронутые файловые системы:
sv: Lägg till flaggan <literal>_netdev</literal> igen genom att montera det påverkade filsystemet:

source: <filename>/etc/mtab</filename> will be recreated fully next time you reboot the system.
fr: <filename>/etc/mtab</filename> sera complètement recréé au prochain redémarrage du système.
pl: <filename>/etc/mtab</filename> zostanie w pełni odtworzony po następnym uruchomieniu systemu.
pt_br: O <filename>/etc/mtab</filename> será completamente recriado na próxima vez que você reinicializar o sistema.
ru: Файл <filename>/etc/mtab</filename> будет пересоздан при следующей перезагрузке системы.
sv: <filename>/etc/mtab</filename> kommer att skapas korrekt nästa gång systemet startas.

source: The pdksh to mksh transition
fr: Transition de pdksh vers mksh
pl: Przejście z pdksh do mksh
pt_br: A transição de pdksh para mksh
ru: Переход с pdksh на mksh

source: The Public Domain Korn Shell (<systemitem role="package">pdksh</systemitem>) package is being retired for the release after &releasename;, since <command>pdksh</command> is no longer maintained (it has not been actively developed since 1999).
fr: Le paquet <systemitem role="package">pdksh</systemitem> (« Public Domain Korn Shell ») est supprimé de la distribution après &Releasename; car <command>pdksh</command> n'est plus maintenu (pas de développement actif depuis 1999).
pl: Pakiet Public Domain Korn Shell (<systemitem role="package">pdksh</systemitem>) zostanie porzucony w następnym wydaniu po edycji &releasename;, ponieważ <command>pdksh</command> nie jest już utrzymywany (nie był aktywnie rozwijany od roku 1999).
pt_br: O pacote <systemitem role="package">pdksh</systemitem> (<quote>Public Domain Korn Shell</quote>) está sendo aposentado para a versão após o &releasename;, pois o <command>pdksh</command> não é mais mantido (ele foi visto em desenvolvimento ativo pela última vez em 1999).
ru: Пакет Public Domain Korn Shell (<systemitem role="package">pdksh</systemitem>) был удалён в следующем выпуске после &releasename;, так как <command>pdksh</command> больше не сопровождается (не разрабатывается с 1999 года).
sv: Korn shell-paketet (<systemitem role="package">pdksh</systemitem>) pensioneras i och med utgåvan efter &releasename; eftersom <command>pdksh</command> inte längre underhålls (ingen aktiv utveckling har skett sedan 1999).

source: The MirBSD Korn Shell (<systemitem role="package">mksh</systemitem>) package contains its successor; it has evolved from the Public Domain Korn Shell and has been kept up to date with the POSIX standard on the shell. In &debian; &releasename;, <systemitem role="package">pdksh</systemitem> is a transitional package using <command>lksh</command>, a variant of <systemitem role="package">mksh</systemitem> built with special compatibility options to provide a <command>pdksh</command> binary symlink. This compatibility binary behaves more like the traditional Public Domain Korn Shell than the current <command>mksh</command>. However as it contains behavior-changing bugfixes it is not a pure drop-in replacement. So, you're advised to change your
fr: Le paquet <systemitem role="package">mksh</systemitem> (« MirBSD Korn Shell ») fournit son successeur ; il a évolué à partir de Public Domain Korn Shell et a été maintenu à jour avec la norme POSIX pour l'interpréteur de commandes. Dans &debian; &Releasename;, <systemitem role="package">pdksh</systemitem> est un paquet de transition utilisant <systemitem role="package">lksh</systemitem>, une variante de <systemitem role="package">mksh</systemitem> compilée avec des options de compatibilité afin de fournir un lien symbolique binaire <command>pdksh</command>. Ce binaire de compatibilité se comporte plus comme le Public Domain Korn Shell que comme l'actuel <command>mksh</command>. Néanmoins, étant donné qu'il contient des corrections de bogues modifiant son comportement, ce n'est pas un remplacement pur et simple. En conséquence, il vous est recommandé de changer vos scripts
pl: Pakiet MirBSD Korn Shell (<systemitem role="package">mksh</systemitem>) zawiera jego następcę. Pochodzi on od powłoki Public Domain Korn Shell i był aktualizowany pod kątem zgodności ze standardem POSIX, dotyczącym powłoki. W systemie &debian; &releasename; <systemitem role="package">pdksh</systemitem> jest pakietem przejściowym korzystającym z <command>lksh></command> (wariantu <systemitem role="package">mksh</systemitem> ze specjalnymi opcjami kompatybilności), w celu zapewnienia dowiązania symbolicznego do <command>pdksh</command>. Ten kompatybilny plik binarny zachowuje się bardziej jak tradycyjna powłoka Public Domain Korn Shell niż obecny pakiet <command>mksh</command>. A ponieważ uwzględnia on poprawki błędów wpływające na jego zachowanie nie jest dokładnym zamiennikiem. Dlatego zaleca się zmienić swoje skrypty
pt_br: O pacote <systemitem role="package">mksh</systemitem> (<quote>MirBSD Korn Shell</quote>) contém o seu sucessor; ele tem evoluído a partir do <quote>Public Domain Korn Shell</quote> e tem sido mantido atualizado com o padrão POSIX no shell. No &debian; &releasename;, o <systemitem role="package">pdksh</systemitem> é um pacote de transição utilizando o <command>pdksh</command>, uma variante do <systemitem role="package">mksh</systemitem> construído com opções especiais de compatibilidade para fornecer um link simbólico para o executável. Esse executável de compatibilidade se comporta um pouco mais como o tradicional <quote>Public Domain Korn Shell</quote> do que o <command>mksh</command> atual. Porém, uma vez que ele contém correções que mudam o seu comportamento, ele não é uma simples substituição por outro. Então, você é aconselhado a mudar os seus scripts

source: scripts to
fr: en
pl: na
pt_br: para
ru: в своих сценариях на
sv: skript till

source: and test them. If the test fails, you're advised to fix your scripts. If, for some reason, this is not possible, you can change them to
fr: et de les tester. Si le test échoue, alors nous vous conseillons de corriger vos scripts. Si ce n'est pas possible, vous pouvez les changer en scripts
pl: i przetestować je. Jeśli testy się nie powiodą zalecamy dokonanie poprawek w swoich skryptach. Jeśli z jakiegoś powodu nie jest to możliwe można zmienić nagłówek pliku na
pt_br: e testá-los. Se o teste falhar, você é aconselhado a corrigir os seus scripts. Se, por alguma razão, isso não for possível, você pode modificá-los para scripts
ru: протестируйте их. Если возникнут ошибки, исправьте их в сценариях. Если по какой-то причине это невозможно, то измените ссылку в них на
sv: och testa dessa. Om detta inte fungerar bör du justera dina skript. Om detta, av någon anledning, inte är görbart an du ändra de till

source: scripts, and test them again. This test has more chances of succeeding without changing a lot of your code. However, be aware at some point in the future the transitional package will get dropped from Debian.
fr: et les tester à nouveau. Ce test a plus de chances de réussir sans modifier votre code en profondeur. Cependant, gardez à l'esprit que le paquet de transition sera supprimé de Debian un jour ou l'autre.
pl: i przetestować skrypty ponownie. Ten test ma większe szanse powodzenia bez konieczności dokonywania obszernych zmian kodu. Proszę jednak być świadomym, że w przyszłości ten pakiet przejściowy zostanie usunięty z dystrybucji.
pt_br: e testá-los novamente. Esse teste tem maiores chances de sucesso sem mudar muito o seu código. Entretanto, esteja ciente que em algum momento no futuro o pacote de transição será removido do Debian.
ru: и снова проведите тесты. На этот раз ошибки возникнуть не должны. Однако, заметьте, что в какой-то момент в будущем этот переходный пакеты будет удалён из Debian.
sv: skript och testa igen. Detta test har större möjlighet att fungera utan att ändra mängder med kod. Hur som helst bör du vara medveten om att vid någon framtida tidpunkt kommer övergångspaketet att tas bort från Debian.
