Repository: lurdan/trans-ddp
Catalog: release-notes/*/issues.po
Languages: be, de, fr, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sv, zh_tw

source: Due to an unfortunate interaction of a kernel fix with PCI Express subsystem, Lenny default kernel will fail to boot on Sparc workstations with PCI Express slots, like Ultra 25 and Ultra 45. As this problem has been discovered very late in the release cycle, we were unable to include a fix in the original Lenny release, but we'll do our best to eliminate the problem for the first point release. <indexterm><primary>Sun Ultra 25</primary></indexterm> <indexterm><primary>Sun Ultra 45</primary></indexterm> <indexterm><primary>PCI Express</primary></indexterm>
be: З прычыны няўдалага ўзаемадзеяння заплаткі ядра з падсістэмай PCI Express, стандартнае ядро Lenny не можа запусціцца на працоўных станцыях Sparcs са слотамі PCI Express кшталту Ultra 25 або Ultra 45. З-за таго, што гэтая праблема была вынайдзена дужа позна, мы не здолелі выправіць яе ў арыгінальным выпуску Lenny, але зробім усё магчымае, каб уключыць выпраўленне ў бліжэйшы дадатковы выпуск. <indexterm><primary>Sun Ultra 25</primary></indexterm> <indexterm><primary>PCI Express</primary></indexterm>
nb: På grunn av en endring i linuxkjernen utført for å fikse en feil på PCI Express bussen, så vil Lenny sin standard linuxkjerne ikke starte på Sparc arbeidsstasjoner med PCI Express slotter, slik som Ultra 25 og Ultra 45. Fordi dette problemet ikke ble oppdaget før sent i utgivelsesprosessen, så finnes det ingen feilretting for dette i Lenny, men det jobbes for å få inn en feilfiks til den første punktutgivelsen. <indexterm><primary>Sun Ultra 25</primary></indexterm> <indexterm><primary>Sun Ultra 45</primary></indexterm> <indexterm><primary>PCI Express</primary></indexterm>

source: <acronym>DHCP</acronym> failover issue
be: Праблема з абароненай ад збояў канфігурацыяй <acronym>DHCP</acronym>
nb: <acronym>DHCP</acronym> problemer med feiltoleranse

source: When running a failover pair of <acronym>DHCP</acronym> servers, the peer names need to be consistent, otherwise <acronym>DHCP</acronym> will crash.
be: Пры запуску абароненай ад збояў пары сервераў <acronym>DHCP</acronym> назвы элементаў мусяць быць узгодненыя, інакш адбываецца памылка <acronym>DHCP</acronym>.
nb: Når et par med servere kjører som <acronym>DHCP</acronym>-servere, så må servernavnene være konsekvente, ellers krasjer <acronym>DHCP</acronym>

source: Please see <ulink url="&url-bts;513506"/> and <ulink url="https://lists.isc.org/pipermail/dhcp-users/2007-September/004538.html"/> for more information.
be: Больш звестак можна знайсці на старонках <ulink url="&url-bts;513506"/> ды <ulink url="https://lists.isc.org/pipermail/dhcp-users/2007-September/004538.html"/>
nb: Les <ulink url="&url-bts;513506"/> og <ulink url="https://lists.isc.org/pipermail/dhcp-users/2007-September/004538.html"/> for mer informasjon.

source: On some older systems, <literal>shutdown -h</literal> may not power off the system anymore (but just stop it). This happens because apm needs to be used there. Adding <literal>acpi=off apm=power_off</literal> to the kernel's command line, e.g. in <systemitem role="package">grub</systemitem> or <systemitem role="package">lilo</systemitem> configuration files should fix this issue. Please see bug <ulink url="&url-bts;390547">#390547</ulink> for additional information.
zh_tw: 在一些較為老舊的系統上，<literal>shutdown -h</literal> 將再也無法將系統關機了。（只能做到停止運作）。這是因為在此必須使用 apm 才行。請在像是 <systemitem role="package">grub</systemitem> 或 <systemitem role="package">lilo</systemitem> 的設定檔案裡，在 Kernel 的命令列上新增 <literal>acpi=off apm=power_off</literal> 應該就能解決這個問題。請參閱 <ulink url="&url-bts;390547">#390547</ulink> 以取得更多詳盡資訊。

source: Slower updates of APT package index files
zh_tw: APT 套件索引檔更新變慢

source: This change mostly affects users of the <emphasis>unstable</emphasis> and <emphasis>testing</emphasis> branch of &debian;, due to the changing nature of these archives. Users of &releasename; will notice this feature mainly when updating their package status for the security archive.
zh_tw: 這項改變也會影響到使用 Debian 的 <emphasis>unstable</emphasis> 及 <emphasis>testing</emphasis> 分支的使用者，因為這些檔案庫本身也隨之改變了。使用 &releasename; 的使用者大多會在更新安全檔案庫的套件狀態時注意到這個功能。

source: Trouble when using WPA secured wireless networks
zh_tw: 使用 WPA 加密無線網路時的麻煩

source: In rare cases the sound might stop working after the upgrade. If this happens, go through the alsa checklist: run <command>alsaconf</command> as root user, add your user to the <literal>audio</literal> group, use alsamixer and make sure levels are up and it is unmuted, make sure arts or esound stopped, make sure OSS modules unloaded, make sure speakers are on, check whether the command <literal>cat /dev/urandom &gt; /dev/dsp</literal> works for root.
zh_tw: 在一些罕見的情況下，在升級之後，音效就失去作用了。如果發生了這種情兄，請依 alsa 的檢查步驟進行：以 root 權限執行 <command>alsaconf</command>，並把您的使用者加入 <literal>audio</literal> 群組，使用 alsamixer 並確認音量大小且沒有被設定為靜音，確認剌叭已開啟，確認是不是用 root 執行 <literal>cat /dev/urandom &gt; /dev/dsp</literal> 就會有動作。

source: For some SATA disk controllers, the device assigned to a drive and its partitions may change from <filename>/dev/hdX</filename> to <filename>/dev/sdX</filename>. If this happens, you will have to modify your <filename>/etc/fstab</filename> and bootloader configuration accordingly. Unless these changes are made correctly, your system may not boot correctly<footnote>
zh_tw: 在一些 SATA 磁碟控制器裡，將指派給磁碟及其分割區的裝置由 <filename>/dev/hdX</filename> 改變為 <filename>/dev/sdX</filename>。如果真的如此，您必須適當得修改您的 <filename>/etc/fstab</filename> 及開機程式的設定。在這些變更被正確得修改之前，您的系統可能會無法正常開機。<footnote>

source: Upgrading Zope and Plone
zh_tw: 升級 Zope 及 Plone

source: Zope and all related products have been updated. Many products were also dropped from the distribution (either because they were obsoleted, or because they are incompatible with the newer Zope, CMF or Plone).
zh_tw: Zope 及相關產品已被更新。很多產品也同時在這個釋出版裡被廢棄了（可能是因為它們已不再使用，或是因為它們和新的 Zope、CMF 或 Plone 不相容）。

source: For this reason, users are recommended to set up their system so they can continue to run the &oldreleasename; installation of Zope/Plone alongside the new &releasename; versions while testing the migration.
zh_tw: 因為這個緣故，建議使用者在測試轉移工具時，將系統設定為可繼續使用 Zope/Plone 的 &oldreleasename; 及新的 &releasename; 版的安裝程式。

source: The easiest and safest way to achieve this, is to make a copy of your &oldreleasename; system to another hard disk or partition, and then upgrade only one of the two copies. You can then use <command>chroot</command> to run the &oldreleasename; version in parallel to the &releasename; version.
zh_tw: 最簡單保險的實現方式就是將您的 &oldreleasename; 複製到另一個硬碟或分割區裡，然後在這兩個備份裡挑一個進行更新。您也可以使用 <command>chroot</command> 在 &releasename; 版裡同時運行 &oldreleasename;。

source: Wildcard expansion (globbing) with <acronym>GNU</acronym> tar
zh_tw: <acronym>GNU</acronym> tar 在檔案辨別時使用的萬用字元擴充

source: Previous versions of <acronym>GNU</acronym> <command>tar</command> assumed shell-style globbing when extracting files from or listing an archive. For example:
zh_tw: 上一版的 GNU <acronym>GNU</acronym> <command>tar</command> 在解開或列出檔案時，會假設是使用 shell 風格來進行辨別。比如說：

source: would extract all files whose names end in '.c'. This behavior was not documented and was incompatible with traditional <command>tar</command> implementations. Therefore, starting from version 1.15.91, <acronym>GNU</acronym> <command>tar</command> no longer uses globbing by default. For example, the above invocation is now interpreted as a request to extract from the archive the file named '*.c'.
zh_tw: 這樣將會解開所有檔名以 '.c' 結尾的檔案。但其實並沒有明文記載可使用這種作法，且這和傳統的 <command>tar</command> 在實作上是不相容的。因此，從 1.15.91 版開始，<acronym>GNU</acronym> <command>tar</command> 在預設上不再支援檔案辨別。比如說，以上的指令現在將會被解讀為要求解開檔名為 '*.c' 的檔案。

source: See <filename>/usr/share/doc/tar/NEWS.gz</filename> for further information.
zh_tw: 請參閱 <filename>/usr/share/doc/tar/NEWS.gz</filename> 以取得更詳盡之資訊。

source: NIS and Network Manager
zh_tw: NIS 及 Network Manager

source: The version of <command>ypbind</command> included with <systemitem role="package">nis</systemitem> for &releasename; contains support for Network Manager. This support causes <command>ypbind</command> to disable NIS client functionality when Network Manager reports that the computer is disconnected from the network. Since Network Manager will usually report that the computer is disconnected when it is not in use, NIS users with NIS client systems should ensure that Network Manager support is disabled on those systems.
zh_tw: 在 &releasename; 所搭載的 <systemitem role="package">nis</systemitem> 所包含的 <command>ypbind</command> 版本裡加入了對 Network Manager 的支援。這個支援將會讓 <command>ypbind</command> 在得到 Network Manager 回報說電腦已由網路離線時，關閉 NIS 用戶端的功能。因為 Network Manager 會在不使用時回報電腦已離線，使用 NIS 用戶端系統的 NIS 使用者應當確認在這些系統上是否已關閉對 Network Manager 的支援。

source: Deprecated insecure php configurations
zh_tw: 關閉不安全的 php 設定

source: For many years, turning on the <literal>register_globals</literal> settings in PHP has been known to be insecure and dangerous, and this option has defaulted to off for some time now. This configuration is now finally deprecated on Debian systems as too dangerous. The same applies to flaws in <literal>safe_mode</literal> and <literal>open_basedir</literal>, which have also been unmaintained for some time.
zh_tw: 多年以來，在 PHP 裡啟用 <literal>register_globals</literal> 設定是眾所皆知的既不安全且極為冒險的，而這個選項也被多次在預設上被關閉。這個設定終於因為太危險而在 Debian 系統裡被關閉了。同樣的問題也發生在 <literal>safe_mode</literal> 及 <literal>open_basedir</literal> 上，因為它們已有段時間沒有在繼續維護了。

source: Starting with this release, the Debian security team does not provide security support for a number of PHP configurations which are known to be insecure. Most importantly, issues resulting from <literal>register_globals</literal> being turned on will no longer be addressed.
zh_tw: 從這個釋出版本開始，Debian 安全團隊將不再替一些已知是不安全的 php 設定提供安全上的支援。最重要的是，將不再關注於因為開啟了 <literal>register_globals</literal> 而導致的問題。

source: If you run legacy applications that require <literal>register_globals</literal>, enable it for the respective paths only, e.g. through the Apache configuration file. More information is available in the <filename>README.Debian.security</filename> file in the PHP documentation directory (<filename>/usr/share/doc/php4</filename>, <filename>/usr/share/doc/php5</filename>).
zh_tw: 如果您所運行的老舊應用程式需要使用 <literal>register_globals</literal>，請在各別的頁面中，像是在 Apache 的設定檔裡將其啟用。可以在 PHP 文件目錄(<filename>/usr/share/doc/php4</filename>、<filename>/usr/share/doc/php5</filename>) 裡的 <filename>README.Debian.security</filename> 裡找到更多的詳盡資訊。

source: KDE media handling has changed in the version available in &releasename; from using <filename>device:/</filename> to <filename>media:/</filename>. Some user configuration files might have stored <filename>device:/</filename> links in them which should be adapted. Notably, <filename>~/.kde/share/apps/konqsidebartng/virtual_folders/services</filename> contains this reference and can be safely deleted as it will not be created when setting up new users.
zh_tw: 在 &releasename; 中所提供的 KDE 媒體管理程式因版本變更，已由使用 <filename>device:/</filename> 變為使用 <filename>media:/</filename>。有些還在使用著 <filename>device:/</filename> 連結的使用者設定檔必須加以修正。請注意到，<filename>~/.kde/share/apps/konqsidebartng/virtual_folders/services</filename> 包含了這項設定且可以安全得刪除，讓它不會在設定新的使用者時被再次建立。

source: There have been many changes in the KDE desktop environment from the version shipped in &oldreleasename; to the version in &releasename;, you can find more information in the <ulink url="http://www.kde.org/announcements/announce-3.5.php">KDE 3.5 Release Notes</ulink>.
zh_tw: &oldreleasename; 所搭載的 KDE 桌面環境和 &releasename; 上的版本已有著許多不同，您可以在 <ulink url="http://www.kde.org/announcements/announce-3.5.php">KDE 3.5 發行公告</ulink> 上找到更多的詳盡資訊。

source: Default editor
zh_tw: 預設的編輯器

source: If you were using <command>vim</command> as your default editor, this may be changed to <command>nano</command> during the upgrade.
zh_tw: 如果您是將 <command>vim</command> 做為您的預設的編輯器，在升級的過程中可能被變更為 <command>nano</command>。

source: Administrators who wish to change the default editor for all users will have to update the alternatives system using:
zh_tw: 而如果管理者希望指定所有使用者的預設編輯器，必須更新偏好系統如下：

source: Users wishing to change the default editor can define the environment variable <emphasis>EDITOR</emphasis> by introducing the following lines in their own profiles:
zh_tw: 那些想要指定預設編輯器的使用者可以利用指定 <emphasis>EDITOR</emphasis> 環境變數，方法是在他們的 profiles 中加入以下幾行：

source: Message of the day
zh_tw: 本日資訊

source: Also, the EDITMOTD variable at <filename>/etc/default/rcS</filename> no longer has any effect. If you wish to disable updating of the motd, or want to maintain your own content for the message of the day you just have to point the <filename>/etc/motd</filename> symlink to a different file such as <filename>/etc/motd.static</filename> and make your changes there.
zh_tw: 同時，在 <filename>/etc/default/rcS</filename> 裡的 EDITMOTD 也將失去效用。如果您希望能關閉 motd 更新，或希望能自行維護本日資訊的內容，您只要將 <filename>/etc/motd</filename> 指向像是 <filename>/etc/motd.static</filename> 的其它檔案，並自行修改。

source: Not default support for unicode in emacs21*
zh_tw: 在 emacs21* 裡並不會預設支援 unicode

source: Emacs21 and emacs21-nox are not configured to use Unicode by default. For more information and a workaround please see <ulink url="&url-bts;419490">Bug #419490</ulink>.
zh_tw: Emacs21 和 emacs21-nox 預設上並沒有被設定為使用 Unicode。請至 <ulink url="&url-bts;419490">Bug #419490</ulink> 以取得更多訊息及解決方案。

source: A feature in the cryptography libraries used in the <acronym>LDAP</acronym> libraries causes programs that use <acronym>LDAP</acronym> and attempt to change their effective privileges to fail when connecting to an <acronym>LDAP</acronym> server using <acronym>TLS</acronym> or <acronym>SSL</acronym>. This can cause problems for setuid programs on systems using <systemitem role="package">libnss-ldap</systemitem> like <command>sudo</command>, <command>su</command> or <command>schroot</command> and for setuid programs that perform LDAP searches like <systemitem role ="package">sudo-ldap</systemitem>.
fr: Une caractéristique des bibliothèques de cryptographie utilisées par les bibliothèques <acronym>LDAP</acronym> entraîne l'échec des programmes qui utilisent <acronym>LDAP</acronym> et essaient de modifier leurs privilèges effectifs lors de connexions vers un serveur <acronym>LDAP</acronym> utilisant <acronym>TLS</acronym> ou <acronym>SSL</acronym>. Cela peut provoquer des problèmes pour les programmes setuid sur des systèmes utilisant <systemitem role="package">libnss-ldap</systemitem> comme <command>sudo</command>, <command>su</command> ou <command>schroot</command> et pour les programmes setuid qui effectuent des recherches LDAP comme <systemitem role ="package">sudo-ldap</systemitem>.
pl: Funkcja w bibliotekach kryptograficznych wykorzystywanych w bibliotekach <acronym>LDAP</acronym> powoduje, że programy używające <acronym>LDAP</acronym>, próbujące zmienić swoje efektywne uprawnienia, załamują się przy łączeniu z serwerem <acronym>LDAP</acronym> za pomocą <acronym>TLS</acronym> lub <acronym>SSL</acronym>. Może stanowić to problem dla programów korzystających z setuid w systemach używających <systemitem role="package">libnss-ldap</systemitem>, takich jak <command>sudo</command>, <command>su</command> lub <command>schroot</command> oraz dla programów setuid przeprowadzających wyszukiwania LDAP, np. <systemitem role ="package">sudo-ldap</systemitem>.
pt_br: Uma característica das bibliotecas de criptografia usadas nas bibliotecas <acronym>LDAP</acronym> faz com que programas que usem <acronym>LDAP</acronym> e tentem mudar seus privilégios efetivos falhem quando conectam a um servidor <acronym>LDAP</acronym> usando <acronym>TLS</acronym> ou <acronym>SSL</acronym>. Isso pode causar problemas para programas setuid nos sistemas que usam <systemitem role="package">libnss-ldap</systemitem>, como o <command>sudo</command>, <command>su</command> ou <command>schroot</command> e para programas setuid que realizam buscas LDAP, como o <systemitem role ="package">sudo-ldap</systemitem>.

source: It is recommended to replace the <systemitem role="package">libnss-ldap</systemitem> package with <systemitem role="package">libnss-ldapd</systemitem>, a newer library which uses a separate daemon (<command>nslcd</command>) for all <acronym>LDAP</acronym> lookups. The replacement for <systemitem role="package">libpam-ldap</systemitem> is <systemitem role="package">libpam-ldapd</systemitem>.
fr: Il est recommandé de remplacer le paquet <systemitem role="package">libnss-ldap</systemitem> par <systemitem role="package">libnss-ldapd</systemitem>, une bibliothèque plus récente qui utilise un démon séparé (<command>nslcd</command>) pour toutes les consultations <acronym>LDAP</acronym>. Le remplacement de <systemitem role="package">libpam-ldap</systemitem> est <systemitem role="package">libpam-ldapd</systemitem>.
pl: Zaleca się zastąpienie pakietu <systemitem role="package">libnss-ldap</systemitem> nowszą biblioteką <systemitem role="package">libnss-ldapd</systemitem>, która używa oddzielnego demona (<command>nslcd</command>) przy wszystkich wyszukiwaniach <acronym>LDAP</acronym>. Zamiennikiem <systemitem role="package">libpam-ldap</systemitem> jest <systemitem role="package">libpam-ldapd</systemitem>.
pt_br: É recomendado substituir o pacote <systemitem role="package">libnss-ldap</systemitem> pelo <systemitem role="package">libnss-ldapd</systemitem>, uma biblioteca mais nova que usa um daemon separado (<command>nslcd</command>) para todas as buscas <acronym>LDAP</acronym>. O substituto para o <systemitem role="package">libpam-ldap</systemitem> é o <systemitem role="package">libpam-ldapd</systemitem>.

source: Debian &release; includes several browser engines which are affected by a steady stream of security vulnerabilities. The high rate of vulnerabilities and partial lack of upstream support in the form of long term branches make it very difficult to support these browsers with backported security fixes. Additionally, library interdependencies make it impossible to update to newer upstream releases. Therefore, browsers built upon the webkit, qtwebkit and khtml engines are included in &Releasename;, but not covered by security support. These browsers should not be used against untrusted websites.
fr: Debian &release; inclut plusieurs moteurs de navigateur web qui sont affectés par un flot continu de vulnérabilités de sécurité. Ce taux élevé de vulnérabilités ainsi que le manque partiel de prise en charge amont sous la forme de branches maintenues à long terme rendent difficiles les corrections de sécurité rétroportées. De plus, les interdépendances des bibliothèques rendent impossible la mise à niveau vers une nouvelle version. Par conséquent les navigateurs basés sur les moteurs webkit, qtwebkit et khtml sont inclus dans &Releasename; mais ne sont pas couverts par une prise en charge complète de la sécurité. Ces navigateurs ne devraient pas être utilisés sur des sites web non fiables.
pl: Debian &release; zawiera kilka silników przeglądarek, które są narażone na wiele zagrożeń bezpieczeństwa. Wysoki poziom błędów związanych z bezpieczeństwem oraz częściowy brak długotrwałego wsparcia przed projekty macierzyste powoduje, że bardzo trudno jest wspierać te przeglądarki w postaci przepisywanych do starszych wersji poprawek bezpieczeństwa. Co więcej, zależności między bibliotekami powodują, że nie da się zaktualizować ich do nowszych wersji. W związku z tym przeglądarki oparte o silniki webkit, qtwebkit i khtml znajdują się w wydaniu &Releasename;, ale nie są objęte wsparciem bezpieczeństwa. Przeglądarek tych nie należy używać do przeglądania niezaufanych stron internetowych.
pt_br: O Debian &release; inclui diversos motores de navegadores que são afetados por um fluxo constante de vulnerabilidades de segurança. A alta taxa de vulnerabilidades e a ausência parcial de suporte do upstream na forma de ramos de longo prazo tornam muito difícil o suporte a esses navegadores com correções de segurança adaptadas. Por isso, as interdependências das bibliotecas tornam impossível atualizar para uma versão upstream mais nova. Como tal, navegadores feitos sobre os motores webkit, qtwebkit e khtml foram incluídos no &Releasename;, mas não estão cobertos pelo suporte de segurança. Esses navegadores não devem ser usados em sites web não confiáveis.

source: For general web browser use we recommend browsers building on the Mozilla xulrunner engine (Iceweasel and Iceape) or Chromium.
de: Für die gewöhnliche Verwendung empfehlen wir Browser, die auf der Mozilla xulrunner-Engine aufbauen (Iceweasel und Iceape) oder Chromium.
fr: Pour un usage général de navigation web, nous recommandons les navigateurs basés sur le moteur xulrunner de Mozilla (Iceweasel et Iceape) et Chromium.
pl: Do zwykłego przeglądania Internetu zalecamy przeglądarki korzystające z silnika xulrunner Mozilli (Iceweasel i Iceape) lub Chromium.
pt_br: Para uso geral de navegador web nós recomendamos navegadores com base no motor Mozilla xulrunner (Iceweasel e Iceape) ou Chromium.
ru: Для повседневной работы мы рекомендуем использовать браузеры на основе механизма Mozilla xulrunner (Iceweasel и Iceape) или Chromium.
sv: För generell webbsurfning rekommenderar vi webbläsare baserade på Mozillas motor xulrunner (Iceweasel och Iceape) eller Chromium.

source: Xulrunner has had a history of good backportability for older releases over the previous release cycles. Chromium - while built upon the Webkit codebase - is a leaf package, which will be kept up-to-date by rebuilding the current Chromium releases for stable.
fr: Xulrunner a un historique de bon rétroportage pour des versions plus anciennes dans les cycles de publications précédents. Chromium &mdash; bien qu'il soit conçu à partir de Webkit &mdash; est un paquet sans dépendance qui sera conservé à jour en recompilant les versions actuelles de Chromium pour la distribution stable.
pl: W poprzednich wydaniach wydawanie poprawek bezpieczeństwa w odniesieniu do Xulrunner okazywało się skuteczne. Chromium, choć zbudowany w oparciu o kod Webkita, jest niezależnym pakietem, który będzie aktualizowany przez przebudowywanie bieżących wydań Chromium w dystrybucji stabilnej.
pt_br: O Xulrunner tem tido um histórico de boa adaptabilidade para versões mais antigas ao longo dos ciclos de lançamento anteriores. O Chromium - enquanto construído sob a base de código da Webkit - é um pacote sem dependência, que será mantido atualizado pela reconstrução das atuais versões do Chromium para a <quote>stable</quote>.

source: ConsoleKit and alternative display managers
fr: ConsoleKit et les gestionnaires d'écran de connexion alternatifs
pl: ConsoleKit i alternatywne menedżery logowania
pt_br: ConsoleKit e gerenciadores de tela alternativos
ru: ConsoleKit и альтернативные экранные менеджеры
