Repository: lurdan/trans-ddp
Catalog: release-notes/*/issues.po
Languages: be, de, fr, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sv, zh_tw

source: In rare cases, sound might stop working after the upgrade. If this happens, go through the <acronym>ALSA</acronym> checklist:
be: У рэдкіх выпадках пасля абнаўлення можа знікнуць гук. Калі такое здарылася, праверце сістэму <acronym>ALSA</acronym> у наступным парадку:
it: In rari casi l'audio potrebbe smettere di funzionare dopo l'aggiornamento. Se questo accade, si scorra la lista di controllo di <acronym>ALSA</acronym>:
ja: まれに、アップグレードした後でサウンドが機能しなくなる場合があります。こうなった場合は、<acronym>ALSA</acronym> のチェックリストを確認してください：
lt: Retais atvejais, bet gali nutikti kad po atnaujinimo nustoja veikti garsas. Jei tai atsitiks, patikrinkite <acronym>ALSA</acronym> veikimą pagal sąrašą:
nb: I noen tilfeller så kan det hende at lydsystemet ikke virker etter oppgraderingen. Hvis dette er tilfellet, så se om denne sjekklisten for <acronym>ALSA</acronym> løser ditt problem:
pt: Em casos raros, o som pode deixar de funcionar após a actualização. Se isto acontecer, percorra a lista de verificação <acronym>ALSA</acronym>:
ro: În cazuri rare, sunetul ar putea să nu mai funcționeze după actualizare. Dacă s-a întâmplat acest lucru parcurgeți lista de proceduri <acronym>ALSA</acronym>:

source: run <command>alsaconf</command> as <literal>root</literal> user,
be: выканайце каманду <command>alsasonf</command> з правамі карыстальніка <literal>root</literal>,
it: eseguire <command>alsaconf</command> come utente <literal>root</literal>,
ja: <literal>root</literal> ユーザで <command>alsaconf</command> を実行し、
lt: įvykdykite <command>alsaconf</command> kaip naudotojas <literal>root</literal>,
nb: Kjør <command>alsaconf</command> som brukeren<literal>root</literal>
pt: corra <command>alsaconf</command> como <literal>root</literal>,
ro: rulați <command>alsaconf</command> ca utilizatorul <literal>root</literal>,

source: add your user to the <literal>audio</literal> group,
be: дадайце свайго звычайнага карыстальніка да групы <literal>audio</literal>,
it: aggiungere l'utente al gruppo <literal>audio</literal>,
ja: ユーザ名を <literal>audio</literal> グループに追加し、
lt: įrašykite savo naudotoją į grupę <literal>audio</literal>,
nb: Legg brukeren til i gruppa <literal>audio</literal>
pt: acrescente o seu utilizador ao grupo <literal>audio</literal>,
ro: adăugați utilizatorul dumneavoastră la grupul <literal>audio</literal>,

source: make sure the sound channel levels are up and unmuted (using <command>alsamixer</command>),
be: пераканайцеся, што каналы вываду гуку ўключаны і наладжаны адпаведным чынам (з дапамогай <command>alsamixer</command>),
it: accertarsi che i livelli dei canali audio siano alzati e non siano in muto (usando <command>alsamixer</command>),
ja: (<command>alsamixer</command> を使って) 音量が上がっていてミュートになっていないことを確認し、
lt: įsitikinkite, kad kanalų garso lygiai pakankami ir garsas neišjungtas (naudojant <command>alsamixer</command>),
nb: Husk å skru opp volumet på lydkortet, og aktiver det ved å ta bort mute (bruk <command>alsamixer</command>)
pt: certifique-se que o nível dos canais de som está correcto e ligado (usando o <command>alsamixer</command>),
ro: asigurați-vă că nivelele de sunet sunt ridicate și nu sunt oprite (folosiți <command>alsamixer</command>),

source: make sure <command>arts</command> and <command>esound</command> are not running,
be: пераканайцеся, што ў сістэме не запушчаны сервісы <command>arts</command> ды <command>esound</command>,
it: controllare che <command>arts</command> ed <command>esound</command> non siano in esecuzione,
ja: <command>arts</command> と <command>esound</command> が実行されていないことを確認し、
lt: įsitikinkite, kad <command>arts</command> ir <command>esound</command> neveikia (t.y. nepaleisti),
nb: Pass på at <command>arts</command> og <command>esound</command> ikke er aktive
pt: certifique-se que o <command>arts</command> e o <command>esound</command> não estão a correr,
ro: că <command>arts</command> și <command>esound</command> nu rulează,

source: make sure no <acronym>OSS</acronym> modules are loaded,
be: пераканайцеся, што не загружаны модулі <acronym>OSS</acronym>,
it: assicurarsi che nessun modulo <acronym>OSS</acronym> sia caricato,
ja: <acronym>OSS</acronym> モジュールが読み込まれていないことを確認し、
lt: įsitikinkite, kad nėra įkeltų <acronym>OSS</acronym> modulių,
nb: Pass på at ingen <acronym>OSS</acronym> moduler er lastet
pt: certifique-se que não tem módulos <acronym>OSS</acronym> carregados,
ro: că nu sunt încărcate module <acronym>OSS</acronym>,

source: make sure the speakers are actually switched on, and
be: пераканайцеся, што калонкі сапраўды ўключаныя, і нарэшце
it: controllare che gli altoparlanti siano accesi e
ja: スピーカのスイッチが入っていることを確認し、
lt: įsitikinkite, kad garsiakalbiai tikrai įjungti, ir
nb: Pass på at høyttalerene faktisk er skrudd på
pt: certifique-se que as colunas estão realmente ligadas, e
ro: că boxele chiar sunt pornite și

source: check whether the command
be: праверце, ці каманда
it: controllare se il comando
ja: 次のコマンド
lt: patikrinkite ar komanda
nb: Sjekk om kommandoen
pt: verifique se o comando
ro: verificați dacă comanda

source: or the command
it: o il comando
ja: あるいは次のコマンド
pt: ou o comando

source: works for <literal>root</literal>.
be: працуе для карыстальніка <literal>root</literal>.
it: funziona per <literal>root</literal>.
ja: が <literal>root</literal> で機能するかどうかチェックしてください。
lt: veikia naudotojui <literal>root</literal>.
nb: virker for brukeren <literal>root</literal>.
pt: funciona para o <literal>root</literal>.
ro: funcționează pentru <literal>root</literal>.

source: Potential Filesystem Corruption on upgrade
be: Магчымае пашкоджанне файлавай сістэмы пры абнаўленні
it: Potenziali corruzioni del file system durante l'aggiornamento
ja: アップグレード時にファイルシステムが壊れる可能性があります
lt: Potencialus failų sistemos gedimas atnaujinimo metu
nb: Mulig filsystem korrupsjon
pt: Potencial corrupção dos sistema de ficheiros ao actualizar
ro: Posibilă corupere a sistemului de fișiere la actualizare

source: Starting with Kernel 2.6.25, Linux on the s390 architecture running under z/VM hypervisor uses a new CCW for DASD access that triggers an error in z/VM leading to I/O errors and finally file system inconsistency.
be: Пачынаючы з ядра 2.6.25, Linux на архітэктуры s390 пад кантролем z/VM выкарыстоўвае новую архітэктуру CCW для доступу да DASD, што можа паслядоўна выклікаць памылкі ў z/VM, памылкі ўводу-вываду, і як вынік, пашкодзіць файлавую сістэму.
it: A partire dal kernel Linux 2.6.25, sull'architettura s390 con hypervisor z/VM viene usato un nuovo CCW per accesso al DASD che causa un errore in z/VM, il quale porta a errori di I/O che potrebbero infine generare un file system non coerente.
ja: カーネル 2.6.25 より、z/VM ハイパーバイザで動作している s390 アーキテクチャの Linux は新しい CCW を DASD へのアクセスに使用します。これによって、I/O エラーや最終的にはファイルシステムの不整合につながるエラーが z/VM で発生します。
lt: Pradedant branduolio versija 2.6.25, Linux s390 architektūroje veikia z/VM hipervizoriuje, naudoja naują CCW priėjimui prie DASD, kas sukelia z/VM klaidą, iššaukiančią ir įvedimo/išvedimo (I/O) klaidas ir galiausiai failų sistemos sutrikimus.
nb: Fra og med Linuxkjerne 2.6.25 for prosessorvarianten s390 som kjører på en z/VM-overvåker, så bruker en ny CCW for DASD-access som utløser en feil i z/VM som fører til I/O-feil, som til slutt førere til at filsystemet blir inkonsistent.
pt: A partir do kernel 2.6.25, o Linux na arquitectura s390, a correr sob o hypervisor z/VM, usa um novo CCW para acesso DASD que despoleta um erro no z/VM, levando a erros de I/O e finalmente à inconsistência do sistema de ficheiros.
ro: Începând cu nucleul 2.6.25, Linux pe arhitectura s390 rulând sub un hipervizor z/VM folosește un CCW nou pentru acces DASD, care declașează o eroare în z/VM, care duce la erori I/O și în final la inconsistențe ale sistemului de fișiere.

source: This error could be confirmed running z/VM 5.3 with RSU (Recommended Service Update) 5304 and was fixed by IBM in RSU 5305 (service level 802).
be: Гэтая памылка пацверджана для запуску z/VM 5.3 з рэкамендаваным абнаўленнем сервісу RSU 5304, і была выпраўленая IBM у RSU 5305 (service level 802).
it: È stato possibile confermare questo errore usando z/VM 5.3 con RSU (Recommended Service Update) 5304 ed è stato risolto da IBM nella RSU 5305 (service level 802).
ja: このエラーは z/VM 5.3 の RSU (Recommended Service Update) 5304 で確認され、RSU 5305 (service level 802) で IBM が修正しました。
lt: Ši klaida gali būti atkurta naudojant z/VM 5.3 su RSU (rekomenduojamas tarnybinis atnaujinimas) 5304 ir IBM ją ištaiė naudojant RSU 5305 (aptarnavimo lygis 802).
nb: Denne feilen har blitt bekreftet på z/VM 5.3 med RSU (Recommended Service Update) 5304 og ble rettet opp av IBM i RSU 5305 (service level 802).
pt: Este erro pode ser confirmado correndo o z/VM 5.3 com o RSU (Recommended Service Update) 5304 e foi resolvido pela IBM com o RSU 5305 (service level 802).
ro: Această eroare a fost confirmată rulând z/VM 5.3 cu RSU (Recommended Service Update) 5304 și a fost corectată de IBM în RSU 5305 (service level 802).

source: In the <ulink url="http://www-01.ibm.com/support/docview.wss?uid=isg1VM64417">IBM problem report</ulink> a z/OS guest is mentioned, nevertheless this problem also affects linux guests.
be: Нягледзячы на тое, што ў <ulink url="http://www-01.ibm.com/support/docview.wss?uid=isg1VM64417">паведамленні аб памылцы</ulink> узгадваецца гасцявая сістэма z/OS, праблема датычыцца таксама гасцявых сістэм на базе Linux.
it: Nella <ulink url="http://www-01.ibm.com/support/docview.wss?uid=isg1VM64417">Risoluzione dei problemi IBM</ulink> è menzionato un guest z/OS, ciononostante questo problema concerne anche i guest Linux.
ja: <ulink url="http://www-01.ibm.com/support/docview.wss?uid=isg1VM64417">IBM problem report</ulink> では、z/OS のゲストについて説明されていますが、この問題は Linux のゲストにも影響します。
lt: <ulink url="http://www-01.ibm.com/support/docview.wss?uid=isg1VM64417">IBM problemos pranešime</ulink> minima svečio z/OS sistema, tačiau ši problema taip pat pasireiškia ir naudojant linux svečius.
nb: I <ulink url="http://www-01.ibm.com/support/docview.wss?uid=isg1VM64417">IBM problem report</ulink> nevnes z/OS-guest, men feilen berører også linux guests.
pt: No <ulink url="http://www-01.ibm.com/support/docview.wss?uid=isg1VM64417">relatório da IBM</ulink> é mencionado um guest z/OS, mas no entanto isto também afecta guests linux.
ro: În <ulink url="http://www-01.ibm.com/support/docview.wss?uid=isg1VM64417">raportul de problema IBM</ulink> este menționat un oaspete z/OS, totuși, această problema afectează și oaspeți linux.

source: Potential issues with diversions of /bin/sh
it: Potenziali problemi con le deviazioni di /bin/sh
ja: /bin/sh の切り換え (diversion) に関する問題の可能性
pt: Potenciais problemas com variantes do /bin/sh

source: If you have previously added a local diversion for <literal>/bin/sh</literal>, or modified the <literal>/bin/sh</literal> symlink to point to somewhere other than <literal>/bin/bash</literal>, then you may encounter problems when upgrading the <systemitem role="package">dash</systemitem> or <systemitem role="package">bash</systemitem> packages. Note that this includes changes made by allowing other packages (for example <systemitem role="package">mksh</systemitem>) to become the default system shell by taking over <literal>/bin/sh</literal>.
it: Se in precedenza era stata aggiunta una deviazione locale per <literal>/bin/sh</literal> o modificato il puntamento del collegamento simbolico <literal>/bin/sh</literal> verso qualcosa di diverso da <literal>/bin/bash</literal>, è possibile che si verifichino dei problemi durante l'aggiornamento dei pacchetti <systemitem role="package">dash</systemitem> o <systemitem role="package">bash</systemitem>. Notare che tali modifiche possono essere le conseguenze dell'aver permesso ad altri pacchetti (per esempio <systemitem role="package">mksh</systemitem>) di diventare la shell predefinita di sistema prendendo il controllo di <literal>/bin/sh</literal>.
ja: 以前にローカルで <literal>/bin/sh</literal> を切り換え (diversion) していた、あるいは <literal>/bin/sh</literal> のシンボリックリンクが <literal>/bin/bash</literal> 以外のものを指すように変更していたという場合、<systemitem role="package">dash</systemitem> または <systemitem role="package">bash</systemitem> パッケージのアップグレードの際に問題に遭遇するかもしれません。これには、他のパッケージ (例えば <systemitem role="package">mksh</systemitem>) が <literal>/bin/sh</literal> を引き継いで、デフォルトのシステムシェルになる変更が含まれることに注意してください。
pt: Se acrescentou anteriormente uma variante local do <literal>/bin/sh</literal>, ou modificou a ligação simbólica <literal>/bin/sh</literal> para apontar para outro lado que não <literal>/bin/bash</literal>, pode encontrar problemas ao actualizar os pacotes <systemitem role="package">dash</systemitem> ou <systemitem role="package">bash</systemitem>. Note que isto inclui alterações feitas por outros pacotes (por exemplo o <systemitem role="package">mksh</systemitem>) ao tornar-se a shell pré-definida do sistema via a substituição do <literal>/bin/sh</literal>.

source: If you encounter any such issues, please remove the local diversion and ensure that the symlinks for both <literal>/bin/sh</literal> and its manual page point to the files provided by the <systemitem role="package">bash</systemitem> package and then <command>dpkg-reconfigure --force dash</command>.
it: Qualora si verificasse un qualsiasi problema, rimuovere la deviazione e verificare che i collegamenti simbolici <literal>/bin/sh</literal> e della sua pagina man puntino ai file forniti dal pacchetto <systemitem role="package">bash</systemitem> e poi eseguire <command>dpkg-reconfigure --force dash</command>.
ja: このような問題が出てきた場合、ローカルでの切り換え (diversion) を削除して、<literal>/bin/sh</literal> へのシンボリックリンクとマニュアルページが <systemitem role="package">bash</systemitem> パッケージによって提供されているファイルを指すようにしてから、<command>dpkg-reconfigure --force dash</command> を実行してください。
pt: Se encontrar problemas deste tipo, remova por favor a variante local e assegure-se que as ligações simbólicas para <literal>/bin/sh</literal> e a respectiva página de manual apontam para os ficheiros disponibilizados pelo pacote <systemitem role="package">bash</systemitem> e depois corra o <command>dpkg-reconfigure --force dash</command>.

source: Change in kernel policy regarding resource conflicts
it: Modifica nella policy del kernel riguardo ai conflitti di risorse
ja: リソースの競合に関連したカーネルのポリシー変更
pt: Alterações na política do kernel relativa a conflitos

source: The default setting for the acpi_enforce_resources parameter in the Linux kernel has changed to be <quote><literal>strict</literal></quote> by default. This can lead some legacy sensor drivers to be denied access to the sensors' hardware. One workaround is to append <quote><literal>acpi_enforce_resources=lax</literal></quote> to the kernel command line.
it: Il valore predefinito del parametro acpi_enforce_resources nel kernel Linux è stato modificato in <quote><literal>strict</literal></quote>. Tale modifica può impedire ad alcuni vecchi driver per i sensori di accedere ai sensori hardware. Un modo per aggirare questo problema è aggiungere <quote><literal>acpi_enforce_resources=lax</literal></quote> alla riga di comando del kernel.
ja: Linux カーネルでの acpi_enforce_resources parameter のデフォルト値が、<quote><literal>strict</literal></quote> に変更されました。これによって、レガシーなセンサードライバでセンサーハードウェアにアクセスができなくなるものがでてきます。回避方法の一つは、カーネルのコマンドラインオプションに <quote><literal>acpi_enforce_resources=lax</literal></quote> を加えることです。
pt: O valor pré-definido para o parâmetro acpi_enforce_resources do kernel Linux foi alterado para <quote><literal>strict</literal></quote>. Isto pode provocar a negação de acesso ao hardware por parte de alguns drivers de sensores. Um modo de contornar este problema é acrescentar <quote><literal>acpi_enforce_resources=lax</literal></quote> à linha de comando do kernel.

source: Boot hangs on certain SPARC systems
it: Blocco dell'avvio su alcuni sistemi SPARC

source: Systems using aty graphics cards (for example, Ultra 10) may not boot correctly, with kernel freezing early in the boot stage with last message <quote>console [tty0] enabled, bootconsole disabled</quote>. The issue may be worked around by adding a kernel boot parameter <literal>video=atyfb:off</literal> to turn off the framebuffer during boot, which allows the installer (and regular kernel) to be booted on such systems. A fixed kernel should be available in the first update to &releasename; (Debian 6.0.1).
it: I sistemi con schede grafiche aty (per esempio l'Ultra 10) potrebbero non avviarsi correttamente, con un blocco del kernel durante le prime fasi dell'avvio e lasciando come ultimo messaggio <quote>console [tty0] enabled, bootconsole disabled</quote>. È possibile aggirare questo problema aggiungendo il parametro d'avvio per il kernel <literal>video=atyfb:off</literal>, ciò disattiva il framebuffer durante l'avvio e permette al programma d'installazione (e al normale kernel) di avviare il sistema. Un kernel con la correzione di questo problema dovrebbe essere disponibile nel primo aggiornamento di &releasename; (Debian 6.0.1).

source: Upgrading apache2
be: Абнаўленне apache2
it: Aggiornamento di apache2
ja: apache2 のアップグレード
lt: apache2 atnaujinimas
nb: Oppgradere apache2
pt: Actualização do apache2
ro: Actualizarea pachetului apache2
zh_tw: 升級 apache2

source: The apache2 default configuration has changed in some ways that may require manual changes to your configuration. The most important changes are:
be: Пэўныя змены ў тыповых наладках apache2 могуць запатрабаваць самастойнага выпраўлення наладак на Вашай сістэме. Найбольш істотныя змены:
it: La configurazione predefinita di apache2 è cambiata in modo che potrebbe richiedere modifiche manuali alla propria configurazione. I cambiamenti più importanti sono:
ja: apache2 のデフォルト設定がいくらか変更され、手動の変更が必要となります。もっとも重要な変更は：
lt: Numatytoje apache2 konfigūracijoje yra keletas pokyčių, todėl naudotojams gali tekti rankiniu būdu pakeisti savo nustatymus. Svarbiausi pakeitimai yra šie:
nb: Standardinnstillingene til apache2 har endret seg litt, noe som kan medføre at du manuelt på gjøre noen endringer i din konfigurasjon. De viktigste endringene er:
pt: A configuração pré-definida do apache2 mudou de tal modo que pode requerer alterações manuais à sua configuração. As mudanças mais importantes são:
ro: Configurația implicită apache2 s-a schimbat în anumite privințe, ceea ce necesită modificări manuale a configurației. Cele mai importante modificări sunt:
zh_tw: apache2 的預設設定檔有部份改變了，所以您的設定檔可能需要手動修正。其中最重要的變更有：

source: <literal>NameVirtualHost *</literal> has been changed to <literal>NameVirtualHost *:80</literal>. If you have added more name based virtual hosts, you need to change <literal>&lt;VirtualHost *&gt;</literal> to <literal>&lt;VirtualHost *:80&gt;</literal> for each of them.
be: Дырэктыва <literal>NameVirtualHost *</literal> змененая на <literal>NameVirtualHost *:80</literal>. Калі Вы дадавалі іншыя віртуальныя хасты на падставе імёнаў, неабходна для кожнага з іх змяніць дырэктыву <literal>&lt;VirtualHost *&gt;</literal> на <literal>&lt;VirtualHost *:80&gt;</literal>.
it: <literal>NameVirtualHost *</literal> è stato modificato in <literal>NameVirtualHost *:80</literal>. Se si sono aggiunti più nomi basati su host virtuali, sarà necessario modificare <literal>&lt;VirtualHost *&gt;</literal> in <literal>&lt;VirtualHost *:80&gt;</literal> per ciascuno di essi.
ja: <literal>NameVirtualHost *</literal> が <literal>NameVirtualHost *:80</literal> に変更されました。名前ベースの仮想ホストを追加しているなら、それぞれについて <literal>&lt;VirtualHost *&gt;</literal> を <literal>&lt;VirtualHost *:80&gt;</literal> に変更する必要があります。
lt: NameVirtualHost * buvo pakeistas į NameVirtualHost *: 80. Jei įdėjote daugiau vardų, paremtų virtualiais kompiuteriais, reiks pakeisti <literal>&lt;VirtualHost *&gt;</literal> į <literal>&lt;VirtualHost *:80&gt;</literal> kiekvienam iš jų.
nb: <literal>NameVirtualHost *</literal> har blitt endret til <literal>NameVirtualHost *:80</literal>. Om du har lagt til flere navnbaserte virtuelle verter, så må du endre <literal>&lt;VirtualHost *&gt;</literal> til <literal>&lt;VirtualHost *:80&gt;</literal> for dem alle.
pt: <literal>NameVirtualHost *</literal> foi alterado para <literal>NameVirtualHost *:80</literal>. Se acrescentou mais hosts virtuais baseados em nomes, necessita de alterar <literal>&lt;VirtualHost *&gt;</literal> para <literal>&lt;VirtualHost *:80&gt;</literal> para cada um deles.
ro: <literal>NameVirtualHost *</literal> s-a modificat în <literal>NameVirtualHost *:80</literal>. Dacă ați adăugat mai multe gazde virtuale pe bază de nume trebuie să schimbați <literal>&lt;VirtualHost *&gt;</literal> în <literal>&lt;VirtualHost *:80&gt;</literal> pentru fiecare dintre acestea.
zh_tw: <literal>NameVirtualHost *</literal> 已經被更改為 <literal>NameVirtualHost *:80</literal>。如果您曾新增了其它用名稱識別的虛擬主機，您必須把它們都由 <literal>&lt;VirtualHost *&gt;</literal> 修改為 <literal>&lt;VirtualHost *:80&gt;</literal>。
