Repository: lurdan/trans-ddp
Catalog: release-notes/*/issues.po
Languages: be, de, fr, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sv, zh_tw

source: Some Berkeley Database version 7 files created with libdb3 cannot be read by newer libdb versions (see bug <ulink url="&url-bts;521860">#521860</ulink>). As a workaround, the files can be recreated with <command>db4.8_load</command>, from the <systemitem role="package">db4.8-util</systemitem> package.
it: Alcuni file di database Berkeley versione 7 creati con libdb3 non possono essere letti con le nuove versioni di libdb (vedere il bug <ulink url="&url-bts;521860">#521860</ulink>). Per aggirare questo problema, ricreare i file con il comando <command>db4.8_load</command>, contenuto nel pacchetto <systemitem role="package">db4.8-util</systemitem>.
ja: libdb3 で 作成された Berkeley DB バージョン 7 のファイルは、より新しい libdb バージョンでは読み取りできないものがあります (<ulink url="&url-bts;521860">bug#521860</ulink> を参照してください)。回避策として、<systemitem role="package">db4.8-util</systemitem> パッケージの <command>db4.8_load</command> でファイルを作り直すことが可能です。
pt: Alguns ficheiros da Berkeley Database versão 7 criados com a libdb3 não podem ser lidos pela nova versão da libdb (ver bug <ulink ulr="&url-bts;521860">#521860</ulink>). Para contornar o problema, os ficheiros podem ser recriados com o <command>db4.8_load</command>, do pacote <systemitem role="package">db4.8-util</systemitem>.

source: Asynchronous network initialization may cause unpredictable behavior
be: Асінхронная ініцыялізацыя сеткі можа прывесці да непрадказальных паводзінаў
it: L'inizializzazione asincrona della rete potrebbe causare comportamenti imprevedibili
ja: ネットワークの初期化を同期させないと予測不能な挙動の原因となります
lt: Asinchroninė tinklo inicializacija gali tapti neprognozuojamo elgesio priežastimi
nb: Asynkron initiering av nettverket kan forårsake uforutsette konsekvenser
pt: Inicialização assíncrona de rede pode causar um comportamento imprevisível
ro: Inițializarea asincronă a rețelei poate cauza comportament imprevizibil
zh_tw: 網路若無法同步初始化，可能會導致無法預料的後果

source: On systems which use <systemitem role="package">udev</systemitem> to load drivers for network interfaces, it is possible due to the asynchronous nature of <systemitem role="package">udev</systemitem> that the network driver will not be loaded before <command>/etc/init.d/networking</command> runs on system boot. Although including <literal>allow-hotplug</literal> to <filename>/etc/network/interfaces</filename> (in addition to <literal>auto</literal>) will ensure that the network interface is enabled once it becomes available, there is no guarantee that this will finish before the boot sequence begins to start network services, some of which may not behave correctly in the absence of the network interface.
be: На сістэмах, якія выкарыстоўваюць <systemitem role="package">udev</systemitem>, каб загружаць драйверы сеткавых інтэрфэйсаў, з-за асінхроннай прыроды <systemitem role="package">udev</systemitem> магчыма становішча, калі падчас загрузкі сістэмы драйвер сеткі не будзе загружаны да моманту запуску скрыпта <command>/etc/init.d/networking</command>. Нават калі ў дадатак да параметру <literal>auto</literal> у файле наладак <filename>/etc/network/interfaces</filename> ўключаць параметр <literal>allow-hotplug</literal> (які забяспечвае актывацыю сеткавага інтэрфэйсу у той самы момант, як інтэрфэйс робіцца даступным), немагчыма гарантаваць, што актывацыя інтэрфэйса адбудзецца да таго, як у адпаведнасці з парадкам загрузкі будуць запушчаныя сеткавыя сервісы, частка з якіх у такой сітуацыі можа весці сябе некарэктна.
it: Su sistemi che utilizzano <systemitem role="package">udev</systemitem> per caricare i driver delle interfacce di rete è possibile, a causa della natura asincrona di <systemitem role="package">udev</systemitem>, che il driver della rete non venga caricato prima che <command>/etc/init.d/networking</command> sia stato eseguito all'avvio del sistema. Sebbene l'inclusione di <literal>allow-hotplug</literal> in <filename>/etc/network/interfaces</filename> (in aggiunta ad <literal>auto</literal>) assicurerà che l'interfaccia di rete venga abilitata non appena disponibile, non è certo che ciò finisca prima che la sequenza di avvio cominci ad avviare i servizi di rete, alcuni dei quali potrebbero non comportarsi correttamente in assenza dell'interfaccia di rete.
ja: ネットワークインターフェイスのドライバをロードするのに <systemitem role="package">udev</systemitem> を使うシステムでは、<systemitem role="package">udev</systemitem> の非同期な性質ゆえ、システム起動時に <command>/etc/init.d/networking</command> が実行されるまでにネットワークドライバがロードされないことがあります。<filename>/etc/network/interfaces</filename> に (<literal>auto</literal> に加えて) <literal>allow-hotplug</literal> を含めると、ネットワークインターフェイスが利用可能になるとすぐに有効になるよう設定できますが、これが、ブートシーケンスがネットワークサービスを開始する前に完了するという保証はありません。ネットワークインターフェイスがない場合に、正しく動かないサービスもあります。
lt: Sistemose, kurios naudoja <systemitem role="package">udev</systemitem> tinklo sąsajų valdyklių įkėlimui, dėl <systemitem role="package">udev</systemitem> veikimo asinchroninio pobūdžio gali atsitikti taip, kad tinklo valdyklės nebus ikeltos prieš vykdant komandą <command>/etc/init.d/networking</command> sistemos įkėlimo metu. Nors įrašas <literal>allow-hotplug</literal> į <filename>/etc/network/interfaces</filename> scrnarijų (papildomai jau esamam <literal>auto</literal>) užtikrina, kad tinklo sąsaja bus įjungta, kai tik ji taps prieinama, nėra garantijos, kad tai įvyks iki kol įkėlimo seka bandys paleisti tinklo servisus, kurie savo ruožtu, nesant tinklo sąsajų, gali elgtis neteisingai.
nb: På system som bruker <systemitem role="package">udev</systemitem> for å laste drivere for nettverkskort, så er det mulig at den asynkrone måten som <systemitem role="package">udev</systemitem> kjører på, gjør at nettverkskortet ikke har blitt aktivert før <command>/etc/init.d/networking</command> starter under oppstart. Selv om det det å legge til <literal>allow-hotplug</literal> i fila <filename>/etc/network/interfaces</filename> (i tillegg til <literal>auto</literal>) vil sørge for at nettverket kommer opp så snart nettverkskortet er aktivert, så er det ingen garanti for at dette skjer før oppstartsekvensen er over, en del tjenester som starter under oppstartsekvensen kan bli påvirket av dette.
pt: Em sistemas que utilizam o <systemitem role="package">udev</systemitem> para carregar o driver para interfaces de rede, é possível que devido à natureza assíncrona do <systemitem role="package">udev</systemitem> o driver de rede não seja carregado antes do <command>/etc/init.d/networking</command> ser corrido durante o arranque. Embora incluir <literal>allow hotplug</literal> no ficheiro <filename>/etc/network/interfaces</filename> (para além de <literal>auto</literal>) irá garantir que a interface será configurada logo que esteja disponível, não há garantia que isto será feito antes da sequência de arranque começar a carregar serviços de rede, alguns dos quais podem não se comportar correctamente sem uma interface de rede.
ro: Pe sistemele care folosesc <systemitem role="package">udev</systemitem> pentru a încărca drivere pentru interfețe de rețea este posibil ca datorită naturii asincrone a <systemitem role="package">udev</systemitem> ca driverul de rețea să nu fie încărcat înainte ca <command>/etc/init.d/networking</command> să ruleze la inițializarea sistemului. Deși incluzând <literal>allow-hotplug</literal> în <filename>/etc/network/interfaces</filename> (adițional față de <literal>auto</literal>) va determina ca interfața de rețea să fie activată imediat ce este disponibilă, nu există nici o garanție că această acțiune va fi completă înainte ca secvența de inițializare să pornească servicii de rețea, iar unele dintre acestea e posibil să nu aibă un comportament corect în absența interfeței de rețea.
zh_tw: 在使用 <systemitem role="package">udev</systemitem> 來載入網路介面的驅動程式的系統上，可能因為 <systemitem role="package">udev</systemitem> 本身無法同步，導致在開機時，網路的驅動程式無法在執行 <command>/etc/init.d/networking</command> 之前載入。雖然在 <filename>/etc/network/interfaces</filename> 中（除了 <literal>auto</literal> 之外）加入 <literal>allow-hotplug</literal> 將可確保網路介面在載入時會將其啟用，但卻無法保証這可以在開機流程開始啟動網路服務前就順利完成，這可能會讓這些網路服務因為沒有該網路介面而無法正常運作。

source: Trouble when using <acronym>WPA</acronym> secured wireless networks
be: Праблема з выкарыстаннем радыёсетак, абароненых <acronym>WPA</acronym>
it: Problemi con l'utilizzo di reti senza fili protette con <acronym>WPA</acronym>
ja: <acronym>WPA</acronym> による安全な無線接続を使う場合の問題
lt: Problema naudojant <acronym>WPA</acronym> belaidžių tinklų saugumui užtikrinti
nb: Problemer med å bruke trådløse nettverk beskyttet med <acronym>WPA</acronym>
pt: Problemas ao utilizar redes wireless protegidas por <acronym>WPA</acronym>
ro: Probleme la folosirea rețelelor fără fir securizate cu <acronym>WPA</acronym>

source: In &oldreleasename;, the <systemitem role="package">wpasupplicant</systemitem> package was set up as a system service, configured via <filename>/etc/default/wpasupplicant</filename> and a user-provided <filename>/etc/wpasupplicant.conf</filename>.
be: У выпуску "&oldreleasename;" праграма <systemitem role="package">wpasupplicant</systemitem> працавала як сістэмны сервіс, які кіраваўся файламі наладак <filename>/etc/default/wpasupplicant</filename> і <filename>/etc/wpasupplicant.conf</filename> (апошні ўтрымлівае наладкі, забяспечаныя карыстальнікам).
it: In &oldreleasename;, il pacchetto <systemitem role="package">wpasupplicant</systemitem> era impostato come un servizio di sistema configurato tramite <filename>/etc/default/wpasupplicant</filename> e un file di configurazione <filename>/etc/wpasupplicant.conf</filename> fornito dall'utente.
ja: &oldreleasename; では、<systemitem role="package">wpasupplicant</systemitem> パッケージはシステムのサービスとして、<filename>/etc/default/wpasupplicant</filename> および ユーザが提供する <filename>/etc/wpasupplicant.conf</filename> により設定されていました。
lt: Laidoje &oldreleasename; paketas <systemitem role="package">wpasupplicant</systemitem> buvo diegiamas kaip sisteminis servisas ir konfigūruojamas faile <filename>/etc/default/wpasupplicant</filename> bei naudotojų kuriamame faile <filename>/etc/wpasupplicant.conf</filename>.
nb: I &oldreleasename; var pakken <systemitem role="package">wpasupplicant</systemitem> installert som en systemtjeneste med innstillinger lagret i <filename>/etc/default/wpasupplicant</filename> og med brukerspesifikke innstillinger lagret i <filename>/etc/wpasupplicant.conf</filename>.
pt: Na &oldreleasename;, o pacote <systemitem role="package">wpasupplicant</systemitem> era configurado através dos ficheiros <filename>/etc/default/wpasupplicant</filename> e <filename>/etc/wpasupplicant.conf</filename> como um serviço de sistema.
ro: În &oldreleasename;, pachetul <systemitem role="package">wpasupplicant</systemitem> era configurat ca un serviciu de sistem și configurat prin <filename>/etc/default/wpasupplicant</filename> și fișierul <filename>/etc/wpasupplicant.conf</filename> furnizat de utilizator.
zh_tw: 在 &oldreleasename; 裡，<systemitem role="package">wpasupplicant</systemitem> 套件被設定成為由 <filename>/etc/default/wpasupplicant</filename> 及使用者自訂的 <filename>/etc/wpasupplicant.conf</filename> 控管的系統服務。

source: In &releasename;, <filename>/etc/init.d/wpasupplicant</filename> has been dropped and the Debian package now integrates with <filename>/etc/network/interfaces</filename>, similar to other packages such as <systemitem role="package">wireless-tools</systemitem>. This means <systemitem role="package">wpasupplicant</systemitem> no longer provides a system service directly.
be: У "&releasename;" больш не выкарыстоўваецца скрыпт запуску <filename>/etc/init.d/wpasupplicant</filename>, а наладкі пакета ўключаныя ў файл <filename>/etc/network/interfaces</filename> такім самым чынам, як наладкі іншых падобных пакетаў кшталту <systemitem role="package">wireless-tools</systemitem>. Гэта значыць, што пакет <systemitem role="package">wpasupplicant</systemitem> больш не забяспечвае сістэмных сервісаў непасрэдна.
it: In &releasename;, <filename>/etc/init.d/wpasupplicant</filename> è stato eliminato e il pacchetto di Debian si integra ora con <filename>/etc/network/interfaces</filename> in modo simile ad altri pacchetti come ad esempio <systemitem role="package">wireless-tools</systemitem>. Ciò significa che <systemitem role="package">wpasupplicant</systemitem> non fornisce più direttamente un servizio di sistema.
ja: &releasename; では、<filename>/etc/init.d/wpasupplicant</filename> はなくなり、Debian パッケージでは <systemitem role="package">wireless-tools</systemitem> など他のパッケージと同様に <filename>/etc/network/interfaces</filename> に統一されました。これはつまり、<systemitem role="package">wpasupplicant</systemitem> は直接システムサービスを提供しないということを意味しています。
lt: laidoje &releasename;, scenarijaus <filename>/etc/init.d/wpasupplicant</filename> buvo atsisakyta ir dabar šis Debian'o paketas integruotas į <filename>/etc/network/interfaces</filename>, panašiai kaip ir kiti paketai, pvz. <systemitem role="package">wireless-tools</systemitem>. Tai reiškia, kad <systemitem role="package">wpasupplicant</systemitem> daugiau nebeatlieka sistemos servisų tiesiogiai.
nb: I &releasename;, har <filename>/etc/init.d/wpasupplicant</filename> forsvunnet, og Debian pakken er nå integrert med <filename>/etc/network/interfaces</filename>, på samme måte som f.eks pakken <systemitem role="package">wireless-tools</systemitem>. Dette betyr at <systemitem role="package">wpasupplicant</systemitem> ikke lenger tilbyr noen systemtjeneste.
pt: Na &releasename;, o <filename>/etc/init.d/wpasupplicant</filename> foi descontinuado e o pacote Debian agora integra-se com o <filename>/etc/network/interfaces</filename>, da mesma forma que outros pacotes como o <systemitem role="package">wireless-tools</systemitem>. Isto significa que o <systemitem role="package">wpasupplicant</systemitem> já não disponibiliza um serviço de sistema directamente.
ro: În &releasename; <filename>/etc/init.d/wpasupplicant</filename> a fost abandonat și pachetul Debian este acum integrat cu <filename>/etc/network/interfaces</filename>, similar cu alte pachete, cum ar fi <systemitem role="package">wireless-tools</systemitem>. Aceasta înseamnă că <systemitem role="package">wpasupplicant</systemitem> nu mai furnizează direct un serviciu de sistem.
zh_tw: 在 &releasename; 裡，<filename>/etc/init.d/wpasupplicant</filename> 已被廢棄，就如同 <systemitem role="package">wireless-tools</systemitem> 之類的其它套件一樣，Debain 套件現已將其和 <filename>/etc/network/interfaces</filename> 整合在一起，也就是說，<systemitem role="package">wpasupplicant</systemitem> 已不直接提供系統服務了。

source: For information on configuring wpasupplicant please refer to <filename>/usr/share/doc/wpasupplicant/README.modes.gz</filename>, which gives examples for <filename>/etc/network/interfaces</filename> files. Updated information about the usage of the <systemitem role="package">wpasupplicant</systemitem> package in Debian can be found in the <ulink url="&url-wiki;WPA">Debian Wiki</ulink>.
be: Каб даведацца больш аб наладцы wpasupplicant, скарыстайцеся файлам дакументацыі <filename>/usr/share/doc/wpasupplicant/README.modes.gz</filename>, які ўтрымлівае прыклады запаўнення файла наладак <filename>/etc/network/interfaces</filename>. Абноўленая інфармацыя аб выкарыстанні пакету <systemitem role="package">wpasupplicant</systemitem> у Debian даступная на старонках <ulink url="&url-wiki;WPA">Debian Wiki</ulink>.
it: Per informazioni sulla configurazione di wpasupplicant si faccia riferimento al file <filename>/usr/share/doc/wpasupplicant/README.modes.gz</filename>, che fornisce esempi per file <filename>/etc/network/interfaces</filename>. Si possono reperire informazioni aggiornate concernenti l'utilizzo del pacchetto <systemitem role="package">wpasupplicant</systemitem> in Debian nel <ulink url="&url-wiki;WPA">wiki di Debian</ulink>.
ja: wpasupplicant の設定についての情報は、<filename>/etc/network/interfaces</filename> ファイルの例が書いてある <filename>/usr/share/doc/wpasupplicant/README.modes.gz</filename> を参照してください。Debian で <systemitem role="package">wpasupplicant</systemitem> パッケージを使用する際の最新情報は、<ulink url="&url-wiki;WPA">Debian Wiki</ulink> にあります。
lt: Informacijos apie wpasupplicant konfigūravimą galima rasti faile <filename>/usr/share/doc/wpasupplicant/README.modes.gz</filename>, kuriame pateikiami <filename>/etc/network/interfaces</filename> failų pavyzdžiai. Atnaujintą informaciją apie <systemitem role="package">wpasupplicant</systemitem> paketo naudojimą galima rasti <ulink url="&url-wiki;WPA">Debian Wiki</ulink>'yje.
nb: For mer informasjon om hvordan man skal konfigurere wpasupplicant , så les <filename>/usr/share/doc/wpasupplicant/README.modes.gz</filename>, der finner du eksempler på ulike oppsett av <filename>/etc/network/interfaces</filename>. Oppdatert informasjon på hvordan du skal bruke <systemitem role="package">wpasupplicant</systemitem> pakken i Debian finner du på <ulink url="&url-wiki;WPA">Debian Wiki</ulink>.
pt: Para informação sobre como configurar o wpasupplicant por favor leia o <filename>/usr/share/doc/wpasupplicant/README.modes.gz</filename>, que dá exemplos de ficheiros <filename>/etc/network/interfaces</filename>. Informação actualizada sobre a utilização do pacote <systemitem role="package">wpasupplicant</systemitem> na Debian pode ser encontrada na <ulink url="&url-wiki;WPA">Debian Wiki</ulink>.
ro: Pentru informații despre configurarea wpasupplicant puteți citi <filename>/usr/share/doc/wpasupplicant/README.modes.gz</filename>, care dă exemple de fișiere <filename>/etc/network/interfaces</filename>. Informații actualizate despre utilizarea pachetului <systemitem role="package">wpasupplicant</systemitem> în Debian pot fi găsite la <ulink url="&url-wiki;WPA">Debian Wiki</ulink>.
zh_tw: 關於如何設定 wpasupplicant 的資訊請參閱 <filename>/usr/share/doc/wpasupplicant/README.modes.gz</filename>，裡面有 <filename>/etc/network/interfaces</filename> 的範例檔可供參考。而一些如何使用 Debian 的 <systemitem role="package">wpasupplicant</systemitem> 套件的更新資訊可以在 <ulink url="&url-wiki;WPA">Debian Wiki</ulink> 上取得。

source: Problems with non-ASCII characters in filenames
be: Праблемы з выкарыстаннем не-ASCII сімвалаў у імёнах файлаў
it: Problemi con caratteri non-ASCII nei nomi dei file
ja: 非 ASCII 文字を含むファイル名での問題
lt: Problemos, susijusios su ne ASCII simboliais failų varduose
nb: Problemer i filnavn med tegn som ikke er ASCII
pt: Problemas com caracteres não-ASCII em nomes de ficheiros
ro: Probleme cu caractere non-ASCII în numele de fișiere
zh_tw: 檔名內含非 ASCII 字元的問題

source: Mounting vfat, ntfs or iso9660 file systems with files that include non-ASCII characters in their filenames will give failures when one tries to use the filenames unless mounting is done with the utf8 option. An indication might be the following failure: <quote>Invalid or incomplete multibyte or wide character</quote>. A possible solution is to use <literal>defaults,utf8</literal> as mount options for vfat, ntfs and iso9660 file systems when they contain filenames with non-ASCII characters.
be: Пры мацаванні файлавых сістэм фарматаў vfat, ntfs або iso9660 без выкарыстання параметру utf8 могуць узнікнуць праблемы, калі ў назвах файлаў сустракаюцца сімвалы, адрозныя ад знаказбору ASCII. Прыкметай праблемы з'яўляецца паведамленне аб памылцы <quote>Некарэктны альбо непоўны шматбайтавы або пашыраны сімвал</quote> (<quote>Invalid or incomplete multibyte or wide character</quote>). Выправіць сітуацыю можна праз выкарыстанне параметру мацавання <literal>defaults,utf8</literal> для такіх файлавых сістэмаў.
it: Montando file system vfat, ntfs o iso9660 con file i cui nomi comprendono caratteri non-ASCII si avranno problemi quando si cercherà di utilizzare i nomi dei file, a meno che li si monti con l'opzione utf8. Un sintomo potrebbe essere l'errore seguente: <quote>Invalid or incomplete multibyte or wide character</quote>. Una possibile soluzione è l'uso delle opzioni <literal>defaults,utf8</literal> quando si montano file system di tipo vfat, ntfs e iso9660 nel caso in cui contengano nomi file con caratteri non-ASCII.
ja: ファイル名に非 ASCII 文字を含むファイルがある vfat、ntfs、iso9660 ファイルシステムを、utf8 オプションをつけずにマウントした場合、そのファイル名を使うのに失敗します。次のようなエラーが表示されます: <quote>Invalid or incomplete multibyte or wide character</quote>。解決方法としては、ファイル名に非 ASCII 文字を含むファイルがある vfat、ntfs、iso9660 ファイルシステムをマウントする際には、<literal>defaults,utf8</literal> をマウントオプションとしてつけることです。
lt: Prijungiant vfat, ntfs arba iso9660 failų sistemas su failais, kurių varduose yra ne ASCII simbolių, įvyksta klaida, jei kas nors bando naudoti failų vardus, o failų sitemos prijungimas buvo atliekamas be utf8 parametro.Tai gali pasireikšti tokiu pranešimu: <quote>Invalid or incomplete multibyte or wide character</quote>. Galimas sprendimo būdas yra prijungiant naudoti prijungimo parametrus <literal>defaults,utf8</literal>, kai failų sistemose yra failų su ne ASCII simboliais failų varduose.
nb: Montering av filsystemtypene vfat, ntfs eller iso9660 som inneholder tegn utenfor ASCII-tabellen fører til at feil oppstår når disse filene brukes, om man ikke har montert filsystemet med opsjonen utf8. Følgende melding kan være et slikt eksempel: <quote>Invalid or incomplete multibyte or wide character</quote>. En mulig løsning er å bruke <literal>defaults, utf8</literal>som en opsjon ved montering av filsystemtypene vfat, ntfs eller iso9660 om disse inneholder filnavn med tegn fra utenfor ASCII-tabellen.
pt: Montar sistemas de ficheiros vfat, ntfs ou iso9660 com ficheiros que incluem caracteres não-ASCII nos seus nomes irá originar erros quando alguém tentar utilizar os nomes de ficheiros, a não ser que se monte com a opção utf8. Uma indicação pode ser a seguinte falha: <quote>Invalid or incomplete multibyte or wide character</quote>. Uma solução possível é utilizar <literal>defaults,utf8</literal> como opções do mount para sistemas de ficheiros vfat, ntfs e iso9660 quando estes contém nomes de ficheiros com caracteres não-ASCII.
ro: Dacă montați sisteme de fișiere vfat, ntfs sau iso9660 care includ caractere non-ASCII în numele fișierelor, vor rezulta erori la folosirea numelor de fișiere, cu excepția cazului în care montarea s-a făcut cu opțiunea utf8. Un indicator ar fi următoarea eroare: <quote>Invalid or incomplete multibyte or wide character</quote> (în română: <quote>multioctet sau caracter mare invalid sau incomplet</quote>). O posibilă soluție este să folosiți <literal>defaults,utf8</literal> ca opțiuni de montare pentru sisteme de fișiere vfat, ntfs și iso9660 când conțin nume de fișiere cu caractere non-ASCII.

source: Note that the Linux kernel does not support case-insensitive filename handling for vfat when the <literal>utf8</literal> option is used.
be: Варта памятаць, што для сістэмы фармату vfat, прымацаванай з параметрам <literal>utf8</literal>, ядро Linux не можа забяспечыць незалежныя ад рэгістру назвы файлаў.
it: Si noti che la distinzione tra lettere maiuscole e minuscole nei nomi di file su file system vfat non è attiva se viene usata l'opzione <literal>utf8</literal>.
ja: <literal>utf8</literal> オプションをつけると、vfat で大文字小文字を区別せずにファイル名を扱うという機能を、Linux カーネルがサポートしていないことに注意してください。
lt: Atkreipkite dėmesį, kad naudojant parametrą <literal>utf8</literal>, Linux branduolys neskiria didžiųjų ir mažųjų raidžių vfat failų sistemos failų varduose.
nb: Merk at Linux-kjernen ikke har støtte for å ikke ta hensyn til store eller små bokstaver i filnavn for vfat filsystem når alternativet <literal>utf8</literal> brukes.
pt: Note que o kernel Linux não suporta o tratamento de nomes de ficheiros não sensíveis à maiúsculas/minúsculas para vfat quando é utilizada a opção <literal>utf8</literal>.
ro: A se reține că nucleul Linux nu suportă manipularea numelor de fișiere cu majuscule nesemnificative pentru vfat când se folosește opțiunea <literal>utf8</literal>.
zh_tw: 請注意到，在使用 <literal>utf8</literal> 選項時，Linux kernel 並不在 vfat 上支援對大小寫不分的檔案名稱的控管。

source: Sound stops working
be: Не працуе гук
it: L'audio smette di funzionare
ja: サウンドが機能しない
lt: Garsas nustoja veikti
nb: Lyd stopper å virke
pt: O som deixa de funcionar.
ro: Sunetul nu mai funcționează
zh_tw: 音效失去作用
