Repository: lurdan/trans-ddp
Catalog: release-notes/*/issues.po
Languages: be, de, fr, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sv, zh_tw

source: en
be: be
de: de
fr: fr
it: it
ja: ja
lt: lt
nb: nb
pl: pl
pt: pt
pt_br: pt_BR
ro: ro
ru: ru
sv: sv
zh_tw: zh_TW

source: Issues to be aware of for &releasename;
be: Праблемы "&releasename;", аб якіх варта ведаць
de: Dinge, die Sie über &Releasename; wissen sollten
fr: Problèmes à connaître pour &Releasename;
it: Problemi di cui essere al corrente per &releasename;
ja: &releasename; で知っておくべき問題点
lt: Dalykai, kuriuos reikia žinoti apie &releasename;
nb: Problemer du bør kjenne til vedrørende &releasename;
pl: Problemy, które należy mieć na uwadze, a dotyczące wydania &releasename;
pt: Problemas a estar atento na &releasename;
pt_br: Problemas a serem considerados para o &releasename;
ro: Probleme în &releasename; de care ar trebui să știți
ru: Что нужно знать о &releasename;
sv: Problemområden att känna till för utgåvan &releasename;
zh_tw: 在 &releasename; 裡您必須知道的一些問題

source: Potential problems
be: Патэнцыйныя праблемы
de: Mögliche Probleme
it: Potenziali problemi
ja: 生じうる問題
lt: Galimos problemos
nb: Potensielle problemer
pt: Potenciais problemas
ro: Potențiale probleme
sv: Potentiella problem
zh_tw: 潛在的問題

source: Sometimes, changes introduced in a new release have side-effects we cannot reasonably avoid, or they expose bugs somewhere else. This section documents issues we are aware of. Please also read the errata, the relevant packages' documentation, bug reports and other information mentioned in <xref linkend="morereading"/>.
de: Manchmal haben Änderungen, die in einer neuen Veröffentlichung eingebracht werden, Nebeneffekte, die wir ohne größeren Aufwand nicht vermeiden können, oder dies würde Fehler an anderen Stellen verursachen. Dieses Kapitel dokumentiert die uns bekannten Probleme. Bitte lesen Sie auch die Errata, die relevanten Paketdokumentationen, Fehlerberichte und weitere Informationen in <xref linkend="morereading"/>.
fr: Parfois, des changements ont des effets de bord que nous ne pouvons pas raisonnablement éviter sans nous exposer à des bogues à un autre endroit. Cette section documente les problèmes que nous connaissons. Veuillez également lire l'errata, la documentation des paquets concernés, les rapports de bogues et les autres sources d'informations mentionnées en <xref linkend="morereading"/>.
it: A volte i cambiamenti introdotti da un nuovo rilascio comportano effetti collaterali che non si possono ragionevolmente evitare o che espongono a errori da altre parti. Qui sono documentati i problemi di cui siamo al corrente. Si leggano anche le errata corrige, la documentazione dei pacchetti interessati, le segnalazioni di errori e altre informazioni riportate in <xref linkend="morereading"/>.
ja: 新しいリリースに導入された変化には当然のように副作用がつきもので、どこか他の場所でバグを出してしまうこともあります。この章では、現時点で私たちが知っている問題点を記載しています。正誤表・関連パッケージの付属文書・バグ報告や、<xref linkend="morereading"/>で触れられているその他の情報も読んでください。
pl: Czasami zmiany wprowadzone w nowym wydaniu mają skutki uboczne, którym nie można zapobiec w sensowny sposób, lub które odsłaniają inne błędy. Niniejszy rozdział dokumentuje znane problemy. Proszę zapoznać się również z erratą, dokumentacją odpowiednich pakietów, zgłoszeniami błędów i pozostałymi informacjami opisanymi w <xref linkend="morereading"/>.
pt: Por vezes, as alterações introduzidas num novo lançamento têm efeitos secundários que não podemos evitar razoavelmente, ou aparecerão bugs noutro lado. Esta secção documenta os problemas que conhecemos. Por favor leia também a errata, a documentação dos pacotes relevantes, relatórios de bugs e outra informação mencionada em <xref linkend="morereading"/>.
pt_br: Algumas vezes, mudanças introduzidas em uma nova versão têm efeitos colaterais que não podem ser evitados ou que acabam expondo bugs em outros locais. Esta seção documenta problemas conhecidos. Por favor, também leia a errata, a documentação dos pacotes relevantes, relatórios de bugs e outras informações mencionadas na <xref linkend="morereading"/>.
ru: Иногда изменения, внесённые в новый выпуск, приводят к побочным эффектам, которых нельзя избежать без появления ошибок где-то ещё. Этот раздел описывает проблемы, которые уже известны нам. Прочитайте также список известных ошибок, соответствующую документацию на пакеты, отчёты об ошибках и другую информацию, указанную в <xref linkend="morereading"/>.
sv: Ibland innebär förändringar i en ny utgåva att sidoeffekter vi inte kunnat undvika uppstår, i vissa fall skapas nya fel någon annanstans. Här dokumenterar vi problem som vi känner till. Vänligen läs ävan erratan, dokumentationen för aktuella paket, felrapporter och annan information som nämns i <xref linkend="morereading"/>.

source: Problems with devices related to udev
be: Праблемы з прыладамі, што маюць дачыненне да udev
de: Probleme mit Geräten in Verbindung mit udev
it: Problemi relativi a device attinenti udev
ja: udev に関連したデバイスでの問題
lt: Problemos, susijusios su įrenginiais dėl udev
nb: Problemer med enheter i tillknytting til udev
pt: Problemas com dispositivos relacionados com o udev
ro: Probleme cu dispozitive legate de udev
sv: Problem med enheter på grund av udev
zh_tw: udev 相關裝置的問題

source: Although <systemitem role="package">udev</systemitem> has been tested extensively, you may experience minor problems with some devices that will need to be fixed. The most common problems are changed permission and/or ownership of a device. In some cases a device may not be created by default (e.g. <filename>/dev/video</filename> and <filename>/dev/radio</filename>).
be: Нягледзячы на тое, што пакет <systemitem role="package">udev</systemitem> інтэнсіўна правяраўся, могуць узнікнуць нязначныя праблемы з пэўнымі прыладамі, якія запатрабуюць выпраўлення. Найбольш часта праблемы датычацца змянення правоў доступу ды/або уладальніка файла прылады. У пэўных выпадках файл прылады можа не быць створаны аўтаматычна (напрыклад, <filename>/dev/video</filename> ды <filename>/dev/radio</filename>).
de: Obwohl <systemitem role="package">udev</systemitem> ausführlich getestet wurde, könnten kleinere Probleme mit einigen Geräten auftauchen, die behoben werden müssen. Die häufigsten Probleme sind geänderte Rechte und/oder Besitzer eines Gerätes. In einigen Fällen könnte es sein, dass ein Gerät standardmäßig nicht erstellt wird (z.B. <filename>/dev/video</filename> und <filename>/dev/radio</filename>).
it: Malgrado <systemitem role="package">udev</systemitem> sia stato testato intensivamente, potrebbero occorrere problemi minori con taluni device che necessitano di una correzione. I problemi più comuni sono modifiche dei permessi o dei proprietari di device. In taluni casi un device potrebbe non essere creato in modalità predefinita (per esempio <filename>/dev/video</filename> e <filename>/dev/radio</filename>).
ja: <systemitem role="package">udev</systemitem> は広範囲にわたってテストされていますが、いくつかのデバイスでは若干の修正が必要になるという問題があるかもしれません。大抵の問題は、デバイスファイルの権限や所有者が変更されるというものです。デフォルトではデバイスファイルが作成されない場合もあります (<filename>/dev/video</filename> や <filename>/dev/radio</filename> など)。
lt: Nors <systemitem role="package">udev</systemitem> buvo plačiai ištestuotas, gali kilti nedidelių problemų su kai kuriais įrenginiais, ir kurias teks taisyti. Dažniausiai pasitaikanti problema yra pasikeitę įrenginio failo nuosavybė ir/arba teisės. Kai kuriais atvejais numatytieji įrenginiai negali būti sukurti (pvz. <filename>/dev/video</filename> ir <filename>/dev/radio</filename>).
nb: Selv om <systemitem role="package">udev</systemitem> har blitt testet grundig, så kan du oppleve mindre problemer med noen enheter som må fikses. Det vanligste er å måtte endre rettigheter og/eller eierskap på en enhet. I noen tilfeller så vil en enhet som standard ikke lages, f.eks <filename>/dev/video</filename> og <filename>/dev/radio</filename>
pt: Apesar do <systemitem role="package">udev</systemitem> ter sido testado extensivamente, você pode deparar-se com pequenos problemas em alguns dispositivos que terão de ser corrigidos. O mais comum desses problemas é a alteração das permissões e/ou 'ownership' de um dispositivo. Em alguns casos um dispositivo pode não ser criado por predefinição (e.g. <filename>/dev/video</filename> e <filename>/dev/radio</filename>).
ro: Deși <systemitem role="package">udev</systemitem> a fost testat îndelung e posibil să aveți parte de probleme minore cu anumite dispozitive, care vor trebui rezolvate. Cele mai frecvente probleme sunt schimbările de permisiune și/sau proprietate a dispozitivelor. În anumite cazuri un dispozitiv nu va fi creat implicit (de ex. <filename>/dev/video</filename> and <filename>/dev/radio</filename>).
sv: Trots att <systemitem role="package">udev</systemitem> testats noga och mycket kan du uppleva mindre problem med några enheter. Det vanligaste felet är ändrade rättigheter och/eller äganderätten på en enhet. I vissa fall kan en enhet inte skapas (ex. <filename>/dev/video</filename> och <filename>/dev/radio</filename>).
zh_tw: 雖然 <systemitem role="package">udev</systemitem> 已經過了廣泛的測試，但您還是可能在某些裝置上遇到一些必須加以修正的小問題。最常見的問題是某個裝置的權限及/或所有權上的變更。在某些狀況下，有些裝置在預設上是不會被建立的。（如：<filename>/dev/video</filename> 和 <filename>/dev/radio</filename>）。

source: <systemitem role="package">udev</systemitem> provides configuration mechanisms to deal with these issues. See <citerefentry> <refentrytitle>udev</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> and <filename>/etc/udev</filename> for further information.
be: Пакет <systemitem role="package">udev</systemitem> забяспечвае механізмы наладкі для вырашэння такіх праблем. Больш звестак можна атрымаць з даведкі <citerefentry> <refentrytitle>udev</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> ды файлаў наладак з дырэкторыі <filename>/etc/udev</filename>.
de: <systemitem role="package">udev</systemitem> bietet Konfigurationsmechanismen an, um diese Probleme zu behandeln. Siehe <citerefentry> <refentrytitle>udev</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> und <filename>/etc/udev</filename> für weitere Informationen.
it: <systemitem role="package">udev</systemitem> fornisce i meccanismi di configurazione per far fronte a tali problemi. Per maggiori informazioni si vedano <citerefentry> <refentrytitle>udev</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> ed <filename>/etc/udev</filename>.
ja: <systemitem role="package">udev</systemitem> は、これらの問題に対処する設定の仕組みを提供しています。詳しくは、<citerefentry> <refentrytitle>udev</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> や <filename>/etc/udev</filename> を見てください。
lt: Šių klausimų sprendimui <systemitem role="package">udev</systemitem> konfigūracijos mechanizmas. Papildomos informacijos žiūr. <citerefentry><refentrytitle>udev</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> ir <filename>/etc/udev</filename>.
nb: <systemitem role="package">udev</systemitem> tilbyr mekanismer for å enkelt utføre disse konfigurasjonene. Se <citerefentry> <refentrytitle>udev</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> og <filename>/etc/udev</filename> for mer informasjon.
pt: O <systemitem role="package">udev</systemitem> fornece mecanismos de configuração para lidar com estes problemas. Veja <citerefentry> <refentrytitle>udev</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> e <filename>/etc/udev</filename> para mais informação.
ro: <systemitem role="package">udev</systemitem> oferă mecanisme de configurare pentru a putea rezolva aceste probleme. Vedeți <citerefentry> <refentrytitle>udev</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> și <filename>/etc/udev</filename> pentru mai multe informații.
sv: <systemitem role="package">udev</systemitem> tillhandahåller mekanismer för att åtgärda dessa problem. Läs mer i <citerefentry> <refentrytitle>udev</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> och <filename>/etc/udev</filename>.
zh_tw: <systemitem role="package">udev</systemitem> 提供了設定機制以便您能處理這些問題。請查看 <citerefentry> <refentrytitle>udev</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> 和 <filename>/etc/udev</filename> 以取得更詳盡的資訊。

source: Migration of disk drivers from IDE to PATA subsystem
it: Migrazione dei driver dei dischi da sottosistema IDE a PATA
ja: IDE から PATA サブシステムへのディスクドライバの移行
pt: Migração dos drivers de disco do subsistema IDE para o PATA

source: The new Linux kernel version provides different drivers for some PATA (IDE) controllers. The names of some hard disk, CD-ROM, and tape devices may change.
it: La nuova versione del kernel Linux fornisce dei driver diversi per alcuni controller PATA (IDE). I nomi di alcuni dischi, CD-ROM e unità a nastro potrebbero cambiare.
ja: 新しいバージョンの Linux カーネルは、いくつかの PATA (IDE) コントローラに対して異なったドライバを提供します。ハードディスクや CD-ROM、テープデバイスの名前が変わるかもしれません。
pt: A nova versão do kernel Linux apresenta drivers diferentes para alguns controladores PATA (IDE). Os nomes de alguns dispositivos de disco rígido, CD-ROM e tape podem mudar.

source: It is now recommended to identify disk devices in configuration files by label or UUID (unique identifier) rather than by device name, which will work with both old and new kernel versions. Upon upgrading to the &releasename; version of the Debian kernel packages, the <systemitem role="package">linux-base</systemitem> package will offer to do this conversion for you in the config files for most of the filesystem-related packages on the system, including the various bootloaders included in Debian. If you choose not to update the system configuration automatically, or if you are not using the Debian kernel packages, you must update device IDs yourself before the next system reboot to ensure the system remains bootable.
it: Si raccomanda di identificare i device dei dischi all'interno dei file di configurazione con un'etichetta o con un UUID (identificatore univoco) al posto del nome del device, questa modalità funziona sia con i kernel nuovi che con quelli più vecchi. Durante l'aggiornamento alla versione in &releasename; dei pacchetti di Debian del kernel, il pacchetto <systemitem role="package">linux-base</systemitem> offrirà la possibilità di fare automaticamente questa conversione nei file di configurazione per la maggior parte dei pacchetti sul sistema legati al file system, compresi i diversi bootloader presenti in Debian. Se non si aggiorna automaticamente la configurazione del sistema oppure se non si usano i pacchetti di Debian del kernel, è necessario aggiornare manualmente gli identificatori dei device prima del prossimo riavvio del sistema per assicurarsi che il sistema continui a essere avviabile.
ja: これからは、設定ファイル中のディスクデバイスは、デバイス名よりもラベル (label) か UUID (unique identifier) で識別することをお勧めします。これは、古いカーネルバージョンと新しいカーネルバージョンの双方で動作します。&releasename; バージョンの Debian のカーネルパッケージへのアップグレードに際して、 <systemitem role="package">linux-base</systemitem> パッケージは、Debian に含まれている様々なブートローダを含め、システム上のファイルシステム関連パッケージの大半が利用する設定ファイル中で、この変換を実施してくれます。システム設定を自動的に更新しないようにした、あるいは Debian のカーネルパッケージを使っていない場合は、システムが確実に起動できるようにするため、次回のシステム再起動の前にデバイスの ID を自分で更新しておく必要があります。
pt: Recomenda-se identificar os dispositivos de disco em ficheiros de configuração através de etiqueta ou UUID (identificador único) em vez de nome de dispositivo, que funcionará tanto em versões antigas como na nova versão do kernel. Ao actualizar para a versão &releasename; dos pacotes Debian do kernel, o pacote <systemitem role="package">linux-base</systemitem> oferecer-se-á para fazer a conversão nos ficheiros de configuração da maioria dos pacotes relacionados com o sistema de ficheiros do sistema, incluindo os diversos gestores de arranque presentes no Debian. Se escolher não actualizar automaticamente a configuração do sistema, ou se não está a usar os pacotes do kernel do Debian, tem que actualizar os IDs de dispositivo por si mesmo antes do próximo arranque do sistema para assegurar que o sistema permanece iniciável.

source: mdadm metadata format change requires recent Grub
it: Il cambiamento nel formato dei metadati di mdadm richiede una versione recente di Grub
ja: mdadm メタデータ形式の変更は最新の Grub を必要とします
pt: mudança de formato dos metadados do mdadm requer um Grub recente

source: The following only applies to users who want to let the <systemitem role="package">grub-pc</systemitem> bootloader load the kernel directly off a <acronym>RAID</acronym> device created with <systemitem role="package">mdadm</systemitem> 3.x and default values, or when the metadata version is explicitly set using <literal>-e</literal>. Specifically, this includes all arrays created during or after the installation of Debian &releasename;. Arrays created with older mdadm versions, and <acronym>RAID</acronym>s created with the command-line option <literal>-e 0.9</literal> are not affected.
it: Questo è applicabile solo agli utenti che vogliono usare <systemitem role="package">grub-pc</systemitem> per caricare il kernel direttamente da un dispositivo <acronym>RAID</acronym> creato usando <systemitem role="package">mdadm</systemitem> 3.x con la configurazione predefinita oppure con la versione dei metadati specificata esplicitamente usando <literal>-e</literal>. Tutti gli array creati durante o dopo l'installazione di Debian &releasename; hanno questa caratteristica. Gli array creati con le versioni di mdadm più vecchie e i <acronym>RAID</acronym> creati con l'opzione della riga di comando <literal>-e 0.9</literal> non hanno questo problema.
ja: 以下は、<systemitem role="package">mdadm</systemitem> 3.x のデフォルト値で作成した、あるいはメタデータデータバージョンが明示的に <literal>-e</literal> を使って設定された <acronym>RAID</acronym> デバイスから、<systemitem role="package">grub-pc</systemitem> ブートローダを使って直接カーネルを読み込みたいユーザのみに当てはまります。つまり、これは Debian &releasename; のインストール中、あるいはインストール後に作成されたすべてのデバイスに当てはまります。以前のバージョンの mdadm を使って作成されたアレイと、コマンドラインオプション <literal>-e 0.9</literal> で作成された <acronym>RAID</acronym> は影響を受けません。
pt: O seguinte aplica-se apenas a utilizadores que querem que o gestor de arranque <systemitem role="package">grub-pc</systemitem> carregue o kernel directamente a partir de um dispositivo <acronym>RAID</acronym> criado com o <systemitem role="package">mdadm</systemitem> 3.x e valores pré-definidos, ou quando a versão dos metadados for explicitamente declarada com <literal>-e</literal>. Especificamente, isto inclui todos os arrays criados durante ou depois da instalação do Debian &releasename;. Arrays criados com versões mais antigas do mdadm, e <acronym>RAID</acronym>s criados com a opção de linha de comandos <literal>-e 0.9</literal> não são afectados.

source: Versions of <systemitem role="package">grub-pc</systemitem> older than 1.98+20100720-1 will not be able to boot directly off a <acronym>RAID</acronym> with the 1.x metadata formats (the new default is 1.2). To ensure a bootable system, please make sure to use <systemitem role="package">grub-pc</systemitem> 1.98+20100720-1 or later, which is provided by Debian &releasename;. An unbootable system may be rescued with <ulink url="http://www.supergrubdisk.org/super-grub2-disk/">Super Grub2 Disk</ulink> or <ulink url="http://grml.org">grml</ulink>.
it: Le versioni di <systemitem role="package">grub-pc</systemitem> precedenti alla 1.98+20100720-1 non saranno in grado di effettuare l'avvio direttamente da un <acronym>RAID</acronym> con i metadati nei formati 1.x (il nuovo formato predefinito è 1.2). Per essere sicuri di avere un sistema avviabile, verificare che sia installato <systemitem role="package">grub-pc</systemitem> 1.98+20100720-1 o superiore, questo pacchetto è presente in Debian &releasename;. È possibile recuperare un sistema non avviabile usando <ulink url="http://www.supergrubdisk.org/super-grub2-disk/">Super Grub2 Disk</ulink> o <ulink url="http://grml.org">grml</ulink>.
ja: バージョン 1.98+20100720-1 以前の <systemitem role="package">grub-pc</systemitem> は直接 1.x メタデータ形式の <acronym>RAID</acronym> から直接起動できなくなります (新しいデフォルトは 1.2 です)。ちゃんとシステムが起動できるようにするには、Debian &releasename; で提供されている <systemitem role="package">grub-pc</systemitem> 1.98+20100720-1 、あるいはそれ以降のバージョンを必ず利用するようにしてください。起動できなくなったシステムは <ulink url="http://www.supergrubdisk.org/super-grub2-disk/">Super Grub2 Disk</ulink>、または <ulink url="http://grml.org">grml</ulink> を使うと救出できるかもしれません。
pt: Versões do <systemitem role="package">grub-pc</systemitem> mais antigas que a 1.98+20100720-1 não serão capazes de arrancar directamente de um <acronym>RAID</acronym> com os formatos de metadados 1.x (o novo valor pré-definido é 1.2). Para assegurar um sistema capaz de arrancar, assegure-se que usa o <systemitem role="package">grub-pc</systemitem> 1.98+20100720-1 ou mais recente, que está incluído no Debian &releasename;. Um sistema incapaz de arrancar pode ser salvo com o <ulink url="http://www.supergrubdisk.org/super-grub2-disk/">Super Grub2 Disk</ulink> ou <ulink url="http://grml.org">grml</ulink>.

source: Xen upgrades
it: Aggiornamento di Xen

source: If you installed Xen on &oldreleasename;, the default kernel booted by GRUB Legacy was the one providing a Xen hypervisor and dom0 support. This behavior has changed with GRUB 2 in &releasename;: the non-Xen kernel will boot by default. If you need Xen and expect to boot with it by default, there are configuration hints at <ulink url="http://wiki.debian.org/Xen#Installationandconfiguration" />.
it: Se su &oldreleasename; era installato Xen, il kernel avviato in modo predefinito da GRUB Legacy era quello che forniva l'hypervisor Xen e il supporto dom0. Questo non è più vero con GRUB 2 di &releasename;: il kernel predefinito è quello non-Xen. Qualora sia necessario usare Xen e si vuole che il kernel Xen sia il kernel predefinito, consultare i consigli sulla configurazione su <ulink url="http://wiki.debian.org/Xen#Installationandconfiguration" />.

source: Upgrades from &oldreleasename; will not automatically install Xen version 4.0. You should install the <systemitem role="package">xen-linux-system-2.6-xen-amd64</systemitem> or <systemitem role="package">xen-linux-system-2.6-xen-686</systemitem> package to ensure the Xen hypervisor and suitable dom0 kernel are installed, and to make future upgrades easier.
it: L'aggiornamento da &oldreleasename; non installa automaticamente la versione 4.0 di Xen, è necessario installare il pacchetto <systemitem role="package">xen-linux-system-2.6-xen-amd64</systemitem> o <systemitem role="package">xen-linux-system-2.6-xen-686</systemitem> per essere sicuri che l'hypervisor Xen e un kernel dom0 idoneo siano installati e per semplificare gli aggiornamenti successivi.

source: &Releasename;'s 2.6.32 Xen kernel uses pvops instead of the forward-ported Xenlinux patch. This means that on &releasename; your domU won't be able to use (for example) <filename>sda1</filename> as a device name for its hard drive, since this naming scheme is not available under pvops. Instead you should use (as a corresponding example) <filename>xvda1</filename>, which is compatible with both old and new Xen kernels.
it: Il kernel 2.6.32 Xen di &releasename; usa pvops al posto della patch Xenlinux. Questo implica che su &releasename; il domU non potrà usare (per esempio) <filename>sda1</filename> come nome di device per il disco dato che quello schema non è disponibile con pvops. Al suo posto si deve usare (corrisponde all'esempio precedente) <filename>xvda1</filename>, che è compotibile con i vecchi e i nuovi kernel Xen.

source: pam_userdb.so breakage with newer libdb
it: Malfunzionamento di pam_userdb.so con la nuova libdb
ja: 新しい libdb による pam_userdb.so の非互換性
pt: falha do pam_userdb.so com a nova libdb
