Repository: lurdan/trans-ddp
Catalog: release-notes/*/issues.po
Languages: be, de, fr, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sv, zh_tw

source: You are strongly advised to install the <systemitem role="package">kde-standard</systemitem> package for normal desktop usage. <systemitem role="package">kde-standard</systemitem> will pull in the <ulink url="http://www.kde.org/workspaces/plasmadesktop/">KDE Plasma Desktop</ulink> by default, and a selected set of commonly used applications.
it: Si raccomanda di installare il pacchetto <systemitem role="package">kde-standard</systemitem> per il normale uso desktop. Con <systemitem role="package">kde-standard</systemitem> viene installato il <ulink url="http://www.kde.org/workspaces/plasmadesktop/">KDE Plasma Desktop</ulink> e una raccolta delle applicazioni più comunemente usate.
ja: 通常のデスクトップ用途には、<systemitem role="package">kde-standard</systemitem> パッケージのインストールを強くお勧めします。<systemitem role="package">kde-standard</systemitem> は、デフォルトで <ulink url="http://www.kde.org/workspaces/plasmadesktop/">KDE Plasma デスクトップ</ulink> と、一般的に使われているアプリケーション群から選ばれたものを導入します。
pt: É fortemente aconselhado a instalar o pacote <systemitem role="package">kde-standard</systemitem> para utilização normal do ambiente de trabalho. O <systemitem role="package">kde-standard</systemitem> irá instalar como padrão o <ulink url="http://www.kde.org/workspaces/plasmadesktop/">KDE Plasma Desktop</ulink> e um conjunto seleccionado de aplicações comuns.

source: If you want a minimal desktop you can install the <systemitem role="package">kde-plasma-desktop</systemitem> package and manually pick the applications you need. This is a rough equivalent of the <systemitem role="package">kde-minimal</systemitem> package as shipped in Debian &oldrelease;.
it: Per avere un desktop minimale è possibile installare il pacchetto <systemitem role="package">kde-plasma-desktop</systemitem> e selezionare manualmente solo le applicazioni di cui si ha bisogno. Tale pacchetto è più o meno equivalente al pacchetto <systemitem role="package">kde-minimal</systemitem> in Debian &oldrelease;.
ja: 最小限のデスクトップ環境が欲しい場合は、<systemitem role="package">kde-plasma-desktop</systemitem> パッケージをインストールして、手動で必要なアプリケーションを選択してください。これで、Debian &oldrelease; での <systemitem role="package">kde-minimal</systemitem> パッケージとおおよそ同等になります。
pt: Se quer um ambiente de trabalho mínimo, pode instalar o <systemitem role="package">kde-plasma-desktop</systemitem> e escolher manualmente as aplicações que precisa. Isto é razoavelmente equivalente ao pacote <systemitem role="package">kde-minimal</systemitem> como distribuído no Debian &oldrelease;.

source: For small form factor devices, there is an alternative environment called <ulink url="http://www.kde.org/workspaces/plasmanetbook/">KDE Plasma Netbook</ulink> that can be installed with the <systemitem role="package">kde-plasma-netbook</systemitem> package. Plasma Netbook and Plasma Desktop can live in the same system and the default can be configured in System Settings (replacement of the former KControl).
it: Per gli apparati di piccole dimensioni esiste un ambiente alternativo chiamato <ulink url="http://www.kde.org/workspaces/plasmanetbook/">KDE Plasma Netbook</ulink>, è possibile installarlo tramite il pacchetto <systemitem role="package">kde-plasma-netbook</systemitem>. Plasma Netbook e Plasma Desktop possono coesistestere sullo stesso sistema e da Impostazioni di Sistema (il sostituto del precedente KControl) è possibile configurare quale dei due deve essere quello predefinito .
ja: 小型の機器用には、<ulink url="http://www.kde.org/workspaces/plasmanetbook/">KDE Plasma ネットブック</ulink> と呼ばれるもう一つの環境があります。これは <systemitem role="package">kde-plasma-netbook</systemitem> パッケージでインストールが可能です。Plasma ネットブックと Plasma デスクトップは同一のシステム上に同居でき、システム設定 (以前 KControl だったものの代替) でデフォルトを指定できます。
pt: Para dispositivos mais pequenos existe um ambiente alternativo chamado <ulink url="http://www.kde.org/workspaces/plasmanetbook/">KDE Plasma Netbook</ulink> que pode ser instalado com o pacote <systemitem role="package">kde-plasma-netbook</systemitem>. O Plasma Netbook e o Plasma Desktop podem estar no mesmo sistema e o padrão pode ser configurado através dos System Settings (substituto do antigo KControl).

source: If you want a full set of official KDE applications, you have the possibility to install the <systemitem role="package">kde-full</systemitem> package. It will install KDE Plasma Desktop by default.
it: Per avere l'insieme completo delle applicazioni KDE ufficiali, è possibile installare il pacchetto <systemitem role="package">kde-full</systemitem>. Tale pacchetto installa il KDE Plasma Desktop come predefinito.
ja: 公式の KDE アプリケーションをフルセットで欲しい場合には、<systemitem role="package">kde-full</systemitem> パッケージをインストールするのが良いでしょう。デフォルトで KDE Plasma デスクトップがインストールされます。
pt: Se quer um conjunto completo das aplicações oficiais KDE, tem a possibilidade de instalar o pacote <systemitem role="package">kde-full</systemitem>. Irá instalar por padrão o KDE Plasma Desktop.

source: GNOME desktop changes and support
be: Змены й падтрымка працоўнага асяродку GNOME
de: GNOME-Desktop-Änderungen und -Unterstützung
fr: Changements et gestion du bureau GNOME
it: Cambiamenti e supporto nel desktop GNOME
ja: GNOME デスクトップに関する変更とサポート
lt: GNOME darbastalio pokyčiai ir palaikymas
nb: Støtte og endringer i Gnome skrivebordet
pl: Obsługa i zmiany w środowisku GNOME
pt: Alterações e suporte do desktop GNOME
pt_br: Mudanças na área de trabalho GNOME e suporte
ro: Schimbări în mediul de birou GNOME și suportul pentru acesta
ru: Поддержка и изменения рабочего стола GNOME
sv: Stöd och ändringar i Gnome-skrivbordet
zh_tw: GNOME 桌面的變更和支援

source: There have been many changes in the GNOME desktop environment from the version shipped in &oldreleasename; to the version in &releasename;, you can find more information in the <ulink url="http://library.gnome.org/misc/release-notes/2.30/">GNOME 2.30 Release Notes</ulink>. Specific issues are listed below.
it: Vi sono stati molti cambiamenti nell'ambiente desktop GNOME dalla versione presente in &oldreleasename; a quella rilasciata in &releasename;; è possibile trovare maggiori informazioni nelle <ulink url="http://library.gnome.org/misc/release-notes/2.30/">Note di rilascio di GNOME 2.30</ulink>. In seguito sono elencati alcuni problemi.
ja: GNOME デスクトップ環境は、&oldreleasename; に含まれていたバージョンから &releasename; に含まれているバージョンまでに多くの変更が加えられました。さらに詳しい情報は <ulink url="http://library.gnome.org/misc/release-notes/2.30/">GNOME 2.30 のリリースノート</ulink>にあります。固有の事柄は以下に挙げられています。
pt: Ocorreram muitas alterações no ambiente de desktop GNOME desde a versão lançada na &oldreleasename; até à versão na &releasename;, pode encontrar mais informação nas <ulink url="library.gnome.org/misc/release-notes/2.30/">Notas de Lançamento do GNOME 2.30</ulink>. Problemas específicos estão referidos em seguida.

source: GDM 2.20 and 2.30
it: GDM 2.20 e 2.30
ja: GDM 2.20 と 2.30
pt: GDM 2.20 e 2.30

source: The GNOME Display Manager (GDM), is kept at version 2.20 for systems upgraded from &oldreleasename;. This version will still be maintained for the squeeze cycle but it is the last release to do so. Newly installed systems will get GDM 2.30 instead, provided by the <systemitem role="package">gdm3</systemitem> package. Because of incompatibilities between both versions, this upgrade is not automatic, but it is recommended to install <systemitem role="package">gdm3</systemitem> after the upgrade to &releasename;. This should be done from the console, or with only one open GNOME session. Note that settings from GDM 2.20 will <emphasis role="strong">not</emphasis> be migrated. For a standard desktop system, however, simply installing <systemitem role="package">gdm3</systemitem> should be enough.
it: Sui sistemi aggiornati da &oldreleasename;, GNOME Display Manager (GDM) rimane alla versione 2.20. Questa versione continuerà ad essere manutenuta per l'intero ciclo di vita di squeeze, ma non nelle versioni successive. Invece le nuove installazioni avranno GDM 2.30, fornito dal pacchetto <systemitem role="package">gdm3</systemitem>. Viste le incompatibilità tra le due versioni, l'aggiornamento non può essere automatico; si raccomanda l'installazione di <systemitem role="package">gdm3</systemitem> dopo l'aggiornamento a &releasename;. L'installazione deve essere fatta dalla console oppure con solo una sessione GNOME aperta. Da notare che le impostazioni di GDM 2.20 <emphasis role="strong">non</emphasis> saranno migrate; comunque, per un sistema desktop standard, dovrebbe essere sufficiente la semplice installazione di <systemitem role="package">gdm3</systemitem>.
ja: GNOME ディスプレイマネージャー (GDM) は、&oldreleasename; からのシステムアップグレードに際しては、バージョン 2.20 のままになっています。このバージョンは、squeeze のメンテ期間中は保守されますが、これが最後のリリースです。新しくインストールされるシステムには、代わりに <systemitem role="package">gdm3</systemitem> パッケージで提供される GDM 2.30 が設定されます。双方のバージョン間での非互換性のため、このアップグレードは自動的には行われませんが、&releasename; へのアップグレード後には <systemitem role="package">gdm3</systemitem> のインストールが推奨されています。この作業はコンソール、あるいは一つだけオープンになっている GNOME セッションから行う必要があります。GDM 2.20 からの設定は引き継ぎ<emphasis role="strong">されません</emphasis>。しかし、標準的なデスクトップの場合は単に <systemitem role="package">gdm3</systemitem> をインストール刷るだけで十分です。
pt: O GNOME Display Manager (GDM) é mantido na versão 1.20 para sistemas actualizados a partir do &oldreleasename;. Esta versão será ainda mantida durante o ciclo de lançamento do squeeze mas será o último lançamento que o fará. Sistemas instalados de fresco ficarão com a versão 2.30 do GDM, disponibilizado pelo pacote <systemitem role="package">gdm3</systemitem>. Devido a incompatibilidades entre as duas versões, esta actualização não é automática mas é recomendado instalar o <systemitem role="package">gdm3</systemitem> após a actualização para o &releasename;. Isto deve ser feito a partir da consola, ou apenas com uma sessão GNOME aberta. Note que as opções do GDM 2.20 <emphasis role="strong">não</emphasis> serão migradas. No entanto, para um sistema desktop standard, a instalação simples do <systemitem role="package">gdm3</systemitem> deverá ser suficiente.

source: Device and other administrative permissions
it: Device e altri permessi amministrativi
ja: デバイスその他の管理者権限
pt: Permissões administrativas e de dispositivo

source: Specific permissions on devices are granted automatically to the user currently logged on physically to the system: video and audio devices, network roaming, power management, device mounting. The cdrom, floppy, audio, video, plugdev and powerdev groups are no longer useful. See the <systemitem role="package">consolekit</systemitem> documentation for more information.
it: All'utente fisicamente collegato al sistema sono concessi particolari permessi sui device audio e video, di migrazione della rete, per il risparmio energetico e per montare i device. I gruppi cdrom, floppy, audio, video, plugdev e powerdev non sono più utilizzati. Per ulteriori informazioni vedre la documentazione di <systemitem role="package">consolekit</systemitem>.
ja: デバイスに対する特別な権限が、現在システムへ物理的にログインしているユーザには自動的に与えられています: ビデオ・オーディオデバイス、ネットワークの切り換え、電源の管理、デバイスのマウントなどです。cdrom、floppy、audio、video、plugdev、powerdev グループの利用は、もはや有用ではありません。詳細な情報については、<systemitem role="package">consolekit</systemitem> のドキュメントを参照してください。
pt: Permissões específicas em dispositivos são atribuídas automaticamente ao utilizador com sessão iniciada fisicamente no sistema: dispositivos áudio e vídeo, roaming de rede, gestão de energia, montagem de dispositivos. Os grupos cdrom, floppy, audio, video, plugdev e powerdev já não são úteis. Veja a documentação do <systemitem role="package">consolekit</systemitem> para mais informações.

source: Most graphical programs requiring root permissions now rely on <ulink url="http://www.freedesktop.org/wiki/Software/PolicyKit">PolicyKit</ulink> to do so, instead of <systemitem role="package">gksu</systemitem>. The recommended way to give a user administrative rights is to add it to the <literal>sudo</literal> group.
it: Adesso la maggior parte dei programmi grafici che richiedono permessi di root si appoggiano a <ulink url="http://www.freedesktop.org/wiki/Software/PolicyKit">PolicyKit</ulink> anziché a <systemitem role="package">gksu</systemitem>. Il metodo raccomandato per dare dei diritti amministrativi a un utente è aggiungerlo al gruppo <literal>sudo</literal>.
ja: root 権限が必要なほとんどのグラフィカルなプログラムは、<systemitem role="package">gksu</systemitem> ではなく、<ulink url="http://www.freedesktop.org/wiki/Software/PolicyKit">PolicyKit</ulink> を使うようになっています。ユーザ管理者権限を与えるお勧めのやり方は、ユーザを <literal>sudo</literal> グループに追加する事です。
pt: A maior parte dos programas gráficos que requerem permissões de root usam agora o <ulink url="http://www.freedesktop.org/wiki/Software/PolicyKit">PolicyKit</ulink> para as obter em vez do <systemitem role="package">gksu</systemitem>. O modo recomendado para dar a um utilizador direitos administrativos é adicioná-lo ao grupo <literal>sudo</literal>.

source: network-manager and ifupdown interaction
it: Interazione fra network-manager e ifupdown
ja: network-manager と ifupdown 間での動作の関係
pt: interacção entre o network-manager e o ifupdown

source: Upon upgrading the <systemitem role="package">network-manager</systemitem> package, interfaces configured in <filename>/etc/network/interfaces</filename> to use <acronym>DHCP</acronym> with no other options will be disabled in that file, and handled by NetworkManager instead. Therefore the <command>ifup</command> and <command>ifdown</command> commands will not work. These interfaces can be managed using the NetworkManager frontends instead, see <ulink url="http://live.gnome.org/NetworkManager/SystemSettings">the NetworkManager documentation</ulink>.
it: Con l'aggiornamento del pacchetto <systemitem role="package">network-manager</systemitem>, le interfacce configurate in <filename>/etc/network/interfaces</filename> per usare <acronym>DHCP</acronym> senza altre opzioni verranno disabilitate nel file e gestite da NetworkManager. Di conseguenza i comandi <command>ifup</command> e <command>ifdown</command> smetteranno di funzionare e sarà possibile gestire tali interfacce usando uno dei programmi d'interfaccia utente per NetworkManager, si consulti la <ulink url="http://live.gnome.org/NetworkManager/SystemSettings">documentazione di NetworkManager</ulink>.
ja: <systemitem role="package">network-manager</systemitem> パッケージのアップグレードの際、<filename>/etc/network/interfaces</filename> で <acronym>DHCP</acronym> をオプション無しで使うようにしていたインターフェイスは、このファイルでは無効にされ、代わりに NetworkManager が管理するようになります。つまり、<command>ifup</command> と <command>ifdown</command> コマンドは動作しなくなります。このようなインターフェイスは、代わりに NetworkManager のフロントエンドを使って操作できます。<ulink url="http://live.gnome.org/NetworkManager/SystemSettings">NetworkManager のドキュメント</ulink> を参照してください。
pt: Ao actualizar o pacote <systemitem role="package">network-manager</systemitem> as interfaces configuradas no <filename>/etc/network/interfaces</filename> para usar o <acronym>DHCP</acronym> e sem mais opções serão desabilitadas nesse ficheiro e tratadas pelo NetworkManager. Portanto os comandos <command>ifup</command> e <command>ifdown</command> não irão funcionar. Estas interfaces podem ser geridas em alternativa pelos frontends do NetworkManager, veja <ulink url="http://live.gnome.org/NetworkManager/SystemSettings">a documentação do NetworkManager</ulink>.

source: Conversely, any interfaces configured in <filename>/etc/network/interfaces</filename> with more options will be ignored by NetworkManager. This applies in particular to wireless interfaces used during the installation of Debian (see bug <ulink url="&url-bts;606268">#606268</ulink>).
it: Al contrario, qualsiasi interfaccia configurata in <filename>/etc/network/interfaces</filename> con più opzioni verrà ignorata da NetworkManager. In particolare tra queste ci sono le interfacce wireless usate durante l'installazione di Debian (si veda il bug <ulink url="&url-bts;606268">#606268</ulink>).
ja: 逆に、<filename>/etc/network/interfaces<filename> でインターフェイスが色々なオプションを設定されている場合、NetworkManager では無視されます。これは、特に Debian のインストール中に利用されている無線接続に当てはまります (bug <ulink url="&url-bts;606268">#606268</ulink> を参照してください)。
pt: No caso contrário, interfaces configuradas no <filename>/etc/network/interfaces</filename> com mais opções serão ignoradas pelo NetworkManager. Isto aplica-se em particular a interfaces wireless usadas durante a instalação do Debian (ver bug <ulink url="&url-bts;606268">#606268</ulink>).

source: Graphics stack changes
de: Änderungen am Grafik-Stack
it: Modifiche nello stack grafico
ja: グラフィック関連ソフトウェアの変更
pt: Mudanças do stack Gráfico
sv: Ändringar i grafikstacken

source: There have been a number of changes to the X stack in Debian &release;. This section lists the most important and user-visible.
it: In Debian &release; ci sono dei cambiamenti nello stack X. Questa sezione elenca quelli più importanti e più visibili all'utente.
ja: Debian &release; の X 環境には大量の変更が加えられています。この章では、もっとも重要でユーザから見える点を挙げます。
pt: Houve uma quantidade de alterações no stack X no Debian &release;. Esta secção apresenta as mais importantes e visíveis.

source: Obsolete Xorg drivers
it: Driver Xorg obsoleti
ja: 時代遅れ (Obsolete) となった Xorg ドライバ
pt: Drivers Xorg obsoletos

source: The <literal>cyrix</literal>, <literal>imstt</literal>, <literal>sunbw2</literal> and <literal>vga</literal> Xorg video drivers are no longer provided. Users should switch to a generic such as <literal>vesa</literal> or <literal>fbdev</literal> instead.
it: I driver video Xorg <literal>cyrix</literal>, <literal>imstt</literal>, <literal>sunbw2</literal> e <literal>vga</literal> non sono più supportati. Al loro posto gli utenti devono usare un driver generico quale <literal>vesa</literal> o <literal>fbdev</literal>.
ja: <literal>cyrix</literal>、<literal>imstt</literal>、<literal>sunbw2</literal>、<literal>vga</literal> の Xorg ビデオドライバはもう提供されません。ユーザは、代わりに <literal>vesa</literal> や <literal>fbdev</literal> などの汎用ドライバへ切り換える必要があります。
pt: Os drivers de vídeo Xorg <literal>cyrix</literal>, <literal>imstt</literal>, <literal>sunbw2</literal> e <literal>vga</literal> já não são incluídos. Os utilizadores devem mudar para um genérico como <literal>vesa</literal> ou <literal>fbdev</literal>.

source: The old <literal>via</literal> driver was no longer maintained, and has been replaced by the <literal>openchrome</literal> driver, which will be used automatically after the upgrade.
it: Il vecchio driver <literal>via</literal> non è più manutenuto ed è stato sostituito dal driver <literal>openchrome</literal>; il nuovo driver viene automaticamente usato dopo l'aggiornamento.
ja: 古い <literal>via</literal> ドライバは既にメンテナンスされなくなっており、<literal>openchrome</literal> ドライバに置き換えられました。このドライバは、アップグレード後に自動的に利用されるようになります。
pt: O antigo driver <literal>via</literal> já não era mantido e foi substituído pelo driver <literal>openchrome</literal>, que será usado automaticamente após a actualização.

source: The <literal>nv</literal> and <literal>radeonhd</literal> drivers are still present in this release, but are deprecated. Users should consider the <literal>nouveau</literal> and <literal>radeon</literal> drivers instead, respectively.
it: I driver <literal>nv</literal> e <literal>radeonhd</literal> sono ancora presenti questa versione ma sono deprecati. Gli utenti dovrebbero considerare l'uso rispettivamente dei driver <literal>nouveau</literal> e <literal>radeon</literal>.
ja: 今回のリリースには <literal>nv</literal> および <literal>radeonhd</literal> ドライバがまだ存在していますが、利用は推奨されません (deprecated)。ユーザは、それぞれ <literal>nouveau</literal> および <literal>radeon</literal> ドライバを代替として使うのを検討するべきでしょう。
pt: Os drivers <literal>nv</literal> e <literal>radeonhd</literal> ainda estão presentes neste lançamento, mas obsoletos. Os utilizadores devem considerar em alternativa os drivers <literal>nouveau</literal> e <literal>radeon</literal>, respectivamente.

source: The <literal>calcomp</literal>, <literal>citron</literal>, <literal>digitaledge</literal>, <literal>dmc</literal>, <literal>dynapro</literal>, <literal>elo2300</literal>, <literal>fpit</literal>, <literal>hyperpen</literal>, <literal>jamstudio</literal>, <literal>magellan</literal>, <literal>microtouch</literal>, <literal>mutouch</literal>, <literal>palmax</literal>, <literal>spaceorb</literal>, <literal>summa</literal>, <literal>tek4957</literal> and <literal>ur98</literal> X input drivers have been discontinued and are not included in this release. Users of these devices might want to switch to a suitable kernel driver and the evdev X driver. For many serial devices, the <command>inputattach</command> utility allows attaching them to a Linux input device which can be recognized by the <literal>evdev</literal> X driver.
it: I driver di input per X <literal>calcomp</literal>, <literal>citron</literal>, <literal>digitaledge</literal>, <literal>dmc</literal>, <literal>dynapro</literal>, <literal>elo2300</literal>, <literal>fpit</literal>, <literal>hyperpen</literal>, <literal>jamstudio</literal>, <literal>magellan</literal>, <literal>microtouch</literal>, <literal>mutouch</literal>, <literal>palmax</literal>, <literal>spaceorb</literal>, <literal>summa</literal>, <literal>tek4957</literal> e <literal>ur98</literal> sono stati soppressi e non sono presenti in questa versione. Chi utilizza dei dispositivi che hanno bisogno di quei driver può usare un driver del kernel idoneo e il driver evdev per X. È possibile usare <command>inputattach</command> per collegare la maggior parte dei dispositivi seriali a un device Linux di input per poi poterli far riconoscere al driver X <literal>evdev</literal>.
ja: <literal>calcomp</literal>、<literal>citron</literal>、<literal>digitaledge</literal>、<literal>dmc</literal>、<literal>dynapro</literal>、<literal>elo2300</literal>、<literal>fpit</literal>、<literal>hyperpen</literal>、<literal>jamstudio</literal>、<literal>magellan</literal>、<literal>microtouch</literal>、<literal>mutouch</literal>、<literal>palmax</literal>、<literal>spaceorb</literal>、<literal>summa</literal>、<literal>tek4957</literal>、<literal>ur98</literal> X 入力ドライバは提供中止となっており、今回のリリースには含まれていません。これらのデバイスのユーザは、対応するカーネルドライバと evdev X ドライバへと移行した方がよいでしょう。多くのシリアルデバイスについては、<command>inputattach</command> ユーティリティを使えば <literal>evdev</literal> X ドライバで認識できる Linux 入力デバイスに接続が可能です。
pt: Os drivers X de input <literal>calcomp</literal>, <literal>citron</literal>, <literal>digitaledge</literal>, <literal>dmc</literal>, <literal>dynapro</literal>, <literal>elo2300</literal>, <literal>fpit</literal>, <literal>hyperpen</literal>, <literal>jamstudio</literal>, <literal>magellan</literal>, <literal>microtouch</literal>, <literal>mutouch</literal>, <literal>palmax</literal>, <literal>spaceorb</literal>, <literal>summa</literal>, <literal>tek4957</literal> e <literal>ur98</literal> foram descontinuados e não estão incluídos neste lançamento. Os utilizadores destes dispositivos podem querer mudar para um driver do kernel apropriado e o driver de X evdev. Para muitos dispositivos série, o utilitário <command>inputattach</command> permite associá-los a um dispositivo Linux de entrada que pode ser reconhecido pelo driver X <literal>evdev</literal>.

source: Kernel drivers for Intel (starting from i830), ATI/AMD (from the original Radeon to the Radeon HD 5xxx <quote>Evergreen</quote> series) and for NVIDIA graphics chipsets now support native mode setting.
it: Adesso i driver del kernel per i chipset grafici Intel (da i830 in poi), ATI/AMD (dalla Radeon originale alla serie Radeon HD 5xxx <quote>Evergreen</quote>) e NVIDIA supportano nativamente il Mode Setting.
ja: カーネルドライバがネイティブモード設定をサポートするようになりました。それぞれ Intel (i830 以降)、ATI/AMD (オリジナルの Radeon から Radeon HD 5xxx <quote>Evergreen</quote> シリーズまで)、NVIDIA グラフィックスチップセットが対象です。
pt: Os drivers do kernel para a Intel (a partir da i830), ATI/AMD (a partir da Radeon original até à série Radeon HD 5xxx <quote>Evergreen</quote>) e para os chipsets gráficos NVIDIA suportam agora definições em modo nativo.
