Repository: lurdan/trans-ddp
Catalog: release-notes/*/issues.po
Languages: be, de, fr, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sv, zh_tw

source: The Apache User and Group and the PidFile path are now configured in <filename>/etc/apache2/envvars</filename>. If you have changed these settings from their default values, you need to change that file. This also means that starting apache2 with <command>apache2 -k start</command> is no longer possible, you have to use <command>/etc/init.d/apache2</command> or <command>apache2ctl</command>.
be: Сістэмны карыстальнік і сістэмная група Apache, а таксама шлях да PidFile цяпер задаюцца праз <filename>/etc/apache2/envvars</filename>. Калі Вы змянялі стандартныя наладкі, Вам давядзецца самастойна выправіць гэты файл. Таксама гэта значыць, што больш немагчыма запускаць apache2 праз каманду <command>apache2 -k restart</command>, замест яе варта карыстацца <command>/etc/init.d/apache2</command> альбо <command>apache2ctl</command>.
it: L'utente e il gruppo Apache e il percorso del PidFile sono ora configurati in <filename>/etc/apache2/envvars</filename>. Se si sono modificate queste impostazioni rispetto ai loro valori predefiniti, sarà necessario modificare quel file. Questo significa anche che l'avvio di apache2 con <command>apache2 -k start</command> non è più possibile, sarà necessario usare <command>/etc/init.d/apache2</command> oppure <command>apache2ctl</command>.
ja: Apache の User、Group、PidFile のパスは <filename>/etc/apache2/envvars</filename> で設定するようになりました。これらの設定をデフォルトから変更しているなら、このファイルを変更しなくてはなりません。また、これによって apache2 を <command>apache2 -k start</command> で起動できなくなり、<command>/etc/init.d/apache2</command> か <command>apache2ctl</command> を使う必要があります。
lt: Apache User ir Group, o taip pat kelias iki PidFile dabar yra nustatomi faile <filename>/etc/apache2/envvars</filename>. Jei keitėte šiuos nustatymus, ir dabar jie nėra tokie, kaip buvo numatytieji, Jums teks pakeisti šį failą. Tai taip pat reiškia, kad paleisti apache2 naudojant komandą <command>apache2 -k start</command> nebeįmanoma, reikia naudoti komandas <command>/etc/init.d/apache2</command> arba <command>apache2ctl</command>.
nb: Apache sin User og Group og stien til PidFile er nå konfigurert i <filename>/etc/apache2/envvars</filename>. Hvis du har endret disse verdiene fra sin standardverdi, så må du endre denne fila. Dette betyr at du ikke kan starte apache2 omigjen med kommandoen <command>apache2 -k start</command>, men at du nå må bruke <command>/etc/init.d/apache2</command> eller<command>apache2ctl</command>.
pt: O utilizador e grupo Apache e o caminho para o PidFile são agora configurados no ficheiro <filename>/etc/apache2/envvars</filename>. Se modificou estas opções, necessita alterar esse ficheiro. Isto significa também que iniciar o apache2 com <command>apache2 -k start</command> já não é possível, tem que se utilizar <command>/etc/init.d/apache2</command> ou <command>apache2ctl</command>.
ro: Utilizatorul și grupul apache, precum și fișierul pid sunt configurate acum în <filename>/etc/apache2/envvars</filename>. Dacă ați schimbat aceste opțiuni față de valorile lor implicite atunci va trebui să modificați acest fișier. Aceasta înseamnă că pornirea apache2 cu <command>apache2 -k start</command> nu mai este posibilă. Va trebui să folosiți <command>/etc/init.d/apache2</command> sau <command>apache2ctl</command>.
zh_tw: 現在 Apache 使用者、群組及 PidFile 都設定在 <filename>/etc/apache2/envvars</filename> 裡。如果您修改了這些設定而不是使用其預設值，您必須同時修改這個檔案。這也表示了，已無法使用 <command>apache2 -k start</command> 來啟動 apache2 了，您必須改用 <command>/etc/init.d/apache2</command> 或 <command>apache2ctl</command>。

source: The suexec helper program needed for mod_suexec is now shipped in a separate package, <systemitem role="package">apache2-suexec</systemitem>, which is not installed by default.
be: Дапаможная праграма suexec, якую патрабуе mod_suexec, зараз уключаная ў асобны пакет <systemitem role="package">apache2-suexec</systemitem>, які не ўсталёўваецца аўтаматычна.
it: Il programma di assistenza suexec, che è necessario per mod_suexec, è ora fornito in un pacchetto separato, <systemitem role="package">apache2-suexec</systemitem>, che non è installato in modalità predefinita.
ja: mod_suexec に必要な suexec ヘルパプログラムは、別のパッケージ <systemitem role="package">apache2-suexec</systemitem> として提供されます。これはデフォルトではインストールされません。
lt: Pagalbinė programa suexec, reikiama dėl mod_suexec, dabar tiekiama atskirame pakete <systemitem role="package">apache2-suexec</systemitem>, kuris nėra įdiegiamas pagal nutylėjimą.
nb: Hjelpeprogrammet suexec som trengs for mod_suexec er nå pakket i en egen pakke, <systemitem role="package">apache2-suexec</systemitem>, denne blir som standard ikke installert.
pt: O programa auxiliar suexec necessário para o mod_suexec é agora distribuído num pacote separado, <systemitem role="package">apache2-suexec</systemitem>, que não é instalado por omissão.
ro: Programul ajutător suexec necesar pentru mod_suexec acum este livrat într-un pachet separat, <systemitem role="package">apache2-suexec</systemitem>, care nu este instalat implicit.
zh_tw: mod_suexec 所需的 suexec 輔助程式已分離為一個獨立的套件，<systemitem role="package">apache2-suexec</systemitem>，但預設上不會安裝。

source: More module specific configuration has been moved from <filename>/etc/apache2/apache2.conf</filename> to <filename>/etc/apache2/mods-available/*.conf</filename>.
be: Большасць наладак, што датычыцца асобных модуляў, перанесеная ў файлы <filename>/etc/apache2/mods-available/*</filename> замест <filename>/etc/apache2/apache2.conf</filename>.
it: La configurazione più specifica per il modulo è stata spostata da <filename>/etc/apache2/apache2.conf</filename> a <filename>/etc/apache2/mods-available/*.conf</filename>.
ja: さらに多くのモジュール固有の設定が <filename>/etc/apache2/apache2.conf</filename> から <filename>/etc/apache2/mods-available/*.conf</filename> に移されました。
lt: Papildomi modulių nustatymai buvo perkelti iš failo <filename>/etc/apache2/apache2.conf</filename> į failą <filename>/etc/apache2/mods-available/*.conf</filename>.
nb: Modulspesifikke innstillinger har blitt flyttet fra <filename>/etc/apache2/apache2.conf</filename> til <filename>/etc/apache2/mods-available/*.conf</filename>.
pt: Mais configurações específicas dos módulos foram movidas do ficheiro <filename>/etc/apache2/apache2.conf</filename> para o <filename>/etc/apache2/mods-available/*.conf</filename>.
ro: Mai multe configurații specifica modulelor au fost mutate din <filename>/etc/apache2/apache2.conf</filename> în <filename>/etc/apache2/mods-available/*.conf</filename>.
zh_tw: 更多模組專屬的設定已由 <filename>/etc/apache2/apache2.conf</filename> 移至 <filename>/etc/apache2/mods-available/*.conf</filename> 了。

source: For more detailed information, see <filename>/usr/share/doc/apache2.2-common/NEWS.Debian.gz</filename> and <filename>/usr/share/doc/apache2.2-common/README.Debian.gz</filename>.
be: Больш інфармацыі можна атрымаць з файлаў <filename>/usr/share/doc/apache2.2-common/NEWS.Debian.gz</filename> ды <filename>/usr/share/doc/apache2.2-common/README.Debian.gz</filename>.
it: Per maggiori informazioni si consultino <filename>/usr/share/doc/apache2.2-common/NEWS.Debian.gz</filename> e <filename>/usr/share/doc/apache2.2-common/README.Debian.gz</filename>.
ja: 詳細な情報については、<filename>/usr/share/doc/apache2.2-common/NEWS.Debian.gz</filename> と <filename>/usr/share/doc/apache2.2-common/README.Debian.gz</filename> を参照してください。
lt: Daugiau informacijos rasite failuose <filename>/usr/share/doc/apache2.2-common/NEWS.Debian.gz</filename> ir <filename>/usr/share/doc/apache2.2-common/README.Debian.gz</filename>.
nb: For mer informasjon se <filename>/usr/share/doc/apache2.2-common/NEWS.Debian.gz</filename> og <filename>/usr/share/doc/apache2.2-common/README.Debian.gz</filename>.
pt: Para informações mais detalhadas, ver os ficheiros <filename>/usr/share/doc/apache2.2-common/NEWS.Debian.gz</filename> e <filename>/usr/share/doc/apache2.2-common/README.Debian.gz</filename>.
ro: Pentru informații mai detaliate vedeți <filename>/usr/share/doc/apache2.2-common/NEWS.Debian.gz</filename> și <filename>/usr/share/doc/apache2.2-common/README.Debian.gz</filename>.
zh_tw: 請參考 <filename>/usr/share/doc/apache2.2-common/NEWS.Debian.gz</filename> 及 <filename>/usr/share/doc/apache2.2-common/README.Debian.gz</filename> 以取得更詳盡資訊。

source: <acronym>NIS</acronym> and Network Manager
be: <acronym>NIS</acronym> ды праграма кіравання сецівам (Network Manager)
it: <acronym>NIS</acronym> e Network Manager
ja: NIS と Network Manager
lt: <acronym>NIS</acronym> ir tinklo menedžeris
nb: <acronym>NIS</acronym> og Network Manager
pt: <acronym>NIS</acronym> e Network Manager
ro: <acronym>NIS</acronym> și Network Manager

source: The version of <command>ypbind</command> included with <systemitem role="package">nis</systemitem> for &releasename; contains support for Network Manager. This support causes <command>ypbind</command> to disable <acronym>NIS</acronym> client functionality when Network Manager reports that the computer is disconnected from the network. Since Network Manager will usually report that the computer is disconnected when it is not in use, <acronym>NIS</acronym> users with <acronym>NIS</acronym> client systems should ensure that Network Manager support is disabled on those systems.
be: Версія праграмы <command>ypbind</command>, якая ўваходзіць у пакет <systemitem role="package">nis</systemitem> для &releasename; уключае падтрымку Network Manager. Адным з вынікаў гэтага з'яўляецца адключэнне функцыянальнасці кліента <acronym>NIS</acronym>, калі Network Manager паведамляе <command>ypbind</command>, што камп'ютэр адлучаны ад сеціва. З улікам таго, што такое паведамленне звычайна выдаецца Network Manager і ў выпадках прастою камп'ютэру цягам пэўнага часу, карыстальнікам кліенцкіх сістэмаў <acronym>NIS</acronym> варта адключыць падтрымку Network Manager.
it: La versione di <command>ypbind</command> inclusa in <systemitem role="package">nis</systemitem> per &releasename; contiene il supporto per Network Manager. Tale supporto fa sì che <command>ypbind</command> disabiliti la funzionalità del client <acronym>NIS</acronym> quando Network Manager riporta che il sistema è disconnesso dalla rete. Dal momento che Network Manager riporterà normalmente che il sistema è disconnesso quando non è in uso, gli utenti con sistemi client <acronym>NIS</acronym> dovrebbero accertarsi che su tali sistemi il supporto per Network Manager sia disabilitato.
ja: &releasename; の <systemitem role="package">nis</systemitem> に入っているバージョンの <command>ypbind</command> では、Network Manager のサポートが含まれています。このサポートによって、コンピュータがネットワークから切断されたという Network Manager の通知で、<command>ypbind</command> は <acronym>NIS</acronym> クライアントの機能を無効にします。Network Manager は、通常、コンピュータが使われていない場合に切断されたと通知するので、<acronym>NIS</acronym> クライアントシステムを使っている <acronym>NIS</acronym> ユーザは、これらのシステムに載っている Network Manager のサポートが無効になっているのを確認すべきです。
lt: Programos <command>ypbind</command>, esančios &releasename; laidos pakete <systemitem role="package">nis</systemitem>, versija palaiko tinklo menedžerį (Network Manager). Šis palaikymas priverčia programą <command>ypbind</command> išjungti <acronym>NIS</acronym> kliento funkcionalumą, jei tinklo menedžeris praneša, kad kompiuteris atjungtas nuo tinklo. Kadangi tinklo memedžeris paprastai praneša, kad kompiuteris yra atjungtas nuo tinklo, kai jis nenaudojamas, <acronym>NIS</acronym> naudotojai su <acronym>NIS</acronym> klientų sistemomis turi pasirūpinti, kad tinklo menedžeris būtų išjungtas šiose sistemose.
nb: Versjonen av <command>ypbind</command> som finnes i <systemitem role="package">nis</systemitem> i &releasename; inneholder støtte for Network Manager. Denne støtten for Network Manager innebærer at <command>ypbind</command> skrur av <acronym>NIS</acronym>-klientfunksjonalitet når Network Manager rapporterer at datamaskinen er uten nettverk. Siden Network Manager ofte rapporter at datamaskinen er uten nettverk når nettverket ikke brukes, så bør <acronym>NIS</acronym>-brukere med <acronym>NIS</acronym>-klientsystemer sørge for at støtten for Network Manager er skrudd av.
pt: A versão do <command>ypbind</command> incluída com o <systemitem role="package">nis</systemitem> na &releasename; tem suporte para o Network Manager. Este suporte faz com que o <command>ypbind</command> desactive a funcionalidade de cliente <acronym>NIS</acronym> quando o Network Manager relata que o computador está desligado da rede. Como o Network Manager costuma relatar esta situação quando o computador não está em uso, os utilizadores <acronym>NIS</acronym> com sistemas clientes de <acronym>NIS</acronym> devem certificar-se que o suporte para o Network Manager está desactivado nesses sistemas.
ro: Versiunea de <command>ypbind</command> inclusă cu <systemitem role="package">nis</systemitem> în &releasename; conține suport pentru Network Manager. Din această cauză <command>ypbind</command> va dezactiva funcționalitatea de client <acronym>NIS</acronym> atunci când Network Manager raportează că sistemul este deconectat de la rețea. Deoarece Network Manager va raporta că sistemul este deconectat atunci când nu este utilizat, utilizatorii <acronym>NIS</acronym> cu sisteme <acronym>NIS</acronym> client trebuie să se asigure că suportul pentru Network Manager este dezactivat pe acele sisteme.

source: This can be done by either uninstalling the <systemitem role="package">network-manager</systemitem> package, or editing <filename>/etc/default/nis</filename> to add <literal>-no-dbus</literal> to <literal>YPBINDARGS</literal>.
be: Гэта можна зрабіць або шляхам выдалення пакету <systemitem role="package">network-manager</systemitem>, альбо выправіўшы файл <filename>/etc/default/nis</filename> і дадаўшы параметр <literal>-no-dbus</literal> да паслядоўнасці сімвалаў <literal>YPBINDARGS</literal>.
it: Questo può essere fatto disinstallando il pacchetto <systemitem role="package">network-manager</systemitem> oppure modificando <filename>/etc/default/nis</filename> aggiungendo <literal>-no-dbus</literal> a <literal>YPBINDARGS</literal>.
ja: これは、<systemitem role="package">network-manager</systemitem> パッケージをアンインストールするか、<filename>/etc/default/nis</filename> を編集して、<literal>YPBINDARGS</literal> に <literal>-no-dbus</literal> を追加すれば済みます。
lt: Tam reikia arba pašalinti <systemitem role="package">network-manager</systemitem> paketą arba pataisyti failą <filename>/etc/default/nis</filename> pridedant <literal>-no-dbus</literal> prie <literal>YPBINDARGS</literal>.
nb: Dette kan gjøres enten ved å fjerne pakken <systemitem role="package">network-manager</systemitem>eller ved å redigere fila <filename>/etc/default/nis</filename> ved å legge til <literal>-no-dbus</literal> til <literal>YPBINDARGS</literal>.
pt: Isto pode ser feito desinstalando o pacote <systemitem role="package">network-manager</systemitem>, ou editando o <filename>/etc/default/nis</filename> e adicionar <literal>-no-dbus</literal> ao <literal>YPBINDARGS</literal>.
ro: Acest lucru se poate face fie prin dezinstalarea pachetului <systemitem role="package">network-manager</systemitem> fie prin modificarea <filename>/etc/default/nis</filename> pentru a adăuga <literal>-no-dbus</literal> la <literal>YPBINDARGS</literal>.
zh_tw: 方法是移除 <systemitem role="package">network-manager</systemitem> 套件，或修改 <filename>/etc/default/nis</filename> 將 <literal>-no-dbus</literal> 加入 <literal>YPBINDARGS</literal> 中。

source: The use of <literal>-no-dbus</literal> is the default for new installs of Debian, but was not the default in previous releases.
be: Выкарыстанне параметру <literal>-no-dbus</literal> для гэтых мэтаў з'яўляецца стандартнай наладкай для новых усталяванняў Debian, але ў папярэдніх выпусках такі падыход адсутнічаў.
it: L'utilizzo di <literal>-no-dbus</literal> è predefinito per le nuove installazioni di Debian, ma non lo era nei precedenti rilasci.
ja: 新規にインストールした Debian ではデフォルトで <literal>-no-dbus</literal> が使われますが、これまでのリリースではデフォルトではありませんでした。
lt: Įdiegiant Debian sistemą naujai, <literal>-no-dbus</literal> naudojimas yra numatytas, bet nebuvo numatytas ankstesnėse laidose.
nb: Bruken av <literal>-no-dbus</literal> er standard for nye installasjoner av Debian, men det var ikke slik i tidligere versjoner.
pt: A utilização de <literal>-no-dbus</literal> é o valor pré-definido para novas instalações da Debian, mas não o era em lançamentos anteriores.
ro: Folosirea <literal>-no-dbus</literal> este implictă la instalările Debian noi, dar nu era implicită în versiunile precedente.
zh_tw: 新安裝的 Debian 預設上會使用 <literal>-no-dbus</literal>，但這並不是之前的釋出版的預設值。

source: <acronym>LDAP</acronym> support
de: <acronym>LDAP</acronym>-Unterstützung
fr: Prise en charge <acronym>LDAP</acronym>
it: Supporto <acronym>LDAP</acronym>
ja: <acronym>LDAP</acronym> サポート
pl: Obsługa <acronym>LDAP</acronym>
pt: suporte a <acronym>LDAP</acronym>
pt_br: Suporte <acronym>LDAP</acronym>
ru: Поддержка <acronym>LDAP</acronym>
sv: <acronym>LDAP</acronym>-stöd

source: A feature in the cryptography libraries used in the <acronym>LDAP</acronym> libraries causes programs that use <acronym>LDAP</acronym> and attempt to change their effective privileges to fail when connecting to an <acronym>LDAP</acronym> server using <acronym>TLS</acronym> or <acronym>SSL</acronym>. This can cause problems for suid programs on systems using <systemitem role="package">libnss-ldap</systemitem> like <command>sudo</command>, <command>su</command> or <command>schroot</command> and for suid programs that perform LDAP searches like <systemitem role ="package">sudo-ldap</systemitem>.
de: Eine Funktionalität in den Kryptographie-Bibliotheken, die von den <acronym>LDAP</acronym>-Bibliotheken genutzt werden, führt dazu, dass Programme, die <acronym>LDAP</acronym> verwenden und versuchen, ihre wirksamen Privilegien zu ändern, beim Verbindungsaufbau zur einem <acronym>LDAP</acronym>-Server fehlschlagen, wenn der Server <acronym>TLS</acronym> oder <acronym>SSL</acronym> nutzt. Dies kann Probleme für suid-Programme verursachen, die <systemitem role="package">libnss-ldap</systemitem> verwenden, wie zum Beispiel <command>sudo</command>, <command>su</command> oder <command>schroot</command>. Außerdem können auch Programme Probleme bekommen, die LDAP-Suchvorgänge durchführen, wie <systemitem role ="package">sudo-ldap</systemitem>.
it: Una funzionalità nelle librerie crittografiche usate dalle librerie <acronym>LDAP</acronym> impedisce ai programmi che usano <acronym>LDAP</acronym> di modificare i propri privilegi quando sono connessi a un server <acronym>LDAP</acronym> con <acronym>TLS</acronym> o <acronym>SSL</acronym>. Questo può creare problemi su sistemi con <systemitem role="package">libnss-ldap</systemitem> per i programmi suid quali <command>sudo</command>, <command>su</command> o <command>schroot</command> e per i programmi che fanno ricerche LDAP quali <systemitem role ="package">sudo-ldap</systemitem>.
ja: <acronym>LDAP</acronym> ライブラリ中で使われている暗号化ライブラリの機能は、<acronym>TLS</acronym> や <acronym>SSL</acronym> を使っている <acronym>LDAP</acronym> サーバに接続する際に、<acronym>LDAP</acronym> を使っていて有効になっている特権を変更しようとするプログラムの接続障害を引き起こします。<command>sudo</command>、<command>su</command>、<command>schroot</command> のような <systemitem role="package">libnss-ldap</systemitem> を使っているシステムや、<systemitem role ="package">sudo-ldap</systemitem> のような LDAP 検索を実行する suid プログラムに問題が発生します。
pt: Uma característica das bibliotecas criptográficas usadas nas bibliotecas <acronym>LDAP</acronym> provoca uma falha quando programas que usam <acronym>LDAP</acronym> tentam mudar os privilégios efectivos ao ligar-se a um servidor <acronym>LDAP</acronym> usando <acronym>TLS</acronym> ou <acronym>SSL</acronym>. Isto pode causar problemas a programas suid em sistemas que usem <systemitem role="package">libnss-ldap</systemitem> como <command>sudo</command>, <command>su</command> ou <command>schroot</command> e para programas suid que executem pesquisas LDAP como <systemitem role ="package">sudo-ldap</systemitem>.
ru: Особенность в криптографических библиотеках, используемая в библиотеках <acronym>LDAP</acronym>, приводит к тому, что программы, использующие <acronym>LDAP</acronym> и пытающиеся изменить их эффективные привилегии, не могут соединиться с сервером <acronym>LDAP</acronym> с помощью <acronym>TLS</acronym> или <acronym>SSL</acronym>. Это может привести к проблемам с suid-программами в системах, использующими <systemitem role="package">libnss-ldap</systemitem>, наподобие <command>sudo</command>, <command>su</command> или <command>schroot</command> и с suid-программами, которые выполняют поиск в LDAP, наподобие <systemitem role ="package">sudo-ldap</systemitem>.
sv: En funktion i de kryptografiska biblioteken i <acronym>LDAP</acronym>-biblioteken gör att program som använder <acronym>LDAP</acronym> och försöker ändra sina privilegier misslyckas med att ansluta till en <acronym>LDAP</acronym>-server med <acronym>TLS</acronym> eller <acronym>SSL</acronym>. Detta kan orsaka problem för suid-program på system som använder <systemitem role="package">libnss-ldap</systemitem> såsom <command>sudo</command>, <command>su</command> eller <command>schroot</command> och för suid-program som gör LDAP-sökningar likt <systemitem role ="package">sudo-ldap</systemitem>.

source: It is recommended to replace the <systemitem role="package">libnss-ldap</systemitem> package with <systemitem role="package">libnss-ldapd</systemitem>, a newer library which uses separate daemon (<command>nslcd</command>) for all <acronym>LDAP</acronym> lookups. The replacement for <systemitem role="package">libpam-ldap</systemitem> is <systemitem role="package">libpam-ldapd</systemitem>.
de: Es wird empfohlen, das Paket <systemitem role="package">libnss-ldap</systemitem> durch <systemitem role="package">libnss-ldapd</systemitem> zu ersetzen, einer neuen Bibliothek, die einen separaten Daemon (<command>nslcd</command>) für alle Suchanfragen verwendet. Der Ersatz für <systemitem role="package">libpam-ldap</systemitem> ist <systemitem role="package">libpam-ldapd</systemitem>.
it: È raccomandato sostituire il pacchetto <systemitem role="package">libnss-ldap</systemitem> con <systemitem role="package">libnss-ldapd</systemitem>, una nuova libreria che utilizza un demone separato (<command>nslcd</command>) per tutte le ricerche <acronym>LDAP</acronym>. Il sostituto di <systemitem role="package">libpam-ldap</systemitem> è <systemitem role="package">libpam-ldapd</systemitem>.
ja: <systemitem role="package">libnss-ldap</systemitem> パッケージを、すべての <acronym>LDAP</acronym> 検索に分割されたデーモン (<command>nslcd</command>) を使っている新しいライブラリである <systemitem role="package">libnss-ldapd</systemitem> に置き換えることをお勧めします。<systemitem role="package">libpam-ldap</systemitem> の代替品は <systemitem role="package">libpam-ldapd</systemitem> です。
pt: Recomenda-se substituir o pacote <systemitem role="package">libnss-ldap</systemitem> com o <systemitem role="package">libnss-ldapd</systemitem>, uma nova biblioteca que usa um daemon separado (<command>nslcd</command>) para todas as pesquisas <acronym>LDAP</acronym>. O substituto para o <systemitem role="package">libpam-ldap</systemitem> é <systemitem role="package">libpam-ldapd</systemitem>.
ru: Рекомендуется заменить пакет <systemitem role="package">libnss-ldap</systemitem>на <systemitem role="package">libnss-ldapd</systemitem>, более новую библиотеку, которая использует отдельную службу (<command>nslcd</command>) для всех поисков <acronym>LDAP</acronym>. Заменой для <systemitem role="package">libpam-ldap</systemitem> является <systemitem role="package">libpam-ldapd</systemitem>.
sv: Rekommendationen är att ersätta paketet <systemitem role="package">libnss-ldap</systemitem> med <systemitem role="package">libnss-ldapd</systemitem>, ett nyare bibliotek som använder separata tjänster (<command>nslcd</command>) för alla <acronym>LDAP</acronym>-uppslagningar. Ersättningspaket för <systemitem role="package">libpam-ldap</systemitem> är <systemitem role="package">libpam-ldapd</systemitem>.
