Repository: lurdan/trans-ddp
Catalog: release-notes/*/issues.po
Languages: be, de, fr, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sv, zh_tw

source: ConsoleKit in &debian; &release; does not consider sessions started using <command>startx</command> or display managers lacking <systemitem role="package">consolekit</systemitem> integration (e.g. <systemitem role="package">xdm</systemitem> or <systemitem role="package">slim</systemitem>) as local, which might prevent access to some devices.
fr: ConsoleKit dans &debian; &release; ne considère pas comme locales les sessions lancées avec <command>startx</command> ou les gestionnaires d'écran de connexion n'intégrant pas <systemitem role="package">consolekit</systemitem> (par exemple, <systemitem role="package">xdm</systemitem> ou <systemitem role="package">slim</systemitem>), ce qui pourrait empêcher l'accès à certains périphériques.
pl: ConsoleKit w dystrybucji &debian; &release; nie traktuje sesji rozpoczętych poleceniem <command>startx</command> lub menedżerami niezintegrowanymi z <systemitem role="package">consolekit</systemitem> (np. <systemitem role="package">xdm</systemitem> i <systemitem role="package">slim</systemitem>) jako lokalnych, co może uniemożliwiać dostęp do pewnych urządzeń.
pt_br: O ConsoleKit no &debian; &release; não considera sessões iniciadas usando <command>startx</command> ou gerenciadores de tela sem integração com o <systemitem role="package">consolekit</systemitem> (por exemplo, <systemitem role="package">xdm</systemitem> ou <systemitem role="package">slim</systemitem>) de modo local, o que pode impedir o acesso a alguns dispositivos.
ru: ConsoleKit в &debian; &release; не считает сеансы, запущенные с помощью <command>startx</command> или экранных менеджеров без поддержки <systemitem role="package">consolekit</systemitem> (например, <systemitem role="package">xdm</systemitem> или <systemitem role="package">slim</systemitem>) локальными, что может привести отказу в доступе к некоторым устройствам.

source: We recommend using one of <systemitem role="package">gdm3</systemitem>, <systemitem role="package">kdm</systemitem> or <systemitem role="package">lightdm</systemitem> instead.
fr: Nous recommandons d'utiliser <systemitem role="package">gdm3</systemitem>, <systemitem role="package">kdm</systemitem> ou <systemitem role="package">lightdm</systemitem> à la place.
pl: Zaleca się korzystanie z programów <systemitem role="package">gdm3</systemitem>, <systemitem role="package">kdm</systemitem> lub <systemitem role="package">lightdm</systemitem>.
pt_br: Nós recomendamos o uso do <systemitem role="package">gdm3</systemitem>, <systemitem role="package">kdm</systemitem> ou <systemitem role="package">lightdm</systemitem> ao invés disso.
ru: Мы рекомендуем использовать <systemitem role="package">gdm3</systemitem>, <systemitem role="package">kdm</systemitem> или <systemitem role="package">lightdm</systemitem>.

source: By default, some accessibility tools are not enabled in the GNOME display manager (<systemitem role="package">gdm3</systemitem>). The simplest way to enable zooming or a visual keyboard is to activate the <quote>shell</quote> greeter.
fr: Par défaut, certains outils d'accessibilité sont désactivés dans le gestionnaire d'écran de connexion GNOME (<systemitem role="package">gdm3</systemitem>). Pour activer le zoom ou un clavier visuel, le plus simple est d'activer le dispositif d'accueil <quote>shell</quote>.
pl: Domyślnie, większość narzędzi związanych z dostępnością nie zostało włączonych w menedżerze logowania GNOME (<systemitem role="package">gdm3</systemitem>). Najprostszą metodą aktywowania lupy lub klawiatury ekranowej jest włączenie ekranu logowania <quote>shell</quote>.
pt_br: Por padrão, algumas ferramentas de acessibilidade não são habilitadas no gerenciador de tela do GNOME (<systemitem role=\"package\">gdm3</systemitem>). A forma mais simples de habilitar a ampliação ou um teclado visual é ativar o recepcionista (<quote>greeter</quote>) do <quote>shell</quote>.

source: To do that, edit the <filename>/etc/gdm3/greeter.gsettings</filename> file, and uncomment the following:
fr: Pour ce faire, modifiez le fichier <filename>/etc/gdm3/greeter.gsettings </filename> et décommentez les lignes suivantes :
pl: Aby to osiągnąć, należy edytować plik <filename>/etc/gdm3/greeter.gsettings</filename>, odkomentowując wiersz:
pt_br: Para fazer isso, edite o arquivo <filename>/etc/gdm3/greeter.gsettings</filename> e descomente o seguinte:
ru: Для этого измените файл <filename>/etc/gdm3/greeter.gsettings</filename>, удалив комментарий со строки:
sv: För att göra detta justera filen <filename>/etc/gdm3/greeter.gsettings</filename> genom att ta bort kommentarsmaerkingen för:

source: while commenting
fr: tout en commentant
pl: i zakomentowując
pt_br: enquanto comenta
ru: и закомментировав строку
sv: och lägga till en kommentarsmarkering vid

source: Note that it requires a compatible 3D graphics card — which is the reason why it is not enabled by default.
fr: Veuillez noter qu'une carte 3D compatible est nécessaire − c'est la raison de la désactivation par défaut.
pl: Proszę wziąć pod uwagę, że wymaga to kompatybilnej w trybie 3D karty graficznej, co jest także powodem, dla którego opcja nie została włączona domyślnie.
pt_br: Note que isso requer uma placa gráfica 3D compatível — que é a razão pela qual isso não é habilitado por padrão.
ru: Заметим, что для работы потребуется графическая карта с поддержкой 3D (эта причина, по которой данная настройка по умолчанию выключена).
sv: Observera att detta kräver ett kompatibelt grafikkort som klarar 3D &mdash; vilket är anledningen att det inte aktiverat som standard.

source: KDE desktop changes
fr: Modifications du bureau KDE
pl: Zmiany w środowisku KDE
pt_br: Mudanças na área de trabalho KDE

source: The <systemitem role="package">knetworkmanager</systemitem> package has been deprecated, and replaced by <systemitem role="package">plama-widget-networkmanagement</systemitem> in the new KDE Plasma Workspace.
fr: Le paquet <systemitem role="package">knetworkmanager</systemitem> a été déprécié et remplacé par <systemitem role="package">plasma-widget-networkmanagement</systemitem> dans le nouvel espace de travail KDE Plasma.

source: If you are using the deprecated <command>knetworkmanager</command> standalone application, you should be prepared to do some manual configuration after the upgrade. You might need to manually add plasma-widget-networkmanagement to your panel or desktop.
fr: Si vous utilisez l'application autonome <command>knetworkmanager</command> dépréciée, vous devriez vous préparer à faire un peu de configuration manuelle après la mise à niveau. Vous pourriez avoir besoin d'ajouter manuellement plasma-widget-networkmanagement à votre panneau ou bureau.
pl: Przy używaniu przestarzałej aplikacji <command>knetworkmanager</command> należy być przygotowanym na konieczność częściowo ręcznej konfiguracji. Może nastąpić potrzeba ręcznego dodania plasma-widget-networkmanagement do paneli lub pulpitu.

source: Also, if the network connection shouldn't depend on having a network-manager widget running, you might want to set it as a <quote>system connection</quote>.
fr: De plus, si la connexion réseau ne doit pas dépendre du fait que network-manager tourne, vous pourriez vouloir le régler en tant que <quote>connexion système</quote>.
pl: Jeśli połączenie sieciowe nie powinno zależeć od działania widżetu network-manager to należy ustawić je jako <quote>połączenie systemowe</quote>.
pt_br: Além disso, se a conexão de rede não depender de ter um widget do network-manager em execução, você pode querer defini-la como uma <quote>conexão de sistema</quote>.

source: <command>NetworkManager</command> can detect if a network interface is managed by <command>ifupdown</command> in order to avoid conflicts, but is not able to do so with other network management programs such as <command>wicd-daemon</command>. Problems and unexpected behavior can result if two such daemons are managing the same interface when attempting to make a network connection.
fr: <command>NetworkManager</command> peut détecter si une interface réseau est gérée par <command>ifupdown</command> afin d'éviter les conflits, mais n'est pas capable d'en faire autant avec les autres programmes de gestion du réseau tels que <command>wicd-daemon</command>. Des problèmes et des comportements inattendus peuvent avoir lieu si deux démons gèrent la même interface lors d'une tentative de connexion réseau.
pl: Polecenie <command>NetworkManager</command> może wykryć sytuację gdy interfejs sieciowy jest zarządzany przez <command>ifupdown</command> w celu uniknięcia konfliktów. Nie stanie się to przy korzystaniu z programów takich jak <command>wicd-daemon</command>. Jeśli dwa demony zarządzają tym samym interfejsem sieciowym i spróbują połączyć się z siecią to można się spodziewać różnych problemów.
pt_br: O <command>NetworkManager</command> pode detectar se uma interface de rede é gerenciada pelo <command>ifupdown</command> a fim de evitar conflitos, mas não é capaz de fazer isso com outros programas de gerenciamento de rede tais como <command>wicd-daemon</command>. Problemas e comportamento inesperado podem ocorrer se dois desses daemons estiverem gerenciando a mesma interface ao tentar fazer uma conexão de rede.

source: For instance, if <command>wicd-daemon</command> and <command>NetworkManager</command> are both running, attempting to use a <command>wicd</command> client to make a connection will fail with the error message:
fr: Par exemple, si <command>wicd-daemon</command> et <command>NetworkManager</command> sont tous les deux lancés, tenter d'utiliser le client <command>wicd</command> pour établir une connexion échouera avec le message d'erreur :
pl: Na przykład, jeśli działają <command>wicd-daemon</command> i <command>NetworkManager</command> to próba skorzystania z klienta <command>wicd</command> do nawiązania połączenia zakończy się następującym błędem:
pt_br: Por exemplo, se o <command>wicd-daemon</command> e o <command>NetworkManager</command> estiverem ambos em execução, ao tentar usar um cliente <command>wicd</command> para fazer uma conexão, falhará com a mensagem de erro:
ru: Например, если <command>wicd-daemon</command> и <command>NetworkManager</command> работают одновременно, попытка использования клиента <command>wicd</command> для подключения к сети приведёт к ошибке:
sv: Exempelvis om både <command>wicd-daemon</command> och <command>NetworkManager</command> körs kommer försök att köra en <command>wicd</command>-klient för att skapa en anslutning inte fungera och ett felmeddelande likt följande visas:

source: Connection Failed: bad password
fr: Échec de la connexion : mot de passe erroné
pt_br: Falha na conexão: senha incorreta
sv: Anslutning misslyckades: fel lösenord

source: Attempting to use a <command>NetworkManager</command> client may likewise fail with the message:
fr: Tenter d'utiliser un client <command>NetworkManager</command> devrait également échouer avec le message :
pl: Próba użycia klienta <command>NetworkManager</command> może zakończyć się następującym komunikatem:
pt_br: Ao tentar usar um cliente <command>NetworkManager</command> pode igualmente falhar com a mensagem:
ru: В свою очередь, использование клиента <command>NetworkManager</command> завершится с ошибкой:
sv: Försök att använda <command>NetworkManager</command>-klient kommer på samma sätt misslyckas med felmeddelandet:

source: NetworkManager is not running. Please start it.
fr: NetworkManager n'est pas lancé. Veuillez le démarrer.
pt_br: O NetworkManager não está sendo executado. Por favor, inicie-o.
sv: NetworkManager körs inte. Vänligen starta det.

source: It is recommended that users of GNOME consider installing and trying <command>NetworkManager</command>, but the <command>NetworkManager</command> daemon may be permanently disabled if desired using the following command:
fr: Il est recommandé aux utilisateurs de GNOME d'installer et d'essayer <command>NetworkManager</command> mais, s'ils le souhaitent, le démon <command>NetworkManager</command> peut être désactivé de façon permanente grâce à la commande suivante :
pl: Użytkownikom GNOME zaleca się zainstalowanie i używanie programu <command>NetworkManager</command>. W razie potrzeby demon <command>NetworkManager</command> można wyłączyć na stałe poleceniem:
pt_br: É recomendado que os usuários do GNOME considerem instalar e experimentar o <command>NetworkManager</command> mas, se desejado, o deamon do <command>NetworkManager</command> pode ser permanentemente desabilitado usado o seguinte comando:

source: After disabling the daemon, it is recommended to examine the contents of <filename>/etc/resolv.conf</filename>. This file is used to specify DNS servers for name resolution and the contents of this file may have been replaced by <command>NetworkManager</command>.
fr: Après avoir désactivé le démon, il est recommandé d'examiner le contenu de <filename>/etc/resolv.conf</filename>. Ce fichier est utilisé pour indiquer les serveurs DNS pour la résolution de noms et le contenu de ce fichier pourrait avoir été remplacé par <command>NetworkManager</command>.
pl: Po wyłączeniu demona zaleca się sprawdzenie zawartości pliku <filename>/etc/resolv.conf</filename>. Służy on do określenia serwerów DNS (odpowiadających za tłumaczenie nazw domenowych), a jego zawartość mogła zostać zastąpiona przez <command>NetworkManager</command>.
pt_br: Após desabilitar o daemon, é recomendado examinar o conteúdo do <filename>/etc/resolv.conf</filename>. Esse arquivo é usado para especificar os servidores de DNS para resolução de nomes e o conteúdo desse arquivo pode ter sido substituído pelo <command>NetworkManager</command>.
ru: После выключения службы рекомендуется проверить содержимое файла <filename>/etc/resolv.conf</filename>. Данный файл используется для указания серверов DNS и его данные могут меняться <command>NetworkManager</command>.
sv: När tjänsten har avaktiverats bör filen <filename>/etc/resolv.conf</filename> justeras. Filen används för att ange vilka DNS-servrar som ska användas för namnuppslagning och innehållet kan ha ersatts av <command>NetworkManager</command>.

source: <package>perl-suid</package> removed
de: <package>perl-suid</package> entfernt
fr: <package>perl-suid</package> supprimé
pl: Usunięty pakiet <package>perl-suid</package>
pt_br: <package>perl-suid</package> removido
ru: Удалён пакет <package>perl-suid</package>
sv: <package>perl-suid</package> borttaget

source: <command>suidperl</command> was removed upstream with 5.12, so the <systemitem role="package">perl-suid</systemitem> package which used to be distributed in Debian has been removed too. Possible alternatives include using a simple setuid C wrapper to execute a Perl script from a hard-coded location, or using a more general tool like <command>sudo</command>.
fr: <command>suidperl</command> a été retiré en amont avec la version 5.12. Le paquet <systemitem role="package">perl-suid</systemitem> qui était fourni dans Debian a donc été retiré également. Les solutions de remplacement incluent l'utilisation d'une simple encapsulation (« wrapper ») setuid en langage C pour exécuter un script Perl depuis un emplacement écrit en dur, ou un outil plus général tel que <command>sudo</command>.
pl: Polecenie <command>suidperl</command> zostało usunięte w projekcie macierzystym w wersji 5.12, tak więc usunięto również pakiet <systemitem role="package">perl-suid</systemitem>, dystrybuowany dotychczas w Debianie. Dostępne alternatywy obejmują proste opakowanie setuid C do wykonania skryptu Perla, z położenia zapisanego na stałe lub ogólniejsze narzędzie, takie jak <command>sudo</command>.
pt_br: O <command>suidperl</command> foi removido do upstream com a versão 5.12, então o pacote <systemitem role="package">perl-suid</systemitem> que costumava ser distribuído no Debian também foi removido. As possíveis alternativas incluem o uso de um invólucro ("wrapper") simples setuid em linguagem C para executar um script em Perl a partir de uma localização definida no código, ou usar uma ferramenta mais genérica, como o <command>sudo</command>.

source: Request Tracker versions
de: Request Tracker-Versionen
fr: Versions de Request Tracker
pl: Wersje Request Tracker
pt_br: Versões de Request Tracker
ru: Версии Request Tracker
sv: Request Tracker-versioner

source: If you have <systemitem role="package">request-tracker3.8</systemitem> installed on your squeeze system, note that this package has been removed from wheezy, to be replaced by <systemitem role="package">request-tracker4</systemitem>. Some manual steps are required to upgrade between <systemitem role="package">request-tracker3.8</systemitem> and <systemitem role="package">request-tracker4</systemitem>: please install <systemitem role="package">request-tracker4</systemitem> alongside your existing <systemitem role="package">request-tracker3.8</systemitem> installation and consult the installation/upgrade notes in <filename>/usr/share/doc/request-tracker4/README.Debian.gz</filename> (section: <quote>Upgrading from request-tracker3.8 to request-tracker4</quote>).
de: Wenn Sie <systemitem role="package">request-tracker3.8</systemitem> auf Ihrem Squeeze-System installiert haben, beachten Sie, dass dieses Paket aus Wheezy entfernt wurde, um durch <systemitem role="package">request-tracker4</systemitem> ersetzt zu werden. Es sind einige manuelle Schritte erforderlich, um von <systemitem role="package">request-tracker3.8</systemitem> auf <systemitem role="package">request-tracker4</systemitem> zu aktualisieren: bitte installieren Sie <systemitem role="package">request-tracker4</systemitem> parallel zu Ihrer <systemitem role="package">request-tracker3.8</systemitem>-Installation und konsultieren Sie die Installations-/Upgrade-Hinweise in <filename>/usr/share/doc/request-tracker4/README.Debian.gz</filename> (Abschnitt <quote>Upgrading from request-tracker3.8 to request-tracker4</quote>).
fr: Si vous avez <systemitem role="package">request-tracker3.8</systemitem> sur votre système Squeeze, veuillez noter que ce paquet a été supprimé de Wheezy pour être remplacé par <systemitem role="package">request-tracker4</systemitem>. Quelques étapes doivent être accomplies manuellement pour faire la mise à niveau de <systemitem role="package">request-tracker3.8</systemitem> vers <systemitem role="package">request-tracker4</systemitem> : veuillez installer <systemitem role="package">request-tracker4</systemitem> en parallèle de votre installation actuelle de <systemitem role="package">request-tracker3.8</systemitem> et consulter les notes d'installation et mise à niveau dans <filename>/usr/share/doc/request-tracker4/README.Debian.gz</filename> (section <quote>Mettre à niveau de request-tracker3.8 vers request-tracker4</quote> [NdT: nommé <quote>Upgrading from request-tracker3.8 to request-tracker4</quote> dans la note d'installation]).
pl: Jeśli w wydaniu squeeze ma się zainstalowany pakiet <systemitem role="package">request-tracker3.8</systemitem> to proszę zwrócić uwagę, że nie ma go już w wheezym, ponieważ został zastąpiony przez <systemitem role="package">request-tracker4</systemitem>. Konieczne jest wykonanie kilku czynności przed aktualizacją z <systemitem role="package">request-tracker3.8</systemitem> do <systemitem role="package">request-tracker4</systemitem>. Proszę najpierw doinstalować <systemitem role="package">request-tracker4</systemitem> do istniejącego pakietu <systemitem role="package">request-tracker3.8</systemitem> i zapoznać się z (angielskimi) uwagami na temat instalacji/aktualizacji z pliku <filename>/usr/share/doc/request-tracker4/README.Debian.gz</filename> (rozdział: <quote>Upgrading from request-tracker3.8 to request-tracker4</quote>).
pt_br: Se você tiver o <systemitem role="package">request-tracker3.8</systemitem> instalado no seu sistema squeeze, note que esse pacote foi removido do wheezy, para ser substituído pelo <systemitem role="package">request-tracker4</systemitem>. Algumas etapas manuais são necessárias para atualizar entre o <systemitem role="package">request-tracker3.8</systemitem> e <systemitem role="package">request-tracker4</systemitem>: por favor, instale o <systemitem role="package">request-tracker4</systemitem> juntamente com a sua instalação existente do <systemitem role="package">request-tracker3.8</systemitem> e consulte as notas de instalação/atualização em <filename>/usr/share/doc/request-tracker4/README.Debian.gz</filename> (seção: <quote>Atualizando do request-tracker3.8 para request-tracker4</quote>).
ru: Если у вас установлен <systemitem role="package">request-tracker3.8</systemitem> в squeeze, то обратите внимание, что этот пакета был удалён из wheezy; он заменяется на <systemitem role="package">request-tracker4</systemitem>. При обновлении с <systemitem role="package">request-tracker3.8</systemitem> на <systemitem role="package">request-tracker4</systemitem> требуется выполнить несколько действий вручную: установите <systemitem role="package">request-tracker4</systemitem> рядом с существующей установкой <systemitem role="package">request-tracker3.8</systemitem> и прочитайте заметки по установке/обновлению из файла <filename>/usr/share/doc/request-tracker4/README.Debian.gz</filename> (раздел: <quote>Upgrading from request-tracker3.8 to request-tracker4</quote>).
sv: Om du har paketet <systemitem role="package">request-tracker3.8</systemitem> installerat på ditt squeeze-system, kom ihåg att detta paket har tagits bort från wheezy och ersatts med <systemitem role="package">request-tracker4</systemitem>. Vissa manuella steg krävs för att uppgradera mellan <systemitem role="package">request-tracker3.8</systemitem> och <systemitem role="package">request-tracker4</systemitem>: installera <systemitem role="package">request-tracker4</systemitem> brevid din nuvarande installation av <systemitem role="package">request-tracker3.8</systemitem> och läs installations- och uppgraderingsinstruktionen i <filename>/usr/share/doc/request-tracker4/README.Debian.gz</filename> (sektion: <quote>Upgrading from request-tracker3.8 to request-tracker4</quote>).

source: The same advice applies if you have <systemitem role="package">request-tracker3.6</systemitem> or older packages from previous Debian releases still in use; if this is the case it is recommended to upgrade step by step, following the appropriate upgrade documents.
fr: Le même conseil s'applique si vous avez <systemitem role="package">request-tracker3.6</systemitem> ou d'autres paquets plus anciens venant de plus anciennes versions de Debian toujours utilisées : dans ce cas, il est recommandé de mettre à niveau étape par étape, en suivant les documents de mise à niveau appropriés.
pl: To samo tyczy się użytkowników korzystających z <systemitem role="package">request-tracker3.6</systemitem> lub jeszcze starszych pakietów, z poprzednich wydań Debiana; w takich przypadkach zaleca się stopniową aktualizację do poszczególnych wersji, zgodnie z kolejnymi instrukcjami aktualizacji.
pt_br: O mesmo aviso se aplica se você tiver o <systemitem role="package">request-tracker3.6</systemitem> ou pacotes mais antigos de versões anteriores do Debian ainda em uso; se esse for o caso, é recomendado atualizar passo a passo, seguindo os documentos apropriados de atualização.

source: Bootlogd changes
de: Änderungen an Bootlogd
fr: Changements de Bootlogd
pl: Zmiany bootlogd
pt_br: Mudanças do Bootlogd
ru: Изменения в bootlogd
sv: Ändringar för bootlogd
