Repository: lurdan/trans-ddp
Catalog: release-notes/*/issues.po
Languages: be, de, fr, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sv, zh_tw

source: Support for old-style userspace mode setting is discontinued in the <literal>intel</literal> X driver, which requires a recent kernel. Users of custom kernels should make sure that their configuration includes <literal>CONFIG_DRM_I915_KMS=y</literal>.
it: Il supporto per vecchio il Mode Setting in spazio utente nel driver X <literal>intel</literal> è stato soppresso, quindi è necessario un kernel recente. Gli utenti che hanno un kernel personalizzato devono assicurarsi che la propria configurazione contenga <literal>CONFIG_DRM_I915_KMS=y</literal>.
ja: <literal>intel</literal> X ドライバでは、旧式のユーザ空間モード設定は廃止されており、最近のカーネルが必要になります。カスタムカーネルのユーザは、設定に <literal>CONFIG_DRM_I915_KMS=y</literal> が含まれているのを確認する必要があります。
pt: O suporte para definições de modo no espaço do utilizador, à antiga, está descontinuado no driver X <literal>intel</literal>, que requer um kernel recente. Os utilizadores de kernels personalizados devem certificar-se que a sua configuração inclui <literal>CONFIG_DRM_I915_KMS=y</literal>.

source: Input device hotplug
it: Collegamento a caldo dei dispositivi di input
ja: 入力デバイスのホットプラグ対応
pt: Hotplug de dispositivos de entrada

source: The Xorg X server included in Debian &release; provides improved support for hotplugging of input devices (mice, keyboards, tablets, …). The old <systemitem role="package">xserver-xorg-input-kbd</systemitem> and <systemitem role="package">xserver-xorg-input-mouse</systemitem> packages are replaced by <systemitem role="package">xserver-xorg-input-evdev</systemitem>, which requires a kernel with the <literal>CONFIG_INPUT_EVDEV</literal> option enabled. Additionally, some of the keycodes produced by this driver differ from those traditionally associated with the same keys. Users of programs like <command>xmodmap</command> and <command>xbindkeys</command> will need to adjust their configurations for the new keycodes.
it: Il server X Xorg incluso in Debian &release; fornisce un miglior supporto per l'inserimento a caldo dei dispositivi di input (mouse, tastiere, tavolette grafiche, ecc.). I vecchi pacchetti <systemitem role="package">xserver-xorg-input-kbd</systemitem> e <systemitem role="package">xserver-xorg-input-mouse</systemitem> sono stati sostituiti da <systemitem role="package">xserver-xorg-input-evdev</systemitem>, il quale richiede che il kernel abbia l'opzione <literal>CONFIG_INPUT_EVDEV</literal> attiva. Inoltre alcuni codici dei tasti prodotti da questo driver sono diversi da quelli tradizionalmente associati agli stessi tasti. Gli utenti di programmi come <command>xmodmap</command> e <command>xbindkeys</command> dovranno adattare la loro configurazione ai nuovi codici dei tasti.
ja: Debian &release; の Xorg X サーバは、入力デバイス (マウス、キーボード、タブレットなど) のホットプラグのサポートが改善されています。古い <systemitem role="package">xserver-xorg-input-kbd</systemitem> および <systemitem role="package">xserver-xorg-input-mouse</systemitem> パッケージは、<systemitem role="package">xserver-xorg-input-evdev</systemitem> によって置き換えられました。このパッケージは、<literal>CONFIG_INPUT_EVDEV</literal> オプションが有効になったカーネルを必要とします。さらに、このドライバが提供するキーコードの一部は、それまで同じキーが対応していたのとは異なるものがあります。<command>xmodmap</command> や <command>xbindkeys</command> などのプログラムのユーザは、新しいキーコードに設定を調整する必要があるでしょう。
pt: O servidor X incluído no Debian &release; oferece suporte melhorado para ligar e desligar 'a quente' de dispositivos de entrada (ratos, teclados, tablets, …). Os antigos pacotes <systemitem role="package">xserver-xorg-input-kbd</systemitem> e <systemitem role="package">xserver-xorg-input-mouse</systemitem> são substituídos pelo pacote <systemitem role="package">xserver-xorg-input-evdev</systemitem>, que requer um kernel com a opção <literal>CONFIG_INPUT_EVDEV</literal> activada. Além disso, alguns dos códigos de teclado produzidos com este driver diferem dos que são tradicionalmente associados às mesmas teclas. Utilizadores de programas como <command>xmodmap</command> e <command>xbindkeys</command> terão que ajustar as suas configurações para os novos códigos de teclado.

source: X server <quote>zapping</quote>
it: <quote>Abbattere</quote> il server X
ja: X server の <quote>停止方法</quote>
pt: <quote>zapping</quote> do servidor X

source: Traditionally, the <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Backspace</keycap></keycombo> combination would kill the X server. This combination is no longer active by default, but can be re-enabled by reconfiguring the <systemitem role="package">keyboard-configuration</systemitem> package (system-wide), or using your desktop environment's keyboard preferences application.
it: Storicamente la combinazione di tasti <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Backspace</keycap></keycombo> chiude bruscamente il server X. Adesso, con la configurazione predefinita, tale combinazione non è più attiva però è possibile riattivarla riconfigurando il pacchetto <systemitem role="package">keyboard-configuration</systemitem> (per tutto il sistema) oppure usando l'applicazione per le preferenze di tastiera dell'ambiente desktop.
ja: 伝統的に、<keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Backspace</keycap></keycombo> の組み合わせで X サーバを停止できました。この組み合わせはデフォルトでは有効にはならなくなりましたが、<systemitem role="package">keyboard-configuration</systemitem> パッケージの再設定 (システム全体に影響)、またはデスクトップ環境のキーボード設定アプリケーションを使うことで、再度有効にできます。
pt: Tradicionalmente, a combinação <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Backspace</keycap></keycombo> termina o servidor X. Esta combinação já não está activa como padrão, mas pode ser re-habilitada ao reconfigurar o pacote <systemitem role="package">keyboard-configuration</systemitem> (a nível do sistema), ou usando a aplicação de definição de preferências do seu ambiente de trabalho.

source: Munin web path change
it: Spostato il percorso di munin web

source: For &releasename;, the default location for the generated web content of munin has been changed from <filename>/var/www/munin</filename> to <filename>/var/cache/munin/www</filename> and therefore <filename>/etc/munin/munin.conf</filename> needs to be adapted on upgrades, if it has been changed by the admin. If you are upgrading, please read <filename>/usr/share/doc/munin/NEWS.Debian.gz</filename>.
it: In &releasename; il percorso predefinito per i contenuti web generati da munin è cambiato da <filename>/var/www/munin</filename> in <filename>/var/cache/munin/www</filename>; di conseguenza, se il file <filename>/etc/munin/munin.conf</filename> è stato modificato dall'amministratore, è necessario correggerlo. Prima di aggiornare, consultare <filename>/usr/share/doc/munin/NEWS.Debian.gz</filename>.

source: Shorewall upgrade instructions
it: Istruzioni per l'aggiornamenti di shorewall

source: Users of the <systemitem role="package">shorewall</systemitem> firewall should read the instructions at <ulink url="http://www.shorewall.net/LennyToSqueeze.html" />, also available as <filename>/usr/share/doc/shorewall-doc/html/LennyToSqueeze.html</filename> in the <systemitem role="package">shorewall-doc</systemitem> package, upon upgrading to Debian &release;.
it: Gli utenti del firewall <systemitem role="package">shorewall</systemitem> devono leggere le istruzioni su <ulink url="http://www.shorewall.net/LennyToSqueeze.html" />, disponibili anche nel file <filename>/usr/share/doc/shorewall-doc/html/LennyToSqueeze.html</filename> del pacchetto <systemitem role="package">shorewall-doc</systemitem>, prima di procedere con l'aggiornamento a Debian &release;.

source: TODO: XEN support in lenny
ja: TODO: lenny における XEN のサポート
nb: Husk: XEN støtte i lenny

source: Certain network sites cannot be reached by TCP
be: Пэўныя сайты ў сеціве не даступныя праз TCP
ja: ネットワーク上の特定の場所に TCP が届かなくなりました
lt: Tam tikrų tinklo vietų negalima pasiekti naudojant TCP
nb: Noen nettverkssteder kan ikke nåes via TCP
pt: Alguns sítios da rede não podem ser alcançados por TCP
ro: Anumite locații din rețea nu pot fi contactate prin TCP
zh_tw: 有些網路站台無法用 TCP 連線。

source: Since 2.6.17, Linux aggressively uses TCP window scaling which is specified in RFC 1323. Some servers have a broken behavior, and announce wrong window sizes for themselves. For more details, please see the bug reports <ulink url="&url-bts;381262">#381262</ulink>, <ulink url="&url-bts;395066">#395066</ulink>, <ulink url="&url-bts;401435">#401435</ulink>.
be: Пачынаючы з ядра версіі 2.6.17, Linux агрэсіўна ўжывае тэхніку змены памераў вакна TCP (TCP window scaling), апісаную ў RFC 1323. Некаторыя серверы паводзяць сябе некарэктна, абвяшчаючы несапраўдны памер вокнаў TCP. Дэталі даступныя ў наступных паведамленнях аб памылках: <ulink url="&url-bts;381262">#381262</ulink>, <ulink url="&url-bts;395066">#395066</ulink>, <ulink url="&url-bts;401435">#401435</ulink>.
ja: 2.6.17 以降の Linux は、RFC 1323 で指定された TCP ウィンドウのスケーリングを積極的に使用しています。サーバによってはこれに対しておかしな挙動を示し、ウィンドウサイズを誤って認識することがあります。さらに詳しく知りたい場合は、バグ報告 <ulink url="&url-bts;381262">#381262</ulink> や <ulink url="&url-bts;395066">#395066</ulink>、<ulink url="&url-bts;401435">#401435</ulink> を参照してください。
lt: Pradedant 2.6.17 branduoliu, Linux'as intensyviai naudoja TCP lango dydžio keitimą, kuris yra apibrėžtas dokumente RFC 1323. Kai kurie serveriai elgiasi klaidingai, ir praneša klaidingus savo langų dydžius. Daugiau informacijos rasite riktų pranešimuose <ulink url="&url-bts;381262">#381262</ulink>, <ulink url="&url-bts;395066">#395066</ulink>, <ulink url="&url-bts;401435">#401435</ulink>.
nb: Siden 2.6.17 kjernen så brukes vindusstørrelsen i TCP veldig aktivt i henhold til RFC 1323. Noen servere har feil innstillinger, og ber om feil vindusstørrelsen . Les mer om dette i <ulink url="&url-bts;381262">#381262</ulink>, <ulink url="&url-bts;395066">#395066</ulink>, <ulink url="&url-bts;401435">#401435</ulink>.
pt: Desde a versão 2.6.17, que o Linux utiliza agressivamente o redimensionamento da janela TCP que é especificado no RFC 1323. Alguns servidores apresentam um comportamento não funcional e anunciam para eles próprios dimensões erradas das janelas. Para mais detalhes, por favor veja os relatórios dos bugs <ulink url="&url-bts;381262">#381262</ulink>, <ulink url="&url-bts;395066">#395066</ulink> e <ulink url="&url-bts;401435">#401435</ulink>.
ro: Începând cu 2.6.17, Linux folosește în mod agresiv scalarea ferestrelor TCP, care este detaliată în RFC 1323. Unele servere au un comportament defectuos și anunță dimensiuni eronate ale ferestrelor TCP pentru ele însele. A se vedea rapoartele de erori <ulink url="&url-bts;381262">#381262</ulink>, <ulink url="&url-bts;395066">#395066</ulink> și <ulink url="&url-bts;401435">#401435</ulink>.
zh_tw: 從 2.6.17 開始，Linux 大膽得採用了 RFC 1323 所說明的 TCP window scaling。有些伺服器對此適應不良，並會替自已宣告錯誤的 window 大小。請參閱錯誤回報 <ulink url="&url-bts;381262">#381262</ulink>、<ulink url="&url-bts;395066">#395066</ulink>、<ulink url="&url-bts;401435">#401435</ulink> 以取得更詳盡資訊。

source: There are usually two workarounds to these problems: either revert the maximum allowed TCP window sizes to a smaller value (preferable) or turn off TCP window scaling altogether (deprecated). See the example commands in the <ulink url="&url-installer-errata;">debian-installer errata page</ulink>.
be: Звычайна магчымыя два шляхі вырашэння праблемы: альбо зменшыць максімальныя дазволеныя памеры вокнаў TCP (найлепшы варыянт), альбо ўвогуле адключыць рэжым змеры паменаў вакна (настойліва не рэкамендуецца). Прыклады камандаў даступныя на старонцы <ulink url="&url-installer-errata;"><quote>працы над памылкамі</quote></ulink> праграмы ўсталявання.
ja: これらの問題を回避する方法は、通常 2 つあります。許可される TCP ウィンドウサイズの最大値を小さな値に戻す (好ましい) 方法と、TCP ウィンドウスケーリングオプションを完全に無効にする (非推奨の) 方法です。<ulink url="&url-installer-errata;">debian-installer の正誤表ページ</ulink>にあるコマンドの例を参照してください。
lt: Šiai problemai apeiti paprastai naudojamas vienas iš dviejų būdų: arba sumažinti maksimalų TCP lango dydį iki mažesnės reikšmės (tinkamesnis) arba visiškai išjungti TCP lango keitimą (nerekomenduojamas būdas). Komandų pavyzdžius galima rasti čia: <ulink url="&url-installer-errata;">Debian'o įdiegiklio žinomų problemų puslapis</ulink>.
nb: Det fins vanligvis to måter å komme seg rundt dette problemet: enten ved å endre den største tillatte vindusstørrelsen til en lavere verdi (anbefalt måte), eller ved å skru av TCP vindusstørrelse skallering(fases ut, bør ikke brukes). Se eksempel på kommandoer i <ulink url="&url-installer-errata;">debian-installer skrivefeil</ulink>.
pt: Normalmente existem duas formas de contornar estes problemas: ou revertendo os tamanhos máximos permitidos das janelas TCP para um valor mais pequeno (preferencial) ou desligar todo o redimensionamento das janelas TCP (a evitar). Veja os comandos de exemplo na <ulink url="&url-installer-errata;">página da errata do debian-installer</ulink>.
ro: Există două metode uzuale de a ocoli aceste probleme: ori reduceți dimensiunea maximă permisă pentru ferestre TCP la o valoare mai mică (de preferat) ori opriți scalarea ferestrelor TCP cu totul (metodă învechită). Vedeți exemplele de comenzi din <ulink url="&url-installer-errata;">pagina cu erata debian-installer</ulink>.
zh_tw: 有兩個方法可以用來避開這些問題：將 TCP windows 最多能允許的大小調低為原始值（上策），或是乾脆徹底將 TCP window scaling 關閉（下策）。請參閱在 <ulink url="&url-installer-errata;">debian-installer 勘誤表</ulink> 上的示範指令。

source: Automatic poweroff stops working
be: Электрычнасць больш не адключаецца аўтаматычна
ja: 自動電源オフが機能しなくなりました
lt: Automatinis maitinimo įtampos išjungimas nustoja veikti
nb: Automatisk avskruing slutter å virke
pt: O encerramento automático deixou de funcionar
ro: Oprirea automată a sistemului încetează să mai funcționeze
zh_tw: 自動關機無法正常運作

source: On some older systems, <literal>shutdown -h</literal> may not power off the system anymore (but just stop it). This happens because <acronym>APM</acronym> needs to be used there. Adding <literal>acpi=off apm=power_off</literal> to the kernel's command line, e.g. in <systemitem role="package">grub</systemitem> or <systemitem role="package">lilo</systemitem> configuration files should fix this issue. Please see bug <ulink url="&url-bts;390547">#390547</ulink> for additional information.
be: На некаторых старых сістэмах каманда <literal>shutdown -h</literal> можа не выключаць электрычнасць, а толькі спыняць сістэму. Гэта адбываецца таму, што для адключэння электрычнасці патрэбная падтрымка <acronym>APM</acronym>. Праблему можна выправіць, калі дадаць параметры <literal>acpi=off apm=power_off</literal> да радку загрузкі ядра (напрыклад, у файлах наладкі загрузчыкаў <systemitem role="package">grub</systemitem> або <systemitem role="package">lilo</systemitem>). Дадатковыя звесткі можна знайсці ў апісанні памылкі <ulink url="&url-bts;390547">#390547</ulink>.
ja: 一部の古いシステムでは、もはや <literal>shutdown -h</literal> で電源がオフにならないかもしれません (システムは停止しますが)。これは、<acronym>APM</acronym> を使用して電源を切る必要があるためです。<systemitem role="package">grub</systemitem> や <systemitem role="package">lilo</systemitem> の設定ファイルでの指定などを通じて、カーネルのコマンドラインに <literal>acpi=off apm=power_off</literal> を追加すれば、この問題は解決するかもしれません。さらに詳しくはバグ <ulink url="&url-bts;390547">#390547</ulink> を参照してください。
lt: Kai kuriose senesnėse sistemose komanda <literal>shutdown -h</literal> gali nebe išjungti sistemos maitinimo (tik sustabdo ją). Tokiu atveju turi būti naudojamas <acronym>APM</acronym>. Papildžius branduolio komandinę eilutę įrašu <literal>acpi=off apm=power_off</literal>, pavyzdžiui <systemitem role="package">grub</systemitem> ar <systemitem role="package">lilo</systemitem> konfigūracijos failuose, ši problema turėtų išnykti. Papildomos informacijos rasite čia: <ulink url="&url-bts;390547">#390547</ulink>.
nb: På en del eldre systemer så kan ikke kommendoen <literal>shutdown -h</literal> brukes for å skru av systemet lengre (systemet stopper bare opp). Dette skjer fordi <acronym>APM</acronym> må brukes på disse systemene. Ved å legge til <literal>acpi=off apm=power_off</literal> til kjernens kommandolinje i innstillingene i pakken <systemitem role="package">grub</systemitem> eller <systemitem role="package">lilo</systemitem> så vil de skru seg ordentlig av. Se feilrapport <ulink url="&url-bts;390547">#390547</ulink> for mer informasjon.
pt: Em alguns sistemas mais antigos o <literal>shutdown -h</literal> pode deixar de desligar o sistema (apenas pará-lo). Isto acontece devido à necessidade de utilizar o <acronym>APM</acronym> neste ponto. Adicionar <literal>acpi=off apm=power_off</literal> à linha de comando do kernel, e.g. nos ficheiros de configuração do <systemitem role="package">grub</systemitem> ou <systemitem role="package">lilo</systemitem> deverá corrigir esta questão. Para mais informações veja por favor o bug <ulink url="&url-bts;390547">#390547</ulink>.
ro: Este posibil ca pe unele sisteme mai vechi <literal>shutdown -h</literal> să nu mai întrerupă alimentarea sistemului (doar să îl oprească). Acest lucru se întâmplă deoarece în aceste situații trebuie folosit <acronym>APM</acronym>. Dacă adaugați <literal>acpi=off apm=power_off</literal> la linia de comandă a nucleului, de exemplu în fișierele de configurare pentru <systemitem role="package">grub</systemitem> sau <systemitem role="package">lilo</systemitem>. Vă rugăm consultați raportul de problemă <ulink url="&url-bts;390547">#390547</ulink> pentru informații adiționale.

source: ACPI support disabled for some HP laptop models in &releasename; kernel
be: Падтрымка ACPI для пэўных мадэляў ноўтбукаў HP адключаная ў ядры "&releasename;"
ja: &releasename; のカーネルでは一部の HP ラップトップモデルの ACPI サポートが無効になっています
lt: Kai kuriems HP nešiojamų kompiuterių modeliams ACPI palaikymas išjungtas &releasename;branduolje
nb: Støtten for ACPI er skrudd av i &releasename; kjernen for noen HP bærbare modeller
pt: Suporte ACPI desabilitado para alguns modelos de portáteis HP no kernel do &releasename;
ro: Suportul ACPI e dezactivat la anumite modele de laptopuri HP în nucleul din &releasename;
zh_tw: 在 &releasename; 的 Kernel 裡，有些 HP 筆記型電腦機種的 ACPI 支援被關閉了

source: TODO: This section can be removed, right?
ja: TODO: このセクションは削除できるでしょ？
nb: Husk: Denne delen kan vel fjernes?

source: Certain models of HP laptops have an ACPI BIOS that is incompatible with the Linux &kernelversion; kernel shipped in &releasename;, which would prevent the fans from spinning up leading to unnecessary heat stress. Also, fans might not work after the system is suspended. The kernel therefore disables ACPI support internally when it detects certain ACPI BIOS versions. Models known to be affected by this change include the HP nx6125, nx6120, nx6325, nc6120 and nc6000 models.
be: Пэўныя мадэлі ноўтбукаў HP маюць ACPI BIOS, несумяшчальны з ядром Linux версіі &kernelversion;, якое ўключана ў "&releasename;". Вынікам можа стаць нераскрутка вентылятараў і непажаданы перагрэў. Таксама вентылятары могуць адмовіцца працаваць пасля прыпынення сістэмы (suspend). З гэтай нагоды ядро адключае падтрымку ACPI, калі выяўляе пэўныя версіі ACPI BIOS. Мадэлі, для якіх гэтая праблема актуальная, уключаюць HP nx6125, nx6120, nx6325, nc6120 ды nc6000.
ja: HP ラップトップの一部のモデルでは、ACPI BIOS が、&releasename; 付属の Linux &kernelversion; カーネルと非互換になりました。この変更によりファンの回転数が上がらなくなり、不必要な発熱が生じるでしょう。また、システムのサスペンド後にファンが働かなくなる可能性があります。そのため、ACPI BIOS の特定のバージョンを検出すると、カーネルは内部的に ACPI サポートを無効にします。この変更が関係することがわかっているモデルには、HP nx6125、nx6120、nx6325、nc6120、nc6000 などがあります。
lt: Tam tikri HP nešiojamų kompiuterių modeliai turi ACPI BIOS, nesuderinamą su Linux &kernelversion; branduoliu tiekiamu &releasename; laidoje, ko pasekoje negalima padidinti ventiliatoriaus sukimosi ir atsiranda nepageidautinas perkaitimas. Be to, ventiliatorius gali nebe įsijungti po sistemos pristabdymo. Todėl branduolys, pastebėjęs tam tikras ACPI BIOS versijas, pats išjungia ACPI palaikymą. Modeliai, žinomi kaip turintys šią problemą: HP nx6125, nx6120, nx6325, nc6120 ir nc6000.
nb: Visse modeller av bærbare fra HP har en ACPI BIOS som er inkompatibel med Linux &kernelversion; som følger med &releasename;, dette medfører at viftene ikke startes når de trengs. Etter at laptopen har vært i dvale så starter ikke alltid viftene. Kjernen kommer derfor til å skru av støtten for ACPI når den oppdager en laptop med bestemte versjoner av ACPI BIOS, dette inkluderer modeller av typen HP nx6125, nx6120, nx6325, nc6120 og nc6000.
pt: Alguns modelos de portáteis HP têm uma BIOS ACPI que é incompatível com o kernel &kernelversion; que é distribuído na &releasename;, que pode prevenir as ventoinhas de girarem, levando a um stress de aquecimento desnecessário. Além disso, as ventoinhas podem não funcionar depois do sistema ter sido suspenso. Por isso o kernel desabilita internamente o suporte para ACPI quando detecta certas versões da BIOS ACPI. Os modelos conhecidos por serem afectados por esta mudança incluem os modelos HP nx6125, nx6120, nx6325, nc6120 e nc6000.
ro: Anumite modele de laptopuri HP au BIOS-ul ACPI incompatibil cu nucleul Linux 2.6.18 livrat în &releasename;, lucru care nu permite ventilatoarelor să pornească, forțând astfel sistemul inutil, din punct de vedere termic. De asemenea, este posibil ca ventilatoarele să nu funcționeze după suspendarea sistemului. Din această cauză, nucleul dezactivează suportul ACPI intern atunci când detectează anumite versiuni de BIOS ACPI. Printre modelele știut a fi afectate de acestă schimbare se află modelele HP nx6125, nx6120, nx6325, nc6120 și nc6000.
zh_tw: &releasename; 所搭載的 Linux &kernelversion; Kernel 和有些 HP 筆記型電腦機種裡，用來防止風扇因旋轉而導致的熱壓的 ACPI BIOS 不相容；而同時，在系統待機後，風扇可能會不再運轉。因此，當 Kernel 偵測到這些 ACPI BIOS 版本的話，會從內部將 ACPI 的支援關閉。已知受此影響的包括了 HP nx6125、nx6120、nx6325、nc6120 及 nc6000 機種。
