Repository: lurdan/trans-ddp
Catalog: release-notes/*/issues.po
Languages: be, de, fr, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sv, zh_tw

source: <command>NetworkManager</command> can detect if a network interface is managed by <command>ifupdown</command> in order to avoid conflicts, but is not able to do so with other networking management programs such as <command>wicd-daemon</command>. Problems and unexpected behavior can result if two such daemons are managing the same interface when attempting to make a networking connection.
ru: Программа <command>NetworkManager</command> способна обнаружить, что сетевой интерфейс настраивается с помощью <command>ifupdown</command>, но не другими программами управления сетевыми подключениями (например, <command>wicd-daemon</command>). Если две такие службы попробуют настроить сетевое подключение одновременно, то возникнут проблемы.
sv: <command>NetworkManager</command> kan känna av om ett nätverksgränssnitt hanteras av <command>ifupdown</command> för att undvika konflikter. Andra nätverkshanteringsapplikationer kan dock inte kännas av, exempelvis <command>wicd-daemon</command>. Problem och oväntade beteenden kan innebära att två sådana tjänster hanterar samma gränssnitt när en nätverksanslutning ska skapas.

source: It is recommended that users of GNOME consider installing and trying <command>NetworkManager</command> but, if desired, the <command>NetworkManager</command> daemon may be permanently disabled using the following command:
ru: Пользователям GNOME рекомендуется установить и попробовать использовать <command>NetworkManager</command> но, при желании, службу <command>NetworkManager</command> можно отключить с помощью команды:

source: <command>suidperl</command> was removed upstream with 5.12, so the <systemitem role="package">perl-suid</systemitem> package which used to be distributed in Debian has been removed too. Possible alternatives include using a simple setuid C wrapper to execute a perl script from a hard-coded location, or using a more general tool like <command>sudo</command>.
de: <command>suidperl</command> wurde von den Originalautoren mit Version 5.12 aufgegeben, daher wurde auch das <systemitem role="package">perl-suid</systemitem>-Paket, das in Debian enthalten war, entfernt. Mögliche Alternativen sind die Verwendung eines einfachen C-Wrappers mit Setuid-Rechten, um ein Perl-Skript von einem festkodierten Ort auszuführen, oder das Nutzen eines Werkzeugs mit eher grundsätzlicher Funktionalität wie zum Beispiel <command>sudo</command>.
ru: Команда <command>suidperl</command> удалена авторами в версии 5.12, поэтому пакет <systemitem role="package">perl-suid</systemitem>, в котором она содержалась в Debian, также был удалён. Для её замены можно использовать простую обёртку на Си с установленным битом setuid, которая запускает сценарий perl из неизменяемого места, или воспользоваться более общим инструментом, например, <command>sudo</command>.
sv: <command>suidperl</command> togs bort uppströms i och med 5.12, paketet <systemitem role="package">perl-suid</systemitem> som tidigare distribuerades med Debian behövde således tas bort också. Möjliga alterantiv inkluderar att använda en enkel setuid-binär i C för att exekvera ett perlskript från en hårdkodad plats, eller genom att använda ett mer allmänt verktyg som <command>sudo</command>.

source: The same advice applies if you still have <systemitem role="package">request-tracker3.6</systemitem> or older packages from previous Debian releases still in use; if this is the case it is recommended to upgrade step by step, following the appropriate upgrade documents.
de: Das gleiche gilt, wenn Sie noch <systemitem role="package">request-tracker3.6</systemitem> oder älter aus früheren Debian-Veröffentlichungen in Verwendung haben; falls dies der Fall sein sollte, wird empfohlen, Schritt für Schritt zu aktualisieren und dabei den entsprechenden Upgrade-Dokumentationen zu folgen.
ru: Этот же совет применим, если вы всё ещё используете <systemitem role="package">request-tracker3.6</systemitem> или более старые пакеты из предыдущих выпусков Debian; рекомендуется выполнять обновление последовательно, следуя соответствующей документации по обновлению.
sv: Samma råd gäller om fortfarande har <systemitem role="package">request-tracker3.6</systemitem> eller ett äldre paket från tidigare Debian utgåvor som fortfarande används. Om detta är fallet rekommenderas en uppgradering steg för steg genom att följa uppgraderingsdokumentationen.

source: The MirBSD Korn Shell (<systemitem role="package">mksh</systemitem>) package contains its successor; it has evolved from the Public Domain Korn Shell and has been kept up to date with the POSIX standard on the shell. In &debian; &releasename;, <systemitem role="package">pdksh</systemitem> is a transitional package using <command>lksh</command>, a variant of <systemitem role="package">mksh</systemitem> built with special compatibility options to provide a <command>pdksh</command> binary symlink. This compatibility binary behaves more like the traditional Public Domain Korn Shell than the current <command>mksh</command>. However as it contains behaviour-changing bugfixes it is not a pure drop-in replacement. So, you're advised to change your
ru: В пакете MirBSD Korn Shell (<systemitem role="package">mksh</systemitem>) содержится его потомок; он вырос из Public Domain Korn Shell и доработан для соответствия стандарту POSIX для оболочек. В &debian; &releasename;, <systemitem role="package">pdksh</systemitem> является переходным пакетом использующим <command>lksh</command>, вариант <systemitem role="package">mksh</systemitem>, собранный со специальными параметрами совместимости и предоставляет символьную ссылку <command>pdksh</command>. Данный совместимый исполняемый файл больше работает как обычный Public Domain Korn Shell, нежели текущий <command>mksh</command>. Однако, так как он содержит исправления изменяющие поведение, он не является полноценной заменой. Поэтому после изменения
sv: Paketet MirBSD Korn Shell (<systemitem role="package">mksh</systemitem>) innehåller dess arvtagare. Det har utvecklats från Public Domain Korn Shell och har hållits uppdaterat med POSIX-standarden för skal. I &debian; &releasename; är <systemitem role="package">pdksh</systemitem> ett övergångspaket som använder <command>lksh</command>, en variant av <systemitem role="package">mksh</systemitem> byggt med ett speciellt kompabilitetsläge för att tillhandahålla en kompabilitetsbinär för <command>pdksh</command>. Denna kompabilitetsbinär beter sig mer som den traditionella Public Domain Korn Shell än nuvarande <command>mksh</command>. Men i och med att den innehåller beteendeändrande fellagningar är det inte en ren ersättare och du behöver justera dina

source: The compatibility binary is not suitable for interactive use, so as system administrator, adjust the login shell of your Korn Shell users. For minimal service interruption, do this before the upgrade of the O.S: manually install the <systemitem role="package">mksh</systemitem> package and change the login and/or interactive shells of users that use <command>pdksh</command> to <command>mksh</command>. Furthermore, you're suggested to copy <filename>/etc/skel/.mkshrc</filename> into their home directories: this provides some shell functions like <command>pushd</command>, <command>popd</command> and <command>dirs</command> and a nice
ru: Исполняемый совместимый файл не подходит для интерактивного использования, поэтому, если вы системный администратор, исправьте регистрационные оболочки Korn Shell у пользователей. Чтобы минимизировать простой, выполните это до обновления ОС: установите вручную пакет <systemitem role="package">mksh</systemitem> и измените регистрационные и/или интерактивную оболочку пользователей, использующих <command>pdksh</command>, на <command>mksh</command>. Кроме этого, возможно полезно скопировать файл <filename>/etc/skel/.mkshrc</filename> в их домашние каталоги: он предоставляет некоторые функции оболочки, такие как <command>pushd</command>, <command>popd</command> и <command>dirs</command> и замечательную
sv: Kompabilitetsläget är inte särskilt användbart för interaktion, en systemadministratör bör justera inloggningsskalet för användarna av Korn Shell. För minimalt serviceavbrott bör detta göras manuellt före uppgraderingen av operativsystemet genom att installera <systemitem role="package">mksh</systemitem>-paketet och ändra inloggnings- och interaktionsskal för användare av <command>pdksh</command> till <command>mksh</command>. Vidare rekomenderas att kopiera <filename>/etc/skel/.mkshrc</filename> till deras hemkataloger; detta tillhandahåller några skalfunktioner som <command>pushd</command>, <command>popd</command> och <command>dirs</command> och en trevlig

source: When upgrading a Puppet managed system from Squeeze to Wheezy, you must ensure that the corresponding puppetmaster runs at least Puppet version 2.7. If the master is running Squeeze's <systemitem role="package">puppetmaster</systemitem>, the managed Wheezy system will not be able to connect to it.
ru: При обновлении системы управления Puppet с Squeeze до Wheezy, вы должны убедиться, что соответствующий puppetmaster запускает Puppet версии 2.7. Если мастер запускает <systemitem role="package">puppetmaster</systemitem> от Squeeze, то к управляемой системе Wheezy невозможно будет подключиться.
sv: När ett system som hanteras av Puppet uppdateras från Squeeze till Wheezy måste du tillse att motsvarande puppetmaster kör åtminstone version 2.7 av Puppet. Om mastern kör Squeezes <ystemitem role="package">puppetmaster</systemitem> kommer det hanterade Wheezy-systenet ubte att kuna ansluta till den.

source: By default, some accessibility tools are not enabled in the GNOME display manager (gdm3). In order to enable zooming or a visual keyboard, the simplest way is to enable the <quote>shell</quote> greeter.
sv: I standardläget är några tillgänglighetsanpassningar avstängda i GNOMEs sessionshantering (gdm3). För att aktivera zoom eller visuellt tangentbord är den enklaste vägen att aktivera <quote>shell</quote>-hanteringen.

source: It is is recommended that users of GNOME consider installing and trying <command>NetworkManager</command> but, if desired, the <command>NetworkManager</command> daemon may be permanently disabled using the following command:
sv: GNOME-användare rekomenderas att installera och prova <command>NetworksManager</command> men <command>NetworkManager</command>-tjänsten kan avaktiveras permanent om så önskas genom att köra följande kommando:

source: Such a combination will lead to the following error message during a <command>pupppet agent</command> run:
sv: En sådan kombination kommer att visa ett felmeddelande likt följande när <command>puppet agent</puppet> körs:
