Repository: lurdan/trans-ddp
Catalog: release-notes/*/issues.po
Languages: be, de, fr, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sv, zh_tw

source: Note that <systemitem role="package">libnss-ldapd</systemitem> recommends the NSS caching daemon (<systemitem role="package">nscd</systemitem>) which you should evaluate for suitability in your environment before installing. As an alternative to <systemitem role="package">nscd</systemitem> you can consider <systemitem role="package">unscd</systemitem>.
de: Beachten Sie, dass <systemitem role="package">libnss-ldapd</systemitem> den NSS-Caching-Daemon (<systemitem role="package">nscd</systemitem>) vorschlägt. Sie sollten überprüfen, ob dieser für Ihre Umgebung passend ist, bevor Sie ihn installieren. Als Alternative zu <systemitem role="package">nscd</systemitem> können Sie <systemitem role="package">unscd</systemitem> in Betracht ziehen.
fr: Notez que <systemitem role="package">libnss-ldapd</systemitem> recommande le démon de cache NSS (<systemitem role="package">nscd</systemitem>), dont vous devez évaluer l'intérêt avant de l'installer. Comme alternative à <systemitem role="package">nscd</systemitem>, vous pouvez envisager <systemitem role="package">unscd</systemitem>.
it: Notare che <systemitem role="package">libnss-ldapd</systemitem> raccomanda il demone di caching NSS (<systemitem role="package">nscd</systemitem>); prima di installarlo è necessario valutare se è adatto al proprio sistema. Come alternativa a <systemitem role="package">nscd</systemitem> è possibile usare <systemitem role="package">unscd</systemitem>.
ja: <systemitem role="package">libnss-ldapd</systemitem> が、NSS キャッシュデーモン (<systemitem role="package">nscd</systemitem>) をインストール前にあなたの環境に適しているかどうかを評価するのを推奨している点にご注意ください。<systemitem role="package">nscd</systemitem> の代替としては <systemitem role="package">unscd</systemitem> が考えられます。
pl: Proszę zauważyć, że <systemitem role="package">libnss-ldapd</systemitem> poleca demona buforującego NSS (<systemitem role="package">nscd</systemitem>) - przed instalacją należy sprawdzić jego przydatność w swoich zastosowaniach. Alternatywą do <systemitem role="package">nscd</systemitem> może być <systemitem role="package">unscd</systemitem>.
pt: Note que <systemitem role="package">libnss-ldapd</systemitem> recomenda o daemon de cache NSS (<systemitem role="package">nscd</systemitem>) que deve avaliar em termos de adequação ao seu ambiente antes da instalação. Como alternativa ao <systemitem role="package">nscd</systemitem> pode considerar o <systemitem role="package">unscd</systemitem>.
pt_br: Note que o <systemitem role="package">libnss-ldapd</systemitem> recomenda o daemon de cache NSS (<systemitem role="package">nscd</systemitem>) que você deve avaliar se é adequado para seu ambiente antes da instalação. Como uma alternativa ao <systemitem role="package">nscd</systemitem>, você pode considerar o <systemitem role="package">unscd</systemitem>.
ru: Обратите внимание, что <systemitem role="package">libnss-ldapd</systemitem> рекомендует кэширующую службу NSS (<systemitem role="package">nscd</systemitem>), пригодность которой в своём окружении вам нужно оценить до установки. В качестве альтернативы <systemitem role="package">nscd</systemitem> можно рассмотреть <systemitem role="package">unscd</systemitem>.
sv: Kom ihåg att <systemitem role="package">libnss-ldapd</systemitem> rekommenderar att tjänsten NSS caching (<systemitem role="package">nscd</systemitem>) utvärderas för användning i din miljö före installation. Som ett alternativ till <systemitem role="package">nscd</systemitem> kan du anta <systemitem role="package">unscd</systemitem>.

source: Further information is available in bugs <ulink url="&url-bts;566351">#566351</ulink> and <ulink url="&url-bts;545414">#545414</ulink>.
de: Weitere Informationen sind in den Fehlerberichten <ulink url="&url-bts;566351">#566351</ulink> und <ulink url="&url-bts;545414">#545414</ulink> zu finden.
fr: Des renseignements supplémentaires sont disponibles dans les bogues <ulink url="&url-bts;566351">nº 566351</ulink> et <ulink url="&url-bts;545414">nº 545414</ulink>.
it: Ulteriori informazioni sono disponibili nelle segnalazioni d'errore <ulink url="&url-bts;566351">#566351</ulink> e <ulink url="&url-bts;545414">#545414</ulink>.
ja: 更なる情報は、バグ<ulink url="&url-bts;566351">#566351</ulink> およびバグ<ulink url="&url-bts;545414">#545414</ulink> で得られます。
pl: Więcej informacji można uzyskać w zgłoszeniach błędów <ulink url="&url-bts;566351">#566351</ulink> i <ulink url="&url-bts;545414">#545414</ulink>.
pt: Mais informações estão disponíveis nos bugs <ulink url="&url-bts;566351">#566351</ulink> e <ulink url="&url-bts;545414">#545414</ulink>.
pt_br: Informações adicionais estão disponíveis nos bugs <ulink url="&url-bts;566351">#566351</ulink> e <ulink url="&url-bts;545414">#545414</ulink>.
ru: За дополнительной информацией обратитесь к <ulink url="&url-bts;566351">#566351</ulink> и <ulink url="&url-bts;545414">#545414</ulink>.
sv: Ytterligare information finns i felrapporterna <ulink url="&url-bts;566351">#566351</ulink> och <ulink url="&url-bts;545414">#545414</ulink>.

source: <literal>sieve</literal> service moving to its IANA-allocated port
it: Spostato il servizio <literal>sieve</literal> sulla porta assegnata dalla IANA
ja: <literal>sieve</literal> サービスが IANA 割り当てのポート番号に移動しました
pt: serviço <literal>sieve</literal> movido para o seu porto alocado pela IANA

source: The IANA port allocated for ManageSieve is 4190/tcp, and the old port used by <command>timsieved</command> and other managesieve software in many distributions (2000/tcp) is allocated for Cisco SCCP usage, according to <ulink url="http://www.iana.org/assignments/port-numbers">the IANA registry</ulink>.
it: La porta assegnata a ManageSieve dalla IANA è la 4190/tcp; in base al <ulink url="http://www.iana.org/assignments/port-numbers">registro della IANA</ulink> la porta precedentemente usata da <command>timsieved</command> e dagli altri programmi managesieve in parecchie distribuzioni (2000/tcp) è assegnata a Cisco SCCP.
ja: ManageSieve への IANA のポート番号割り当ては 4190/tcp で、そして <ulink url="http://www.iana.org/assignments/port-numbers">IANA レジストリ</ulink> によると <command>timsieved</command> や多くのディストリビューションでの他の managesieve ソフトウェアによって使われていた古いポート番号 (2000/tcp) は Cisco の SCCP の利用に割り当てられていました。
pt: O porto alocado pela IANA para o ManageSieve é o 4190/tcp, e o antigo porto usado pelo <command>timsieved</command> e outro software managesieve em muitas distribuições (2000/tcp) está alocado para o Cisco SCCP, de acordo com <ulink url="http://www.iana.org/assignments/port-numbers">o registo IANA</ulink>.

source: Starting with the version 4.38 of the Debian <systemitem role="package">netbase</systemitem> package, the <literal>sieve</literal> service will be moved from port 2000 to port 4190 in the <filename>/etc/services</filename> file.
it: A partire dalla versione 4.38 del pacchetto Debian <systemitem role="package">netbase</systemitem>, il servizio <literal>sieve</literal> è spostato dalla porta 2000 alla porta 4190 nel file <filename>/etc/services</filename>.
ja: Debian <systemitem role="package">netbase</systemitem> パッケージのバージョン 4.38 から、<filename>/etc/services</filename> ファイルにて <literal>sieve</literal> サービスはポート番号が 2000 から 4190 へ移動しました。
pt: A partir da versão 4.38 do pacote Debian <systemitem role="package"/>netbase</systemitem> o serviço <literal>sieve</literal> irá ser movido do porto 2000 para o porto 4190 no ficheiro <filename>/etc/services</filename>.

source: Any installs which used the <literal>sieve</literal> service name instead of a numeric port number will switch to the new port number as soon as the services are restarted or reloaded, and in some cases, immediately after <filename>/etc/services</filename> is updated.
it: Qualsiasi installazione in cui è usato il nome del servizio <literal>sieve</literal> al posto del numero della porta passerà sulla nuova porta al prossimo riavvio o ricaricamento dei servizi oppure, in alcuni casi, immediatamente dopo la modifica a <filename>/etc/services</filename>.
ja: 数字のポート番号ではなく <literal>sieve</literal> サービス名を使っているソフトウェアはすべて、サービスが再起動あるいは再読み込みされる、あるいは<filename>/etc/services</filename> が更新された直後に、新しいポート番号へ切り替わります。
pt: Qualquer instalação que use o nome de serviço <literal>sieve</literal> em vez do número do porto usará o novo porto assim que o serviço for reiniciado ou recarregado, e nalguns casos, imediatamente após a actualização do ficheiro <filename>/etc/services</filename>.

source: This will affect Cyrus IMAP. This may also affect other sieve-enabled software such as DoveCot.
it: Questo ha effetto su Cyrus IMAP e potrebbe avere effetti anche sugli altri programmi che usano sieve, per esempio DoveCot.
ja: これは Cyrus IMAP に影響します。DoveCot のような sieve が利用できる他のソフトウェアにも影響を及ぼすかもしれません。
pt: Isto irá afectar o Cyrus IMAP. Pode também afectar outro software com ligação ao sieve, como o DoveCot.

source: In order to avoid downtime problems, mail cluster administrators using Debian are urged to verify their Cyrus (and probably also DoveCot) installs, and take measures to avoid services moving from port 2000/tcp to port 4190/tcp by surprise in either servers or clients.
it: Per evitare dei periodi di disservizio, gli amministratori del mail cluster devono verificare le proprie installazioni di Cyrus (e probabilmente anche di DoveCot) e prendere delle contromisure per evitare che il passaggio dalla porta 2000/tcp alla porta 4190/tcp sorprenda i server o i client.
ja: ダウン時間の問題を避けるには、Debian を使っているメールクラスタの管理者にはCyrus (そしておそらく DoveCot も) の設定の確認をお勧めします。そして、突然サーバあるいはクライアントでポート 2000/tcp から 4190/tcp にサービスが移動するのを避ける方策を講じましょう。
pt: De maneira a evitar problemas de indisponibilidade de serviço, os administradores de clusters de mail que usem Debian são vivamente aconselhados a verificar as suas instalações do Cyrus (e provavelmente também do DoveCot), e tomar as medidas necessárias para evitar surpresas nas mudanças de serviço do porto 2000/tcp para o 4190/tcp em servidores ou clientes.

source: It is worth noting that:
it: È da notare che:
ja: 特記しておくべきこと:
pt: Vale a pena notar que:

source: <filename>/etc/services</filename> will only be automatically updated if you never made any modifications to it. Otherwise, you will be presented with a prompt by dpkg asking you about the changes.
it: Il file <filename>/etc/services</filename> verrà aggiornato automaticamente solo se non è mai stato modificato. In caso contrario, sarà dpkg a chiedere se modificare il file.
ja: <filename>/etc/services</filename> は、何も変更をしていなかった場合のみ、自動的に更新されます。それ以外の場合は、dpkg による変更についての確認が表示されます。
pt: <filename>/etc/services</filename> só será actualizado automaticamente se nunca lhe fez nenhuma modificação. Se não for o caso, ser-lhe-á apresentado um prompt do dpkg sobre as mudanças.

source: You can edit <filename>/etc/services</filename> and change the <literal>sieve</literal> port back to 2000 if you want (this is not recommended, though).
it: È possibile modificare <filename>/etc/services</filename> e riassegnare a <literal>sieve</literal> la porta 2000 (questa soluzione non è raccomandata).
ja: もし望む場合は、<filename>/etc/services</filename> を編集して <literal>sieve</literal> のポート番号を 2000 に戻すこともできます (ですが、これはお勧めしません)。
pt: Pode editar o <filename>/etc/services</filename> e mudar o porto do <literal>sieve</literal> de volta para o 2000 se quiser (no entanto, isto não é recomendado).

source: You can edit <filename>/etc/cyrus.conf</filename> and any other relevant configuration files for your mail/webmail cluster (e.g. on the sieve web frontends) ahead of time to force them all to a static port number.
it: È possibile modificare in anticipo <filename>/etc/cyrus.conf</filename> e gli altri file di configurazione legati al cluster mail/webmail (quali le interfacce web sieve) in modo da forzarli a una porta con numero statico.
ja: <filename>/etc/cyrus.conf</filename> あるいはその他利用中のメール／ウェブメールクラスタの関連の設定ファイル (例: sieve ウェブフロントエンド上のもの) を編集して、前もって固定のポート番号を強制的に使うようにすることが可能です。
pt: Pode editar o <filename>/etc/cyrus.conf</filename> e qualquer outro ficheiro de configuração relevante para o seu cluster de mail/webmail (p.e. nos frontends web para o sieve) antes da actualização para os forçar a usar um porto estático.

source: You can configure cyrus master to listen on both ports (2000 and 4190) at the same time, and thus avoid the problem entirely. This also allows for a much more smooth migration from port 2000 to port 4190.
it: È possibile configurare cyrus master in modo che si metta contemporaneamente in ascolto su entrambe le porte (2000 e 4190) e quindi evitare completamente il problema. Questo permette una migrazione dalla porta 2000 alla porta 4190 molto più dolce.
ja: cyrus master が同時に両方のポート (2000 と 4190) を受け取るように設定して、全く問題を受けないようにすることができます。これによって、ポート 2000 からポート 4190 へのよりスムーズな移行も可能です。
pt: Pode configurar o master cyrus para escutar nos dois portos (2000 e 4190) ao mesmo tempo, e portanto evitar totalmente o problema. Isto permite também uma transição muito mais suave do porto 2000 para o porto 4190.

source: Security status of web browsers
de: Sicherheitsstatus von Webbrowsern
fr: État de sécurité des navigateurs web
it: Stato della sicurezza dei browser web
pl: Stan bezpieczeństwa przeglądarek internetowych
pt_br: Estado da segurança dos navegadores web
ru: Состояние безопасности веб-браузеров
sv: Säkerhetsläget för webbläsare

source: Debian &release; includes several browser engines which are affected by a steady stream of security vulnerabilities. The high rate of vulnerabilities and partial lack of upstream support in the form of long term branches make it very difficult to support these browsers with backported security fixes. Additionally, library interdepencies make it impossible to update to newer upstream releases. As such, browsers built upon the qtwebkit and khtml engines are included in Squeeze, but not covered by full security support. We will make an effort to track down and backport security fixes, but in general these browsers should not be used against untrusted websites.
it: Debian &release; contiene diversi motori per browser che possono essere affetti da varie vulnerabilità di sicurezza. L'alto tasso di vulnerabilità e la parziale mancanza di supporto a lungo termine da parte degli autori originali complica l'attività di supporto di questi browser tramite l'applicazione delle correzioni di sicurezza alle versioni precedenti. Inoltre la dipendenza reciproca dalle librerie rendono impossibile aggiornare a una nuova versione. In Squeeze sono presenti anche altri browser basati su qtwebkit e khtml, ma non sono coperti da un completo supporto di sicurezza. Nonostante che verrà fatto qualsiasi sforzo per applicare le correzioni di sicurezza, non si dovrebbe usare questi browser con siti web non fidati.

source: For general web browser use we recommend browsers building on the Mozilla xulrunner engine (Iceweasel and Iceape), browsers based on the Webkit engine (e.g. Epiphany) or Chromium. Xulrunner has had a history of good backportability for older releases over the previous release cycles.
it: Per la navigazione su web si raccomandano i browser basati sul motore Mozilla xulrunner (Iceweasel e Iceape), i browser basati sul motore Webkit (Epiphany) oppure Chromium. Xulrunner ha dimostrato nella storia delle versioni precedenti di avere una buona portabilità all'indietro.

source: Chromium &mdash;while built upon the Webkit codebase&mdash; is a leaf package, i.e. if backporting becomes no longer feasible, there's still the possibility of upgrading to a later upstream release (which is not possible for the webkit library itself).
it: Chromium, anche se è costruito sulla base di Webkit, è un pacchetto <quote>foglia</quote>, quindi, qualora non fosse più fattibile riportare le correzioni, è possibile aggiornare a una versione successiva (cosa che non è fattibile per la libreria webklit).

source: Webkit is supported by upstream with a long term maintenance branch.
it: Webkit è supportato dagli autori originali con un ramo di manutenzione a lungo termine.

source: KDE desktop
be: Працоўны асяродак KDE
it: Desktop KDE
ja: KDE デスクトップ
lt: KDE darbastalis
nb: KDE skrivbordet
pt: Desktop KDE
ro: Mediul de birou KDE
sv: KDE-skrivbordet
zh_tw: KDE 桌面

source: &Releasename; is the first Debian release to ship with the full support for the next generation KDE that is based on Qt 4. Most official KDE applications are at version 4.4.5 with the exception of <systemitem role="package">kdepim</systemitem> that is at version 4.4.7. You can read the <ulink url="http://www.kde.org/announcements/">announcements from the KDE Project</ulink> to learn more about the changes.
it: &Releasename; è la prima versione di Debian con il supporto completo per KDE di prossima generazione basata su Qt 4. La maggior parte delle applicazioni ufficiali di KDE sono allineate alla versione 4.4.5 con l'eccezione di <systemitem role="package">kdepim</systemitem> che è alla versione 4.4.7. È possibile leggere gli <ulink url="http://www.kde.org/announcements/">annunci del Progetto KDE</ulink> per saperne di più sui cambiamenti.
ja: &releasename; は、Qt 4 をベースにした次世代の KDE をフルサポートする Debian の初リリースとなります。多くの公式 KDE アプリケーションはバージョン 4.4.5 で、<systemitem role="package">kdepim</systemitem> のみバージョン 4.4.7 となっています。変更点については、<ulink url="http://www.kde.org/announcements/">KDE プロジェクトからのアナウンス</ulink>を読むことでさらに確認ができます。
pt: &Releasename; é o primeiro lançamento Debian com suporte completo para a geração seguinte do KDE, baseada no Qt 4. A maior parte das aplicações oficiais do KDE estão na versão 4.4.5 com a excepção do <systemitem role="package">kdepim</systemitem> que está na versão 4.4.7. Pode ler os <ulink url="http://www.kde.org/announcements/">anúncios do Projecto KDE </ulink> para saber mais sobre as alterações.

source: Upgrading from KDE 3
it: Aggiornamento da KDE 3
ja: KDE 3 からのアップグレード
pt: Actualização do KDE 3

source: KDE 3 Desktop Environment is no longer supported in Debian &release;. It will be automatically replaced by the new 4.4 series on upgrade. As this is a major change, users should take some precautions in order to ensure as smooth of an upgrade process as possible.
it: Il KDE 3 Desktop Environment non è più supportato in Debian &release; e viene automaticamente sostituito con la nuova serie 4.4 durante l'aggiornamento. Poiché questo è un grosso cambiamento, gli utenti dovrebbero prendere particolari precauzioni in modo da rendere il processo di aggiornamento il più tranquillo possibile.
ja: Debian &release; では、KDE 3 デスクトップ環境はサポートの対象外となりました。アップグレード時に自動的に新しい 4.4 シリーズに置き換わります。これは大きな変更なので、可能な限り円滑なアップグレード作業を確約するため、ユーザは事前の注意を受けておく必要があります。
pt: O Ambiente de Trabalho KDE 3 já não é suportado no Debian &release;. Será automaticamente substituído pela nova série 4.4 ao actualizar. Como esta é uma grande mudança, os utilizadores devem tomar algumas precauções para assegurar um processo de actualização sem sobressaltos.

source: It is discouraged to upgrade while there is an active KDE 3 session on the system. Otherwise, the process might render the running session dysfunctional with the possibility of data loss.
it: Si sconsiglia di fare l'aggiornamento mentre sul sistema è attiva una sessione KDE 3, infatti il processo potrebbe rendere la sessione attiva non funzionante e portare a delle perdite di dati.
ja: システム上に有効な KDE 3 セッションがある間にアップグレードを行うのは推奨されていません。そうしなかった場合は、作業によって動作中のセッションが動かなくなり、データ損失が引き起こされる可能性があります。
pt: É desencorajado actualizar enquanto houver uma sessão KDE 3 activa no sistema. Caso contrário, o processo poderá deixar a sessão activa disfuncional e possivelmente levar à perda de dados.

source: Upon the first login on the upgraded system, existing users will be prompted with the Debian-KDE guided migration procedure called <systemitem role="package">kaboom</systemitem> which will assist in the process of migrating the user's personal data and optionally backing up old KDE configuration. For more information, visit <ulink url="http://pkg-kde.alioth.debian.org/kaboom.html">the Kaboom homepage</ulink>.
it: Al primo accesso al sistema dopo l'aggiornamento, agli utenti esistenti viene proposta la procedura guidata di migrazione Debian-KDE chiamata <systemitem role="package">kaboom</systemitem> che li assiste durante la migrazione dei dati personali e facoltativamente nel salvare una copia della vecchia configurazione di KDE. Per maggiori informazioni, visitare il <ulink url="http://pkg-kde.alioth.debian.org/kaboom.html">il sito web di Kaboom</ulink>.
ja: アップグレード後のシステムへの初回ログイン時に、既存のユーザは <systemitem role="package">kaboom</systemitem> と呼ばれる Debian-KDE ガイド付きの移行手続きが表示されます。これは、ユーザの個人データの移行作業と、お望みであれば以前の KDE 設定のバックアップ作業を手助けしてくれます。詳細については、<ulink url="http://pkg-kde.alioth.debian.org/kaboom.html">Kaboom のホームページ</ulink> を参照してください。
pt: No primeiro login no sistema actualizado, será apresentado aos utilizadores existentes o procedimento de migração assistida do Debian-KDE chamado <systemitem role="package">kaboom</systemitem> que irá assistir os utilizadores no processo de migração dos seus dados pessoais e opcionalmente realizar o backup da configuração antiga do KDE. Para mais informação, visite <ulink url="http://pkg-kde.alioth.debian.org/kaboom.html">a página do Kaboom</ulink>.

source: While KDE 3 based desktop environment is no longer supported, users can still install and use some individual KDE 3 applications since the core libraries and binaries of KDE 3 (<systemitem role="package">kdelibs</systemitem>) and Qt 3 are still available in Debian &release;. However, please note that these applications might not be well integrated with the new environment. What's more, neither KDE 3 nor Qt 3 will be supported in any form in the next Debian release so if you are using them, you are strongly advised to port your software to the new platform.
it: Anche se l'ambiente desktop KDE 3 non è più presente, gli utenti possono ancora installare e usare singole applicazioni KDE 3 poiché le librerie e i binari principali di KDE 3 (<systemitem role="package">kdelibs</systemitem>) e Qt 3 sono ancora disponibili in Debian &release;. Purtroppo tali applicazioni potrebbero non essere ben integrate nel nuovo ambiente e inoltre KDE 3 e Qt 3 non avranno più alcuna forma di supporto nella prossima versione di Debian quindi, se si usano, si raccomanda di adattare i propri programmi alla nuova piattaforma.
ja: KDE 3 のデスクトップ環境はもうサポートされませんが、ユーザが個々の KDE 3 アプリケーションをインストールすることはまだ可能です。これは KDE 3 のコアとなるライブラリとバイナリ (<systemitem role="package">kdelibs</systemitem>) と Qt 3 がまだ Debian &release; で利用可能だからです。ですが、これらのアプリケーションは、新しい環境にうまく統合されていないことに注意しておいてください。さらに、KDE 3 と Qt 3 のどちらについても Debian の次期リリースではサポートされないので、これらを使っているのであれば、新しいプラットフォームへソフトウェアを移植することを強くお勧めします。
pt: Enquanto que o ambiente de trabalho baseado em KDE 3 já não é suportado, os utilizadores podem ainda instalar e usar algumas aplicações individuais do KDE 3, uma vez que os binários e bibliotecas base do KDE 3 (<systemitem role="package">kdelibs</systemitem>) e o Qt 3 estão ainda disponíveis no Debian &release;. No entanto, note que estas aplicações podem não estar bem integradas com o novo ambiente. Além disso, nem o KDE 3 nem o Qt 3 serão suportados sob qualquer forma no próximo lançamento Debian, portanto, se os estiver a usar, é fortemente aconselhado a migrar o software para a nova plataforma.

source: New KDE metapackages
it: Nuovi metapacchetti KDE
ja: 新しい KDE メタパッケージ
pt: Novos metapacotes KDE

source: As noted earlier, Debian &release; introduces a new set of KDE related metapackages:
it: Come già fatto notare, Debian &release; introduce un nuovo insieme di metapacchetti legati a KDE:
ja: 先に記したように、Debian &release; では新たな KDE 関連のメタパッケージ群が導入されます:
pt: Tal como já referido, o Debian &release; introduz um novo conjunto de metapacotes relacionados com o KDE:
