Repository: lurdan/trans-ddp
Catalog: release-notes/*/issues.po
Languages: be, de, fr, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sv, zh_tw

source: Users who require ACPI support on these systems may install a Linux 2.6.19 or later kernel. Please see Debian bug <ulink url="&url-bts;404143">#404143</ulink> and <ulink url="&url-bts;400488">#400488</ulink>, and Linux Kernel's bugs <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=5534">#5534</ulink> and <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=7122">#7122</ulink> for additional information.
be: Карыстальнікі, для якіх падтрымка ACPI на згаданых сістэмах прынцыпова неабходная, мусяць усталяваць ядро Linux версіі 2.6.19 альбо навейшае. Дадатковую інфармацыю можна знайсці ў паведамленнях аб памылках Debian (<ulink url="&url-bts;404143">#404143</ulink> ды <ulink url="&url-bts;400488">#400488</ulink>), а таксама ў паведамленнях аб памылках ядра Linux (<ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=5534">#5534</ulink> ды <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=7122">#7122</ulink>).
ja: これらのシステムで ACPI サポートが必要なユーザは、2.6.19 以降の Linux カーネルをインストールするとよいでしょう。さらに詳しい情報は、Debian のバグ <ulink url="&url-bts;404143">#404143</ulink> や <ulink url="&url-bts;400488">#400488</ulink>、そして Linux カーネルのバグ <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=5534">#5534</ulink> や <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=7122">#7122</ulink> を参照してください。
lt: Naudotojai, kuriems reikia ACPI palaikymo šiose sistemose, gali įdiegti Linux 2.6.19 arba naujesnį branduolį. Papildomos informacijos kalite rasti pranešime apie Debian'o riktus <ulink url="&url-bts;404143">#404143</ulink> ir <ulink url="&url-bts;400488">#400488</ulink>, ir Linux branduolio riktus <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=5534">#5534</ulink> ir <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=7122">#7122</ulink>.
nb: Bruker som trenger støtte for ACPI på slike laptoper, kan installere linux 2.6.19 eller nyere kjerne. Se Debian feilrapport <ulink url="&url-bts;404143">#404143</ulink> og <ulink url="&url-bts;400488">#400488</ulink>, og Linux kjerne feilrapporter <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=5534">#5534</ulink> og <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=7122">#7122</ulink> for mere informasjon.
pt: Os utilizadores que necessitarem de suporte ACPI nesses sistemas podem instalar um kernel 2.6.19 ou posterior. Para mais informação por favor veja o bug Debian <ulink url="&url-bts;404143">#404143</ulink> e o <ulink url="&url-bts;400488">#400488</ulink>, e os bugs do kernel Linux <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=5534">#5534</ulink>e <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=7122">#7122</ulink>.
ro: Utilizatorii care necesită suport ACPI pentru aceste sisteme pot install un nucleu Linux 2.6.19 sau ulterior. Vă rugăm vedeți raportul de eroare Debian bug <ulink url="&url-bts;404143">#404143</ulink> și <ulink url="&url-bts;400488">#400488</ulink>, și erorile nucleului Linux <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=5534">#5534</ulink> și <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=7122">#7122</ulink> pentru mai multe informații.
zh_tw: 在這些系統上有需要用到 ACPI 支援的使用者可以安裝 Linux 2.6.19 或更新版的 kernel。請參閱 Debian bug <ulink url="&url-bts;404143">#404143</ulink> 及 <ulink url="&url-bts;400488">#400488</ulink>，以及 Linux Kernel 的 bugs <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=5534">#5534</ulink> 及 <ulink url="http://bugzilla.kernel.org/show_bug.cgi?id=7122">#7122</ulink> 以取得更多詳盡資訊。

source: Kernel mode setting
ja: カーネルモードセッティング (Kernel mode setting)
pt: Definição do modo no Kernel

source: Sometimes, changes have side-effects we cannot reasonably avoid, or we expose bugs somewhere else. We document here the issues we are aware of. Please also read the errata, the relevant packages' documentation, bug reports and other information mentioned in <xref linkend="morereading"/>.
be: Часам змены выклікаюць дадатковыя эфекты, якіх мы не можам пазбегнуць, не справакаваўшы ўзнікнення памылак дзесці яшчэ. Гэтая глава утрымлівае апісанне вядомых праблем. Калі ласка, прачытайце таксама старонкі <quote>працы над памылкамі</quote>, дакументацыю адпаведных пакетаў, паведамленні аб памылках і іншую інфармацыю, што рэкамендуецца ў <xref linkend="morereading"/>.
nb: Noen ganger så vil endringer ha uønskede sideeffekter, eller de vil avdekke feil andre steder. Vi dokumenterer her alle slike problem som vi kjenner til. Vennligst les avsnittet om skrivefeil, dokumentasjon for den aktuelle pakken, feilrapporter og annen informasjon nevnt i <xref linkend="morereading"/>.
zh_tw: 有時，更動會產生一些我們無法有效避免的副作用，或者是會導致我們在其它地方遇到錯誤。我們在此記述了一些我們所知道的問題。請同時參閱勘誤表、相關套件之說明文件、錯誤回報及其它在 <xref linkend="morereading"/> 中所提及的資訊。

source: Some applications may no longer work with a 2.4 kernel
be: Пэўныя праграмы могуць больш не працаваць з ядром версіі 2.4
nb: Noen program vil ikke fungere med kjerne 2.4
zh_tw: 有些應用程式可能再也無法和 2.4 版的 kernel 搭配使用

source: Some applications in &releasename; may no longer work with a 2.4 kernel, for example because they require <literal>epoll()</literal> support, which is not available in 2.4 kernels. Such applications may either not work at all or not work correctly until the system has been rebooted with a 2.6 kernel.
be: Пэўныя праграмы ў "&releasename;" могуць больш не працаваць з ядром серыі 2.4 (напрыклад, з-за патрабавання падтрымкі функцыі <literal>epoll()</literal>, якая немагчымая ў ядрах гэтай серыі). Такія праграмы могуць альбо не працаваць увогуле, альбо працаваць некарэктна да таго часу, пакуль сістэма не будзе загружаная з ядром версіі 2.6.
nb: Noen program som følger med &releasename; vil ikke virke med kjerne 2.4, ofte fordi de krever <literal>epoll()</literal> støtte, som ikke er tilgjengelig i kjerne 2.4. Slike program vil enten bare delvis virke, eller ikke virke i det hele tatt før systemet har blitt starter med en 2.6 kjerne.
zh_tw: 有些在 &releasename; 裡的應用程式已無法和 2.4 版的 kernel 搭配使用。比如說，因為它們需要 <literal>epoll()</literal> 的支援，而這是 2.4 版的 kernel 所無法提供的。這類應用程式可能無法正常運作甚至完全無法動作，直到系統以 2.6 版的 kernel 重新開機。

source: One example is the HTTP proxy <systemitem role="package">squid</systemitem>.
be: Яскравым прыкладам з'яўляецца HTTP-проксі <systemitem role="package">squid</systemitem>.
nb: Et slikt eksempel er HTTP proxy <systemitem role="package">squid</systemitem>.
zh_tw: 像是 HTTP Proxy <systemitem role="package">squid</systemitem> 就是例子之一。

source: Upgrading to a 2.6 kernel
be: Абнаўленне ядра да версіі 2.6
nb: Oppgradere til en 2.6 kjerne
zh_tw: 將 Kernel 升級至 2.6

source: TODO: This section can be removed for lenny!
nb: Husk: Dette avsnittet kan fjernes for Lenny!

source: The 2.6 kernel series contains major changes from the 2.4 series. Modules have been renamed and a lot of drivers have been partially or sometimes almost completely rewritten. Upgrading to a 2.6 kernel from an earlier version is therefore not a process to be undertaken lightly. This section aims to make you aware of some of the issues you may face.
be: Ядры серыі 2.6 значна адрозніваюцца ад серыі 2.4. Шмат якія модулі змянілі назвы, а вялікая колькасць драйвераў была перапісаная цалкам ці часткова.Адпаведна, абнаўленне да ядра версіі 2.6 з папярэдніх версіяў не заўжды адбываецца бесклапотна. Гэтая секцыя папярэджвае аб некаторых праблемах, якія могуць узнікнуць.
nb: Versjonsserien 2.6 av Linuxkjernen inneholder mange store nyheter og forandringer sammenlignet med 2.4 serien. Mange moduler har fått nytt navn, og mange drivere har blitt helt eller delvis omskrevet. Å oppgradere til 2.6 serien fra en tidligere serie er ikke en triviell prosess. Dette avsnittet vil ta opp noen av problemene du kan komme til å støte på.
zh_tw: 和 2.4 系列的 Kernel 相較，2.6 系列包含了很多重大的改變。像是模組的名稱已經有所不同， 有不少的驅動程式被局部甚至是完全改寫。所以要把一些舊有版本的 Kernel 升級至 2.6 並不會是件容易事。這段章節的目的就是要讓您知道一些您可能會遇到的問題。

source: If you compile your own kernel from source, make sure you install <systemitem role="package">module-init-tools</systemitem> before you reboot with the 2.6 kernel. This package replaces <systemitem role="package">modutils</systemitem> for 2.6 kernels. If you install one of the Debian <systemitem role="package">linux-image</systemitem> packages, this package will be installed automatically because of dependencies.
be: Калі вы збіраеце ядро самастойна, да перазагрузкі сістэмы абавязкова трэба пераканацца, што ў сістэме ўсталяваны пакет <systemitem role="package">module-init-tools</systemitem>, які замяняе <systemitem role="package">modutils</systemitem> для ядраў версіі 2.6. Калі ў сістэме ўсталяваны адзін з пакетаў <systemitem role="package">linux-image</systemitem>, згаданы пакет будзе ўсталяваны аўтаматычна падчас развязання залежнасцяў.
nb: Hvis du bygger dine egne kjerner fra kildekode, så pass på å installere <systemitem role="package">module-init-tools</systemitem> før du rebooter med 2.6-kjernen. Denne pakken erstatter <systemitem role="package">modutils</systemitem> for 2.6-kjerner. Hvis du installerer en av Debian sine <systemitem role="package">linux-image</systemitem> pakker, så vil denne bli installert automatisk.
zh_tw: 如果您是自行由原始程式碼來編譯 Kernel 的，請在使用 2.6 Kernel 來重新開機前確認您已安裝了 <systemitem role="package">module-init-tools</systemitem>。這個套件在 2.6 的 Kernel 裡是用來取代 <systemitem role="package">modutils</systemitem> 的。如果您安裝了任何的 <systemitem role="package">linux-image</systemitem> 套件，這個套件會因相依上的因素而被自動地安裝上去。

source: If you use <emphasis><acronym>LVM</acronym></emphasis>, you should also install <systemitem role="package">lvm2</systemitem> before you reboot as the 2.6 kernel does not directly support LVM1. To access LVM1 volumes, the compatibility layer of <systemitem role="package">lvm2</systemitem> (the dm-mod module) is used. You can leave <systemitem role="package">lvm10</systemitem> installed; the init scripts will detect which kernel is used and execute the appropriate version.
be: Калі ў сістэме ўжываецца <emphasis><acronym>LVM</acronym></emphasis>, да перазагрузкі таксама трэба ўсталяваць пакет <systemitem role="package">lvm2</systemitem>, бо ядры серыі 2.6 не падтрымліваюць LVM1 непасрэдна. Доступ да тамоў LVM1 ажыццяўляецца пры дапамозе праслойкі сумяшчальнасці <systemitem role="package">lvm2</systemitem> (модуль dm-mod). Пры гэтым няма патрэбы выдаляць усталяваны пакет <systemitem role="package">lvm10</systemitem>; скрыпты ініцыялізацыі здольныя запусціць патрэбную версію у залежнасці ад таго, якое ядро загружаецца.
nb: Hvis du bruker <emphasis><acronym>LVM</acronym></emphasis>, så må du også installere <systemitem role="package">lvm2</systemitem> før du rebooter, fordi 2.6-kjernen ikke direkte har støtte for LVM1. For å få tilgang til LVM1-volumer, så brukes kompatibilitetsstøtten i <systemitem role="package">lvm2</systemitem> (der er dm-mod module som brukes). Du kan la pakken <systemitem role="package">lvm10</systemitem> være installert, init-skriptene vet hvilken kjerne som brukes, og de bruker da automatisk riktig versjon.
zh_tw: 如果您使用了 <emphasis><acronym>LVM</acronym></emphasis>，請在重新開機前確認您已安裝了 <systemitem role="package">lvm2</systemitem>，因為 2.6 的 Kernel 並不直接支援 LVM1，而是使用相容的 <systemitem role="package">lvm2</systemitem>（dm-mod 模組）來存取 LVM1 的 volumes。您還是可以保留已安裝了的 <systemitem role="package">lvm10</systemitem>；而進行初始化的 Script 將會進行偵測並依所使用的 Kernel 的不同而自動載入適當的版本。

source: If you have entries in the <filename>/etc/modules</filename> file (the list of modules to be loaded during system boot), be aware that some module names may have changed. If this happens you will have to update this file with the new module names.
be: Калі Вы дадавалі запісы ў файл наладак <filename>/etc/modules</filename> (спіс модуляў, якія трэба загружаць падчас запуску сістэмы), майце на ўвазе, што назвы пэўных модуляў маглі змяніцца. У гэтым выпадку неабходна выправіць згаданы файл, каб абнавіць назвы модуляў.
nb: Hvis du laster noen moduler via fila <filename>/etc/modules</filename>, så vær oppmerksom på at noen moduler kan ha fått nytt navn, du må kanskje oppdatere navnene på moduler du laster her.
zh_tw: 如果您在 <filename>/etc/modules</filename> 檔案（在系統開機時所要載入的模組列表）有自行加入的項目的話，請您要記得有些模組的名稱已經有所改變，如果真的如此，您必須修改這個檔案並使用新的模組名稱。

source: For some <acronym>SATA</acronym> disk controllers, the device assigned to a drive and its partitions may change from <filename>/dev/hdX</filename> to <filename>/dev/sdX</filename>. If this happens, you will have to modify your <filename>/etc/fstab</filename> and bootloader configuration accordingly. Unless these changes are made correctly, your system may not boot correctly<footnote>
be: Назвы прыладаў, якія прызначаюцца дыску і ягоным падзелам, могуць змяніцца з <filename>/dev/hdX</filename> на <filename>/dev/sdX</filename> для пэўных дыскавых кантролераў сямейства <acronym>SATA</acronym>. Калі такое адбылося, неабходна адпаведным чынам змяніць наладкі <filename>/etc/fstab</filename> і сістэмнага загрузчыка, інакш сістэма можа не загрузіцца карэктна. <footnote>
nb: Noen kontrollenheter for <acronym>SATA</acronym>-disker kan få en annen enhetsbokstav og partisjonsnavn, de kan bli endret fra <filename>/dev/hdX</filename> til<filename>/dev/sdX</filename>. Hvis dette skjer deg, så må du endre tilsvarende i <filename>/etc/fstab</filename> og i oppstartshåndtereren, ellers vil ikke ditt system starte opp korrekt<footnote>

source: It will boot the kernel but will fail when trying to mount the root file system and will abort with an error <emphasis>waiting for root file system</emphasis> followed by <emphasis>unable to mount /dev/hdX ..not found</emphasis>. You can use the <literal>initramfs</literal> shell to fix this issue, after you identify the newly assigned device names in the kernel boot messages or by reviewing the contents of <filename>/dev/disk/</filename>.
be: Ядро загрузіцца, але прымацаваць каранёвую файлавую сістэму не атрымаецца, у выніку чаго пасля паведамлення <emphasis>чаканне каранёвай файлавай сістэмы (waiting for root file system)</emphasis> будзе адлюстравана паведамленне аб памылцы <emphasis>немагчыма прымацаваць /dev/hdX ... прылада не знойдзена (unable to mount /dev/hdX ..not found)</emphasis>. Каб выправіць становішча, можна скарыстацца абалонкай <literal>initramfs</literal>, спачатку высветліўшы новыя назвы прыладаў (зрабіць гэта можна, праглядзеўшы паведамленні ядра падчас загрузкі альбо змесціва дырэкторыі <filename>/dev/disk</filename>).
nb: Kjernen kommer til å lastes, men oppstartsprosessen kommer til å feile og avslutte med feilmeldingen: <emphasis>waiting for root file system</emphasis>, etterfulgt av <emphasis>unable to mount /dev/hdX ..not found</emphasis>. Du kan bruke skallet til <literal>initramfs</literal> for å rette opp feilen etter at du har funnet ut hvilke enhetsnavn du skal bruke, disse finner du enten i oppstartemeldingen, eller ved å lete i <filename>/dev/disk/</filename>.

source: Once you have installed your 2.6 kernel, but before you reboot, make sure you have a recovery method. First, make sure that the bootloader configuration has entries for both the new kernel and the old, working 2.4 kernel. You should also ensure you have a <quote>rescue</quote> floppy or CD-ROM to hand, in case misconfiguration of the bootloader prevents you from booting the old kernel.
be: Перад тым, як перазагружаць сістэму пасля ўсталявання ядра 2.6, пераканайцеся, што існуе магчымасць аднаўлення у выпадку збояў. Рерш за ўсё трэба ўпэўніцца, што файл наладак загрузчыка мае запісы не толькі для новага ядра, але і для старога працуючага ядра версіі 2.4. Таксама варта пераканацца, што ў Вас пад рукой ёсць <quote>выратавальныя</quote> дыскета або кампакт-дыск на выпадак, калі некарэктныя наладкі загрузчыка не дазволяць загрузіць старое ядро.
nb: Når du har installert din 2.6-kjerne, men før du starter systemet omigjen, så bør du være sikker på at du har en alternativ måte å starte opp ditt system. Først og fremst bør du kontrollere at din oppstartslaster kan håndtere både den nye 2.6- og den gamle 2.4-kjernen. Du bør også ha en <quote>rescue</quote> diskett eller cd tilgjengelig, i tilfellet din oppstartslaster ikke klarer å starte med den gamle kjernen.

source: Keyboard configuration
be: Наладка клавіятуры
nb: Tastaturinnstillinger
zh_tw: 鍵盤的設定

source: The most invasive change in the 2.6 kernels is a fundamental change of the input layer. This change makes all keyboards look like <quote>normal</quote> PC keyboards. This means that if you currently have a different type of keyboard selected (e.g. a USB-MAC or Sun keyboard), you will very likely end up with a non-working keyboard after rebooting with the new 2.6 kernel.
be: Найбольш значныя змены ў ядрах версіі 2.6 датычацца падсістэмы ўводу. Зараз усе тыпы клавіятур апрацоўваюцца як <quote>звычайныя</quote> PC-клавіятуры. Калі пазначаны іншы тып клавіятуры (напрыклад USB-MAC або Sun), хутчэй за ўсё вынікам стане адключэнне клавіятуры пасля перазагрузкі з новым ядром версіі 2.6.
nb: Den største endringen i 2.6-kjernene er endringene i input-laget. Denne endringe gjør at alle tastaturer ser ut som <quote>normal</quote> PC tastaturer. Dette betyr at hvis du nå bruker en annen type tastatur enn PC (feks USB-MAC eller Sun tastatur) så vil du sannsynligvis oppleve at ditt tastatur slutter å virke når du starter opp med en 2.6-kjerne.

source: If you can SSH into the box from another system, you can resolve this issue by running <literal>dpkg-reconfigure console-data</literal>, choosing the option <quote>Select keymap from full list</quote> and selecting a <quote>pc</quote> keyboard.
be: Калі ёсць магчымасць дыстанцыйнага доступу праз SSH з іншай сістэмы, праблему можна выправіць з дапамогай каманды <literal>dpkg-reconfigure console-data</literal>, абраўшы пункт <quote>Абраць раскладку з поўнага спісу </quote>, і пазначыўшы варыянт клавіятуры <quote>pc</quote>.
nb: Hvis du kan bruke SSH fra et annet system, så kan du løse dette problemet ved å bruke <literal>dpkg-reconfigure console-data</literal>, og der velge <quote>Select keymap from full list</quote> og så velge <quote>pc</quote>.

source: If your console keyboard is affected, you will probably also need to reconfigure your keyboard for the X Window System. You can do this either by running <literal>dpkg-reconfigure xserver-xorg</literal> or by editing <filename>/etc/X11/xorg.conf</filename> directly. Don't forget to read the documentation referred to in <xref linkend="nownownow"/>.
be: Калі праблема закранула наладкі клавіятуры ў кансолі, хутчэй за ўсё, давядзецца наладжваць і клавіятуру ў графічнай сістэме X Window. Зрабіць гэта можна, запусціўшы каманду <literal>dpkg-reconfigure xserver-xorg</literal> або непасрэдна выправіўшы файл <filename>/etc/X11/xorg.conf</filename>. Не забудзьцеся прачытаць дакументацыю, якая ўзгаданая ў <xref linkend="nownownow"/>.
nb: Hvis ditt tastatur slutter å virke i konsollmodus, så må sannsynligvis også oppdatere ditt X vindusystem. Du kan gjøre det enten ved å kjøre <literal>dpkg-reconfigure xserver-xorg</literal> eller ved å redigere <filename>/etc/X11/xorg.conf</filename> direkte. Ikke glem å lese dokumentasjonen i <xref linkend="nownownow"/>.

source: This issue is unlikely to affect the &arch-title; architecture as all PS/2 and most <acronym>USB</acronym> keyboards will already be configured as a <quote>normal</quote> PC keyboard.
be: Гэтая праблема хутчэй за ўсё не закране архітэктуры &arch-title;, таму што ўсе клавіятуры тыпу PS/2 і большасць клавіятур тыпу <acronym>USB</acronym> будуць загадзя наладжаны як <quote>звычайная</quote> PC-клавіятура.
nb: Dette problemet kommer trolig ikke å oppstå for &arch-title; ettersom alla PS/2 og de fleste <acronym>USB</acronym>-tastatur allerede er markert som <quote>normale</quote> PC-tastatur.

source: Note that if you are using a <acronym>USB</acronym> keyboard, this may be configured as either a <quote>normal</quote> PC keyboard or as a USB-MAC keyboard. In the first case you will not be affected by this issue.
be: Пры выкарыстанні <acronym>USB</acronym>-клавіятуры варта мець на ўвазе, што яна можа быць наладжаная або ў рэжыме <quote>звычайнай</quote> PC-клавіятуры або ў рэжыме USB-MAC. У першым выпадку праблем не ўзнікне.
nb: Merk at hvis du bruker et <acronym>USB</acronym> tastatur, så er det konfigurert enten som et <quote>normalt</quote> PC tastatur, eller som et USB-MAC tastatur, i det første tilfellet så gjelder ikke dette problemet deg.

source: Mouse configuration
be: Наладка мышы
nb: Musinnstillinger
zh_tw: 滑鼠的設定

source: Again because of the changes in the input layer, you may have to reconfigure the X Window System and <systemitem role="package">gpm</systemitem> if your mouse is not working after upgrading to a 2.6 kernel. The most likely cause is that the device which gets the data from the mouse has changed. You may also need to load different modules.
be: Дзякуючы раней згаданым зменам у падсістэме ўводу, можа спатрэбіцца пераналадка графічнай сістэмы X Window і <systemitem role="package">gpm</systemitem>, калі пасля абнаўлення да ядра версіі 2.6 перастае працаваць мыш. Найбольш верагоднай прычынай такой праблемы з'яўляецца змена назвы файла прылады, праз які сістэма атрымлівае інфармацыю ад мышы. Таксама можа спатрэбіцца загрузка дадатковых модуляў.
nb: Også på grunn av endringene i input-laget, så kan det hende at du også må endre på instilingene for X vindusystemet og på <systemitem role="package">gpm</systemitem> om din mus slutter å virke etter oppgraderingen til en 2.6-kjerne. Den mest sannsynlige årsaken er at enheten som musa henter sine data fra har byttet navn. Det kan også hende at du må laste noen andre drivere.
zh_tw: 再一次地，因為輸入層的改變，如果您在升級至 2.6 的 kernel 後滑鼠無法正常運作的話，您也許得要重新設定 X Window System 及 <systemitem role="package">gpm</systemitem> 才行。這大多是因為負責讀取滑鼠資料的裝置已經改變了，您也許還得載入其它額外的模組。

source: Sound configuration
be: Наладка гуку
nb: Lydkortinnstillinger
zh_tw: 設定聲音

source: TODO: Do we still need this for lenny?
nb: Husk: Trenger vi fremdeles dette for Lenny?
