Repository: lurdan/trans-ddp
Catalog: release-notes/*/issues.po
Languages: be, de, fr, it, ja, lt, nb, pl, pt, pt_br, ro, ru, sv, zh_tw

source: For the 2.6 kernel series the <acronym>ALSA</acronym> sound drivers are recommended over the older <acronym>OSS</acronym> sound drivers. <acronym>ALSA</acronym> sound drivers are provided as modules by default. In order for sound to work, the <acronym>ALSA</acronym> modules appropriate for your sound hardware need to be loaded. In general this will happen automatically if you have, in addition to the <systemitem role="package">alsa-base</systemitem> package, the <systemitem role="package">discover</systemitem> package installed. The <systemitem role="package">alsa-base</systemitem> package also <quote>blacklists</quote> <acronym>OSS</acronym> modules to prevent <command>discover</command> from loading them. If you have <acronym>OSS</acronym> modules listed in <filename>/etc/modules</filename>, you should remove them.
be: Для ядраў серыі 2.6 рэкамедавана ўжываць драйверы сістэмы <acronym>ALSA</acronym> замест старых драйвераў <acronym>OSS</acronym>. Гукавыя драйверы <acronym>ALSA</acronym> звычайна распаўсюджваюцца ў выглядзе модуляў ядра. Для карэктнай працы гуку трэба, каб у сістэме былі загружаныя модулі, што адпавядаюць наяўнаму абсталяванню. Такая загрузка адбываецца аўтаматычна, калі ў дадатак да пакету <systemitem role="package">alsa-base</systemitem> у сістэме ўсталяваны пакет <systemitem role="package">discover</systemitem>. Апрэч гэтага пакет <systemitem role="package">alsa-base</systemitem> заносіць модулі <acronym>OSS</acronym> у <quote>чорны спіс</quote>, каб пазбегнуць іх загрузкі праз <command>discover</command>. Калі модулі <acronym>OSS</acronym> пералічаныя ў файле наладак <filename>/etc/modules</filename>, трэба самастойна выдаліць адпаведныя радкі.
nb: I versjon 2.6-kjernen er lyddriverrutinen <acronym>ALSA</acronym> å foretrekke fremfor den eldre lyddriverrutinen <acronym>OSS</acronym>. Lyddriverrutinen <acronym>ALSA</acronym> leveres som moduler i i et standardoppsett. For at lydkortet skal virke, så må <acronym>ALSA</acronym>-modulen for ditt lydkort lastes. Dette skjer vanligvis automatisk om du i tillegg til pakken <systemitem role="package">alsa-base</systemitem> også har pakken <systemitem role="package">discover</systemitem> installert.Pakken <systemitem role="package">alsa-base</systemitem> kommer dessuten til å <quote>svarteliste</quote> modulene fra OSS for for å forhindre <command>discover</command> fra å laste dem. Om du har OSS-moduler i <filename>/etc/modules</filename> så må du fjerne dem derifra.

source: <acronym>NFS</acronym> mounts now handled by nfs-common
be: Мацаванне сеткавых рэсурсаў <acronym>NFS</acronym> зараз забяспечваецца nfs-common
nb: <acronym>NFS</acronym> monteringer håndters nå av nfs-common
zh_tw: <acronym>NFS</acronym> 的掛載現已由 nfs-common 掌控

source: Since <systemitem role="package">util-linux</systemitem> 2.13 <acronym>NFS</acronym> mounts are no longer handled by <systemitem role="package">util-linux</systemitem> itself, but by <systemitem role="package">nfs-common</systemitem>. Since not all systems mount <acronym>NFS</acronym> shares and to avoid a standard portmapper installation <systemitem role="package">util-linux</systemitem> only suggests <systemitem role="package">nfs-common</systemitem>. If you need to mount <acronym>NFS</acronym> shares, make sure <systemitem role="package">nfs-common</systemitem> is installed on your system. The preinstallation script of the <systemitem role="package">mount</systemitem> package checks whether <acronym>NFS</acronym> mounts exist and aborts if <filename>/usr/sbin/mount.nfs</filename> from <systemitem role="package">nfs-common</systemitem> is not present or if <systemitem role="package">nfs-common</systemitem> is out-of-date. Either upgrade <systemitem role="package">nfs-common</systemitem> or unmount any <acronym>NFS</acronym> mounts prior to upgrading <systemitem role="package">mount</systemitem>.
be: Пачынаючы з версіі 2.13 пакету <systemitem role="package">util-linux</systemitem>, мацаванне файлавых сістэм праз сеціва (<acronym>NFS</acronym>) забяспечваецца асобным пакетам <systemitem role="package">nfs-common</systemitem> замест <systemitem role="package">util-linux</systemitem>. З улікам таго, што не ва ўсіх сістэмах ёсць патрэба ў мацаванні рэсурсаў <acronym>NFS</acronym>, а таксама каб пазбегнуць усталявання стандартнага пераўтваральніка партоў (portmapper), пакет <systemitem role="package">util-linux</systemitem> толькі прапануе ўсталяваць <systemitem role="package">nfs-common</systemitem>, але не патрабуе яго наяўнасці. Калі ў Вашым выпадку прымацаванне сеціўных рэсурсаў праз <acronym>NFS</acronym> неабходнае, пераканайцеся, што ў сістэме ўсталяваны пакет <systemitem role="package">nfs-common</systemitem>. Падрыхтоўчы скрыпт усталявання пакета <systemitem role="package">mount</systemitem> правярае наяўнасць прымацаваных рэсурсаў <acronym>NFS</acronym> і адмаўляецца ад працягу працы, калі файл <filename>/usr/sbin/mount.nfs</filename> з пакета <systemitem role="package">nfs-common</systemitem> адсутнічае альбо састарэў. Адпаведна, перад абнаўленнем пакета <systemitem role="package">mount</systemitem> трэба спачатку абнавіць <systemitem role="package">nfs-common</systemitem> альбо адмацаваць усе рэсурсы <acronym>NFS</acronym>.
nb: Fra og med versjon 2.13 av <systemitem role="package">util-linux</systemitem> så håndteres ikke lenger <acronym>NFS</acronym>-monteringer av <systemitem role="package">util-linux</systemitem>, men av <systemitem role="package">nfs-common</systemitem>. Fordi ikke alle systemer har <acronym>NFS</acronym>-monteringer, og for å unngå at portmap installeres unødig, så bare anbefaler pakken <systemitem role="package">util-linux</systemitem> at pakken <systemitem role="package">nfs-common</systemitem> skal installeres. Hvis du trenger å montere <acronym>NFS</acronym>-monteringer, så pass på at du har pakken <systemitem role="package">nfs-common</systemitem> installert. Installasjonsskriptet til pakken <systemitem role="package">mount</systemitem> sjekker hvorvidt <acronym>NFS</acronym>-monteringer finnes, og avbryter hvis fila <filename>/usr/sbin/mount.nfs</filename> fra <systemitem role="package">nfs-common</systemitem> ikke er tilstede, eller hvis pakken <systemitem role="package">nfs-common</systemitem> er utdatert. Enten så må du oppgradere <systemitem role="package">nfs-common</systemitem> eller avmontere alle <acronym>NFS</acronym>-monteringer før du oppgraderer pakken <systemitem role="package">mount</systemitem>.

source: Change of Romanian (ro) keyboard layout
be: Змена румынскай(ro) раскладкі клавіятуры
nb: Endringer i rumensk(ro) tastaturoppsett
zh_tw: 羅馬尼亞 (ro) 鍵盤排列方式的改變

source: Because of the upgrade to <systemitem role="package">xkb-data</systemitem> version 1.3 in &releasename; the default variant for Romanian (ro) layout is now producing the correct șț characters (comma below) instead of şţ (cedilla below). Also some of the variants have been renamed. The old variant names still work, but users are encouraged to update their <filename>/etc/X11/xorg.conf</filename>. More info as well as possible side effects due to this change are available in the <ulink url="http://wiki.debian.org/L10N/Romanian/Lenny/Notes"> wiki (Romanian language only)</ulink>.
be: Дзякуючы таму, што ў выпуску &releasename; пакет <systemitem role="package">xkb-data</systemitem> абноўлены да версіі 1.3, у стандартным варыянце румынскай раскладкі зараз выкарыстоўваюцца правільныя сімвалы șț (з коскай унізе) замест şţ (з цэдыллю ўнізе). Таксама были перайменаваныя некаторыя варыянты наладкі. Старыя имёны варыянтаў таксама працуюць, але карыстальнікам лепей абнавіць файл <filename>/etc/X11/xorg.conf</filename>. Больш інфармацыі аб гэтым абнаўленні, а таксама аб магчымых дадатковых эфектах можна атрымаць на адпаведнай <ulink url="http://wiki.debian.org/L10N/Romanian/Lenny/Notes">wiki-старонцы</ulink> (румынскаю мовай).
nb: På grunn av oppgraderingen av <systemitem role="package">xkb-data</systemitem> til versjon 1.3 i &releasename; så vil standard rumensk (ro) tastatur oppsett nå lage det korrekte tegnet șț (med komma under) istedenfor şţ (med cedilj under). Noen konfigurasjonsvarianter har fått nytt navn, selv om de gamle navnene fortsatt virker, så oppfordres det å oppdatere <filename>/etc/X11/xorg.conf</filename> med de nye navnene. Mer info om mulig problem på grunn av denne endringen finnes på <ulink url="http://wiki.debian.org/L10N/Romanian/Lenny/Notes"> wiki (kun på rumensk)</ulink>.
zh_tw: 因為在 &releasename; 裡 <systemitem role="package">xkb-data</systemitem> 會升級至 1.3 版，它的羅馬尼亞 (ro) 衍生的排列方式預設會修正 șț 字元（其下為逗號），並以 şţ（其下為變音符號）取代。而有些衍生的排列方式的名字也因而改變了。舊有的排列方式的名稱依然可用，但建議使用者能更新它們的 <filename>/etc/X11/xorg.conf</filename>。可以在 <ulink url="http://wiki.debian.org/L10N/Romanian/Lenny/Notes"> wiki (Romanian language only)</ulink> 取得更多的資訊以及這個改變可能造成的影響。

source: Security status of Mozilla products
be: Статус бяспекі прадуктаў Mozilla
nb: Sikkerhetsstatus for Mozillaprodukter
zh_tw: Mozilla 家族的安全狀態

source: <indexterm><primary>Mozilla</primary></indexterm> The Mozilla programs <systemitem role="package">firefox</systemitem>, <systemitem role="package">thunderbird</systemitem>, and <systemitem role="package">sunbird</systemitem> (rebranded in Debian to <systemitem role="package">iceweasel</systemitem>, <systemitem role="package">icedove</systemitem>, and <systemitem role="package">iceowl</systemitem>, respectively), are important tools for many users. Unfortunately the upstream security policy is to urge users to update to new upstream versions, which conflicts with Debian's policy of not shipping large functional changes in security updates. We cannot predict it today, but during the lifetime of &releasename; the Debian Security Team may come to a point where supporting Mozilla products is no longer feasible and announce the end of security support for Mozilla products. You should take this into account when deploying Mozilla and consider alternatives available in Debian if the absence of security support would pose a problem for you.
be: <indexterm><primary>Mozilla</primary></indexterm>Такія праграмы Mozilla, як <systemitem role="package">firefox</systemitem>, <systemitem role="package">thunderbird</systemitem> ды <systemitem role="package">sunbird</systemitem> (назвы ў Debian адпаведна змененыя на <systemitem role="package">iceweasel</systemitem>, <systemitem role="package">icedove</systemitem> ды <systemitem role="package">iceowl</systemitem>), для вялікай колькасці карыстальнікаў з'яўляюцца важнымі працоўнымі прыладамі. На жаль, палітыка распрацоўшчыкаў асноўнай галіны гэтых прадуктаў у дачыненні бяспекі патрабуе ад карыстальнікаў усталёўваць найноўшыя версіі. Такое патрабаванне наўпрост супярэчыць палітыцы Debian, паводле якой абнаўленні бяспекі не мусяць утрымліваць істотных зменаў функцыянальнасці. Зараз немагчыма прадказаць гэта дакладна, але цягам жыццёвага цыклу &releasename; Каманда Бяспекі Debian можа прыйсці да высновы аб немагчымасці далейшай падтрымкі прадуктаў Mozilla і абвесціць аб спыненні выпуску абнаўленняў бяспекі для іх. Падчас разгортвання прадуктаў Mozilla такую магчымасць варта прыняць да ўвагі і разгледзець магчымыя даступныя ў Debian альтэрнатывы, калі адсутнасць абнаўленняў бяспекі з'яўляецца праблемай.
nb: <indexterm><primary>Mozilla</primary></indexterm> Mozillaprogrammene <systemitem role="package">firefox</systemitem>, <systemitem role="package">thunderbird</systemitem>, og <systemitem role="package">sunbird</systemitem> (som har fått andre navn i Debian, henholdsvis<systemitem role="package">iceweasel</systemitem>, <systemitem role="package">icedove</systemitem>, og <systemitem role="package">iceowl</systemitem>, ) er viktige for mange brukere. Dessverre så er hovedforfatterenes holdning angående sikkerhetsoppdateringer at brukerene hele tiden skal oppgradere til siste versjon av disse produktene, denne holdningen er ikke forenelig med Debian sine regler for sikkerhetsoppdateringer, som sier at man ikke skal blande sammen sikkerthetsoppgraderinger sammen med større funksjonsendringer i programvaren. Vi kan ikke si med sikkerhet i dag, men det kan komme til å skje i løpet av levetiden til &releasename; at Debian Security Team kommer til den konklusjon at det ikke lenger er mulig å tilby sikkerhetsoppgraderinger for Mozilla produktene. Du bør ta høyde for dette når du implementerer bruken av disse Mozilla produktene, og vurdere andre alternativer som er tilgjengelige i Debian, om du er opptatt av å kunne ha sikkerhetsoppgraderinger.

source: <systemitem role="package">iceape</systemitem>, the unbranded version of the <systemitem role="package">seamonkey</systemitem> internet suite has been removed from &releasename; (with the exception of a few internal library packages).
be: пакет <systemitem role="package">iceape</systemitem>, які ўяўляў сабой пазбаўлены брэндаў варыянт набору інтэрнэт-праграм <systemitem role="package">seamonkey</systemitem>, выдалены з &releasename; (за выключэннем некаторых унутраных бібліятэк).
nb: <systemitem role="package">iceape</systemitem>, versjonen av <systemitem role="package">seamonkey</systemitem> uten varemerker, har blitt tatt ut av &releasename; (med unntak av noen nødvendige bibliotketspakker).

source: There are no huge changes in the KDE Desktop Enviroment from the version shipped in etch. Lenny ships an updated translation and service release of KDE 3.5 that is a mixture of 3.5.9 and 3.5.10. Some modules are labeled as version 3.5.9, but have been updated and include most of the same changes found in 3.5.10. Overall, lenny ships 3.5.10 without the kicker improvements shipped in kdebase and some bug fixes in kdepim.
be: У працоўным асяродку KDE няма значных зменаў у параўнанні з версіяй, якая ўваходзіла ў склад etch. У склад lenny ўвайшлі абноўленыя пераклады і службовы выпуск KDE 3.5, які з'яўляецца сумессю выпускаў 3.5.9 і 3.5.10. Пэўныя модулі пазначаныя як прыналежныя да 3.5.9, але яны былі абноўленыя і ўтрымліваюць большасць зменаў з 3.5.10. Збольшага, у lenny ўваходзіць версія 3.5.10 за выняткам паляпшэнняў kicker з kdebase і некаторых выпраўленняў памылак у kdepim.
nb: Det er ikke noen større endringer i skrivebordsmiljøet KDE. Lenny inneholder en serviceversjon av KDE, som blant annet inneholder oppdaterte oversettelser, versjonen er en blanding av KDE 3.5.9 og KDE 3.5.10. Noen moduler er merket som versjon 3.5.9, men de har endringer inkludert for å passe sammen med versjon 3.5.10. I all hovedsak så er det versjon 3.5.10 som følger med Lenny, men uten endringene i kdebase for kicker, og noen feilfikser i kdepim.

source: Lenny will be the last stable release including a KDE 3 series environment.
be: Lenny будзе апошнім стабільным выпускам, які ўтрымлівае асяродак KDE 3-й серыі.
nb: Lenny kommer til å være den siste stabile utgaven som inneholder KDE3.

source: TODO: Remove the next three paragraphs for lenny?
nb: Husk: ta bort de 3 neste avsnittene for lenny?

source: If you used the GNOME desktop in &oldreleasename; you will not benefit from some of the changes introduced in the default configuration in Debian for &releasename;. In some extreme cases the GNOME desktop might not properly handle your old configuration and might not behave properly.
be: Калі ў сістэме ўжо выкарыстоўваецца асяродак GNOME з &oldreleasename;, у Вас не атрымаецца скарыстацца некаторымі паляпшэннямі, ўнесенымі ў стандартныя наладкі для выпуску Debian &releasename;. У пэўных надзвычайных выпадках асяродак GNOME можа не здолець належным чынам адпрацаваць старыя наладкі і ў выніку пачаць працаваць некарэктна.
nb: Hvis du brukte GNOME skrivebordsmiljøet i &oldreleasename; så vil du ikke nyte godt av mange av de endringene som ble introdusert som standard i Debian i &releasename;. I noen helt ekstreme tilfeller så vil ikke GNOME skrivebordet fungere korrekt lenger på grunn av dine gamle instillinger.
zh_tw: 如果您使用著 &oldreleasename; 所搭載的 GNOME 桌面環境，您將無法在 Debian 裡一些建議使用的預設設定的改變上得到助益。在一些極端的例子裡，GNOME 桌面環境可能無法正確得使用您舊有的設定，且可能無法適當得運作。

source: If you have not heavily invested in configuring your GNOME desktop you might want to move the <filename>.gconf</filename> directory in user's home directories to a different name (such as <filename>.gconf.old</filename>) so that it gets recreated, with the default configuration for &releasename;, upon starting a new session.
be: Калі наладжванне GNOME на Вашай сістэме не каштавала Вам празмерных высілкаў, магчыма, мае сэнс надаць новую назву дырэкторыі <filename>.gconf</filename> (якая месціццца ў хатняй дырэкторыі карыстальніка). Напрыклад, яе можна перайменаваць у <filename>.gconf.old</filename>. Пасля гэтага пры запуску новай сесіі GNOME дырэкторыя <filename>gconf</filename> будзе створаная нанова, і ў ёй будуць захаваныя стандартныя наладкі для &releasename;.
nb: Hvis du ikke har lagt ned mye arbeid i oppsettet av ditt GNOME skrivebord, så er det kanskje like greit å starte på nytt ved å flytte unne katalogen med disse konfigurasjonene, den ligger i brukerens hjemmeområde og heter <filename>.gconf</filename> (kall den gamle katalogen f.eks <filename>.gconf.old</filename>), på den måten så lages det automatisk nye konfigurasjonsfiler med standardoppsettet fra &releasename;.
zh_tw: 如果您對於您的 GNOME 桌面的設定不是很在乎的話，您可以把使用者主目錄裡的 <filename>.gconf</filename> 目錄更名，（像是 <filename>.gconf.old</filename>），讓它在啟用新的連線時重新以 &releasename; 的預設設定重新產生。

source: With the release of &releasename;, Debian no longer contains packages for most of the obsolete version 1 release of GNOME, although some packages remain in order to support some Debian packages which have not yet been updated to GNOME 2. Packages for GTK1.2 remain fully maintained.
be: З выпускам &releasename; Debian збольшага нe ўтрымлівае пакетаў для састарэлай версіі GNOME нумар 1. Захаваныя толькі асобныя бібліятэкі, якія патрэбныя для забеспячэння працы пакетаў, не абноўленых для ўжывання з версіяй GNOME нумар 2. Пакеты для GTK1.2 па-ранейшаму падтрымліваюцца цалкам.
nb: Fra og med versjonen &releasename;, så har Debian fjernet de fleste pakkene som stammet fra versjon 1 av GNOME, selv om noen pakker fremdeles finnes, de pakkene som fremdeles ikke har blitt oppdatert til GNOME 2. Pakker for GTK1.2 vedlikeholdes fremdeles.
zh_tw: 在 &releasename; 釋出版裡， Debian 已不再包含大多數和 GNOME 已廢棄的第 1 版的套件。雖然有些套件被保留了下來，但也只為了要支援一些尚未升級到 GNOE 2 的 Debian 套件。而 GTK1.2 套件則還是被完整維護著。

source: There have been many changes in the GNOME desktop environment from the version shipped in &oldreleasename; to the version in &releasename;, you can find more information in the <ulink url="http://library.gnome.org/misc/release-notes/2.22/">GNOME 2.22 Release Notes</ulink>.
be: У параўнанні з версіяй, якая пастаўлялася з &oldreleasename;, працоўны асяродак GNOME у &releasename; істотна змяніўся. Больш інфармацыі можна знайсці ў <ulink url="http://library.gnome.org/misc/release-notes/2.22/">звестках аб выпуску GNOME.2.22</ulink>.
nb: Det har skjedd mange forandringer i skrivebordsmiljøet GNOME side den versjonen som ble levert med &oldreleasename;. Du finner mer informasjon på <ulink url="http://library.gnome.org/misc/release-notes/2.22/">GNOME 2.22 Release Notes</ulink>.

source: No default support for Unicode in emacs21*
be: Адсутнасць падтрымкі Unicode пры стандартных наладках emacs21*
nb: Ingen støtte for Unicode som standard i emacs21*

source: Emacs21 and emacs21-nox are not configured to use Unicode by default. For more information and a workaround please see <ulink url="&url-bts;419490">Bug #419490</ulink>. Consider switching to <systemitem role="package">emacs22</systemitem>, <systemitem role="package">emacs22-gtk</systemitem>, or <systemitem role="package">emacs22-nox</systemitem>.
be: Стандартныя наладкі emacs21 ды emacs21-nox не прадугледжваюць ужывання Unicode. Больш інфармацыі аб праблеме і шляхах яе пераадолення можна знайсці ў <ulink url="&url-bts;419490">апісанні памылкі №419490</ulink>. Варта разгледзець магчымасць пераходу на <systemitem role="package">emacs22</systemitem>, <systemitem role="package">emacs22-gtk</systemitem> альбо <systemitem role="package">emacs22-nox</systemitem>.
nb: Emacs21 og emacs21-nox har ikke støtte for Unicode som standard. For mer informasjon og løsning på dette problemet, les feilrapport <ulink url="&url-bts;419490">419490</ulink>. Du bør overveie å bytte til <systemitem role="package">emacs22</systemitem>, <systemitem role="package">emacs22-gtk</systemitem>, eller <systemitem role="package">emacs22-nox</systemitem>.

source: slurpd/replica will no longer work
be: больш не працуе механізм slurpd/replica
nb: slurpd/replica vil ikke lenger fungere

source: OpenLDAP has dropped support for <acronym>LDAP</acronym> replication via the slurpd service in release 2.4.7. Existing configurations need to be reconfigured for the <acronym>LDAP</acronym> Sync Replication engine (syncrepl). More verbose documentation can be found at <ulink url="http://www.openldap.org/doc/admin24/replication.html">http://www.openldap.org/doc/admin24/replication.html</ulink>.
be: Праект OpenLDAP спыніў падтрымку рэплікацыі <acronym>LDAP</acronym> праз сервіс slurpd, пачынаючы з выпуску 2.4.7. Існуючыя наладкі трэба змяніць, каб перайсці да ўжывання рухавіка <acronym>LDAP</acronym> Sync Replication (syncrepl). Больш падрабязныя звесткі можна знайсці на старонцы <ulink url="http://www.openldap.org/doc/admin24/replication.html">http://www.openldap.org/doc/admin24/replication.html</ulink>.
nb: OpenLDAP har fra versjone 2.4.7 ikke lenger støtte for <acronym>LDAP</acronym> replikering via slurpd. Eksisterende konfigurasjoner må tilpasses den nye <acronym>LDAP</acronym> Sync Replication engine (syncrepl). Mer informasjon finnes på <ulink url="http://www.openldap.org/doc/admin24/replication.html">http://www.openldap.org/doc/admin24/replication.html</ulink>.

source: Desktop not using full screen
be: Працоўны стол не выкарыстоўвае экран цалкам
nb: Skrivebordet bruker ikke hele skjermen

source: The driver for Intel Mobile GM965 may wrongly detect a <acronym>VGA</acronym> output and set the size of the screen to a lower value to accomodate it. The symptom of this bug is that the desktop manager will only use a fraction of the screen. Correct behaviour can be forced by adding the following lines to the <filename>/etc/X11/xorg.conf</filename> configuration file.
be: Драйвер для Intel Mobile GM965 можа памылкова вызначыць наяўнасць відэавываду <acronym>VGA</acronym> i адпаведным чынам зменшыць памер экрана. Аб гэтай памылцы сведчыць тое, што працоўны стол займае толькі частку экраннай прасторы. Прымусіць сістэму працаваць у правільным рэжыме можна, дадаўшы такія радкі да файлу наладак <filename>/etc/X11/xorg.conf</filename>:
nb: Driveren for Intel Mobile GM965 kan feilaktig oppdage en <acronym>VGA</acronym> utgang, og derfor sette for lav størrelse på skjermen for å kompensere for dette. Symptomet på dette er at bare deler av skjermen blir brukt av vindusbehandleren. Du kan rette opp denne feilen ved å legge til disse linjene i fila <filename>/etc/X11/xorg.conf</filename>:

source: Please refer to the bug <ulink url="&url-bts;/496169">#496169</ulink> for more informations.
be: Больш інфармацыі можна знайсці ў паведамленні аб памылцы <ulink url="&url-bts;/496169">№496169</ulink>.
nb: Les feilrapport <ulink url="&url-bts;/496169">#496169</ulink> for mer informasjon.

source: &releasename; kernel fails to boot on Sparc workstations with PCI-Express
be: Ядро &releasename; не можа загрузіцца на працоўных станцыях Sparc з шынай PCI-Express.
nb: &releasename; kan ikke starte på Sparc-arbeidsstasjoner med PCI-express
