Repository: lurdan/trans-ddp
Catalog: release-notes/*/moreinfo.po
Languages: be, de, fi, fr, it, ja, lt, nb, nl, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: Debian has an IRC channel dedicated to the support and aid of Debian users located on the OFTC IRC network. To access the channel, point your favorite IRC client at irc.debian.org and join #debian.
be: Debian мае канал IRC, адмыслова прызначаны для падтрымкі карыстальнікаў. Канал працуе ў IRC-сеціве Суполкі адкрытых і свабодных тэхналогій (Open and Free Technologies Community, OFTC). Каб скарыстацца ім, далучайцеся да сервера irc.debian.org з дапамогай свайго ўлюбёнага IRC-кліента ды заходзьце на канал #debian. Заўвага перакладчыкаў: канал англамоўны.
fi: Debianilla on käyttäjien tukeen ja auttamiseen tarkoitettu IRC-kanava OFTC-IRC-verkossa. Pääset kanavalle menemällä haluamallasi IRC-asiakasohjelmalla palvelimelle irc.debian.org ja liittymällä kanavalle #debian.
fr: Debian a un canal IRC (pour les anglophones) dédié à l'aide et à l'assistance aux utilisateurs Debian. Il est situé sur le réseau IRC OFTC. Pour accéder au canal, pointez votre logiciel client IRC favori sur irc.debian.org et rejoignez le canal #debian.
it: Debian ha un canale IRC dedicato al supporto e all'aiuto agli utenti Debian, che si trova sulla rete IRC OFTC. Per accedere a tale canale si indirizzi il proprio client IRC preferito su irc.debian.org e si acceda a #debian. Il canale italiano di supporto è sulla rete IRC OFTC, #debian-it.
ja: Debian には、Debian ユーザのサポートや援助のために専用の IRC チャンネルが OFTC IRC ネットワークにあります。このチャンネルにアクセスするには、お好みの IRC クライアントを irc.debian.org に接続し、#debian に join してください。
nb: Debian har en egen IRC kanal på OFTC IRC nettverket. Bruk din favoritt IRC-klient og gå til irc.debian.org og inn i #debian.
ro: Debian dispune de un canal IRC în rețeaua OFTC dedicat pentru suportul și ajutorul utilizatorilor Debian. Pentru a accesa canalul configurați clientul IRC preferat pentru irc.debian.org și alăturați-vă #debian.
ru: Для поддержки пользователей Debian есть IRC-канал, расположенный в сети OFTC IRC. Чтобы войти на канал, соединитесь с сервером irc.debian.org с помощью своего любимого IRC-клиента и присоединитесь к каналу #debian. Для русскоязычных пользователей существует канал #debian-russian в той же сети.
sk: Debian má na IRC sieti OFTC kanál určený na podporu a pomoc používateľom Debianu. Kanál nájdete pod menom #debian na serveri irc.debian.org.
sv: Debian har en IRC-kanal vars ändamål är att ge stöd och hjälp till Debiananvändare. Kanalen finns på IRC-nätverket OFTC. För att komma åt kanalen, peka din favorit-IRC-klient till irc.debian.org och gå in i kanalen #debian.
vi: Debian có một kênh IRC dành cho hỗ trợ và giúp đỡ các người dùng Debian, chạy trên mạng IRC OFTC. Để truy cập đến kênh này, hãy chỉ ứng dụng khách IRC (v.d. XChat) tới địa chỉ « irc.debian.org » và vào kênh « #debian ».
zh_tw: Debian 在 OFTC IRC 上開設了一個 IRC 頻道，專門用來支援並幫助 Debian 的使用者。您只要把您慣用的 IRC 客戶端程式指向 irc.debian.org 並加入 #debian 就可以連上這個頻道了。

source: Please follow the channel guidelines, respecting other users fully. The guidelines are available at the <ulink url="&url-wiki;DebianIRC">Debian Wiki</ulink>.
de: Bitte beachten Sie die Leitsätze im Umgang mit dem Kanal und respektieren Sie die anderen Benutzer. Die Leitsätze finden Sie im <ulink url="&url-wiki;DebianIRC">Debian Wiki</ulink>.
fi: Noudata kanavan ohjeistusta ja kunnioita muiden käyttäjien mielipiteitä. Ohjeistus on luettavissa <ulink url="&url-wiki;DebianIRC">Debian Wikissä</ulink>.
fr: Merci de suivre les usages du canal de discussion et de respecter pleinement les autres utilisateurs. Les règles d'utilisation sont disponibles dans le <ulink url="&url-wiki;DebianIRC">Wiki Debian</ulink>.
it: Si prega di seguire le linee guida del canale, nel pieno rispetto degli altri utenti. Queste sono disponibili nel <ulink url="&url-wiki;DebianIRC">wiki di Debian</ulink>.
ja: チャンネルのガイドラインに従い、他のユーザをきちんと尊重してください。ガイドラインは <ulink url="&url-wiki;DebianIRC">Debian Wiki</ulink> で参照できます。
nb: Følg kanalens retningslinjer. Retningslinjene er tilgjengelige på <ulink url="&url-wiki;DebianIRC">Debian Wiki</ulink>.
nl: Houdt u zich alstublieft aan de richtlijnen voor het kanaal en gedraagt u zich respectvol naar anderen toe. De richtlijnen zijn beschikbaar op de <ulink url="&url-wiki;DebianIRC">Debian Wiki</ulink>.
pl: Proszę przestrzegać zasad kanału i respektując prawa innych użytkowników. Wytyczne są dostępne na <ulink url="&url-wiki;DebianIRC">Wiki Debiana</ulink>.
pt: Por favor siga as linhas de conduta do canal, respeitando totalmente os outros utilizadores. As linhas de conduta estão disponíveis no <ulink url="&url-wiki;DebianIRC">Debian Wiki</ulink>.
pt_br: Por favor, siga as regras de conduta do canal, respeitando os outros usuários. As regras de conduta estão disponíveis no <ulink url="&url-wiki;DebianIRC">Wiki do Debian</ulink>.
ro: Vă rugăm să respectați uzanțele canalului și să respectați alți utilizatori. Ghidul uzanțelor este disponibil pe <ulink url="&url-wiki;DebianIRC">Debian Wiki</ulink>.
ru: Просим вас следовать правилам поведения на канале и уважать других пользователей. Правила поведения на канале описаны в <ulink url="&url-wiki;DebianIRC">вики Debian</ulink>.
sv: Följ kanalens riktlinjer och respektera andra användare. Riktlinjerna finns tillgängliga på <ulink url="&url-wiki;DebianIRC">Debians wiki</ulink>.
zh_tw: 請遵循各頻道的規範，並尊重線上其他的使用者。您可以在 <ulink url="&url-wiki;DebianIRC">Debian Wiki</ulink> 上取得這些規範。

source: For more information on OFTC please visit the <ulink url="&url-irc-host;">website</ulink>.
be: Больш інфармацыі аб Суполцы адкрытых і свабодных тэхналогій (OFTC) можна знайсці на <ulink url="&url-irc-host;">адпаведным сайце</ulink>.
de: Für weitere Informationen zum OFTC besuchen Sie bitte dessen <ulink url="&url-irc-host;">Website</ulink>.
fi: Lisää tietoa OFTC:stä löytyy projektin <ulink url="&url-irc-host;">seittisivustolta</ulink>.
fr: Pour plus d'informations sur OFTC, veuillez visiter le <ulink url="&url-irc-host;">site web</ulink>.
it: Per maggiori informazioni su OFTC si visiti il <ulink url="&url-irc-host;">sito web</ulink>.
ja: OFTC についてさらに詳しく知りたい場合は、<ulink url="&url-irc-host;">ウェブサイト</ulink>を訪ねてみてください。
lt: Daugiau informacijos apie OFTC rasite <ulink url="&url-irc-host;">tinklapyje</ulink>.
nb: For mer informasjon om OFTC, gå til <ulink url="&url-irc-host;">website</ulink>.
nl: Verdere informatie over OFTC vindt u op hun <ulink url="&url-irc-host;">website</ulink>.
pl: Więcej informacji o OFTC można znaleźć na odpowiedniej <ulink url="&url-irc-host;">stronie internetowej</ulink>.
pt: Para mais informação acerca da OFTC por favor visite o <ulink url="&url-irc-host;">>website</ulink>.
pt_br: Para mais informações sobre a OFTC, por favor, visite o <ulink url="&url-irc-host;">site web</ulink>.
ro: Pentru mai multe informații despre OFTC vă rugăm vizitați <ulink url="&url-irc-host;">situl web</ulink>.
ru: Более подробную информацию об OFTC можно получить на <ulink url="&url-irc-host;">веб-сайте сети</ulink>.
sk: Ďalšie informácie o OFTC nájdete na jeho <ulink url="&url-irc-host;">webovej stránke</ulink>.
sv: För mer information om OFTC, besök dess <ulink url="&url-irc-host;">webbplats</ulink>.
vi: Để tìm thêm thông tin về mạng OFTC, xem <ulink url="&url-irc-host;">địa chỉ Web</ulink> này.
zh_tw: 可以在 <ulink url="&url-irc-host;">website</ulink> 上取得更多 OFTC 的相關資訊。

source: Reporting bugs
be: Паведамленні аб памылках
de: Fehler berichten
fi: Vioista ilmoittaminen
fr: Signaler les bogues
it: Segnalare i bug
ja: バグを報告する
lt: Pranešimas apie riktus
nb: Rapportere feil
nl: Fouten rapporteren
pl: Zgłaszanie błędów
pt: Relatar erros
pt_br: Relatando bugs
ro: Raportarea problemelor
ru: Как сообщить об ошибке
sk: Oznamovanie chýb
sv: Rapportera fel
vi: Thông báo lỗi
zh_tw: 回報錯誤

source: We strive to make &debian; a high quality operating system, however that does not mean that the packages we provide are totally free of bugs. Consistent with Debian's <quote>open development</quote> philosophy and as a service to our users, we provide all the information on reported bugs at our own Bug Tracking System (BTS). The BTS is browseable at <ulink url="&url-bts;"></ulink>.
be: Мы імкнемся да таго, каб &debian; быў высокаякаснай аперацыйнай сістэмай, але гэта не значыць, што пакеты, якія мы выпускаем, ніколі не ўтрымліваюць памылак. Debian грунтуецца на філасофіі <quote>адкрытай распрацоўкі</quote>; у адпаведнасці з ёю і ў якасці паслугі для карыстальнікаў мы публікуем усе звесткі аб знойдзеных памылках праз адмысловую Сістэму Кантролю Памылак (Bug Tracking System (BTS). Прагледзець BTS можна па адрасе <ulink url="url-bts;"></ulink>
de: Wir bemühen uns, &debian; zu einem hochqualitativen Betriebssystem zu machen. Das bedeutet aber nicht, dass alle Pakete, die wir zur Verfügung stellen, fehlerfrei sind. Übereinstimmend mit Debians Philosophie der <quote>offenen Entwicklung</quote> und als Service für unsere Anwender stellen wir alle Informationen zu gemeldeten Fehlern in unserer Fehlerdatenbank (Bug Tracking System, BTS) bereit. Dieses BTS können Sie unter <ulink url="&url-bts;"></ulink> durchsuchen.
fi: Ponnistelemme, jotta &debian; olisi korkealaatuinen käyttöjärjestelmä, mikä ei kuitenkaan tarkoita tekemiemme ohjelmapakettien olevan kokonaan vailla vikoja. Julkinen vikatietokanta sopii Debianin <quote>avoimeen kehitystyöhön</quote>. Palvelemme käyttäjiämme tarjoamalla kaikki tiedot ilmoitetuista vioista omassa vianseurantajärjestelmässämme (BTS, Bug Tracking System), joka on käytettävissä selaimella osoitteessa <ulink url="&url-bts;"></ulink>.
fr: Nous nous efforçons en permanence de faire de &debian; un système d'exploitation de qualité ; cependant cela ne signifie pas que les paquets que nous fournissons sont totalement exempts de bogues. En accord avec la philosophie de <quote>développement ouvert</quote> de Debian, nous fournissons à nos utilisateurs toutes les informations sur les bogues qui nous ont été signalés sur notre système de suivi des bogues (BTS). Le BTS est consultable à l'adresse <ulink url="&url-bts;"></ulink>.
it: Facciamo ogni sforzo per rendere &debian; un sistema operativo di alta qualità, ma questo non significa che i pacchetti che forniamo siano totalmente esenti da problemi. Coerentemente con la filosofia dello <quote>sviluppo aperto</quote> di Debian e come servizio per i nostri utenti forniamo sul nostro sistema di tracciamento dei bug (BTS, Bug Tracking System) tutte le informazioni disponibili sugli errori scoperti. Il BTS è consultabile all'indirizzo <ulink url="&url-bts;"></ulink>.
ja: 私たちは &debian; を高品質な OS にするよう努めていますが、だからといって私たちの提供するパッケージにバグが皆無というわけではありません。Debian の <quote>オープンな開発体制</quote> という考え方に合致し、また、ユーザに対するサービスとして、私たちは報告されたバグに関するすべての情報をバグ追跡システム (Bug Tracking System: BTS) で提供しています。この BTS は <ulink url="&url-bts;"></ulink> で閲覧できます
lt: Mes stengiamės, kad &debian; būtų aukštos kokybės operacinė sistema, tačiau tai nereiškia, kad paketai yra visiškai be klaidų. Remiantis <quote>atviro kūrimo</quote> filosofija ir kaip papildomą paslaugą savo naudotojams, mes suteikiame visą informaciją apie klaidas savo riktų sekimo sistemoje (Bug Tracking System, BTS). BTS galima rasti adresu <ulink url="&url-bts;"> </ulink>.
nb: Vi jobber hardt for at &debian; skal være et operativsystem med høy kvalitet, det betyr ikke at alle våre pakker er feilfrie. I tråd med Debian sin <quote>åpne utviklingsmodell</quote>, og som en tjeneste til alle våre brukere, så ligger alle feilrapporter åpent tilgjengelig i vårt eget feilrapporteringssyetem (BTS). BTS er søkbar på <ulink url="&url-bts;"></ulink>.
nl: We streven ernaar om &debian; een zo hoogwaardig mogelijk besturingssysteem te laten zijn; helaas betekent dit niet dat de geleverde pakketten totaal vrij zijn van fouten of onvolkomenheden. In lijn met Debians filosofie over het <quote>open ontwikkelen</quote> en als service voor onze gebruikers is alle informatie met betrekking tot gerapporteerde bugs beschikbaar in ons eigen "Bug Tracking Systeem" (BTS). Het BTS kan bekeken worden op <ulink url="&url-bts;"></ulink>.
pl: Staramy się, aby &debian; był systemem operacyjnym wysokiej jakości, jednak nie znaczy to, że udostępniane pakiety są całkowicie wolne od błędów. Zgodnie z filozofią <quote>otwartego rozwoju</quote> Debiana i jako usługa dla naszych użytkowników, dostarczamy wszystkie informacje o zgłoszonych błędach w naszym Systemie Śledzenia Błędów (Bug Tracking System - BTS). BTS można przeglądać pod adresem <ulink url="&url-bts;"></ulink>.
pt: Ansiamos por fazer &debian; um sistema operativo de alta qualidade, no entanto isso não significa que os pacotes que disponibilizamos sejam totalmente livres de bugs. Em consistência com a filosofia de <quote>desenvolvimento livre</quote> de Debian e como um serviço para os nossos utilizadores, nós disponibilizamos toda a informação em relatórios de bugs no nosso próprio sistema de seguimento de bugs (BTS). O BTS é navegável em <ulink url="&url-bts;"></ulink>.
ro: Ne străduim să facem din &debian; un sistem de operare de înaltă calitate, totuși, aceasta nu înseamnă că pachetele furnizate de noi sunt complet lipsite de probleme. Conform cu filosofia Debian despre un model de <quote>dezvoltare deschisă</quote> și ca un serviciu pentru utilizatorii noștri, oferim toate informațiile legate de problemele raportate în Sistemul de gestiune al problemelor (Bug Tracking System - BTS). Sistemul poate fi navigat la <ulink url="&url-bts;">&url-bts;</ulink>.
ru: Мы приложили немало усилий, чтобы сделать &debian; операционной системой высокого качества, однако это не означает, что поставляемые нами пакеты не содержат абсолютно никаких ошибок. Такой подход согласуется с <quote>концепцией открытой разработки</quote> Debian. Мы предоставляем нашим пользователям полную информацию обо всех обнаруженных ошибках в нашей системе отслеживания ошибок (Bug Tracking System, BTS), расположенной по адресу <ulink url="&url-bts;"></ulink>.
sk: Snažíme sa, aby sme z Debianu urobili kvalitný operačný systém, to však neznamená, že balíky, ktoré poskytujeme nemajú vôbec žiadne chyby. V súlade s filozofiou <quote>otvoreného vývoja</quote> Debianu a ako službu našim používateľom sprístupňujeme všetky informácie o nahlásených chybách v našom vlastnom Systéme sledovania chýb (BTS). BTS je možné prehliadať na adrese <ulink url="&url-bts;"></ulink>.
sv: Vi strävar mot att göra &debian; till ett högkvalitativt operativsystem. Det betyder dock inte att paketen som vi tillhandahåller är helt felfria. I enlighet med Debians filosofi om <quote>öppen utveckling</quote> och som en tjänst till våra användare, tillhandahåller vi all information om rapporterade fel i vårt eget felhanteringssystem (BTS). BTS är bläddringsbar på <ulink url="&url-bts;"></ulink>.
vi: Chúng tôi cố gắng làm cho &debian; là một hệ điều hành có chất lượng cao, tuy nhiên đó không có nghĩa là mọi gói đều hoàn toàn miễn lỗi. Tùy theo ý kiến <quote>phát triển mở</quote> của dự án Debian, và để giúp đỡ các người dùng, chúng tôi cung cấp tất cả các thông tin về những lỗi đã thông báo, thông qua Hệ thống Theo dõi Lỗi (BTS): có thể duyệt qua nó ở <ulink url="&url-bts;"></ulink>.
zh_tw: 我們盡心盡力地讓 &debian; 成為一個高品質的作業系統，但這並不表示我們所提供的套件都是完全沒有任何問題的。為了和 Debian 一貫的<quote>開放發展</quote>原則相互呼應，也為了能對我們的使用者提供更好的服務，我們在我們自己的錯誤追蹤系統 (BTS) 中提供了對所有報告過的錯誤的所有資訊。您可以在 <ulink url="&url-bts;">&url-bts;</ulink> 瀏覽錯誤追蹤系統的網站。

source: If you find a bug in the distribution or in packaged software that is part of it, please report it so that it can be properly fixed for future releases. Reporting bugs requires a valid email address. We ask for this so that we can trace bugs and developers can get in contact with submitters should additional information be needed.
be: Калі Вы знайшлі памылку ў дыстрыбутыве альбо ў пакеце праграм, які з'яўляецца часткай дыстрыбутыву, ласкава просім паведамляць аб гэтым, каб недарэчнасць можна было выправіць у наступных выпусках. Для паведамлення аб памылцы неабходна мець дзейсны адрас электроннай пошты. Такое патрабаванне выклікана неабходнасцю адсочваць памылкі і даць магчымасць распрацоўшчыкам кантактаваць з аўтарамі паведамленняў на выпадак, калі спатрэбіцца сабраць дадатковую інфармацыю.
de: Falls Sie einen Fehler in der Distribution oder einem darin enthaltenen Paket finden, berichten Sie den Fehler bitte, sodass er für weitere Veröffentlichungen ordentlich behoben werden kann. Um Fehler zu berichten, ist eine gültige E-Mail-Adresse nötig. Wir bitten darum, damit wir Fehler verfolgen und die Entwickler Kontakt zu denjenigen aufnehmen können, die den Fehler berichtet haben, wenn weitere Informationen dazu benötigt werden.
fi: Jos löydät vian jakelusta tai sen osana olevasta paketoidusta ohjelmasta, ole hyvä ja ilmoita siitä, jotta se saadaan kunnolla korjattua seuraavissa versioissa. Vikailmoituksen laatijalla on oltava toimiva sähköpostiosoite. Tämä siksi, että vikoja voidaan seurata ja kehittävät voivat tarvittaessa pyytää lisätietoja.
fr: Si vous trouvez un bogue dans la distribution ou dans un logiciel qui en fait partie, merci de le signaler afin que nous puissions le corriger pour les prochaines versions. Signaler les bogues nécessite une adresse électronique valide. Nous demandons cela afin que les développeurs puissent entrer en contact avec les personnes qui ont envoyé le rapport de bogue au cas où plus d'informations seraient nécessaires.
it: Se si trova un errore nella distribuzione o in un software pacchettizzato che ne fa parte si è pregati di segnalarlo, in modo che possa essere opportunamente risolto per i rilasci futuri. Per la segnalazione degli errori è richiesto un indirizzo di posta elettronica valido, per poter tenere traccia degli errori e in modo che gli sviluppatori possano mettersi in contatto con gli autori delle segnalazioni qualora fossero necessarie maggiori informazioni.
ja: もしディストリビューションや、その一部であるパッケージされたソフトウェアにバグを見つけたら、将来のリリースで修正できるよう、その問題点の報告をお願いします。バグを報告するには有効な電子メールアドレスが必要です。これをお願いしているのは、バグを追跡できるようにするため、そして追加情報が必要になった場合に開発者が報告者に連絡できるようにするためです。
lt: Jei pastebėsite klaidą distributyve arba bet kuriame iš jo paketų, kurie yra jo sudedamoji dalis, prašome pranešti apie tai, kad būsimose laidose ji būtų ištaisyta. Pranešime apie riktą reikia nurodyti savo galiojantį elektroninio pašto adresą. Jo reikia tam, kad galėtume stebėti klaidas, o kūrėjai galėtų susisiekti su Jumis, jei reikės papildomos informacijos apie klaidą.
nb: Hvis du finner en feil i distribusjonen, eller i en av pakkene, så vennligst lag en feilrapport så dette kan rettes opp i fremtidige versjoner. Du trenger en gyldig e-postadresse for å sende inn feilrapporter. Vi trenger din e-postadresse så våre utviklere kan komme i kontakt med deg for mulige oppfølgende spørsmål.
nl: Wanneer u onverhoopt een bug (fout) vindt in de distributie of in een van de meegeleverde pakketten die daar onderdeel van uit maken, rapporteert u dit dan alstublieft zodat het in een toekomstige versie gecorrigeerd kan worden. Voor het rapporteren van een bug is in een geldig en bestaand e-mailadres vereist. Deze informatie is nodig om bugs goed te kunnen volgen en zodat onze ontwikkelaars met u in contact kunnen komen wanneer verdere informatie over de bug benodigd is.
pl: W przypadku znalezienia błędu w dystrybucji lub spakietowanym programie będącym jej częścią prosimy o zgłoszenie błędu, dzięki czemu będzie mógł zostać poprawiony w kolejnych wydaniach. Zgłaszanie błędów wymaga poprawnego adresu poczty elektronicznej. Dzięki niemu możliwe jest śledzenie błędów i kontakt deweloperów ze zgłaszającym, w razie potrzeby uzyskania dodatkowych informacji.
pt: Se encontrar um bug na distribuição ou no software empacotado que seja parte dela, por favor relate-o para que possa ser corrigido adequadamente em futuros lançamentos. Relatar bugs requer um endereço de email válido. Nós pedimos isto para que possamos seguir os bugs e os 'developers' possam entrar em contacto com quem os submeteu, caso seja necessária informação adicional.
pt_br: Se você encontrar um bug na distribuição ou no software empacotado que faz parte dela, por favor, relate-o para que possa ser corrigido adequadamente em futuros lançamentos. Para relatar bugs é necessário um endereço de e-mail válido. Nós pedimos isso para que possamos seguir os bugs e os desenvolvedores possam entrar em contato com quem os submeteu, caso seja necessário obter informação adicional.
ro: Dacă ați descoperit o problemă în distribuție sau în software-ul din pachete, vă rugăm să o raportați pentru ca aceasta să fie remediată corect în următoarele versiuni. Raportarea erorilor necesită o adresă de poștă electronică validă. Cerem acest lucru pentru pentru a putea urmări problemele și pentru ca dezvoltatorii să poată ține legătura cu cei care raportează problemele, în caz că au nevoie de mai multe informații.
ru: Если вы обнаружите ошибку в дистрибутиве или каком-то из его пакетов, пожалуйста, сообщите о ней, чтобы в будущих выпусках она была исправлена. Чтобы сообщить об ошибке, требуется рабочий адрес электронной почты. Это необходимо для того, чтобы мы могли отслеживать ошибки, а разработчики связываться с отправителями отчётов об ошибках, если им понадобится дополнительная информация.
sk: Ak nájdete chybu v distribúcii alebo v niektorom z balíkov softvéru, ktorý je jej súčasťou, oznámte ju prosím, aby ju bolo možné riadne opraviť v ďalších vydaniach. Na oznámenie chyby je potrebné mať platnú emailovú adresu. Vyžadujeme ju preto, aby sme mohli sledovať chyby a aby mohli vývojári kontaktovať oznamovateľov ak potrebujú podrobnejšie informácie.
sv: Om du hittar ett fel i distributionen eller i paketerad programvara som är en del av den, vänligen rapportera felet så att det kan rättas till i framtida utgåvor. Felrapportering kräver att du har en giltig e-postadress. Vi frågar efter den så att vi kan spåra fel och för att utvecklarna ska kunna komma i kontakt med de som rapporterat felet ifall de skulle behöva ytterligare information.
vi: Nếu người dùng gặp một lỗi trong bản phân phối, hoặc trong phần mềm đã đóng gói thuộc về nó, hãy thông báo nó để cho phép nhà phát triển sửa chữa trong bản phát hành sau. Để thông báo lỗi, cũng cần nhập một địa chỉ thư điện tử vẫn hoạt động. Địa chỉ này cần thiết để giúp nhà phát triển yêu cầu thêm thông tin, và theo dõi mẫu của các lỗi hiện thời.
zh_tw: 如果您在我們的系統發行或其中的套件中發現了任何問題，請向我們回報，這樣我們才能在日後的發行版中將它修復。您需要擁有一個正確的電子郵件信箱才能夠回報問題，會有這個限制是因為這樣我們才能藉此追蹤錯誤報告的進展，而當開發人員需要更多資訊的時候也才能和原問題報告者取得連繫。
