Repository: lurdan/trans-ddp
Catalog: release-notes/*/moreinfo.po
Languages: be, de, fi, fr, it, ja, lt, nb, nl, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: If you can dedicate more time, you could manage a piece of the Free Software collection within Debian. Especially helpful is if people adopt or maintain items that people have requested for inclusion within Debian. The <ulink url="&url-wnpp;">Work Needing and Prospective Packages database</ulink> details this information. If you have an interest in specific groups then you may find enjoyment in contributing to some of Debian's <ulink url="&url-debian-projects;">subprojects</ulink> which include ports to particular architectures and <ulink url="&url-debian-blends;">Debian Pure Blends</ulink> for specific user groups, among many others.
de: Falls Sie mehr Zeit zur Verfügung haben, könnten Sie auch einen Teil der Freien Software in Debian verwalten. Besonders hilfreich ist es, wenn Teile übernommen werden, für die darum gebeten wurde, sie Debian hinzuzufügen. Die <ulink url="&url-wnpp;">Datenbank der Arbeit bedürfenden Pakete (WNPP)</ulink> gibt dazu detaillierte Informationen. Falls Sie Interesse an bestimmten Anwendergruppen haben, finden Sie vielleicht Freude daran, etwas zu einzelnen <ulink url="&url-debian-projects;">Unterprojekten</ulink> von Debian beizutragen, wie beispielsweise zur Portierung auf andere Architekturen und <ulink url="&url-debian-blends;">Debian Pure Blends</ulink>.
pl: Jeśli ma się nieco więcej czasu można poświęcić go jakiejś części Wolnego Oprogramowania w Debianie. Szczególnie pożądane jest, aby adoptować lub zacząć opiekować się pakietami, o których dodanie prosili inni użytkownicy. Baza <ulink url="&url-wnpp;">Work Needing and Prospective Packages</ulink> dostarcza szczegółowych informacji w tym zakresie. Jeśli jest się szczególnie zainteresowanym jakąś konkretną dziedziną to można włożyć swój wkład w któryś z <ulink url="&url-debian-projects;">podprojektów</ulink> Debiana, które zajmują się również portami na różne architektury lub w tzw. <ulink url="&url-debian-blends;">Debian Pure Blends</ulink>, przeznaczonych dla określonych grup użytkowników, albo w wiele innych.
pt_br: Se você puder dedicar mais tempo, poderá administrar uma parte da coleção de Software Livre dentro do Debian. É especialmente útil se as pessoas adotarem ou mantiverem itens que foram pedidos para serem incluídos no Debian. A <ulink url="&url-wnpp;">base de dados de Pacotes Possíveis e que Necessitam de Trabalho</ulink> detalha essa informação. Se você tiver interesse em grupos específicos então poderá achar agradável contribuir para alguns dos <ulink url="&url-debian-projects;">subprojetos</ulink> do Debian que incluem portes para arquiteturas específicas e <ulink url="&url-debian-blends;">Misturas Puras do Debian (<quote>Debian Pure Blends</quote>)</ulink> para grupos específicos de usuários, entre muitos outros.

source: Beyond these release notes and the installation guide, further documentation on &debian; is available from the Debian Documentation Project (DDP), whose goal is to create high-quality documentation for Debian users and developers. Documentation, including the Debian Reference, Debian New Maintainers Guide, and Debian FAQ are available, and many more. For full details of the existing resources see the <ulink url="&url-ddp;">Debian Documentation website</ulink> and <ulink url="&url-wiki;">Debian Wiki website</ulink>
ru: Помимо этой информации о выпуске и руководства по установке, существует документация по &debian;, разрабатываемая проектом документирования Debian (DDP), целью которого является создание высококачественной документации для пользователей и разработчиков Debian. В состав этой документации входит руководство по Debian, руководство нового сопровождающего Debian, FAQ по Debian и многое другое. Полную информацию о доступных документах можно посмотреть на <ulink url="&url-ddp;">веб-сайте DDP</ulink> и <ulink url="&url-wiki;">вики</ulink>.

source: You can submit a bug report using the program <command>reportbug</command> or manually using email. You can read more about the Bug Tracking System and how to use it by reading the reference cards (available at <filename>/usr/share/doc/debian</filename> if you have <systemitem role="package">doc-debian</systemitem> installed) or online at the <ulink url="&url-bts;">Bug Tracking System</ulink>.
zh_tw: 您可以藉由 <command>reportbug</command> 程式或是自行使用電子郵件來進行回報錯誤，您可以閱讀參考卡片（如果您有安裝 <systemitem role="package">doc-debian</systemitem> 的話，可以在 <filename>/usr/share/doc/debian</filename> 裡找到）或到 <ulink url="&url-bts;">問題追蹤系統</ulink> 的線上網頁取得更多如何使用錯誤追蹤系統及其它的相關資訊。

source: Beyond these release notes and the installation guide, further documentation on &debian; is available from the Debian Documentation Project (DDP), whose goal is to create high-quality documentation for Debian users and developers. Available documentation includes the Debian Reference, Debian New Maintainers Guide, the Debian FAQ and many more. For full details of the existing resources see the <ulink url="&url-ddp;">Debian Documentation website</ulink> and the <ulink url="&url-wiki;">Debian Wiki website</ulink>
pt_br: Além destas notas de lançamento e do guia de instalação, mais documentação sobre o &debian; está disponível a partir do Projeto de Documentação Debian (DDP), cujo objetivo é criar documentação de alta qualidade para usuários e desenvolvedores Debian. A documentação disponível inclui a Referência Debian, o Guia de Novos Mantenedores Debian, o Debian FAQ e muito mais. Para todos os detalhes dos recursos existentes veja o <ulink url="&url-ddp;">site web de Documentação do Debian</ulink> e o <ulink url="&url-wiki;">site web do Wiki do Debian</ulink>.

source: There are many sources of help, advice and support for Debian users, but these should only be considered if research into documentation of the issue has exhausted all sources. This section provides a short introduction to these sources which may be helpful for new Debian users.
pt_br: Há várias fontes de ajuda, aconselhamento e suporte para usuários Debian, mas essas só deveriam ser consideradas se a pesquisa na documentação pelo problema exauriu todos os recursos. Esta seção fornece uma pequena introdução para essas fontes que podem ser úteis para novos usuários Debian.

source: Debian has an IRC channel dedicated to the support and aid of Debian users, located on the OFTC IRC network. To access the channel, point your favorite IRC client at irc.debian.org and join <literal>#debian</literal>.
pt_br: O Debian possui um canal IRC dedicado para o suporte e ajuda de usuários Debian, localizado na rede de IRC OFTC. Para acessar o canal, aponte seu cliente de IRC favorito para irc.debian.org e entre no canal <literal>#debian</literal> (em inglês). Também é possível usar o canal <literal>#debian-br</literal> para obter suporte em português do Brasil.

source: We strive to make &debian; a high quality operating system; however that does not mean that the packages we provide are totally free of bugs. Consistent with Debian's <quote>open development</quote> philosophy and as a service to our users, we provide all the information on reported bugs at our own Bug Tracking System (BTS). The BTS is browseable at <ulink url="&url-bts;"></ulink>.
pt_br: Nos empenhamos para tornar o &debian; um sistema operacional de alta qualidade; porém, isso não significa que os pacotes que disponibilizamos sejam totalmente livres de bugs. Coerentes com a filosofia de <quote>desenvolvimento aberto</quote> do Debian e como um serviço aos nossos usuários, nós fornecemos toda a informação sobre bugs relatados em nosso próprio Sistema de Rastreamento de Bugs (BTS). O BTS está acessível em <ulink url="&url-bts;"></ulink>.
