Repository: lurdan/trans-ddp
Catalog: release-notes/*/moreinfo.po
Languages: be, de, fi, fr, it, ja, lt, nb, nl, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: In any case, if you are working in the free software community in any way, as a user, programmer, writer or translator you are already helping the free software effort. Contributing is rewarding and fun, and as well as allowing you to meet new people it gives you that warm fuzzy feeling inside.
be: Незалежна ад канкрэтнай формы Вашага ўдзелу ў супольнасці вольных праграмаў (карыстальнік, распрацоўшчык, аўтар дакументацыі, перакладчык і г.д.), у любым выпадку Вы спрыяеце іх развіццю. Супрацоўніцтва -- гэта ўдзячнасць і задавальненне, гэта сустрэчы з новымі людзьмі ды магчымасць стварыць і захаваць пачуццё ўтульнай цеплыні глыбока ў сваім сэрцы.
de: Ob Sie nun als Anwender, Programmierer, Autor oder Übersetzer in der Gemeinschaft der Freien Software arbeiten, Sie helfen auf jeden Fall den Bemühungen der Freie-Software-Bewegung. Mitzuhelfen macht Spaß und honoriert die Arbeit anderer, und genauso wie es Ihnen ermöglicht, neue Leute kennen zu lernen, gibt es Ihnen auch dieses unbestimmte, schöne Gefühl, dabei zu sein.
fi: Jos työskentelet vapaiden ohjelmien yhteisössä millä tahansa tavalla, käyttäjänä, ohjelmoijana, kirjailijana tai kääntäjänä, olet jo tukemassa vapaiden ohjelmien aatetta. Avustaminen on palkitsevaa ja hauskaa sekä auttaa tutustumaan uusiin kavereihin ja siitä tulee hyvä olo.
fr: Quelque soit la manière dont vous travaillez dans la communauté du logiciel libre, en tant qu'utilisateur, programmeur, rédacteur ou traducteur, vous aidez la communauté. Contribuer est gratifiant, amusant, et en même temps, cela vous permet de rencontrer de nouvelles personnes et cela vous donne chaud au c&oelig;ur.
it: In ogni caso, se si sta lavorando all'interno della comunità del software libero in un qualunque ambito come utente, programmatore, scrittore o traduttore, si sta già dando un contributo. Contribuire è remunerativo e divertente e, oltre a permettere di incontrare nuove persone, dà quella certa sensazione interiore di benessere.
ja: いずれにしても、あなたが何らかの形でフリーソフトウェアコミュニティに関わっているのなら、それがユーザとしてであれ、プログラマ、ライター、翻訳者のいずれとしてであれ、すでにあなたはフリーソフトウェア運動を助けてくださっているのです。貢献することは報いのあることですし、楽しいことです。新しい人々に出会う機会も増えます。きっと暖かな、楽しい気持ちになれるはずです。
lt: Bet kuriuo atveju, jei Jūs dalyvaujate Laisvos programinės įrangos bendruomenės veikloje kaip jos naudotojas, programuotojas, vertėjas ar rašytojas (dokumentacijos arba straipsnių), Jūs jau padedate Laisvajai programinei įrangai. Šis dalyvavimas yra naudingas ir įdomus, ir taip pat suteikiant galimybę susipažinti su naujais žmonėmis.
nb: Uansett, om du arbeider med fri programvare på en eller annen måte, som en vanlig bruker, som programmerer, forfatter eller oversetter, så er du allerede en viktig bidragsyter. Å kunne bidra er belønnende og morsomt, samtidig som det lar deg møte nye mennesker og den gir deg den gode varme følelsen i kroppen.
nl: Hoe dan ook, als u al aktief bent binnen de vrije software gemeenschap, in welke vorm dan ook, als gebruiker, ontwikkelaar, schrijver of vertaler, dan helpt u de vrije software gemeenschap al! Bijdragen aan deze gemeenschap is bevredigend en leuk, en naast de gelegenheid om met nieuwe mensen in contact te komen geeft het u ook dat warme en blije gevoel van voldoening van binnen.
pl: W każdym razie, niezależnie od tego, czy działa się na rzecz społeczności Wolnego Oprogramowania jako użytkownik, programista, osoba zajmująca się pisaniem dokumentacji lub tłumaczeniami, już teraz dokłada się swoją cegiełkę w budowie Wolnego Oprogramowania. Taka praca daje dużo satysfakcji i radości oraz pozwala na poznanie nowych ludzi.
pt: Em qualquer caso, se estiver a trabalhar na comunidade de software livre de qualquer forma, como utilizador, programador, escritor ou tradutor já está a ajudar o esforço de software livre. A contribuição é recompensadora e divertida, além disso permite-lhe conhecer novas pessoas dando-lhe aquela estranha sensação quente por dentro.
pt_br: Em qualquer caso, se você estiver trabalhando na comunidade de software livre de qualquer forma, como utilizador, programador, escritor ou tradutor, você já está ajudando o esforço do software livre. A contribuição é recompensadora e divertida, além disso permite-lhe conhecer novas pessoas, dando-lhe aquela estranha sensação calorosa por dentro.
ro: În orice caz, dacă lucrați în orice fel în comunitatea software liber, ca utilizator, programator, autor de documentație sau traducător, ajutați deja efortul pentru software liber. Contribuțiile aduc satisfacții și bună dispoziție, și pe lângă oportunitatea de a cunoaște noi persoane crează un sentiment bun în interior.
ru: В любом случае, если вы участвуете в работе сообщества Свободного ПО в качестве пользователя, программиста, писателя или переводчика, вы уже помогаете Свободному программному обеспечению. Такое участие приносит удовольствие и радость, даёт возможность познакомиться с новыми людьми.
sk: V každom prípade ak sa podieľate na komunite slobodného softvéru akýmkoľvek spôsobom, či ako používateľ, programátor, tvorca dokumentácie alebo prekladateľ, pomáhate tým hnutiu slobodného softvéru. Prispievanie je veľmi užitočné a často aj zábavné, umožňuje vám spoznať nových ľudí a dáva vám ťažko popísateľný hrejivý pocit.
sv: I vilket fall som helst, om du arbetar i den fria programvarugemenskapen på något sätt, som en användare, programmerare, författare eller översättare hjälper du redan den fria programvaran. Att bidra är belönande och roligt, såväl som att det låter dig träffa nya människor som att det ger dig den där varma känslan inom dig.
vi: Trong mọi trường hợp đều, nếu người dùng tham gia cộng đồng phần mềm tự do bằng cách nào cả, là một người dùng, nhà phát triển, tác giả hay người dịch, thì vẫn còn đóng góp cho sự cố gắng phần mềm tự do. Đóng góp vẫn đáng làm và thứ vị, cũng cho phép người dùng kết bạn và học hiểu thêm.
zh_tw: 不論如何，只要您以任何的方式參加了自由軟體社群的活動，不管是身為使用者、程式員、作者、還是譯者，您就已經對自由軟體的群體努力做出貢獻了。貢獻本身就是一件非常有益而有趣的事情，除了能讓您不斷地遇見新的伙伴之外，也能讓您的心中充滿了溫暖的感覺。

source: Beyond these release notes and the installation guide, further documentation on &debian; is available from the Debian Documentation Project (DDP), whose goal is to create high-quality documentation for Debian users and developers. Documentation, including the Debian Reference, Debian New Maintainers Guide, and Debian FAQ are available, and many more. For full details of the existing resources see the <ulink url="&url-ddp;">Debian Documentation website</ulink> and the <ulink url="&url-wiki;">Debian Wiki website</ulink>
de: Neben diesen Hinweisen zur Veröffentlichung und der Installations-Anleitung sind weitere Informationen zu &debian; beim Debian-Dokumentationsprojekt (DDP) erhältlich, dessen Ziel es ist, hochwertige Dokumentation für Debian-Anwender und -Entwickler zu erstellen. Dokumente wie die Debian-Referenz, der <quote>Debian New Maintainers Guide</quote> und die häufig gestellten Fragen (Debian-FAQ) sind dort neben vielen weiteren Dokumentationen erhältlich. Bezüglich genauer Details über die zur Verfügung stehenden Dokumente sehen Sie auf der <ulink url="&url-ddp;">Debian-Dokumentations-Website</ulink> und im <ulink url="&url-wiki;">Debian Wiki</ulink> nach.
fr: Outre ces notes de publication et le manuel d'installation, d'autres documents sont disponibles sur le projet de documentation Debian (DDP), dont le but est de créer une documentation de qualité pour les utilisateurs et les développeurs Debian. On peut y trouver des documents comme la référence Debian, le guide du nouveau responsable Debian, la foire aux questions (FAQ) Debian et d'autres encore. Pour tous les détails concernant les ressources disponibles, veuillez consulter le <ulink url="&url-ddp;">site web de la Documentation Debian</ulink> et le <ulink url="&url-wiki;">site web du wiki Debian</ulink>.
it: Oltre alle presenti note di rilascio e alla guida all'installazione, ulteriore documentazione su &debian; è disponibile presso il Progetto di Documentazione di Debian (DDP - Debian Documentation Project), il cui scopo è creare documentazione di alta qualità per gli utenti e gli sviluppatori di Debian. La documentazione disponibile include il manuale, la guida per i nuovi manutentori e le FAQ, oltre a molto altro materiale. Per dettagli completi sulle risorse disponibili si consulti il <ulink url="&url-ddp;">sito della documentazione Debian</ulink> e il <ulink url="&url-wiki;">sito Debian Wiki</ulink>
ja: このリリースノートやインストールガイドを越えた、&debian; に関するより詳細な文書が、Debian Documentation Project (DDP) から公開されています。DDP は Debian のユーザや開発者向けに、品質の高い文書を作成することを目的としています。Debian リファレンス、Debian 新メンテナガイド、Debian FAQ などなど、たくさんの文書があります。現在利用可能なリソースの詳細すべては <ulink url="&url-ddp;">DDP のウェブサイト</ulink>および<ulink url="&url-wiki;">Debian Wiki のウェブサイト</ulink>から得られます。
nl: Er is verdere documentatie beschikbaar over &debian; dan welke in deze release-opmerkingen en in de installatiehandleiding staat. Deze documentatie is beschikbaar gemaakt door het Debian Documentatie Project (DDP) welke als taak heeft om hoogwaardige documentatie voor Debian gebruikers en ontwikkelaars te maken. Deze documentatie omvat onder andere het Debian Naslagwerk, de Debian New Maintainers-gids, de Debian FAQ (Vaak Gestelde Vragen), en nog veel andere documentatie. Voor de volledige details van de beschikbare bronnen bezoekt u de <ulink url="&url-ddp;">Debian Documentatie website</ulink> en de <ulink url="&url-wiki;">Debian Wiki website</ulink>
pl: Poza uwagami do wydana i przewodnikiem po instalacji dostępna jest również dodatkowa dokumentacja na temat systemu &debian;, pochodząca z Projektu Dokumentacji Debiana (DDP), którego zadaniem jest tworzenie wysokiej jakości dokumentacji dla użytkowników i deweloperów Debiana. Dostępne są dokumenty Debian Reference, Debian New Maintainers' Guide i FAQ Debiana oraz wiele innych. Pełny spis wszystkich zasobów można znaleźć na <ulink url="&url-ddp;">stronie z dokumentacją Debiana</ulink> (proszę zwrócić uwagę na odnośnik do polskiej dokumentacji w dolnej części strony) i w <ulink url="&url-wiki;">Wiki Debiana</ulink>.
pt: Para além destas notas de lançamento e do guia de instalação, está disponível mais documentação acerca de &debian; a partir do Projecto de Documentação Debian (DDP), cujo objectivo é criar documentação de alta qualidade para os utilizadores e 'developers' de Debian. Está disponível documentação, incluindo o 'Debian Reference', o guia para novos 'Maintainers' Debian, Debian FAQ, e muito mais. Para todos os detalhes acerca dos recursos existentes veja o <ulink url="&url-ddp;">website da Documentação Debian</ulink> e o <ulink url="&url-wiki;">website Debian Wiki</ulink>
sv: Förutom dessa kommentarer till utgåvan och installationsguiden finns ytterligare dokumentation för &debian; tillgänglig från Debian Documentation Project (DDP), som har som mål att skapa högkvalitativ dokumentation för Debiananvändare och -utvecklare. Dokumentation, som till exempel Debian Reference, Debian New Maintainers Guide, Debian FAQ och flera andra finns tillgänglig. För fullständiga detaljer om tillgängliga resurser, se webbplatsen för <ulink url="&url-ddp;">Debian Documentation Project</ulink> och <ulink url="&url-wiki;">Debians Wiki</ulink>.

source: You do not need to be an expert to contribute to Debian. By assisting users with problems on the various user support <ulink url="&url-debian-list-archives;">lists</ulink> you are contributing to the community. Identifying (and also solving) problems related to the development of the distribution by participating on the development <ulink url="&url-debian-list-archives;">lists</ulink> is also extremely helpful. To maintain Debian's high quality distribution, <ulink url="&url-bts;">submit bugs</ulink> and help developers track them down and fix them. If you have a way with words then you may want to contribute more actively by helping to write <ulink url="&url-ddp-svn-info;">documentation</ulink> or <ulink url="&url-debian-i18n;">translate</ulink> existing documentation into your own language.
de: Sie müssen kein Experte sein, um etwas zu Debian beitragen zu können. Sie unterstützen die Gemeinschaft beispielsweise, indem Sie bei den verschiedenen Benutzeranfragen in den <ulink url="&url-debian-list-archives;">Mailinglisten</ulink> helfen. Fehler im Zusammenhang mit der Entwicklung der Distribution zu finden (und zu beheben), indem Sie an den Entwicklungs-<ulink url="&url-debian-list-archives;">Mailinglisten</ulink> teilnehmen, ist ebenfalls sehr hilfreich. Um Debians hochqualitative Distribution zu erhalten, <ulink url="&url-bts;">berichten Sie Fehler</ulink> und helfen Sie den Entwicklern, diese genauer zu identifizieren und zu lösen. Falls Sie gut im Umgang mit Worten sind, können Sie auch helfen, <ulink url="&url-ddp-svn-info;">Dokumentation</ulink> zu schreiben oder bereits bestehende Dokumentation in Ihre eigene Sprache zu <ulink url="&url-debian-i18n;">übersetzen</ulink>.
fr: Il n'est pas nécessaire d'être un expert pour contribuer à Debian. En aidant les utilisateurs qui ont des problèmes sur les diverses <ulink url="&url-debian-list-archives;">listes</ulink> d'assistance vous contribuez à la communauté. Identifier (et également résoudre) les problèmes liés au développement de la distribution en participant aux <ulink url="&url-debian-list-archives;">listes</ulink> de développement est aussi très utile. Pour maintenir la grande qualité de la distribution Debian, <ulink url="&url-bts;">signalez les bogues</ulink> et aidez les développeurs à les trouver et à les résoudre. Si vous êtes plutôt un littéraire, vous voudrez peut-être contribuer plus activement en écrivant des <ulink url="&url-ddp-svn-info;">documentations</ulink> ou en <ulink url="&url-debian-i18n;">traduisant</ulink> la documentation existante dans votre langue.
it: Non è necessario essere degli esperti per contribuire a Debian. Assistendo gli utenti con i problemi che espongono sulle varie <ulink url="&url-debian-list-archives;">liste di supporto per gli utenti</ulink> si fornisce un contributo alla comunità. Identificare (e anche risolvere) problemi relativi allo sviluppo della distribuzione tramite la partecipazione alle <ulink url="&url-debian-list-archives;">liste per lo sviluppo</ulink> è un'altra attività estremamente utile. Per mantenere l'alta qualità della distribuzione Debian si possono <ulink url="&url-bts;">segnalare errori</ulink>, in modo da aiutare gli sviluppatori a trovarli e a correggerli. Se si è portati per la scrittura si potrebbe voler fornire più attivamente un contributo aiutando a scrivere la <ulink url="&url-ddp-svn-info;">documentazione</ulink> o a <ulink url="&url-debian-i18n;">tradurre</ulink> nella propria lingua la documentazione esistente.
ja: Debian への貢献は専門家でなくてもできます。問題を抱えたユーザを、いろいろなサポート <ulink url="&url-debian-list-archives;">メーリングリスト</ulink> で助けてあげることも、立派なコミュニティへの貢献です。開発 <ulink url="&url-debian-list-archives;">メーリングリスト</ulink> に参加して、ディストリビューション開発に関する問題を見つける (そして解決する) ことも、もちろん非常に助けになります。Debian を高品質なディストリビューションに保つため、<ulink url="&url-bts;">バグを報告して</ulink>その原因の特定や解決に際して開発者を助けてください。執筆が得意なら、<ulink url="&url-ddp;">文書</ulink>作成や既存文書の自分の言語への<ulink url="&url-debian-i18n;">翻訳</ulink>に積極的に参加し、そこで貢献するのもよいでしょう。
nl: U hoeft geen expert te zijn om bij te dragen aan de ontwikkeling van Debian. Door het helpen van andere gebruikers met problemen op de diverse <ulink url="&url-debian-list-archives;">mailinglijsten voor gebruikers</ulink> levert u ook al een waardevolle bijdrage. Het identificeren (en ook het oplossen) van problemen gerelateerd aan de ontwikkelingen op de <ulink url="&url-debian-list-archives;">ontwikkelaar lijsten</ulink> is van grote waarde. Om de hoge kwaliteit van de Debian distributie te waarborgen kunt u geconstateerde <ulink url="&url-bts;">fouten rapporteren</ulink> en de ontwikkelaars helpen met het opsporen en verhelpen van deze fouten. Wanneer u handig met woorden om kunt gaan en u schriftelijk goed kunt uitdrukken dan kunt u overwegen om door middel van het schrijven van <ulink url="&url-ddp-svn-info;">documentatie</ulink> of het <ulink url="&url-debian-i18n;">vertalen</ulink> van bestaande documentatie naar uw eigen taal een bijdrage te leveren.
pl: Nie trzeba być ekspertem, aby wspomóc rozwój Debiana. Pomagając rozprawić się użytkownikom z ich problemami, za pomocą wielu dostępnych <ulink url="&url-debian-list-archives;">list dyskusyjnych</ulink> uczestniczy się w rozwoju społeczności. Rozpoznawanie (jak również rozwiązywanie) problemów związanych z rozwojem dystrybucji, przez udział w <ulink url="&url-debian-list-archives;">listach deweloperskich</ulink> jest również niezwykle pomocne. Aby utrzymać wysoką jakość dystrybucji Debian prosimy o <ulink url="&url-bts;">zgłaszanie błędów</ulink> i pomoc deweloperom w ich śledzeniu i naprawianiu. Osoby czujące się dobre w pisaniu, mogą pomóc w tworzeniu <ulink url="&url-ddp-svn-info;">dokumentacji</ulink> lub <ulink url="&url-debian-i18n;">tłumaczeniu</ulink> istniejącej na swój język.
pt: Não necessita ser um especialista para contribuir para Debian. Ao ajudar outros utilizadores com problemas nas várias <ulink url="&url-debian-list-archives;">listas</ulink> de suporte aos utilizadores está a contribuir para a comunidade. Identificar (e também resolver) problemas relacionados com o desenvolvimento da distribuição através da participação nas <ulink url="&url-debian-list-archives;">listas</ulink> de desenvolvimento é também extremamente útil. Para manter a alta qualidade da distribuição Debian <ulink url="&url-bts;">submeta bugs</ulink> e ajude os 'developers' a persegui-los e a corrigi-los. Se tiver jeito com as palavras pode contribuir mais activamente ajudando a escrever <ulink url="&url-ddp;">documentação</ulink> ou a <ulink url="&url-debian-i18n;">traduzir</ulink> a documentação existente para o seu próprio idioma.
pt_br: Você não precisa ser um especialista para contribuir com o Debian. Ao ajudar outros usuários com problemas nas várias <ulink url="&url-debian-list-archives;">listas</ulink> de suporte a usuário você está contribuindo com a comunidade. Identificar (e também resolver) problemas relacionados com o desenvolvimento da distribuição através da participação nas <ulink url="&url-debian-list-archives;">listas</ulink> de desenvolvimento é também extremamente útil. Para manter a alta qualidade da distribuição Debian, <ulink url="&url-bts;">submeta relatórios de bugs</ulink> e ajude os desenvolvedores a encontrá-los e a corrigi-los. Se você tiver jeito com as palavras então pode contribuir mais ativamente ajudando a escrever <ulink url="&url-ddp-svn-info;">documentação</ulink> ou <ulink url="&url-debian-i18n;">traduzir</ulink> a documentação existente para o seu próprio idioma.
ro: Nu trebuie să fiți un expert pentru a contribui la Debian. Prin asistarea utilizatorilor cu probleme pe diversele <ulink url="&url-debian-list-archives;">liste</ulink>, contribuiți la comunitate. Identificând (și, de asemenea, rezolvând) problemele legate de dezvoltarea distribuției prin participarea la <ulink url="&url-debian-list-archives;">listele</ulink> de dezvoltare este o altă metodă de a ajuta. Pentru a menține calitatea înaltă a distribuției Debian <ulink url="&url-bts;">raportați problemele</ulink> întâlnite și ajutați dezvoltatorii să le rezolve. Dacă vă pricepeți la scris poate doriți să contribuiți mai activ, ajutând la scrierea <ulink url="&url-ddp-svn-info;">documentației</ulink> sau <ulink url="&url-debian-i18n;">traducând</ulink> documentația existentă în limba dumneavoastră.
ru: Чтобы помочь Debian, не нужно быть большим специалистом. Помогая пользователям в решении их проблем в <ulink url="&url-debian-list-archives;">списках рассылки</ulink> вы уже помогаете сообществу. Выявление (или, что ещё лучше, решение) проблем, связанных с разработкой дистрибутива, участие в обсуждениях в <ulink url="&url-debian-list-archives;">списках рассылки для разработчиков</ulink>, также очень важно. Чтобы помочь поддержать высокое качество Debian, <ulink url="&url-bts;">отправляйте сообщения об ошибках</ulink> и помогайте разработчикам отслеживать и исправлять их. Если вы хорошо владеете языком, то можете помочь в написании <ulink url="&url-ddp-svn-info;">документации</ulink> или <ulink url="&url-debian-i18n;">переводе</ulink> существующей документации на родной язык.
sv: Du behöver inte vara en expert för att bidra till Debian. Genom att hjälpa användare med problem på de olika <ulink url="&url-debian-list-archives;">sändlistorna</ulink> för användarstöd bidrar du till gemenskapen. Identifiering (och lösning) av problem relaterade till utveckling av distributionen genom att delta i <ulink url="&url-debian-list-archives;">sändlistorna</ulink> för utveckling är också mycket uppskattat. För att underhålla Debians högkvalitativa distribution kan du <ulink url="&url-bts;">skicka in felrapporter</ulink> och hjälpa utvecklarna att spåra upp och rätta till felen. Om du är bra på att sätta ihop ord kanske du vill bidra mer aktivt genom att hjälpa till att skriva <ulink url="&url-ddp-svn-info;">dokumentation</ulink> eller <ulink url="&url-debian-i18n;">översätta</ulink> befintlig dokumentation till ditt eget språk.

source: Debian has an IRC channel dedicated to the support and aid of Debian users located on the OFTC IRC network. To access the channel, point your favorite IRC client at irc.debian.org and join <literal>#debian</literal>.
de: Debian hat einen IRC-Kanal im OFTC-IRC-Netzwerk, der für die Unterstützung von Debian-Anwendern bestimmt ist. Um in diesen Kanal zu gelangen, verbinden Sie Ihr IRC-Programm mit irc.debian.org und verwenden Sie den Kanal <literal>#debian</literal> (englisch).
lt: Debian'as turi IRC kanalą OFTC tinkle, skirtą paramos ir pagalbos Debian'o naudotojams teikimui. Norėdami įeiti į šį kanalą, savo mėgiamam IRC klientui nurodykite serverį irc.debian.org ir prisijunkite prie kanalo <literal>#debian</literal>.
nl: Debian heeft een (Engelstalig) IRC-kanaal gewijd aan het ondersteunen en helpen van Debian gebruikers. Dit kanaal bevindt zich op het OFTC IRC-netwerk. Om dit kanaal te bezoeken kunt u met uw favoriete IRC programma verbinding maken met irc.debian.org en kanaal <literal>#debian</literal> betreden (/join <literal>#debian</literal>).
pl: Debian ma kanał IRC, który jest przeznaczony do pomocy użytkownikom Debiana (w sieci IRC OFTC). Dostęp do kanału można uzyskać ze swojego klienta IRC, pod adresem irc.debian.org, wybierając kanał #debian. Obowiązującym językiem jest angielski.
pt: Debian tem um canal de IRC dedicado ao suporte e ajuda aos utilizadores de Debian, está localizado na rede de IRC OFTC. Para aceder ao canal, aponte o seu cliente de IRC favorito para irc.debian.org e junte-se ao <literal>#debian</literal>.
