Repository: lurdan/trans-ddp
Catalog: release-notes/*/moreinfo.po
Languages: be, de, fi, fr, it, ja, lt, nb, nl, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: en
be: be
de: de
fi: fi
fr: fr
it: it
ja: ja
lt: lt
nb: nb
nl: nl
pl: pl
pt: pt
pt_br: pt_BR
ro: ro
ru: ru
sk: sk
sv: sv
vi: vi
zh_tw: zh_TW

source: More information on &debian;
be: Больш звестак аб &debian;
de: Zusätzliche Informationen zu &debian;
fi: Lisätietoja käyttöjärjestelmästä &debian;
fr: Plus d'informations sur &debian;
it: Maggiori informazioni su &debian;
ja: &debian; に関するさらなる情報
lt: Daugiau infornacijos apie &debian;
nb: Mer informasjon om &debian;
nl: Verdere informatie over &debian;
pl: Więcej informacji na temat projektu &debian;
pt: Mais informação acerca de &debian;
pt_br: Mais informações sobre o &debian;
ro: Mai multe informații despre &debian;
ru: Дополнительная информация о &debian;
sk: Ďalšie informácie o Debiane
sv: Mer information om &debian;
vi: Thông tin thêm về &debian;
zh_tw: 更多關於 &debian; 的資訊

source: Further reading
be: Далейшае чытанне
de: Weitere Lektüre
fi: Lisää lukemista
fr: Lectures pour aller plus loin
it: Ulteriori letture
ja: もっと読みたい
lt: Papildomam skaitymui
nb: Ytterligere lesing
nl: Om verder te lezen
pl: Dodatkowe informacje
pt: Leitura adicional
pt_br: Leitura complementar
ro: Referințe suplimentare
ru: Что ещё можно прочитать
sk: Ďalšie čítanie
sv: Ytterligare läsning
vi: Đọc thêm
zh_tw: 閱讀更多資訊

source: Beyond these release notes and the installation guide, further documentation on &debian; is available from the Debian Documentation Project (DDP), whose goal is to create high-quality documentation for Debian users and developers. Documentation, including the Debian Reference, Debian New Maintainers Guide, and Debian FAQ are available, and many more. For full details of the existing resources see the <ulink url="&url-ddp;">DDP website</ulink>.
fi: Tämän julkaisumuistion ja asennusoppaan lukemisen jälkeen &debian; järjestelmän opiskeluun on tarjolla Debian-Dokumentointiprojekti (DDP). Sen tarkoituksena on luoda korkealaatuista ohjeistusta Debianin käyttäjille ja kehittäjille. Saatavilla olevia ohjeita ovat Debian Reference, Debian New Maintainers Guide ja Debian FAQ, sekä useita muita. Yksityiskohtaiset tiedot saatavilla olevasta aineistosta löytyvät <ulink url="&url-ddp;">DDP:n seittisivustosta</ulink>.
nb: I tillegg til disse Utgivelsesnotatene og Installasjonsguiden, så er mer dokumentasjon tilgjengelig om &debian; fra Debian Documentation Project (DDP), som har som mål å lage dokumentasjon av høy kvalitet for brukere og utviklere av Debian. Dokumentasjon, som inkluderer Debian Reference, Debian New Maintainers Guide, og Debian FAQ er tilgjengelig. Besøk siden til DDP på <ulink url="&url-ddp;">DDP nettside</ulink>.
zh_tw: 除了發行情報和安裝指引之外，Debian 文件計畫 (DDP) 也提供了許多 &debian; 更進一步的說明文件。Debian 文件計畫的目標是替 Debian 的使用者和開發者創作出高品質的文件，其中包括了 Debian 參考手冊、Debian 新維護者指引、以及 Debian 常見問答集，以及其他更多的文件。如果您想瞭解關於這些資源的完整訊息，請參考 <ulink url="&url-ddp;">DDP 站台</ulink>。

source: Documentation for individual packages is installed into <filename>/usr/share/doc/<replaceable>package</replaceable></filename>. This may include copyright information, Debian specific details and any upstream documentation.
be: Дакументацыя канкрэтных пакетаў усталёўваецца ў каталогі <filename>/usr/share/doc/<replaceable>package</replaceable></filename>. Яна можа ўключаць інфармацыю аб аўтарскіх правах, спецыфічныя для Debian звесткі, а таксама ўсю дакументацыю ад распрацоўшчыкаў арыгінальнага пакета.
de: Dokumentation zu einzelnen Paketen ist in <filename>/usr/share/doc/<replaceable>Paket</replaceable></filename> installiert. Das schließt Urheberrechtsinformationen, Debian-spezifische Details und Dokumentation der Original-Autoren ein.
fi: Yksittäisten pakettien ohjeistus on asennettu hakemistoon <filename>/usr/share/doc/<replaceable>paketti</replaceable></filename>, tähän voi kuulua tekijänoikeustietoa, Debianiin liittyviä yksityiskohtia ja alkuperäisen tekijän ohjeistus.
fr: La documentation de chaque paquet est installée dans <filename>/usr/share/doc/<replaceable>paquet</replaceable></filename>. Celle-ci peut contenir les informations concernant le copyright, les détails spécifiques à Debian et toute la documentation d'origine.
it: La documentazione per i singoli pacchetti viene installata in <filename>/usr/share/doc/<replaceable>pacchetto</replaceable></filename>. Questa potrebbe includere anche informazioni sul copyright, dettagli specifici inerenti Debian e ogni altra documentazione dell'autore.
ja: それぞれのパッケージの文書は <filename>/usr/share/doc/<replaceable>パッケージ</replaceable></filename>にインストールされています。ここには、著作権情報、Debian 固有の詳細、開発元の文書すべて、などが置かれています。
lt: Konkrečių paketų dokumentacija įdiegiama kataloge <filename>/usr/share/doc/<replaceable>paketas</replaceable></filename>. Čia gali būti autorinių teisių informacija, Debian'o paketui būdingų smulkmenų detalės ir programos autorių dokumentacija.
nb: Dokumentasjonen for de enkelte pakkene blir installert sammen med pakken, og plassert på <filename>/usr/share/doc/<replaceable>pakkenavn</replaceable></filename>. Denne kan inneholde informasjon om opphavsrett, spesifikke Debian detaljer og eventuell dokumentasjon fra hovedutviklerene.
nl: Beschikbare documentatie over individuele pakketten is te vinden onder <filename>/usr/share/doc/<replaceable>pakket</replaceable></filename>. Dit kan onder andere informatie met betrekking tot copyright zijn, specifieke Debian details of documentatie van de oorspronkelijke ontwikkelaars van de software in het pakket.
pl: Dokumentacja poszczególnych pakietów jest instalowana do katalogów <filename>/usr/share/doc/<replaceable>pakiet</replaceable></filename>. Mogą być to informacje o prawach autorskich, detale dystrybucji Debian lub dokumentacja z projektu macierzystego.
pt: A documentação para pacotes individuais está instalada em <filename>/usr/share/doc/<replaceable>pacote</replaceable></filename>. Isto pode conter informação sobre direitos de cópia, detalhes específicos da Debian e qualquer documentação 'upstream'.
pt_br: Documentação para pacotes individuais é instalada em <filename>/usr/share/doc/<replaceable>pacote</replaceable></filename>. Isso pode incluir informação de copyright, detalhes específicos do Debian e documentação do autor do software.
ro: Documentația pentru orice pachet individual este instalată în <filename>/usr/share/doc/<replaceable>pachet</replaceable></filename>. Aceasta poate include informații despre drepturile de autor, detalii specifice Debian, precum și documentația originală a pachetului.
ru: Документация по конкретным пакетам устанавливается в каталог <filename>/usr/share/doc/<replaceable>пакет</replaceable></filename>. Там может находиться информация об авторских правах, специфичная для Debian информация и документация от авторов программы.
sk: Dokumentácia jednotlivých balíkov sa intaluje do adresára <filename>/usr/share/doc/<replaceable>balík</replaceable></filename>. Sem patria informácie o autorských právach, podrobnosti o balíku špecifické pre Debian a všetka dokumentácia pochádzajúca od pôvodných autorov.
sv: Dokumentation för individuella paket installeras i <filename>/usr/share/doc/<replaceable>paket</replaceable></filename>. Den kan inkludera information om upphövsrätt, Debianspecifika detaljer och dokumentation från upphovsmännen.
vi: Tài liệu hướng dẫn về mỗi gói riêng được cài đặt vào thư mục <filename>/usr/share/doc/<replaceable>tên_gói</replaceable></filename>. Các tài liệu này có thể bao gồm thông tin tác quyền, chi tiết đặc trưng cho Debian, và tài liệu hướng dẫn của nhà phát triển gốc.
zh_tw: 個別套件的說明文件則會被安裝到 <filename>/usr/share/doc/<replaceable>package</replaceable></filename> 目錄之中，其中可能會包含了版權資訊，專屬於 Debian 的一些訊息，以及任何原作者所提供的說明文件。

source: Getting help
be: Як атрымаць падтрымку
de: Hilfe bekommen
fi: Apua löytyy
fr: Obtenir de l'aide
it: Ottenere aiuto
ja: 助けを求めるには
lt: Jei reikia pagalbos
nb: Få hjelp
nl: Hulp krijgen
pl: Pomoc
pt: Procurar ajuda
pt_br: Obtendo ajuda
ro: Obținerea de ajutor
ru: Если нужна помощь
sk: Ako získať pomoc
sv: Få hjälp
vi: Tìm trợ giúp
zh_tw: 取得協助

source: There are many sources of help, advice and support for Debian users, but these should only be considered if research into documentation of the issue has exhausted all sources. This section provides a short introduction into these which may be helpful for new Debian users.
be: Карыстальнікі Debian могуць атрымліваць дапамогу, параду й падтрымку рознымі шляхамі, але звяртацца да гэтых варыянтаў варта толькі пасля таго, як вычарпаныя ўсе магчымасці па вывучэнні дакументацыі з даступных крыніц. Гэты раздзел каротка распавядае аб асноўных шляхах атрымання падтрымкі, прыдатных для пачынаючых карыстальнікаў Debian.
de: Es gibt viele Quellen für Hilfe, Ratschläge und Unterstützung für Debian-Anwender, aber sie sollten möglichst nur in Betracht gezogen werden, wenn die Dokumentationen bei einem Problem keine Hilfe geboten haben. Dieser Abschnitt gibt eine kurze Einführung in diese Quellen, die besonders für neue Debian-Anwender hilfreich sein werden.
fi: Apua, neuvoja ja tukea Debianin käyttäjille on saatavilla monelta taholta, mutta näitä olisi käytettävä vasta kun aiheesta saatavilla olevan ohjeistuksen huolellinen tutkiminen ei ole auttanut. Tässä luvussa kerrotaan johdannonomaisesti uusille Debianin käyttäjille mahdollisesti hyödyllisistä välineistä.
fr: Il y a beaucoup de sources d'aide et de conseils possibles pour les utilisateurs de Debian, mais on ne devrait les utiliser que si la recherche dans la documentation a été vaine. Cette section fournit une courte introduction aux sources qui peuvent être utiles aux nouveaux utilisateurs de Debian.
it: Ci sono molte fonti disponibili per l'aiuto, le informazioni e il supporto agli utenti di Debian, ma queste dovrebbero essere prese in considerazione solo se le ricerche nella documentazione inerenti il proprio problema hanno esaurito invano ogni risorsa. Questa sezione fornisce una breve panoramica delle risorse che potrebbero essere d'aiuto ai nuovi utenti di Debian.
ja: Debian ユーザ向けのヘルプ・アドバイス・サポートなどは、いろいろな場所から得られます。しかしこれらを頼りにするのは、その問題について徹底的に文書を調査してからにしましょう。このセクションでは新しく Debian ユーザになった人向けに、これらを簡単に紹介します。
lt: Debian'o naudotojai turi daug galimybių gauti pagalbą ar patarimą, tačiau jomis turėtų būti naudojamasi tik tuo atveju, jei nepavyko rasti atsakymo dokumentacijoje. Šiame skyriuje pateikiamas trumpas aprašymas apie pagalbos šaltinius, kurie gali būti naudingi naujiems Debian'o naudotojams.
nb: Det finnes mange kilder for å få hjelp, råd og støtte for brukere av Debian, men disse bør først brukes etter at man har forsøkt å finne hjelp i dokumentasjonen som finnes. Dette avsnittet nevner kort noen av disse kildene som nye brukere av Debian kan gå til for å få hjelp, råd og støtte.
nl: Er zijn veel hulpbronnen, advies en ondersteuning beschikbaar voor Debian gebruikers wanneer de beschikbare documentatie geen oplossing heeft kunnen bieden. Deze sectie geeft een korte introductie over deze bronnen welke van nut kunnen zijn voor nieuwe Debian gebruikers.
pl: Istnieje wiele źródeł pomocy, rady i wsparcia dla użytkowników Debiana, lecz powinno się z nich korzystać wtedy, gdy przeszukało się wszelką dokumentację, która mogła zawierać wyjaśnienie problemu. Niniejszy rozdział jest krótkim wprowadzeniem który może okazać się pomocny dla nowych użytkowników Debiana.
pt: Existem muitas fontes de ajuda, conselhos e suporte para os utilizadores de Debian, mas estas apenas devem ser consideradas se a investigação na documentação sobre determinado assunto tiver esgotada em todas as fontes. Esta secção disponibiliza uma curta introdução acerca destas fontes que podem ser úteis para novos utilizadores de Debian.
ro: Există multe surse de ajutor, sfaturi și suport pentru utilizatorii Debian, însă acestea ar trebui considerate doar dacă cercetarea documentației a epuizat toate sursele. Această secțiune oferă o scurtă introducere despre acestea, cea ce ar putea fi de ajutor noilor utilizatori Debian.
ru: Пользователи Debian могут воспользоваться помощью, советами и поддержкой из разных источников, но к ним следует прибегать, только если не удалось найти ответа на вопрос в документации. Этот раздел содержит краткое описание дополнительных источников помощи для новых пользователей Debian.
sk: Existuje mnoho spôsobov ako získať pomoc, rady a podporu pri používaní Debianu, no mali by ste ich zvážiť až potom, čo ste pri skúmaní dokumentácie problému vyčerpali všetky dostupné zdroje. Tento oddiel poskytuje krátky úvod k tým, ktoré môžu pomôcť novým používateľom Debianu.
sv: Det finns många källor för hjälp, råd och stöd för Debiananvändare, men dessa bör endast användas om dokumentationen inte har hjälpt till att lösa problemet. Det här kapitlet tillhandahåller en kort introduktion till dessa, vilket kan vara till hjälp för nya Debiananvändare.
vi: Có rất nhiều nguồn trợ giúp, lời khuyên và hỗ trợ cho người dùng Debian, nhưng chỉ nên xem xét nguồn như vậy nếu tài liệu hướng dẫn có sẵn không giúp người dùng giải quyết vấn đề. Phần này giới thiệu ngắn những nguồn trợ giúp bổ sung có thể hữu ích cho người dùng Debian vẫn bắt đầu.
zh_tw: Debian 的使用者可以從許多的管道取得協助、建議、和支援，但您應該只有在用盡了各種手段卻依然找不到問題的解答時才考慮尋求協助。這一節簡單的介紹了對 Debian 的新使用者可能會很有幫助的求助管道。

source: Mailing lists
be: Паштовыя рассылкі
de: Mailinglisten
fi: Postilistat
fr: Listes de diffusion
it: Liste di messaggi
ja: メーリングリスト
lt: Pašto konferencijos
nb: E-postlister
nl: Mailinglijsten
pl: Listy dyskusyjne
pt: Listas de mail
pt_br: Listas de discussão
ro: Listele de discuții
ru: Списки рассылки
sk: Konferencie
sv: Sändlistor
vi: Hộp thư chung
zh_tw: 郵件論壇

source: The mailing lists of most interest to Debian users are the debian-user list (English) and other debian-user-<replaceable>language</replaceable> lists (for other languages). For information on these lists and details of how to subscribe see <ulink url="&url-debian-list-archives;"></ulink>. Please check the archives for answers to your question prior to posting and also adhere to standard list etiquette.
be: Найбольш цікавымі для карыстальнікаў Debian з'яўляюцца рассылкі debian-user (англамоўная) і debian-user-<replaceable>мова</replaceable> (на адпаведных мовах). Звесткі аб гэтых рассылках і шляхах падпіскі на іх можна знайсці на старонцы <ulink url="&url-debian-list-archives;"></ulink>. Калі ласка, перад тым, як задаць пытанне, праглядайце архівы рассылак у пошуку адказаў на яго, а таксама паважайце звычайныя правілы этыкету рассылак.
de: Die für Debian-Anwender interessantesten Mailinglisten sind <quote>debian-user</quote> (Englisch) und weitere, wie debian-user-<replaceable>sprache</replaceable> (für verschiedene andere Sprachen, bspw. debian-user-german). Weitere Informationen zu den Listen und wie diese abonniert werden können, sind auf <ulink url="&url-debian-list-archives;">Debian-Mailinglisten</ulink> beschrieben. Bitte suchen Sie vor dem Schreiben erst in den Listenarchiven nach bereits gegebenen Antworten und bitte beachten Sie auch die Etikette für die Kommunikation auf Mailinglisten.
fi: Debianin käyttäjille kiinnostavimmat sähköpostilistat ovat debian-user (englanninkielinen) ja muut debian-user-<replaceable>kieli</replaceable>-listat (useille muille kielille). Tietoa näistä postituslistoista ja ohjeet listalle liittymiseen löytyy osoitteesta <ulink url="&url-debian-list-archives;"></ulink>. Ole hyvä ja tarkista listojen arkistoista onko kysymykseesi jo vastattu ennen kuin lähetät kysymyksesi listalle. Noudata myös tavanomaisia <ulink url="http://www.cs.tut.fi/~jkorpela/jakelulistat.html">sähköpostilistojen käyttäytymissääntöjä</ulink>.
fr: Les listes de diffusion les plus intéressantes pour les utilisateurs Debian sont les listes debian-user (en anglais), debian-user-french (en français) et les autres listes debian-user-<replaceable>langue</replaceable> (pour les autres langues). Pour plus d'informations sur ces listes et des précisions sur la façon de s'y inscrire, lisez <ulink url="&url-debian-list-archives;"></ulink>. Veuillez chercher la réponse à votre question dans les archives avant de poster sur la liste et veuillez suivre la charte de ces listes.
it: Le liste di messaggi di maggior interesse per gli utenti di Debian sono debian-user (in inglese), debian-italian (in italiano) e le liste debian-user-<replaceable>lingua</replaceable> per le altre lingue. Per informazioni su queste liste e dettagli sulle modalità di sottoscrizione si veda <ulink url="&url-debian-list-archives;"></ulink>. Si raccomanda di cercare la risposta alla propria domanda negli archivi prima di inviarla e di osservare la «netiquette» standard delle liste.
ja: Debian ユーザが最も興味を引かれるであろうメーリングリストは debian-user (英語) リストおよび debian-user-<replaceable>言語</replaceable> (各国語) リストでしょう。これらのリストの詳細や講読のしかたについては、<ulink url="&url-debian-list-archives;"></ulink> を見てください。利用にあたっては、あなたの疑問に対する答えが以前の投稿ですでに答えられていないかどうか、アーカイブをチェックしてください。また標準的なメーリングリストのエチケットに従うようにしてください。
lt: Labiausiai naudotojus dominanti yra debian-user pašto konferencija (anglų kalba) ir debian-user-<replaceable>kalba</replaceable> konferencijos (kitomis kalbomis). Lietuvių kalba tokios konferencijos kol kas nėra. Daugiau informacijos apie elektroninio pašto konferencijas ir apie tai, kaip jas užsiprenumeruoti žiūr. <ulink url="&url-debian-list-archives;"></ulink>. Prieš išsiunčiant klausimą į konferenciją, pažiūrėkite archyvuose, nes galbūt į Jūsų klausimą jau buvo atsakyta anksčiau. Taip pat prašome laikytis bendrai priimto elektroninio pašto konferencijų etiketo.
nb: De e-postlistene som er mest interessante for Debian brukere er nok debian-user list (engelsk) og de andre debian-user-<replaceable>language</replaceable> e-postlistene. For mer informasjon om disse e-postlistene og hvordan man abonnerer på dem gå til <ulink url="&url-debian-list-archives;"></ulink>. Sjekk alltid e-postliste arkivet for eventuelle svar på dine problemer, og husk å følge e-postlist etiketten.
nl: De mailinglijsten welke voor de meeste Debian gebruikers interessant zijn, zijn de debian-user lijst (in het Engels) en andere debian-user-<replaceable>taal</replaceable> lijsten (voor andere talen). Er is ook een lijst voor ondersteuning in het Nederlands, genaamd debian-user-dutch. Verdere informatie over deze lijsten en instructies hoe hier lid van te worden vindt u op <ulink url="&url-debian-list-archives;"></ulink>. Controleer voordat u een bericht naar een mailinglijst stuurt of uw vraag al niet eerder beantwoord is door de mailinglijst archieven te raadplegen. Neemt u wanneer u een bericht stuurt ook de gebruikelijk netiquette in acht.
pl: Najbardziej interesującymi dla użytkowników Debiana listami dyskusyjnymi są: debian-user (angielska) i listy dla poszczególnych języków: debian-user-<replaceable>język</replaceable> (np. debian-user-polish - polska lista). Więcej informacji i szczegóły na temat subskrypcji zawiera strona <ulink url="&url-debian-list-archives;"></ulink>. Przed zamieszczeniem nowej wiadomości prosimy o uprzednie przeszukanie archiwów listy, które może już zawierać odpowiedź na zadawane pytanie; proszę również pamiętać o zachowaniu netykiety.
pt: As listas de mail de mais interesse para os utilizadores de Debian são a lista debian-user (em Inglês) e outras listas debian-user-<replaceable>idioma</replaceable> (para outros idiomas). Para informação acerca destas listas e detalhes sobre como as subscrever veja <ulink url="&url-debian-list-archives;"></ulink>. Por favor verifique nos arquivos antes de colocar a sua questão e adira á etiqueta da lista.
pt_br: As listas de discussão de maior interesse para usuários Debian são as listas debian-user (em inglês) e outras listas debian-user-<replaceable>idioma</replaceable> (para outros idiomas). Por exemplo, a <ulink url="http://lists.debian.org/debian-user-portuguese">debian-user-portuguese</ulink> para usuários que falam o idioma português do Brasil. Para informações sobre essas listas e detalhes sobre como se inscrever, veja <ulink url="&url-debian-list-archives;"></ulink>. Por favor, verifique no histórico de mensagens se já existem respostas para suas perguntas antes de enviar algo e também respeite a etiqueta padrão para listas.
ro: Listele de discuții cu cel mai mare interes pentru utilizatorii Debian sunt debian-user (engleză) și debian-user-<replaceable>limbă</replaceable> (pentru alte limbi). Pentru informații despre aceste liste și detalii despre înscriere, a se vedea <ulink url="&url-debian-list-archives;"></ulink>. Vă rugăm să verificați arhivele pentru răspunsuri la întrebările dumneavoastră înainte de a trimite mesaje și să respectați regulile listei.
ru: Основной интерес для пользователей Debian представляют англоязычный список рассылки debian-user, или списки debian-user-<replaceable>язык</replaceable> и debian-<replaceable>язык</replaceable> для других языков. Для русского языка это список debian-russian. Информацию о списках рассылки и о том, как на них подписаться см. на <ulink url="&url-debian-list-archives;"></ulink>. Пожалуйста, перед тем, как отправить вопрос в список рассылки, поищите ответ на него в архивах. Просим также придерживаться общепринятых норм почтового этикета.
sk: Konferencie elektronickej pošty, ktoré najviac zaujímajú používateľov Debianu, sú debian-user (po anglicky) a ostatné konferencie debian-user-<replaceable>jazyk</replaceable> (v ostatných jazykoch). Informácie o týchto konferenciách a ako sa do nich prihlásiť popisuje <ulink url="&url-debian-list-archives;"></ulink>. Rešpektujte prosím štandardnú etiketu elektronickej komunikácie a konferencií a než pošlete svoju otázku, pohľadajte najskôr v archívoch konferencie či sa ju už niekto pýtal.
sv: De sändlistor som är mest intressanta för Debian-användarna är listan debian-user (engelsk) och andra debian-user-<replaceable>språk</replaceable>-listor (för andra språk; <literal>swedish</literal> för svenska). För information om dessa listor och detaljer om hur man prenumererar, se <ulink url="&url-debian-list-archives;"></ulink>. Leta i arkiven efter svar på dina frågor innan du postar en ny fråga, så bryter du inte mot listetiketten.
vi: Những hộp thư chung (mailing list) hữu ích nhất cho người dùng Debian là « debian-user » (tiếng Anh: cũng có thể yêu cầu dự án tạo một hộp thư chung người dùng bằng ngôn ngữ mẹ đẻ). Để tìm thông tin về các hộp thư chung Debian và cách đăng ký, xem <ulink url="&url-debian-list-archives;"></ulink>. Trước khi gửi một thư xin trợ giúp, người dùng nên tìm kiếm qua kho thư (mà chứa rất nhiều thông tin về vấn đề thường gặp), và tùy theo quy ước mặc nhận trong hộp thư chung (v.d. hãy lặng lẽ, viết đáp ứng bên dưới thân thư gốc, cắt ngắn đoạn văn gốc không còn có ích lại, không nên VIẾT CẢ CHỮ HOA, không đính kèm tập tin (gửi tập tin đính kèm một thư riêng cho người dùng khác), thay đổi dòng Chủ đề khi giới thiệu một vấn đề mới).
zh_tw: Debian 的使用者最感興趣的郵件論壇應該是 debian-user 論壇（英文）以及其他的 debian-user-<replaceable>language</replaceable> 論壇（其他語言）了。您可以在<ulink url="&url-debian-list-archives;"></ulink> 取得這些論壇的相關細節，以及訂閱的方法。請您在論壇中發言前先檢查過去的論壇存檔中是否已經提供了問題的解答，並請遵守郵件論壇上的基本禮節。

source: Internet Relay Chat
be: Internet Relay Chat (IRC)
fi: IRC
fr: Chat (IRC)
ja: インターネットリレーチャット (IRC)
lt: IRC
nl: Internet Relay Chat (IRC)
pl: IRC
pt: Internet Relay Chat (IRC)
ru: IRC
vi: IRC — Trò chuyện chuyển tiếp trên Internet
zh_tw: IRC(Internet Relay Chat) 網路聊天室
