Repository: lurdan/trans-ddp
Catalog: release-notes/*/moreinfo.po
Languages: be, de, fi, fr, it, ja, lt, nb, nl, pl, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: You can submit a bug report using the program <command>reportbug</command> or manually using email. You can read more about the Bug Tracking System and how to use it by reading the reference documentation (available at <filename>/usr/share/doc/debian</filename> if you have <systemitem role="package">doc-debian</systemitem> installed) or online at the <ulink url="&url-bts;">Bug Tracking System</ulink>.
be: Вы можаце даслаць паведамленне аб памылцы з дапамогай праграмы <command>reportbug</command> альбо самастойна праз электронную пошту. Больш звестак пра BTS і карыстанне ёю ёсць у даведніку (гл. дырэкторыю <filename>/usr/share/doc/debian</filename>, калі ў Вас усталяваны пакет <systemitem role="package">doc-debian</systemitem>), альбо на <ulink url="&url-bts;">старонцы BTS</ulink> у сеціве.
de: Sie können einen Fehler mit Hilfe des Programms <command>reportbug</command> oder manuell per E-Mail berichten. Weitere Informationen zum Fehlerdatenbanksystem und wie es zu bedienen ist finden Sie in der Referenzdokumentation (unter <filename>/usr/share/doc/debian</filename>, wenn Sie <systemitem role="package">doc-debian</systemitem> installiert haben) oder online in der <ulink url="&url-bts;">Fehlerdatenbank</ulink>.
fi: Vikailmoitus voidaan lähettää ohjelmalla <command>reportbug</command> tai lähettämällä suoraan sähköpostia. Lisää tietoja vianseurantajärjestelmästä ja sen käyttöohjeita voi lukea hakemiston <filename>/usr/share/doc/debian</filename> ohjetiedostoista mikäli <systemitem role="package">doc-debian</systemitem> on asennettu tai netistä osoitteesta <ulink url="&url-bts;">Vianseurantajärjestelmä</ulink>.
fr: Vous pouvez soumettre un rapport de bogue en utilisant le programme <command>reportbug</command> ou en envoyant un courrier électronique. Vous trouverez plus d'informations sur le système de suivi des bogues (BTS) et les moyens de l'utiliser dans la documentation de référence (disponible à <filename>/usr/share/doc/debian</filename> si vous avez installé <systemitem role="package">doc-debian</systemitem>) ou en ligne sur le site du <ulink url="&url-bts;">système de suivi des bogues</ulink>.
it: Si può segnalare un errore utilizzando il programma <command>reportbug</command> o manualmente utilizzando la posta elettronica. Si possono ottenere maggiori informazioni sul Bug Tracking System e su come utilizzarlo leggendo le schede di riferimento (disponibili presso <filename>/usr/share/doc/debian</filename>, se si ha installato <systemitem role="package">doc-debian</systemitem>), o in linea presso il <ulink url="&url-bts;">Bug Tracking System</ulink>.
ja: バグ報告は、<command>reportbug</command> プログラムを使って送信することもできますし、電子メールを使って手で送ることもできます。バグ追跡システムに関する詳細やその使い方については、リファレンス文書 (<systemitem role="package">doc-debian</systemitem> パッケージをインストールしていれば <filename>/usr/share/doc/debian</filename> にあります) をお読み頂くか、または<ulink url="&url-bts;">バグ追跡システム</ulink>のウェブサイトからオンラインで入手することもできます。
lt: Pranešimą apie riktą galite pateikti naudodamiesi programa <command>reportbug</command> arba elektroniniu paštu. Daugiai informacijos apie riktų sekimo sistemą (BTS) ir kaip ja naudotis galite rasti Debian'o žinyne (galima rasti adresu <filename>/usr/share/doc/debian</filename>, jei esate įdiegę <systemitem role="package">doc-debian</systemitem>) arba internete adresu <ulink url="&url-bts;">Riktų sekimo sistema</ulink>.
nb: Du kan enkelt sende inn feilrapporter ved å bruker programmet <command>reportbug</command>, eller manuelt som en vanlig e-post. Du kan lese mer om feilrapporteringsystemet og hvordan du kan bruke det ved å lese <filename>/usr/share/doc/debian</filename>, hvis du har pakken <systemitem role="package">doc-debian</systemitem> installert. Eller du kan lese om det på <ulink url="&url-bts;">Bug Tracking System</ulink>.
nl: U kunt een bug-rapport indien met behulp van het programma <command>reportbug</command> of handmatig door middel van het sturen van een e-mail. U kunt meer lezen over het het "Bug Tracking Systeem" en hoe dit te gebruiken door de documentatie te lezen (beschikbaar onder <filename>/usr/share/doc/debian</filename> wanneer u <systemitem role="package">doc-debian</systemitem> ge√Ønstalleerd heeft) of online op het <ulink url="&url-bts;">Bug Tracking Systeem</ulink>.
pl: Błędy można zgłaszać za pomocą programu <command>reportbug</command> lub ręcznie, za pomocą poczty elektronicznej. Więcej informacji o Systemie Śledzenia Błędów i sposobie korzystania z niego, zawiera dokumentacja (dostępna w <filename>/usr/share/doc/debian</filename>, jeśli zainstalowano pakiet <systemitem role="package">doc-debian</systemitem>) lub strona <ulink url="&url-bts;">System Śledzenia Błędów</ulink>.
pt: Pode submeter um relatório de bug utilizando o programa <command>reportbug</command> ou manualmente utilizando o email. Pode ler mais acerca do sistema de seguimento de bugs (BTS) e de como utiliza-lo lendo a documentação de referência (disponível em <filename>/usr/share/doc/debian</filename> se tiver instalado o <systemitem role="package">doc-debian</systemitem>) ou online no <ulink url="&url-bts;">sistema de seguimento de bugs (BTS)</ulink>.
pt_br: Você pode submeter um relatório de bug utilizando o programa <command>reportbug</command> ou manualmente usando e-mail. Você pode entender mais a respeito do Sistema de Rastreamento de Bugs (BTS) e de como utilizá-lo lendo a documentação de referência (disponível em <filename>/usr/share/doc/debian</filename>, se tiver instalado o <systemitem role="package">doc-debian</systemitem>) ou online no <ulink url="&url-bts;">Sistema de Rastreamento de Bugs</ulink>.
ro: Puteți trimite un raport de problemă folosind programul <command>reportbug</command> sau manual, folosind poșta electronică. Puteți citi mai multe despre Sistemul de gestionare a problemelor și cum se poate utiliza citind documentația de referință (disponibilă în <filename>/usr/share/doc/debian</filename> dacă aveți instalat <systemitem role="package">doc-debian</systemitem>) sau online la <ulink url="&url-bts;">Bug Tracking System</ulink>.
ru: Отправить сообщение об ошибке можно с помощью программы <command>reportbug</command> или вручную по электронной почте. Более подробную информацию о системе отслеживания ошибок и о том, как её использовать, можно найти в каталоге <filename>/usr/share/doc/debian</filename> после установки пакета <systemitem role="package">doc-debian</systemitem> или на сайте <ulink url="&url-bts;">системы отслеживания ошибок</ulink>.
sk: Hlásenie o chybe môžete poslať pomocou programu <command>reportbug</command> alebo manuálne zaslaním emailu. Viac o Systéme sledovania chýb a ako ho používať sa dozviete v jeho dokumentácii (v <filename>/usr/share/doc/debian</filename> ak máte nainštalovaný balík <systemitem role="package">doc-debian</systemitem>) alebo online na stránke <ulink url="&url-bts;">Systému sledovania chýb</ulink>.
sv: Du kan skicka in en felrapport med programmet <command>reportbug</command> eller manuellt via e-post. Du kan läsa mer om felhanteringssystemet och hur man använder det genom att läsa referenskorten (tillgängliga i <filename>/usr/share/doc/debian</filename> om du har paketet <systemitem role="package">doc-debian</systemitem> installerat) eller i <ulink url="&url-bts;">felhanteringssystemet</ulink>.
vi: Người dùng lúc nào cũng có khả năng tự động gửi báo cáo lỗi dùng chương trình <command>reportbug</command> hoặc tự gửi một báo cáo bằng thư điện tử. Có thêm thông tin về Hệ thống Theo dõi Lỗi và cách sử dụng nó trong tài liệu tham chiếu (có sẵn trong thư mục <filename>/usr/share/doc/debian</filename> nếu người dùng đã cài đặt gói <systemitem role="package">doc-debian</systemitem>) hoặc trên Internet ở <ulink url="&url-bts;">Hệ thống Theo dõi Lỗi</ulink>.

source: Contributing to Debian
be: Супрацоўніцтва з Debian
de: Zu Debian beitragen
fi: Debianin avustaminen
fr: Contribuer à Debian
it: Contribuire a Debian
ja: Debian に貢献する
lt: Pagalba Debian'ui
nb: Bidra til Debian
nl: Bijdragen aan Debian
pl: Uczestnictwo w rozwoju Debiana
pt: Contribuir para a Debian
pt_br: Contribuindo para o Debian
ro: Contribuirea la Debian
ru: Как помочь Debian
sk: Ako prispievať do Debianu
sv: Att bidra till Debian
vi: Đóng góp cho Debian
zh_tw: 如何對 Debian 做出貢獻

source: You do not need to be an expert to contribute to Debian. By assisting users with problems on the various user support <ulink url="&url-debian-list-archives;">lists</ulink> you are contributing to the community. Identifying (and also solving) problems related to the development of the distribution by participating on the development <ulink url="&url-debian-list-archives;">lists</ulink> is also extremely helpful. To maintain Debian's high quality distribution, <ulink url="&url-bts;">submit bugs</ulink> and help developers track them down and fix them. If you have a way with words then you may want to contribute more actively by helping to write <ulink url="&url-ddp;">documentation</ulink> or <ulink url="&url-debian-i18n;">translate</ulink> existing documentation into your own language.
fi: Debianin avustamiseksi ei tarvitse olla asiantuntija. Auttamalla käyttäjiä selvittämään ongelmatilanteet <url id="&url-debian-list-archives;" name="postilistoilla"> tuet yhteisöä. Jakelun kehittämiseen liittyvien ongelmien tunnistaminen (ja mikä tärkeintä ratkaiseminen) osallistumalla kehittäjien <url id="&url-debian-list-archives;" name="postilistojen"> keskusteluun on myös erittäin hyödyllistä. Auta Debiania säilyttämään laatu hyvänä <url id="&url-bts;" name="lähettämällä vikailmoituksia"> ja auta kehittäjiä löytämään ja korjaamaan viat. Jos kirjoittaminen sujuu, haluaisit ehkä avustaa aktiivisemmin auttamalla <url id="&url-ddp;" name="ohjeiden"> kirjoittamisessa tai <url id="&url-debian-i18n;" name="kääntämällä"> jo tehtyjä ohjeita äidinkielellesi.
nb: Alle kan bidra til Debian. Ved å hjelpe andre bruker med å svar på de forskjellige e-postlistene på <ulink url="&url-debian-list-archives; ">e-postlistene</ulink> så er yter du et viktig bidrag. Ved å sende inn feilrapporter til <ulink url="&url-bts;">send inn feilrapporter</ulink> og bistå utviklerene med å rette dem opp, så er du med på å opprettholde den høye kvaliteten på Debian. Hvis du er flink til å skrive, så vil du kanskje vurdere å skrive <ulink url="&url-ddp;">dokumentasjon</ulink>, eller kanskje hjelpe til med å <ulink url="&url-debian-i18n;">oversette</ulink> den dokumentasjon som allerede finnes til ditt eget språk.
zh_tw: 並不是只有箇中高手才能對 Debian 做出貢獻。當您在各個使用者 <ulink url="&url-debian-list-archives;">郵件論壇</ulink>中協助其他使用者解決問題時，您就是在對整個社群做出貢獻。參與開發者 <ulink url="&url-debian-list-archives;">郵件論壇</ulink> 以協助找出（以及解決）和系統發行相關的問題對我們也有極大的幫助。為了維護 Debian 系統發行一貫的高品質，請 <ulink url="&url-bts;">回報問題</ulink>，並協助開發人員找出問題的起因以修正錯誤。如果您有文字方面的天份，您也可以選擇藉由 <ulink url="&url-ddp;">文件</ulink> 的撰寫或把現有的文件 <ulink url="&url-debian-i18n;">翻譯</ulink> 成您所使用的語言來做出更直接的貢獻。

source: If you can dedicate more time, you could manage a piece of the Free Software collection within Debian. Especially helpful is if people adopt or maintain items that people have requested for inclusion within Debian. The <ulink url="&url-wnpp;">Work Needing and Prospective Packages database</ulink> details this information. If you have an interest in specific groups then you may find enjoyment in contributing to some of Debian's subprojects which include ports to particular architectures, <ulink url="&url-debian-jr;">Debian Jr.</ulink> and <ulink url="&url-debian-med;">Debian Med</ulink>.
be: Калі Вы здольныя ахвяраваць больш часу, можна ўзяць на сябе адказнасць за кіраванне часткай калекцыі свабодных праграм, з якіх складаецца Debian. Асабліва карыснай будзе дапамога па адаптацыі або падтрымцы рэчаў, якія карыстальнікі просяць уключыць у склад Debian. Больш інфармацыі на гэтую тэму даступна на старонцы <ulink url="&url-wnpp;">"База патрабуючых працы і запатрабаваных пакетаў"</ulink>. Калі ў Вас ёсць адпаведная зацікаўленасць, Вам можа быць даспадобы супрацоўніцтва з такімі суб-праектамі Debian (і іх увасабленнямі для розных архітэктур), як <ulink url="&url-debian-jr;">Дзіцячы Debian (Debian Jr.)</ulink> або <ulink url="&url-debian-med;">Debian для медыкаў (Debian Med)</ulink>.
fi: Jos voit panostaa enemmän aikaa, voit ylläpitää vapaiden ohjelmien kokoelman osaa Debianissa. Erityisen hyödyllistä on ottaa vastuulleen tai ylläpitää toivottuja lisäyksiä Debianiin, seittisivusto <ulink url="&url-wnpp;">Apua tarvitsevat paketit</ulink> tarjoaa tästä yksityiskohtaisempaa tietoa. Jos mielenkiintosi kohteina ovat tietyt kohderyhmät, saatat ilahtua voidessasi avustaa Debianin osaprojekteja kuten <ulink url="&url-debian-jr;">Debian Jr.</ulink> ja <ulink url="&url-debian-med;">Debian Med</ulink>.
fr: Si vous pouvez consacrer plus de temps, peut-être pouvez-vous gérer, au sein de Debian, un des logiciels de la grande collection des logiciels libres. Il est très important d'adopter ou de maintenir les programmes qui font partie de Debian. La <ulink url="&url-wnpp;">base de données sur le travail à faire et les futurs paquets</ulink> détaille ces informations. Si vous êtes intéressé par des groupes particuliers, alors il vous plaira peut-être de contribuer à certains sous-projets de Debian, dont les portages vers des architectures particulières, <ulink url="&url-debian-jr;">Debian Jr.</ulink> et <ulink url="&url-debian-med;">Debian Med</ulink>.
it: Se si ha più tempo da dedicare, si può provvedere alla gestione di una parte della raccolta di software libero contenuta in Debian. È particolarmente utile che delle persone adottino o mantengano elementi che altre persone hanno richiesto di includere in Debian. I dettagli a tal proposito si trovano nel <ulink url="&url-wnpp;">Work Needing and Prospective Packages database</ulink>. Se si ha un interesse verso qualche area specifica, si potrebbe trovare piacevole fornire un contributo a qualcuno fra i sottoprogetti di Debian, che comprendono port ad architetture particolari, <ulink url="&url-debian-jr;">Debian Jr.</ulink> e <ulink url="&url-debian-med;">Debian Med</ulink>.
ja: もっと時間が自由になるなら、Debian に属するフリーソフトウェア集の一部を管理してみるのはどうでしょうか。皆が Debian に入れてほしいと思っているソフトウェアを引き受けて管理するのは、特に価値の高い貢献です。これに関する詳細は、<ulink url="&url-wnpp;">作業が望まれるパッケージのデータベース</ulink>をご覧になってください。Debian にはいくつかサブプロジェクトが存在しており、特定のアーキテクチャへの移植、<ulink url="&url-debian-jr;">Debian Jr.</ulink>、<ulink url="&url-debian-med;">Debian Med</ulink> などが進められています。これらのうち、あなたが興味を持っているグループに参加するのもよいでしょう。
nb: Hvis du kan sette av litt mer tid, så kunne du f.eks vedlikeholde en Debian-pakke. Spesielt hjelpsomt er det om du kunne adoptere, eller ta ansvar for en pakke som noen ønsker skal inkluderes inn i Debian. Nettsiden <ulink url="&url-wnpp;">Work Needing and Prospective Packages database</ulink> inneholder en oversikt over slike pakker. Hvis du har en spesiell interesse, så kan du bidra til en av Debians mange underprosjekter, som <ulink url="&url-debian-jr;">Debian Jr.</ulink> og <ulink url="&url-debian-med;">Debian Med</ulink>.
nl: Wanneer u wat meer vrije tijd over heeft kunt u wellicht het beheer van een stukje software uit de vrije software verzameling van Debian op zich nemen. In het bijzonder helpt het wanneer men pakketten adopteert die zonder beheerder zijn of wanneer u werkt aan het toevoegen van nieuwe pakketten aan Debian waar mensen om gevraagd hebben. Welke pakketten dit betreft vindt u terug in de <ulink url="&url-wnpp;">Work Needing and Prospective Packages database</ulink>. Wanneer uw interesse uitgaat naar specifieke doelgroepen dan kunt u wellicht bijdragen aan een van Debians subprojecten zoals specifieke computerarchitecturen, <ulink url="&url-debian-jr;">Debian Jr.</ulink> voor de jeugd en <ulink url="&url-debian-med;">Debian Med</ulink> gericht op de medische wereld.
pt: Se puder dedicar mais tempo, pode gerir uma peça da colecção de Software Livre dentro de Debian. É especialmente útil se as pessoas adoptarem ou mantiverem items que pessoas pediram para incluir na Debian. A <ulink url="&url-wnpp;">base de dados 'Work Needing e Prospective Packages</ulink> detalha esta informação. Se tem interesse em grupos específicos então pode achar agradável contribuir para alguns sub-projectos Debian que incluem 'ports' para arquitecturas especificas, <ulink url="&url-debian-jr;">Debian Jr.</ulink> e <ulink url="&url-debian-med;">Debian Med</ulink>.
ro: Dacă puteți dedica mai mult timp, puteți gestiona o piesă din colecția de software liber inclusă în Debian. De un real folos ar fi să adoptați sau să întrețineți programe solicitate pentru includere în Debian. Informații suplimentare găsiți la <ulink url="&url-wnpp;">baza de date respectivă (Work Needing and Prospective Packages)</ulink>. Dacă aveți un interes pentru grupuri specifice s-ar putea să vă placă contribuția la unele din proiectele Debian ce includ portări pe anumite arhitecturi, <ulink url="&url-debian-jr;">Debian Jr.</ulink> și <ulink url="&url-debian-med;">Debian Med</ulink>.
ru: Если вы можете уделить Debian больше времени, можно взяться за сопровождение какой-нибудь свободной программы в Debian. В частности, полезной была бы поддержка пакетов, которые кто-то особенно хотел бы видеть в Debian. Подробную информацию можно найти на странице <ulink url="&url-wnpp;">требующих доработки и планируемых пакетов</ulink>. Если вам интересна какая-то специфическая группа пользователей, возможно, вы захотите участвовать в одном из дочерних проектов Debian. Среди них перенос Debian на другие архитектуры, проекты <ulink url="&url-debian-jr;">Debian для детей</ulink> и <ulink url="&url-debian-med;">Debian в медицине</ulink>.
sk: Ak chcete venovať viac času, môžete v rámci Debianu spravovať časť kolekcie slobodného softvéru. Obzvlášť užitočné je, ak ľudia prevezmú alebo začnú spravovať veci, ktoré si niekto vyžiadal zaradiť do Debianu. Podrobnosti o tomto nájdete v <ulink url="&url-wnpp;">databáze balíkov, ktoré potrebujú pomoc a perspektívnych balíkov</ulink>. Ak vás zaujímajú konkrétne skupiny, môže vás baviť účasť v niektorom z podprojektov Debianu, kam patria porty na rôzne architektúry, <ulink url="&url-debian-jr;">Debian Jr.</ulink> alebo <ulink url="&url-debian-med;">Debian Med</ulink>.
sv: Om du kan avsätta mer tid, skulle du kunna ansvara för en del av den fria programvaran i Debian. Speciellt behjälpligt är det om personer adopterar eller ansvarar för saker som folk har frågat efter om att inkluderas i Debian. Databasen <ulink url="&url-wnpp;">Work Needing and Prospective Packages</ulink> har detaljer om den här informationen. Om du har intresse av mer specifika grupper kan du finna glädje i att bidra till några av Debians underprojekt vilka inkluderar porteringar till specifika arkitekturer, <ulink url="&url-debian-jr;">Debian Jr.</ulink> och <ulink url="&url-debian-med;">Debian Med</ulink>.
vi: Nếu người dùng có đủ thời gian rảnh, cũng có thể quản lý một hay vài gói phần mềm tự do bên trong Debian. Đặc biệt giúp ích khi một người tham gia cũng chịu trách nhiệm về hay duy trì phần mềm được người dùng yêu cầu bao gồm trong Debian. <ulink url="&url-wnpp;">Cơ sở dữ liệu Việc cần làm và Gói tương lai</ulink> (Work Needing and Prospective Packages) chứa thông tin đó. Người dùng quan tâm đến một vùng riêng cũng có thể đóng góp cho dự án con của Debian, v.d. chuyển phần mềm sang kiến trúc riêng, <ulink url="&url-debian-jr;">Debian Trẻ</ulink> và <ulink url="&url-debian-med;">Y tế Debian</ulink>.
zh_tw: 如果您能投注更多的時間的話，您可以負責維護 Debian 中一部分的自由軟體。如果您能夠接續或維護其他使用者希望 Debian 所能提供的軟體的話就更好了，您可以在 <ulink url="&url-wnpp;">亟需人手以及受到期待的套件資料庫 (WNPP)</ulink> 中取得相關的資訊。如果您的興趣是集中在特別的領域之中，那您可能會想要參加像是某個特定硬體平台的系統移植、<ulink url="&url-debian-jr;">Debian Jr.</ulink> 以及 <ulink url="&url-debian-med;">Debian Med</ulink> 之類在 Debian 中的子計畫。
