Repository: lurdan/trans-ddp
Catalog: release-notes/*/old-stuff.po
Languages: be, de, fi, fr, it, ja, lt, ml, nb, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: Open the file <filename>/etc/apt/sources.list</filename> with your favorite editor (as <literal>root</literal>) and check all lines beginning with <literal>deb http:</literal> or <literal>deb ftp:</literal> for a reference to <quote><literal>stable</literal></quote>. If you find any, change <literal>stable</literal> to <literal>&oldreleasename;</literal>.
be: Ад імя карыстальніка <literal>root</literal> з дапамогай свайго ўлюбёнага рэдактара тэксту адчыніце файл <filename>/etc/apt/sources.list</filename> і знайдзіце ўсе радкі, якія пачынаюцца з <literal>deb http:</literal> або <literal>deb ftp:</literal> ды спасылаюцца на <quote><literal>stable</literal></quote>. У такіх радках трэба замяніць <literal>stable</literal> на <literal>&oldreleasename;</literal>.
de: Bearbeiten Sie als <literal>root</literal> die Datei <filename>/etc/apt/sources.list</filename> mit einem Editor und überprüfen Sie alle Zeilen, die mit <literal>deb http:</literal> oder <literal>deb ftp:</literal> beginnen, ob sie Referenzen auf <quote><literal>stable</literal></quote> enthalten. Falls ja, ändern Sie diese von <literal>stable</literal> auf <literal>&oldreleasename;</literal>.
fi: Muokkaa tiedostoa <filename>/etc/apt/sources.list</filename> mieliteksturillasi (käyttäjänä <literal>root</literal>) ja tarkista kaikilta riveiltä joiden alussa on <literal>deb http:</literal> tai <literal>deb ftp:</literal> onko niillä viittaus jakeluun "<literal>stable</literal>". Jos on, vaihda <literal>stable</literal> tilalle <literal>&oldreleasename;</literal>.
fr: Ouvrez le fichier <filename>/etc/apt/sources.list</filename> avec votre éditeur favori (en tant que <literal>superutilisateur</literal>r) et recherchez une référence à <quote><literal>stable</literal></quote> dans toutes les lignes commençant par <literal>deb http:</literal> ou <literal>deb ftp:</literal>. Si vous en trouvez, changez <literal>stable</literal> en <literal>&oldreleasename;</literal>.
it: Si apra il file <filename>/etc/apt/sources.list</filename> con il proprio editor preferito (come utente <literal>root</literal>) e si esaminino tutte le righe che cominciano con <literal>deb http:</literal> o <literal>deb ftp:</literal>, cercando un riferimento a <quote><literal>stable</literal></quote>. Se ve n'è qualcuno, si cambi <literal>stable</literal> in <literal>&oldreleasename;</literal>.
ja: (<literal>root</literal> になってから) お気に入りのエディタで <filename>/etc/apt/sources.list</filename> を開き、<literal>deb http:</literal> や <literal>deb ftp:</literal> で始まるすべて行の中に <quote><literal>stable</literal></quote> が指定されているかどうかを調べてください。もしあるなら、<literal>stable</literal> を <literal>&oldreleasename;</literal> に変更してください。
lt: Atverkite failą <filename>/etc/apt/sources.list</filename> savo mėgiamu redaktoriumi (turėdami administratoriaus <literal>root</literal> privilegijas) ir raskite visas eilutes prasidedančias kaip <literal>deb http:</literal> arba <literal>deb ftp:</literal>, ir turinčias žodį <quote><literal>stable</literal></quote>. Radę tokias eikutes, pakeiskite žodį <literal>stable</literal> į žodį <literal>&oldreleasename;</literal>.
ml: (<literal>root</literal>) അധികാരത്തോടെ നങ്ങള്‍ക്കിഷ്ടമുള്ള എഡിറ്റര്‍ ഉപയോഗിച്ച് <filename>/etc/apt/sources.list</filename> എന്ന ഫയല്‍ തുറന്ന് <literal>deb http:</literal> or <literal>deb ftp:</literal> എന്ന് തുടങ്ങുന്ന <quote><literal>stable</literal></quote> എന്ന വാക്കുള്ള ഏതെങ്കിലും വരികളുണ്ടോ എന്ന് നോക്കുക. കണ്ടെത്തുകയാണെങ്കില്‍ <literal>stable</literal> എന്നത് <literal>&oldreleasename;</literal> എന്നാക്കുക.
nb: Åpne fila <filename>/etc/apt/sources.list</filename> med din favoritt tekstbehandler (som <literal>root</literal>) og kontroller alle linjer som begynner med enten <literal>deb http:</literal> eller <literal>deb ftp:</literal>, hvis noen av dem refererer til <quote><literal>stable</literal></quote>, så bytt ut <literal>stable</literal> med <literal>&oldreleasename;</literal>.
pt: Abra o ficheiro <filename>/etc/apt/sources.list</filename> com seu editor favorito (como <literal>root</literal>) e verifique todas as linhas que iniciam por <literal>deb http:</literal> ou <literal>deb ftp:</literal> que referenciem a <quote><literal>stable</literal></quote>. Se encontrar alguma altere <literal>stable</literal> para <literal>&oldreleasename;</literal>.
pt_br: Abra o arquivo <filename>/etc/apt/sources.list</filename> com seu editor favorito (como <literal>root</literal>) e verifique todas as linhas começando com <literal>deb http:</literal> ou <literal>deb ftp:</literal> para determinar se existe uma referência a <quote><literal>stable</literal></quote>. Se você encontrar qualquer uma, mude o <literal>stable</literal> para <literal>&oldreleasename;</literal>.
ro: Deschideți fișierul <filename>/etc/apt/sources.list</filename> cu editorul preferat (ca <literal>root</literal>) și verificați toate liniile care încep cu <literal>deb http:</literal> sau <literal>deb ftp:</literal> pentru referințe la <quote><literal>stable</literal></quote>. Dacă ați găsit, modificați <literal>stable</literal> în <literal>&oldreleasename;</literal>.
ru: Откройте файл <filename>/etc/apt/sources.list</filename> с помощью любого текстового редактора (имея привилегии <literal>root</literal>) и поищите в строках, начинающихся с <literal>deb http:</literal> или с <literal>deb ftp:</literal>, слово <quote><literal>stable</literal></quote>. При нахождении, замените <quote><literal>stable</literal></quote> на <quote><literal>&oldreleasename;</literal></quote>.
sk: Otvorte súbor <filename>/etc/apt/sources.list</filename> vo svojom obľúbenom editore (ako <literal>root</literal>) a skontrolujte všetky riadky začínajúce <literal>deb http:</literal> alebo <literal>deb ftp:</literal> či obsahujú odkaz na „<literal>stable</literal>“. Ak nejaké nájdete, zmeňte ich zo <literal>stable</literal> na <literal>&oldreleasename;</literal>.
sv: Öppna filen <filename>/etc/apt/sources.list</filename> med din favoritredigerare (som <literal>root</literal>) och kontrollera alla rader som börjar med <literal>deb http:</literal> eller <literal>deb ftp:</literal> efter en referens till <quote><literal>stable</literal></quote>. Om du hittar någon, ändra <literal>stable</literal> till <literal>&oldreleasename;</literal>.
vi: Hãy mở tập tin <filename>/etc/apt/sources.list</filename> dùng trình soạn thảo (với quyền chủ [<literal>root</literal>]) và kiểm tra mọi dòng bắt đầu với <literal>deb http:</literal> hay <literal>deb ftp:</literal> tìm một tham chiếu đến <quote><literal>stable</literal></quote> (bản ổn định). Tìm được thì thay đổi <literal>stable</literal> thành <literal>&oldreleasename;</literal>.
zh_tw: 使用您慣用的編輯器，以 <literal>root</literal> 的身份開啟 <filename>/etc/apt/sources.list</filename> 這個檔案，然後檢查所有以 <literal>deb http:</literal> 或 <literal>deb ftp:</literal> 開頭的項目，看看是否有參照至 <quote><literal>stable</literal></quote>。如果有的話，將其中的 <literal>stable</literal> 改為 <literal>&oldreleasename;</literal>。

source: If you have any lines starting with <literal>deb file:</literal>, you will have to check for yourself if the location they refer to contains an &oldreleasename; or a &releasename; archive.
be: Калі Вы знойдзеце радкі, што пачынаюцца з <literal>deb file:</literal>, трэба самастойна высветліць, які архіў знаходзіцца ў адпаведнай дырэкторыі, &oldreleasename; або &releasename;.
de: Falls Zeilen vorkommen, die mit <literal>deb file:</literal> beginnen, müssen Sie selbst überprüfen, ob der darin angegebene Ort ein Archiv von &Oldreleasename; oder &Releasename; enthält.
fi: Jos on rivejä jotka alkavat <literal>deb file:</literal>, on sinun tarkistettava onko niiden osoittamassa paikassa julkaisun &oldreleasename; vai julkaisun &releasename; varastoalue.
fr: Si vous avez des lignes commençant par <literal>deb file:</literal>, vous devrez vérifier vous-même si l'emplacement auquel elles se réfèrent contient une archive de &Oldreleasename; ou de &Releasename;.
it: Se vi sono righe che cominciano con <literal>deb file:</literal>, si deve controllare da sé se gli indirizzi cui si riferiscono contengono un archivio di &oldreleasename; o di &releasename;.
ja: <literal>deb file:</literal> で始まっている行があるなら、その行が指定している場所が &oldreleasename; か &releasename; のどちらのアーカイブなのかを独力で調べなければならないでしょう。
lt: Jei radote eilučių, prasidedančių <literal>deb file:</literal>, turite pats patikrinti, kokie paketai saugomi nurodytame kataloge: ar tai &oldreleasename; ar &releasename; archyvas.
ml: <literal>deb file:</literal> എന്നു് തുടങ്ങുന്ന ഏതെങ്കിലും വരിയുണ്ടെങ്കില്‍, പറഞ്ഞിരിയ്ക്കുന്ന ഇടത്തെത്തി അവിടെ ഒരു &oldreleasename; അല്ലെങ്കില്‍ ഒരു &releasename; ശേഖരം ഉണ്ടോ എന്ന് നോക്കുക.
nb: Hvis du har noen linjer som begynner med <literal>deb file:</literal>, så må du selv finne ut om det sted til referer til inneholder et arkiv for &oldreleasename; eller &releasename; .
pt: Se tiver quaisquer linhas que comecem por <literal>deb file:</literal>, terá que verificar se o local para onde se referem contém um arquivo &oldreleasename; ou &releasename;.
pt_br: Se você possui linhas começando com <literal>deb file:</literal>, você mesmo terá que verificar se o local indicado contém um repositório do &oldreleasename; ou do &releasename;.
ro: Dacă aveți linii care încep cu <literal>deb file:</literal>, va trebui să verificați dacă locația la care se referă conține o arhivă &oldreleasename; sau &releasename;.
ru: Если вы нашли строки, начинающиеся с <literal>deb file:</literal>, то вам придётся самостоятельно проверить, какие пакеты хранятся в указанном каталоге &mdash; &oldreleasename; или &releasename;.
sk: Ak máte nejaké riadky začínajúce <literal>deb file:</literal>, musíte sami skontrolovať, či miesto kam odkazujú obsahuje archív &oldreleasename; alebo archív &releasename;.
sv: Om du har vissa rader som börjar med <literal>deb file:</literal> måste du själv kontrollera om platsen som de refererar till innehåller ett arkiv för &oldreleasename; eller &releasename;.
vi: Nếu tập tin đó chứa dòng nào bắt đầu với <literal>deb file:</literal>, người dùng cần phải tự kiểm tra nếu địa chỉ đã tham chiếu có một kho gói kiểu &oldreleasename; hay &releasename;.
zh_tw: 如果您有任何項目是以 <literal>deb file:</literal> 開頭的，您必須自行檢查這些項目所提供的是 &oldreleasename; 還是 &releasename; 的檔案庫。

source: Do not change any lines that begin with <literal>deb cdrom:</literal>. Doing so would invalidate the line and you would have to run <command>apt-cdrom</command> again. Do not be alarmed if a 'cdrom' source line refers to <quote><literal>unstable</literal></quote>. Although confusing, this is normal.
be: Не змяняйце радкоў, якія пачынаюцца з <literal>deb cdrom:</literal>. Рэдагаванне зробіць радок непрыдатным, і каб узнавіць яго, давядзецца ізноў запускаць каманду <command>apt-cdrom</command>. Не хвалюйцеся, калі cdrom-крыніца пазначаецца як <quote><literal>unstable</literal></quote>. Гэта выглядае дзіўна, але з'яўляецца нармальным.
de: Ändern Sie keine Zeilen, die mit <literal>deb cdrom:</literal> anfangen. Dies würde dazu führen, dass die Zeile ungültig wird und Sie <command>apt-cdrom</command> erneut ausführen müssen. Es ist kein Problem, falls eine <quote>cdrom</quote>-Quellzeile <quote><literal>unstable</literal></quote> enthält. Dies ist zwar verwirrend, aber normal.
fi: Älä muuta mitään riviä jonka alussa on <literal>deb cdrom:</literal>. Rivin muuttaminen tekee siitä kelvottoman ja komento <prgn>apt-cdrom</prgn> on suoritettava uudelleen. Älä huoli jos "cdrom"-rivillä viitataan jakeluun "<literal>unstable</literal>". Tämä on normaalia vaikkakin hämäävää.
fr: Ne changez pas les lignes qui commencent par <literal>deb cdrom:</literal>. Faire cela invaliderait la ligne et vous devriez à nouveau exécuter <command>apt-cdrom</command>. Ne vous inquiétez pas si une ligne de source « cdrom » se réfère à <quote><literal>unstable</literal></quote>. C'est normal, bien que cela paraisse trompeur.
it: Non si modifichi alcuna riga che inizi con <literal>deb cdrom:</literal>, in quanto in tal caso si invaliderebbe la riga e si dovrebbe eseguire nuovamente <command>apt-cdrom</command>. Non ci si allarmi se una fonte «cdrom» fa riferimento a <quote><literal>unstable</literal></quote>: sebbene sia motivo di confusione, questo è normale.
ja: <literal>deb cdrom:</literal> で始まっている行は、絶対に変更しないでください。変更するとその行は無効になって、もう一度 <command>apt-cdrom</command> を実行しなければならなくなるでしょう。'cdrom' ソースが <quote><literal>unstable</literal></quote> を指定していても心配しないでください。混乱するかもしれませんが、これで正常なのです。
lt: Nekeiskite eilutės, prasidedančios <literal>deb cdrom:</literal>. Jei taip padarysite gali tekti iš naujo paleisti vykdyti programą <command>apt-cdrom</command>. Nesijaudinkite jei 'cdrom' eilutėje yra nuoroda į <quote><literal>unstable</literal></quote>. Nors tai ir keista, tai yra normalu.
ml: <literal>deb cdrom:</literal> എന്ന് തുടങ്ങുന്ന ഒരു വരിയിലും മാറ്റം വരുത്തരുത്. അങ്ങനെ ചെയ്താല്‍ അത് ആ വരിയെ അസാധുവാക്കുയും നിങ്ങള്‍ക്ക് <command>apt-cdrom</command> വീണ്ടും ഓടിയ്ക്കേണ്ടി വരും. 'cdrom' വരി <quote><literal>unstable</literal></quote> എന്ന് പ്രതിപാദിയ്ക്കുന്നതാണെങ്കില്‍ പേടിയ്ക്കെണ്ടതില്ല. ആശയക്കുഴപ്പമുണ്ടാക്കുമെങ്കിലും ഇതു് സാധാരണമാണ്.
nb: Ikke endre noen linjer som begynner med <literal>deb cdrom:</literal>. Hvis du gjør det, så blir det en feil på den linja, og du må kjøre kommandoen <command>apt-cdrom</command> omigjen for å rette det opp. Bli ikke forvirret om du ser en 'cdrom'-linje som referer til <quote><literal>unstable</literal></quote>, der er ofte slik for CD-ROM.
pt: Não altere nenhuma linha que comece por <literal>deb cdrom:</literal>. Ao fazê-lo pode invalidar a linha e terá que correr o <command>apt-cdrom</command> de novo. Não se alarme se uma linha da fonte 'cdrom' refere <quote><literal>unstable</literal></quote>. Apesar de confuso, é normal.
pt_br: Não mude nenhuma linha que comece com <literal>deb cdrom:</literal>. Fazer isso invalidaria a linha e você teria que executar o <command>apt-cdrom</command> novamente. Não se assuste se uma linha para uma fonte do tipo 'cdrom' apontar para <quote><literal>unstable</literal></quote>. Embora confuso, isso é normal.
ro: Nu modificați liniile care încep cu <literal>deb cdrom:</literal>. În felul acesta veți invalida linia și va trebui să rulați <command>apt-cdrom</command> din nou. Nu vă alarmați dacă o linie de surse „cdrom” se referă la <literal>unstable</literal>. Deși acest lucru poate crea confuzii, este normal.
ru: Не исправляйте строки, начинающиеся с <literal>deb cdrom:</literal>. Если вы исправите такую строку, то вам придётся снова запускать <command>apt-cdrom</command>. Не беспокойтесь, если источник cdrom ссылается на нестабильный (<quote><literal>unstable</literal></quote>) дистрибутив. Как это ни странно, так и должно быть.
sk: Nemeňte žiadne riadky začínajúce <literal>deb cdrom:</literal>. Tým by ste riadok zneplatnili a museli by ste znova spustiť <command>apt-cdrom</command>. Neznepokojujte sa ak riadok so zdrojom „cdrom“ odkazuje na „<literal>unstable</literal>“. Hoci to môže byť mätúce, je to v poriadku.
sv: Ändra inte några rader som börjar med <literal>deb cdrom:</literal>. Om du gör det så ogiltigförklaras raden och du måste köra <command>apt-cdrom</command> igen. Bli inte rädd om en <quote>cdrom</quote>-källrad refererar till <quote><literal>unstable</literal></quote>. Även om det är förvirrande så är det normalt.
vi: Không nên thay đổi dòng nào bắt đầu với <literal>deb cdrom:</literal>. Thay đổi dòng kiểu nào sẽ làm mất hiệu lực dòng đó thì người dùng cần phải chạy lại câu lệnh <command>apt-cdrom</command>. Không cần lo nếu một dòng nguồn « cdrom » tham chiếu đến <quote><literal>unstable</literal></quote> (bản bất định). Dù trường hợp này làm cho lộn xộn, nó vẫn còn là hợp lệ.
zh_tw: 不要修改任何以 <literal>deb cdrom:</literal> 開頭的項目。否則，這些項目將會因而無法使用，使得您只能再執行一次 <command>apt-cdrom</command>。如果您發現某個 'cdrom' 的來源項目是指向 <quote><literal>unstable</literal></quote> 時請不要覺得太訝異。雖然有點奇怪，但這卻是很正常的。

source: If you've made any changes, save the file and execute
be: Пасля ўнясення зменаў захавайце файл і запусціце каманду
de: Falls Sie Änderungen vorgenommen haben, speichern Sie die Datei und führen Sie
fi: Mikäli olet tehnyt muutoksia, tallenna tiedosto ja suorita
fr: Si vous avez effectué des modifications, sauvegardez le fichier et exécutez :
it: Se si sono fatte delle modifiche, si salvi il file e si esegua
ja: 変更が済んだら、ファイルを保存してから
lt: Jei atlikote kokius nors pakeitimus, išsaugokite failą ir vykdykite komandą
ml: നിങ്ങള്‍ എന്തെങ്കിലും മാറ്റങ്ങള്‍ വരുത്തിയിട്ടുണ്ടെങ്കില്‍, അവ സംരക്ഷിച്ചതിനു ശേഷം
nb: Om du har gjort noen endringer, så lagrer og avslutter du, og kjører deretter:
pt: Se efectuar algumas alterações, grave o ficheiro e execute
pt_br: Se você fizer quaisquer mudanças, salve o arquivo e execute
ro: Dacă ați efectuat modificări, salvați fișierul și executați
ru: Если вы внесли какие-нибудь изменения, сохраните файл и выполните команду
sk: Ak ste vykonali nejaké zmeny, uložte súbor a spustite
sv: Om du har gjort några ändringar, spara filen och kör
vi: Sau khi thay đổi gì thì lưu lại tập tin và thực hiện câu lệnh cập nhật
zh_tw: 如果您進行了任何改變，將檔案儲存並執行

source: to refresh the package list.
be: каб узнавіць спіс пакетаў.
de: aus, um die Paketliste erneut einzulesen.
fi: pakettiluettelon päivittämiseksi.
fr: pour rafraîchir la liste des paquets.
it: per aggiornare la lista dei pacchetti.
ja: と実行して、パッケージリストを更新してください。
lt: tam, kad būtų atnaujintas paketų sąrašas.
ml: നടപ്പിലാക്കി പൊതികളുടെ പട്ടിക പുതുക്കുക.
nb: for å oppdatere pakkelisten
pt: para refrescar a lista de pacotes.
pt_br: para atualizar a lista de pacotes.
ro: pentru a actualiza lista de pachete.
ru: для обновления списка пакетов.
sk: aby sa aktualizoval zoznam balíkov.
sv: för att uppdatera paketlistan.
vi: để cập nhật danh sách các gói.
zh_tw: 來更新套件的列表。

source: Removing obsolete configuration files
de: Veraltete Konfigurationsdateien entfernen
ja: 古く不要になった設定ファイルを削除する
pt: Remover ficheiros de configuração obsoletos
pt_br: Removendo arquivos de configuração obsoletos
ru: Удаление устаревших файлов настройки

source: Since release 2:1.7.7-12, xorg-server no longer reads the file XF86Config-4. See also <ulink url="http://bugs.debian.org/619177">#619177</ulink>.
de: Seit der Version 2:1.7.7-12 verarbeitet xorg-server nicht mehr die Datei XF86Config-4. Lesen Sie auch <ulink url="http://bugs.debian.org/619177">den Fehler #619177</ulink>.
ja: 2:1.7.7-12 リリースから、xorg-server は XF86Config-4 を読み込まなくなりました。<ulink url="http://bugs.debian.org/619177">#619177</ulink> も参照してください。
pt: Desde o lançamento 2:1.7.7-12, o xorg-server já não necessita de ler o ficheiro XF86Config-4. Veja também <ulink url="http://bugs.debian.org/619177">#619177</ulink>.
pt_br: Desde a versão 2:1.7.7-12, o xorg-server não lê mais o arquivo XF86Config-4. Veja também o bug <ulink url="http://bugs.debian.org/619177">#619177</ulink>.
ru: Начиная с выпуска 2:1.7.7-12, xorg-server больше не читает файл XF86Config-4. Смотрите также <ulink url="http://bugs.debian.org/619177">#619177</ulink>.

source: Before upgrading your system to &releasename;, it is recommended to remove old configuration files (such as <filename>*.dpkg-{new,old}</filename> files under <filename>/etc</filename>, as well as the file <filename>/etc/X11/XF86Config-4</filename><placeholder type="footnote" id="0"/>) from the system.
de: Bevor Sie Ihr System auf &releasename; aktualisieren, wird empfohlen, alte Konfigurationsdateien (wie <filename>*.dpkg-{new,old}</filename>-Dateien in <filename>/etc</filename> und auch die Datei <filename>/etc/X11/XF86Config-4</filename><placeholder type="footnote" id="0"/>) vom System zu entfernen.
ja: システムを &releasename; へアップグレードをする前に、古い設定ファイル (<filename>/etc/X11/XF86Config-4</filename><placeholder type="footnote" id="0"/> と同様に <filename>/etc</filename> 以下にある <filename>*.dpkg-{new,old}</filename> ファイルなど) をシステムから削除することを推奨します。
pt: Antes de actualizar o seu sistema para &releasename;, é recomendado remover os ficheiros de configuração antigos (tais como os ficheiros <filename>*.dpkg-{new,old}</filename> em <filename>/etc</filename>, assim como o ficheiro <filename>/etc/X11/XF86Config-4</filename><placeholder type="footnote" id="0"/>) do seu sistema.
pt_br: Antes de atualizar o seu sistema para &releasename;, é recomendado remover arquivos de configuração antigos (tais como arquvos <filename>*.dpkg-{new,old}</filename> em <filename>/etc</filename>, assim como o arquivo <filename>/etc/X11/XF86Config-4</filename><placeholder type="footnote" id="0"/>) do sistema.
ru: Перед обновлением системы до &releasename;, рекомендуется удалить старые файлы настроек (такие как <filename>*.dpkg-{new,old}</filename> в <filename>/etc</filename>, а также файл <filename>/etc/X11/XF86Config-4</filename><placeholder type="footnote" id="0"/>).

source: Upgrade legacy locales to UTF-8
de: Upgrade von veralteten Locales auf UTF-8
fr: Mettre à niveau les anciennes locales vers UTF-8
it: Passare dai locale obsoleti a UTF-8
ja: 古いロケールから UTF-8 へアップグレードする
pt: Actualizar locales antigos para UTF-8
pt_br: Atualizar locales obsoletos para UTF-8
ro: Actualizați localizările învechite la UTF-8
ru: Переход к использованию локалей с UTF-8
sk: Aktualizácia starých locales na UTF-8
sv: Uppgradera äldre lokalinställningar till UTF-8
