Repository: lurdan/trans-ddp
Catalog: release-notes/*/old-stuff.po
Languages: be, de, fi, fr, it, ja, lt, ml, nb, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: en
be: be
de: de
fi: fi
fr: fr
it: it
ja: ja
lt: lt
ml: ml
nb: nb
pt: pt
pt_br: pt_BR
ro: ro
ru: ru
sk: sk
sv: sv
vi: vi
zh_tw: zh_TW

source: Managing your &oldreleasename; system before the upgrade
de: Verwalten Ihres &Oldreleasename;-Systems vor dem Upgrade
fr: Gérer votre système &Oldreleasename; avant la mise à niveau
it: Gestire il proprio sistema &oldreleasename; prima dell'avanzamento
ja: アップグレードの前に &oldreleasename; システムを調整する
pt: Gerir o seu sistema &oldreleasename; antes da actualização
pt_br: Gerenciando seu sistema &oldreleasename; antes da atualização
ro: Gestionarea sistemului &oldreleasename; înainte de actualizare
ru: Подготовка системы &oldreleasename; к обновлению
sk: Ako spravovať váš systém &oldreleasename; pred aktualizáciou
sv: Hantera ditt &oldreleasename;-system före uppgraderingen

source: This appendix contains information on how to make sure you can install or upgrade &oldreleasename; packages before you upgrade to &releasename;. This should only be necessary in specific situations.
be: Гэты дадатак утрымлівае інструкцыі, як перад абнаўленнем да &releasename; пераканацца, што Вы можаце ўсталёўваць альбо абнаўляць пакеты &oldreleasename;. Гэтыя парады патрэбныя толькі ў адмысловых выпадках.
de: Dieser Anhang enthält Informationen darüber, wie Sie sicherstellen, dass Sie ein Upgrade von Paketen aus &Oldreleasename; durchführen oder diese installieren können, bevor Sie das Upgrade auf &Releasename; durchführen. Dies sollte nur in besonderen Situationen notwendig sein.
fi: Tässä liitteessä neuvotaan miten varmasti saadaan asennettua tai päivitettyä julkaisun &oldreleasename; paketteja ennen päivitystä julkaisuun &releasename;. Tämän pitäisi olla tarpeellista vain erikoistilanteissa.
fr: Cette annexe contient des informations sur la façon de vous assurer que vous pouvez installer ou mettre à jour des paquets de &Oldreleasename; avant de faire une mise à niveau vers &Releasename;. Cela ne devrait être nécessaire que dans des situations spécifiques.
it: Questa appendice contiene informazioni su come accertarsi di poter aggiornare o installare i pacchetti di &oldreleasename; prima di aggiornare a &releasename;. Questo dovrebbe essere necessario solo in casi particolari.
ja: この付録には、&releasename; へアップグレードする前に &oldreleasename; パッケージを確実にインストールしたりアップグレードする方法についての情報が述べられています。特定の状況でのみ必要となるでしょう。
lt: Šiame priede pateikiama informacija apie tai, kaip įsitikinti, kad galite įdiegti ar atnaujinti &oldreleasename; paketus prieš atnaujinant iki &releasename;. Tai būtina tik tam tikrais konkrečiais atvejais.
ml: &releasename; യിലേയ്ക്കു് കയറുന്നതിന് മുന്‍പ് ഇന്‍സ്റ്റാള്‍ ചെയ്യുവാനോ, &oldreleasename; യിലേയ്ക്കു് കയറുവാനോ നിങ്ങള്‍ക്ക് സാധിയ്ക്കും എന്നുറപ്പു വരുത്തുവാനുള്ള വിവരങ്ങള്‍ ഈ അനുബന്ധത്തില്‍ ലഭ്യമാണ്. ഇത് ചില പ്രത്യേക സന്ദര്‍ഭങ്ങളിലേ ആവശ്യം വരികയുള്ളൂ.
nb: Dette tillegget inneholder informasjon om hvordan du kontrollerer at du faktisk kan installere eller oppgradere pakker på &oldreleasename; versjonen, før du oppgraderer til &releasename;. Dette er kun nødvendig i helt spesifikke situasjoner.
pt: Este apêndice contém informação sobre como ter a certeza que pode instalar e actualizar os pacotes da &oldreleasename; antes que actualize para a &releasename;. Deverá ser apenas necessário em situações específicas.
pt_br: Este apêndice contém informações sobre como assegurar-se de que você consegue instalar ou atualizar pacotes do &oldreleasename; antes de atualizar para o &releasename;. Isso só será necessário em situações específicas.
ro: Această anexă conține informații despre cum să vă asigurați că puteți instala sau actualiza pachete &oldreleasename; înainte de a actualiza la &releasename;. Acest lucru ar trebui să fie necesar doar în anumite situații.
ru: В этом приложении содержится информация о том, как перед обновлением до &releasename; удостовериться, что вы можете устанавливать или обновлять пакеты &oldreleasename;. Это может понадобиться в некоторых случаях.
sk: Táto príloha obsahuje informácie o tom, ako sa môžete uistiť, že dokážete inštalovať a aktualizovať balíky &oldreleasename; pred aktualizáciou na &releasename;. Malo by to byť potrebné iba v určitých situáciách.
sv: Denna bilaga innehåller information om hur du kontrollerar att du kan installera eller uppgradera paket från &oldreleasename; innan du uppgraderar till &releasename;. Det här bör endast vara nödvändigt i specifika situationer.
vi: Phụ lục này chứa thông tin về cách kiểm tra có thể cài đặt hoặc nâng cấp các gói &oldreleasename; trước khi nâng cấp lên &releasename;. Việc kiểm tra này chỉ nên làm trong một số trường hợp nào đó.
zh_tw: 這個附錄包含了在您升級至 &releasename; 之前，如何讓您能夠順利地安裝或更新 &oldreleasename; 套件的相關說明。這只有在某些特殊狀況之下才會有這個需求。

source: Upgrading your &oldreleasename; system
be: Абнаўленне сістэмы на базе &oldreleasename;
de: Upgrades in Ihrem &Oldreleasename;-System
fi: &oldreleasename;-järjestelmän päivitys
fr: Mettre à niveau votre système &Oldreleasename;
it: Aggiornare il proprio sistema &oldreleasename;
ja: &oldreleasename; システムのアップグレード
lt: Sistemos &oldreleasename; atnaujinimas
ml: നിങ്ങളുടെ പഴയ &oldreleasename; സിസ്റ്റത്തെ അപ്ഗ്രേഡ് ചെയ്യാന്‍
nb: Oppgradering av ditt &oldreleasename; system
pt: Actualizar o seu sistema &oldreleasename;
pt_br: Atualizando seu sistema &oldreleasename;
ro: Actualizarea sistemului &oldreleasename;
ru: Обновление системы &oldreleasename;
sk: Ako aktualizovať váš systém &oldreleasename;
sv: Uppgradering av ditt &oldreleasename;-system
vi: Nâng cấp hệ thống &oldreleasename;
zh_tw: 更新您的 &oldreleasename; 系統

source: Basically this is no different than any other upgrade of &oldreleasename; you've been doing. The only difference is that you first need to make sure your package list still contains references to &oldreleasename; as explained in <xref linkend="old-sources"/>.
be: Збольшага, абнаўленне не адрозніваецца ад іншых абнаўленняў, якія рабіліся з сістэмай на базе &oldreleasename;. Адзінае адрозненне ў тым, што найперш Вам варта пераканацца (паводле парадаў з <xref linkend="old-sources"/>), што спіс пакетаў дагэтуль утрымлівае спасыдкі на &oldreleasename;
de: Dem Grunde nach ist dies nichts anderes als jedes bisherige Upgrade in &Oldreleasename;. Der einzige Unterschied besteht darin, dass Sie zuerst sicherstellen müssen, dass Ihre Paketliste noch Referenzen aus &Oldreleasename; enthält, wie es in <xref linkend="old-sources"/> erklärt ist.
fi: Periaatteeltaan tämä ei eroa muista tekemistäsi julkaisun &oldreleasename; päivityksistä. Ainoa ero on että ensin on varmistuttava pakettiluettelon yhä viittaavan julkaisun &oldreleasename; paketteihin kuten selitetään kohdassa <xref linkend="old-sources"/>.
fr: Basiquement, cela n'est pas différent de toute autre mise à niveau de &Oldreleasename; que vous avez déjà faite. La seule différence est que vous devez tout d'abord vous assurer que votre liste de paquets contient toujours des références à &Oldreleasename; comme expliqué en <xref linkend="old-sources"/> .
it: In linea di principio non vi è alcuna differenza rispetto a qualsiasi altro aggiornamento effettuato in precedenza per &oldreleasename;. L'unica differenza è che dapprima sarà necessario accertarsi che il proprio elenco dei pacchetti contenga ancora i riferimenti a &oldreleasename; come illustrato in <xref linkend="old-sources"/>.
ja: 基本的には、これまで行ってきた &oldreleasename; のあらゆるアップグレードと違いはありません。唯一異なるのは、<xref linkend="old-sources"/>で説明するように、パッケージリスト内に &oldreleasename; への参照がまだ含まれているのを確認する必要があることです。
lt: Iš esmės šis atnaujinimas niekuo nesiskiria nuo kitų &oldreleasename; atnaujinimų, kuriuos jau darėte. Vienintelis skirtumas yra tai, kad pirmiausia turite įsitikinti, kad paketų sąrašas vis dar turi nuorodą į &oldreleasename; laidą, kaip tai paaiškinta <xref linkend="old-sources"/>.
ml: അടിസ്ഥാനപരമായി നിങ്ങള്‍ &oldreleasename; ല്‍ ചെയ്തുകൊണ്ടിരുന്ന മറ്റെല്ലാ നവീകരണങ്ങള്‍ പോലെ തന്നെയേ ഉള്ളൂ ഇതും. നിങ്ങളുടെ പായ്ക്കേജ് പട്ടികയ്ക്ക് <xref linkend="old-sources"/> ല്‍ വിശദീകരിച്ചിരിയ്ക്കുന്നത് പൊലെ &oldreleasename; ലേയ്ക്ക് പ്രതിപാധ്യങ്ങള്‍ ഉണ്ടെന്ന് ഉറപ്പു വരുത്തണം എന്ന് മാത്രം.
nb: Det er ingen større forskjeller i forhold til tidligere oppgraderinger du har gjort på &oldreleasename;. Den eneste forskjellen er at du nå må passe på at dine pakkearkiv refererer til &oldreleasename;, som beskrevet i <xref linkend="old-sources"/>.
pt_br: Basicamente, isso não é diferente de qualquer outra atualização do &oldreleasename; que você tenha feito. A única diferença é que você precisa ter certeza de que sua lista de pacotes ainda contém referências para o &oldreleasename; conforme explicado na <xref linkend="old-sources"/>.
ro: Practic aceasta nu este diferită de altă actualizare pe care ați efectuat-o pentru &oldreleasename;. Singura diferență este că trebuie să vă asigurați mai întâi că lista de pachete încă conține referințe către &oldreleasename;, după cum se explică în <xref linkend="old-sources"/>.
sk: V podstate sa to nelíši od bežnej aktualizácie &oldreleasename;, akú ste vykonávali doteraz. Jediný rozdiel je v tom, že sa musíte uistiť, že váš zoznam balíkov ešte stále obsahuje odkazy na &oldreleasename;, ako vysvetľuje <xref linkend="old-sources"/>.
sv: Det är inga grundläggande skillnader mot någon annan uppgradering av &oldreleasename; som du gjort. Den enda skillnaden är att du först behöver se till att din paketlista fortfarande innehåller paket från &oldreleasename;, vilket förklaras i <xref linkend="old-sources"/>.
vi: Về cơ bản thì việc này không phải khác với nâng cấp bình thường. Sự khác duy nhất là trước tiên người dùng nên kiểm tra danh sách các gói vẫn còn chứa tham chiếu đến &oldreleasename;, như diễn tả trong <xref linkend="old-sources"/>.
zh_tw: 基本上，這和您所進行過的 &oldreleasename; 的升級並沒有什麼不同。唯一的不同是您必須先確認您的套件列表是否還是指向 &oldreleasename;，請參考在 <xref linkend="old-sources"/> 裡的說明。

source: If you upgrade your system using a Debian mirror, it will automatically be upgraded to the latest &oldreleasename; point release.
be: Калі сістэма абнаўляецца праз люстэрка Debian, яно будзе аўтаматычна абноўленае да апошняй рэвізіі &oldreleasename;.
de: Falls Sie zum Upgrade Ihres Systems einen Debian-Spiegel nutzen, so erfolgt das Upgrade automatisch auf die neueste Zwischenveröffentlichung (sogenanntes Point-Release) von &Oldreleasename;.
fi: Jos päivität järjestelmän Debianin asennuspalvelinta käyttäen, se päivitetään automaattisesti viimeisimpään julkaisun &oldreleasename; korjauspäivitykseen.
fr: Si vous mettez votre système à niveau en utilisant un miroir Debian, il sera automatiquement mis à niveau vers la dernière version mineure de &Oldreleasename;.
it: Se si aggiorna il proprio sistema utilizzando un mirror Debian, esso sarà aggiornato automaticamente all'ultimo point release di &oldreleasename;.
ja: Debian ミラーを使用してシステムをアップグレードする場合、システムは自動的に最新の &oldreleasename; ポイントリリースへとアップグレードされます。
lt: Jei atnaujinate iš Debian'o serverio-veidrodžio, tai automatiškai bus atliktas atnaujinimas paskutiniosios &oldreleasename; laidos.
ml: ഒരു ഡെബിയന്‍ മിറര്‍ ഉപയോഗിച്ച് നിങ്ങള്‍ കയറുകയാണെങ്കില്‍, അതു് താനേ ഏറ്റവും പുതിയ &oldreleasename; പോയിന്റ് പതിപ്പിലേക്ക് പുതുക്കി കൊള്ളും.
nb: Hvis du benytter deg av et Debian speil, så vil du atomatisk bli oppgradert til den siste punktutgivelsen av &oldreleasename;.
pt: Se actualizar o seu sistema utilizando um mirror Debian, será automaticamente actualizado para a última versão da &oldreleasename;.
pt_br: Se você atualizar o seu sistema usando um espelho Debian, ele automaticamente atualizará para a última versão pontual do &oldreleasename;.
ro: Dacă actualizați sistemul dumneavoastră folosind un sit-oglindă Debian, atunci sistemul va fi actualizat automat la ultima versiune intermediară de &oldreleasename;.
ru: Если вы обновляете систему с сервера-зеркала Debian, то автоматически будет выполнено обновление до последнего выпуска &oldreleasename;.
sk: Ak aktualizujete svoj systém pomocou zrkadla Debianu, bude automaticky aktualizovaný na najnovšiu aktualizáciu stabilnej vetvy (point release) &oldreleasename;.
sv: Om du uppgraderar ditt system med en Debianspegel kommer den automatiskt att uppgraderas till den senaste punktutgåvan av &oldreleasename;.
vi: Nếu người dùng nâng cấp hệ thống dùng một máy nhân bản Debian thì hệ thống được tự động nâng cấp lên bản phát hành điểm &oldreleasename; mới nhất.
zh_tw: 如果您是使用 Debian 鏡像站來更新您的系統的話，它會自動得被更新至 &oldreleasename; 的最新釋出版。

source: Checking your sources list
be: Праверка спісу крыніц абнаўлення
de: Überprüfen Ihrer Paketquellen
fi: Asennuspalvelimien luettelon tarkistaminen
fr: Vérifier votre liste de sources
it: Controllare la propria lista delle fonti
ja: ソースリストのチェック
lt: APT šaltinių sąrašo tikrinimas
ml: നിങ്ങളുടെ സോഴ്സ് പട്ടിക പരിശോധിയ്ക്കുന്നതു്
nb: Kontroller dine arkivlister
pt: Verificar a sua lista de fontes
pt_br: Verificando sua lista de fontes (sources list)
ro: Verificarea listei de surse
ru: Проверка списка источников APT
sk: Ako skontrolovať váš zoznam zdrojov
sv: Kontrollera dina källistor
vi: Kiểm tra danh sách nguồn
zh_tw: 檢查您的來源列表

source: If any of the lines in your <filename>/etc/apt/sources.list</filename> refer to 'stable', you are effectively already <quote>using</quote> &releasename;. This might not be what you want if you are not ready yet for the upgrade. If you have already run <literal>apt-get update</literal>, you can still get back without problems following the procedure below.
de: Falls sich Zeilen in Ihrer Datei <filename>/etc/apt/sources.list</filename> auf <quote>stable</quote> beziehen, <quote>verwenden</quote> Sie effektiv schon &Releasename;. Dies ist möglicherweise nicht das, was Sie möchten, falls Sie noch nicht bereit für das Upgrade sind. Wenn Sie bereits <literal>apt-get update</literal> ausgeführt haben, können Sie ohne Probleme mit der unten aufgeführten Anweisung wieder auf den alten Zustand zurückkehren.
fr: Si l'une des lignes de votre <filename>/etc/apt/sources.list</filename> se réfère à « stable », c'est que vous <quote>utilisez</quote> déjà &Releasename;. Ce n'est pas forcément ce que vous voulez si vous n'êtes pas encore prêt pour la mise à niveau. Si vous avez déjà exécuté <literal>apt-get update</literal>, vous pouvez encore revenir en arrière sans problème en suivant la procédure ci-dessous.
it: Se qualsiasi riga nel proprio file <filename>/etc/apt/sources.list</filename> si riferisce a «stable», in effetti si sta già <quote>utilizzando</quote> &releasename;. Ciò potrebbe non essere quello che si vuole se non si è ancora pronti per l'avanzamento. Se si è già eseguito <literal>apt-get update</literal>, si può ancora tornare indietro senza problemi seguendo la procedura illustrata in seguito.
ja: <filename>/etc/apt/sources.list</filename> 内で 'stable' を指定している行があるなら、効率よく &releasename; を <quote>使う</quote> 用意ができています。もしアップグレードの準備がまだできていない場合には、これはお望みの設定ではないかもしれません。すでに <literal>apt-get update</literal> を実行済みでも、以下の手順に従えば問題なく元に戻すことができます。
pt_br: Se qualquer uma das linhas no seu arquivo <filename>/etc/apt/sources.list</filename> fizer referência a <quote>stable</quote>, você já está efetivamente <quote>usando</quote> o &releasename;. Isso pode não ser o que você quer se você não estiver pronto ainda para a atualização. Se você já executou <literal>apt-get update</literal>, você ainda pode voltar atrás sem problemas seguindo o procedimento abaixo.
ro: Dacă oricare dintre liniile din <filename>/etc/apt/sources.list</filename> se referă la 'stable', înseamnă că deja <quote>utilizați</quote> &releasename;. Poate nu doriți acest lucru dacă este totul pregătit pentru actualizare. Dacă ați rulat deja <literal>apt-get update</literal>, puteți încă da înapoi urmând procedurile de mai jos.
sk: Ak ktorýkoľvek z riadkov vo vašom <filename>/etc/apt/sources.list</filename> odkazuje na „stable“, už vlastne <quote>používate</quote> &releasename;. To nemusí byť to, čo ste mali v úmysle, ak zatiaľ nie ste na aktualizáciu pripravený. Ak ste už spustili <literal>apt-get update</literal>, ešte stále sa môžete vrátiť späť bez problémov pomocou nasledovnej procedúry.
sv: Om någon av raderna i din <filename>/etc/apt/sources.list</filename> refererar till <quote>stable</quote>, <quote>använder</quote> du redan &releasename;. Detta kanske inte är vad du vill göra om du inte är redo för uppgraderingen än. Om du redan har kört <literal>apt-get update</literal>, kan du fortfarande komma tillbaka utan problem om du följer nedanstående procedur.

source: If you have also already installed packages from &releasename;, there probably is not much point in installing packages from &oldreleasename; anymore. In that case you will have to decide for yourself whether you want to continue or not. It is possible to downgrade packages, but that is not covered here.
be: Калі Вы ўжо ўсталявалі пакеты з &releasename;, магчыма, больш няма сэнсу далей карыстацца пакетамі з &oldreleasename;. У гэтым выпадку Вам трэба вырашыць, ці варта працягваць працэс адкату. Зніжэнне версіі пакетаў магчымае, але яно не апісваецца ў гэтым дакуменце.
de: Falls Sie bereits Pakete aus &Releasename; installiert haben, ergibt es wahrscheinlich keinen Sinn mehr, Pakete aus &Oldreleasename; zu installieren. In diesem Fall müssen Sie selbst entscheiden, ob Sie fortfahren wollen oder nicht. Es besteht die Möglichkeit, zu alten Paketversionen zurückzukehren, dies wird hier aber nicht beschrieben.
fi: Jos julkaisusta &releasename; on jo asennettu paketteja, ei luultavasti ole järkeä asentaa enää paketteja julkaisusta &oldreleasename;. Tässä tapauksessa on tehtävä päätös jatketaanko vai ei. Pakettien palauttaminen vanhaan versioon on mahdollista, mutta sitä ei käsitellä tässä.
fr: Si vous avez déjà installé des paquets de &Releasename;, il n'y a probablement plus beaucoup d'intérêt à installer des paquets de &Oldreleasename;. Dans ce cas, vous devrez décider vous-même si vous voulez continuer ainsi ou non. Il est possible de revenir à des versions inférieures pour des paquets, mais cela n'est pas traité ici.
it: Se sono già stati installati pacchetti anche da &releasename;, probabilmente non ha più molto senso installare pacchetti da &oldreleasename;. In questo caso si dovrà decidere se si desidera continuare o meno. È possibile il <quote>downgrade</quote> dei pacchetti, ma non è un argomento trattato qui.
ja: &releasename; からパッケージのインストールもしてしまっているなら、おそらくこれ以上 &oldreleasename; からパッケージをインストールしても無意味でしょう。この場合、続けるかどうかを自分で決断しなければなりません。パッケージをダウングレードすることはできますが、その方法はここでは扱いません。
lt: Jei jau įdiegėte paketus iš &releasename;, tai nebėra daug prasmės įdiegti paketus iš &oldreleasename;. Tokiu atveju turite nuspręsti patys, ar norite tęsti, ar ne. Grįžti prie senų paketų naudojimo įmanoma, bet čia apie tai nekalbėsime.
ml: നിങ്ങള്‍ &releasename; യുടെ പൊതികള്‍ ഇന്‍സ്റ്റാള്‍ ചെയ്തിട്ടുണ്ടെങ്കില്‍, ഇനിയും &oldreleasename; ന്റെ പൊതികള്‍ ഇന്‍സ്റ്റാള്‍ ചെയ്യുന്നതിന്റെ ആവശ്യം വരുന്നില്ല. ഈ സന്ദര്‍ഭത്തില്‍ തുടരണോ വേണ്ടയോ എന്ന് നിങ്ങള്‍ തീരുമാനിയ്ക്കെണ്ടതാണ്. പൊതികളെ തരംതാഴ്ത്താവുന്നതാണ്, എന്നാല്‍ അതെപ്പറ്റി ഇവിടെ പരാമര്‍ശിയ്ക്കുന്നില്ല.
nb: Om du allerede har begynt å installere pakker fra &releasename;, så er det antakelig ingen grunn lenger til å installere pakker fra &oldreleasename;. Du må selv bestemme om du vil fortsette eller ikke. Det er mulig å nedgradere pakker, men det er ikke beskrevet her.
pt: Se já instalou pacotes da &releasename;, então provavelmente já não fará muito sentido a instalação de pacotes da &oldreleasename;. Neste caso terá que decidir se quer continuar ou não. É possível baixar de versão nos pacotes, mas este aspecto não é coberto aqui.
pt_br: Se você também já instalou pacotes do &releasename;, provavelmente não há razão para instalar pacotes do &oldreleasename;. Neste caso, você terá que decidir se quer continuar ou não. É possível rebaixar a versão (<quote>downgrade</quote>) dos pacotes, mas isso não é abordado neste documento.
ro: Dacă deja ați instalat pachete din &releasename;, probabil nu mai are rost să mai instalați pachete din &oldreleasename;. În acest caz va trebui să decideți dacă doriți să continuați sau nu. Este posibil să reveniți la versiuni anterioare ale pachetelor, însă acest subiect nu este acoperit aici.
ru: Если вы успели установить пакеты из &releasename;, то особого смысла в установке пакетов из &oldreleasename; уже нет. В этом случае вам следует решить &mdash; доводить до конца обновление или нет. Вернуться к использованию старых версий пакетов возможно, но эта процедура выходит за рамки данного документа.
sk: Ak ste už naviac nainštalovali balíky z &releasename;, už pravdepodobne nemá zmysel inštalovať balíky z &oldreleasename;. V tom prípade sa budete musieť sami rozhodnúť či chcete pokračovať alebo nie. Je možné znížiť verziu balíkov, ale to tento dokument nepopisuje.
sv: Om du även har installerat paket från &releasename;, är det antagligen inte så stor mening att installera paket från &oldreleasename; längre. I det fallet måste du bestämma dig för om du vill fortsätta eller inte. Det är möjligt att nedgradera paket, men det beskrivs inte här.
vi: Nếu người dùng cũng đã cài đặt gói từ &releasename;, rất có thể không có ích khi cài đặt thêm gói từ &oldreleasename;. Trong trường hợp đó, người dùng cần phải tự quyết định có nên tiếp tục hay không. Cũng có thể hạ cấp gói, nhưng quá trình đó không phải được diễn tả ở đây.
zh_tw: 如果您已經安裝了來自 &releasename; 的套件，那麼再安裝來自 &oldreleasename; 的套件就已經沒有太多意義了。在此狀況之下，您應該要自行決定是否要繼續進行。進行套件的降級並不是不可能的事，但是在此並沒有針對這個加以說明。
