Repository: lurdan/trans-ddp
Catalog: release-notes/*/old-stuff.po
Languages: be, de, fi, fr, it, ja, lt, ml, nb, pt, pt_br, ro, ru, sk, sv, vi, zh_tw

source: In the GNOME screensaver using passwords with non-ASCII characters, pam_ldap support, or even the ability to unlock the screen is unreliable when not using UTF8. The GNOME screenreader is affected by bug <ulink url="http://bugs.debian.org/599197">#599197</ulink>. The Nautilus file manager (and all glib-based programs, and likely all Qt-based programs too) assume that filenames are in UTF-8, while the shell assumes they are in the current locale’s encoding. In daily use, non-ASCII filenames are just unusable in such setups. Furthermore, the gnome-orca screen reader (which grants sight-impaired users access to the GNOME desktop environment) requires a UTF-8 locale since Squeeze; under a legacy characterset, it will be unable to read out window information for desktop elements such as Nautilus/GNOME Panel or the Alt-F1 menu.
de: Wenn bei dem GNOME-Bildschirmschoner Passwörter mit Nicht-ASCII-Zeichen verwendet werden, ist die Unterstützung für pam_ldap oder sogar die Funktionalität zur Entsperrung des Bildschirms unzuverlässig, wenn UTF-8 nicht genutzt wird. Der GNOME-Bildschirmschoner ist von dem Fehler <ulink url="http://bugs.debian.org/599197">#599197</ulink> betroffen. Der Nautilus-Dateimanager (und alle glib-basierten Programme) sowie höchstwahrscheinlich auch alle Qt-basierten Programme gehen davon aus, dass Dateinamen in UTF-8 kodiert sind, während die Shell voraussetzt, dass sie in der Kodierung der aktuellen Locale kodiert sind. Für die alltägliche Arbeit sind Nicht-ASCII-Dateinamen in solchen Umgebungen nicht nutzbar. Desweiteren erfordert der gnome-orca-Screenreader (der sehbehinderten Benutzern Zugriff auf die GNOME-Desktop-Umgebung erlaubt) seit Squeeze eine UTF-8-Locale; bei Nutzung einer Legacy-Zeichenbelegung wird es gnome-orca nicht möglich sein, Fensterinformationen für Desktop-Elemente wie die Nautilus-/GNOME-Leiste oder das Alt-F1-Menü auszulesen.
ja: UTF-8 を使っていない場合には、GNOME スクリーンセーバーでスクリーンロックを解除する機能を有効にしていても、以下のような設定では動作が保証されません: ASCII 文字列以外のパスワードを利用している、pam_ldap サポートを有効にしている。GNOME スクリーンリーダーは、バグ<ulink url="http://bugs.debian.org/599197">#599197</ulink> の影響を受けます。shell が現在のロケールでのエンコーディングであると仮定しているにも関わらず、Nautilus ファイルマネージャー (そして全ての glib ベースのプログラム、加えておそらく全ての Qt ベースのプログラム) は、ファイル名を UTF-8 として取扱います。さらに gnome-orca スクリーンリーダーは、Squeeze から UTF-8 ロケールを必要としています。レガシーな文字コードセット使用下では、Nautilus/GNOME パネルあるいは Alt-F1 メニューのようなウィンドウ情報を読み取ることができません。
pt_br: Utilizar senhas com caracteres não-ASCII no protetor de tela do GNOME, suporte pam_ldap, ou até mesmo a capacidade de desbloquear a tela não é confiável quando não estiver usando UTF-8. O leitor de tela do GNOME é afetado pelo bug <ulink url="http://bugs.debian.org/599197">#599197</ulink>. O gerenciador de arquivos Nautilus (e todos os programas baseados na glib, e provavelmente também todos os programas baseados na Qt) assume que os nomes de arquivos estão em UTF-8, enquanto o shell assume que eles estão na codificação atual do <quote>locale</quote>. No uso diário, nomes de arquivo não-ASCII são simplesmente inutilizáveis em tais configurações. Além disso, o leitor de tela gnome-orca (o qual permite que usuários com deficiência visual acessem o ambiente de trabalho GNOME) requer um locale UTF-8 desde o Squeeze; sob um conjunto de caracteres obsoleto, ele será incapaz de ler a informação da tela para elementos do ambiente de trabalho, tais como o Nautilus/Painel do GNOME ou o menu Alt-F1.

source: If your system is localised and is using a locale that is not based on UTF-8 you should strongly consider switching your system over to using UTF-8 locales. In the past, there have been bugs<placeholder type="footnote" id="0"/> identified that manifest itself only when using a non-UTF-8 locale. On the desktop, such legacy locales are supported through ugly hacks in the libraries internals, and we cannot decently provide support for users who still use them.
de: Wenn Ihr System lokalisiert ist und eine Locale verwendet, die nicht auf UTF-8 basiert, sollten Sie dringend in Erwägung ziehen, Ihr System auf die Verwendung von UTF-8-Locales umzustellen. In der Vergangenheit wurden Fehler <placeholder type="footnote" id="0"/>identifiziert, die nur bei Nutzung einer nicht-UTF-8-Locale in Erscheinung treten. Auf dem Desktop werden solche veralteten Locales nur durch böse Hacks in den Bibliotheksinternas unterstützt, und wir können Benutzern, die sie immer noch verwenden, keine vernünftige Unterstützung anbieten.
ja: システムがローカライズされており、UTF-8 ベースではないロケールを使っている場合、システムが UTF-8 を使うように変更するのをよく考えるべきです。過去、UTF-8 ではないロケールを使っている場合のみ明らかになるバグ<placeholder type="footnote" id="0"/>がありました。デスクトップでは、このようなレガシーなロケールはライブラリ内部での醜いハックによってサポートされているので、まだレガシーロケールを使ってるユーザに対してきちんとしたサポートを提供できません。
pt_br: Se o seu sistema está localizado e usando um locale que não é baseado em UTF-8 você deve fortemente considerar a mudança do seu sistema para utilizar locales do tipo UTF-8. No passado, existiram bugs<placeholder type="footnote" id="0"/> identificados que só se manifestavam ao utilizar um locale não-UTF-8. No ambiente de trabalho, tais locales obsoletos são suportados através de truques feitos no interior das bibliotecas, e nós não podemos prestar um bom suporte aos usuários que ainda os utilizem.

source: To configure your system's locale you can run <command>dpkg-reconfigure locales</command>. Ensure you select an UTF-8 locale when you are presented with the question asking which locale to use as a default in the system. In addition, you should review the locale settings of your users and ensure that they do not have legacy locales definitions in their configuration environment.
de: Um die Locale Ihres Systems zu konfigurieren, können Sie <command>dpkg-reconfigure locales</command> ausführen. Wenn Ihnen die Frage gestellt wird, welche Locale Sie als Standard in Ihrem System verwenden möchten, wählen Sie unbedingt eine UTF-8-Locale aus. Zusätzlich sollten Sie die eingestellten Locales Ihrer Systemnutzer kontrollieren und sicherstellen, dass diese keine veralteten Locale-Definitionen in ihren Konfigurationsumgebungen haben.
fr: Pour configurer les locales de votre système, vous pouvez exécuter la commande <command>dpkg-reconfigure locales</command>. Sélectionnez une locale UTF-8 lors du choix du jeu de paramètres régionaux actif par défaut pour le système. De plus, vous devriez examiner les locales des utilisateurs et vous assurer que la configuration de leur environnement n'active pas une ancienne locale.
it: È possibile usare <command>dpkg-reconfigure locales</command> per configurare il locale del proprio sistema. Quando viene chiesto quale locale usare come locale predefinito scegliere un locale UTF-8. Inoltre, è opportuno verificare le impostazioni di locale dei propri utenti per assicurarsi che nessuno utilizzi dei locale obsoleti nella configurazione d'ambiente.
ja: <command>dpkg-reconfigure locales</command>を実行すれば、システムのロケールを設定できます。どのロケールをシステムのデフォルトとして使うかの質問を提示された時、確実に UTF-8 ロケールを選んでください。さらに、ロケールを再度調査して、ユーザの環境設定中でレガシーなロケール定義がされていないことを確認する必要があります。
pt_br: Para configurar os locales do seu sistema você pode executar <command>dpkg-reconfigure locales</command>. Certifique-se de selecionar um locale UTF-8 quando for perguntado sobre qual locale utilizar por padrão no sistema. Além disso, você deve rever as configurações de locales dos seus usuários e garantir que eles não tenham definições obsoletas em seus ambientes de configuração.
ro: Pentru a configura localizarea sistemului puteți rula comanda <command>dpkg-reconfigure locales</command>. Asigurați-vă că alegeți o localizare UTF-8 atunci când vă este prezentată întrebarea despre localizarea implicită a sistemului (n.tr.: pentru limba română localizarea corectă este „ro_RO.UTF-8”). Suplimentar ar trebui să verificați setările de localizare a utilizatorilor de pe sistemul dumneavoastră ca să vă asigurați că nu este definită o localizare învechită în configurația lor.
sk: Locale svojho systému môžete nastaviť spustením <command>dpkg-reconfigure locales</command>. Uistite sa, že ste zvolili UTF-8 locale, pri výbere predvoleného locale systému. Okrem toho by ste mali skontrolovať nastavenia locale svojich používateľov a ubezpečiť sa, že vo svojej konfigurácii nepoužívajú staré locales.
sv: För att välja systemets lokalinställningar kan du köra <command>dpkg-reconfigure locales</command>. Säkerställ att du väljer en UTF-8-baserad lokalisering när frågan om vilken lokalinställning som ska användas som standard i systemet visas. Utöver detta bör du kontrollera dina användares lokalinställningar för att säkerställa att de inte har äldre lokaldefinitioner i sina användarmiljöer.

source: Basically this is no different from any other upgrade of &oldreleasename; you've been doing. The only difference is that you first need to make sure your package list still contains references to &oldreleasename; as explained in <xref linkend="old-sources"/>.
pt: Basicamente isto não é diferente de qualquer outra actualização de &oldreleasename; que tem vindo a fazer. A única diferença é que primeiro tem de se certificar que a sua lista de pacotes ainda contém referências a &oldreleasename; conforme é explicado em <xref linkend="old-sources"/>.
ru: В основном, это обновление ничем не отличается от всех предыдущих обновлений &oldreleasename;, которые вы делали. Единственное отличие состоит в том, что сначала надо убедиться, что ваши списки пакетов всё ещё содержат ссылки на пакеты &oldreleasename;, как описано в <xref linkend="old-sources"/>.

source: If any of the lines in your <filename>/etc/apt/sources.list</filename> refer to 'stable', you are effectively already <quote>using</quote> &releasename;. This might not be what you want if you are not ready yet for the upgrade. If you have already run <literal>apt-get update</literal>, you can still get back without problems by following the procedure below.
pt: Se alguma das linhas do seu <filename>/etc/apt/sources.list</filename> se refere a 'stable', já está efectivamente a <quote>utilizar</quote> &releasename;. Isto pode não ser o que deseja se ainda não estiver pronto para a actualização. Se já correu <literal>apt-get update</literal>, pode ainda voltar atrás sem quaisquer problemas seguindo o procedimento indicado abaixo.
ru: Если в одной или нескольких строках в вашем <filename>/etc/apt/sources.list</filename> есть ссылка на стабильный дистрибутив (stable), то вы уже <quote>используете</quote> &releasename;. Это может быть не то, что вы хотите, если вы пока не готовы к обновлению. Если вы уже запустили <literal>apt-get update</literal>, то ещё не поздно всё отменить, просто выполнив инструкцию, приведённую ниже.

source: In the GNOME screensaver, using passwords with non-ASCII characters, pam_ldap support, or even the ability to unlock the screen may be unreliable when not using UTF-8. The GNOME screenreader is affected by bug <ulink url="http://bugs.debian.org/599197">#599197</ulink>. The Nautilus file manager (and all glib-based programs, and likely all Qt-based programs too) assume that filenames are in UTF-8, while the shell assumes they are in the current locale’s encoding. In daily use, non-ASCII filenames are just unusable in such setups. Furthermore, the gnome-orca screen reader (which grants sight-impaired users access to the GNOME desktop environment) requires a UTF-8 locale since Squeeze; under a legacy characterset, it will be unable to read out window information for desktop elements such as Nautilus/GNOME Panel or the Alt-F1 menu.
pt: Na protecção de ecrã do GNOME, utilizar palavras-passe com caracteres que não sejam ASCII, no suporte pam_ldap, a habilidade de desbloquear o ecrã não é fiável quando não for utilizado UTF-8. A protecção de ecrã do GNOME é afectada pelo bug <ulink url="http://bugs.debian.org/599197">#599197</ulink>. O gestor de ficheiros Nautilus (e todos os programas baseados em glib, e provavelmente também todos os programas baseados em Qt) assumem que os nomes de ficheiros estão em UTF-8, enquanto que a shell assume que estão na codificação do locale actual. No uso diário, os nomes de ficheiros não-ASCII não são utilizáveis nessa configuração. Além disso, o leitor de ecrã gnome-orca (que permite aos utilizadores com dificuldades de visão acederem ao ambiente de trabalho GNOME) desde o lançamento do Squeeze necessita de locale UTF-8; sob um conjunto de caracteres antigo, não será possível ler a informação da janela para elementos do desktop tais como o painel do Nautilus/GNOME ou do menu Alt-F1.
ru: Хранитель экрана GNOME при использовании паролей с не-ASCII символами, поддержка pam_ldap или даже возможность разблокировать экран работают ненадёжно, если не используется UTF8. Программа чтения с экрана GNOME содержит ошибку <ulink url="http://bugs.debian.org/599197">#599197</ulink>. Файловый менеджер Nautilus (и все программы на основе glib, и, вероятно, также все программы на Qt) предлагают, что имена файлов хранятся в UTF-8, хотя оболочка предполагает, что для этого используется кодировка текущей локали. При повседневном использовании с именами файлов не-ASCII просто невозможно работать. Кроме того, для программы чтения с экрана gnome-orca (которая позволяет работать с окружением рабочего стола GNOME незрячим пользователям) требуется локаль UTF-8 начиная с Squeeze; при использовании устаревшего набора символов невозможно прочитать информацию из окна для элементов рабочего стола, таких как Nautilus/GNOME Panel или меню Alt-F1.

source: If your system is localized and is using a locale that is not based on UTF-8 you should strongly consider switching your system over to using UTF-8 locales. In the past, there have been bugs<placeholder type="footnote" id="0"/> identified that manifest themselves only when using a non-UTF-8 locale. On the desktop, such legacy locales are supported through ugly hacks in the library internals, and we cannot decently provide support for users who still use them.
pt: Se o seu sistema estiver localizado e estiver a utilizar um locale que não seja baseado em UTF-8 deve considerar fortemente em mudar o seu sistema para passar a utilizar locales UTF-8. No passado, existiram bugs identificados<placeholder type="footnote" id="0"/> que só se manifestavam ao utilizar num locale não-UTF-8. No desktop, tais locales antigos são suportados através de truques feios no interior das bibliotecas, e nós não podemos prestar um suporte capaz a utilizadores que ainda os utilizam.
ru: Если вы работаете с локализованной версией системы и используемая локаль основана не на UTF-8, то настоятельно советуем задействовать в системе локаль с UTF-8. В прошлом были ошибки<placeholder type="footnote" id="0"/>, которые проявляются только, когда используется локаль не-UTF-8. Работа приложений для рабочего стола с этими устаревшими локалями поддерживается специфическими внутренними механизмами библиотек, и мы больше не можем предоставить полную поддержку пользователям, которые продолжают их использовать.

source: To configure your system's locale you can run <command>dpkg-reconfigure locales</command>. Ensure you select a UTF-8 locale when you are presented with the question asking which locale to use as a default in the system. In addition, you should review the locale settings of your users and ensure that they do not have legacy locale definitions in their configuration environment.
pt: Para configurar os locales do seu sistema pode correr <command>dpkg-reconfigure locales</command>. Assegure-se que escolhe um locale UTF-8 quando lhe for apresentada a questão acerca de qual locale utilizar no sistema. Além disso, deve rever as definições do locale dos seus utilizadores e assegure-se que não têm definições antigas de locales no seu ambiente de configuração.
ru: Для настройки локали в системе запустите <command>dpkg-reconfigure locales</command>. Выберите локаль с UTF-8, когда будет задан вопрос о системной локали по умолчанию. Также, посмотрите настройки локали пользователей и убедитесь, что в их окружении не включены старые локали.

source: If your system is localised and is using a locale that is not based on UTF-8 you should strongly consider switching your system over to using UTF-8 locales. In the past, there have been bugs identified that manifest itself only when using a non-UTF-8 locale. On the desktop, such legacy locales are supported through ugly hacks in the libraries internals, and we cannot decently provide support for users who still use them.
fr: Si votre système utilise une locale qui n'est pas basée sur UTF-8, nous vous recommandons fortement de choisir une locale UTF-8. Par le passé, certains bogues ne se manifestaient que sur des systèmes n'utilisant pas les locales basées sur UTF-8. De vilaines rustines dans les bibliothèques internes permettent d'utiliser ces anciennes locales, mais il ne sera plus possible à terme de les gérer correctement.
ro: Dacă sistemul dumneavoastră este localizat folosind o localizare care nu este bazată pe UTF-8 este important să configurați sistemul să folosească UTF-8. În trecut au fost raportate probleme care se manifestă doar atunci când se folosește o localizare non-UTF-8. Pe un sistem de birou, asemenea localizări sunt suportate doar prin niște improvizații urâte în bibliotecile de sistem și nu putem oferi suport decent pentru utilizatorii care încă le mai folosesc.
sk: Ak je váš systém lokalizovaný a používa locale, ktoré nie je založené na UTF-8, mali by ste silne zvážiť zmenu locales vášho systému na UTF-8. V minulosti boli identifikované chyby, ktoré sa prejavujú iba pri locale, ktoré nie sú založené na UTF-8. Na systéme s pracovným prostredím sú takéto staré locales podporované iba škaredými kľučkami vnútri knižníc a nedokážeme kvalitne podporovať používateľov, ktorí ich ešte používajú.

source: Managing your &oldreleasename; system
fi: &oldreleasename;-järjestelmän hallinnointi
nb: Forberedelser for oppgradering av et &oldreleasename; system
zh_tw: 管理您的 &oldreleasename; 系統

source: If any of the lines in your <filename>/etc/apt/sources.list</filename> refer to 'stable', you are effectively already <quote>using</quote> &releasename;. If you have already run <literal>apt-get update</literal>, you can still get back without problems following the procedure below.
fi: Jos tiedostossa <filename>/etc/apt/sources.list</filename> on rivejä jotka viittaavat jakeluun "stable", on julkaisu &releasename; käytännössä jo käytössä. Jos komento <literal>apt-get update</literal> on jo suoritettu, voidaan palata vanhaan tilanteeseen vaivattomasti seuraavassa selitettävällä tavalla.
nb: Hvis noen av linjene i <filename>/etc/apt/sources.list</filename> refererer til 'stable', så bruker du i praksis <quote>allerede</quote> &releasename;. Hvis du allerede har brukt <literal>apt-get update</literal> så kan du fortsatt rette det opp igjen uten problemer om du følger oppskriften som kommer her.
zh_tw: 如果在您的 <filename>/etc/apt/sources.list</filename> 中有任何的項目是參照至 'stable' 的話，您可能在實際上已經在<quote>使用</quote> &releasename; 了。如果您已執行了 <literal>apt-get update</literal> 的話，您還是可以輕易得回到原始的狀態，只要您遵照以下的指示即可。
