Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: The upgrade has a few preconditions; you should check them before actually executing the upgrade.
ja: アップグレードにあたって事前に整えなければならない条件がいくつかあります。実際にアップグレードを実行する前にそれらを確認してください。
pt: Esta actualização possui poucas condições prévias, deverá verificá-las antes de iniciar a actualização.
ru: Для обновления есть несколько предварительных условий; прежде чем приступать к обновлению, вы должны проверить, что они соблюдаются.
sv: Uppgraderingen innebär att vissa förutsättningar måste mötas; du bör kontrollera dem innan den faktiska uppgraderingen påbörjas.
zh_cn: 升级有其必要条件，您应该在实地进行升级之前先行确认一次。

source: Make sure you have sufficient space for the upgrade
ja: アップグレードするのに十分な領域があることを確認する
pt: Certifique-se que possui espaço suficiente para a actualização
ru: Убедитесь, что у вас достаточно места для обновления
sv: Se till att du har tillräckligt med utrymme för uppgraderingen
zh_cn: 确认您有足够的空间可以用来进行升级

source: You have to make sure before upgrading your system that you have sufficient hard disk space when you start the full system upgrade described in <ref id="upgrading_other">. You will first need enough hard disk on the filesystem partition that holds <file>/var/</file> to temporarily download the packages that will be installed in your system. After the download, you will probably need more space in other filesystem partitions in order to both install upgraded packages (which might contain bigger binaries or more data) and new packages that will be pulled in for the upgrade. If your system does not have sufficient space you might end up with an incomplete upgrade that might be difficult to recover from.
ja: システムアップグレードの前には、<ref id="upgrading_other"> で説明するシステム全体のアップグレードを開始するときに十分なハードディスク領域があるかどうかを確認しなければいけません。まず、システムにインストールされるパッケージをダウンロードして一時的に保存するのに、<file>/var/</file> を保持しているファイルシステムパーティションに十分なハードディスクが必要になります。ダウンロード後にはおそらく、アップグレードされるパッケージ (これらには、より大きなバイナリやより多くのデータが含まれている可能性があります。) と、アップグレードに伴って依存関係に引きずられて新たに導入されるパッケージの両方のインストールのために、他のファイルシステムパーティションにさらに領域が必要になるでしょう。システムに十分な空き領域がない場合、アップグレードが不完全な状態で終わり、復旧が困難になる可能性があります。
pt: Terá que se certificar que possui suficiente espaço em disco antes de actualizar completamente a sua versão como descrito em <ref id="upgrading_other">. Necessitará primeiro de suficiente espaço em disco na partição que albergará <file>/var/</file> para descarregar temporariamente os pacotes que serão instalados no seu sistema. Depois de os descarregar, necessitará provavelmente de mais espaço noutras partições de modo a instalar esses pacotes anteriormente descarregados (que podem conter binários de grande dimensão), e novos pacotes que serão obtidos na actualização. Se o seu sistema não possui suficiente espaço pode acabar com uma actualização incompleta de recuperação difícil.
ru: Перед обновлением всей системы, как описано в <ref id="upgrading_other">, вы должны убедиться, что у вас достаточно места на диске. Сначала потребуется место на разделе, который содержит <file>/var/</file>, так как туда будут записываться загружаемые пакеты для установки. После загрузки вам, вероятно, понадобится больше места в файловой системе других разделов для того, чтобы можно было установить обновляемые пакеты (которые могут содержать больше данных) и новые пакеты, которые будут установлены из-за обновлений. Если в системе не будет достаточного места, то в конечном счёте это приведёт к неполному обновлению, что позднее бывает сложно исправить.
sv: Du måste kontrollera att ditt system har tillräckligt mycket ledigt diskutrymme innan du påbörjar en fullständig systemuppgradering, som beskrivs i <ref id="upgrading_other">. Du behöver först tillräckligt med utrymme på den filsystemspartition som innehåller <file>/var/</file> för att temporärt lagra hämtade paket som kommer att installeras på ditt system. Efter hämtningen kommer du antagligen behöver mer utrymme på de andra partitionerna för att både installera de uppgraderade paketen (som kan innehålla större binärfiler eller mer data) och nya paket som kommer att inkluderas i uppgraderingen. Om ditt system inte har tillräckligt med utrymme kan det resultera i en ofullständig uppgradering som kan vara svår att rätta till.
zh_cn: 在进行系统升级之前，您必须确认在您开始进行 <ref id="upgrading_other"> 上写的全系统升级之时，您的系统有着足够的硬盘空间。首先，在包含了 <file>/var/</file> 的文件系统分区里必须拥有足够的硬盘空间以容纳那些将会安装到您的系统上而暂时下载的软件包。在下载完成之后，在其它的文件系统分区里您应该会需要更多的空间以用来安装升级软件包（它们很可能会包含需要更大空间的档案及资料）以及在升级过程中会一并安装的新软件包。如果您的系统并没有足够的空间，您可能在最后得到的是一个未完全升级却又难以还原的系统。

source: Both <prgn>aptitude</prgn> and <prgn>apt</prgn> will show you detailed information of the disk space needed for the installation. Before executing the upgrade, you can see this estimate by running:
ja: <prgn>aptitude</prgn> と <prgn>apt</prgn> のどちらを使っても、インストールに必要なディスク領域の詳細な情報が表示されます。アップグレードを実行する前に、次のように実行して必要な領域の推定値を見ることができます。
pt: Ambos o <prgn>aptitude</prgn> e o <prgn>apt</prgn> irão mostrar informação detalhada sobre o espaço em disco necessário para a instalação. Antes de efectuar a actualização do sistema, pode ver esta estimativa, correndo:
ru: И <prgn>aptitude</prgn>, и <prgn>apt</prgn> отображают подробную информацию о количестве требуемого места для установки. Перед выполнением обновления вы можете увидеть размер необходимого места, запустив:
zh_cn: <prgn>aptitude</prgn> 及 <prgn>apt</prgn> 都会替您显示在安装时所需的硬盘空间之详尽信息。在进行升级之前，您可以得到这些估算值。请执行：

source: # aptitude -y -s -f --with-recommends dist-upgrade [ ... ] XXX upgraded, XXX newly installed, XXX to remove and XXX not upgraded. Need to get xx.xMB/yyyMB of archives. After unpacking AAAMB will be used. Would download/install/remove packages.
ja: # aptitude -y -s -f --with-recommends dist-upgrade [ ... ] 更新: XXX 個、新規インストール: XXX 個、削除: XXX 個、保留: XXX 個。 yyyMB 中 xx.xMB のアーカイブを取得する必要があります。展開後に追加で AAAMB のディスク容量が消費されます。 パッケージのインストールまたは削除。
pt: # aptitude -y -s -f --with-recommends dist-upgrade [ ... ] XXX actualizados, XXX novos instalados , XXX a remover e XXX não actualizados. Necessário obter xx.xMB/yyyMB de arquivos. Depois da descompressão AAAMB serão usados. Serão descarregados/instalados/removidos pacotes.
ru: # aptitude -y -s -f --with-recommends dist-upgrade [ ... ] XXX пакетов обновлено, XXX установлено новых, XXX пакетов отмечено для удаления и XXX пакетов не обновлено. Необходимо получить xx.xMB/yyyMB архивов. После распаковки будет использовано AAAMB. Будет выполнена загрузка/установка/удаление пакетов.
sv: # aptitude -y -s -f --with-recommends dist-upgrade [ ... ] XXX paket uppgraderade, XXX nyinstallerade. XXX att ta bort och XXX inte uppgraderade.Behöver hämta xx,xMB/yyyMB arkiv. Efter uppackning kommer AAAMB diskplats att användas.Kommer att hämta/installera/ta bort paket.
zh_cn: # aptitude -y -s -f --with-recommends dist-upgrade [ ... ] 更新了 XXX、新安装了 XXX、要移除 XXX 而 XXX 将不会被升级。 必须下载 xx.xMB/yyyMB 的档案。在解压缩之后将会用掉 AAAMB。 将会进行 下载/安装/移除 软件包。

source: If you do not have enough space for the upgrade, make sure you free up space beforehand. You can:
ja: アップグレードをするのに十分な領域がない場合、事前に領域を解放するのを忘れないようにしてください。以下のことを実行するとよいでしょう。
pt: Se não tiver espaço suficiente para a actualização, certifique-se que liberta suficiente espaço antes da mesma. Poderá:
ru: Если вам не хватает места для обновления, убедитесь, что вы освободили место заранее. Вы можете:
sv: Om du inte har tillräckligt med utrymme kan du se till att frigöra utrymme innan uppgraderingen. Du kan till exempel:
zh_cn: 如果您没有足够的空间可供升级，请在事先就清出硬盘空间。您可以：

source: Remove packages that have been previously downloaded for installation (at <file>/var/cache/apt/archive</file>), cleaning up the package cache by running <prgn>apt-get clean</prgn>.
ja: <prgn>apt-get clean</prgn> を実行してパッケージキャッシュを掃除し、インストールするために以前 (<file>/var/cache/apt/archive</file> に) ダウンロードしたパッケージを削除する。
pt: Remover pacotes que tenham sido previamente descarregados para a instalação (em <file>/var/cache/apt/archive</file>), limpando a 'cache' correndo <prgn>apt-get clean</prgn>.
ru: Удалить пакеты, которые были ранее загружены для установки (из каталога <file>/var/cache/apt/archive</file>), очистив кэш пакетов, запустив <prgn>apt-get clean</prgn>.
sv: Ta bort paket som tidigare har hämtats ner för installation (i <file>/var/cache/apt/archive</file>), rensa upp paketcachen genom att köra <prgn>apt-get clean</prgn>.
zh_cn: 移除那些之前为了用来安装而下载至 <file>/var/cache/apt/archive</file> 的软件包。执行 <prgn>apt-get clean</prgn> 来清除软件包的缓存。

source: Remove old packages you no longer use. If you have <prgn>popularity-contest</prgn> installed, you can use <prgn>popcon-largest-unused</prgn> to list the packages you do not use in the system that occupy the most space. You can also use <prgn>deborphan</prgn> or <prgn>debfoster</prgn> to find obsolete packages (see <ref id="obsolete">).
ja: もう使用しない古いパッケージを削除する。<prgn>popularity-contest</prgn> をインストールしていれば、<prgn>popcon-largest-unused</prgn> を使って、システムで使用していなく最も大きな領域を占めているパッケージをリストアップできます。<prgn>deborphan</prgn> や <prgn>debfoster</prgn> を使って時代遅れのパッケージを見つけることも可能です (<ref id="obsolete"> を参照してください)。
pt: Remova pacotes antigo sem uso. Se tiver instalado o <prgn>popularity-contest</prgn> pode utilizar <prgn>popcon-largest-unused</prgn> para listar os pacotes que não estão já em uso e que ocupam espaço no sistema. Pode também utilizar <prgn>deborphan</prgn> ou <prgn>debfoster</prgn> para procurar pacotes obsoletos (veja <ref id="obsolete">).
ru: Удалить старые пакеты, которые больше не используются. Если у вас установлена программа <prgn>popularity-contest</prgn>, то с помощью <prgn>popcon-largest-unused</prgn> можно получить список пакетов, которые вы не используете в системе и которые занимают много места. Также вы можете использовать <prgn>deborphan</prgn> или <prgn>debfoster</prgn>, чтобы найти устаревшие пакеты (смотрите <ref id="obsolete">).
zh_cn: 移除那些您再也用不着的软件包。如果您安装了 <prgn>popularity-contest</prgn>，您可以使用 <prgn>popcon-largest-unused</prgn> 来列出那些在系统里占有空间但您并用不着的软件包。您也可以利用 <prgn>deborphan</prgn> 或 <prgn>debfoster</prgn> 来找出孤儿软件包。（请参阅：<ref id="obsolete">）。

source: Remove packages taking up too much space, which are not currently needed (you can always reinstall them after the upgrade). You can list the packages that take up most of the disk space with <prgn>dpigs</prgn> (available in the <package>debian-goodies</package> package) or with <prgn>wajig</prgn> (running <tt>wajig size</tt>).
ja: あまりにも大きな領域を占めており現在は必要ないパッケージを削除する (アップグレード後にいつでも再インストール可能なのですから)。<prgn>dpigs</prgn> (<package>debian-goodies</package> パッケージに含まれています。) や <prgn>wajig</prgn> (<tt>wajig size</tt> を実行してください。) を用いると、ディスク領域の大部分を占めているパッケージをリストアップできます。
pt: Remova pacotes que estejam a ocupar demasiado espaço, e que não estejam a ser necessários (pode sempre reinstalá-los depois da actualização). Pode listar os pacotes que ocupam o maior espaço em disco com <prgn>dpigs</prgn> (disponível no pacote <package>debian-goodies</package> ou com <prgn>wajig</prgn> (correndo <tt>wajig size</tt>).
ru: Удалить пакеты, которые занимают слишком много места, и в которых нет срочной необходимости (вы всегда можете переустановить их после обновления). Список пакетов, которые занимают большую часть дискового пространства, можно получить с помощью программы <prgn>dpigs</prgn> (из пакета <prgn>debian-goodies</prgn>) или <prgn>wajig</prgn> (запустив <prgn>wajig size</prgn>).
zh_cn: 移除占用了太多空间但目前尚用不着的软件包。（您可以在升级后再把它们重新安装回来）。您可以利用 <prgn>dpigs</prgn>（包含于 <package>debian-goodies</package> 之中）或 <prgn>wajig</prgn>（执行 <tt>wajig size</tt>）来列出占用最多硬盘空间的软件包。

source: Temporarily move to another system, or permanently remove, system logs residing under <file>/var/log/</file>.
ja: <file>/var/log/</file> の下にあるシステムログを一時的に他のシステムに移動するか、永久に削除する。
pt: Mova temporariamente para outro sistema, ou remova permanentemente, os relatórios de sistema residentes em <file>/var/log/</file>.
ru: Временно перенести на другую машину или удалить системные журналы из <file>/var/log/</file>.
sv: Flytta systemloggar från <file>/var/log/</file> till ett annat system, eller ta bort permanent.
zh_cn: 把存放在 <file>/var/log/</file> 里的系统记录文件暂时移至其它的系统，或是干脆删除它们。

source: Support for 2.2-kernels has been dropped
ja: 2.2 系カーネルはサポートされなくなりました
pt: O suporte para 2.2-kernels foi abandonado
ru: Поддержка ядер версий 2.2 прекращена
sv: Stöd för 2.2-kärnor har uteslutits
zh_cn: 已不再支持 2.2 系列的内核

source: In case you run a kernel prior to 2.4.1, you need to upgrade to (at least) the 2.4-series before upgrading <package>glibc</package>. This should preferable be done before starting the upgrade. It is recommended you directly upgrade to the 2.6-kernel (available in &oldreleasename;, instead of upgrading to a 2.4-kernel series.
ja: 2.4.1 より前のカーネルを使用している場合、<package>glibc</package> をアップグレードする前に (最低でも) 2.4 系にアップグレードする必要があります。これは、なるべくアップグレードを開始する前に済ませておいてください。推奨されているのは、(2.4 系のカーネルにアップグレードするのではなく、&oldreleasename; で利用可能な) 2.6 系のカーネルに直接アップグレードすることです。
zh_cn: 如果您所运行的内核版本比 2.4.1 还旧，在升级 <package>glibc</package> 之前，您必须至少升级至 2.4 系列的内核。这个动作必须在开始进行升级之前完成。在此建议您能直接升级至 2.6 版的内核在 &oldreleasename; 里已有提供）而不是升级至 2.4 版的内核。

source: Checking system status
ja: システムの状態をチェックする
nl: De status van uw systeem controleren
pt: A verificar o estado do sistema
ru: Проверка состояния системы
sv: Kontrollera systemstatus
zh_cn: 检查系统的状态

source: The upgrade process described in this chapter has been designed for upgrades from "pure" &oldreleasename; systems without 3rd party packages. It may be wise to remove these packages first.
ja: この章で述べられているアップグレード手順は、サードパーティ製のパッケージを使っていない、「純粋な」&oldreleasename; システムからのアップグレード用です。サードパーティ製のパッケージは先に削除しておくとよいかもしれません。
pt: O processo de actualização descrito neste capítulo foi desenhado para actualizações a partir de sistemas &oldreleasename; "puros" sem pacotes de terceiros. Pode ser sensato remover primeiro estes pacotes.
ru: Описываемая в этом разделе процедура обновления предназначена для обновления "чистого" &oldreleasename; без дополнительных пакетов со стороны. Может даже лучше предварительно удалить эти пакеты.
sv: Uppgraderingsprocessen som beskrivs i det här kapitlet har designats för uppgraderingar från "rena" &oldreleasename;-system utan tredjepartspaket. Det kan vara lämpligt att ta bort dessa paket först.
zh_cn: 在这个章节中所说明的升级过程是专门为‘纯粹’的 &oldreleasename; 所写的，也就是在系统中没有安装任何其它第三方软件包。先将那些软件包移除掉或许是明智的做法。

source: This procedure also assumes your system has been updated to the latest point release of &oldreleasename;. If you have not done this or are unsure, follow the instructions in <ref id="old-upgrade">.
ja: またこの手順は、システムが &oldreleasename; の最新リリースにアップデート済であるものと想定しています。そうではなかったり、アップグレード済みかどうか不明なら、<ref id="old-upgrade">内の指示に従ってください。
pt: Este procedimento assume que o seu sistema foi actualizado até ao último ponto da versão &oldreleasename;. Se não tiver feito esta actualização ou não tem a certeza, siga as instruções em <ref id="old-upgrade">.
ru: Эта процедура также предполагает, что ваша система обновлена до последнего выпуска &oldreleasename;. Если это не так или вы в этом не уверены, следуйте инструкциям раздела <ref id="old-upgrade">.
sv: Den här proceduren antar även att ditt system har uppdaterats till den senaste punktutgåvan av &oldreleasename;. Om du inte har gjort det här eller är osäker, följ instruktionerna i <ref id="old-upgrade">.
zh_cn: 而在这个过程中也假设您的系统已更新至 &oldreleasename; 的最新释出版本。如果您尚未完成或是您根本无从确定，请遵循在 <ref id="old-upgrade"> 里的相关说明。

source: Disabling APT pinning
ja: APT の pin 機能を無効にする
nl: APT-pinning uitschakelen
pt: Desactivar o APT pinning
ru: Отключение фиксации APT
sv: Inaktivera APT-nålning
zh_cn: 关闭 APT 的钉锁 (Pinning) 功能

source: If you have configured APT to install certain packages from a distribution other than stable (e.g. from testing), you may have to change your APT pinning configuration (stored in <file>/etc/apt/preferences</file>) to allow the upgrade of packages to the versions in the new stable release. Further information on APT pinning can be found in <manref section="5" name="apt_preferences">.
ja: 特定のパッケージを安定版以外 (テスト版など) のディストリビューションからインストールするように APT を設定しているなら、当該パッケージが新しい安定版リリース内のバージョンにアップグレードできるように、(<file>/etc/apt/preferences</file> 内に保存されている) APT の pin 設定を変更する必要があるかもしれません。APT の pin 機能に関するより詳しい情報は、<manref section="5" name="apt_preferences"> にあります。
nl: Als u APT heeft geconfigureerd om bepaalde pakketten te installeren vanaf een andere distributie dan 'stable' (bijvoorbeeld vanaf 'testing'), kan het nodig zijn om uw 'APT-pinning' instellingen (in <file>/etc/apt/preferences</file>) te wijzigen om de opwaardering van pakketten naar de versie in de nieuwe 'stable' release mogelijk te maken. Aanvullende informatie over 'APT-pinning' kunt u vinden in <manref section="5" name="apt_preferences">.
pt: Se configurou o APT para instalar determinados pacotes a partir de uma distribuição que não a estável (por ex. a partir da testing), pode ter que alterar a sua configuração de APT pinning (armazenada em <file>/etc/apt/preferences</file>) para permitir a actualização de pacotes para versões existentes na nova versão estável. Mais informação sobre APT pinning pode ser encontrada em <manref section="5" name="apt_preferences">.
ru: Если вы настроили APT на установку некоторых пакетов из дистрибутива, отличного от стабильного (например, тестируемого), вам, возможно, придётся изменить конфигурацию APT (сохранённую в файле <file>/etc/apt/preferences</file>), чтобы было возможным обновление пакетов до версии в новом стабильном выпуске. Более подробную информацию о фиксации пакетов в APT можно найти в <manref section="5" name="apt_preferences">.
sv: Om du har konfigurerat APT att installera vissa paket från en annan distribution än den stabila (exempelvis från "testing"), kan du ändra din konfiguration för paketnålning i APT (lagrad i <file>/etc/apt/preferences</file>) för att tillåta uppgraderingen av paket till versionerna i den nya stabila utgåvan. Ytterligare information om APT-nålning kan hittas i <manref section="5" name="apt_preferences">.
zh_cn: 如果您将 APT 设置为可以安装除了 stable 发行版之外的软件包，（像是：testing），您可能必须修改您的 APT 的钉锁 (Pinning) 设置（储存于 <file>/etc/apt/preferences</file> 中）来让将要进行升级的软件包能够升级至新的 stable 发行版。您可以在 <manref name="apt_preferences" section="5"> 取得 APT 的钉锁功能的更多详尽信息。

source: Checking packages status
ja: パッケージの状態をチェックする
nl: De status van pakketten controleren
pt: Verificar o estado dos pacotes
ru: Проверка состояния пакетов
sv: Kontrollera paketstatus
zh_cn: 检查软件包的状态

source: Regardless of the method used for upgrading, it is recommended that you check the status of all packages first, and verify that all packages are in an upgradable state. The following command will show any packages which have a status of Half-Installed or Failed-Config, and those with any error status.
ja: アップグレードに使う手段に関係なく、まず全パッケージの状態を調べ、全パッケージがアップグレード可能な状態にあることを確認するよう推奨します。次のコマンドは、インストールが中断していたり設定に失敗したパッケージや、何らかのエラー状態にあるパッケージを表示します:
pt: Independentemente do método usado para a actualização, é recomendado que primeiro verifique o estado de todos os pacotes, e verificar que todos os pacotes estão em modo de actualização. O seguinte comando listará todos os pacotes que possuem o estado Metade-Instalado (Half-Installed) ou Configuração-Falhada (Failed-Config), e aqueles que apresentem qualquer erro no estado.
ru: Независимо от способа обновления, рекомендуется сначала проверить состояние всех пакетов и убедиться, что все пакеты могут быть обновлены. Следующая команда покажет частично установленные (Half-Installed) пакеты, пакеты, настройка которых не удалась (Failed-Config), а также все пакеты в ошибочных состояниях.
sv: Oavsett vilken metod som används för uppgradering, rekommenderas det att du kontrollerar statusen på paketen först och verifierar att alla paket är möjliga att uppgradera. Följande kommando kommer att visa de paket som har statusen Half-Installed eller Failed-Config, och de som har någon form av felstatus.
zh_cn: 不论您是用什么方式进行系统的更新，我们都建议您先检查所有软件包的状态，并确认所有的软件包都能够顺利升级。以下的指令会显示所有状态为半安装 (Half-Installed) 或设置失败 (Failed-Config) 或有其他任何错误的软件包。

source: You could also inspect the state of all packages on your system using <prgn>dselect</prgn>, <prgn>aptitude</prgn>, or with commands such as
ja: <prgn>dselect</prgn> や <prgn>aptitude</prgn>、あるいは次のようなコマンドを使ってシステムの全パッケージの状態を検査することもできます:
pt: Pode também inspeccionar o estado de todos os pacotes no seu sistema utilizando <prgn>dselect</prgn>, <prgn>aptitude</prgn>, ou comandos como
ru: Можно также проверить состояние всех пакетов системы с помощью программ <prgn>dselect</prgn>, <prgn>aptitude</prgn> или таких команд, как
sv: Du kan även inspektera tillståndet för alla paket på ditt system med <prgn>dselect</prgn>, <prgn>aptitude</prgn>, eller med kommandon som
zh_cn: 除此之外，检查系统中所有软件包状态的方法还包括使用使用 <prgn>dselect</prgn>、<prgn>aptitude</prgn>、或是利用以下的指令：

source: or
ja: または
pt: ou
ru: или
sv: eller
zh_cn: 或是

source: It is desirable to remove any holds before upgrading. If any package that is essential for the upgrade is on hold, the upgrade will fail.
ja: アップグレード前に、あらゆる hold 状態を解除しておいたほうがよいでしょう。アップグレードに不可欠なパッケージが hold 状態にあるなら、アップグレードに失敗するでしょう。
pt: É desejável que remova todos os bloqueios ('holds') antes da actualização. Se algum pacote essencial à actualização estiver bloqueado, a actualização irá falhar.
ru: Перед обновлением желательно снять все фиксации с пакетов. Если один из необходимых для обновления пакетов зафиксирован, обновление завершится неудачей.
sv: Det är önskvärt att ta bort eventuella tillbakahållna paket innan uppgradering. Om något paket är systemkritiskt och hålls tillbaka för uppgraderingen, kommer uppgraderingen att misslyckas.
zh_cn: 最佳的做法是在进行系统升级前将所有的软件包解除保留 (hold) 状态。如果在升级过程中有任何的关键软件包的状态被设置为保留，那么升级的作业就会失败。

source: Note that <prgn>aptitude</prgn> uses a different method for registering packages that are on hold than <prgn>apt-get</prgn> and <prgn>dselect</prgn>. You can identify packages on hold for <prgn>aptitude</prgn> with
ja: hold 状態にあるパッケージを記録するのに、<prgn>aptitude</prgn> は <prgn>apt-get</prgn> や <prgn>dselect</prgn> とは異なる手法を用いることに注意してください。<prgn>aptitude</prgn> では、以下のように実行して hold 状態にあるパッケージを検出できます:
pt: Note que o <prgn>aptitude</prgn> utiliza um método diferente para registar os pacotes que estejam bloqueados pelo <prgn>apt-get</prgn> e do <prgn>dselect</prgn>. Pode identificar pacotes bloqueados para o <prgn>aptitude</prgn> com
ru: Заметим, что <prgn>aptitude</prgn> использует другой метод регистрации зафиксированных пакетов, чем <prgn>apt-get</prgn> и <prgn>dselect</prgn>. Определить, какие пакеты зафиксированы через <prgn>aptitude</prgn>, можно с помощью
sv: Observera att <prgn>aptitude</prgn> använder en annan metod för att registrera paket som hålls tillbaka än <prgn>apt-get</prgn> och <prgn>dselect</prgn>. Du kan identifiera paket som hålls tillbaka med <prgn>aptitude</prgn> med
zh_cn: 请注意到，<prgn>aptitude</prgn> 使用了和 <prgn>apt-get</prgn> 及 <prgn>dselect</prgn> 迥然不同的方式来登录哪些是保留软件包。您可以使用以下方式来确认哪些软件包是被保留住的：

source: If you want to check which packages you had on hold for <prgn>apt-get</prgn>, you should use
ja: <prgn>apt-get</prgn> でどのパッケージが hold 状態にあるのかを調べたければ、以下のように実行してください:
pt: Se quiser verificar que pacotes tem bloqueados para o <prgn>apt-get</prgn> deverá utilizar
ru: Если вы хотите проверить, какие пакеты зафиксированы через <prgn>apt-get</prgn>, используйте
sv: Om du vill kontrollera vilka paket du hade hållt tillbaka för <prgn>apt-get</prgn>, ska du använda
zh_cn: 如果您想要检查那些软件包是被 <prgn>apt-get</prgn> 所保留住的，请使用：
