Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: If an operation using <prgn>aptitude</prgn>, <prgn>apt-get</prgn> or <prgn>dpkg</prgn> fails with the error <example compact="compact"> E: Dynamic MMap ran out of room</example> the default cache space is insufficient. You can solve this by either removing or commenting lines you don't need in <file>/etc/apt/sources.list</file> or by increasing the cache size. The cache size can be increased by setting <tt>APT::Cache-Limit</tt> in <file>/etc/apt/apt.conf</file>. The following command will set it to a value that should be sufficient for the upgrade: <example compact="compact"> # echo 'APT::Cache-Limit "12500000";' >> /etc/apt/apt.conf</example> This assumes that you do not yet have this variable set in that file.
nl: Als een operatie met <prgn>aptitude</prgn>, <prgn>apt-get</prgn> of <prgn>dpkg</prgn> mislukt met de foutmelding<example compact="compact"> E: Dynamic MMap ran out of room</example>dan is de standaard grootte van de "cache" ontoereikend. U kunt dit verhelpen ofwel door regels in <file>/etc/apt/sources.list</file> die u niet nodig heeft te verwijderen of uit te commentariëren, ofwel door de cache te vergroten. De grootte van de cache kan worden verhoogd door het instellen van <tt>APT::Cache-Limit</tt> in <file>/etc/apt/apt.conf</file>. De volgende opdracht stelt deze parameter in op een waarde die voldoende zou moeten zijn voor de migratie:<example compact="compact"> # echo 'APT::Cache-Limit "12500000";' >> /etc/apt/apt.conf</example> Aanname hierbij is dat deze variabele nog niet gezet is in dit bestand.

source: It is possible that a system's dependency structure can be so corrupt as to require manual intervention. Usually this means using <prgn>aptitude</prgn> or <example compact="compact"> # dpkg --remove <var>packagename</var> </example> to eliminate some of the offending packages, or <example compact="compact"> # aptitude --fix-broken install # dpkg --configure --pending </example>
nl: Het is mogelijk dat de afhankelijkheden op een systeem dusdanig verstoord zijn dat handmatige interventie noodzaklijk is. Normaalgesproken betekent dit dat u <prgn>aptitude</prgn> of<example compact="compact"> # dpkg --remove <var>packagename</var> </example>zult moeten gebruiken om enkele van de veroorzakende pakketten te verwijderen. Een andere mogelijkheid is:<example compact="compact"> # aptitude --fix-broken install # dpkg --configure --pending </example>

source: In extreme cases you might have to force re-installation with a command like <example compact="compact"> # dpkg --install <var>/path/to/packagename.deb</var> </example>
nl: In uitzonderlijke situaties is mogelijk dat u een herinstallatie moet forceren, bijvoorbeeld met: <example compact="compact"> # dpkg --install /path/to/packagename.deb </example>

source: File conflicts should not occur if you upgrade from a "pure" &oldreleasename; system, but can occur if you have unofficial backports installed. A file conflict will result in an error like: <example compact="compact"> Unpacking replacement <var>&lt;package-foo&gt;</var> ... dpkg: error processing <var>&lt;package-name-for-foo&gt;</var> (--unpack): trying to overwrite `<var>&lt;some-file-name&gt;</var>', which is also in package <var>&lt;package-bar&gt;</var> </example>
nl: Bestandsconflicten mogen zich eigenlijk niet voordoen als u een migratie uitvoert vanaf een "zuiver" &oldreleasename; systeem, maar kunnen wel voorkomen als er niet-officiële "backports" geïnstalleerd zijn. Een bestandsconflict zal resulteren in een foutmelding als: <example compact="compact"> Unpacking replacement <var>&lt;package-foo&gt;</var> ... dpkg: error processing <var>&lt;package-name-for-foo&gt;</var> (--unpack): trying to overwrite `<var>&lt;some-file-name&gt;</var>', which is also in package <var>&lt;package-bar&gt;</var> </example>

source: You can try to solve a file conflict by forcibly removing the package mentioned on the <em>last</em> line of the error message: <example compact="compact"> # dpkg -r --force-depends <var>packagename</var> </example>
nl: U kunt proberen een bestandsconflict op te lossen door het pakket dat wordt genoemd in de <em>laatste</em> regel van de foutmelding, geforceerd te verwijderen: <example compact="compact"> # dpkg -r --force-depends <var>packagename</var> </example>

source: Read <file>/usr/share/doc/xfree86-common/README.Debian-upgrade.gz</file> for more info on the upgrade of the X window system packages. This is relevant for users of all previous Debian releases. In short, you need to read it.
nl: Lees <file>/usr/share/doc/xfree86-common/README.Debian-upgrade.gz</file> voor nadere informatie over de opwaardering van de pakketten van het X-Window Systeem. Dit is relevant voor gebruikers van alle voorgaande releases van Debian. Kortgezegd, dit document moet u lezen.

source: Upgrading your kernel
nl: Uw kernel opwaarderen

source: Note that the Linux kernel was <em>not</em> upgraded by these procedures. You may wish to do so yourself, either by installing one of the <package>kernel-image-*</package> packages or by compiling a customized kernel from sources.
nl: Merk op dat de Linux kernel tijdens deze procedures <em>niet</em> is opgewaardeerd. Desgewenst kunt u dit zelf doen, ofwel door één van de pakketten <package>kernel-image-*</package> te installeren of door een door u zelf samengestelde kernel te compileren op basis van de broncode (<package>kernel-source-*</package>).

source: &debian; comes with a &kernelversion; kernel which is in the 2.4 series, the older stable Linux kernel series. You may wish to use a 2.6 series kernel for better hardware support or improved performance.
nl: De standaard kernel voor &debian; is &kernelversion; uit de oudere stabiele 2.4 serie van de Linux kernel. Desgewenst kunt u ook een kernel uit de 2.6 serie gebruiken om betere ondersteuning van uw hardware of prestatieverbetering te verkrijgen.

source: However, you a strongly advised <strong>not</strong> to upgrade to a 2.6 kernel as part of the upgrade from &oldreleasename; to &releasename;. Some issues associated with an upgrade to 2.6 are documented in <ref id="upgrade-to-2.6">.
nl: U wordt echter dringend geadviseerd om een opwaardering naar een 2.6 kernel <strong>niet</strong> uit te voeren als onderdeel van de migratie van &oldreleasename; naar &releasename;. Enkele aandachtspunten met betrekking tot een opwaardering naar 2.6 zijn opgenomen in <ref id="upgrade-to-2.6">.

source: To upgrade your kernel you must first choose the kernel most appropriate for your subarchitecture. A list of kernels available for you to install can be found with: <example compact="compact"> # apt-cache search ^kernel-image </example>
nl: Om uw kernel op te waarderen, dient u eerst de kernel kiezen die het best past bij uw (sub)platform. Een overzicht van de kernels die beschikbaar zijn voor installatie kunt u verkrijgen met: <example compact="compact"> # apt-cache search ^kernel-image </example>

source: Please note that the installation system of &oldreleasename; (and previous releases) did <em>not</em> install the kernel as a package in your system. This has changed in &releasename; and you can install virtual packages to keep track of kernel changes. These packages are named kernel-image-<tt>VERSION</tt>-<tt>ARCH</tt>, with <tt>VERSION</tt> corresponding to the kernel version number (2.4 or 2.6) and <tt>ARCH</tt> corresponding to any of the supported architectures. If you want to have security support for the kernel integrated in package management please install the kernel package most suitable for your hardware after the upgrade.
nl: Merk op dat het installatiesysteem voor &oldreleasename; (en eerdere releases) de kernel <em>niet</em> als een pakket op uw systeem installeerde. Met &releasename; is dit wel mogelijk en kunt u virtuele pakketten gebruiken om wijzigingen in de kernel automatisch te volgen. Deze virtuele pakketten zijn genaamd kernel-image-<tt>VERSION</tt>-<tt>ARCH</tt>, waarbij <tt>VERSION</tt> overeenkomt met het versienummer van de kernel (2.4 of 2.6) en <tt>ARCH</tt> met een van de ondersteunde (sub)platforms. Als u beveiligingswijzigingen voor de kernel graag geïntegreerd wilt hebben in het pakketbeheer, installeer dan na de migratie van uw systeem het kernel pakket dat het meest geschikt is voor uw systeem.

source: There are many reasons why packages might have been removed from the distribution: they are no longer maintained upstream, there is no longer a Debian Developer interested in maintaining the packages; the functionality they provide has been superseded by different software (or a new version); or they are no longer considered suitable for &releasename; due to bugs in them. In the later case, packages might still be present in the "unstable" distribution.
nl: Er zijn diverse redenen waarom pakketten kunnen zijn verwijderd uit de distributie: de broncode wordt niet langer onderhouden; er is niet langer een Debian ontwikkelaar geïnteresseerd in het beheren van de pakketten; voor de functionaliteit die werd geboden zijn inmiddels betere alternatieven (of een nieuwe versie); of ze worden vanwege problemen in de software niet langer geschikt geacht voor &releasename;. In het laatste geval is het mogelijk dat een pakket nog wel aanwezig is in "unstable".

source: Detecting which packages in an updated system are "obsolete" is easy since the package management front-ends will mark them as such. If you are using <prgn>aptitude</prgn>, you will see a listing of these packages in the "Obsolete and Locally Created Packages" entry. <prgn>dselect</prgn> provides a similar section but the listing it presents might differ. Also, if you have used <prgn>aptitude</prgn> to manually install packages in &oldreleasename; it will have kept track of those packages you manually installed and will be able to mark as obsolete those packages pulled in by dependencies alone which are no longer needed if a package has been removed. Also, <prgn>aptitude</prgn>, unlike <prgn>deborphan</prgn> will not mark as obsolete packages that you manually installed, as opposed to those that were automaticaly installed through dependancies.
nl: Het is eenvoudig om uit te vinden welke pakketten na een migratie "vervallen" zijn, aangezien de applicaties voor pakketbeheer ze als zodanig zullen markeren. Als u gebruik maakt van <prgn>aptitude</prgn>, zult u een overzicht van deze pakketten vinden onder de kop "Verouderde en lokaal aangemaakte pakketten". Ook <prgn>dselect</prgn> biedt een vergelijkbare sectie, al luidt de titel iets anders. Als u in &oldreleasename; <prgn>aptitude</prgn> heeft gebruikt om pakketten te installeren, zal het hebben bijgehouden welke pakketten u zelf heeft geïnstalleerd. Daardoor is het in staat om pakketten die slechts automatisch zijn toegevoegd vanwege afhankelijkheden te markeren als verouderd als ze niet langer nodig zijn nadat een pakket is verwijderd. Ook zal <prgn>aptitude</prgn>, in tegenstelling tot <prgn>deborphan</prgn>, pakketten die u zelf heeft geïnstalleerd niet als "verouderd" markeren.

source: The <url id="&url-bts;" name="Debian Bug Tracking System"> often provides additional information on why the package was removed. You should review both the archived bug reports for the package itself and the archived bug reports for the <url id="&url-bts;/cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&#38;archive=yes" name="ftp.debian.org pseudo-package">.
nl: Het <url id="&url-bts;" name="Debian Bug Tracking System"> biedt vaak aanvullende informatie over de redenen waarom een pakket is verwijderd. Hiervoor dient u zowel de gearchiveerde probleemrapporten voor het pakket zelf als die voor het <url id="&url-bts;/cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&#38;archive=yes" name="pseudo-pakket ftp.debian.org"> te raadplegen.

source: Changes to Python packages
nl: Wijzigingen in Python pakketten

source: None of the python2.X packages that are included with &releasename; include the standard modules 'profile' and 'pstats', because they are licensed under a license that does not conform to the DFSG (see bug #293932 for details). These two modules can be found in the python-profiler and python2.X-profiler packages that are included in the non-free section of the Debian archive.
nl: Geen van de python2.x-pakketten beschikbaar in &releasename; bevat de standaard modules 'profile' and 'pstats'. Reden is dat deze een licentie hebben die niet voldoet aan de DFSG (zie probleemrapport #293932 voor nadere informatie). Beide modules zijn opgenomen in de pakketten python-profiler en python2.x-profiler in de 'non-free' sectie van het Debian archief.

source: If you compile your own kernel from source, make sure you install <package>module-init-tools</package> before you reboot with the 2.6 kernel. This package replaces <package>modutils</package> for 2.6 kernels. If you install one of the Debian <package>kernel-image</package> packages, this package will be installed automatically because of dependencies.
nl: Zorg ervoor dat, als u zelf uw kernel compileert vanaf de broncode, u <package>module-init-tools</package> installeert voordat u het systeem opstart met de 2.6 kernel. Dit pakket vervangt <package>modutils</package> voor 2.6 kernels. Als u een van de <package>kernel-image</package> pakketten installeert, zal dit pakket automatisch worden geïnstalleerd op basis van afhankelijkheden.

source: For the 2.6 kernel series the ALSA sound drivers are preferred over the OSS sound drivers. If you install <package>alsa-base</package>, ALSA modules for your soundcard should be loaded automatically; this will also automatically blacklist OSS modules for <package>discover</package> and <package>hotplug</package> to prevent them from loading. If you have OSS modules listed in <file>/etc/modules</file>, you should remove them.
nl: Voor de 2.6 kernel serie wordt voor geluid de voorkeur gegeven aan de ALSA stuurprogramma's boven de OSS stuurprogramma's. Als u <package>alsa-base</package> installeert, worden de ALSA modules voor uw geluidskaart als het goed is automatisch geladen; ook worden hierdoor OSS modules automatisch op de zwarte lijsten voor <package>discover</package> en <package>hotplug</package> geplaatst om te voorkomen dat deze worden geladen. Als u OSS modules heeft staan <file>/etc/modules</file>, dient u deze te verwijderen.

source: <package>udev</package> is a userspace implementation of devfs. It is mounted over the <file>/dev/</file> directory and will dynamically populate that directory with devices as kernel modules are loaded. It works together with <package>hotplug</package> to detect new devices. <package>udev</package> works only with 2.6 kernels.
nl: <package>udev</package> is een implementatie van devfs in "userspace". Het wordt aangekoppeld over de directory <file>/dev/</file> en zorgt ervoor dat apparaatbestanden dynamisch worden aangemaakt als kernel modules worden geladen. Het werkt samen met <package>hotplug</package> om nieuwe apparaten te detecteren. <package>udev</package> werkt alleen met 2.6 kernels.

source: As <package>udev</package> is automatically installed as a dependency of e.g. <package>gnome</package>, there is a chance that upgrading to a 2.6 kernel will result in <package>udev</package> being activated.
nl: Omdat <package>udev</package> automatisch wordt geïnstalleerd om bijvoorbeeld <package>gnome</package> er een afhenkelijkheid mee heeft, bestaat de kans dat het opwaarderen naar een 2.6 kernel tot gevolg zal hebben dat <package>udev</package> zal activeren.

source: X Window System fails to load
nl: Problemen bij het starten van het X Window System

source: If after booting your machine, X fails to load and you see an error "missing core pointer" in <file>/var/log/XFree86.0.log</file>, the problem could be that the mouse driver is not loaded fast enough by <prgn>hotplug</prgn> (bug <url id="http://bugs.debian.org/255744" name="#255744">). The solution is to add the driver module for your mouse (e.g. psmouse) in <file>/etc/modules</file>.
nl: Als X na het opstarten van uw systeem niet goed opstart en u in <file>/var/log/XFree86.0.log</file> een foutmelding "missing core pointer" ziet, dan kan de oorzaak zijn dat de module met het stuurprogramma voor uw muis niet snel genoeg wordt geladen door <prgn>hotplug</prgn> (probleemrapport <url id="http://bugs.debian.org/255744" name="#255744">). De oplossing hiervoor is om de betreffende module (bijvoorbeeld psmouse) toe te voegen in <file>/etc/modules</file>.

source: X Window System on Transmeta Crusoe systems
nl: X Window System op Transmeta Crusoe systemen

source: The X server shipping in &releasename; contains optimized code which is not properly executed by many Transmeta(TM) Crusoe(TM) processors. The result of this is that at a certain time (when cached code "morphed" from x86 to Crusoe VLIW instructions in the CPU is in a buggy state), X client applications which connect with it fail with the following error message: <example compact="compact"> X Error of failed request: BadLength (poly request too large or internal Xlib length error) Major opcode of failed request: 18 (X_ChangeProperty) Serial number of failed request: 15 Current serial number in output stream: 18</example>
nl: De X-server in &releasename; bevat geoptimaliseerde code die niet juist wordt uitgevoerd op veel Transmeta(TM) Crusoe(TM) processoren. Het gevolg hiervan is dat op een gegeven moment (als code die omgevormd is van x86 naar Crusoe VLIW instructies in de cache fouten vertoont) X-client toepassingen die met de X-server zijn verbonden, zullen falen met de volgende foutmelding: <example compact="compact"> X Error of failed request: BadLength (poly request too large or internal Xlib length error) Major opcode of failed request: 18 (X_ChangeProperty) Serial number of failed request: 15 Current serial number in output stream: 18</example>

source: In practical terms, this means that after a few hours of operation, applications will suddenly quit in rapid succession; if a display manager is running, that too will repeatedly quit and attempt to restart itself. The state will persist until the buggy VLIW Transmeta code is flushed from the cache.
nl: In de praktijk betekent dit dat na enkele uren toepassingen het opeens snel achterelkaar zullen begeven; als er een schermbeheerder actief is, zal ook deze het regelmatig begeven en proberen om opnieuw op te starten. Dit zal zich blijven voordoen totdat de onjuiste VLIW Transmeta code uit de cache wordt verwijderd.

source: Since the bug is in the proprietary Transmeta Code Morphing Software (CMS), and the laptop BIOS checks the CMS for a vendor signature at boot time, this can only be fixed in cooperation between Transmeta and the laptop vendor. Further information about this issue can be found at <url id="http://www.cs.auc.dk/~fleury/bug_cms/"> and Debian bug report <url id="http://bugs.debian.org/216933" name="#216933">.
nl: Omdat de fout zit in de code van de Transmeta Code Morphing Software (CMS), en de BIOS van de laptop tijdens het opstarten het CMS controleert op een geldige "handtekening" van de producent, kan dit probleem alleen worden opgelost in samenwerking tussen Transmeta en de producent van de laptop. Nadere informatie over dit probleem is beschikbaar op <url id="http://www.cs.auc.dk/~fleury/bug_cms/"> en Debian probleemrapport <url id="http://bugs.debian.org/216933" name="#216933">.

source: The workaround for this bug is to install an X server compiled without optimization, such as the <package>xserver-xfree86-dbg</package> package.
nl: Dit probleem kan worden omzeild door een X-server te installeren die is gecompileerd zonder optimalisatie, zoals het pakket <package>xserver-xfree86-dbg</package>.

source: Beyond these release notes and the installation guide further documentation on &debian; is available from the Debian Documentation Project (DDP), whose goal is to create high quality documentation for Debian users and developers. Documentation including the Debian Guide, Debian New Maintainers Guide, and Debian FAQ are available, and many more. For full details of the resources available see the <url id="&url-ddp;" name="DDP website">.
nl: Buiten deze Release Notities en de Installatiehadleiding is er aanvullende documentatie over &debian; beschikbaar vanuit het Debian Documentatie Project (DDP). De doelstelling van het DDP is om hoogwaardige documentatie te ontwikkelen voor gebruikers en ontwikkelaars van Debian. De documentatie omvat onder meer de Debian Handleiding, de Gids voor nieuwe Debian Ontwikkelaars en de Debian FAQ. Voor nadere informatie verwijzen wij u naar de <url id="&url-ddp;" name="website van het DDP">.

source: Debian has an IRC channel dedicated to the support and aid of Debian users located on the Freenode IRC network which exists to provide interactive services to peer-directed project communities. To access the channel point your favourite IRC client at &debian-irc-server; and join #debian.
nl: Debian heeft een IRC-kanaal dat gewijd is aan de ondersteuning van gebruikers van Debian . Dit kanaal bevindt zich op het IRC-netwerk van Freenodedat tot doel heeft om interactieve diensten beschikbaar te stellen aan gemeenschappen die op collaboratieve basis werken projecten. Stel om toegang te krijgen tot het kanaal uw favoriete IRC-programma in op &debian-irc-server; en meldt u aan voor #debian.

source: Please follow the channel guidelines, respecting other users fully. For more information on Freenode please visit the <url id="&url-irc-host;" name="website">.
nl: Respecteer a.u.b. de richtlijnen van het kanaal en respecteer andere gebruikers. Kijk op de <url id="&url-irc-host;" name="website"> voor nadere informatie over Freenode.

source: If you can dedicate more time, you could manage a piece of the Free Software collection within Debian. Especially helpful is if people adopt or maintain items that people have requested for inclusion within Debian, the <url id="&url-wnpp;" name="Work Needing and Prospective Packages database"> details this information. If you have an interest in specific groups then you may find enjoyment in contributing to some of Debian's subprojects which include ports to particular architectures, <url id="&url-debian-jr;" name="Debian Jr."> and <url id="&url-debian-med;" name="Debian Med">.
nl: Als u meer tijd beschikbaar kunt stellen, zou u een deel van de verzameling Vrije Software binnen Debian kunnen beheren. Bijzonder behulpzaam is het wanneer zaken worden geadopteerd of onderhouden waarvan gebruikers hebben verzocht om die op te nemen in Debian; de '<url id="&url-wnpp;" name="Work Needing and Prospective Packages database">' bevat deze informatie. Als u interesse heeft in specifieke groepen, kunt u mogelijk voldoening vinden in het leveren van een bijdrage aan een van de deelprojecten binnen Debian, waaronder 'ports' naar een bepaald platform, <url id="&url-debian-jr;" name="Debian Jr."> en <url id="&url-debian-med;" name="Debian Med">.

source: <strong>The information in this appendix is relevant only if, for a successful upgrade of the system, you need to upgrade the kernel <em>before</em> upgrading the system. Please read <ref id="new-kernel"> to find out if that is required for your system</strong>.
nl: <strong>De informatie in deze bijlage is alleen relevant voor u indien u, voor een succesvolle migratie van uw systeem, de kernel moet opwaarderen <em>voordat</em> u de rest van het systeem migreert. In <ref id="new-kernel"> kunt u lezen of dit voor u van toepassing is.</strong>

source: The following instructions explain step by step how to use the available backported tools to install the newer kernel.
nl: De navolgende instructies leggen stap voor stap uit hoe u de nieuwe kernel installeert met behulp van de voor &oldreleasename; geprepareerde pakketten.
