Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: For &arch-title; a separate installation image using a graphical user interface is available on an experimental basis. It is known to work on most CHRP systems that have an ATI graphics card, but has been insufficiently tested on &arch-title; to include it on the normal installation CDs.
ja: &arch-title; では、通常のインストールイメージとは別に、グラフィカルユーザインタフェースを使用するイメージが試験的に利用可能です。このイメージは、ATI のグラフィックカードのついた CHRP システムの大半では動作することがわかっていますが、&arch-title; においては、通常のインストール CD に含められるほど十分にはテストされていません。
pt: Para a arquitectura &arch-title; uma imagem do instalador utilizando interface gráfica está disponível em separado numa base experimental. Sabe-se que funciona com a maioria dos sistemas CHRP que possuem placas gráficas ATI, mas não foi ainda suficientemente testada na arquitectura &arch-title; de modo a o incluir nos CDs normais de instalação.
ru: Для &arch-title; есть отдельный образ графического пользовательского интерфейса и только в качестве эксперимента. Известно, что он работает почти на всех CHRP-системах с графическими картами ATI, но был недостаточно протестирован на &arch-title;, чтобы включить его на обычные установочные CD.
sv: För &arch-title; finns en separat installationsavbild med ett grafiskt användargränssnitt tillgängligt, dock endast på experimentella grunder. Den är känd att fungera på de flesta CHRP-system som har ett ATI-grafikkort, men har inte testats tillräckligt på &arch-title; för att inkludera den på de vanliga installationsskivorna.
zh_cn: 在 &arch-title; 上，只额外提供了一个仅供测试用的图形界面安装镜像文件。它已知能在大多数装有 ATI 显示卡的 CHRP 系统上正常运作，但在 &arch-title; 上未经完整测试之前，尚不能将它列为一般的安装 CD 之一。

source: If you'd like to try the graphical installer, look for the "gtk-miniiso" image.
ja: グラフィカルインストーラを使用してみたい場合は、"gtk-miniiso" イメージを探してください。
pt: Se quiser experimentar o instalador gráfico procure a imagem "gtk-miniiso".
ru: Если вы хотите попробовать графический интерфейс программы установки, поищите образ "gtk-miniiso".
sv: Om du vill prova den grafiska installeraren, leta efter avbilden "gtk-miniiso".
zh_cn: 如果您很想试用图形界面的安装程序，请替而使用 "gtk-miniiso" 镜像文件。

source: Rescue mode
ja: レスキューモード
pt: Modo de recuperação
ru: Режим восстановления
sv: Räddningsläge
zh_cn: 救援模式

source: You can use the installer to solve problems with your system, for example when it refuses to boot. The first steps will be just like a regular installation, but the installer will not start the partitioner. Instead it will offer you a menu of rescue options.
ja: 起動できないなどの問題がシステムに生じた場合、その解決にインストーラを利用できます。最初のステップは通常のインストールと同様ですが、インストーラはパーティション作成プログラムを起動しません。代わりにレスキューオプションのメニューを表示します。
pt: Pode utilizar o instalador para resolver problemas com o seu sistema, por exemplo quando o mesmo se recusa a arrancar. Os primeiros passos serão idênticos a uma instalação normal, no entanto o instalador não irá iniciar o programa responsável pela criação de partições. Em vez disso oferecerá um menu com opções de recuperação.
ru: Можно использовать программу установки для решения проблем с системой, например, если она больше не загружается. Первые шаги выглядят как процесс обычной установки, но программа установки не будет запускать утилиту разметки. Вместо этого вам будет предложено меню восстановления.
sv: Du kan använda installeraren att lösa problem med ditt system, till exempel när det vägrar att starta upp. De första stegen kommer att vara precis som en vanlig installation, men installeraren kommer inte att starta partitioneraren. Istället kommer den att erbjuda dig en meny med räddningsalternativ.
zh_cn: 您可以利用安装程序来修复您系统上一些像是无法开机的问题。最先的步骤会和一般的安装步骤极为类似，但安装程序不会启动硬盘分区程序，取而代之的它会提供一个列有救援选项的菜单。

source: Activate the rescue mode by booting the installer with <tt>rescue</tt>, or by adding a boot parameter <tt>rescue/enable=true</tt>.
ja: インストーラに <tt>rescue</tt> を与えて起動するかブートパラメータ <tt>rescue/enable=true</tt> を追加して、レスキューモードをアクティブにしてください。
pt: Active o modo de recuperação arrancando o instalador com <tt>rescue</tt>, ou adicionando o parâmetro de arranque <tt>rescue/enable=true</tt>.
ru: Чтобы загрузиться в режиме восстановления, запустите программу установки командой <tt>rescue</tt>, или добавьте загрузочный параметр <tt>rescue/enable=true</tt>.
sv: Aktivera räddningsläget genom att starta upp installeraren med <tt>rescue</tt>, eller genom att lägga till uppstartsparametern <tt>rescue/enable=true</tt>.
zh_cn: 请以 <tt>rescue</tt> 启动安装程序，或是在开机时加上 <tt>rescue/enable=true</tt> 参数，就能启动救援模式。

source: Using sudo instead of root account
ja: root アカウントの代わりに sudo を使用
pt: Utilização do sudo em vez da conta de root
ru: Использование sudo вместо учётной записи root
sv: Använder sudo istället för root-konto
zh_cn: 使用 sudo 来取代 root 帐号

source: During expert installations you can choose to not set up the root account (it will be locked), but instead set up <prgn>sudo</prgn> so that the first user can use that for system administration.
ja: エキスパートモードでのインストール中に、root アカウントをセットアップしないよう選択できます (root アカウントはロックされます)。root アカウントをセットアップしない場合は代わりに <prgn>sudo</prgn> をセットアップし、最初のユーザがシステム管理のためにこのコマンドを使用できるようにします。
pt: Durante instalações avançadas pode escolher não definir uma conta de root (esta será bloqueada), mas alternativamente definir <prgn>sudo</prgn> de modo a que o primeiro utilizador possa usá-lo para a administração do sistema.
ru: Во время установки в режиме эксперта вы можете выбрать не настраивать учётную запись root (она будет заблокирована), а вместо неё настроить <prgn>sudo</prgn> так, чтобы первая учётная запись пользователя могла использоваться для администрирования системы.
sv: Under expertinstallationer kan du välja att inte ställa in root-kontot (det kommer att vara låst), utan istället konfigurera <prgn>sudo</prgn> så att den första användaren kan använda det för systemadministration.
zh_cn: 在 expert 安装模式中，您可以选择不要设置 root 帐号（让它因而被锁上）。取而代之的是设置<prgn>sudo</prgn>，让第一个用户可以利用它来进行系统管理。

source: Cryptographic verification of downloaded packages
ja: ダウンロードしたパッケージの暗号署名による検証
zh_cn: 替下载到的软件包验证其验证码

source: Packages downloaded with the installer are now cryptographically checked using <prgn>secure apt</prgn> making it more difficult to compromise a system being installed over the network.
ja: インストーラがダウンロードしたパッケージは、暗号署名を通じて、<prgn>secure apt</prgn> を用いて検証されるようになりました。これによって、ネットワーク経由でインストール中のシステムのセキュリティを侵害するのがさらに難しくなりました。
zh_cn: 现在，经由安装程序所下载到的软件包会再利用 <prgn>secure apt</prgn> 来验证它的验证码。这么一来，若想攻击经由网络安装的系统将会更加不易。

source: The packages needed for SELinux support have been promoted to priority "standard". This means that they will be installed by default if you select the Standard task during installation. However, SELinux support is not enabled by default. If you want to secure your system using SELinux, you will need to enable it manually after the installation.
ja: SELinux のサポートに必要なパッケージの優先度が「標準」に昇格しました。つまり、インストール中にタスクとして標準 (Standard) を選択すれば、必要なパッケージはデフォルトでインストールされます。しかし、SELinux のサポートはデフォルトでは有効になっていません。SELinux を使用してシステムを安全にしたい場合は、インストール後に手作業で有効にする必要があります。
pt: Os pacotes necessários ao suporte a SELinux foram promovidos a prioridade "standard". Significa assim que serão instalados por omissão se seleccionar a tarefa Standard durante a instalação. No entanto, o suporte a SELinux não se encontra activado por omissão. Se quiser tornar o seu sistema seguro através do SELinux terá que manualmente activá-lo depois da instalação.
ru: Необходимы для поддержки SELinux пакетам был присвоен приоритет "стандарт". Это означает, что они будут установлены по умолчанию, если вы выберете во время установки задачу "Стандартная система". Однако, поддержка SELinux по умолчанию не включена. Если вы хотите обезопасить систему с помощью SELinux, нужно сделать это вручную после установки.
sv: Paketen som behöver för SELinux-stöd har promoterats till prioriteten "standard". Det betyder att de kommer att installeras som standard om du väljer funktionen Standard under installationen. Dock är inte SELinux-stödet aktiverat som standard. Om du vill säkra upp ditt system med SELinux, behöver du aktivera det manuellt efter installationen.
zh_cn: 为了支持 SELinux 所需的软件包的优先权已提升为 "标准"。这表示，如果您在安装的过程中选择了 Standard 主题，默认就会把它们安装进来。然而， SELinux 默认并不会启用。如果您想利用 SELinux 来强化您的系统的安全性，您必须在安装完成后手动启用。

source: Simplified mail configuration
ja: メールの設定が簡単に
zh_cn: 简化的邮件设置

source: The installation system setups a basic configuration for the system's mail server which will only provide for local e-mail delivery, if the "standard system" is installed. The mail server will be unavailable to other systems connected to the same network. If you want to configure your system to handle e-mail not local to the system (either to send e-mail or to receive it) you will have to reconfigure the mail system after installation.
ja: インストールシステムは、「標準システム」のインストール時に、システムに、ローカルにメールを配送するだけのメールサーバの基本設定をセットアップします。このメールサーバは、同一ネットワークに接続している他のシステムとのメールのやりとりはできません。システムに対してローカルでないメールのやりとりを (送信であれ受信であれ) 取り扱えるようにシステムを設定したい場合は、インストール後にメールシステムを再設定しなくてはなりません。
zh_cn: 如果是以标准系统来进行安装的话，安装系统会将系统的邮件服务器的设置简化为只能在本机里传递邮件。即使是位于相同网络上的系统也无法访问这个邮件服务器。如果您想把您的系统设置为能够处理非本机的邮件（不管是寄出或接收邮件），您必须在安装完成后重新设置邮件系统。

source: New languages
ja: 新言語
pt: Novos idiomas
ru: Новые языки интерфейса
sv: Nya språk
zh_cn: 新语系

source: Thanks to the huge efforts of translators, Debian can now be installed in 47 languages using the text-based installation user interface. This is six languages more than in &oldreleasename;. Languages added in this release include Belarusian, Esperanto, Estonian, Kurdish, Macedonian, Tagalog, Vietnamese and Wolof. Languages dropped in this relase due to lack of translation updates include Persian and Welsh. <![ %g-i [ If the graphical user interface is used, an additional eleven languages are supported. These languages can only be selected using this installer as their character sets cannot be presented in a non-graphical environment. The new languages are: Bengali, Dzongkha, Gujarati, Hindi, Georgian, Khmer, Malayalam, Nepali, Punjabi, Tamil and Thai. ]]> Users that do not wish to use any locale can now select <em>C</em> as their preferred locale in the installer's language selection. More information on language coverage is available at the <url id="&url-d-i-i18n;" name="d-i languages list">.
ja: 翻訳者の多大な努力のおかげで、Debian は、テキストベースのインストールユーザインタフェースでは 47 もの言語でインストールできるようになりました。&oldreleasename; から 6 言語が増えたことになります。今回のリリースで追加された言語は、ベラルーシ語・エスペラント語・エストニア語・クルド語・マケドニア語・タガログ語・ベトナム語・ウォロフ語です。ペルシャ語とウェールズ語の翻訳は更新されなかったため、このリリースではサポートされなくなりました。<![ %g-i [ グラフィカルユーザインタフェースを使用する場合は、さらに 11 言語がサポートされています。これらの言語は、非グラフィカル環境ではフォントを表示できないため、グラフィカルインストーラ使用時のみ選択できます。]]>どのロケールも使用したくないユーザは、インストーラの言語選択メニューで <em>C</em> を選択できるようになりました。言語の網羅状況についてのさらに詳しい情報は、<url id="&url-d-i-i18n;" name="d-i 言語一覧">で閲覧可能です。
zh_cn: 感谢翻译者们的辛勤努力，若使用文字界面模式安装时，Debian 支持了 47 种语系。这比之前的 &oldreleasename; 再多出 6 种语系。新增的语系包括了白俄罗斯语、世界语、爱沙尼亚语、库尔德语、马其顿语、塔加拉语、越南语和窝罗夫语。而因为缺乏翻译的更新而在这个发行版中被废弃的语系则包括了波斯语及威尔斯语。<![ %g-i [ 如果使用的是图形界面，将会再支持额外 11 种语系。只能在该安装程序中选取这些语系是因为它们的字元集无法在非图形界面上显示。这些新增语系包含了：孟加拉语、宗卡语、古吉拉特语、印地语、乔治亚语、高棉语、马拉雅兰语、尼泊尔语、旁遮普语、淡米尔语及泰国语。]]>如果不想使用任何区域信息的用户现在可以在安装程序的语系中选择 <em>C</em> 做为偏好的区域信息。更多的语系的相关信息可以由 <url id="&url-d-i-i18n;" name="d-i 语系列表">上取得。

source: Simplified localization and timezone selection
ja: 地域化やタイムゾーンの設定が簡単に
zh_cn: 区域语系及时区选择上的简化

source: Configuration of language, countries and timezones have been simplified to reduce the amount of information needed from the user. The installer will now guess what the system's country and timezone is based on the language selected, or will provide a limited selection if it cannot. Users can still introduce obscure combinations if need be.
ja: 言語・国・タイムゾーンの設定が簡単になり、ユーザが要求される情報の量が減りました。インストーラは、どの言語が選択されたかによってシステムの国とタイムゾーンの情報を推測するようになり、推測できない場合は限られた選択肢だけを表示するようになりました。ユーザは、必要であれば国や言語の一般的でない組み合わせを選択することもできます。
zh_cn: 语系、国家和时区的设置现已经过简化以减少用户必须输入的资料次数。安装程序现在会根据所选取的语系自动判断系统的国家及时区，或是在无法判断时提供精简后的选择列表。但用户在必要时还是可以使用模糊的组合。

source: Automated installation
ja: 自動インストール
pt: Instalação automatizada
ru: Автоматизируемая установка
sv: Automatiserad installation
zh_cn: 自动安装

source: A lot of the changes mentioned in the previous section also imply changes in the support in the installer for automated installation using preconfiguration files. This means that if you have existing preconfiguration files that worked with the &oldreleasename; installer, you cannot expect these to work with the new installer without modification.
ja: 前のセクションで述べたとおりインストーラに多数の変更が加えられたので、インストーラによる、事前設定ファイルを使用した自動インストールのサポートにも変更がありました。つまり、&oldreleasename; のインストーラで動いた既存の事前設定ファイルがあっても、修正を加えずにそれが新しいインストーラで動くことは期待できません。
pt: Muitas das alterações mencionadas na secção anterior implicam também alterações no suporte ao instalador para a instalação automática utilizando ficheiros pré-configurados. Significa que não pode esperar que ficheiros pré-configurados que funcionem com o instalador da &oldreleasename; funcionem também com o novo instalador sem qualquer modificação.
ru: Множество изменений, упомянутых в предыдущем разделе, также затронули и автоматическую установку с помощью конфигурационного файла настройки. Это означает, что если у вас уже есть конфигурационные файлы настройки, которые работали с программой установки &oldreleasename;, то не ждите, что они будут работать с новой программой установки без изменений.
sv: En hel del av ändringarna som nämndes i föregående avsnitt, antyder även ändringar i installerarens stöd för automatiserade installationer med förkonfigurationsfiler. Det här betyder att om du har befintliga förkonfigurationsfiler som fungerade med installeraren för &oldreleasename;, kan du inte förvänta dig att dessa fungerar med den nya installeraren utan ändringar.
zh_cn: 在之前的章节中所提到的众多改变，其中也包含了在安装程序里利用事先准备好的设置文件来进行自动安装。这意味着，如果您手上有着用来和 &oldreleasename; 安装程序搭配使用的事先准备好的设置文件，若未经修改将难以和新的安装程序搭配使用。

source: The good news is that the <url id="&url-install-manual;" name="Installation Guide"> now has a separate appendix with extensive documentation on using preconfiguration.
ja: 幸いなことに、事前設定の使用方法に関する豊富な文書を含んだ付録が<url id="&url-install-manual;" name="インストールガイド">につけられました。
pt: As boas notícias são que o <url id="&url-install-manual;" name= "Installation Guide"> têm agora um apêndice separado com documentação extensiva sobre como utilizar a pré-configuração.
ru: В <url id="&url-install-manual;" name="руководстве по установке"> теперь есть отдельное приложение, в котором подробно описывается использование предварительной настройки.
sv: Bra nyheter är att <url id="&url-install-manual;" name="Installationsguiden"> nu har en separat bilaga med omfattande dokumentation om hur man använder förkonfiguration.
zh_cn: 好消息是，在 <url id="&url-install-manual;" name="安装指南"> 上有独立的附录，上有如何使用事先准备好的设置文件的大量信息。

source: The &releasename; installer introduces some exciting new features that allow further and easier automation of installs. It also adds support for advanced partitioning using RAID, LVM and encrypted LVM. See the documentation for details.
ja: &releasename; のインストーラには、インストールをさらに、そしてより簡単に自動化できるようにする、ワクワクするような新機能がいくつか追加されました。このインストーラは RAID や LVM、暗号化 LVM を使用した高度なパーティション分割もサポートしています。詳しくは付属文書を参照してください。
pt: O instalador da versão &releasename; introduz algumas novas funcionalidades excitantes que permitem um maior e mais fácil automatização das instalações. Adiciona também suporte para a criação de partições avançada utilizando RAID, LVM e LVM encriptada. veja a documentação para mais detalhes.
ru: В программу установки &releasename; добавлены несколько новых потрясающих возможностей, которые позволяют легко делать детальную автоматизацию установки. Также в ней поддерживается усовершенствованная разметка RAID, LVM и шифрованные LVM. Подробности смотрите в документации.
sv: Installeraren för &releasename; introducerar några nya spännande funktioner som tillåter enklare och utförligare automatisering av installationer. Den lägger även till stöd för avancerad partitionering med RAID, LVM och krypterad LVM. Se dokumentationen för detaljer.
zh_cn: &releasename; 版的安装程序也包含了一些允许更为多样且更容易进行自动安装的新奇功能。它也新支持了一些高级的硬盘分区方式，像是使用 RAID、LVM 及加密的 LVM。请参考相关文件以取得更详尽的信息。

source: New installations
ja: 新たにインストールする
nl: Een nieuwe installatie uitvoeren
pt: Novas instalações
ru: Установка новой системы
sv: Nya installationer
zh_cn: 新系统的安装

source: The Debian Installer is the official installation system for Debian. It offers a variety of installation methods. Which methods are available to install your system depends on your architecture.
ja: Debian Installer は公式の Debian インストールシステムです。このインストーラは、様々なインストール方法を提供しています。お使いのシステムにインストールするのにどの方法が利用できるかは、使っているアーキテクチャに依存します。
pt: O Instalador Debian é o sistema oficial de instalação da Debian. Oferece variados métodos de instalação. Que métodos encontram-se disponíveis para instalar no seu sistema depende da sua arquitectura.
ru: Программа установки Debian является официальной системой установки Debian. Она предлагает широкий выбор методов установки. Какие из них будут доступны на вашей системе зависит от архитектуры.
sv: Debian-installeraren är det officiella installationssystemet för Debian. Den erbjuder en uppsjö av installationsmetoder. Vilka metoder som finns tillgängliga för att installera ditt system beror på din arkitektur.
zh_cn: Debian Installer 是 Debian 的官方安装系统。它提供了多种不同的安装方式。您可以依据您硬件结构的不同而有种种不同的安装方式可供选择。

source: Images of the installer for &releasename; and the Installation Guide can be found on the <url id="&url-installer;" name="Debian website">.
ja: &releasename; 用のインストーラのイメージやインストールガイドは、<url id="&url-installer;" name="Debian のウェブサイト">にあります。
pt: As imagens do instalador para a &releasename; e o Guia de Instalação podem ser encontrados em <url id="&url-installer;" name="Debian website">.
ru: Образы программы установки для &releasename; и руководство по установке можно найти на <url id="&url-installer;" name="веб-сайте Debian">.
sv: Avbilder för installeraren för &releasename; och Installationsguiden kan hittas på <url id="&url-installer;" name="Debians webbplats">.
zh_cn: 可以在 <url id="&url-installer;" name="Debian website"> 上取得 &releasename; 的安装镜像文件及安装指南。

source: The Installation Guide is also included on the first CD/DVD of the official Debian CD/DVD sets, at:
ja: インストールガイドは、Debian 公式 CD/DVD セットの 1 枚目の CD/DVD 内の、次の場所にも含まれています。
pt: O Guia de Instalação está também incluído no primeiro CD/DVD do conjunto oficial de CD/DVDs Debian, em:
ru: Руководство по установке также включено на первый CD/DVD из официального набора Debian CD/DVD. Его можно найти в каталоге:
sv: Installationsguiden finns även inkluderad på den första cd-/dvd-skivan i de officiella Debian cd-/dvd-uppsättningarna:
zh_cn: 安装指南也同时会包含在 Debian 官方的 CD/DVD 集里的第一张 CD/DVD 的：

source: /doc/install/manual/<var>language</var>/index.html
ja: /doc/install/manual/<var>言語</var>/index.html
ru: /doc/install/manual/<var>ru</var>/index.html
sv: /doc/install/manual/<var>sv</var>/index.html

source: You may also want to check the <url id="&url-installer;index#errata" name="errata"> for debian-installer.
ja: debian-installer の<url id="&url-installer;index#errata" name="正誤表">も見ておくとよいでしょう。
pt: Pode também verificar <url id="&url-installer;index#errata" name="errata">para o debian-installer.
ru: Также следует ознакомиться со <url id="&url-installer;index#errata" name="списком известных ошибок"> программы установки.
sv: Du kanske även vill se <url id="&url-installer;index#errata" name="errata"> för debian-installer.
zh_cn: 您还可以到 <url id="&url-installer;index#errata" name="戡误表"> 上查看 debian-installer 的相关信息。

source: The installer can only be used to install on alpha systems which support the SRM console. Be sure to switch your system to SRM before starting the installation. If your machine supports only the AlphaBIOS/ARC console, you can still install &releasename; using a (minimal) &oldreleasename; installation and a subsequent upgrade. For more information about the different consoles please read the references on the <url id="http://www.debian.org/ports/alpha" name="Debian alpha port web pages">.
ja: このインストーラでは、SRM コンソールをサポートした alpha システムにしかインストールできません。インストールを始める前に、システムを SRM に切り替えるのを忘れないでください。マシンが AlphaBIOS/ARC コンソールしかサポートしていない場合も、(最小限の) &oldreleasename; をインストールしてからアップグレードすることで、 &releasename; をインストールできます。コンソールの違いに関する詳しい情報は、<url id="http://www.debian.org/ports/alpha" name="Debian alpha 移植版のウェブページ">のリファレンスを読んでください。
pt: O instalador só apenas ser utilizado para instalar em sistemas alpha que suportem a consola SRM. Certifique-se que muda o seu sistema para SRM antes de iniciar a instalação. Se a sua máquina suporta apenas a consola AlphaBIOS/ARC, poderá ainda instalar a &releasename; usando a instalação (mínima) &oldreleasename; e a consequente actualização. Para mais informação sobre as diferentes consolas por favor leia as referências em <url id="http://www.debian.org/ports/alpha" name="Debian alpha port web pages">.
ru: Программа установки может работать только на тех машинах alpha, которые поддерживают консоль SRM. Убедитесь, что вы переключили ваш компьютер на SRM до начала установки. Если ваш компьютер поддерживает только консоль AlphaBIOS/ARC, вы всё ещё можете установить &releasename;, установив сначала &oldreleasename; с минимальным набором пакетов, а затем обновив его. За более подробной информацией о различных консолях обратитесь к <url id="http://www.debian.org/ports/alpha" name="странице переноса Debian на alpha">.
sv: Installeraren kan endast användas för att installera på Alpha-system som har stöd för SRM-konsollen. Tänk på att växla över ditt system till SRM innan installationen påbörjas. Om din maskin endast har stöd för AlphaBIOS/ARC-konsollen, kan du fortfarande installera &releasename; med en (minimal) installation av &oldreleasename; och en efterföljande uppgradering. Läs referenserna på <url id="http://www.debian.org/ports/alpha" name="webbsidorna för Debian alpha-portering"> för mer information om de olika konsollerna.
zh_cn: 安装程序目前只能用于安装支持 SRM 控制台的 alpha 系统。在启动安装程序之前，请务必记得将您的系统切换至 SRM 模式。如果您的机器只支持 AlphaBIOS/ARC 控制台的话，您可以借由安装（最小的）&oldreleasename; 并随即进行升级，来达到安装 &releasename; 的目的。如果您想要知道各个控制台的更多相关信息，请阅读在 <url id="http://www.debian.org/ports/alpha" name="Debian alpha 平台移植网页"> 上的参考信息。

source: Issues with framebuffer on &arch-title;
ja: &arch-title; のフレームバッファに関する問題
nl: Aandachtspunten m.b.t. framebuffer voor &arch-title;
pt: Problemas com 'framebuffer' em &arch-title;
ru: Проблемы с framebuffer на &arch-title;
sv: Problem med framebuffer på &arch-title;
zh_cn: 在 &arch-title; 里的 framebuffer 相关问题
