Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: You can submit a bug report using the program <package>reportbug</package> or manually using email. You can read more about the Bug Tracking System and how to use it by reading the reference cards (available at <file>/usr/share/doc/debian</file> if you have <package>doc-debian</package> installed) or online at the <url id="&url-bts;" name="Bug Tracking System">.
ja: バグ報告には <package>reportbug</package> というプログラムを使うこともできますし、電子メールを使っても構いません。バグ追跡システムに関する詳細やその使い方については、リファレンスカード (<package>doc-debian</package> パッケージをインストールしていれば <file>/usr/share/doc/debian</file> にあります) をお読み頂くか、または<url id="&url-bts;" name="バグ追跡システム">のウェブサイトからオンラインで入手することもできます。
nl: U kunt een probleemrapport indienen met behulp van het programma <package>reportbug</package> of handmatig via e-mail. Nadere informatie over het Bug Tracking System en het gebruik daarvan vindt u op de referentiekaarten (beschikbaar in <file>/usr/share/doc/debian</file> als <package>doc-debian</package> is geïnstalleerd) of op de website van het <url id="&url-bts;" name="Bug Tracking System">.
pt: Pode submeter um relatório de erro usando o programa <package>reportbug</package> ou manualmente através do email. Pode ler mais sobre o Bug Tracking System e como o usar lendo os cartões de referência (disponíveis em <file>/usr/share/doc/debian</file> se tiver instalado o <package>doc-debian</package>) ou online em <url id="&url-bts;" name="Bug Tracking System">.
ru: Отправить сообщение об ошибке можно с помощью программы <package>reportbug</package> или вручную по электронной почте. Более подробную информацию о Системе отслеживания ошибок и о том, как её использовать, можно найти в каталоге <file>/usr/share/doc/debian</file> после установки пакета <package>doc-debian</package> или на сайте <url id="&url-bts;" name="Системы отслеживания ошибок">.
sv: Du kan skicka in en felrapport med programmet <package>reportbug</package> eller manuellt via e-post. Du kan läsa mer om Bug Tracking System och hur man använder det genom att läsa referenskorten (tillgängliga på <file>/usr/share/doc/debian</file> om du har <package>doc-debian</package> installerat) eller online på <url id="&url-bts;" name="Bug Tracking System">.
zh_cn: 您可以借由 <package>reportbug</package> 程序或是自行使用电子邮件来进行回报错误，您可以阅读参考卡片（如果您有安装 <package>doc-debian</package> 的话，可以在 <file>/usr/share/doc/debian</file> 里找到）或到 <url id="&url-bts;" name="错误跟踪系统"> 的在线网页取得更多如何使用错误跟踪系统及其它的相关信息。

source: Contributing to Debian
ja: Debian に貢献する
nl: Bijdragen aan Debian
pt: Contribuir para a Debian
ru: Как помочь Debian
sv: Att bidra till Debian
zh_cn: 如何对 Debian 做贡献

source: You do not need to be an expert to contribute to Debian. By assisting users with problems on the various user support <url id="&url-debian-list-archives;" name="lists"> you are contributing to the community. Identifying (and importantly solving) problems related to the development of the distribution by participating on the development <url id="&url-debian-list-archives;" name="lists"> is also extremely helpful. To maintain Debian's high quality distribution <url id="&url-bts;" name="submit bugs"> and help developers track them down and fix them. If you have a way with words then you may want to contribute more actively by helping to write <url id="&url-ddp;" name="documentation"> or <url id="&url-debian-i18n;" name="translate"> existing documentation into your own language.
ja: Debian への貢献は専門家でなくてもできます。問題を抱えたユーザを、いろいろな<url id="&url-debian-list-archives;" name="サポートメーリングリスト">の場所で助けてあげることも、立派なコミュニティへの貢献です。<url id="&url-debian-list-archives;" name="開発メーリングリスト">に参加して、ディストリビューション開発に関する問題を見つけたり解決したりする (もちろん後者のほうが大切) ことも、もちろん非常に助けになります。Debian を高品質なディストリビューションに保つため、<url id="&url-bts;" name="バグを報告して">その原因の特定や解決に際して開発者を助けてください。執筆が得意なら、<url id="&url-ddp;" name="文書">作成や既存文書のご自分の言語への<url id="&url-debian-i18n;" name="翻訳">に積極的に参加し、そこで貢献するのもよいでしょう。
nl: U hoeft geen expert te zijn om een bijdrage te kunnen leveren aan Debian. Door gebruikers te ondersteunen bij problemen op de verschillende <url id="&url-debian-list-archives;" name="mailinglijsten"> voor gebruikersondersteuning, levert u een bijdrage aan de gemeenschap. Het identificeren (of, nog beter, het oplossen) van problemen gerelateerd aan de ontwikkeling van de distributie door deelname aan de <url id="&url-debian-list-archives;" name="mailinglijsten"> gewijd aan ontwikkeling, is eveneens zeer welkom. Als u een goed taalgevoel heeft, kunt u mogelijk een meer actieve bijdrage leveren door te helpen bij het schrijven van <url id="&url-ddp;" name="documentatie"> of bij het <url id="&url-debian-i18n;" name="vertalen"> van bestaande documentatie naar uw eigen taal.
pt: Não necessita de ser um especialista para contribuir para a Debian. Assistindo outros utilizadores com problemas nos vários suportes aos utilizadores <url id="&url-debian-list-archives;" name="lists"> está a contribuir para a comunidade. Identificando (e muito importante resolvendo) problemas relacionados com o desenvolvimento da distribuição através da participação no desenvolvimento <url id="&url-debian-list-archives;" name="lists"> é também extremamente útil. Para manter a distribuição de alta qualidade Debian <url id="&url-bts;" name="submit bugs"> e ajude os 'developers' a segui-los e a os corrigir. Se tiver jeito com palavras pode contribuir mais activamente ajudando-nos a escrever <url id="&url-ddp;" name="a documentação"> ou <url id="&url-debian-i18n;" name="a traduzir"> a documentação existente no seu próprio idioma.
ru: Чтобы помочь Debian, не нужно быть большим специалистом. Помогая пользователям в решении их проблем в <url id="&url-debian-list-archives;" name="списках рассылки"> вы уже помогаете сообществу. Выявление (или, что ещё лучше, решение) проблем, связанных с разработкой дистрибутива, участие в работе <url id="&url-debian-list-archives;" name="списков для разработчиков">, также очень важно. Чтобы помочь поддерживать высокое качество Debian, <url id="&url-bts;" name="отправляйте сообщения об ошибках"> и помогайте разработчикам отслеживать и исправлять их. Если вы хорошо владеете языком, вы можете помочь в написании <url id="&url-ddp;" name="документации"> или <url id="&url-debian-i18n;" name="переводе"> существующей документации на родной язык.
sv: Du behöver inte vara en expert för att bidra till Debian. Genom att hjälpa användare med problem på de olika <url id="&url-debian-list-archives;" name="sändlistorna"> för användarstöd bidrar du till gemenskapen. Att identifiera (och lösa, viktigt nog) problem relaterade till utveckling av distributionen genom att delta i <url id="&url-debian-list-archives;" name="sändlistorna"> för utveckling är också mycket hjälpsamt. För att underhålla Debians högkvalitativa distribution <url id="&url-bts;" name="skicka in fel"> och hjälp utvecklarna att spåra upp och rätta till dem. Om du är bra på att sätta ihop ord kanske du vill bidra mer aktivt genom att hjälpa till att skriva <url id="&url-ddp;" name="dokumentation"> eller <url id="&url-debian-i18n;" name="översätta"> befintlig dokumentation till ditt eget språk.
zh_cn: 并不是只有个中高手才能对 Debian 做出贡献。当您在各个用户 <url id="&url-debian-list-archives;" name="邮件论坛"> 中协助其他用户解决问题时，您就是在对整个社群做出贡献。参与开发者 <url id="&url-debian-list-archives;" name="邮件论坛"> 以协助找出（更重要的是解决）和系统发行相关的问题对我们也有极大的帮助。为了维护 Debian 系统发行一贯的高品质，请 <url id="&url-bts;" name="报告问题">，并协助开发人员找出问题的起因以修正错误。如果您有文字方面的天份，您也可以选择借由 <url id="&url-ddp;" name="文档"> 的撰写或把现有的文档 <url id="&url-debian-i18n;" name="翻译"> 成您所使用的语言来做出更直接的贡献。

source: If you can dedicate more time, you could manage a piece of the Free Software collection within Debian. Especially helpful is if people adopt or maintain items that people have requested for inclusion within Debian, the <url id="&url-wnpp;" name="Work Needing and Prospective Packages database"> details this information. If you have an interest in specific groups then you may find enjoyment in contributing to some of Debian's subprojects which include ports to particular architectures, <url id="&url-debian-jr;" name="Debian Jr."> and <url id="&url-debian-med;" name="Debian Med">.
ja: もっと時間が自由になるなら、Debian に属するフリーソフトウェア集の一部を管理してみるのはどうでしょうか。皆が Debian に入れてほしいと思っているソフトウェアを引き受けて管理するのは、特に価値の高い貢献です。これに関する詳細は、<url id="&url-wnpp;" name="作業が望まれるパッケージ">をご覧になってください。Debian にはいくつかサブプロジェクトが存在しており、特定のアーキテクチャへの移植、<url id="&url-debian-jr;" name="Debian Jr.">、<url id="&url-debian-med;" name="Debian Med"> などが進められています。これらのうち、あなたが興味を持っているグループに参加するのもよいでしょう。
pt: Se pode dedicar mais tempo, pode gerir uma peça da colecção de Software Livre dentro da Debian. Especialmente útil para nós é a adopção ou manutenção de items requeridos por pessoas para inclusão da Debian, o <url id="&url-wnpp;" name="Work Needing and Prospective Packages database"> detalha esta informação. Se possui interesse em grupos específicos então pode achar agradável a contribuição em alguns sub-projectos Debian que incluem 'ports' para arquitecturas particulares, <url id="&url-debian-jr;" name="Debian Jr."> e <url id="&url-debian-med;" name="Debian Med">.
ru: Если вы можете уделить Debian больше времени, можно взяться за сопровождение какой-нибудь свободной программы в Debian. В частности, полезной была бы поддержка пакетов, которые кто-то особенно хотел бы видеть в Debian. Подробную информацию можно найти на странице <url id="&url-wnpp;" name="требующих доработки и планируемых пакетов">. Если вам интересна какая-то специфическая группа пользователей, возможно, вы захотите участвовать в одном из дочерних проектов Debian. Среди них перенос Debian на другие архитектуры, проекты <url id="&url-debian-jr;" name="Debian для детей"> и <url id="&url-debian-med;" name="Debian в медицине">.
sv: Om du kan avsätta mer tid, skulle du kunna ansvara för en del av den fria programvarusamlingen i Debian. Speciellt behjälpligt är det om personer adopterar eller ansvarar för saker som folk har frågat efter om att läggas in i Debian. Databasen <url id="&url-wnpp;" name="Work Needing and Prospective Packages"> har detaljer om den här informationen. Om du har intresse av mer specifika grupper kan du finna glädje i att bidra till några av Debians underprojekt vilka inkluderar porteringar till specifika arkitekturer, <url id="&url-debian-jr;" name="Debian Jr."> och <url id="&url-debian-med;" name="Debian Med">.
zh_cn: 如果您能投注更多的时间的话，您可以负责维护 Debian 中一部分的自由软件。如果您能够接续或维护其他用户希望 Debian 所能提供的软件的话就更好了，您可以在 <url id="&url-wnpp;" name="亟需人手以及受到期待的软件包数据库 (WNPP)"> 中取得相关的信息。如果您的兴趣是集中在特别的领域之中，那您可能会想要参加像是某个特定硬件平台的系统移植、<url id="&url-debian-jr;" name="小小 Debian">，以及 <url id="&url-debian-med;" name="Debian Med"> 之类在 Debian 中的子计划。

source: In any case, if you are working in the free software community in any way, as a user, programmer, writer or translator you are already helping the free software effort. Contributing is rewarding and fun, and as well as allowing you to meet new people it gives you that warm fuzzy feeling inside.
ja: いずれにしても、あなたが何らかの形でフリーソフトウェアコミュニティに関わっているのなら、それがユーザとしてであれ、プログラマ、ライター、翻訳者のいずれとしてであれ、すでにあなたはフリーソフトウェア運動を助けてくださっているのです。貢献することは報いのあることですし、楽しいことです。新しい人々に出会う機会も増えます。きっと暖かな、楽しい気持ちになれるはずです。
nl: Hoe dan ook, als u, op wat voor manier dan ook (als gebruiker, ontwikkelaar, schrijver of vertaler) werk verzet binnen de Vrije Software gemeenschap, helpt u de Vrije Software beweging. Het leveren van een bijdrage geeft voldoening en is leuk en, doordat het u de gelegenheid biedt om nieuwe mensen ontmoeten, geeft het van binnen dat onbepaalde, warme gevoel.
pt: Em todo o caso, se estiver a trabalhar na comunidade de software livre de alguma maneira, como utilizador, programador, escritor ou tradutor, está realmente a ajudar o esforço de software livre. A contribuição é recompensadora e divertida, assim como lhe permite conhecer novas pessoas dando-lhe aquela estranha sensação quente por dentro.
ru: В любом случае, если вы участвуете в работе сообщества Свободного ПО в качестве пользователя, программиста, писателя или переводчика, вы уже помогаете Свободному программному обеспечению. Такое участие приносит удовольствие и радость, даёт возможность познакомиться с новыми людьми.
sv: I vilket fall som helst, om du arbetar i den fria programvarugemenskapen på något sätt, som en användare, programmerare, författare eller översättare hjälper du redan den fria programvaran. Att bidra är belönande och roligt, såväl som att det låter dig träffa nya människor som att det ger dig den där varma känslan inom dig.
zh_cn: 不论如何，只要您以任何的方式参加了自由软件社群的活动，不管是身为用户、程序员、作者、还是译者，您就已经对自由软件的群体努力做出贡献了。贡献本身就是一件非常有益而有趣的事情，除了能让您不断地遇见新的伙伴之外，也能让您的心中充满了温暖的感觉。

source: Managing your &oldreleasename; system
ja: &oldreleasename; システムの管理
nl: Beheer van uw &oldreleasename; systeem
pt: Gerir o seu sistema &oldreleasename;
ru: Управление системой &oldreleasename;
sv: Hantera ditt &oldreleasename;-system
zh_cn: 管理您的 &oldreleasename; 系统

source: This appendix contains information on how to make sure you can install or upgrade &oldreleasename; packages before you upgrade to &releasename;. This should only be necessary in specific situations.
ja: この付録には、&releasename; へアップグレードする前に &oldreleasename; パッケージを確実にインストールしたりアップグレードする方法についての情報が述べられています。特定の状況でのみ必要となるでしょう。
nl: Deze bijlage bevat informatie over hoe u zich ervan kunt verzekeren dat u &oldreleasename; pakketten kunt installeren of opwaarderen voordat u naar &releasename; migreert. Dit is slechts in enkele specifieke situaties nodig.
pt: Este apêndice contém informação sobre como ter a certeza que pode instalar e actualizar os pacotes da &oldreleasename; antes que actualize para a &releasename;. Deverá ser apenas necessário em situações específicas.
ru: В этом приложении содержится информация о том, как установить или обновить пакеты &oldreleasename; перед обновлением до &releasename;. В некоторых случаях это может понадобиться.
sv: Detta appendix innehåller information om hur du kontrollerar att du kan installera eller uppgradera paket från &oldreleasename; innan du uppgraderar till &releasename;. Det här bör endast vara nödvändigt i specifika situationer.
zh_cn: 这个附录包含了在您升级至 &releasename; 之前，如何让您能够顺利地安装或更新 &oldreleasename; 软件包的相关说明。这只有在某些特殊状况之下才会有这个需求。

source: Upgrading your &oldreleasename; system
ja: &oldreleasename; システムのアップグレード
nl: Uw &oldreleasename; systeem opwaarderen
pt: Actualizar o seu sistema &oldreleasename;
ru: Обновление системы &oldreleasename;
sv: Uppgradera ditt &oldreleasename;-system
zh_cn: 更新您的 &oldreleasename; 系统

source: Basically this is no different than any other upgrade of &oldreleasename; you've been doing. The only difference is that you first need to make sure your package list still contains &oldreleasename; packages as explained in <ref id="old-sources">.
ja: 基本的には、これまで行なってきた &oldreleasename; のあらゆるアップグレードと違いはありません。唯一異なるのは、<ref id="old-sources">で説明したようにパッケージリスト内に &oldreleasename; パッケージがまだ含まれているのを確認する必要があることです。
nl: In principe is dit niet anders dan een willekeurige andere opwaardering van &oldreleasename;. Het enige verschil is dat u er eerst voor moet zorgen dat uw pakkettendatabase nog steeds &oldreleasename; pakketten bevat. Instructies hiervoor vindt u in <ref id="old-sources">.
pt: Basicamente não é diferente de outra actualização da &oldreleasename; o que tem vindo a fazer. A única diferença é que primeiro necessita de se certificar que a sua lista de pacotes ainda contém os pacotes &oldreleasename; como explicado em <ref id="old-sources">.
ru: В основном это обновление ничем не отличается от всех предыдущих обновлений &oldreleasename;, которые вы делали. Единственное отличие состоит в том, что сначала надо убедиться, что ваши списки пакетов всё ещё содержат пакеты &oldreleasename;, как описано в разделе <ref id="old-sources">.
sv: Det är inga grundläggande skillnader mot någon annan uppgradering av &oldreleasename; som du gjort. Den enda skillnaden är att du först behöver se till att din paketlista fortfarande innehåller paket från &oldreleasename; vilket förklarades i <ref id="old-sources">.
zh_cn: 基本上，这和您所进行过的 &oldreleasename; 的升级并没有什么不同。唯一的不同是您必须先确认您的软件包列表是否还是包含了 &oldreleasename; 的软件包，请参考在 <ref id="old-sources"> 里的说明。

source: You should upgrade to the latest &oldreleasename; point release: r5, published February 2007.
ja: 最新の &oldreleasename; ポイントリリース、つまり 2007 年 2 月に公開された r5 にアップグレードすべきです。
zh_cn: 您至少应该升级至最新的 &oldreleasename; 释出版本：r5，于 2007 二月发布。

source: Checking your sources list
ja: ソースリストのチェック
nl: De lijst met bronnen voor APT controleren
pt: Verificar a sua lista de fontes
ru: Проверка списка источников APT
sv: Kontrollera dina källistor
zh_cn: 检查您的来源列表

source: If any of the lines in your <file>/etc/apt/sources.list</file> refer to 'stable', you are effectively already "using" &releasename;. If you have already run <tt>apt-get update</tt>, you can still get back without problems following the procedure below.
ja: <file>/etc/apt/sources.list</file> 内で 'stable' を指定している行があるなら、効率よく &releasename; を "使う" 用意ができています。すでに <tt>apt-get update</tt> を実行済みでも、以下の手順に従えば問題なく元に戻すことができます。
nl: Als er regels voorkomen in uw <file>/etc/apt/sources.list</file> die verwijzen naar 'stable', dan maakt u effectief al "gebruik" van &releasename;. Indien u het commando <tt>apt-get update</tt> al heeft uitgevoerd, is het met onderstaande procedure probleemloos mogelijk om terug te gaan.
pt: Se alguma das linhas do seu <file>/etc/apt/sources.list</file> se refere a 'stable', está efectivamente a "usar" a &releasename;. Se já correu <tt>apt-get update</tt>, pode ainda voltar atrás sem problemas seguindo o procedimento abaixo indicado.
ru: Если одна или несколько записей в вашем <file>/etc/apt/sources.list</file> ссылаются на стабильный дистрибутив ('stable'), то вы уже "используете" &releasename;. Если вы уже запустили <tt>apt-get update</tt>, то ещё не поздно всё отменить, просто выполнив инструкцию, приведённую ниже.
sv: Om någon av raderna i din <file>/etc/apt/sources.list</file> refererar till "stable", använder du faktiskt redan &releasename;. Om du redan har kört <tt>apt-get update</tt>, kan du fortfarande komma tillbaka utan problem om du följer nedanstående procedur.
zh_cn: 如果在您的 <file>/etc/apt/sources.list</file> 中有任何的项目是参照至 'stable' 的话，您可能在实际上已经在 "使用" &releasename; 了。如果您已执行了 <tt>apt-get update</tt> 的话，您还是可以轻易得回到原始的状态，只要您遵照以下的指示即可。

source: If you have also already installed packages from &releasename;, there probably is not much point in installing packages from &oldreleasename; anymore. In that case you will have to decide for yourself whether you want to continue or not. It is possible to downgrade packages, but that is not covered here.
ja: &releasename; からパッケージのインストールもしてしまっているなら、おそらくこれ以上 &oldreleasename; からパッケージをインストールしても無意味でしょう。この場合、続けるかどうかを自分で決断しなければなりません。パッケージをダウングレードすることはできますが、その方法はここでは扱いません。
nl: Als u echter ook al pakketten uit &releasename; heeft geïnstalleerd, dan heeft het waarschijnlijk weinig zin om nog pakketten uit &oldreleasename; te installeren. In dat geval zult u zelf moeten beslissen of u wilt doorgaan of niet. Het is mogelijk om pakketten terug te zetten naar hun &oldreleasename;, maar dat valt buiten de scope van dit document.
pt: Se já instalou pacotes da &releasename;, então provavelmente não fará muito sentido a instalação de pacotes da &oldreleasename;. Neste caso terá que decidir se quer continuar ou não. É possível baixar de versão nos pacotes, mas este aspecto não é coberto aqui.
ru: Если вы успели установить пакеты из &releasename;, то особого смысла в установке пакетов из &oldreleasename; уже нет. В этом случае вам следует решить - довести до конца обновление или нет. Вернуться к использованию старых версий пакетов возможно, но эта процедура выходит за рамки данного документа.
sv: Om du även har installerat paket från &releasename;, är det antagligen inte så stor mening att installera paket från &oldreleasename; längre. I det fallet måste du bestämma dig om du vill fortsätta eller inte. Det är möjligt att nedgradera paket, men det beskrivs inte här.
zh_cn: 如果您已经安装了来自 &releasename; 的软件包，那么再安装来自 &oldreleasename; 的软件包就已经没有太多意义了。在此状况之下，您应该要自行决定是否要继续进行。进行软件包的降级并不是不可能的事，但是在此并没有针对这个加以说明。

source: Open the file <file>/etc/apt/sources.list</file> with your favorite editor (as root) and check all lines beginning with <tt>deb http:</tt> or <tt>deb ftp:</tt> for a reference to "<tt>stable</tt>". If you find any, change <tt>stable</tt> to <tt>&oldreleasename;</tt>.
ja: (root になってから) お気に入りのエディタで <file>/etc/apt/sources.list</file> を開き、<tt>deb http:</tt> や <tt>deb ftp:</tt> で始まるすべて行の中に "<tt>stable</tt>" が指定されているかどうかを調べてください。もしあるなら、<tt>stable</tt> を <tt>&oldreleasename;</tt> に変更してください。
nl: Open (als root) het bestand <file>/etc/apt/sources.list</file> met uw favoriete tekstverwerker en controleer alle regels die beginnen met <tt>deb http:</tt> of <tt>deb ftp:</tt> op verwijzigingen naar "<tt>stable</tt>". Vervang in deze regels <tt>stable</tt> door <tt>&oldreleasename;</tt>.
pt: Abra o ficheiro <file>/etc/apt/sources.list</file> com seu editor favorito (como root) e verifique todas as linhas que iniciam por <tt>deb http:</tt> ou <tt>deb ftp:</tt> que referenciem a "<tt>stable</tt>". Se encontrar alguma altere de <tt>stable</tt> para <tt>&oldreleasename;</tt>.
ru: Откройте файл <file>/etc/apt/sources.list</file> с помощью любого текстового редактора (потребуются привилегии суперпользователя). Во всех строках, начинающихся с <tt>deb http:</tt> или с <tt>deb ftp:</tt> замените "<tt>stable</tt>" на "<tt>&oldreleasename;</tt>".
sv: Öppna filen <file>/etc/apt/sources.list</file> med din favoritredigerare (som root) och kontrollera alla rader som börjar med <tt>deb http:</tt> eller <tt>deb ftp:</tt> efter en referens till "<tt>stable</tt>". Om du hittar någon, ändra <tt>stable</tt> till <tt>&oldreleasename;</tt>.
zh_cn: 使用您惯用的编辑器，以 root 的身份开启 <file>/etc/apt/sources.list</file> 这个文件，然后检查所有以 <tt>deb http:</tt> 或 <tt>deb ftp:</tt> 开头的项目，看看是否有参照至 "<tt>stable</tt>"。如果有的话，将其中的 <tt>stable</tt> 改为 <tt>&oldreleasename;</tt>。

source: If you have any lines starting with <tt>deb file:</tt>, you will have to check for yourself if the location they refer to contains a &oldreleasename; or a &releasename; archive.
ja: <tt>deb file:</tt> で始まっている行があるなら、その行が指定している場所が &oldreleasename; か &releasename; のどちらのアーカイブなのかを独力で調べなければならないでしょう。
nl: Voor regels die beginnen met <tt>deb file:</tt> zult u zelf moeten controleren of de locatie waarnaar zij verwijzen een &oldreleasename; of een &releasename; archief bevat.
pt: Se tiver algumas linhas que iniciam por <tt>deb file:</tt>, terá que verificar se o local para onde se referem contém o arquivo &oldreleasename; ou &releasename;.
ru: Если вы нашли строки, начинающиеся с <tt>deb file:</tt>, то вам придётся самим проверить, какие пакеты хранятся в указанном каталоге - из &oldreleasename; или из &releasename;.
sv: Om du har några rader som börjar med <tt>deb file:</tt>, måste du själv kontrollera om platsen som de refererar till innehåller en &oldreleasename; eller ett arkiv för &releasename;.
zh_cn: 如果您有任何项目是以 <tt>deb file:</tt> 开头的，您必须自行检查这些项目所提供的是 &oldreleasename; 还是 &releasename; 的存档。
