Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: </author>, <author> <firstname>Osamu</firstname> <surname>Aoki</surname>
ja: </author>, <author> <firstname>修</firstname> <surname>青木</surname>
ml: </author>, <author> <firstname>ഒസാമു</firstname> <surname>അവോക്കി</surname>

source: </author>, <author> <firstname>Peter</firstname> <surname>Green</surname>
ja: </author>, <author lang="en"> <firstname>Peter</firstname> <surname>Green</surname>
ml: </author>, <author> <firstname>പീറ്റര്‍</firstname> <surname>ഗ്രീന്‍</surname>

source: kernel version note
ja: カーネルバージョンメモ
ml: കെര്‍ണല്‍ പതിപ്പിന്റെ കുറിപ്പു്

source: </author>, <author> <firstname>Rob</firstname> <surname>Bradford</surname>
ja: </author>, <author lang="en"> <firstname>Rob</firstname> <surname>Bradford</surname>
ml: </author>, <author> <firstname>റോബ്</firstname> <surname>ബ്രാഡ്ഫോര്‍ഡ്</surname>

source: </author>, <author> <firstname>Samuel</firstname> <surname>Thibault</surname>
ja: </author>, <author lang="en"> <firstname>Samuel</firstname> <surname>Thibault</surname>
ml: </author>, <author> <firstname>സാമുവല്‍</firstname> <surname>തിബാള്‍ട്ട്</surname>

source: description of d-i Braille support
ja: d-i 点字サポートの解説
ml: ഡി-ഐ ബ്രൈലി പിന്തുണയെക്കുറിച്ചുള്ള വിവരണം

source: </author>, <author> <firstname>Simon</firstname> <surname>Bienlein</surname>
ja: </author>, <author lang="en"> <firstname>Simon</firstname> <surname>Bienlein</surname>
ml: </author>, <author> <firstname>സൈമണ്‍</firstname> <surname>ബിയന്‍ലൈന്‍</surname>

source: </author>, <author> <firstname>Simon</firstname> <surname>Paillard</surname>
ja: </author>, <author lang="en"> <firstname>Simon</firstname> <surname>Paillard</surname>
ml: </author>, <author> <firstname>സൈമണ്‍</firstname> <surname>പൈലാര്‍ഡ്</surname>

source: </author>, <author> <firstname>Stefan</firstname> <surname>Fritsch</surname>
ja: </author>, <author lang="en"> <firstname>Stefan</firstname> <surname>Fritsch</surname>
ml: </author>, <author> <firstname>സ്റ്റീഫന്‍</firstname> <surname>ഫ്രിഷ്</surname>

source: description of Apache issues
ja: Apache 問題の解説
ml: അപ്പാച്ചെ പ്രശ്നങ്ങളെക്കുറിച്ചുള്ള വിവരണം

source: </author>, <author> <firstname>Steve</firstname> <surname>Langasek</surname>
ja: </author>, <author lang="en"> <firstname>Steve</firstname> <surname>Langasek</surname>
ml: </author>, <author> <firstname>സ്റ്റീവ്</firstname> <surname>ലംഗാസേക്</surname>

source: </author>, <author> <firstname>Tobias</firstname> <surname>Scherer</surname>
ja: </author>, <author lang="en"> <firstname>Tobias</firstname> <surname>Scherer</surname>
ml: </author> <author> <firstname>ടോബിയാസ്</firstname> <surname>ഷെറര്‍</surname>

source: description of "proposed-update"
ja: "proposed-update" の解説
ml: "proposed-update" നെക്കുറിച്ചുള്ള വിവരണം

source: </author>, <author> <firstname>Vincent</firstname> <surname>McIntyre</surname>
ja: </author>, <author lang="en"> <firstname>Vincent</firstname> <surname>McIntyre</surname>
ml: </author>, <author> <firstname>വിന്‍സെന്റ്</firstname> <surname>മക്കിന്റയര്‍</surname>

source: </author>, and <author> <firstname>W. Martin</firstname> <surname>Borgert</surname>
ja: </author>, <author lang="en"> <firstname>W. Martin</firstname> <surname>Borgert</surname>
ml: </author>, <author> <firstname>ഡബ്ലിയു. മാര്‍ട്ടിന്‍</firstname> <surname>ബോര്‍ഗെര്‍ട്ട്</surname>

source: editing Lenny release, switch to DocBook XML
ja: Lenny リリースノートの編集、DocBook XML への変換
ml: ലെന്നി പതിപ്പു് തിരുത്തുന്നു, ഡോക്ക്ബുക്ക് എക്സ്‌എംഎല്ലിലേയ്ക്കുള്ള മാറ്റം

source: This document has been translated into many languages. Many thanks to the translators!
ja: この文書はたくさんの言語に翻訳されています。翻訳者に大きな感謝を捧げます!</para><para>日本語への翻訳は以下の方が行いました。<author> <surname>やまね</surname> <firstname>ひでき</firstname> <contrib>日本語訳(全般)</contrib> </author><author> <surname>今井</surname> <firstname>伸広</firstname> <contrib>日本語訳(issues.po)</contrib> </author><author> <surname>倉澤</surname> <firstname>望</firstname> <contrib>日本語訳(upgrading.po)</contrib> </author><author> <surname>倉敷</surname> <firstname>悟</firstname> <contrib>統括, 日本語訳(upgrading.po)</contrib> </author><author> <surname>佐々木</surname> <firstname>洋平</firstname> <contrib>日本語訳({about, installing, moreinfo,old-stuff, release-notes}.po)</contrib> </author><author> <surname>吉野</surname> <firstname>与志仁</firstname> <contrib>日本語訳(whats-new.po)</contrib> </author>
ml: </para><para>മലയാളത്തിലേയ്ക്കു് പരിഭാഷ ചെയ്തതു്: <author> <firstname>മണിലാല്‍</firstname> <surname>കെഎം</surname> <contrib>upgrading.po പരിഭാഷപ്പെടുത്തി</contrib> </author>, <author> <firstname>പ്രവീണ്‍</firstname> <surname>അരിമ്പ്രത്തൊടിയില്‍</surname> <contrib>about.po, whats-new.po, release-notes.poപരിഭാഷപ്പെടുത്തി, മറ്റു് പരിഭാഷകള്‍ തിരുത്താനും ഡെബിയനില്‍ ചേര്‍ക്കാനും മുന്‍കൈയെടുത്തു</contrib> </author>, <author> <firstname>പ്രവീണ്‍</firstname> <surname>പി</surname> <contrib>installing.po, upgrading.po പരിഭാഷപ്പെടുത്തി</contrib> </author>, <author> <firstname>ശങ്കരനാരായണന്‍</firstname> <surname></surname> <contrib>installing.po, issues.po, release-notes.po പരിഭാഷപ്പെടുത്തി</contrib> </author>, <author> <firstname>ശ്യാം</firstname> <surname>കൃഷ്ണന്‍</surname> <contrib>moreinfo.po പരിഭാഷപ്പെടുത്തി</contrib> </author>

source: ACPI
ml: ഏസിപിഐ

source: Advanced Configuration and Power Interface
ml: ആധുനികവല്‍‌ക്കരിച്ച ക്രമീകരണവും ഊര്‍ജ്ജ വിനിമയതലവും

source: ALSA
ml: അല്‍സാ

source: Advanced Linux Sound Architecture
ml: ആധുനികവല്‍ക്കരിച്ച ലിനക്സ് ശബ്ദ ശില്‍പ്പകല

source: APM
ml: ഏപിഎം

source: Advanced Power Management
ml: ആധുനികവല്‍ക്കരിച്ച ഊര്‍ജ്ജഭരണം

source: CD
ml: സിഡി

source: Compact Disc
ja: コンパクトディスク
ml: കോമ്പാക്റ്റ് ഡിസ്ക്

source: CD-ROM
ml: സിഡി-റോം

source: Compact Disc Read Only Memory
ml: കോമ്പാക്റ്റ് ഡിസ്ക് റീഡ് ഒണ്‍ലി മെമ്മറി

source: DHCP
ml: ഡിഎച്ച്സിപി

source: Dynamic Host Configuration Protocol
ml: ഡൈനാമിക് ഹോസ്റ്റ് ക്രമീകരണ നിയമാവലി

source: DNS
ml: ഡി‌എന്‍എസ്

source: Domain Name System
ja: ドメインネームシステム
ml: ഡൊമൈന്‍ നാമ സിസ്റ്റം

source: DVD
ml: ഡിവിഡി

source: Digital Versatile Disc
ja: デジタルバーサタイルディスク
ml: ഡിജിറ്റല്‍ വേഴ്സറ്റൈല്‍ ഡിസ്ക്

source: GIMP
ml: ജിമ്പ്

source: GNU Image Manipulation Program
ml: ഗ്നൂ ഛായാ കൈകാര്യ പരിപാടി

source: GNU
ml: ഗ്നു

source: GNU's Not Unix
ja: GNU は Unix ではない (GNU's Not Unix)
ml: ഗ്നു യൂനിക്സല്ല

source: GPG
ml: ജിപിജി

source: GNU Privacy Guard
ml: ഗ്നു പ്രൈവസി ഗാര്‍ഡ്

source: IDE
ml: ഐഡി‌ഈ

source: Integrated Drive Electronics
ml: സംയോജിത ഡ്രൈവ് എലക്ട്രോണികം

source: LDAP
ml: എല്‍ഡാപ്

source: Lightweight Directory Access Protocol
ml: ലൈറ്റ്‌വെയ്റ്റ് ഡയറക്റ്ററി സമീപന നിയമാവലി

source: LILO
ml: ലിലൊ

source: LInux LOader
ml: ലീനക്സ് കയറ്റുന്നവന്‍

source: LSB
ml: എല്‍എസ്ബി

source: LVM
ml: എല്‍വിഎം

source: Logical Volume Manager
ja: 論理ボリュームマネージャ (Logical Volume Manager)
ml: ലോജിക്കല്‍ വാള്യം കാര്യസ്ഥന്‍

source: MTA
ml: എം‌ടിഏ

source: Mail Transport Agent
ja: メール転送エージェント (Mail Transport Agent)
ml: തപാല്‍ ഗതാഗത ഏജന്റ്

source: NFS
ml: എന്‍എഫ്‌എസ്

source: Network File System
ja: ネットワークファイルシステム
ml: ശൃംഖലാ ഫയല്‍ വ്യ‌വസ്ഥ

source: NIC
ml: എന്‍ഐ‌സി

source: Network Interface Card
ja: ネットワークインターフェースカード
ml: ശൃംഖല വിനിമയതല കാര്‍ഡ്

source: NIS
ml: എന്‍ഐഎസ്

source: Network Information Service
ja: ネットワークインフォメーションサービス
ml: ശൃംഖലാ അറിയിപ്പ് സേവനം

source: OSS
ml: ഓ‌എസ്‌എസ്

source: Open Sound System
ml: സ്വതന്ത്ര ശബ്ദ സംവിധാനം

source: RAID
ml: റൈഡ്

source: Redundant Array of Independent Disks
ml: വളരെയധികം സ്വതന്ത്രഡിസ്ക്കുകളുടെ നിര

source: RPC
ml: ആര്‍പിസി

source: Remote Procedure Call
ja: リモートプロシージャコール
ml: റിമോട്ട് പ്രൊസീജറല്‍ കാള്‍

source: SATA
ml: സാറ്റാ

source: Serial Advanced Technology Attachment
ml: ആധുനിക സീരിയല്‍ സാങ്കേതികതയുടെ കൂട്ടുകെട്ട്

source: USB
ml: യുഎസ്ബി

source: Universal Serial Bus
ja: ユニバーサルシリアルバス (Universal Serial Bus)
ml: ആഗോള സീരിയല്‍ ബസ്

source: UUID
ml: യുയുഐഡി

source: Universally Unique Identifier
ja: 汎用一意識別子 (Universally Unique Identifier)
ml: പ്രപഞ്ചത്തിലെ സമാനതകളില്ലാത്ത തിരിച്ചറിയല്‍ ഉപാധി

source: VGA
ml: വിജിഏ

source: Video Graphics Array
ml: ചലനചിത്രങ്ങളുടെ ഗ്രാഫിക്സ് നിര

source: WPA
ml: ഡബ്ലിയു‌പി‌ഏ

source: Wi-Fi Protected Access
ml: വൈ-ഫി സംരക്ഷിത സമീപനം

source: February 4th, 2011
ja: 2011 年 2 月 4 日

source: The license text can also be found at <ulink url="http://www.gnu.org/licenses/gpl-2.0.html"/> and <filename>/usr/share/common-licenses/GPL-2</filename> on &debian;.
ja: この許諾文書は <ulink url="http://www.gnu.org/licenses/gpl-2.0.html"/> や、&debian; の <filename>/usr/share/common-licenses/GPL-2</filename> にあります。

source: previous releases
ja: 以前のリリース

source: Lenny installation
ja: Lenny インストール

source: previous release (Etch)
ja: 以前のリリース (Etch)

source: previous release (Etch), Squeeze release
ja: 以前のリリース (Etch), Squeeze リリース

source: </author>, <author> <firstname>Justin B</firstname> <surname> Rye</surname>
ja: </author>, <author lang="en"> <firstname>Justin B</firstname> <surname> Rye</surname>

source: </author>, <author> <firstname>Steve</firstname> <surname>McIntyre</surname>
ja: </author>, <author lang="en"> <firstname>Steve</firstname> <surname>McIntyre</surname>

source: Debian CDs
ja: Debian CD

source: Blu-ray Disc
ja: Blu-ray ディスク

source: Secure Sockets Layer
ja: セキュアソケットレイヤー (Secure Sockets Layer)

source: Transport Layer Security
ja: トランスポートレイヤーセキュリティー (Transport Layer Security)
