Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: Release Notes for &debian; &release; ("&releasename;"), &arch-title;
ja: &debian; &release; ("&releasename;") リリースノート (&arch-title; 用)
pt: Notas do lançamento do &debian; &release; ("&releasename;"), &arch-title;
ru: Информация о выпуске &debian; &release; ("&releasename;") для архитектуры &arch-title;
zh_cn: &debian; &release; ("&releasename;"), &arch-title; 的发行注记

source: <name>Josip Rodin, Bob Hilliard, Adam Di Carlo, Anne Bezemer, Rob Bradford (current), Frans Pop (current), Andreas Barth (current)</name><email></email>
ja: <name>Josip Rodin, Bob Hilliard, Adam Di Carlo, Anne Bezemer, Rob Bradford (現在のメンテナ), Frans Pop (現在のメンテナ), Andreas Barth (現在のメンテナ)</name><email></email>
pt: <name>Josip Rodin, Bob Hilliard, Adam Di Carlo, Anne Bezemer, Rob Bradford (actual), Frans Pop (actual), Andreas Barth (actual)</name><email></email>
ru: <name>Josip Rodin, Bob Hilliard, Adam Di Carlo, Anne Bezemer, Rob Bradford (текущее издание), Frans Pop (текущее издание) Andreas Barth (текущее издание)</name><email></email>
sv: <name>Josip Rodin, Bob Hilliard, Adam Di Carlo, Anne Bezemer, Rob Bradford (nuvarande), Frans Pop (nuvarande), Andreas Barth (nuvarande)</name><email></email>
zh_cn: <name>Josip Rodin, Bob Hilliard, Adam Di Carlo, Anne Bezemer, Rob Bradford (现职), Frans Pop (现职), Andreas Barth (现职)</name><email></email>

source: Introduction
ja: はじめに
pt: Introdução
ru: Введение
sv: Introduktion
zh_cn: 引言

source: The primary goals of these Release Notes are to inform users of major changes in this release of the Debian distribution, to provide information on how to upgrade safely from the previous to the this release and finally to inform users of known potential issues users could encounter when upgrading to or using the release.
ja: 本リリースノートの主要な目的は、Debian ディストリビューションのこのリリースにおける主要な変更点、以前のリリースから今回のリリースに安全にアップグレードする方法、そして今回のリリースにアップグレードする際や今回のリリースを使用する際にユーザが遭遇する可能性がある既知の問題点について、情報をユーザに提供することです。
pt: Os objectivos primários destas Notas de Lançamento são a informação dos utilizadores sobre as maiores alterações no lançamento desta distribuição Debian, fornecer informação sobre como actualizar de modo seguro a partir da versão anterior para esta, e finalmente, informar os utilizadores dos potenciais problemas que poderão encontrar aquando a actualização da versão ou durante a sua utilização.
ru: Основной целью информации о выпуске является информирование пользователей об основных изменениях в этом выпуске дистрибутива Debian, о том, как безопасно обновиться с предыдущей версии и, наконец, сообщить пользователям об известных потенциальных проблемах, с которыми они могут столкнуться при обновлении или использовании выпуска.
sv: De primära målen för dessa Kommentarer till utgåvan är att informera användare om större ändringar i denna utgåva av Debian-utgåvan, för att tillhandahålla information om hur man uppgraderar på ett säkert sätt från den tidigare till denna utgåva och till slut att informera användare om kända tänkbara problem som användare kan påträffa vid uppgradering till eller användning av utgåvan.
zh_cn: 这些发行注记的主要目的是用来让用户知道在这个 Debian 发行版本中的主要变化，提供一些如何方能平稳得由旧有版本升级至本发行版本的信息，并在文末提供给用户一些在升级或使用本发行版本时可能会遭遇到的已知问题。

source: Note that it is impossible to list every known issue and that therefore a selection has been made based on a combination of the expected prevalence and impact of issues.
ja: 既知の問題点をすべてリストアップすることは不可能なので、問題点の予想される広がり具合と影響の大きさの両方に基づいて取捨選択していることに注意してください。
pt: Repare que é impossível listar todos os problemas conhecidos, deste modo uma selecção foi feita baseada na combinação da frequência e impacto desses problemas.
ru: Заметим, что здесь невозможно перечислить все известные проблемы и поэтому были выбраны только те, которые, как ожидается, могут возникнуть у большинства, и которые оказывают наибольшее влияние в целом.
sv: Observera att det är omöjligt att lista alla kända problem och därför har ett urval gjorts baserat på en kombination av den allmänna förekomsten och problemets inverkan.
zh_cn: 请注意到，要列出所有的已知问题是不可能的。因此，这些都是在经过筛选之后，被认为是普遍存在且重大的问题。

source: The most recent version of this document is always available at <url id="&url-release-notes;">. If your version is more than a month old, you might wish to download the latest version.
ja: この文書の最新版は常に <url id="&url-release-notes;"> から入手可能です。お手元のバージョンが 1 ヵ月以上前のものでしたら、最新版をダウンロードしたほうがよいでしょう。
pt: A versão mais recente deste documento está sempre disponível em <url id="&url-release-notes;">. Se a sua versão tiver mais que um mês, talvez queira fazer o download da última versão.
ru: С последней версией этого документа всегда можно ознакомиться по адресу <url id="&url-release-notes;">. Если ваша версия выпущена больше месяца назад, стоит загрузить более новую.
zh_cn: 这份文件的最新版本可于 <url id="&url-release-notes;"> 取得。如果在您手上的已经是一个月以前的版本的话，您可能就要考虑下载新的版本了。

source: Please note that we only support and document upgrading from the previous release of Debian (in this case, the upgrade from &oldreleasename;). If you need to upgrade from older releases, we suggest you read previous editions of the release notes.
ja: この文書では、Debian の 1 つ前のリリースからのアップグレード (この場合、&oldreleasename; からのアップグレード) のみがサポート・記述されていることに注意してください。さらに古いリリースからのアップグレードが必要な場合は、過去のリリースノートを読むことをお勧めします。
pt: Por favor note que apenas suportamos e documentamos a actualização a partir do lançamento anterior de Debian (neste caso, a actualização a partir de &oldreleasename;). Se necessitar actualizar a partir de lançamentos mais antigos sugerimos-lhe que leia as edições anteriores das notas de lançamento.
ru: Обратите внимание, что теперь поддерживается и описывается только обновление с предыдущего выпуска Debian. (то есть этот документ описывает обновление с &oldreleasename;). Если вам требуется обновить систему с более старого выпуска, обратитесь к ранним редакциям этого документа.
sv: Observera att vi endast ger stöd för och dokumenterar uppgraderingen från den tidigare utgåvan av Debian (i det här fallet, uppgradering från &oldreleasename;). Om du behöver uppgradera från äldre utgåvor föreslår vi att du läser tidigare versioner av kommentarerna för utgåvan.
zh_cn: 请注意到，在此只会提供及记述从上一个 Debian 发行版本进行升级的信息。（也就是说，由 &oldreleasename; 进行升级）。如果您必须从更为早期的发行版进行升级的话，我们建议您能参阅旧有的发行注记。

source: Reporting bugs on this document
ja: この文書に関するバグを報告する

source: We have attempted to test all the different upgrade steps described in this document and we have also tried to anticipate all the possible issues our users might encounter.
ja: 筆者たちは、この文書で説明されているすべての異なるアップグレード手順を試し、また、発生する可能性がありユーザが直面するかもしれないすべての問題も予想しようとしました。

source: Nevertheless, If you think you have found any bug in this documentation (incorrect information or information that is missing), please file a bug in the <url id="&url-bts;" name="bug tracking system"> against the <package>release-notes</package> package.
ja: そうはいっても、この文書にバグ (不正確な情報や抜け落ちている情報) を見つけたと思う場合は、<package>release-notes</package> パッケージに対するバグ報告を<url id="&url-bts;" name="バグ追跡システム">に提出してください。

source: Contributing upgrade reports
ja: アップグレードについての報告をする

source: We welcome any information from users related to upgrades from &oldreleasename; to &releasename;. If you are willing to share information please file a bug in the <url id="&url-bts;" name="bug tracking system"> against the <package>upgrade-reports</package> package with your results.
ja: &oldreleasename; から &releasename; へのアップグレードに関連するユーザからの情報はどんなものでも歓迎します。情報を共有するのを厭わない場合は、<package>upgrade-reports</package> パッケージに対するバグ報告にアップグレードの結果を含めて <url id="&url-bts;" name="バグ追跡システム">に提出してください。

source: Please provide the following information when submitting your upgrade report:
ja: アップグレードについての報告を提出する際には、以下の情報を提供してください。

source: Session logs using <package>script</package>, as described in <ref id="record_session">.
ja: <package>script</package> を使用してとったセッションのログ (<ref id="record_session"> で説明します)。

source: The status of your package database before and after the upgrade, using the backup procedure described at <ref id="backup">.
ja: アップグレード前後のパッケージデータベースの状態 (<ref id="backup"> で説明するバックアップ手順で取得できます)。

source: Your aptitude logs, available at <file>/var/log/aptitude</file>.
ja: aptitude のログ (<file>/var/log/aptitude</file> にあります)。

source: Note: you should take some time to review and remove any sensitive and/or confidential information from the logs before including them in a bug report as the information will be published in a public database.
ja: 注意: バグ報告に情報を含める前に少し時間をかけてログに機密情報が含まれていないか検査し、機密情報を見つけた場合はそれをログから削除してください。というのも、バグ報告に含まれる情報は公開データベースで公表されるからです。

source: Sources for this document
ja: この文書のソース

source: This document uses <package>debiandocsgml</package>. Its sources are available in the <em>Debian Documentation Project</em>'s CVS. You can use the <url id="&url-cvs-release-notes;" name="web interface"> to access its files individually through the web and see their changes. For more information on how to access the CVS please consult the <url id="&url-ddp-cvs-info;" name="Debian Documentation Project CVS pages">.
ja: この文書は <package>debiandoc-sgml</package> を使用しています。また文書のソースは <em>Debian ドキュメンテーションプロジェクト (Debian Documentation Project)</em> の CVS にあります。ウェブから<url id="&url-cvs-release-notes;" name="ウェブインタフェース">を使って個々のファイルにアクセスでき、変更を参照できます。CVS へのアクセス方法に関してさらに詳しく知りたい場合は、<url id="&url-ddp-cvs-info;" name="『Debian ドキュメンテーションプロジェクトの CVS』のページ">を参照してください。

source: What's new in &debian; &release;
ja: &debian; &release; の最新情報
nl: Nieuw in &debian; &release;
pt: Novidades na &debian; &release;
ru: Что нового в &debian; &release;
sv: Vad är nytt i &debian; &release;
zh_cn: 在 &debian; &release; 中有什么新增功能

source: This release adds official support for the AMD64 architecture which supports 64-bit processors from both Intel (EM64T) and AMD (AMD64). During the previous release, &debian; 3.1 ('sarge'), an unofficial version of this port was available. Upgrading from this unofficial version should be possible using these Release Notes, but is not supported.
ja: このリリースでは、Intel (EM64T) および AMD (AMD64) 双方の 64 ビットプロセッサをサポートした、AMD64 アーキテクチャのサポートが公式に追加されています。前のリリース &debian; 3.1 ('sarge') では、この移植の非公式版が利用可能でした。この非公式版からのアップグレードは、本リリースノートを参照すれば可能なはずですが、サポートはされていません。
pt: Este lançamento adiciona suporte oficial à arquitectura AMD64 que suporta os processadores 64-bit tanto da Intel (EM64T) como da AMD (AMD64). Durante o lançamento anterior, &debian; 3.1 ('sarge'), esteve disponível uma versão não oficial deste 'port'. A actualização a partir desta versão não oficial deverá ser possível, utilizando estas Notas de Lançamento, mas não é suportada.
ru: В этот выпуск добавлена официальная поддержка архитектуры AMD64, в которую входят 64-битные процессоры Intel (EM64T) и AMD (AMD64). Для предыдущего выпуска &debian; 3.1 ('sarge') была доступна неофициальная версия переноса. Обновление с неофициальной версии возможно с помощью этой информации о выпуске, но официально оно не поддерживается.
sv: Den här utgåvan har officiellt stöd för AMD64-arkitekturen vilken har stöd för 64-bitars processorer från både Intel (EM64t) och AMD (AMD64). Den tidigare utgåvan, &debian; 3.1 ("sarge"), hade en inofficiell version tillgänglig av den här porteringen. Uppgradering från den här inofficiella versionen ska vara möjlig med hjälp av dessa kommentarer till utgåvan, men stöds inte.
zh_cn: 在这个发行版中新增了对 AMD64 平台的官方支持，也就是支持了由 Intel (EM64T) 及 AMD (AMD64) 所提供 64 位的处理器。在上一个发行版 &debian; 3.1 ('sarge') 中则仅对此提供了非官方版本。由这个发行注记来从这个非官方版本进行升级是可行的，但并不支持。

source: Official support for the Motorola 680x0 ('m68k') architecture has been dropped because it did not meet the criteria set by the Debian Release Managers. The most important underlying reasons are performance and limited upstream support for essential toolchain components. However, the m68k port is expected to remain active and available for installation even if not a part of this official stable release.
ja: Debian リリースマネージャが課した条件を満たせなかったので、Motorola 680x0 ('m68k') アーキテクチャは公式にはサポートされなくなりました。最も大きな理由は、パフォーマンスの問題と必須ツールチェインコンポーネントの開発元でのサポートが限られたものだったことです。しかし、公式な安定版リリースの一部ではないとはいえ、m68k 移植版はまだ動作し、引き続きインストールが可能だと思われます。
pt: O suporte oficial para a arquitectura Motorola 680x0 ('m68k') foi abandonado pois não correspondia aos critérios definidos pelos Debian Release Managers. As razões que tiveram maior peso foram a performance e o limitado suporte upstream a componentes 'toolchain' essenciais. No entanto, é esperado que o 'port' m68k se mantenha activo e disponível para instalação, mesmo que não seja parte deste lançamento oficial da versão estável.
ru: Официальная поддержка архитектуры Motorola 680x0 ('m68k') прекращена, так как перестала удовлетворять критериям, установленным менеджерами выпуска Debian. Наиболее значимыми причинами являются производительность и ограниченная поддержка со стороны разработчиков компонент, необходимых для пересборки (toolchain). Однако, перенос m68k предполагается оставить активным и он будет доступен для установки, даже если не войдёт в состав официального стабильного выпуска.
sv: Officiellt stöd för arkitekturen Motorola 680x0 ("m68k") har uteslutits på grund av att det inte mötte kriterierna som ställts av Debians utgåveansvariga. De viktigaste underliggande anledningarna var prestanda och begränsat stöd för viktiga komponenter. Dock förväntas m68k-porteringen att kvarstå som aktiv och finnas tillgänglig för installation även om den inte är en del av den här officiella stabila utgåvan.
zh_cn: 对于 Motorola 680x0 ('m68k') 平台的官方支持已经停止，因为它无法达到 Debian Release Managers 所设置的标准。而最根本的潜在原因是一些基本工具元件的效能及极为有限的原厂支持。然而，即使它无法列入官方稳定发行版，m68k 平台移植还是会继续存在且可取得以进行安装。

source: The following are the officially supported architectures for &debian; &releasename;:
ja: &debian; &releasename; で公式にサポートされているアーキテクチャは以下のとおりです。
pt: Seguem-se as arquitecturas suportadas oficialmente pela &debian; &releasename;:
ru: Cписок официально поддерживаемых архитектур для &debian; &releasename;:
sv: Följande arkitekturer stöds officiellt av &debian; &releasename;:
zh_cn: 以下是 &debian; &releasename; 官方所支持的硬件平台：

source: MIPS ('mips' (Big endian) and 'mipsel' (Little endian))
ja: MIPS ('mips' (ビッグエンディアン) と 'mipsel' (リトルエンディアン))
pt: MIPS ('mips' (Big endian) e 'mipsel' (Little endian))
ru: MIPS ('mips' (Big endian) и 'mipsel' (Little endian))
sv: MIPS ("mips" (Big endian) och "mipsel" (Little endian))
zh_cn: MIPS ('mips' (Big endian) 及 'mipsel' (Little endian))

source: You can read more about port status, and port-specific information for your architecture at the <url id="&url-ports;" name="Debian port web pages">.
ja: 移植状況の詳細や、お使いの移植版に特有の情報については、<url id="&url-ports;" name="Debian の移植版に関するページ">で読むことができます。
nl: U kunt aanvullende informatie over de status van 'ports', en specifieke informatie over de 'port' voor uw platform op de <url id="&url-ports;" name="Debian port web pages">.
pt: Pode obter mais informação sobre o estado do 'port', bem como informação mais especifica para a sua arquitectura em <url id="&url-ports;" name="Debian port web pages">.
ru: Более подробную информацию о переносе на различные архитектуры и сведения, относящиеся к конкретным переносам, вы можете получить на <url id="&url-ports;" name="странице переносов Debian">.
sv: Du kan läsa mer om porteringsstatus och porteringsspecifik information för din arkitektur på <url id="&url-ports;" name="Debians webbsidor för porteringar">.
zh_cn: 您可以在 <url id="&url-ports;" name="Debian 硬件结构网页"> 中取得更多关于各个平台移植的情况，以及针对移植至您的硬件平台的相关信息。

source: This is only the second official release of &debian; for the &arch-title; architecture. We feel that it has proven itself sufficiently to be released. However, because it has not had the exposure (and hence testing by users) that our releases on other architectures have had, you may encounter a few bugs. Please use our <url id="&url-bts;" name="bug tracking system"> to report any problems; make sure to mention the fact that the bug is on the &architecture; platform.
ja: これは &arch-title; アーキテクチャ用 &debian; のまだ 2 回目の公式リリースです。すでにリリースするには十分安定している、と私たちは考えていますが、他のアーキテクチャ版のいくつかほどはまだ広く使われていない (つまりユーザによるテストも多くない) ことから、いくつかのバグにでくわす可能性もあります。何か問題が起きたら、<url id="&url-bts;" name="バグ追跡システム">を使って報告してください。その際、そのバグが &arch-title; プラットフォーム上のものであることを必ず書き添えてください。
pt: Este é apenas o segundo lançamento oficial do &debian; para a arquitectura &arch-title;. Sentimos que teve já suficientes provas para ser lançada. No entanto, como não teve ainda a exposição (e como tal testada pelos utilizadores) que outras arquitecturas tiveram, pode encontrar alguns 'bugs'. Por favor utilize o nosso link <url id="&url-bts;" name="bug tracking system"> para reportar quaisquer problemas; certifique-se que menciona o facto de o 'bug' se encontrar na plataforma &architecture;.
ru: Это лишь второй официальный выпуск &debian; для архитектуры &arch-title;. Мы считаем, что он проверен в достаточной мере, чтобы быть выпущен. Однако, поскольку тестировался он всё же меньше, чем другие выпуски на других архитектурах, вы можете обнаружить в нём ошибки. Пожалуйста, сообщайте нам о любых проблемах через <url id="&url-bts;" name="Систему отслеживания ошибок">, обязательно отметив при этом, что ошибка наблюдается на платформе &architecture;.
sv: Det här är bara den andra officiella utgåvan av &debian; för arkitekturen &arch-title;. Vi känner att den har visat sig tillräckligt bra för att ges ut. Dock har den inte fått samma exponering (och testning av användare) som våra utgåvor för andra arkitekturer har haft, kan du påträffa ett antal fel. Använd vårat <url id="&url-bts;" name="felhanteringssystem"> för att rapportera eventuella problem; tänk på att nämna att felet finns på &architecture;-plattformen.
zh_cn: 虽然这仅仅是 &debian; 在 &arch-title; 平台上的第二次正式发行，但我们觉得系统本身已经证明了它已达到了可公开发行的水平。然而，因为它从来没有像其他平台上的发行版那么的知名，那么的能被用户大量测试，所以您还是可能会遭遇到一些问题。请利用我们的 <url id="&url-bts;" name="错误跟踪系统"> 来回报您所发现的任何问题；在报告中请不要忘了提及您是在 &architecture; 平台上发现这个错误的。

source: &debian; &release; for the &arch-title; architecture ships with kernel version &kernelversion;.
ja: &arch-title; アーキテクチャ用 &debian; &release; でのデフォルトのカーネルのバージョンは &kernelversion; です。
nl: &debian; &release; voor het &arch-title; platform wordt geleverd met kernelversie &kernelversion;.
pt: A &debian; &release; para a arquitectura &arch-title; vem com a versão &kernelversion; do kernel.
ru: В дистрибутив &debian; &release; для архитектуры &arch-title; включено ядро версии &kernelversion;.
sv: &debian; &release; för arkitekturen &arch-title; levereras med kärnversionen &kernelversion;.
zh_cn: 在 &arch-title; 平台上的 &debian; &release; 发行版所使用的内核版本为 &kernelversion;。

source: What's new in the distribution?
ja: ディストリビューションの最新情報
nl: Nieuw in de distributie
pt: O que há de novo na distribuição?
ru: Что нового в дистрибутиве?
sv: Vad är nytt i distributionen?
zh_cn: 在这次的发行版本中有什么新变化？

source: This new release of Debian again comes with a lot more software than its predecessor &oldreleasename;; the distribution includes over 6200 new packages. Most of the software in the distribution has been updated: over 10500 software packages (this is 67% of all packages in &oldreleasename;). Also, a significant number of packages (over 3400, 22% of the packages in &oldreleasename;) have for various reasons been removed from the distribution. You will not see any updates for these packages and they will be marked as 'obsolete' in package management front-ends.
ja: Debian のこの新しいリリースには、一つ前のリリースである &oldreleasename; に付属していたよりさらに多くのソフトウェアが付属しています。このディストリビューションには、6200 以上の新しいパッケージが含まれているのです。ディストリビューション中のほとんどのソフトウェア、すなわち約 10500 ものソフトウェアパッケージ (これは &oldreleasename; のパッケージ全体の 67% にあたります) が更新されました。また、かなりの数のパッケージ (&oldreleasename; のパッケージの 22% にあたる 3400 以上) が、様々な理由でディストリビューションから取り除かれました。これらのパッケージについては更新されておらず、パッケージ管理用のフロントエンドでは 'obsolete' というマークが付けられます。
zh_cn: 比起之前的 &oldreleasename;，新的 Debian 发行版再度收集了更多的软件；在这次的发行版本里包含了超过 6200 个新软件包，且大部份的软件都被更新了（接近 10500 个软件包，大约占了 &oldreleasename; 的软件包数量的 67%）。当然啰，因为种种的原因，也有不少的软件（超过 3400 个，大约占了 &oldreleasename; 的软件包数量的 22%）在这次的发行版本里被移除掉了。您会发觉到这些软件包的版本已不再更新，并且在软件包的管理界面里它们会被标记为 '废弃(obsolete)' 软件包。

source: With this release &debian; switches from XFree86 to the 7.1 release of X.Org, which includes support for a greater range of hardware and better autodetection. This allows the use of Compiz, which is one of the first compositing window managers for the X Window System, taking full advantage of hardware OpenGL-acceleration for supported devices.
ja: このリリースで &debian; は、XFree86 から X.Org の 7.1 リリースに移行しました。より広い範囲のハードウェアがサポートされ、自動認識もよりよいものになっています。この移行によって X Window System 用で初めてのコンポジティングウィンドウマネージャの一つである Compiz が使えるようになり、サポートされているデバイスではハードウェア OpenGL アクセラレーションを充分に活用できます。
pt: Com este lançamento, o &debian; passa do XFree86 para a versão 7.1 do XOrg, que inclui suporte a uma gama mais alargada de hardware e melhoria na auto-detecção. É assim permitido o uso do Compiz, um dos primeiros gestores de composição de janelas para o X Window System, permitindo tirar vantagem da aceleração de hardware OpenGL para dispositivos suportados.
ru: В этом выпуске &debian; был осуществлён переход с XFree86 на XOrg 7.1, который обеспечивает поддержку более широкого спектра аппаратного обеспечения и лучшее автоопределение устройств. Теперь можно использовать Compiz, один из первых compositing window managers для X Window System, что позволит воспользоваться преимуществами аппаратного OpenGL-ускорения в поддерживающих его устройствах.
sv: Den här utgåvan av &debian; byter från XFree86 till 7.1-utgåvan av X.Org, vilken inkluderar stöd för ett större urval av hårdvara och förbättrad automatisk identifiering. Det här tillåter användningen av Compiz, som är en av de första fönsterhanterarna för kompositering för X Window System vilket drar full nytta av OpenGL-accelereringen i hårdvaran för de enheter som stöds.
zh_cn: 从 &debian; 这个发行版本开始，已由 XFree86 转换为支持了更多的硬件及更佳的自动探测的 X.Org 7.1 版了。它可以使用 Compiz 这个第一个能够在被支持的设备上充份利用硬件 OpenGL 加速的 X Window System 复合式窗口管理程序。

source: &debian; again ships with several desktop applications and environments. Amongst others it now includes the desktop environments GNOME 2.14<footnote><p>With some modules from GNOME 2.16</p></footnote>, KDE 3.5.5a, and Xfce 4.4. Productivity applications have also been upgraded, including the office suites OpenOffice.org 2.0.4a and KOffice 1.6 as well as GNUcash 2.0.5, GNUmeric 1.6.3 and Abiword 2.4.6
ja: 今回も &debian; にはいくつかのデスクトップアプリケーションやデスクトップ環境が含まれています。特に、GNOME 2.14<footnote><p>一部のモジュールは GNOME 2.16 のものです。</p></footnote>、KDE 3.5.5a、Xfce 4.4 などがあります。生産的なアプリケーションもアップグレードされました。オフィススイートの OpenOffice.org 2.0.4a や KOffice 1.6、それに GNUcash 2.0.5、GNUmeric 1.6.3、Abiword 2.4.6 などです。

source: Updates to other desktop applications include the upgrade of Evolution 2.6.3 and Gaim 2.0. The Mozilla suite has also been updated but the main programs have been renamed: <prgn>iceweasel</prgn> (version 2.0.0.2) is the unbranded <prgn>Firefox</prgn> web browser and <prgn>icedove</prgn> (version 1.5) is the unbranded <prgn>Thunderbird</prgn> mail client.
ja: 他のデスクトップアプリケーションも更新されました。Evolution 2.6.3 や Gaim 2.0 などです。Mozilla スイートも更新されましたが、主要なプログラムの名前が変わりました。<prgn>iceweasel</prgn> (バージョン 2.0.0.2) は商標なしの <prgn>Firefox</prgn> ウェブブラウザで、<prgn>icedove</prgn> (バージョン 1.5) は商標なしの <prgn>Thunderbird</prgn> メールクライアントです。
zh_cn: 其它的桌面应用程序也被更新了，包含了更新为 Evolution 2.6.3 及 Gaim 2.0。Mozilla 组合也被更新了，但主要程序已更名：<prgn>iceweasel</prgn>（2.0.0.2 版）是无商标的 <prgn>Firefox</prgn> 网页浏览器，<prgn>icedove</prgn>（1.5 版）则为无商标的 <prgn>Thunderbird</prgn> 邮件客户端。

source: This release also includes, amongst others, the following software updates:
ja: またこのリリースには、特に挙げるなら、以下のソフトウェアの更新も含まれています。
zh_cn: 在此发行版中也包含了以下的软件更新

source: the GNU C library, version 2.3.6.
ja: GNU C ライブラリのバージョン 2.3.6。
zh_cn: GNU C 函数库，2.3.6 版。

source: the GNU Compiler Collection 4.1 as default compiler.
ja: GNU Compiler Collection 4.1 (デフォルトのコンパイラ)。
zh_cn: 将 GNU Compiler Collection 4.1 做为默认的编译器。

source: Language interpreters: PHP 5.5, Python 2.4.
ja: インタープリタ言語: PHP 5.5、Python 2.4。
zh_cn: 直译语言：PHP 5.5、Python 2.4。

source: Server software:
ja: サーバソフトウェア:
zh_cn: 服务器软件：
