Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: If you changed and recompiled a package locally, and didn't rename it or put an epoch in the version, you must put it on hold to prevent it from being upgraded.
ja: パッケージをローカルで変更したり再コンパイルしており、パッケージの名前を変えたりバージョン番号に epoch フィールドを追加していないなら、アップグレードしないよう hold 状態にしておかなければなりません。
pt: Se alterar e recompilar localmente um pacote e não o renomear ou colocar numa versão modificada, terá que o bloquear para prevenir que o mesmo seja alterado.
ru: Если вы изменили и перекомпилировали пакет локально, но при этом не переименовали его и не добавили "эпоху" к версии пакета, то его нужно зафиксировать, чтобы предотвратить обновление.
sv: Om du ändrat och byggt om ett paket lokalt, och inte bytte namn på det eller la in ett datum i versionen, måste du hålla tillbaka det för att förhindra att det uppgraderas.
zh_cn: 如果您自行在系统中变更并重新编译了某个软件包，但却没有将其更名或在版本号码中使用 epoch（自行定义版本号码），那您就必须把它设置为保留状态，以防止它被升级到新的版本。

source: The "hold" package state for <prgn>aptitude</prgn> can be changed using (replace <tt>hold</tt> with <tt>unhold</tt> to unset the "hold" state):
ja: パッケージの "hold" 状態を <prgn>aptitude</prgn> で変更するには、以下のように実行してください ("hold" 状態を解除するには <tt>hold</tt> を <tt>unhold</tt> で置き換えます):
pt: O estado bloqueado "hold" do pacote para o <prgn>aptitude</prgn> pode ser alterado utilizando (substitua <tt>hold</tt> por <tt>unhold</tt> para remover o estado bloqueado "hold"):
ru: Состояние фиксации пакета ("hold") для <prgn>aptitude</prgn> может быть изменено с помощью (замените <tt>hold</tt> на <tt>unhold</tt>, чтобы сбросить состояние "hold"):
sv: Pakettillståndet "hold" för <prgn>aptitude</prgn> kan ändras med (ersätt <tt>hold</tt> med <tt>unhold</tt> för att ändra "hold"-tillståndet):
zh_cn: 若想更改那些在 <prgn>aptitude</prgn> 里被保留住的软件包的状态（将 <tt>hold</tt> 以 <tt>unhold</tt> 取代来消除保留状态），请使用：

source: If there is anything you need to fix, it is best to make sure your <file>sources.list</file> still refers to &oldreleasename; as explained in <ref id="old-sources">.
ja: 修正が必要なことがあるなら、<ref id="old-sources">で説明されているように <file>sources.list</file> が &oldreleasename; を指定したままにしておくべきです。
nl: Als er iets is dat hersteld moet worden, is het aan te raden om eerst te verifiëren dat de regels in uw <file>sources.list</file> nog altijd verwijzen naar &oldreleasename;. Instructies hiervoor vindt u in <ref id="old-sources">.
pt: Se existe alguma coisa que necessita de corrigir, o melhor é certificar-se que o seu ficheiro <file>sources.list</file> continua a apontar para a versão &oldreleasename; como é explicado em <ref id="old-sources">.
ru: Если вам надо что-то изменить, то лучше сначала убедиться, что ваш <file>sources.list</file> всё ещё ссылается на &oldreleasename;, как объясняется в разделе <ref id="old-sources">.
sv: Om det är någonting du behöver rätta till, är det bäst att se till att din <file>sources.list</file> fortfarande refererar till &oldreleasename; vilket förklaras i <ref id="old-sources">.
zh_cn: 如果还有什么地方尚待修正，最好再次确认您的 <file>sources.list</file> 仍然是指向 &oldreleasename;。请参考 <ref id="old-sources"> 里的说明。

source: Unofficial sources and backports
ja: 非公式なソースとバックポート
nl: Niet officiële bronnen en "backports"
pt: Fontes não oficiais e 'backports'
ru: Неофициальные источники и адаптации (backports)
sv: Inofficiella källor och bakåtporteringar
zh_cn: 非官方的源及 backports

source: If you have any non-Debian packages on your system, you should be aware that these may be removed during the upgrade because of conflicting dependencies. If these packages were installed by adding an extra package archive in your <file>/etc/apt/sources.list</file>, you should check if that archive also offers packages compiled for &releasename; and change the source line accordingly at the same time as your source lines for Debian packages.
ja: 自分のシステムに非 Debian パッケージがあるなら、依存関係の衝突のためアップグレード中に削除されるかもしれないことに注意すべきです。当該パッケージが <file>/etc/apt/sources.list</file> に特別なパッケージアーカイブを追加することでインストールされたのなら、そのアーカイブが &releasename; 用にコンパイルされたパッケージも提供しているかをチェックし、Debian パッケージ用のソース行と一緒にそのソース行も適切に修正すべきです。
nl: Als u niet-Debian pakketten op uw systeem heeft, dient u zich ervan bewust te zijn dat het mogelijk is dat deze tijdens de migratie worden verwijderd vanwege conflicterende afhankelijkheden. Als deze pakketten zijn geïnstalleerd door het opnemen van een extra archief als bron in uw <file>/etc/apt/sources.list</file>, dan kunt u het beste nagaan of dat archief ook pakketten beschikbaar heeft die zijn gecompileerd voor &releasename;. Als dat het geval is dient u de regel voor die bron op hetzelfde moment aan te passen als de regels voor Debian pakketten.
pt: Se possuir pacotes não-Debian no seu sistema, deverá saber que estes podem ser removidos durante a actualização, devido a conflito de dependências. Se estes pacotes foram instalados adicionando um arquivo de pacotes extra ao seu <file>/etc/apt/sources.list</file>, deverá verificar se aquele arquivo também oferece pacotes compilados para a versão &releasename; e altere a linha da fonte de acordo com o mesmo tipo de linhas de fontes para os pacotes Debian.
ru: Если вы установили пакеты не из Debian, то знайте, что при обновлении они могут быть удалены по причине конфликтующих зависимостей. Если при установке пакетов вы добавляли записи в файл <file>/etc/apt/sources.list</file>, то стоит проверить, что этот источник содержит пакеты, скомпилированные для &releasename; и соответственно исправить строку источника вместе со строками остальных источников.
sv: Om du har några icke-Debianpaket på ditt system, bör du tänk på att dessa kan tas bort under uppgraderingen på grund av beroendekonflikter. Om dessa paket blev installerade genom att lägga till extra paketarkiv i din <file>/etc/apt/sources.list</file>, bör du kontrollera om det arkivet även erbjuder paket som är byggda för &releasename; och ändra källraden på lämpligt sätt samtidigt som dina källrader för Debian-paket.
zh_cn: 如果在您的系统里安装了不是由 Debian 所提供的软件包，您必须要知道，在升级的过程中它们可能会因为依赖性的关系而被移除掉。如果这些软件包是先在 <file>/etc/apt/sources.list</file> 新增了额外的软件包档案库然后再加以安装的，您应该检查一下那个档案库是否也提供了特别为 &releasename; 而编译的软件包，在替 Debian 变更软件包来源时也同时适当得修改这些软件包的来源项目。

source: Some users may have unofficial backported "newer" versions of packages that <em>are</em> in Debian installed on their &oldreleasename; system. Such packages are most likely to cause problems during an upgrade as they may result in file conflicts<footnote><p>Debian's package management system normally does not allow a package to remove or replace a file owned by another package; not unless it has been defined to replace that package.</p></footnote>. Section <ref id="trouble"> has some information on how to deal with file conflicts if they should occur.
ja: 自分の &oldreleasename; システムに、Debian に<em>存在する</em>パッケージの 非公式にバックポートされた "新" バージョンをインストールしているユーザもいるでしょう。そのようなパッケージはファイルの衝突を引き起こすことにより、アップグレード中に問題を引き起こす場合がほとんどでしょう<footnote><p>Debian のパッケージ管理システムは、対象パッケージを置き換えるように指定されていない限り、通常はあるパッケージが別のパッケージが所有しているファイルを削除したり置き換えることを許可しません</p></footnote>。ファイル衝突が発生したときの対処方法については、<ref id="trouble">にいくつかの情報があります。
nl: Sommige gebruikers hebben op hun &oldreleasename; systeem nieuwere versies (zogenaamde "backports") geïnstalleerd van pakketten die <em>wel</em> onderdeel uitmaken van Debian. De kans dat dergelijke pakketten problemen veroorzaken tijdens de opwaardering is relatief groot, voornamelijk door bestandsconflicten<footnote><p>Het systeem voor pakketbeheer in Debian laat normaalgesproken niet toe dat een pakket een bestand dat behoort tot een ander pakket verwijdert of vervangt, tenzij expliciet gedefinieerd is dat het dit andere pakket vervangt.</p></footnote>. In paragraaf <ref id="trouble"> vindt u informatie over hoe eventuele bestandsconflicten kunnen worden opgelost.
ru: Некоторые пользователи установили более новые пакеты Debian, адаптированные для &oldreleasename; (backports). Такие пакеты, скорее всего, станут причиной проблем при обновлении, так как они могут вызвать конфликты файлов<footnote><p>Обычно система управления пакетами Debian не позволяет пакету удалить или заменить файл, принадлежащий другому пакету, за исключением случаев, когда один пакет заменяет другой.</p></footnote>. В разделе <ref id="trouble"> описано, как бороться с конфликтами файлов, если они возникнут.
sv: Vissa användare kan ha inofficiella bakåtporterade "nyare" versioner av paket som <em>finns</em> i Debian installerade på sina &oldreleasename;-system. Sådana paket kommer med stor sannolikhet att orsaka problem under en uppgradering eftersom de kan resultera i filkonflikter<footnote><p>Debians pakethanteringssystem tillåter normalt sett inte ett paket att ta bort eller ersätta en fil som ägs av ett annat paket; såvida det inte har definierats att ersätta det paketet.</p></footnote>. Avsnittet <ref id="trouble"> innehåller lite information om hur man hanterar filkonflikter om de skulle inträffa.

source: Preparing sources for APT
ja: APT の取得先 (ソース) の準備
nl: Bronnen voor APT voorbereiden
pt: Preparar as fontes para o APT
ru: Подготовка источников APT
sv: Förbered källor för APT
zh_cn: APT 来源的准备工作

source: Before starting the upgrade you must set up <package>apt</package>'s configuration file for package lists, <file>/etc/apt/sources.list</file>.
ja: アップグレードを始める前に、<package>apt</package> の設定ファイル <file>/etc/apt/sources.list</file> を編集して、パッケージの取得先を決める必要があります。
nl: Voordat u start met de migratie, dient u het configuratiebestand voor pakketlijsten van <package>apt</package>, <file>/etc/apt/sources.list</file>, te configureren.
pt: Antes de iniciar a actualização deverá configurar o ficheiro de configuração do <package>apt</package> para listas de pacotes, <file>/etc/apt/sources.list</file>.
ru: Перед началом процесса обновления вы должны настроить файл конфигурации <package>apt</package> <file>/etc/apt/sources.list</file>.
sv: Innan du påbörjar uppgraderingen måste du redigera konfigurationsfilen för paketlistor i <package>apt</package>, <file>/etc/apt/sources.list</file>.
zh_cn: 在开始进行升级之前，您必须先在 <package>apt</package> 的设置 <file>/etc/apt/sources.list</file> 中设置软件包列表。

source: <package>apt</package> will consider all packages that can be found via any "<tt>deb</tt>" line, and install the package with the highest version number, giving priority to the first mentioned lines (that way, in case of multiple mirror locations, you'd typically first name a local harddisk, then CD-ROMs, and then HTTP/FTP mirrors).
ja: <package>apt</package> は、"<tt>deb</tt>" 行にあるすべてのパッケージを見比べ、最も大きなバージョン番号のパッケージをインストールします。同じパッケージが取得可能な場合は、先に現れた行を優先します (つまり、複数のミラーを指定している場合は、最初にローカルのハードディスクを、次に CD-ROM を、最後に HTTP/FTP ミラーを指定するといいでしょう)。
nl: <package>apt</package> zal alle pakketten, die gevonden kunnen worden via een "<tt>deb</tt>"-regel, in beschouwing nemen en zal het pakket met het hoogste versienummer installeren. Hierbij krijgen de als eerste genoemde bronnen prioriteit (als u dus meerdere bronnen beschikbaar heeft, zal u normaalgesproken als eerste bijvoorbeeld een lokale harde schijf, vervolgens een CD en tenslotte HTTP/FTP-spiegelservers opnemen).
pt: O <package>apt</package> irá considerar todos os pacotes que podem ser encontrados através de qualquer linha "<tt>deb</tt>", e instalará o pacote com o número de versão mais elevado, dando prioridade às primeiras linhas mencionadas (deste modo, em caso de múltiplos locais de 'mirrors', tipicamente deverá ter primeiro um disco local, depois CD-ROMs e então 'mirrors' HTTP/FTP).
ru: Программа <package>apt</package> при запросе на установку пакета установит наивысшую версию пакета из тех, которые можно найти в источниках, соответствующих строкам <tt>deb</tt> этого файла. При равных версиях приоритет будут иметь строки, находящиеся в файле выше (таким образом, в случае использования нескольких зеркал обычно лучше первым указать каталог на локальном жёстком диске, затем компакт-диск и, наконец, зеркала HTTP/FTP).
sv: <package>Apt</package> kommer att anse att alla paket som kan hittas via någon "<tt>deb</tt>"-rad, och installera paketet med högsta versionsnumret, där prioritet ges till de förstnämnda raderna (på så sätt, om det är så att flera speglar, skulle du vanligtvis först namnge en lokal hårddisk, sedan cd-skivor, och sedan HTTP/FTP-speglar).
zh_cn: <package>apt</package> 会把所有可以在 "<tt>deb</tt>" 行中找到的软件包全数列入考虑，并安装其中版本号码最高的软件包，且会依序由列出的来源中取得软件包。（也因此，当您是由许多不同位置来取得软件包时，您可以让系统依先由本机硬盘，接下来是由光盘片，然后是远程 HTTP/FTP 的顺序来取得软件包）

source: A release can often be referred to by both its codename (e.g. &oldreleasename;, &releasename;) and by its status name (i.e. oldstable, stable, testing, unstable). Referring to a release by its codename has the advantage that you will never be surprised by a new release and for this reason is the approach taken here. It does of course mean that you will have to watch out for release announcements yourself. If you use the status name instead, you will just see loads of updates for packages available as soon as a release has happened.
ja: リリースを指定するのに、コードネーム (&oldreleasename; や &releasename;) と状態名 (旧安定版・安定版・テスト版・不安定版) のどちらもよく使用されます。コードネームによる指定は、新しいリリースが出たときに驚かずに済むという利点があるため、ここではコードネームを使用しています。当然ですが、コードネームを使用している場合は自分でリリースアナウンスに注意を払わなければいけません。代わりに状態名を使用している場合は、リリースの直後にパッケージの更新が大量に利用可能になったことに気づくでしょう。
nl: Vaak is het mogelijk om naar een release te verwijzen zowel met zijn codenaam (bijvoorbeeld &oldreleasename;, &releasename;) als met zijn statusnaam (d.w.z. oldstable, stable, testing, unstable). Het gebruik van de codenaam heeft als voordeel dat u nooit verrast zult worden door een nieuwe release en wordt daarom hier gebruikt in de voorbeelden. Dit betekent natuurlijk wel dat u zelf de aankondiging van een nieuwe release in de gaten zult moeten houden. Als u in plaats van de codenaam de statusnaam gebruikt, zult u dit merken doordat, zodra een release is vrijgegeven, opeens een zeer groot aantal nieuwe versies van pakketten beschikbaar is.
pt: Uma versão pode regularmente ser referida por outra através do seu nome de código (por ex. &oldreleasename;, &releasename;) e pelo seu nome de estado (por ex. oldstable, stable, testing, unstable). Referir-se a uma versão pelo seu nome de código tem a vantagem que que nunca será surpreendido por uma nova versão e por esta razão é o método utilizado aqui. Significa com certeza que terá de observar as notas de lançamento para as versões. Se pelo contrário utilizar o nome de estado, verá apenas carregamentos de actualizações para os pacotes disponíveis assim que uma saída de versão é lançada.
ru: На выпуск Debian можно ссылаться по его кодовому имени (например, "&oldreleasename;" или "&releasename;") или по его статусу (например, "oldstable" ("старый стабильный"), "stable" ("стабильный"), "testing" ("тестируемый"), "unstable" ("нестабильный")). Ссылки на выпуск по его кодовому имени имеют то преимущество, что вы никогда неожиданно для себя не начнёте пользоваться новым выпуском. Поэтому мы здесь так и делаем. В этом случае, вам, конечно, придётся самим следить за новыми выпусками. Если вы будете ссылаться на дистрибутив по его статусному имени, то после выхода нового выпуска вы просто увидите большое количество обновлённых пакетов.
sv: En utgåva kan ofta refereras till av både dess kodnamn (t.ex. &oldreleasename;, &releasename;) och efter dess statusnamn (alltså oldstable, stable, testing, unstable). Att referera till en utgåva efter dess kodnamn har fördelen att du aldrig blir överraskad av en ny utgåva och av den anledningen används den här metoden här. Det kan naturligtvis betyda att du själv måste hålla utkik efter nya utgåvor. Om du istället använder statusnamnet, kommer du bara att se massor av uppdateringar för paket som finns tillgängliga så snart en utgivning har skett.
zh_cn: 发行版通常可以使用它的开发代码名（如，&oldreleasename;、&releasename;）或是它的状态名称（如，oldstable、stable、testing、unstable）来表示。使用发行版的代码有个好处是您将不用为了新的发行版的到来而感到不安，这也是为什么会在此提出这个技巧的原因。理所当然的，这也表示了您必须自行去注意发行版是何时发布的。如果您是替而使用状态名称的，在新的发行版发布的同时，您将会立即发觉大量软件包已有新的版本可供更新。

source: Adding APT Internet sources
ja: APT の Internet ソースの追加
nl: Internet-bronnen voor APT toevoegen
pt: Acrescentar fontes APT da Internet
ru: Как добавить Интернет-источник APT
sv: Lägg till APT-källor på Internet
zh_cn: 加入互联网上的 APT 软件包来源

source: The default configuration is set up for installation from main Debian Internet servers, but you may wish to modify <file>/etc/apt/sources.list</file> to use other mirrors, preferably a mirror that is network-wise closest to you.
ja: デフォルトの設定では、メインの Debian インターネットサーバを使ってインストールするようになっています。ですがここでは、<file>/etc/apt/sources.list</file> を編集して、他のミラー (できればネットワーク的に最も近いミラー) を使うようにするほうがよいでしょう。
nl: De standaard configuratie is om installatie te laten plaatsvinden vanaf de Debian Internet hoofdservers, maar desgewenst kunt u <file>/etc/apt/sources.list</file> wijzigen zodat andere spiegelservers worden gebruikt; bij voorkeur één die in het netwerk het dichtst bij is.
pt: A configuração por omissão é definida para instalação a partir de um servidor Debian principal, mas poderá desejar modificar o <file>/etc/apt/sources.list</file> para utilizar outros 'mirrors', de preferência um 'mirror' proveniente de local mais perto de si.
ru: Конфигурация по умолчанию позволяет произвести установку с главных серверов Debian, но вы можете изменить файл <file>/etc/apt/sources.list</file> и использовать другие зеркала. Лучше использовать ближайшее к вам (в смысле скорости передачи данных) зеркало.
sv: Standardkonfigurationen är inställd för installation från Debians huvudservrar på Internet, men du kanske önskar ändra <file>/etc/apt/sources.list</file> till att använda andra speglar, föredragsvis en spegel som är nätverksmässigt närmare dig.
zh_cn: 虽然系统的默认设置是使用 Debian 在互联网上的主要服务器来进行安装，但您还是可能会希望修改 <file>/etc/apt/sources.list</file> 来改为使用在网络上离您最近的其它镜像站。

source: Debian HTTP or FTP mirror addresses can be found at <url id="&url-debian-mirrors;"> (look at the "Full list of mirrors" section). HTTP mirrors are generally speedier than FTP mirrors.
ja: Debian の HTTP/FTP ミラーのアドレスは、<url id="&url-debian-mirrors;"> を参照してください。一般には HTTP ミラーのほうが FTP ミラーよりも高速です。
nl: Adressen voor Debian HTTP- of FTP-spiegelservers kunnen worden gevonden op <url id="&url-debian-mirrors;">. HTTP-servers zijn over het algemeen sneller dan FTP-servers.
pt: Endereços de 'mirrors' Debian HTTP ou FTP podem ser encontrados em <url id="&url-debian-mirrors;"> (veja na secção "Lista completa de 'mirrors'"). OS 'mirrors' HTTP são geralmente mais rápidos do que os 'mirrors' FTP.
ru: Адреса HTTP- и FTP-зеркал Debian можно найти по адресу <url id="&url-debian-mirrors;"> (см. раздел "Полный список зеркал"). HTTP-зеркала обычно быстрее, чем FTP.
sv: Adresserna till Debians HTTP- eller FTP-speglar kan hittas på <url id="&url-debian-mirrors;"> (se avsnittet "Listan över Debianspeglingar"). HTTP-speglar är vanligtvis snabbare än FTP-speglar.
zh_cn: 您也可以在 <url id="&url-debian-mirrors;"> 取得 Debian 的 HTTP 或 FTP 镜像站的网址（请参考【Full list of mirrors】小节）。HTTP 镜像站的传输速度通常会比 FTP 镜像站来得快。

source: For example, suppose your closest Debian mirror is <tt>&url-debian-mirror-eg;/</tt>. When inspecting that mirror with a web browser or FTP program, you will notice that the main directories are organized like this:
ja: 例えば、一番近くにある Debian ミラーが <tt>&url-debian-mirror-eg;/</tt> だったとしましょう。このミラーをウェブブラウザや FTP プログラムで見てみると、main などのディレクトリが以下のように構成されていることがわかります。
pt: Por exemplo, suponha que o 'mirror' Debian mais perto é <tt>&url-debian-mirror-eg;/</tt>. Quando inspeccionar aquele 'mirror' com um navegador web ou um programa FTP, irá notar que os directórios principais estão organizados desta forma:
ru: Допустим, к примеру, что ближайшим к вам зеркалом Debian является <tt>&url-debian-mirror-eg;</tt>. Просматривая содержимое зеркала web-браузером или FTP-клиентом, можно заметить, что основные каталоги организованы следующим образом:
sv: Till exempel, anta att din närmaste Debian-spegel är <tt>&url-debian-mirror-eg;/</tt>. När den spegeln inspekteras med en webbläsare eller FTP-program, kommer du att märka att huvudkatalogerna är organiserade så här:
zh_cn: 举例来说，假设离您最近的 Debian 镜像站是 <tt>&url-debian-mirror-eg;/</tt>。当您透过网页浏览器或 FTP 程序来检视这个网站时，您会发现其中的主要目录架构会像是这个样子：

source: To use this mirror with <prgn>apt</prgn>, you add this line to your <file>sources.list</file> file:
ja: このミラーを <prgn>apt</prgn> で使うには、次の行を <file>sources.list</file> ファイルに追加します。
pt: Para utilizar este 'mirror' com o <prgn>apt</prgn>, terá de acrescentar esta linha ao seu ficheiro <file>sources.list</file>:
ru: Чтобы использовать это зеркало в программе <prgn>apt</prgn>, добавьте в файл <file>sources.list</file>:
sv: Lägg till den här raden till din <file>sources.list</file> för att använda den här spegelservern med <prgn>apt</prgn>:
zh_cn: 为了要让 <prgn>apt</prgn> 能够使用这个镜像站，请把以下的这一行加入您的 <file>sources.list</file> 档案之中：

source: Note that the `<tt>dists</tt>' is added implicitly, and the arguments after the release name are used to expand the path into multiple directories.
ja: `<tt>dists</tt>' は書かなくても暗黙のうちに追加されます。そしてリリース名の後の引数がそれぞれ用いられ、複数のディレクトリの各々のパス名に展開されます。
nl: Merk op dat `<tt>dists</tt>' impliciet wordt toegevoegd en dat de parameters achter de naam van de release worden gebruikt om het pad uit te breiden naar meerdere mappen.
pt: Note que `<tt>dists</tt>' é implicitamente adicionado, e que os argumentos que se seguem ao nome da versão são utilizados para expandir o caminho em múltiplos directórios.
ru: Заметим, что `<tt>dists</tt>' добавляется автоматически, а параметры после имени выпуска используются для дополнения сетевого пути до реальных каталогов.
sv: Observera att "<tt>dists</tt>" läggs till automatiskt, och argumenten efter utgåvans namn används för att utöka sökvägen till flera kataloger.
zh_cn: 请注意，`<tt>dists</tt>' 将会被自动加到路径中，而在发布代号之后的参数则会被用来展开成多个不同目录的路径。

source: After adding your new sources, disable the previously existing "<tt>deb</tt>" lines in <file>sources.list</file>, by placing a hash sign (<tt>#</tt>) in front of them.
ja: これらの新たなソースを追加したら、それまでの <file>sources.list</file> 中の "<tt>deb</tt>" 行の先頭にシャープ記号 (<tt>#</tt>) を置き、それらを無効にしてください。
nl: Invalideer, nadat u uw nieuwe bronnen heeft toegevoegd, de oude "<tt>deb</tt>"-regels in <file>sources.list</file> door er een hekje (<tt>#</tt>) voor te plaatsen.
pt: Depois de adicionar novas fontes, desactive as linhas antigas "<tt>deb</tt>" existentes em <file>sources.list</file>, colocando um cardinal (<tt>#</tt>) em frente às mesmas.
ru: После того, как вы добавили новый источник, отключите присутствовавшие ранее в файле <file>sources.list</file> строки <tt>deb</tt>, поставив в начале каждой строки знак диеза (<tt>#</tt>).
sv: Efter att du har lagt till dina nya källor, inaktivera de tidigare befintliga "<tt>deb</tt>"-raderna i <file>sources.list</file>, genom att placera ett hash-tecken (<tt>#</tt>) framför dem.
zh_cn: 在加入了新的 APT 来源之后，请在 <file>sources.list</file> 中原有的 "<tt>deb</tt>" 设置行前加入井字符号 (<tt>#</tt>) 以关闭这些软件包的源。
