Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: Although <package>udev</package> has been tested extensively, you may experience minor problems with some devices that will need to be fixed. The most common problems are changed permission and/or ownership of a device. In some cases a device may not be created by default (e.g. <file>/dev/video</file> and <file>/dev/radio</file>).
ja: <package>udev</package> は広範囲にわたってテストされていますが、いくつかのデバイスでは若干の修正が必要になるという問題があるかもしれません。たいていの問題は、デバイスファイルの権限や所有者が変更されるというものです。(<file>/dev/video</file> や <file>/dev/radio</file> など) デフォルトではデバイスファイルが作成されない場合もあります。
nl: Hoewel <package>udev</package> uitgebreid is getest, is het mogelijk dat u kleine problemen zult moeten oplossen voor bepaalde apparaatbestanden. De meest voorkomende problemen zijn gewijzigde toegangsrechten of eigendom van een apparaatbestand. Soms kan het voorkomen dat een apparaatbestand niet automatisch wordt aangemaakt (dit geldt bijvoorbeeld voor <file>/dev/video</file> and <file>/dev/radio</file>).
pt: Apesar do <package>udev</package> ter sido testado extensivamente, pode experimentar pequenos problemas com alguns dispositivos que terão de ser corrigidos. O mais comum desses problemas é a alteração das permissões e/ou 'ownership' de um dispositivo. Em alguns casos um dispositivo pode não ser criado por omissão (e.g. <file>/dev/video</file> e <file>/dev/radio</file>).
ru: Хотя <package>udev</package> и был хорошо оттестирован, у вас могут возникнуть вопросы, связанные работой некоторых устройств. Чаще всего ошибки вызваны изменением владельца или разрешений файла-устройства. Некоторые устройства по умолчанию не могут быть созданы (например, <file>/dev/video</file> и <file>/dev/radio</file>).
sv: Även om <package>udev</package> har utförligt testats, kan du uppleva mindre problem med vissa enheter som behöver rättas till. De mest vanliga problemen är ändrade rättigheter och/eller ägarskap på en enhet. I vissa fall kan en enhet inte skapas som standard (t.ex. <file>/dev/video</file> och <file>/dev/radio</file>).
zh_cn: 虽然 <package>udev</package> 已经过了广泛的测试，但您还是可能在某些设备上遇到一些必须加以修正的小问题。最常见的问题是某个设备的权限及/或所有权上的变更。在某些状况下，有些设备默认是不会被建立的。（如：<file>/dev/video</file> 和 <file>/dev/radio</file>）。

source: <package>udev</package> provides configuration mechanisms to deal with these issues. See <manref section="8" name="udev"> and <file>/etc/udev</file> for further information.
ja: <package>udev</package> は、これらの問題に対処する設定の仕組みを提供しています。詳しくは、<manref section="8" name="udev"> や <file>/etc/udev</file> を見てください。
nl: <package>udev</package> biedt mogelijkheden om deze problemen door aanpassing van de configuratie op te lossen. ZIe <manref section="8" name="udev"> en <file>/etc/udev</file> voor nadere informatie.
pt: O <package>udev</package> fornece mecanismos de configuração para gerir estes problemas. Veja <manref section="8" name="udev"> e <file>/etc/udev</file> para mais informação.
ru: Все эти проблемы можно решить настройкой <package>udev</package>. Более подробная информация - в <manref section="8" name="udev"> и <file>/etc/udev</file>.
sv: <package>udev</package> tillhandahåller konfigurationsmekanismer för att hanera dessa problem. Se <manref section="8" name="udev"> och <file>/etc/udev</file> för ytterligare information.
zh_cn: <package>udev</package> 提供了配置方案以便您能处理这些问题。请查看 <manref name="udev" section="8"> 和 <file>/etc/udev</file> 以取得更详尽的信息。

source: XFree86 to X.Org transition
ja: XFree86 から X.Org への移行
pt: Transição de XFree86 para X.Org
ru: Переход с XFree86 на X.Org
sv: Övergång från XFree86 till X.Org
zh_cn: 将 XFree86 转换至 X.Org

source: The transition to X.Org involves some structural changes. In case all installed packages are from Debian and also included in &releasename;, the upgrade should work without problems. Experience has however shown there are a few changes to be aware of as they can potentially cause issues during the upgrade.
ja: X.Org への移行は多少の構造的変化を伴います。インストール済みのパッケージがすべて Debian 製のパッケージで &releasename; にも含まれている場合、アップグレードは問題なく行われるはずです。しかし、アップグレードの過程で問題が生じる可能性があるため、知っておくべき問題点がいくつかあることが経験的に明らかになっています。
pt: A transição para o X.Org involve algumas mudanças estruturais. No caso de todos os pacotes instalados serem da Debian e também incluídos na &releasename;, a actualização deverá correr sem problemas. A experiência no entanto mostrou que existem algumas alterações a ter em conta e que podem causar potenciais problemas durante a actualização.
ru: Переход на X.Org включает некоторые структурные изменения. В случае, если установлены все пакеты из Debian и также включённые в &releasename;, то обновление должно пройти без проблем. Опыт, однако, показывает, что нужно сделать несколько изменений, так как известно, что без них могут возникнуть проблемы во время обновления.
sv: Övergången till X.Org involverar även några strukturella ändringar. Om alla installerade paket kommer från Debian och även inkluderade i &releasename;, bör uppgraderingen fungerar utan några problem. Erfarenheter har dock visat att det kan finnas några ändringar som man bör känna till eftersom de möjligen kan orsaka problem under uppgraderingen.
zh_cn: 转换至 X.Org 将会连带得产生一些结构上的改变。如果所有安装的软件包都来自 Debian 且都存在于 &releasename;，那么升级将不会发生什么问题。在此所列出的是在实地测试时，一些应该要知道的改变，因为它们可能会在升级的过程中发生潜在的问题。

source: The most important change is that <file>/usr/X11R6/bin</file> has been dropped and only remains as a symlink to <file>/usr/bin</file>. This means this directory has to be empty at the time the new packages are installed. The new packages conflict with most packages that used <file>/usr/X11R6/bin</file>, but in some cases manual intervention may be needed. Please remember to not run upgrades within an X session.
ja: 最も重要な変更点は、<file>/usr/X11R6/bin</file> が削除され、<file>/usr/bin</file> へのシンボリックリンクとして残されるだけになるということです。つまり、このディレクトリは新しいパッケージがインストールされる時点で空になっていなければいけません。新しいパッケージは、<file>/usr/X11R6/bin</file> を使用していたほとんどのパッケージと衝突するようになっていますが、場合によっては手作業での介入が必要になります。絶対に、X セッション内ではアップグレードを実行しないようにしてください。
pt: A alteração mais importante é que <file>/usr/X11R6/bin</file> foi abandonado e apenas se mantém um link simbólico para <file>/usr/bin</file>. O que significa que este directório tem que estar vazio para os novos pacotes serem instalados. Os novos pacotes criam conflito com a maioria dos pacotes usados em <file>/usr/X11R6/bin</file>, mas em alguns casos a intervenção manual pode ser necessária. Por favor lembre-se de não correr actualizações numa sessão X.
ru: Наиболее важным изменением является то, что каталог <file>/usr/X11R6/bin</file> больше не существует и остаётся только в виде символической ссылки на <file>/usr/bin</file>. Это значит, что этот каталог будет пуст в момент установки новых пакетов. Новые пакеты конфликтуют с большинством пакетов, которые используют <file>/usr/X11R6/bin</file>, но в некоторых случаях может понадобиться ручное вмешательство. Не запускайте обновление в X-сессии.
sv: Den mest viktiga ändringen är att <file>/usr/X11R6/bin</file> har tagits bort och återfinns endast som en symbolisk länk till <file>/usr/bin</file>. Det här betyder att katalogen måste vara tom när det nya paketet installeras. De nya paketen är i konflikt med de flesta paket som använder <file>/usr/X11R6/bin</file>, men i vissa fall kan manuell handpåläggning behövas. Kom ihåg att inte köra uppgraderingar inne i en X-session.
zh_cn: 最重大的改变是 <file>/usr/X11R6/bin</file> 已被废止，只剩下一个符号连结指向 <file>/usr/bin</file>。这表示这个目录必须在新软件包安装后清空。这个新软件包将会和大多数使用 <file>/usr/X11R6/bin</file> 的软件包发生冲突。在某些状况之下，也许需要手动介入。请牢记切勿在 X session 里进行升级。

source: In case the upgrade aborts during X.Org installation, you should check if any files are still left in <file>/usr/X11R6/bin</file>. You can then use <tt>dpkg -S</tt> to find out which Debian package installed that file (if any), and remove such packages with <tt>dpkg --remove</tt>. Please make a note which packages you remove, so that you can install substitute packages later on. Before continuing with the upgrade, all files in <file>/usr/X11R6/bin</file> need to be removed.
ja: X.Org のインストール中にアップグレードが中断した場合、<file>/usr/X11R6/bin</file> にまだ残っているファイルがあるか調べなければなりません。そうしたら (そこにファイルがあれば) どの Debian パッケージがそのファイルをインストールしたかを <tt>dpkg -S</tt> で調べ、該当するパッケージを <tt>dpkg --remove</tt> で削除できます。後で代わりのパッケージをインストールできるよう、削除したパッケージを書き留めておいてください。アップグレードを続ける前に <file>/usr/X11R6/bin</file> にあるファイルはすべて削除する必要があります。
pt: Nm caso da actualização abortar durante a instalação do X.Org, deverá verificar se os ficheiros ainda se mantêm em <file>/usr/X11R6/bin</file>. pode então usar o <tt>dpkg -S</tt> para descobrir que pacote Debian instalou esse ficheiro (se algum), e remover esses pacotes com <tt>dpkg --remove</tt>. Por favor tome nota dos pacotes que remova, todos os ficheiros em <file>/usr/X11R6/bin</file> têm que ser removidos.
ru: В случае, если обновление прервалось во время установки X.Org, убедитесь, не осталось ли файлов в <file>/usr/X11R6/bin</file>. Вы можете использовать <tt>dpkg -S</tt>, чтобы выяснить, какому пакету Debian принадлежит оставшийся файл (если таковые имеются), и удалить эти пакеты с помощью <tt>dpkg --remove</tt>. Запомните какие пакеты удаляете, для того чтобы позже можно было установить пакеты, заменяющие их. Перед тем как продолжить обновление, нужно удалить все файлы в каталоге <file>/usr/X11R6/bin</file>.
sv: I fall att uppgraderingen avbryts under installation av X.Org, bör du kontrollera om några filer fortfarande finns kvar i <file>/usr/X11R6/bin</file>. Du kan sedan använda <tt>dpkg -S</tt> för att ta reda på vilket Debian-paket som installerade den filen (om någon), och ta bort sådana paket med <tt>dpkg --remove</tt>. Tänk på att skriva ner vilka paket du tar bort, så att du kan installera ersättningspaket senare. Innan du fortsätter med uppgraderingen, måste alla filer i <file>/usr/X11R6/bin</file> tas bort.
zh_cn: 万一在安装 X.Org 时升级作业中断了，您应该检查是否还有什么文件还遗留在 <file>/usr/X11R6/bin</file> 里。您可以使用 <tt>dpkg -S</tt> 来找到是哪些 Debian 软件包安装了那些文件（如果有的话），然后用 <tt>dpkg --remove</tt> 来移除这些软件包。请记下您移除了哪些软件包，那么您可以在稍后再安装其它的替代软件包。在继续进行升级之前，在 <file>/usr/X11R6/bin</file> 里的所有文件必须被清除掉。

source: Please read <url id="http://wiki.debian.org/Xorg69To7"> for more details and other issues.
ja: さらに詳しい情報やその他の問題点については <url id="http://wiki.debian.org/Xorg69To7"> を読んでください。
pt: Por favor leia <url id="http://wiki.debian.org/Xorg69To7"> para mais detalhes e outras questões.
ru: Подробности и другие проблемы можно найти на <url id="http://wiki.debian.org/Xorg69To7">.
sv: Läs <url id="http://wiki.debian.org/Xorg69To7"> för fler detaljer och andra problem.
zh_cn: 请参阅 <url id="http://wiki.debian.org/Xorg69To7"> 以取得更多详尽信息及其它的问题。

source: Upgrading from exim to exim4
ja: exim から exim4 へのアップグレード
pt: Actualização de exim para exim4
ru: Обновление exim на exim4
sv: Uppgradering från exim till exim4
zh_cn: 将 exim 升级至 exim4

source: One of the packages that has been obsoleted by the &releasename; release is the Mail Transfer Agent (MTA) <package>exim</package>, which has been replaced by the completely new package <package>exim4</package>.
ja: &releasename; リリースで時代遅れとして扱われるようになったパッケージの 1 つに、メール転送エージェント (MTA) の <package>exim</package> があります。このパッケージは、完全に新しいパッケージである <package>exim4</package> によって置き換えられました。
zh_cn: 被 &releasename; 释出版本所废弃的软件包之一是 Mail Transfer Agent (MTA) <package>exim</package>，它已完全被新的 <package>exim4</package> 软件包所取代。

source: <prgn>exim</prgn> (version 3.xx) has been unmaintained upstream for years, and Debian has dropped support for that version as well. If you are still using <prgn>exim</prgn> 3.xx, please upgrade your <package>exim</package> installation to <package>exim4</package> manually. Since <package>exim4</package> is already part of &oldreleasename;, you can choose to do the upgrade on your &oldreleasename; system before the upgrade to &releasename;, or after the &releasename; upgrade at your convenience. Just remember that your old <package>exim</package> package is not going to be upgraded and that it won't get security support after support for &oldreleasename; has been discontinued.
ja: それだけでなく、<package>exim</package> (バージョン 3.xx) はもう何年もの間、上流でメンテナンスされていないので、Debian ではこのバージョンのサポートを打ち切りました。まだ <package>exim</package> 3.xx を使用している場合は、インストールしている <package>exim</package> を <package>exim4</package> に手作業でアップグレードしてください。<package>exim4</package> は既に &oldreleasename; に含まれているので、&releasename; へのアップグレードの前に &oldreleasename; システム上でこのアップグレード作業を行うか、&releasename; へのアップグレードの後で都合のよいときに行うかは選択可能です。ただ、古い <package>exim</package> パッケージが自動的にアップグレードすることはなく、&oldreleasename; のサポートが打ち切られた後はそのパッケージへのセキュリティサポートは行われないということだけは覚えておいてください。
zh_cn: <prgn>exim</prgn>（3.xx 版）已有多年没有上游者在继续维护了，而同时 Debian 也中止了对这个版本的支持。如果您还在用着 <prgn>exim</prgn> 3.xx，请手动将您的 <package>exim</package> 升级为 <package>exim4</package>。因为 <package>exim4</package> 已包含在 &oldreleasename; 之中，您可以自行选择是在升级至 &releasename; 之前或之后在您的 &oldreleasename; 系统上进行这项升级。请牢记，您旧版的 <package>exim</package> 软件包将不会进行升级，且安全维护也将在 &oldreleasename; 的支持中止之后停止。

source: The <package>exim4</package> packages in Debian are extensively documented. The package's home page is <url id="http://wiki.debian.org/PkgExim4"> on the Debian Wiki, and the README file can be found at <url id="http://pkg-exim4.alioth.debian.org/README/README.Debian.html"> and inside the packages as well.
ja: Debian の <package>exim4</package> パッケージ群は大規模に文書化されています。パッケージのホームページは Debian Wiki の <url id="http://wiki.debian.org/PkgExim4"> で、README ファイルはパッケージ内部だけでなく <url id="http://pkg-exim4.alioth.debian.org/README/README.Debian.html"> にもあります。
zh_cn: 在 Debian 里的 <package>exim4</package> 软件包已有众多的文件。该软件包的首页为在 Debian Wiki 上的 <url id="http://wiki.debian.org/PkgExim4">，而 README 文件可以在 <url id="http://pkg-exim4.alioth.debian.org/README/README.Debian.html"> 及软件包中找到。

source: The README file has a chapter about Packaging, which explains the different package variations we offer, and it has a chapter about Updating from <prgn>Exim</prgn> 3, which will help you in doing the actual transition.
ja: README ファイルにはパッケージ化 (Packaging) に関する章があります。この章では、Debian で提供されている複数の異なるパッケージの差異について説明しています。また README ファイルには <prgn>Exim</prgn> 3 からのアップグレード (Updating from Exim 3) に関する章があります。この章は、実際に移行を行う際に役に立つでしょう。
zh_cn: 在 README 文件中有个关于 Packaging 的章节，说明了和我们所提供的软件包之间的一些差异，它还有一个章节是从 <prgn>Exim</prgn> 3 升级的一些说明，这个将对于您在实地转换时有所帮助。

source: Upgrading apache2
ja: apache2 のアップグレード
pt: Actualização do apache2
ru: Обновление apache2
sv: Uppgradera apache2
zh_cn: 升级 apache2

source: Apache has been upgraded to the new version 2.2. Although this shouldn't impact the average user, there are some potential issues to be aware of.
ja: Apache は新しいバージョン 2.2 にアップグレードしました。普通のユーザはこのアップグレードによる影響を受けませんが、知っておくべき、生じる可能性がある問題点がいくつかあります。
pt: O apache foi actualizado para a nova versão 2.2. Embora não deva existir impacto para o utilizador médio, existem algumas questões potenciais a ter em conta.
ru: Apache был обновлён до новой версии 2.2. Хотя это не должно ничего сломать в большинстве случаев, есть несколько возможных проблем, с которыми лучше ознакомиться.
sv: Apache har uppgraderats till nya versionen 2.2. Även om det här inte bör ha stor inverkan på den genomsnittlige användaren, finns det vissa tänkbara problem man bör känna till.
zh_cn: Apache 已被升级为新版的 2.2。虽然对于一般用户而这并不是很重要，但还是有些潜在的问题必须知道。

source: <url id="http://httpd.apache.org/docs/2.2/upgrading.html"> contains the upstream changes. Please read this page, and remember that especially:
ja: <url id="http://httpd.apache.org/docs/2.2/upgrading.html"> に、上流での変更が記載されています (訳注: 本リリースノート執筆時点では、リンク先の日本語のページに記載されている情報は 1.3 から 2.0 で入った変更なので、2.0 から 2.2 で入った変更については英語のページを参照してください)。このページを読み、特に以下の内容を記憶に留めておいてください。
pt: O <url id="http://httpd.apache.org/docs/2.2/upgrading.html"> contem as alterações 'upstream'. Por favor leia esta página e lembre-se especificamente :
ru: На <url id="http://httpd.apache.org/docs/2.2/upgrading.html"> содержатся изменения, сделанные разработчиком. Прочитайте эту страницу и особенно обратите внимание:
sv: <url id="http://httpd.apache.org/docs/2.2/upgrading.html"> innehåller "uppströms"-ändringarna. Läs den här sidan och tänk speciellt på:
zh_cn: 在 <url id="http://httpd.apache.org/docs/2.2/upgrading.html"> 上包含了上游的改变，请参阅这个网页，并请特别牢记：

source: all modules need to be recompiled
ja: 全てのモジュールを再コンパイルする必要があります
pt: todos os módulos precisam de ser recompilados
ru: нужно перекомпилировать все модули
sv: alla moduler behöver byggas om
zh_cn: 所有的模块必须重新编译

source: authorization modules have been resorted and renamed
ja: 認証モジュールについて、名前の変更や再分類が行われました
pt: os módulos de autorização tem que se reactivados e renomeados
ru: модули авторизации были пересортированы и переименованы
sv: behörighetsmoduler har sorterats om och fått nya namn
zh_cn: 认证模块已被重新排列并重新命名了

source: some configuration options have been renamed
ja: 設定オプションの一部は名前が変わりました
pt: as mesmas opções de configuração tem que ser renomeadas
ru: некоторые параметры конфигурации были переименованы
sv: vissa konfigurationsalternativ har fått nya namn
zh_cn: 有些设置项目被更名了

source: Debian-specific changes include that the string SSL is no longer defined, as ssl is now supported by the default package.
ja: Debian 特有の変更としては、デフォルトパッケージが ssl をサポートするようになったため、SSL という文字列がもう定義されていない、などが挙げられます。
pt: As alterações especificas da Debian incluem que a string SSL deixe de ser definida, pois o suporte ssl não é mais suportado como pacote por omissão.
ru: Из изменений, сделанных Debian, следует отметить, что строка SSL больше не определена, так как ssl теперь поддерживается в пакете по умолчанию.
sv: Debian-specifika ändringar är bland annat att SSL-strängen inte längre definieras eftersom ssl numera stöds av standardpaketet.
zh_cn: 而仅适于 Debian 的改变包括了 SSL 字符串已不再被定义了，因为 ssl 现已被默认的软件包所支持

source: Deprecated insecure php configurations
ja: 安全でない php の設定の廃止
pt: Depreciadas configurações inseguras de php
ru: Запрещены небезопасные конфигурации php
sv: Utfasade osäkra php-konfigurationer
zh_cn: 关闭不安全的 php 设置

source: For many years, turning on the <tt>register_globals</tt> settings in PHP has been known to be insecure and dangerous, and this option has defaulted to off for some time now. This configuration is now finally deprecated on Debian systems as too dangerous. The same applies to flaws in <tt>safe_mode</tt> and <tt>open_basedir</tt>, which have also been unmaintained for some time.
ja: 長年、PHP で <tt>register_globals</tt> の設定をオンにすることは安全でなく危険であるとわかっており、このオプションはこれまでかなりの期間、デフォルトではオフになっていました。この設定が、あまりにも危険であるとして、ついに Debian システムでは廃止されました。同様のことが <tt>safe_mode</tt> と <tt>open_basedir</tt> の欠陥にも当てはまります。これらの欠陥はやはり、かなりの期間メンテナンスされていません。
pt: Durante alguns anos, activar as opções de <tt>register_globals</tt> no PHP foi tomado como inseguro e perigoso, esta opção foi desactivada à algum tempo por omissão. Esta configuração está agora finalmente depreciada nos sistemas Debian por ser demasiado perigosa. O mesmo se aplica a falhas em <tt>safe_mode</tt> e <tt>open_basedir</tt>, que não têm sido mantidas à algum tempo.
ru: Многие годы было известно, что включение настройки <tt>register_globals</tt> в PHP ненадёжно и опасно, и в пакете она была отключена по умолчанию. Теперь эту настройку вообще не рекомендуется использовать на системах Debian, как слишком опасную. То же самое касается недостатков для <tt>safe_mode</tt> и <tt>open_basedir</tt>, которым также некоторое время не уделялось должного внимания.
sv: I många år har påslagningen av inställningen <tt>register_globals</tt> i PHP var känd som osäker och farlig, och den här inställningen har under en tid varit avstängd som standard. Den här konfigurationen är nu äntligen utfasad på Debian-system då den är för farlig. Det samma gäller för sårbarheter i <tt>safe_mode</tt> och <tt>open_basedir</tt>, vilka heller inte har underhållits under en tid.
zh_cn: 多年以来，在 PHP 里启用 <tt>register_globals</tt> 设置是众所皆知的既不安全且极为冒险的，而这个选项也被多次在默认上被关闭。这个设置终于因为太危险而在 Debian 系统里被关闭了。同样的问题也发生在 <tt>safe_mode</tt> 及 <tt>open_basedir</tt> 上，因为它们已有段时间没有在继续维护了。

source: Starting with this release, the Debian security team does not provide security support for a number of PHP configurations which are known to be insecure. Most importantly, issues resulting from <tt>register_globals</tt> being turned on will no longer be addressed.
ja: 本リリース以降、Debian セキュリティチームは、安全でないとわかっている PHP の多数の設定についてはセキュリティサポートを提供しません。最も重大なのは、<tt>register_globals</tt> がオンになっているために生じる問題への対処は、もはやなされないということです。
pt: A partir desta versão , a equipa de segurança da Debian não fornece suporte de segurança a uma quantidade de configurações PHP conhecidas como inseguras. Mais importante ainda, questões resultantes da activação de <tt>register_globals</tt> não serão mais atendidas.
ru: Начиная с этого выпуска, команда обеспечения безопасности в Debian не предоставляет поддержку безопасности тем настройкам PHP, которые заранее считаются небезопасными. Самое главное: проблемы, возникшие из-за включённого <tt>register_globals</tt> больше не рассматриваются.
sv: Från och med den här utgåvan kommer Debians säkerhetsteam inte att tillhandahålla säkerhetsstöd för ett antal PHP-konfigurationer som är kända att vara osäkra. Mest viktigast är problem som resulterar från att <tt>register_globals</tt> har slagits på, kommer inte längre att hanteras.
zh_cn: 从这个释出版本开始，Debian 安全团队将不再替一些已知是不安全的 php 设置提供安全上的支持。最重要的是，将不再关注于因为开启了 <tt>register_globals</tt> 而导致的问题。

source: If you run legacy applications that require <tt>register_globals</tt>, enable it for the respective paths only, e.g. through the Apache configuration file. More information is available in the <file>README.Debian.security</file> file in the PHP documentation directory (<file>/usr/share/doc/php4</file>, <file>/usr/share/doc/php5</file>).
ja: <tt>register_globals</tt> を必要とする旧式のアプリケーションを実行する場合は、例えば Apache の設定ファイルを用いて、該当する各パスのみに対してこの設定を有効にしてください。さらに詳しい情報は、PHP の付属文書のディレクトリ (<file>/usr/share/doc/php4</file> や <file>/usr/share/doc/php5</file>) に含まれている <file>README.Debian.security</file> ファイルで入手可能です。
pt: Se estiver a correr aplicações 'legacy' que requeiram <tt>register_globals</tt>, active-a apenas para o caminho (path) respectivo, e.g. através do ficheiro de configuração do Apache. Mais informação está disponível em <file>README.Debian.security</file> no directório da documentação PHP (<file>/usr/share/doc/php4</file>, <file>/usr/share/doc/php5</file>).
ru: Если вы используете старые приложения, которым требуется <tt>register_globals</tt>, включайте его только для соответствующего пути, например, через конфигурационный файл Apache. Подробности описаны в файле <file>README.Debian.security</file> из каталога с документацией PHP (<file>/usr/share/doc/php4</file>, <file>/usr/share/doc/php5</file>).
sv: Om du kör gamla program som kräver <tt>register_globals</tt>, aktivera det endast för respektive sökvägar, t.ex. genom Apaches konfigurationsfil. Mer information finns tillgänglig i filen <file>README.Debian.security</file> i PHP:s dokumentationskatalog (<file>/usr/share/doc/php4</file>, <file>/usr/share/doc/php5</file>).
zh_cn: 如果您所运行的老旧应用程序需要使用 <tt>register_globals</tt>，请在各别的页面中，像是在 Apache 的设置里将其启用。可以在 PHP 文件目录(<file>/usr/share/doc/php4</file>、<file>/usr/share/doc/php5</file>) 里的 <file>README.Debian.security</file> 里找到更多的详尽信息。

source: Security status of Mozilla products
ja: Mozilla 製品のセキュリティの状態
pt: Estado da segurança dos produtos Mozilla
ru: Безопасность в продуктах Mozilla
zh_cn: Mozilla 组合的安全状态
