Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: If you have entries in the <file>/etc/modules</file> file (the list of modules to be loaded during system boot), be aware that some module names may have changed. If this happens you will have to update this file with the new module names.
ja: <file>/etc/modules</file> ファイル (システム起動時にロードされるモジュールの一覧) 内に記述をしているなら、いくつかのモジュール名が変わっているかもしれないことに注意してください。変わっている場合は、ファイル内の記述を新しいモジュール名で更新しなければならないでしょう。
nl: Als er modules voorkomen in het bestand <file>/etc/modules</file> (lijst met modules die moeten worden geladen tijdens het opstarten van het systeem), merk dan op dat de naam van sommige van deze modules kan zijn gewijzigd. Als dit is gebeurt dan zult u deze in het bestand moeten aanpassen.
pt: Se tiver entradas no ficheiro <file>/etc/modules</file> (a lista dos módulos tem que ser carregada durante o arranque do sistema), tenha em atenção que alguns nomes de módulos podem ter sido alterados. Se isto acontecer terá que actualizar este ficheiro com os novos nomes dos módulos.
ru: Если у вас есть записи в файле <file>/etc/modules</file> (список модулей, загружаемых при старте системы), обратите внимание на то, что имена некоторых модулей изменились. В этом случае файл надо соответствующим образом исправить.
sv: Om du har poster i filen <file>/etc/modules</file> (listan över moduler som ska läsas in under systemets uppstart), tänk på att vissa modulnamn har ändrats. Om det här händer måste du uppdatera den här filen med de nya modulnamnen.
zh_cn: 如果您在 <file>/etc/modules</file> 文件（在系统开机时所要载入的模块列表）有自行加入的项目的话，请您要记得有些模块的名称已经有所改变，如果真的如此，您必须修改这个文件并使用新的模块名称。

source: For some SATA disk controllers, the device assigned to a drive and its partitions may change from <file>/dev/hdX</file> to <file>/dev/sdX</file>. If this happens, you will have to modify your <file>/etc/fstab</file> and bootloader configuration accordingly. Unless these changes are made correctly, your system may not boot correctly<footnote><p>It will boot the kernel but will fail when trying to mount the root filesystem and will abort with an error <em>waiting for root filesystem</em> followed by <em>unable to mount /dev/hdX ..not found</em>. You can use the <prgn>initramfs</prgn> shell to fix this issue, after you identify the names newly assigned devices in the kernel boot messages or by reviewing the contents of <file>/dev/disk</file>.</p></footnote>.
ja: いくつかの SATA ディスクコントローラでは、ドライブやそのパーティションに割り当てられたデバイスが <file>/dev/hdX</file> から <file>/dev/sdX</file> に変わっているかもしれません。変わっている場合は、<file>/etc/fstab</file> とブートローダの設定を適切に修正しなければならないでしょう。これらの修正が正しく行われないと、システムは適切に起動しない可能性があります<footnote><p>設定が不適切でもカーネルは起動しますが、ルートファイルシステムをマウントしようとして失敗し、<em>unable to mount /dev/hdX ..not found</em> というメッセージに続けて <em>waiting for root filesystem</em> というエラーを出して停止します。カーネルのブートメッセージを眺めるか <file>/dev/disk</file> の内容を調べると、新たに割り当てられたデバイスの名前が特定できるので、そうしたら <prgn>initramfs</prgn> シェルを使用してこの問題を修正できます。</p></footnote>。

source: Once you have installed your 2.6 kernel, but before you reboot, make sure you have a recovery method. First, make sure that the bootloader configuration has entries for both the new kernel and the old, working 2.4 kernel. You should also ensure you have a "rescue" floppy or cdrom to hand, in case misconfiguration of the bootloader prevents you booting the old kernel.
ja: 2.6 系カーネルをインストールした後、再起動を行う前に、復旧手段を用意するようにしてください。まず、ブートローダの設定に新しいカーネルと稼働中の古い 2.4 系カーネルの両方の記述があることを確認してください。ブートローダの設定が間違っていたために古いカーネルで起動できなくなる場合に備え、"レスキュー用の" フロッピーか CD-ROM が手元にあることも確認しておくべきでしょう。
nl: Zorg ervoor, nadat u de 2.6 kernel heeft geïnstalleerd, maar voordat u het systeem opnieuw opstart, dat u ergens op kunt terugvallen. Zorg er allereerst voor dat de uw opstartlader geconfigureerd is voor zowel de nieuwe als de oude, werkende kernel. Het verdient aanbeveling om ook een "rescue" diskette of CD bij de hand te hebben voor het geval uw systeem niet kan worden opgestart door een onjuiste configuratie van de opstartlader.
pt: Assim que instalar o kernel 2.6, mas antes de reiniciar, verifique que possui um método de recuperação. Primeiro, certifique-se que a configuração do gestor de arranque tem as entradas tanto para o novo kernel como para o antigo e funcional kernel 2.4. Deverá também ter a certeza que tem uma disquete "rescue" ou cdrom à mão, em caso da configuração errada do gestor de arranque impedi-lo de arrancar com o kernel antigo.
ru: После установки ядра 2.6, но перед его первой загрузкой убедитесь, что вы в случае неудачи сможете восстановить старое ядро. Во-первых, проверьте, что в настройках системного загрузчика есть пункты и для нового, и для старого ядра. Приготовьте "спасательную" дискету или компакт-диск на тот случай, если вдруг не удастся загрузить старое ядро при помощи загрузчика.
sv: När du har installerat din 2.6-kärna, men före du startar om, se till att du har en återställningsmetod. Se först till att konfigurationen av starthanteraren har poster för den nya kärnan och den gamla fungerande 2.4-kärnan. Du bör även se till att du har en "rescue"-diskett eller cd-rom till hands, i fall att en felkonfiguration av starthanteraren förhindrar dig från att starta upp den gamla kärnan.
zh_cn: 如果您安装好了您的 2.6内核，请在重新开机之前，确认您已准备好紧急回复方案。首先，请确认在您的开机程序的设置档里包含着您新的内核 以及旧的、可正常作业的 2.4内核 的项目。您应该也要确认在您的手边有着 "救援 (rescue)" 硬盘片或光盘，以防止在开机程序的一些错误设置导致您连旧的内核都无法开机。

source: Keyboard configuration
ja: キーボードの設定
nl: Configuratie van het toetsenbord
pt: Configurar o teclado
ru: Настройка клавиатуры
sv: Tangentbordskonfiguration
zh_cn: 键盘的设置

source: The most invasive change in the 2.6 kernels is a fundamental change of the input layer. This change makes all keyboards look like "normal" PC keyboards. This means that if you currently have a different type of keyboard selected (e.g. a USB-MAC or Sun keyboard), you will very likely end up with a non-working keyboard after rebooting with the new 2.6 kernel.
ja: 2.6 系カーネルでの最も劇的な変化は、入力レイヤの基本部分の変更です。この変更により、すべてのキーボードは「ふつうの」PC キーボードのように扱えます。これは、現在異なるタイプのキーボード (例えば USB-MAC や Sun キーボード) を選択している場合、新しい 2.6 系カーネルで再起動後にキーボードがまったく動かない状態になってしまう可能性が非常に高いということです。
nl: De meest ingrijpende wijziging in de 2.6 kernels is een fundamentele wijziging van de invoerlaag. Deze wijziging zorgt ervoor dat alle toetsenborden zich presenteren als "normale" PC-toetsenborden. Als u op dit moment een ander type toetsenbord (zoals USB-MAC of Sun) heeft geselecteerd, betekent dit dat de kans groot is dat uw toetsenbord niet zal werken als u opnieuw opstart met de nieuwe 2.6 kernel.
pt: As mais invasivas alterações nos kernels 2.6 é a mudança fundamental da camada de input ('input layer'). Esta alteração faz com que todos os teclados pareçam um teclado de PC "normal". Isto significa que se actualmente possuir um teclado diferente do teclado seleccionado (por ex. configurar USB-MAC ou Sun keyboard), irá provavelmente acabar com um teclado não funcional depois da reinicialização com um kernel 2.6.
ru: Одно из самых значительных изменений в серии ядер 2.6 это коренная переработка интерфейсов устройств ввода. Теперь для ядра все клавиатуры выглядят как стандартная клавиатура PC. Другими словами, если у вас клавиатура другого типа (например, USB-MAC или производства Sun), то после загрузки ядра 2.6 она, скорее всего, откажется работать.
sv: Den största ändringen i 2.6-kärnorna är en huvudsaklig ändring av inmatningslagret. Den här ändringen gör att alla tangentbord ser ut som "normala" PC-tangentbord. Det här betyder att om du för närvarande har en annan typ av tangentbord vald (t.ex. ett USB-MAC- eller Sun-tangentbord), kommer du troligen inte ha ett fungerande tangentbord efter omstart med den nya 2.6-kärnan.
zh_cn: 在 2.6内核 里最具冲击性的改变就是发生在输入层的根本改变。这个改变将会使得所有的键盘都会看起来像是 "一般" 的 PC 键盘。也就是说，如果您正在使用的键盘和一般的有所不同的话，（例： USB-MAC 或 Sun 键盘），在使用新的 2.6 的内核 重新开机后，您的键盘很可能会无法正常运作。

source: If you can SSH into the box from another system, you can resolve this issue by running <tt>dpkg-reconfigure console-data</tt>, choosing the option "Select keymap from full list" and selecting a "pc" keyboard.
ja: 別のシステムからそのマシンへ SSH を使ってログインできるのなら、<tt>dpkg-reconfigure console-data</tt> と実行して "Select keymap from full list" オプションを選び、そこから "pc" キーボードを選択することでこの問題を解決できます。
nl: Als u het systeem vanaf een andere computer kunt benaderen (b.v. met SSH), dan kunt u dit probleem oplossen door <tt>dpkg-reconfigure console-data</tt> uit te voeren, vervolgens de optie "Selecteer een toetsenbordindeling uit de volledige lijst" te kiezen en daarna een "pc"-toetsenbord te selecteren.
pt: Se conseguir ligar-se por SSH à sua máquina a partir de outro sistema, pode resolver esta questão correndo <tt>dpkg-reconfigure console-data</tt>, escolhendo a opção "Seleccionar mapa de teclado de uma lista completa" e seleccionando um teclado "pc".
ru: Если у вас есть возможность зайти на ваш компьютер по SSH, вы сможете исправить ситуацию, запустив <tt>dpkg-reconfigure console-data</tt> и выбрав клавиатуру "pc" из полного списка клавиатур.
sv: Om du kan köra SSH till burken från ett annat system, kan du lösa det här problemet genom att köra <tt>dpkg-reconfigure console-data</tt>, välj alternativet "Välj tangentuppsättning från komplett lista" och välj ett "pc"-tangentbord.
zh_cn: 如果您可以从另一个系统来使用 SSH 连进去那台主机，您可以执行 <tt>dpkg-reconfigure console-data</tt>，并选择【Select keymap from full list】设置，然后选择【pc】键盘来解决这个问题。

source: If your console keyboard is affected, you will probably also need to reconfigure your keyboard for the X Window System. You can do this either by running <tt>dpkg-reconfigure xserver-xorg</tt> or by editing <file>/etc/X11/xorg.conf</file> directly. Don't forget to read the documentation referred to in <ref id="nownownow">.
ja: コンソールで使っているキーボードが影響を受けたということは、X Window System のキーボードも再度設定する必要があるでしょう。<tt>dpkg-reconfigure xserver-xorg</tt> を実行するか、<file>/etc/X11/xorg.conf</file> を直接編集することになります。<ref id="nownownow">で参照されている文書も読んでおいてください。
zh_cn: 如果您在 Consle 所使用的键盘受到了影响，那么您大概也需要替 X Window System 重新设置键盘。您可以执行 <tt>dpkg-reconfigure xerver-xorg</tt> 或是直接编辑 <file>/etc/X11/xorg.conf</file> 来达到这个目的。请不要忘了要阅读在 <ref id="nownownow"> 里所提到的文件。

source: This issue is unlikely to affect the &arch-title; architecture as all PS/2 and most USB keyboards will already be configured as a "normal" PC keyboard.
ja: この問題は、すべての PS/2 および大半の USB キーボードがすでに "normal" PC キーボードとして設定されている &arch-title; アーキテクチャでは影響がないでしょう。
nl: Dit probleem is vrijwel zeker niet van toepassing op &arch-title; systemen aangezien alle PS/2- en de meeste USB-toetsenborden reeds geconfigureerd zullen zijn als een "normaal" PC-toetsenbord.
pt: Esta questão em princípio não afectará a arquitectura &arch-title; pelo facto de todos os teclados PS/2 e a maioria dos USB serem já configurados como teclados PC "normal".
ru: На архитектуре &arch-title; появление этой проблемы маловероятно, так как все клавиатуры PS/2 и большая часть клавиатур USB и раньше опознавались как "стандартная клавиатура PC".
sv: Det här problemet berör troligtvis inte arkitekturen &arch-title; eftersom alla PS/2 och de flesta USB-tangentbord redan kommer att vara konfigurerade som "normala" PC-tangentbord.
zh_cn: 这个问题似乎不会影响到 &arch-title; 结构的机器，因为所有的 PS/2 及绝大多数的 USB 键盘应该早已设置为 "一般的" PC 键盘了。

source: Note that if you are using a USB keyboard, this may be configured as either a "normal" PC keyboard or as a USB-MAC keyboard. In the first case you will not be affected by this issue.
ja: USB キーボードを使っているのなら、"normal" PC キーボードか USB-MAC キーボードとして設定されているでしょう。前者の場合、この問題による影響はありません。
nl: Merk op dat als u een USB-toetsenbord gebruikt, dit als een "normaal" PC-toetsenbord maar ook als een USB-MAC-toetsenbord kan zijn geconfigureerd. In het eerste geval is voor u dit probleem niet van toepassing.
pt: Note que se estiver a usar um teclado USB, este pode ser configurado tanto como um teclado PC "normal" ou um teclado USB-MAC. No primeiro caso não será afectado por este assunto.
ru: Если ваша клавиатура подключена по USB, то она может быть настроена либо как "стандартная PC", либо как "клавиатура USB-MAC". В первом случае проблема вас не затронет.
sv: Observera att om du använder ett USB-tangentbord, kan det konfigureras som antingen ett "normalt" PC-tangentbord eller som ett USB-MAC-tangentbord. I det första fallet kommer du inte drabbas av det här problemet.
zh_cn: 请注意，如果您正在使用的是 USB 键盘，它可能会被设置为 "一般的" PC 键盘或是设置为 USB-MAC 键盘。如果是前者的话，您将不会受到这个问题的影响。

source: Mouse configuration
ja: マウスの設定
nl: Configuratie van de muis
pt: Configurar o rato
ru: Настройка мыши
sv: Muskonfiguration
zh_cn: 鼠标的设置

source: Again because of the changes in the input layer, you may have to reconfigure the X Window System and <package>gpm</package> if your mouse is not working after upgrading to a 2.6 kernel. The most likely cause is that the device which gets the data from the mouse has changed. You may also need to load different modules.
ja: これも入力レイヤの変更によるものですが、2.6 系カーネルへアップグレードした後でマウスが使えなくなったなら、X Window System と <package>gpm</package> を再設定する必要があるでしょう。よくある原因は、マウスからのデータを受け取るデバイスが変わったせいです。別のモジュールをロードする必要もあるかもしれません。
nl: Wederom vanwege de wijzigingen in de invoerlaag zult u mogelijk, als uw muis na de opwaardering naar een 2.6 kernel niet meer werkt, de configuratie van het X Window System en het pakket <package>gpm</package> moeten aanpassen. De meest waarschijnlijke oorzaak is dat de gegevensstroom vanaf de muis binnenkomt op een ander apparaatbestand in <file>/dev/</file>. Ook is het mogelijk dat u andere modules moet laden.
pt: De novo, pelas alterações da 'input layer', pode ter que reconfigurar o X Window System e o <package>gpm</package> se o seu rato não funcionar depois de passar para um kernel 2.6. A causa mais provável é que o dispositivo obtém a informação a partir de um rato que mudou. Pode também ter que carregar módulos diferentes.
ru: Из-за тех же изменений в работе устройств ввода, возможно, придётся перенастроить X Window System и пакет <package>gpm</package>. Если после перехода на ядро серии 2.6 ваша мышь перестала работать, то это, скорее всего, потому, что имя файла-устройсва мыши изменилось. Если поддержка мыши была реализована в виде модуля - то имя этого модуля тоже могло измениться.
sv: Precis som ovanstående ändringar i inmatningslagret, kan du även behöva konfigurera om X Window System och <package>gpm</package> om din mus inte fungerar efter uppgradering till en 2.6-kärna. Den mest troliga orsaken är att enheten som får data från musen har ändrats. Du kan även behöva att läsa in andra moduler.
zh_cn: 再一次地，因为输入层的改变，如果您在升级至 2.6 的内核后鼠标无法正常运作的话，您也许得要重新设置 X Window System 及 <package>gpm</package> 才行。这大多是因为负责读取鼠标资料的设备已经改变了，您也许还得载入其它额外的模块。

source: If you currently have X configured for <file>/dev/sunmouse</file>, you probably need to change this to <file>/dev/psaux</file>.
ja: 現在、X で <file>/dev/sunmouse</file> を設定しているなら、おそらく <file>/dev/psaux</file> へ変更する必要があります。
nl: Als u op dit moment X heeft geconfigureerd op <file>/dev/sunmouse</file>, zult u dit waarschijnlijk moeten aanpassen naar <file>/dev/psaux</file>.
pt: Se tem o seu X actualmente configurado para <file>/dev/sunmouse</file>, terá provavelmente que alterar para <file>/dev/psaux</file>.
ru: Если сейчас ваша X Window System настроена на использование <file>/dev/sunmouse</file>, то после установки нового ядра имя файла-устройства надо будет изменить на <file>/dev/psaux</file>.
sv: Om du för närvarande har X konfigurat för <file>/dev/sunmouse</file>, behöver du antagligen ändra det här till <file>/dev/psaux</file>.
zh_cn: 如果您目前已将 X 设为使用 <file>/dev/sunmouse</file>，您也许得将其修正为 <file>/dev/psaux</file>。

source: Sound configuration
ja: サウンドの設定
nl: Configuratie van de geluidskaart
pt: Configurar o som
ru: Настройка звука
sv: Ljudkonfiguration
zh_cn: 设置声音

source: For the 2.6 kernel series the ALSA sound drivers are recommended over the older OSS sound drivers. ALSA sound drivers are provided as modules by default. In order for sound to work, the ALSA modules appropriate for your sound hardware need to be loaded. In general this will happen automatically if you have, in addition to the <package>alsa-base</package> package, either the <package>hotplug</package> package or the <package>discover</package> package installed. The <package>alsa-base</package> package also "blacklists" OSS modules to prevent <prgn>hotplug</prgn> and <prgn>discover</prgn> from loading them. If you have OSS modules listed in <file>/etc/modules</file>, you should remove them.
ja: 2.6 カーネル用としては、OSS サウンドドライバよりも ALSA サウンドドライバが推奨されます。ALSA サウンドドライバは、デフォルトではモジュールとして提供されます。サウンドを鳴らすには、あなたのサウンドハードウェアに合ったモジュールがロードされる必要があります。一般に該当モジュールがあり、<package>alsa-base</package> に加えて <package>hotplug</package> パッケージか <package>discover</package> パッケージのいずれかがインストールされていれば、自動的にロードされます。<package>alsa-base</package> パッケージはまた、OSS モジュールが <prgn>hotplug</prgn> や <prgn>discover</prgn> によってロードされないようそれらを "ブラックリスト化" します。<file>/etc/modules</file> 内に OSS モジュールの記述があるなら、それらを削除すべきです。
pt: Para a série de kernels 2.6 os 'drivers' de som ALSA são recomendados em detrimento dos antigos 'drivers' de som OSS. Os 'drivers' de som ALSA são fornecidos, por omissão, como módulos. De modo a que o som funcione, precisam ser carregados os módulos ALSA apropriados para o seu hardware de som. De um modo geral isto acontece automaticamente, se adicionalmente possuir além do pacote <package>alsa-base</package>, ou o pacote <package>hotplug</package> ou o pacote <package>discover</package> instalado. O pacote <package>alsa-base</package> também torna os módulos OSS "blacklisted" para impedir que o <prgn>hotplug</prgn> e o <prgn>discover</prgn> os carreguem. Se tiver módulos OSS na lista em <file>/etc/modules</file>, deverá removê-los.
ru: В ядрах серии 2.6 драйверы звуковых устройств ALSA предпочтительнее драйверов OSS. Драйверы ALSA звуковых устройств поставляются по умолчанию в виде модулей. Чтобы звук заработал, нужно загрузить подходящие модули ALSA. Обычно это происходит автоматически, если у вас установлен пакет <package>alsa-base</package>, <package>hotplug</package>, или <package>discover</package>. Пакет <package>alsa-base</package> также отключит автоматическую загрузку OSS модулей (через blacklist) в пакетах <package>hotplug</package> и <package>discover</package>. Если в файл <file>/etc/modules</file> у вас включены модули OSS, то нужно их удалить.
sv: För 2.6-serien av kärnor rekommenderas ALSA-ljuddrivrutinerna framför de äldre OSS-ljuddrivrutinerna. ALSA-ljuddrivrutinerna tillhandahålls som standard som moduler. För att ljudet ska fungerar, måste ALSA-modulerna som lämpar sig för din ljudhårdvara läsas in. Generellt sett händer det här automatiskt om du har, i tillägg till <package>alsa-base</package>-paketet, antingen paketet <package>hotplug</package> eller paketet <package>discover</package> installerade. Paketet <package>alsa-base</package> "svartlistar" även OSS-moduler för att förhindra att <prgn>hotplug</prgn> och <prgn>discover</prgn> läser in dem. Om du har OSS-moduler listade i <file>/etc/modules</file>, bör du ta bort dem.
zh_cn: 在 2.6 系列的内核 里，比起使用旧式的 OSS 音效驱动程序，使用 ALSA 的音效驱动程序将会是个更佳选择。在默认上是以模块的方式提供 ALSA 音效驱动程序。为了让音效正确运作，必须为您的音效硬件载入适切的 ALSA 模块。如果您额外安装了 <package>alsa-base</package> 软件包、<package>hotplug</package> 软件包或是 <package>discover</package> 软件包，那么适切的 ALSA 模块会被自动载入。<package>alsa-base</package> 软件包同时也会将 OSS 模块"列入黑名单" 以防止它们被 <prgn>hotplug</prgn> 及 <prgn>discover</prgn> 载入。如果您在 <file>/etc/modules</file> 中有加入 OSS 模块，您应该将它们移除。

source: Switching to 2.6 may activate udev
ja: 2.6 系への変更で udev が起動
nl: Overschakelen naar 2.6 kan udev activeren
pt: Mudar para 2.6 pode activar o udev
ru: Переход на 2.6 может привести в действие udev
sv: Byte till 2.6 kan aktivera udev
zh_cn: 转换到 2.6 后可能会启用 udev

source: <package>udev</package> is a userspace implementation of devfs. It is mounted over the <file>/dev</file> directory and will populate that directory with devices supported by the kernel. It will also dynamically add and remove devices as kernel modules are loaded or unloaded respectively, working together with <package>hotplug</package> to detect new devices. <package>udev</package> works only with 2.6 kernels.
ja: <package>udev</package> は、devfs のユーザ空間での実装です。これは <file>/dev</file> ディレクトリにマウントされ、カーネルモジュールがロード・アンロードされるときにデバイスファイルをディレクトリに動的に作成・削除します。また、新しいデバイスの検出は、<package>hotplug</package> とともに動作するようになっています。<package>udev</package> は 2.6 系カーネルでしか動作しません。
pt: O <package>udev</package> é uma implementação 'userspace' do devfs. É montado no directório <file>/dev</file> e irá popular o directório com dispositivos suportados pelo seu kernel. Irá também adicionar e remover dinamicamente dispositivos à medida que módulos do kernel sejam respectivamente carregados ou descarregados, trabalhando em conjunto com o <package>hotplug</package> de modo a detectar novos dispositivos. O <package>udev</package>apenas funciona com kernels 2.6.
ru: <package>udev</package> -- это набор программ, реализующих файловую систему devfs на уровне приложений. devfs, будучи смонтирована в каталог <file>/dev</file>, динамически создаёт файлы устройств для загруженных модулей ядра. Она также динамически добавляет и удаляет устройства при загрузке и выгрузке модулей, работая вместе с пакетом <package>hotplug</package>, который автоматически определяет подключаемые к системе устройства. Пакет <package>udev</package> работает только с ядрами серии 2.6.
sv: <package>udev</package> är en implementation av devfs i användarrymden. Det monteras över katalogen <file>/dev</file> och befolkar den katalogen med enheter som stöds av kärnan. Det kommer även att dynamiskt lägga till och ta bort enheter som kärnmoduler läser in respektive tar bort, arbetar tillsammans med <package>hotplug</package> för att identifiera nya enheter. <package>udev</package> fungerar endast med 2.6-kärnor.
zh_cn: <package>udev</package> 是一个 devfs 在用户层级的实作。它挂载在 <file>/dev/</file> 目录下并能针对那些被内核所支持的设备进行即时的目录配置。它是借由和 <package>hotplug</package> 搭配合作的方式来探测新的设备，并能够在移除或载入内核 的模块的同时，动态得新增或移除相对应的设备。<package>udev</package> 仅能和 2.6 的 内核搭配运作。

source: As <package>udev</package> is automatically installed as a dependency of the new default initrd generator used with the 2.6 kernels (<package>initramfs-tools</package>), upgrading to a 2.6 kernel will normally result in <package>udev</package> being activated. You can avoid installing <package>udev</package> if you install an alternate initrd generator, such as <package>yaird</package>. <package>initramfs-tools</package> is the recommended initrd generator.
ja: 2.6 系カーネルでは、initrd の生成にデフォルトで <package>initramfs-tools</package> が使われます。このパッケージの依存関係により <package>udev</package> が自動的にインストールされます。そのため、2.6 系カーネルへのアップグレードにより、通常は <package>udev</package> が動くようになります。<package>yaird</package> など別の initrd 生成パッケージをインストールすれば、<package>udev</package> をインストールするのを回避できます。<package>initramfs-tools</package> が推奨される initrd 作成パッケージです。
zh_cn: 因为 <package>udev</package> 将会因为和 2.6内核 搭配使用的新 initrd 产生程序 (<package>initramfs-tools</package>) 有着依赖性而被自动安装。升级至 2.6 内核一般会启用 <package>udev</package>。如果您安装了其它的 initrd 产生程序，像是 <package>yaird</package>，您可以避免安装 <package>udev</package>。但在此建议使用 <package>initramfs-tools</package> 做为 initrd 的产生程序。
