Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: During the upgrade, you will be asked questions regarding the configuration or re-configuration of several packages. When you are asked if any file in the <file>/etc/init.d</file> or <file>/etc/terminfo</file> directories, or the <file>/etc/manpath.config</file> file should be replaced by the package maintainer's version, it's usually necessary to answer `yes' to ensure system consistency. You can always revert to the old versions, since they will be saved with a <tt>.dpkg-old</tt> extension.
ja: アップグレードの最中に、いくつかのパッケージの設定・再設定に関する質問が表示されます。<file>/etc/init.d</file> と <file>/etc/terminfo</file> ディレクトリに置かれるファイルと <file>/etc/manpath.config</file> に関しては、パッケージメンテナのバージョンに置き換えるようにしてください。システムの整合性を保つためには `yes' と答えることが必要になります。古いバージョンも <tt>.dpkg-old</tt> という拡張子で保存されていますので、戻すのはいつでもできます。
nl: Tijdens het opwaarderen zullen vragen worden gesteld met betrekking tot het (opnieuw) configureren van diverse pakketten. Als u wordt gevraagd of een bestand in de mappen <file>/etc/init.d</file> of <file>/etc/terminfo</file>, of het bestand <file>/etc/manpath.config</file> mag worden vervangen door de versie van de pakketbeheerder, zult u meestal bevestigend moeten antwoorden om de consistentie van het systeem te waarborgen. Het is altijd mogelijk om de oude versies te herstellen aangezien deze zullen worden bewaard met de extensie <tt>.dpkg-old</tt>.
pt: Durante a actualização, ser-lhe-ão colocadas questões relacionadas com a configuração ou re-configuração de vários pacotes. Quando lhe for perguntado se algum ficheiros dos directórios <file>/etc/init.d</file> ou <file>/etc/terminfo</file>, ou o ficheiro <file>/etc/manpath.config</file> deve ser substituído pela versão do 'maintainer' do pacote, normalmente é necessário responder afirmativamente para garantir a consistência do sistema. Pode sempre reverter à versão anterior, já que estas serão gravadas com uma extensão <tt>.dpkg-old</tt>.
ru: Во время обновления система будет задавать вам вопросы о настройке или перенастройке некоторых пакетов. Если вас спросят, нужно ли заменить какой-то файл в каталоге <file>/etc/init.d</file> или <file>/etc/terminfo</file> или файл <file>/etc/manpath.config</file> версией, предоставленной сопровождающим пакета, обычно следует ответить`да', поскольку иначе будет нарушена целостность системы. Вы всегда сможете вернуть старые настройки, потому что файлы конфигурации будут сохранены с расширением <tt>.dpkg-old</tt>.
sv: Under uppgraderingen kommer det att ställas frågor om konfiguration eller omkonfigurationen av flera paket. När du blir tillfrågad om någon fil i katalogerna <file>/etc/init.d</file> eller <file>/etc/terminfo</file>, eller filen <file>/etc/manpath.config</file> ska ersättas av paketansvariges version, är det oftast nödvändigt att svara "ja" för att upprätthålla systemets tillstånd. Du kan alltid återgå till de gamla versionerna, eftersom de kommer att sparas med en <tt>.dpkg-old</tt>-ändelse.
zh_cn: 在升级的过程中，系统可能会询问您一些问题，以便能对软件包进行设置或重新设置。当您被问到是否要把在 <file>/etc/init.d</file> 或 <file>/etc/terminfo</file> 目录中的文件或是 <file>/etc/manpath.config</file> 这个文件置换成软件包维护者所提供的版本时，您通常必须回答 `yes' 以维护系统的一致性。您可以在稍后再复原为旧的设置，因为它们都会以在档名后附加 <tt>.dpkg-old</tt> 的方式给保留下来。

source: If you're not sure what to do, write down the name of the package or file, and sort things out at a later time. You can search in the typescript file to review the information that was on the screen during the upgrade.
ja: どうすればよいかわからなくなったら、そのパッケージやファイルの名前を書き留めておいて、その問題解決は後回しにしましょう。typescript ファイルを検索すれば、アップグレードの最中に画面に表示された情報を見直すこともできます。
nl: Als u niet zeker weet wat u moet doen, schrijf dan de naam van het pakket of bestand op en zoek later uit wat er precies aan de hand is. Ook kunt u in het logbestand de informatie opzoeken die tijdens de opwaardering op het scherm werd getoond.
pt: Se tiver dúvidas sobre o que responder, anote o nome do pacote ou ficheiro e resolva as coisas mais tarde. Pode procurar o ficheiro transcrito de modo a rever a informação que esteve no ecrã durante a actualização.
ru: Если вы не уверены в том, что нужно делать, запишите имя пакета или файла и разберитесь с проблемой позднее. Информацию, выводившуюся на экран во время обновления, вы сможете найти в файле транскрипта.
sv: Om du inte är säker på vad som behöver göras, skriv ner namnet på paketet eller filen, och red ut saker och ting senare. Du kan söka i typescript-filen för att granska informationen som fanns på skärmen under uppgraderingen.
zh_cn: 如果您不太确定要怎么做的话，把软件包或文件的名称写下来，等稍后再慢慢将头绪理出来。您可以在记录档中搜寻，以便能重新检视在系统升级时出现在屏幕上的信息。

source: Upgrading your kernel and related packages
ja: カーネルと関連パッケージのアップグレード
pt: Actualizar o seu kernel e pacotes relacionados
ru: Обновление ядра и сопутствующих пакетов
sv: Uppgradera din kärna och relaterade paket
zh_cn: 替您的内核及相关软件包进行升级

source: You should upgrade the Linux kernel separately from the rest of your packages. You may wish to do so yourself, either by installing one of the <package>linux-image-*</package> packages or by compiling a customized kernel from sources. Please read the information in this section about potential issues with kernel upgrades.
ja: Linux カーネルは、他のパッケージとは別にアップグレードすべきです。そのようにしたい場合は、<package>linux-image-*</package> パッケージのどれか一つをインストールするか、カスタマイズしたカーネルをソースからコンパイルします。カーネルのアップグレードに伴って生じる可能性がある問題に関しては、本セクションの情報を参照してください。
pt: Deverá actualizar o kernel do Linux separadamente do resto dos seus pacotes. Pode querer fazê-lo você mesmo, ou através da instalação de um dos pacotes <package>linux-image-*</package> ou através da compilação de um kernel personalizado a partir do código fonte. Por favor leia a informação nesta secção sobre potenciais problemas com a actualização do kernel.
ru: Вы должны обновлять ядро Linux отдельно от остальных пакетов. Вы можете сделать это самостоятельно, установив один из пакетов <package>linux-image-*</package>, либо скомпилировав ядро из исходного кода. Обязательно прочитайте в этом разделе замечания о возможных проблемах при обновлениях ядра.
sv: Du bör uppgradera Linuxkärnan separat från resten av dina paket. Du kanske önskar att göra det på egen hand, antingen genom att installera ett av <package>linux-image-*</package>-paketen eller genom att bygga en anpassad kärna från källkod. Läs informationen i det här avsnittet om tänkbara problem vid kärnuppgraderingar.
zh_cn: 您应该在将您的软件包升级完毕后再各别进行 Linux 内核的升级。您也许会想要自行手动进行，像是安装某个 <package>linux-image-*</package> 软件包，或是从原始码中编译一个自订的内核。请参阅本节中有关在升级内核时所可能遇到的潜在问题以及相关信息。

source: All Linux kernel packages have been renamed from <package>kernel-*</package> to <package>linux-*</package> to clean up the namespace.
ja: 名前空間を整理するため、Linux カーネルパッケージはすべて <package>kernel-*</package> から <package>linux-*</package> に名前が変わりました。
pt: Todos os pacotes do kernel Linux mudaram de nome de <package>kernel-*</package> para <package>linux-*</package> de modo a limpar o espaço para o nome.
ru: Все пакеты с ядрами Linux были переименованы из <package>kernel-*</package> в <package>linux-*</package> для большей ясности в именах.
zh_cn: 为了避免名称上的混淆，所有的 Linux 内核软件包已由 <package>kernel-*</package> 更名为 <package>linux-*</package>。

source: If you are currently using a kernel from the 2.4 series, the older stable Linux kernel series, you should upgrade to a 2.6 series kernel, as 2.4 is no longer supported in &releasename;. If you are currently using a kernel from the 2.2 series, you must upgrade to (at least) the 2.4 series, preferably to a 2.6 series kernel, prior to upgrading your packages. Some general issues associated with an upgrade to 2.6 are documented in <ref id="upgrade-to-2.6">.
ja: Linux カーネル安定版の 1 つ前の系列である 2.4 系は &releasename; ではもうサポートされていないので、2.4 系のカーネルを使用中の場合は 2.6 系のカーネルにアップグレードすべきです。2.2 系のカーネルを使用中の場合は、その他のパッケージをアップグレードする前に、(最低でも) 2.4 系の、できれば 2.6 系のカーネルにアップグレードしなければなりません。2.6 系へのアップグレードに伴う一般的な問題点がいくつか、<ref id="upgrade-to-2.6"> に記載されています。
zh_cn: 如果您还在使用着 2.4 系列的内核，也就是旧的稳定版的 Linux内核 系列，您应该升级到 2.6 系列的内核，因为 2.4 系列已不再被 &releasename; 支持了。如果您还在使用着 2.2 系列的内核，在更新您的软件包之前，您（至少）应该升级到 2.4 系列的内核，若能升级到 2.6 系列的内核就再好不过了。一些在升级至 2.6 时所会伴随出现的常见问题已记述在 <ref id="upgrade-to-2.6"> 了。

source: Upgrading from a 2.6 kernel
ja: 2.6 系カーネルからのアップグレード
zh_cn: 由某个 2.6 版的内核进行升级

source: If you are currently running a 2.6 series kernel from &oldreleasename; you will have to upgrade to the latest version of <package>coreutils</package> before you upgrade to the 2.6 series kernel available in &releasename;. In order to do this you first have to do a minimal upgrade of the system, a full upgrade of the system packages (as described in <ref id="upgradingpackages">) is not an option since the <prgn>udev</prgn> version in &releasename; does not support 2.6.8 kernels, conversely the <prgn>udev</prgn> version in &oldreleasename; will not work properly with the latest kernels.
ja: 現在 &oldreleasename; で 2.6 系カーネルを使用している場合は、&releasename; で利用できる 2.6 系カーネルにアップグレードする前に <package>coreutils</package> を最新バージョンにアップグレードしなければなりません。そのためには、まずシステムの最小限のアップグレードを実施しなければなりません。システムのパッケージを完全にアップグレードするという (<ref id="upgradingpackages"> で説明するような) 選択肢はありません。何故なら、&releasename; に含まれているバージョンの <prgn>udev</prgn> はカーネル 2.6.8 をサポートしておらず、逆に、&oldreleasename; に含まれるバージョンの <prgn>udev</prgn> は最新のカーネルでは正しく動作しないからです。
zh_cn: 如果您正在使用着由 &oldreleasename; 所提供的 2.6 系列的内核，在您升级至 &releasename; 所提供的 2.6 系列的内核之前，您必须先升级到最新版本的 <package>coreutils</package>。为此，您首先必须替您的系统做个小小的升级。无法直接进行全系统软件包升级的原因是因为在 &releasename; 里的 <prgn>udev</prgn> 版本并不支持 2.6.8 版的内核，换言之，在 &oldreleasename; 里的 <prgn>udev</prgn> 版本将无法在最新的内核上正常运作。

source: initrd-tools deprecated
ja: initrd-tools の廃止
pt: initrd-tools depreciado
ru: Пакет initrd-tools устарел
sv: initrd-tools är utfasat
zh_cn: initrd-tools 已被废弃

source: <package>initrd-tools</package> is no longer supported and has been superseded by <package>initramfs-tools</package> and <package>yaird</package>. Upgrading to an &releasename; kernel will cause <package>initramfs-tools</package> to be installed by default. <![ %defaulted-2.4 [ If you are upgrading from a 2.4 kernel to a 2.6 kernel for the first time, you must use <package>initramfs-tools</package>. Using <package>yaird</package> will cause linux-image-2.6 installations to fail if you are running a 2.2 or 2.4 kernel. ]]>
ja: <package>initrd-tools</package> はもうサポートされなくなり、<package>initramfs-tools</package> と <package>yaird</package> がそれにとって代わりました。&releasename; のカーネルにアップグレードすると、デフォルトでは <package>initramfs-tools</package> がインストールされます。<![ %defaulted-2.4 [初めて 2.4 系カーネルから 2.6 系カーネルにアップグレードする場合は、<package>initramfs-tools</package> を使用しなければなりません。2.2 系や 2.4 系のカーネルの上で <package>yaird</package> を使用すると、linux-image-2.6 のインストールは失敗に終わります。]]>
pt: O pacote <package>initrd-tools</package> não é mais suportado e foi substituído pelo <package>initramfs-tools</package> e pelo <package>yaird</package>. A actualização para um kernel da &releasename; irá provocar a instalação por omissão de <package>initramfs-tools</package>. <![ %defaulted-2.4 [ Se estiver a actualizar um kernel 2.4 para um 2.6 pela primeira vez, terá que utilizar <package>initramfs-tools</package>. Utilizar o <package>yaird</package> irá provocar uma falha na instalação da linux-image-2.6 se estiver a correr um kernel 2.2 ou 2.4. ]]>
ru: Пакет <package>initrd-tools</package> больше не поддерживается и был заменён на <package>initramfs-tools</package> и <package>yaird</package>. По умолчанию при обновлении ядра в &releasename; происходит установка <package>initramfs-tools</package>. <![ %defaulted-2.4 [ При обновлении ядра с 2.4 на 2.6, вы должны использовать <package>initramfs-tools</package>. Использование <package>yaird</package> приведёт к ошибке установки linux-image-2.6, если машина работает на ядре из веток 2.2 или 2.4. ]]>
sv: <package>initrd-tools</package> stöds inte längre och har ersatts av paketen <package>initramfs-tools</package> och <package>yaird</package>. Uppgradering till en &releasename;-kärna kommer att innebära att <package>initramfs-tools</package> blir installerad som standard. <![ %defaulted-2.4 [ Om du uppgraderar från en 2.4-kärna till en 2.6-kärna för första gången måste du använda <package>initramfs-tools</package>. Användning av <package>yaird</package> kommer att orsaka att installationer av linux-image-2.6 misslyckas om du kör en 2.2- eller 2.4-kärna. ]]>
zh_cn: <package>initrd-tools</package> 已不再被支持且已被 <package>initramfs-tools</package> 及 <package>yaird</package> 所取代。若要升级 &releasename; 版的内核 将会默认安装 <package>initramfs-tools</package>。<![ %defaulted-2.4 [ 如果这是您第一次由 2.4 版升级至 2.6 版的内核，您必须使用 <package>initramfs-tools</package>。如果您正在使用着 2.2 或 2.4 版的内核，使用 <package>yaird</package> 将会导致 linux-image-2.6 安装失败。]]>

source: devfs deprecated
ja: devfs の廃止
pt: devfs depreciado
ru: Пакет devfs устарел
sv: devfs är utfasat
zh_cn: devfs 已被废弃

source: &releasename; no longer provides support for <prgn>devfs</prgn>. It is recommended that users switch to <package>udev</package> for dynamic <file>/dev</file> management. Debian kernels no longer include support for <prgn>devfs</prgn>, so <prgn>devfs</prgn> users will need to convert their systems manually before upgrading to an &releasename; kernel.
ja: &releasename; では、<prgn>devfs</prgn> のサポートはもう提供していません。ユーザは、動的な <file>/dev</file> の管理に <package>udev</package> を使用するよう切り換えることが推奨されています。Debian のカーネルには <prgn>devfs</prgn> のサポートがもう含まれていないので、<prgn>devfs</prgn> ユーザは、&releasename; のカーネルにアップグレードする前に手作業でシステムを切り換える必要があります。
pt: A &releasename; não fornece suporte a <prgn>devfs</prgn>. É recomendado que os utilizadores mudem para <package>udev</package> para gestão dinâmica <file>/dev</file>. Os kernels Debian não incluem mais suporte para <prgn>devfs</prgn>, assim os utilizadores de <prgn>devfs</prgn> terão de converter os seus sistemas manualmente antes da actualização para um kernel &releasename;.
ru: В &releasename; больше не поддерживается <prgn>devfs</prgn>. Для динамического управления каталогом <file>/dev</file> рекомендуется использовать <package>udev</package>. Ядра Debian больше не содержат поддержку <prgn>devfs</prgn>, поэтому пользователям <prgn>devfs</prgn> нужно вручную преобразовать их системы перед обновлением на ядро из &releasename;.
zh_cn: &releasename; 已不再提供对 <prgn>devfs</prgn> 的支持。在此建议用户替而使用 <package>udev</package> 来进行动态的 <file>/dev</file> 管理。Debian内核 已不再提供对 <prgn>devfs</prgn> 的支持，所以 <prgn>devfs</prgn> 的用户在升新至 &releasename; 的内核之前必须手动进行转换。

source: If you see the string 'devfs' in <file>/proc/mounts</file>, you are most likely using <prgn>devfs</prgn>. Any config files that reference <prgn>devfs</prgn> style names will need to be adjusted to use <prgn>udev</prgn> style names. Files that are most likely to refer to <prgn>devfs</prgn> style device names are <file>/etc/fstab</file>, <file>/etc/lilo.conf</file>, <file>/boot/grub/menu.lst</file>, etc.
ja: <file>/proc/mounts</file> に 'devfs' という文字列が見つかる場合、おそらく <prgn>devfs</prgn> が使用されています。<prgn>devfs</prgn> スタイルの名前を参照している設定ファイルはすべて、<prgn>udev</prgn> スタイルの名前を使用するよう調整する必要があります。<prgn>devfs</prgn> スタイルのデバイス名を参照している可能性が最も高いファイルには、<file>/etc/fstab</file> や <file>/etc/lilo.conf</file>、<file>/boot/grub/menu.lst</file> などがあります。
zh_cn: 如果您在 <file>/proc/mounts</file> 里有看到 'devfs' 这个字符串，那么您十之八九正在使用着 <prgn>devfs</prgn>。所有还在使用着 <prgn>devfs</prgn> 版的名称的设置必须要修正为指向 <prgn>udev</prgn> 版的名称。一些很可能会使用着 <prgn>devfs</prgn>版的设备名称有 <file>/etc/fstab</file>、<file>/etc/lilo.conf</file>、<file>/boot/grub/menu.lst</file> 等等。

source: More information about potential issues is available in bug report <url id="http://bugs.debian.org/341152" name="#341152">.
ja: 生じる可能性がある問題に関するさらに詳しい情報が、バグ報告 <url id="http://bugs.debian.org/341152" name="#341152"> で入手可能です。
pt: Mais informação sobre problemas potencias está disponível nos relatórios de erro (bug reports) <url id="http://bugs.debian.org/341152" name="#341152">.
ru: Подробности о возможных проблемах есть в отчёте об ошибке <url id="http://bugs.debian.org/341152" name="#341152">.
sv: Mer information om tänkbara problem finns tillgängligt i felrapporten <url id="http://bugs.debian.org/341152" name="#341152">.
zh_cn: 可以在错误回报 <url id="http://bugs.debian.org/341152" name="#341152"> 里取得一些可能的问题的更详尽信息。

source: Standard kernels have SMP abilities
ja: 標準のカーネルで SMP を使用できます
zh_cn: 标准的内核将支持 SMP

source: Multiprocessor systems no longer require a *-smp flavour of the Linux kernel. For &arch-title; linux-image packages without the -smp suffix support both uniprocessor and multiprocessor systems.
ja: マルチプロセッサシステムには、Linux カーネルの *-smp フレーバーはもう必要ありません。&arch-title; では、-smp という接尾辞のない linux-image パッケージはユニプロセッサとマルチプロセッサの両方のシステムをサポートしています。
pt: Os sistemas multi-processador não requerem mais uma versão *-smp do kernel Linux. Para a &arch-title; os pacotes linux-image sem o sufixo -smp suportam ambos os sistemas com processados único ou multi-processador.
ru: Для многопроцессорных систем больше не нужны *-smp варианты ядра Linux. Для &arch-title; в пакеты linux-image без суффикса -smp включена поддержка однопроцессорных и многопроцессорных систем.
sv: Flerprocessorsystem kräver inte längre en *-smp-variant av Linuxkärnan. För &arch-title; har linux-image-paketen utan ändelsen -smp, stöd för både en- och flerprocessorsystem.
zh_cn: 多处理器的系统已不再需要使用 *-smp 类别的 Linux内核 了。在 &arch-title; 里，没有加上 -smp 字尾的 linux-image 软件包将会同时支持了单处理器和多处理器。

source: 386 kernel flavour deprecated
ja: 386 カーネルフレーバーの廃止
pt: versão 386 do kernel depreciado
ru: Вариант ядра 386 устарел
sv: Kärnvarianten 386 är utfasad
zh_cn: 386 类别的内核已被废弃

source: Support for the 80386 sub-archicture for &arch-title; has been dropped in &releasename;. The 386 kernel flavor is no longer supported and has been replaced by the new 486 flavour.
ja: &releasename; では、&arch-title; の 80386 サブアーキテクチャのサポートがなくなりました。386 カーネルフレーバーはもうサポートされず、新しい 486 フレーバーによって置き換えられました。
pt: O suporte para a subarquitectura 80386 para a &arch-title; foi abandonada. A versão 386 do kernel não é mais suportada e foi substituída pela nova versão 486.
ru: В &releasename; была прекращена поддержка субархитектуры 80386 для &arch-title;. Вариант ядра 386 больше не поддерживается и был заменён новым вариантом 486.
sv: Stöd för underarkitekturen 80386 för &arch-title; har plockats bort i &releasename;. Kärnvarianten 386 stöds inte längre och har ersatts av den nya varianten 486.
zh_cn: 在 &releasename;. 里，&arch-title; 对于 80386 子平台的支持已经终止。386 类别的内核已被废弃且已被新的 486 类别所取代。

source: Device enumeration reordering
ja: デバイスの整列順序の変更
pt: Reordenação da enumeração de dispositivos
ru: Переопределение нумерации устройств
sv: Ny ordning för enhetsnumrering
zh_cn: 重新排序设备列表

source: &releasename; features a more robust mechanism for hardware discovery than previous releases. However, this may cause changes in the order devices are discovered on your system affecting the order in which device names are assigned. For example, if you have two network adapters that are associated with two different drivers, the devices eth0 and eth1 refer to may be swapped. Please note that the new mechanism means that if you e.g. exchange ethernet adapters in a running &releasename; system, the new adapter will also get a new interface name.
ja: &releasename; は、以前のリリースよりも強固なハードウェア検出機構を特徴とします。しかし、それによってシステム上のデバイス検出順が変わり、それがデバイス名の割り当て順に影響するかもしれません。例えば、2 つの異なるドライバと結び付いた 2 つのネットワークアダプタがある場合、eth0 と eth1 が参照するデバイスは入れ替わるかもしれません。この新しい機構によって、例えば実行中の &releasename; システムでイーサネットアダプタを交換するなどした場合、新しいアダプタにも新しいインタフェース名が割り当てられるようになる、ということに注意してください。
pt: A &releasename; oferece um mecanismo mais robusto para a descoberta de hardware do que as versões anteriores. No entanto, poderá ocorrer alterações na ordem de descoberta dos dispositivos do seu sistema, afectando a ordem em que os mesmos são atribuídos. Por exemplo, se possuir duas placas de rede que estejam associadas a dois controladores diferentes, os dispositivos eth0 e eth1 podem ser trocados. Por favor note que o novo mecanismo significa que se por ex. trocar as placas de rede num sistema &releasename; a correr, a nova placa de rede terá também um nome diferente.
ru: В &releasename; имеется более мощный механизм обнаружения аппаратных средств, чем в предыдущих выпусках. Однако это может привести к изменению порядка обнаруженных устройств в системе, что повлияет на назначенные имена устройств. Например, если у вас есть две сетевые карты, которые работают через разные драйверы, то устройства eth0 и eth1 могут поменяться местами! Обратите внимание на то, что новый механизм работает так, что если вы, например, поставите другую карту ethernet в систему с &releasename;, то новой карте будет присвоено новое имя интерфейса.
sv: &releasename; har en mer robust mekanism för att identifiera hårdvara än tidigare utgåvor. Dock kan den här orsaka ändringar på den ordning som enheter identifieras på ditt system vilket påverkar ordningen i vilken enhetsnamnen tilldelas. Om du till exempel har två nätverkskort som associeras med två olika drivrutiner, kan de enheter som eth0 och eth1 refererar till ändras. Observera att den nya mekanismen betyder att om du t.ex. byter Ethernet-kort på ett körande &releasename;-system, kommer det nya kortet även att få ett nytt gränssnittsnamn.
zh_cn: 比起先前的释出版本，&releasename; 在判断硬件设备方面提供了一个更为稳健的机制。然而，这将可能会改变在您的系统上所找到的硬件的顺序，进而会影响到所使用的设备名称。比如说，如果您有着两片使用着不同的驱动程序的网络卡，那么 eth0 和 eth1 的顺序很可能会互换。请注意到，新的机制也代表了如果您像是置换了正在运作中的 &releasename; 系统上的网络卡，新的网络卡将会拿到一个新的界面名称。

source: For network devices, you can avoid this reordering by using the <prgn>ifrename</prgn> utility to bind physical devices to specific names at boot time. See <manref section="8" name="ifrename"> and <manref section="5" name="iftab"> for more information. You can also avoid this by using <prgn>udev</prgn> rules, more specifically, through the definitions at <file>/etc/udev/rules.d/z25_persistent-net.rules</file><footnote><p>The rules there are automatically generated to have persistent names for network interfaces</p></footnote>. Both alternatives (<prgn>ifrename</prgn> and <prgn>udev</prgn>) should not be used at the same time.
ja: ネットワークデバイスについては、<prgn>ifrename</prgn> ユーティリティを用いて起動時に物理デバイスを特定の名前に結び付けることで、この順序の変更を防げます。さらに詳しくは、<manref section="8" name="ifrename"> と <manref section="5" name="iftab"> を参照してください。ネットワークデバイスの順序の変更は、<prgn>udev</prgn> のルール、具体的には <file>/etc/udev/rules.d/z25_persistent-net.rules</file> 内の定義を使用しても防げます<footnote><p>このファイル内のルールは自動的に生成され、ネットワークインタフェースの永続的な名前を保持します。</p></footnote>。<prgn>ifrename</prgn> と <prgn>udev</prgn> は二者択一で、同時に使用すべきではありません。
