Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: <strong>Important!</strong> Do not change any lines that begin with <tt>deb cdrom:</tt>. Doing so would invalidate the line and you would have to run <prgn>apt-cdrom</prgn> again. Do not be alarmed if a 'cdrom' source line refers to "<tt>unstable</tt>". Although confusing, this is normal.
ja: <strong>重要!</strong>: <tt>deb cdrom:</tt> で始まっている行は、絶対に変更しないでください。変更するとその行は無効になって、もう一度 <prgn>apt-cdrom</prgn> を実行しなければならなくなるでしょう。'cdrom' ソースが "<tt>unstable</tt>" を指定していても心配しないでください。混乱するかもしれませんが、これで正常なのです。
nl: <strong>Belangrijk!</strong> Wijzig geen regels die beginnen met <tt>deb cdrom:</tt>. Als u dit wel doet, maakt dat de regel ongeldig en zult u de CD opnieuw moeten inlezen met <prgn>apt-cdrom</prgn>. Er is geen reden om verontrust te worden als een 'cdrom' bronregel verwijst naar "<tt>unstable</tt>"; dit is, hoewel verwarrend, normaal.
pt: <strong>Importante!</strong> Não altere nenhuma linha que comece por <tt>deb cdrom:</tt>. Ao fazê-lo pode invalidar a linha e terá que correr o <prgn>apt-cdrom</prgn> de novo. Não se alarme se uma linha da fonte 'cdrom' refere <tt>unstable</tt>". Apesar de confuso, é normal.
ru: <strong>Внимание!</strong> Не исправляйте строки, начинающиеся с <tt>deb cdrom:</tt>!. Если вы исправите такую строку, то вам придётся снова запускать <prgn>apt-cdrom</prgn>. Не беспокойтесь, если источник "cdrom" ссылается на нестабильный ("<tt>unstable</tt>") дистрибутив. Как это ни странно, так и должно быть.
sv: <strong>Viktigt!</strong> Ändra inte några rader som börjar med <tt>deb cdrom:</tt>. Om du gör det så ogiltigförklaras raden och du måste köra <prgn>apt-cdrom</prgn> igen. Bli inte rädd om en "cdrom"-källrad refererar till "<tt>unstable</tt>". Även om det är förvirrande, är det normalt.
zh_cn: <strong>极重要！</strong> 不要修改任何以 <tt>deb cdrom:</tt> 开头的项目。否则，这些项目将会因而无法使用，使得您只能再执行一次 <prgn>apt-cdrom</prgn>。如果您发现某个 'cdrom' 的来源项目是指向 "<tt>unstable</tt>" 时请不要觉得太讶异。虽然有点奇怪，但这却是很正常的。

source: If you've made any changes, save the file and execute
ja: 変更が済んだら、ファイルを保存してから
pt: Se efectuar algumas alterações, grave o ficheiro e execute-o
ru: Если вы внесли какие-нибудь изменения, сохраните файл и выполните команду
sv: Om du har gjort några ändringar, spara filen och kör
zh_cn: 如果您进行了任何改变，将文件保存并执行

source: to refresh the package list.
ja: と実行して、パッケージリストを更新してください。
pt: para refrescar a lista de pacotes.
ru: для обновления списка пакетов.
sv: för att uppdatera paketlistan.
zh_cn: 来更新软件包的列表。

source: &debian; again ships with several desktop applications and environments. Amongst others it now includes the desktop environments GNOME 2.14<footnote>With some modules from GNOME 2.16</footnote>, KDE 3.5.5a, and Xfce 4.4. Productivity applications have also been upgraded, including the office suites OpenOffice.org 2.0.4a and KOffice 1.6 as well as GNUcash 2.0.5, GNUmeric 1.6.3 and Abiword 2.4.6
zh_cn: &debian; 再次搭载了众多的桌面应用软件及桌面环境。其中，像是包含了<footnote>采用一些来自 GNOME 2.16 的模块</footnote>的桌面环境 GNOME 2.14、KDE 3.5.5a 及 Xfce 4.4。还有一些能提升工作效率的软件，包含办公室套件 OpenOffice.org 2.0.4a 及 KOffice 1.6 和 GNUcash 2.0.5、GNUmeric 1.6.3 及 Abiword 2.4.6。

source: TODO: Document improvements which users installing etch will see but not those upgrading from sarge. For more information see <url id="http://wiki.debian.org/Sarge2EtchUpgrade" name="the wiki pages">.
zh_cn: 待完成：记述当用户安装 etch 时将会感受到但是由 sarge 升级却无法知觉的改进。请参考 <url id="http://wiki.debian.org/Sarge2EtchUpgrade" name="Wiki 页面"> 以取得更详尽信息。

source: portmap bound to loopback by default
zh_cn: portmap 在默认上会使用 loopback

source: mail server not listening to connections per default
zh_cn: 邮件服务器默认上不会监听任何连线

source: development packages now priority optional, will not get installed (#301138)
zh_cn: 现在定开发用软件包的优先权已改为非强制性，将不会被安装 (#301138)

source: filesystem improvements
zh_cn: 文件系统的改进

source: localization-config NOT installed by d-i, needs to be run separately
zh_cn: D-I 将不再安装 localization-config，必须得分别执行

source: Some users may have unofficial backported "newer" versions of packages that <em>are</em> in Debian installed on their &oldreleasename; system. Such packages are most likely to cause problems during an upgrade as they may result in file conflicts<footnote>Debian's package management system normally does not allow a package to remove or replace a file owned by another package; not unless it has been defined to replace that package.</footnote>. Section <ref id="trouble"> has some information on how to deal with file conflicts if they should occur.
pt: Alguns utilizadores poderão ter versões "mais recentes" de pacotes não oficiais ('backported') que <em>estão</em> instalados na Debian no seu sistema &oldreleasename;. Estes pacotes irão provavelmente criar problemas durante a actualização, pois podem criar conflitos <footnote>O sistema de gestão de pacotes Debian normalmente não permite que um ficheiro seja removido ou substituído por outro pertencente a outro pacote; a não ser que tenha sido definido substituir esse pacote.</footnote>. A secção <ref id="trouble"> tem alguma informação acerca de como lidar com conflitos de ficheiros se estes ocorrerem.
zh_cn: 也许有些用户会在他们的 &oldreleasename; 上安装了在 Debian <em>已</em>有软件包的非官方但"较新" 的 backported 版本。这些软件包很可能在升级的时候产生文件冲突的问题，<footnote>因为 Debian 的软件包管理程序不允许某一个软件包移除或取代了属于另一个软件包的档案，除非那一个软件包本来就是用来取代这个软件包的。</footnote>。在 <ref id="trouble"> 那一节有一些当发生了文件冲突时该如何解决的信息。

source: The typescript will also allow you to review information that has scrolled off-screen. Just switch to VT2 (using <tt>Alt-F2</tt>) and, after logging in, use <tt>less -R ~root/upgrade-to-&releasename;.typescript</tt> to view the file.
zh_cn: 而这些记录文件也可以让您重新检查那些已被卷出屏幕之外的信息。请切换至第二个虚拟终端机 VT2（使用 <tt>Alt-F2</tt>），在登录之后，使用 <tt>less ~root/upgrade-to-&releasename;.typescript</tt> 来浏览这个文件。

source: First the list of available packages for the new release needs to be fetched. This is done by executing<footnote>We use <prgn>apt-get</prgn> for this because the &oldreleasename; version <prgn>aptitude</prgn> may fail when new sources have been added to <file>sources.list</file>.</footnote>:
pt: Primeiro tem de ser obtida a lista de pacotes disponíveis para a nova versão. Isto é feito ao executar <footnote>Usamos <prgn>apt-get</prgn> para esta operação porque a versão do <prgn>aptitude</prgn> da &oldreleasename; pode falhar quando novas fontes tenham sido adicionadas a <file>sources.list</file>.</footnote>:
zh_cn: 首先，必须从新的发行版中取得可使用软件包的列表。要达到这个目的，请执行<footnote>我们在此使用 <prgn>apt-get</prgn> 是因为当新的来源被加入 <file>sources.list</file> 后，&oldreleasename; 版的 <prgn>aptitude</prgn> 可能会无法正常运作。</footnote>：

source: <em>TODO</em>: Describe the steps for this minimal upgrade, should take care of glibc, initrd-tools and udev + linux-image 2.6.
zh_cn: <em>待完成</em>：说明最低升级的步骤，应对 glibc、initrd-tools 及 udev + linux-image 2.6 特别注意。

source: For network devices, you can avoid this reordering by using the <prgn>ifrename</prgn> utility to bind physical devices to specific names at boot time. See <manref section="8" name="ifrename"> and <manref section="5" name="iftab"> for more information. You can also avoid this by using <prgn>udev</prgn> rules, more specifically, through the definitions at <file>/etc/udev/rules.d/z25_persistent-net.rules</file><footnote> The rules there are automatically generated to have persistent names for network interfaces</footnote>. Both alternatives (<prgn>ifrename</prgn> and <prgn>udev</prgn>) should not be used at the same time.
zh_cn: 对于网络设备而言，您可以使用 <prgn>ifrename</prgn> 工具程序在开机时替实体设备指定特定的名称来避开这个问题。请参阅 <manref section="8" name="ifrename"> 及 <manref section="5" name="iftab"> 以取得更详尽的信息。您也可以利用 <prgn>udev</prgn> 的规则；更明确得说，经由 <file>/etc/udev/rules.d/z25_persistent-net.rules</file> 里的定义来避开这个问题。<footnote>在此的规则是替网络界面自动产生连续的名称</footnote>。这两个方案（<prgn>ifrename</prgn> 及 <prgn>udev</prgn>）只能择一使用，无法同时采用。

source: If you are using <package>lilo</package> as your bootloader (it is the default bootloader for &oldreleasename;) it is strongly recommended that you rerun lilo after the upgrade:
zh_cn: 如果您还是使用 <package>lilo</package> 做为您的开机程序（它是 &oldreleasename 默认的开机程序），在此强烈建议您在升级完毕后重新执行 lilo：

source: If you forgot to rerun <prgn>lilo</prgn> before the reboot or the system is accidentally rebooted before you could do this manually, your system might fail to boot. Instead of the lilo prompt, you will only see <em>LI</em> when booting the system<footnote>For more information on <prgn>lilo</prgn>'s boot error codes please see <url id="http://tldp.org/HOWTO/Bootdisk-HOWTO/a1483.html" name="The Linux Bootdisk HOWTO">.</footnote>. In order to recover from this you will have to start up a media installation disk in <em>rescue</em> mode. For more information on how to do this please review the <url id="http://wiki.debian.org/DebianInstaller/FAQ" name="DebianInstaller FAQ">.
zh_cn: 如果您在重新开机之前忘了执行 <prgn>lilo</prgn>，或者是在您有机会手动执行之前系统意外得重新开机了，您的系统很可能会因而无法开机。在开机时，您将看不到 lilo 提示字符，取而代之的是 <em>LI</em>。<footnote>有关 <prgn>lilo</prgn> 的开机错误信息之更详尽信息请参考 <url id="http://tldp.org/HOWTO/Bootdisk-HOWTO/a1483.html" name="The Linux Bootdisk HOWTO"></footnote>。为了进行救援，您必须利用安装媒体开机并以 <em>rescue</em> 模式启动。对于如何进行的更多详尽信息请参考 <url id="http://wiki.debian.org/DebianInstaller/FAQ" name="Debian 安装程序 问题与解答">。

source: Introducing several thousand new packages, &releasename; also retires and omits more than two thousand old packages that were in &oldreleasename;. It provides no upgrade path for these obsolete packages. While nothing prevents you from continuing to use an obsolete package where desired, the Debian project will usually discontinue security support for it a year after &releasename;'s release<footnote>Or for as long as there is not another release in that time frame. Typically only two stable releases are supported at any given time.</footnote>, and will not normally provide other support in the meantime. Replacing them with available alternatives, if any, is recommended.
pt: Ao introduzir vários milhares de novos pacotes, a &releasename; também retira e omite mais de dois mil pacotes antigos que estavam na &oldreleasename;.Não fornece um caminho de actualização destes pacotes obsoletos. Enquanto nada o impede de continuar a usar um pacote obsoleto enquanto o desejar, o projecto Debian irá normalmente descontinuar o suporte de segurança para o mesmo um ano depois do lançamento da &releasename; <footnote>Ou enquanto não existir outra versão nessa duração de tempo. Tipicamente apenas duas versões estáveis são suportadas ao mesmo tempo.</footnote> e não fornece normalmente outro suporte durante o mesmo. Substitui-lo com alternativas disponíveis, se existirem é recomendado.
zh_cn: 虽然在 &releasename; 里采用了数千个新的软件包，但它同时也撤除并舍弃了超过两千个曾经包含在 &oldreleasename; 里的旧软件包。它将不会再提供这些已遭废弃的软件包任何的升级途径，虽然我们并不会禁止您企图继续使用这些已遭废弃的软件包，但依惯例，在 &releasename; 发布的一年之后 Debian 专案将不会再针对它们继续提供安全上的支持<footnote>或是直到在这段期间内有新的发行版推出为止。基本上，我们只会同时维护两个 stable 的发行版。</footnote>，而除此之外，我们在这段期间内一般并不会再提供其它方面的支持。如果可以的话，我们建议您能采用其它的替代方案来取代这些软件包。

source: Users who require ACPI support on these systems may install a Linux 2.6.19 or later kernel. Please see Debian bug <url id="http://bugs.debian.org/404143" name="#404143"> and <url id="http://bugs.debian.org/400488" name="#400488">, and Linux内核's bugs <url id="http://bugzilla.kernel.org/show_bug.cgi?id=5534" name="#5534"> and <url id="http://bugzilla.kernel.org/show_bug.cgi?id=7122" name="#7122"> for additional information.
zh_cn: 在这些系统上有需要用到 ACPI 支持的用户可以安装 Linux 2.6.19 或更新版的 kernel。请参阅 Debian bug <url id="http://bugs.debian.org/404143" name="#404143"> 及 <url id="http://bugs.debian.org/400488" name="#400488">，以及 Linux内核 的 bugs <url id="http://bugzilla.kernel.org/show_bug.cgi?id=5534" name="#5534"> 及 <url id="http://bugzilla.kernel.org/show_bug.cgi?id=7122" name="#7122"> 以取得更多详尽信息。

source: For some SATA disk controllers, the device assigned to a drive and its partitions may change from <file>/dev/hdX</file> to <file>/dev/sdX</file>. If this happens, you will have to modify your <file>/etc/fstab</file> and bootloader configuration accordingly. Unless these changes are made correctly, your system may not boot correctly<footnote>It will boot the kernel but will fail when trying to mount the root filesystem and will abort with an error <em>waiting for root filesystem</em> followed by <em>unable to mount /dev/hdX ..not found</em>. You can use the <prgn>initramfs</prgn> shell to fix this issue, after you identify the names newly assigned devices in the kernel boot messages or by reviewing the contents of <file>/dev/disk</file>.</footnote>.
zh_cn: 在一些 SATA 硬盘控制器里，将指派给硬盘及其分区的设备由 <file>/dev/hdX</file> 改变为 <file>/dev/sdX</file>。如果真的如此，您必须适当得修改您的 <file>/etc/fstab</file> 及开机程序的设置。在这些变更被正确得修改之前，您的系统可能会无法正常开机。<footnote>它将能够启动内核但是会在试着挂载 root 文件系统时失败，且将会跳出并留下如下错误 <em>waiting for root filesystem</em> 以及 <em>unable to mount /dev/hdX ..not found</em>。您可以利用内核开机信息确认指派给设备的新名称或是重新查看<file>/dev/disk</file>，然后使用 <prgn>initramfs</prgn> 的 Shell 来修正这个问题。

source: The Mozilla programs are important tools for many users. Unfortunately the upstream security policy is to urge users to update to new upstream versions, which conflicts with Debian's policy not to ship large functional changes in security updates. We cannot predict it today, but during lifetime of &releasename; the Debian Security Team may come to a point where supporting Mozilla products is no longer feasible and announce the end of security support for Mozilla products. You should take this into account when deploying Mozilla and consider alternatives available in Debian if the absence of security support would pose a problem for you.
pt: Os produtos Mozilla são ferramentas importantes para muitos utilizadores. Infelizmente a política de manutenção da segurança impele os utilizadores a actualizar para novas versões que entram em conflito com a política da Debian de não enviar grandes alterações funcionais nas actualizações de segurança. Não podemos prever hoje mas durante o período de vida da &releasename;, a equipa de segurança da Debian pode chegar a um ponto onde o suporte aos produtos Mozilla não seja comportável e anuncie o fim do suporte de segurança para os produtos Mozilla. Deverá ter isto em conta quando instalar o Mozilla e considerar alternativas disponíveis na Debian se a ausência de suporte de segurança é algo que constitui um problema para si.
ru: Программы Mozilla являются важными инструментами для многих пользователей. К сожалению, политика безопасности разработчиков Mozilla принуждает пользователей обновляться до новой версии, которую выпустил разработчик, что противоречит политике Debian не делать больших функциональных изменений при обновлениях безопасности. Мы не можем ничего предсказать, но во время жизни &releasename; команда безопасности Debian может подойти к такому моменту, когда поддержка продуктов Mozilla станет невозможной, и ей придётся объявить о прекращении обеспечения безопасности продуктов Mozilla. Вы должны принять это во внимание при развёртывании Mozilla и рассмотреть альтернативы, имеющиеся в Debian, если отсутствие поддержки в области безопасности создаст проблему для вас.
sv: Mozilla-programmen är viktiga verktyg för många användare. Tyvärr är säkerhetspolicyn att skynda på användare att uppdatera till nya versioner, vilket är i konflikt med Debians policy att inte skicka ut stora funktionella ändringar i säkerhetsuppdateringar. Vi kan inte förutse det här idag, men under livstiden för &releasename; kan Debians säkerhetsteam kommer att till en punkt där stöd för Mozilla-produkter inte längre är möjlig och annonsera ut slutet för säkerhetsstöd för Mozilla-produkter. Du bör tänka på det här när du installerar Mozilla och övervägar alternativ som finns tillgängliga i Debian om avsaknaden av säkerhetsstöd skulle vara ett problem för dig.
zh_cn: Mozilla 程序对于很多用户而言是很重要的工具。但很不幸的，它的上游的安全策略就是鼓励用户升级到新的版本。这和 Debian 尽量不要在安全更新里提供太多功能上的变化的政策是相互扺触的。我们无法在此预言，但在 &releasename; 存在的期间，Debian 安全团队有可能会走到再也无法继续维护 Mozilla 程序，只好宣布中止对 Mozilla 程序的安全支持这一步。您应该在布署 Mozilla 前先慎重考虑这个问题，如果没有安全支持对您会造成困扰的话，请考虑使用 Debian 的其它程序替代。

source: Default editor changed to nano
zh_cn: 将默认的编辑器变更为 nano

source: The default editor for default installations in &releasename; is <package>nano</package>. Previous Debian releases set the default editor for all users to <package>vim</package>, in this release the default behaviour has changed and users will get a more user-friendly editor.
zh_cn: 在 &releasename; 上默认会安装的编辑器为 <package>nano</package>。之前 Debian 释出版是将所有用户的默认编辑器设置为 <package>vim</package>，在这个释出版中默认的方式已有所改变且用户会拥有一个更易于操作的编辑器。

source: Users wishing to retain the previous behaviour can either define the environment variable <em>EDITOR</em> by introducing the following lines in their own profiles:
zh_cn: 那些希望保留原有方式的用户可以指定 <em>EDITOR</em> 环境变数。请在他们的 profiles 中加入以下几行：

source: Administrators that wish to change the behaviour for all users will have to update the alternatives system using:
zh_cn: 而如果管理者希望改变所有用户的操作模式，可以更新偏好系统如下：

source: Release Notes for &debian; &release; ("&releasename"), &arch-title;
sv: Kommentarer till utgåvan &debian; &release; ("&releasename"), &arch-title;

source: The most recent version of this document is always available at <url id="&url-release-notes;">. If your version is more than a month old, you might wish to download the latest version.]
sv: Den senaste versionen av det här dokumentet finns alltid tillgängligt på <url id="&url-release-notes;">. Om din version är äldre än en månad, kanske du vill hämta den senaste versionen.]

source: TODO: Update numbers
pt: TODO: Actualização os números
ru: TODO: Обновить номера
sv: ATTGÖRA: Uppdatera siffror

source: This new release of Debian again comes with a lot more software than its predecessor &oldreleasename;; the distribution includes over 9000 new packages. Most of the software in the distribution has been updated: almost 6500 software packages (this is 73% of all packages in &oldreleasename;). Also, a significant number of packages have for various reasons been removed from the distribution. You will not see any updates for these packages and they will be marked as 'obsolete' in package management front-ends.
pt: Este novo lançamento da Debian vem com muito mais software que a sua predecessora &oldreleasename;;, a distribuição inclui mais de 9000 novos pacotes. A maior parte do software na distribuição foi actualizada: quase 6500 pacotes de software (são 73% dos pacotes da &oldreleasename;). Do mesmo modo um número significativo de pacotes foi removido da distribuição por várias razões. Não verá quaisquer actualizações para estes pacotes e estes estarão marcados como obsoletos nos 'front-ends' dos gestores de pacotes.
ru: Новый выпуск Debian опять содержит намного больше программ, чем предшественник, &oldreleasename;; дистрибутив включает в себя более 9000 новых пакетов. Большая часть программ входящих в дистрибутив была обновлена: почти 6500 пакетов (что составляет 73% дистрибутива &oldreleasename;). Также, по различным причинам многие пакеты были удалены из дистрибутива. Эти пакеты не будут обновлены, в программах управления пакетами они будут помечены как "устаревшие" (obsolete).
sv: Den här nya utgåvan av Debian kommer med en ännu fler programvaror än dess föregångare, &oldreleasename;; distributionen inkluderar över 9000 nya paket. Större delen av programvaran i distributionen har uppdaterats: nästan 6500 programvarupaket (det här är 73% av alla paket i &oldreleasename;). Ett stort antal paket har av olika anledningar tagits bort från distributionen. Du kommer inte att se några uppdateringar för dessa paket och de kommer att markeras som "föråldrade" i pakethanteraren.

source: &debian; again ships with current desktop applications. Amongst others it now includes GNOME 2.14, KDE 3.5 and OpenOffice.org 2.0.
pt: A &debian; volta a incluir aplicações actuais de desktop. Entre outras agora inclui GNOME 2.14, KDE 3.5 e OpenOffice.org 2.0.
ru: Кроме этого, в &debian; вошли современные версии пользовательских приложений. Среди них стоит выделить GNOME 2.14, KDE 3.5 и OpenOffice.org 2.0.
sv: &debian; levereras med aktuella skrivbordsprogram. Bland annat inkluderas nu GNOME 2.14, KDE 3.5 och OpenOffice.org 2.0.

source: In these Release Notes we'll only list the major changes in the installer. If you are interested in an overview of the detailed changes since &oldreleasename;, please check the release announcements for the &releasename; beta and RC releases avaiable from the project's <url id="&url-installer-news" name="news history">.
sv: I dessa Kommentarer till utgåva kommer vi endast att lista de större ändringarna i installeraren. Om du är intresserad i en översikt över detaljerade ändringar sedan &oldreleasename;, se utgåveinformationerna för beta- och RC-utgåvorna av &releasename; från projektets <url id="&url-installer-news" name="nyhetshistorik">.

source: The installer will set up systems to use UTF-8 encoding rather than the old language-specific encodings (like ISO-8859-1, EUC-JP or KIO-8).
sv: Installeraren kommer att konfigurera system till att använda teckenkodningen UTF-8 istället för de gamla språkspecifika teckenkodningarna (t.ex. ISO-8859-1, EUC-JP eller KIO-8).

source: It is now possible to set up file systems on an LVM volume using guided partitioning.
sv: Det är nu möjligt att konfigurera filsystem på en LVM-volym med en guidad partitionering.

source: If you prefer a graphical user interface, try booting the the installer with <tt>installgui</tt>.
pt: Se preferir uma interface gráfica de utilizador tente arrancar o instalador com <tt>installgui</tt>.
sv: Om du föredrar ett grafiskt användargränssnitt kan du prova att starta upp installeraren med <tt>installgui</tt>.

source: Thanks to the huge efforts of translators, Debian can now be installed in up to $FIXME$ languages. <![ %g-i [ If the graphical user interface is used, an additional $FIXME$ languages are supported. ]]>
sv: Tack vare stora arbetsinsatser från översättarna kan nu Debian installeras på upp till $FIXME$ olika språk. <![ %g-i [ Om det grafiska användargränssnittet används stöds ytterligare $FIXME$ språk. ]]>

source: Unlike for the previous release, the installation system will again offer to install the <package>popularity-contest</package> package.
pt: Tal como o lançamento anterior, o sistema de instalação irá novamente oferecer-se para instalar o pacote <package>popularity-contest</package>.
ru: В отличие от предыдущего выпуска, программа установки вновь предложит вам установить пакет <package>popularity-contest</package>.
sv: Till skillnad mot den förra utgåvan föreslår installationssystemet en installation av paketet <package>popularity-contest</package>.

source: Both <prgn>aptitude</prgn> and <prgn>apt</prgn> will show you detailed information of the disk space needed for the installation. You can see this estimate before executing the actual upgrade running:
sv: Både <prgn>aptitude</prgn> och <prgn>apt</prgn> kommer att visa detaljerad information om det diskutrymme som behövs för installationen. Du kan se det här estimatet innan den faktiska uppgraderingen påbörjas genom att köra:

source: Remove old packages you no longer use. If you have <prgn>popularity-contest</prgn> installed you can use <prgn>popcon-largest-unused</prgn> to list the packages you do not use in the system that occupy the most space. You can also use <prgn>deborphan</prgn> or <prgn>debfoster</prgn> to find obsolete packages (see <ref id="obsolete">)
sv: Ta bort gamla paket som du inte längre använder. Om du har <prgn>popularity-contest</prgn> installerat kan du använda <prgn>popcon-largest-unused</prgn> för att lista paketen som du inte använder i systemet och som tar upp mest utrymme. Du kan även använda <prgn>deborphan</prgn> eller <prgn>debfoster</prgn> för att hitta föråldrade paket (se <ref id="obsolete">)
