Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: Some packages from &oldreleasename; have been split into several packages in &releasename;, often to improve system maintainability. To ease the upgrade path in such cases, &releasename; often provides "dummy" packages: empty packages that have the same name as the old package in &oldreleasename; with dependencies that cause the new packages to be installed. These "dummy" packages are considered obsolete packages after the upgrade and can be safely removed.
ja: &oldreleasename; のいくつかのパッケージは &releasename; では複数のパッケージに分割されていますが、これは大半がシステムの保守性を改善するためです。この場合におけるアップグレードを容易にするために、&releasename; はしばしば "ダミーの" パッケージ - &oldreleasename; での古いパッケージと同じ名前で、新規パッケージを導入するための依存関係を備えた空のパッケージ - を提供しています。これらの "ダミー" パッケージはアップグレード後は Obsolete 扱いとされ、安全に削除することができます。
nl: Sommige pakketten uit &oldreleasename; zijn gesplitst naar meerdere pakketten in &releasename;, vaak met als reden verbeterd systeembeheer. Om de opwaardering van dergelijke pakketten te vereenvoudigen, zijn in &releasename; vaak "dummypakketten" opgenomen: dit zijn "lege" pakketten met dezelfde naam als het oude pakket in &oldreleasename; met afhankelijkheden die ervoor zorgen dat de vervangende pakketten worden geïnstalleerd. Deze dummypakketten hebben na de opwaardering geen functie meer en kunnen dan veilig worden verwijderd.
pt: Alguns pacotes da &oldreleasename; foram separados em vários pacotes da &releasename;, principalmente para melhorar a manutenção do sistema. Para facilitar a actualização em alguns casos, a &releasename; fornece pacotes "dummy": pacotes vazios que têm o mesmo nome que o pacote antigo na &oldreleasename; com dependências que provocam a instalação de novos pacotes. Estes pacotes "dummy" são considerados pacotes obsoletos depois da actualização e podem ser seguramente removidos.
ru: Многие пакеты из &oldreleasename; в &releasename; были поделены на несколько разных пакетов, чаще всего чтобы облегчить поддержку системы. Для простоты обновления в состав &releasename; нередко входит пакет-"пустышка" (пустой пакет с именем старого пакета из &oldreleasename;). Такой пакет при установке устанавливает новые пакеты, от которых зависит. Сразу же после установки "пустышки" становятся неиспользуемыми и их можно спокойно удалять.
sv: Vissa paket från &oldreleasename; har delats upp i flera paket i &releasename;, ofta för att förbättra systemunderhållet. För att göra uppgraderingssättet enklare i sådana fall, tillhandahåller &releasename; ofta så kallade "dummy"-paket: tomma paket som har samma namn som det gamla paketet i &oldreleasename; med beroenden som gör att de nya paketen blir installerade. Dessa "dummy"-paket anses som föråldrade paket efter uppgraderingen och kan med säkerhet tas bort.
zh_cn: 有时为了让系统能更易于管理，有些原来是包含于 &oldreleasename; 的软件包在 &releasename; 里已被分开成数个软件包。在此况状下，为了能让升级的过程更加顺遂，&releasename; 通常会采取提供 替代 (Dummy) 软件包的方式：使用一个和原本是包含于 &oldreleasename; 的软件包相同名称的软件包，但它的内容却是空的，但利用依赖上的关联性来使得新的软件包能被安装。这些替代软件包在升级之后就会被视同废弃软件包了，您可以放心得移除它们。

source: Most (but not all) dummy packages' descriptions indicate their purpose. Package descriptions for dummy packages are not uniform, however, so you might also find <prgn>deborphan</prgn> with the <tt>--guess</tt> options useful to detect them in your system. Note that some dummy packages are not intended to be removed after an upgrade but are, instead, used to keep track of the current available version of a program over time.
ja: 大半の (すべてではない) ダミーパッケージの説明文には、その目的が記されています。しかしながらダミーパッケージの説明文は統一されていないため、自分のシステム内のダミーパッケージを検出するために <prgn>deborphan</prgn> を <tt>--guess</tt> オプション付で使うこともできます。いくつかのダミーパッケージは、アップグレード後に削除されることを意図しておらず、代わりに時間とともに変化するプログラムの利用可能な最新バージョンの記録用として使われることに注意してください。
nl: Voor de meeste, maar niet all, dummypakketten is hun functie weergegeven in de pakketomschrijving. Pakketomschrijvingen voor dummypakketten zijn echter niet uniform en daarom kan ook <prgn>deborphan</prgn> met de <tt>--guess</tt> opties handig zijn om ze op uw systeem te vinden. merk op dat sommige dummypakketten niet zijn bedoeld om te worden verwijderd na een opwaardering, maar juist om ervoor te zorgen dat te allen tijde de courante versie van een programma is geïnstalleerd.
pt: A maior parte (mas nem todas) das descrições dos pacotes 'dummy' indicam o seu propósito. As descrições dos pacotes para os pacotes 'dummy' não são uniformes, no entanto pode achar as opções <tt>--guess</tt> do <prgn>deborphan</prgn> úteis para as detectar no seu sistema. Note que alguns pacotes 'dummy' não têm como fim serem removidos depois de uma actualização, em vez disso, são usadas para seguir o caminho das actuais versões disponíveis de um programa ao longo do tempo.
ru: В описании большинства (но не всех) пакетов-пустышек ясно указано их предназначение. К сожалению, никаких правил для описания пустышек нет, поэтому для их обнаружения вам может пригодиться <prgn>deborphan</prgn> с опцией <tt>--guess</tt>. Некоторые пустышки удалять после обновления не нужно, так как они впоследствии используются для определения установленной версии программы.
sv: Beskrivningarna för de flesta (men inte alla) dummy-paket indikerar deras syfte. Paketbeskrivningar för dummy-paket är inte enhetliga, dock kan <prgn>deborphan</prgn> med flaggan <tt>--guess</tt> vara användbar för att identifiera dem på ditt system. Observera att vissa dummy-paket inte är tänkta att tas bort efter en uppgradering men används istället för att hålla kontroll på den för närvarande tillgängliga versionen av ett program över tid.
zh_cn: 大多数（但不是所有）的替代软件包会在软件包的说明中会介绍它们的用途，虽然它们的说明的格式并不统一，所以您可能会发现 <prgn>deborphan</prgn> 在搭配 <tt>--guess</tt> 选项时可以轻易得把它们从您的系统中找出来。请注意，有些替代软件包并不希望您在升级后就将其删除，因为日后您可以替而使用它来跟踪是否有任何新版本出现。

source: Issues to be aware of for &releasename;
ja: &releasename; で知っておくべき問題点
nl: Belangrijke aandachtspunten voor &releasename;
pt: Problemas a estar atento em &releasename;
ru: Что надо знать о &releasename;
sv: Eventuella problemsituationer för &releasename;
zh_cn: 在 &releasename; 您必须知道的一些问题

source: Potential problems
ja: 生じうる問題
pt: Potenciais problemas
ru: Возможные проблемы
sv: Tänkbara problem
zh_cn: 潜在的问题

source: Sometimes, changes have side-issues we cannot reasonably avoid, or we expose bugs somewhere else. We document here the issues we are aware of. Please also read the errata, the relevant packages' documentation, bug reports and other information mentioned in <ref id="morereading">.
ja: 変化には当然のように副作用がつきもので、どこか他の場所でバグを出してしまうこともあります。ここには現時点で私たちが知っている問題点を記載しています。正誤表・関連パッケージの付属文書・バグ報告や、<ref id="morereading">で触れられているその他の情報も読んでください。
pt: Por vezes, as alterações trazem efeitos secundários que não podem ser facilmente evitados, ou activam erros (bugs) noutro lado. São aqui documentadas essas questões que foram detectadas. Por favor leia também a errata, a documentação de pacotes relevantes, relatórios de erro e outra documentação mencionada em <ref id="morereading">.
ru: Иногда перемены к лучшему имеют побочные эффекты, которых мы не можем избежать без появления ошибок где-нибудь ещё. Здесь мы опишем проблемы, которые уже известны. Прочитайте также список известных ошибок, соответствующую документацию на пакеты, отчёты об ошибках и другую информацию, указанную в <ref id="morereading">.
sv: Ibland kan ändringar ge sidoeffekter som vi rimligen inte kan undvika, eller att vi blottlägger fel någon annanstans. Vi dokumenterar de problem vi känner till här. Läs även Errata, de relevanta paketens dokumentation, felrapporter och annan information som nämns i <ref id="morereading">.
zh_cn: 有时，更动会产生一些我们无法有效避免的次要问题，或者是会导致我们在其它地方遇到错误。我们在此记述了一些我们所知道的问题。请同时参阅勘误表、相关软件包之说明文件、错误回报及其它在 <ref id="morereading"> 中所提及的信息。

source: Certain networking site cannot be reached by TCP
ja: ネットワーク上のあるサイトに TCP が届かなくなりました
pt: Determinado site web não pode ser alcançado via TCP
ru: Некоторые сайты в сети недоступны по TCP
sv: Vissa nätverksplatser kan inte nås med TCP
zh_cn: 有些网络站台无法用 TCP 连线。

source: Since 2.6.17, Linux aggresively uses TCP window scaling which is specified in RFC 1323. Some servers have a broken behaviour, and announce wrong window sizes for themselves. Please see the bugs <url id="http://bugs.debian.org/381262" name="#381262"> and <url id="http://bugs.debian.org/395066" name="#395066"> for more information.
ja: 2.6.17 以降の Linux は、RFC 1323 で指定された TCP ウィンドウのスケーリングを積極的に使用しています。サーバによってはこれに対しておかしな挙動を示し、ウィンドウサイズを誤って認識することがあります。さらに詳しくはバグ <url id="http://bugs.debian.org/381262" name="#381262"> と <url id="http://bugs.debian.org/395066" name="#395066"> を参照してください。
zh_cn: 从 2.6.17 开始，Linux 决定采用 RFC 1323 所说明的 TCP window scaling。有些服务器对此适应不良，并会发送错误的 window 大小。请参阅 <url id="http://bugs.debian.org/381262" name="#381262"> 及 <url id="http://bugs.debian.org/395066" name="#395066"> 以取得更详尽信息。

source: Automatic poweroff stops working
ja: 自動電源オフが機能しなくなりました
pt: O encerramento automático deixou de funcionar
ru: Больше не работает автоматическое отключение питания
sv: Automatisk avstängning av strömmen slutar fungera
zh_cn: 自动关机无法正常运作

source: On some older systems, <tt>shutdown -h</tt> may not power off the system anymore (but just stop it). This happens because apm needs to be used there. Adding <tt>acpi=off apm=power_off</tt> to the kernel's command line, e.g. in <package>grub</package> or <package>lilo</package> configuration files should fix this issue. Please see bug <url id="http://bugs.debian.org/390547" name="#390547"> for additional information.
ja: 一部の古いシステムでは、もはや <tt>shutdown -h</tt> で電源がオフにならないかもしれません (しかしシステムの停止だけはします)。これは、電源オフに apm を使用する必要があるためです。<package>grub</package> や <package>lilo</package> の設定ファイルでの指定などを通じて、カーネルのコマンドラインに <tt>acpi=off apm=power_off</tt> を追加すれば、この問題は解決するかもしれません。さらに詳しくはバグ <url id="http://bugs.debian.org/390547" name="#390547"> を参照してください。
pt: Em alguns sistemas mais antigos o <tt>shutdown -h</tt> pode deixar de desligar o sistema (apenas pará-lo). Isto acontece devido ao uso necessário do apm neste ponto. Adicionar <tt>acpi=off apm=power_off</tt> à linha de comando do kernel, e.g. nos ficheiros de configuração do <package>grub</package> ou <package>lilo</package> deverá corrigir esta questão. Por favor veja o erro <url id="http://bugs.debian.org/390547" name="#390547"> para mais informação.
ru: На некоторых старых системах команда <tt>shutdown -h</tt> может больше не выключать питание системы (но останавливает её). В этих случаях нужно использовать apm. Добавление <tt>acpi=off apm=power_off</tt> в командную строку ядра, например в конфигурационные файлы <package>grub</package> или <package>lilo</package> должно решить проблему. Подробней смотрите ошибку <url id="http://bugs.debian.org/390547" name="#390547">.
zh_cn: 在一些较为老旧的系统上，<tt>shutdown -h</tt> 将再也无法将系统关机了。（只能做到停止运作）。这是因为在此必须使用 apm 才行。请在像是 <package>grub</package> 或 <package>lilo</package> 的设置文件里，在内核的命令行上新增 <tt>acpi=off apm=power_off</tt> 应该就能解决这个问题。请参阅 <url id="http://bugs.debian.org/390547" name="#390547"> 以取得更多详尽信息。

source: Apt downloads small files with update
ja: Apt が更新時に小さなファイルをダウンロードするようになりました
pt: O apt descarrega ficheiros pequenos com a actualização
ru: Apt загружает маленькие файлы по команде update
sv: Apt hämtar små filer med uppdateringar
zh_cn: Apt 会在更新时下载小档案

source: Support has been added to <prgn>apt</prgn> to download only the difference between packages files. This is handy for people with bad network connections, but people having a very nearby mirror may want to disable this feature. One can disable it by adding <tt>Acquire::Pdiffs "false";</tt> to <file>/etc/apt/apt.conf</file>.
ja: Packages ファイルの差分のみをダウンロードするようなサポートが <prgn>apt</prgn> に加えられました。この機能は、ネットワーク接続が大変な人々には便利ですが、非常に近くにミラーがある人々はこの機能を無効にしたいと思うかもしれません。無効にするには、<file>/etc/apt/apt.conf</file> に <tt>Acquire::Pdiffs "false";</tt> を追加してください。
pt: Foi adicionado suporte ao <prgn>apt</prgn> para que apenas descarregue as diferenças entre ficheiros de pacotes. Isto é útil para pessoas com conexões de rede de má qualidade, no entanto para pessoas próximas de um 'mirror' podem querer desactivar esta funcionalidade. Esta pode ser desactivada adicionando <tt>Acquire::Pdiffs "false";</tt>para <file>/etc/apt/apt.conf</file>.
ru: В <prgn>apt</prgn> была добавлена поддержка загрузки только различий между файлами packages. Это удобно пользователям с неустойчивым подключением к сети, но людям с близколежащим сервером-зеркалом можно выключить эту возможность. Для этого добавьте <tt>Acquire::Pdiffs "false";</tt> в файл <file>/etc/apt/apt.conf</file>.
zh_cn: <prgn>apt</prgn> 新增了只会下载软件包之间的差异文件的功能。这对于那些有着糟糕的网络环境的人们有极大的助益。但有些有着速度不错的镜像站的人们可能想要关闭这个功能。要关闭这个功能只要将 <tt>Acquire::Pdiffs "false";</tt> 加到 <file>/etc/apt/apt.conf</file> 里即可。

source: ACPI support disabled for some HP laptop models in &releasename; kernel
ja: &releasename; のカーネルでは一部の HP ラップトップモデルの ACPI サポートが無効になっています
zh_cn: 在 &releasename; 的内核里，有些 HP 笔记型电脑机种的 ACPI 支持被关闭了

source: Certain models of HP laptops have an ACPI BIOS that is incompatible with the Linux 2.6.18 kernel shipped in &releasename;, which would prevent the fans from spinning up leading to unnecessary heat stress. Also, fans might not work after the system is suspedend. The kernel therefore disables ACPI support internally when it detects certain ACPI BIOS versions. Models known to be affected by this change include the HP nx6125, nx6120, nx6325, nc6120 and nc6000 models.
ja: HP ラップトップの一部のモデルでは、ACPI BIOS が、&releasename; 付属の Linux 2.6.18 カーネルと非互換になりました。この変更によりファンの回転数が上がらなくなり、不必要な熱応力が生じるでしょう。また、システムのサスペンド後にファンが働かなくなる可能性があります。そのため、ACPI BIOS の特定のバージョンを検出すると、カーネルは内部的に ACPI サポートを無効にします。この変更が関係することがわかっているモデルには、HP nx6125、nx6120、nx6325、nc6120、nc6000 などがあります。
zh_cn: &releasename; 所搭载的 Linux 2.6.18内核和有些 HP 笔记型电脑机种里，用来防止风扇因旋转而导致的热压的 ACPI BIOS 不相容；而同时，在系统待机后，风扇可能会不再运转。因此，当内核探测到这些 ACPI BIOS 版本的话，会从内部将 ACPI 的支持关闭。已知受此影响的包括了 HP nx6125、nx6120、nx6325、nc6120 及 nc6000 机种。

source: Users who require ACPI support on these systems may install a Linux 2.6.19 or later kernel. Please see Debian bug <url id="http://bugs.debian.org/404143" name="#404143"> and <url id="http://bugs.debian.org/400488" name="#400488">, and Linux Kernel's bugs <url id="http://bugzilla.kernel.org/show_bug.cgi?id=5534" name="#5534"> and <url id="http://bugzilla.kernel.org/show_bug.cgi?id=7122" name="#7122"> for additional information.
ja: これらのシステムで ACPI サポートが必要なユーザは、2.6.19 以降の Linux カーネルをインストールするとよいでしょう。さらに詳しい情報は、Debian のバグ <url id="http://bugs.debian.org/404143" name="#404143"> や <url id="http://bugs.debian.org/400488" name="#400488">、そして Linux Kernel のバグ <url id="http://bugzilla.kernel.org/show_bug.cgi?id=5534" name="#5534"> や <url id="http://bugzilla.kernel.org/show_bug.cgi?id=7122" name="#7122"> を参照してください。

source: Upgrading to a 2.6 kernel
ja: 2.6 系カーネルへのアップグレード
nl: Opwaarderen naar een kernel uit de 2.6 serie
pt: Actualizar para um kernel 2.6
ru: Обновление ядра до версии 2.6
sv: Uppgradera till en 2.6-kärna
zh_cn: 将内核升级至 2.6

source: The 2.6 kernel series contains major changes from the 2.4 series. Modules have been renamed and a lot of drivers have been partially or sometimes almost completely rewritten. Upgrading to a 2.6 kernel from an earlier version is therefore not a process to be undertaken lightly. This section aims to make you aware of some of the issues you may face.
ja: 2.6 系カーネルは、2.4 系カーネルから大きな変更が加えられています。モジュールの名称が変更され、多くのドライバが部分的あるいはほとんど完全に書き換えられました。したがって、以前のバージョンから 2.6 系カーネルへのアップグレードは、それほど簡単に済ませられるものではありません。このセクションは、直面するかもしれない問題のいくつかを知っておいてもらおうというのが狙いです。
nl: De 2.6 kernel serie bevat significante wijzigingen ten opzichte van de 2.4 serie. Modules zijn hernoemd en een groot aantal stuurprogramma's is gedeeltelijk of soms bijna geheel herschreven. Het opwaarderen naar een 2.6 kernel vanaf een eerdere versie is daarom niet een proces dat licht mag worden opgenomen. Deze paragraaf heeft tot doel u bewust te maken van een deel van de hindernissen die u kunt tegenkomen.
pt: A série de kernels 2.6 contém alterações importantes a partir da série 2.4. Os módulos foram renomeados e muitos 'drivers' foram parcial ou muitas vezes totalmente reescritos. A actualização para um kernel 2.6 a partir de uma versão anterior não é um processo para ser encarado levianamente. Esta secção procura alertá-lo para alguns problemas que poderá enfrentar.
ru: Ядра серии 2.6 сильно отличаются от ядер серии 2.4. Модули ядра были переименованы, многие драйверы были частично (а иногда и полностью) переписаны. Поэтому к обновлению с предыдущих ядер до 2.6 не следует относиться легкомысленно. В этом разделе вы узнаете о некоторых проблемах, с которыми вы, возможно, столкнётесь.
sv: 2.6-serien av kärnan innehåller stora ändringar mot 2.4-serien. Moduler har bytt namn och en hel del drivrutiner har till viss del eller ibland skrivits om totalt. Uppgradering till en 2.6-kärna från en tidigare version är därför inte en process som ska underskattas. Det här avsnittet har som mål att göra dig medveten om några av problemen du kan möta.
zh_cn: 和 2.4 系列的内核 相较，2.6 系列包含了很多重大的改变。像是模块的名称已经有所不同， 有不少的驱动程序被局部甚至是完全改写。所以要把一些旧有版本的 内核升级至 2.6 并不会是件容易事。这段章节的目的就是要让您知道一些您可能会遇到的问题。

source: You are therefore strongly advised not to upgrade to a 2.6 kernel as part of the upgrade from &oldreleasename; to &releasename;. Instead, you should first make sure your system works correctly with either the old kernel or with a 2.4 kernel from &releasename; and do the upgrade to a 2.6 kernel later as a separate project.
ja: それゆえ、&oldreleasename; から &releasename; へのアップグレードの一部として 2.6 系カーネルへのアップグレードを行うのはお勧めしません。まずは、システムが &releasename; の 2.4 系 (もしくはそれ以前のバージョンの) カーネルで正しく動作するのを確認すべきです。その後、別の課題として、2.6 系カーネルへのアップグレードを実施してください。
nl: U wordt daarom dringend geadviseerd om de opwaardering naar een 2.6 kernel niet uit te voeren als onderdeel van de migratie van &oldreleasename; to &releasename;. In plaats daarvan kunt u zich er beter eerst van verzekeren dat uw systeem goed werkt met ofwel de oude kernel ofewl een 2.4 kernel uit &releasename; en de opwaardering naar een 2.6 later als een afzonderlijk project ter hand te nemen.
pt: Fica seriamente avisado para não efectuar a actualização para um kernel 2.6 como parte da actualização da &oldreleasename; para &releasename;. Em vez disso, deverá primeiro certificar-se que o sistema funciona correctamente tanto com o kernel antigo ou o kernel 2.4 da &releasename; e efectuar a actualização para um kernel 2.6 mais tarde como um projecto diferente.
ru: Для начала, мы настоятельно не рекомендуем вам менять ядро одновременно с обновлением всей системы &oldreleasename; на &releasename;. Сначала убедитесь, что система нормально работает с вашим старым ядром (или с ядром 2.4 из &releasename;), а затем отдельно обновите ядро до 2.6.
sv: Du råds därför att inte uppgradera till en 2.6-kärna som del av uppgraderingen från &oldreleasename; till &releasename;. Du bör istället först se till att ditt system fungerar korrekt med antingen den gamla kärnan eller med en 2.4-kärna från &releasename; och sedan göra uppgraderingen till en 2.6-kärna.
zh_cn: 所以，在此强烈建议您不要把升级至 2.6内核 做为将 &oldreleasename; 升级至 &releasename; 的计划的一部份。您的首要工作应该是确认您的系统和旧的内核或是 &releasename; 上的 2.4 系列的内核搭配时能够正常运作。而将内核升级至 2.6 则应该视为个别的计划。

source: If you compile your own kernel from source, make sure you install <package>module-init-tools</package> before you reboot with the 2.6 kernel. This package replaces <package>modutils</package> for 2.6 kernels. If you install one of the Debian <package>linux-image</package> packages, this package will be installed automatically because of dependencies.
ja: ソースから自分でカーネルをコンパイルしている人は、2.6 系カーネルで再起動する前に、<package>module-init-tools</package> がインストールされているのを確認してください。このパッケージは、<package>modutils</package> を 2.6 系カーネル用のものに置き換えます。Debian の <package>linux-image</package> パッケージのどれかを使っている場合は、依存関係により自動的にこのパッケージが入っているはずです。
pt: Se compilar o seu próprio kernel a partir das fontes, certifique-se que instala o <package>module-init-tools</package> antes de reiniciar o sistema com o kernel 2.6. Este pacote substitui o <package>modutils</package> para os kernels 2.6. Se instalar um dos pacotes Debian <package>linux-image</package>, este será instalado automaticamente porque causa das dependências.
ru: Если вы планируете скомпилировать собственное ядро, то перед перезагрузкой с ядром 2.6 убедитесь, что пакет <package>module-init-tools</package> установлен. Этот пакет заменяет <package>modutils</package> для ядер серии 2.6. При установке любого из пакетов <package>linux-image</package>, пакет <package>module-init-tools</package> будет установлен автоматически по зависимости.
sv: Om du bygger din egna kärna från källkod, se till att du installerar <package>module-init-tools</package> före du startar om med 2.6-kärnan. Det här paketet ersätter <package>modutils</package> för 2.6-kärnor. Om du installerar ett av Debians <package>linux-image</package>-paket, kommer det här paketet att installeras automatiskt på grund av beroenden.
zh_cn: 如果您是自行由源码来编译内核 的，请在使用 2.6内核 来重新开机前确认您已安装了 <package>module-init-tools</package>。这个软件包在 2.6 的内核 里是用来取代 <package>modutils</package> 的。如果您安装了任何的 <package>linux-image</package> 软件包，这个软件包会因依赖上的因素而被自动地安装上去。

source: If you use <em>LVM</em>, you should also install <package>lvm2</package> before you reboot as the 2.6 kernel does not directly support LVM1. To access LVM1 volumes, the compatibility layer of <package>lvm2</package> (the dm-mod module) is used. You can leave <package>lvm10</package> installed; the init scripts will detect which kernel is used and execute the appropriate version.
ja: <em>LVM</em> を使っている場合は、2.6 系カーネルで再起動する前に <package>lvm2</package> パッケージもインストールしてください。2.6 系カーネルは LVM1 を直接はサポートしていません。LVM1 のボリュームにアクセスするには、<package>lvm2</package> の互換レイヤ (dm-mod モジュール) が使われます。初期化スクリプトがどのバージョンのカーネルが使われているかを検出し、適切なバージョンを実行するので、<package>lvm10</package> はインストールしたままでも構いません。
nl: Als u gebruik maakt van <em>LVM</em> dient u tevens <package>lvm2</package> te installeren voordat u het systeem opnieuw opstart aangezien de 2.6 kernel LVM1 niet direct ondersteunt. Voor het benaderen van bestaande LVM1 volumes zal de compatibiliteitslaag van <package>lvm2</package> (de module dm-mod) worden gebruikt. U hoeft <package>lvm10</package> niet te deinstalleren; de init-scripts zullen controleren welke kernel wordt gebruikt en de juiste versie opstarten.
pt: Se usar <em>LVM</em>, deverá também instalar <package>lvm2</package> antes de reiniciar já que o kernel 2.6 não suporta directamente LVM1. Para aceder os volumes LVM1, é utilizado o 'layer' de compatibilidade do <package>lvm2</package> (o módulo dm-mod). Pode deixar o <package>lvm10</package> instalado; os 'init scripts' detectarão que kernel está a ser utilizado e executará a versão apropriada.
ru: Если вы используете <em>LVM</em>, то до перезагрузки вам также надо будет установить пакет <package>lvm2</package>, так как ядро 2.6 само по себе не поддерживает LVM1. Для доступа к разделам LVM1 применяется модуль совместимости dm-mod из пакета <package>lvm2</package>. Пакет <package>lvm10</package> можно не удалять, сценарии начальной загрузки определят используемое ядра и загрузят подходящую версию.
sv: Om du använder <em>LVM</em>, bör du även installera <package>lvm2</package> före du startar om eftersom 2.6-kärnan inte direkt stöder LVM1. För att komma åt LVM1-volymer, används kompatibilitetslagret i <package>lvm2</package> (modulen dm-mod). Du kan lämna <package>lvm10</package> installerat; init-skripten kommer att identifiera vilka kärna som används och köra den lämpliga versionen.
zh_cn: 如果您使用了 <em>LVM</em>，请在重新开机前确认您已安装了 <package>lvm2</package>，因为 2.6 的内核 并不直接支持 LVM1，而是使用相容的 <package>lvm2</package>（dm-mod 模块）来存取 LVM1 的 volumes。您还是可以保留已安装了的 <package>lvm10</package>；而进行初始化的 Script 将会进行探测并依所使用的内核 的不同而自动载入适当的版本。
