Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: Because packages may need to be installed from &oldreleasename;, you should first check that entries in your <file>sources.list</file> still refer to &oldreleasename; as explained in <ref id="old-sources">.
nl: Omdat hierbij mogelijk pakketten uit &oldreleasename; moeten worden geïnstalleerd, dient u eerst te verifiëren dat de regels in uw <file>sources.list</file> nog altijd verwijzen naar &oldreleasename;. Instructies hiervoor vindt u in <ref id="old-sources">.

source: The following instructions explain step by step how to install the newer kernel.
nl: De navolgende instructies leggen stap voor stap uit hoe u de nieuwe kernel installeert.

source: <taglist compact="compact"> <tag>Download and install the needed packages</tag> <item><p><em>with apt</em>: if you have not yet done so, change your <file>sources.list</file> file to point to &releasename; as described in <ref id="upgrade-process">, update your packages lists and install the kernel-image for your machine. You can find a list of available kernel images below or with the command <example compact="compact"> $ apt-cache search ^kernel-image </example></p><p>During the install the package may complain about module mismatches and ask if the installation should continue. Answer <tt>YES</tt> to that question as these mismatches will be resolved as soon as you reboot with the new kernel.</p><p><em>with dpkg</em>: fetch the current kernel package from the Debian mirror of your choice. The available packages are: <list compact="compact"> <item><p><![ %mips [ </p></item> <item><p><url id="&mips-kernel-patch;/&mips-kernel-image-r4k;" name="&mips-kernel-image-r4k;"> for R4XX0 processors and the SGI IP22 subarchitecture like the Indy and Indigo2.</p></item> <item><p><url id="&mips-kernel-patch;/&mips-kernel-image-r5k;" name="&mips-kernel-image-r5k;"> for R5000 processors and the SGI IP22 subarchitecture like the Indy and Indigo2.</p></item> <item><p><url id="&mips-kernel-patch;/&mips-kernel-image-swarm;" name="&mips-kernel-image-swarm;"> for the Broadcom BCM91250A (aka SWARM) pass 2.2.</p></item>]]> <![ %mipsel [ <item><p><url id="&mips-kernel-patch;/&mipsel-kernel-image-r3k;" name="&mipsel-kernel-image-r3k;"> for R3000 based DECstations with KN02 (or compatible) mainboard, such as the DECstation 5000/1xx series with xx=20,25,33 and the DECstation 5000/240.</p></item> <item><p><url id="&mips-kernel-patch;/&mipsel-kernel-image-r4k;" name="&mipsel-kernel-image-r4k;"> for R4X00 based DECstations with KN04 (or compatible) mainboard, such as the DECstation 5000/150, the Personal DECstation 5000/50 and the DECstation 5000/260.</p></item> <item><p><url id="&mips-kernel-patch;/&mipsel-kernel-image-r5k-cobalt;" name="&mipsel-kernel-image-r5k-cobalt;"> for MIPS based Cobalt machines (such as the Qube, RaQ, Qube2 and RaQ2).</p></item> <item><p><url id="&mips-kernel-patch;/&mipsel-kernel-image-r5k-lasat;" name="&mipsel-kernel-image-r5k-lasat;"> for R5000 processors on the Lasat Masquerade Pro.</p></item> <item><p><url id="&mips-kernel-patch;/&mipsel-kernel-image-swarm;" name="&mipsel-kernel-image-swarm;"> for the Broadcom BCM91250A (aka SWARM) pass 2.2.</p></item> <item><p><url id="&mips-kernel-patch;/&mipsel-kernel-image-xxs1500;" name="&mipsel-kernel-image-xxs1500;"> for the Au1500 based XXS1500 board.</p></item>]]> </list></p><p>Then install the package using <tt>dpkg -i</tt>. It may complain about module mismatches (from <package>modutils</package>) and ask if the installation should continue. Answer <tt>YES</tt> to that question as these mismatches will be resolved as soon as you reboot with the new kernel.</p></item> <item><p><em>with apt</em>: to install the packages with <prgn>apt</prgn> or one of its frontends, add the following line in your <file>/etc/apt/sources.list</file>: <example compact="compact"> deb &url-kernel-upgrade; # sources are also available if you need them # deb-src &url-kernel-upgrade;</example></p><p>Then install the packages <package>modutils</package> and <package>initrd-tools</package>. ]]> </p><p>Then install the packages <package>module-init-tools</package>, <package>palo</package>, and <package>initrd-tools</package>. ]]> (Afterwards you can safely drop the additional entry again.)</p><p>After that change your <file>sources.list</file> file to point to &releasename; as described in <ref id="upgrade-process">, update your packages lists and install the <package>&upgrade-kernel-image-name;</package> package.</p><p><em>with dpkg</em>: to install the packages directly with <prgn>dpkg</prgn> you need to download the necessary files first.</p><p><list compact="compact"> <item><p><url id="&upgrade-kernel-image;"></p></item> <item><p><url id="&upgrade-kernel-modutils;"></p></item> <item><p><url id="&all-initrd-tools;"></p></item> <item><p><url id="&upgrade-kernel-cramfsprogs;"></p></item></list></p><p>The kernel package depends on <package>&upgrade-kernel-modutils-name;</package>; <package>initrd-tools</package> depends on <package>cramfsprogs</package>. All other dependencies (which are <package>stat</package>, <package>cpio</package> and <package>ash</package>) can be satisfied with packages from &oldreleasename; in the usual way.</p><p>If you use <em>LVM</em>, you should also install <package>lvm2</package> before you reboot as the 2.6 kernel does not directly support LVM1. To access LVM1 volumes, the compatibility layer of <package>lvm2</package> (the dm-mod module) is used. You can leave <package>lvm10</package> installed; the init scripts will detect which kernel is used and execute the appropriate version.</p></item> <tag>Don't delete your old kernel yet</tag> <item><p>You should first verify that the new one boots and all hardware needed for the upgrade works (e.g. network adaptors).</p></item><![ %sparc [ <tag>Make your system bootable</tag> <item><p>You will probably have to adapt your boot loader configuration <file>/etc/silo.conf</file>. Note that the kernel now uses an initrd while the Debian kernels in &oldreleasename; did not.</p></item>]]> <tag>Reboot to the new kernel</tag> <tag>Check your system</tag> <item><p>Check especially input devices, display devices, devices needed to access the &releasename; packages (i.e. network adaptors, CD drives, etc). Some driver modules may have been renamed, some drivers which have been compiled into the old kernel might now be compiled as modules, ...</p></item> </taglist>
nl: <taglist compact="compact"> <tag>Haal de benodigde pakketten op en installeer deze</tag> <item><p><em>met apt</em>: als u dit nog niet heeft gedaan, wijzig dan uw <file>sources.list</file> zoals beschreven in <ref id="upgrade-process">, werk de pakkettendatabase bij en installeer het juiste kernel-image pakket voor uw systeem. Een lijst met beschikbare kernel-image pakketten is hieronder opgenomen maar kan ook worden gevonden met het commando<example compact="compact"> $ apt-cache search ^kernel-image </example></p><p>Tijdens de installatie zal het pakket mogelijk klagen over inconsistenties met modules en vragen of de installatie moet worden vervolgd. Beantwoord deze vraag bevestigend; deze inconsistenties zullen zijn verholpen zodra u het systeem met de nieuwe kernel opstart.</p><p><em>met dpkg</em>: haal het courante kernel pakket op vanaf de Debian mirror van uw keuze. De beschikbare pakketten zijn:<list compact="compact"> <item><p><![ %mips [</p></item> <item><p><url id="&mips-kernel-patch;/&mips-kernel-image-r4k;" name="&mips-kernel-image-r4k;"> voor R4XX0 processoren en de SGI IP22 subplatform zoals de Indy en Indigo2.</p></item> <item><p><url id="&mips-kernel-patch;/&mips-kernel-image-r5k;" name="&mips-kernel-image-r5k;"> voor R5000 processoren en de SGI IP22 subplatform zoals de Indy en Indigo2.</p></item> <item><p><url id="&mips-kernel-patch;/&mips-kernel-image-swarm;" name="&mips-kernel-image-swarm;"> voor de Broadcom BCM91250A (aka SWARM) pass 2.2.</p></item>]]><![ %mipsel [ <item><p><url id="&mips-kernel-patch;/&mipsel-kernel-image-r3k;" name="&mipsel-kernel-image-r3k;"> voor op de R3000 gebaseerde DECstations met een KN02 (of compatibel) moederbord, zoals de DECstation 5000/1xx serie waarbij xx=20,25,33 en de DECstation 5000/240.</p></item> <item><p><url id="&mips-kernel-patch;/&mipsel-kernel-image-r4k;" name="&mipsel-kernel-image-r4k;"> voor op de R4X00 gebaseerde DECstations met een KN04 (of compatibel) moederbord, zoals de DECstation 5000/150, de Personal DECstation 5000/50 en de DECstation 5000/260.</p></item> <item><p> <url id="&mips-kernel-patch;/&mipsel-kernel-image-r5k-cobalt;" name="&mipsel-kernel-image-r5k-cobalt;"> voor op MIPS gebaseerde Cobalt systemen (zoals de Qube, RaQ, Qube2 en RaQ2). </p></item> <item><p><url id="&mips-kernel-patch;/&mipsel-kernel-image-r5k-lasat;" name="&mipsel-kernel-image-r5k-lasat;"> voor R5000 processoren op de Lasat Masquerade Pro.</p></item> <item><p><url id="&mips-kernel-patch;/&mipsel-kernel-image-swarm;" name="&mipsel-kernel-image-swarm;"> voor de Broadcom BCM91250A (aka SWARM) pass 2.2.</p></item> <item><p><url id="&mips-kernel-patch;/&mipsel-kernel-image-xxs1500;" name="&mipsel-kernel-image-xxs1500;"> voor de op Au1500 gebaseerde XXS1500 moederborden.</p></item>]]></list> </p><p> Installeer vervolgens de pakketten met <tt>dpkg -i</tt>. Mogelijk zal het (vanuit <package>modutils</package>) klagen over inconsistenties met modules en vragen of de installatie moet worden vervolgd. Beantwoord deze vraag bevestigend; deze inconsistenties zullen zijn verholpen zodra u het systeem met de nieuwe kernel opstart.</p></item> <item><p><em>met apt</em>:om de pakketten te installeren met <prgn>apt</prgn> of een van de programma's voor pakketbeheer , dient u de volgende regel toe te voegen in uw <file>/etc/apt/sources.list</file>:<example compact="compact"> deb &url-kernel-upgrade; # sources are also available if you need them # deb-src &url-kernel-upgrade;</example></p><p>Installeer vervolgens de pakketten <package>modutils</package> en <package>initrd-tools</package>.]]></p><p>Installeer vervolgens de pakketten <package>module-init-tools</package>, <package>palo</package>, en <package>initrd-tools</package>.]]>(Na afloop kunt u de extra bron zonder problemen verwijderen.)</p><p>Wijzig vervolgens uw <file>sources.list</file> zodat wordt verwezen naar &releasename; zoals beschereven in <ref id="upgrade-process">, werk de pakkettendatabase bij en installeer het pakket <package>&upgrade-kernel-image-name;</package>. </p><p><em>met dpkg</em>: om de pakketten direct met <prgn>dpkg</prgn> te installeren dient u eerst de benodigde bestanden op te halen.</p><p><list compact="compact"> <item><p><url id="&upgrade-kernel-image;"></p></item> <item><p><url id="&upgrade-kernel-modutils;"></p></item> <item><p><url id="&all-initrd-tools;"></p></item> <item><p><url id="&upgrade-kernel-cramfsprogs;"></p></item> </list></p><p>Het kernel pakket is afhankelijk van <package>&upgrade-kernel-modutils-name;</package>; <package>initrd-tools</package> is afhankelijk van <package>cramfsprogs</package>. Aan alle andere afhankelijkheden (namelijk <package>stat</package>, <package>cpio</package> en <package>ash</package>) kan op de gebruikelijke wijze worden voldaan met pakketten uit &oldreleasename;.</p><p>Als u gebruik maakt van <em>LVM</em> dient u tevens <package>lvm2</package> te installeren voordat u het systeem opnieuw opstart aangezien de 2.6 kernel LVM1 niet direct ondersteunt. Voor het benaderen van bestaande LVM1 volumes zal de compatibiliteitslaag van <package>lvm2</package> (de module dm-mod) worden gebruikt. U hoeft <package>lvm10</package> niet te deinstalleren; de init-scripts zullen controleren welke kernel wordt gebruikt en de juiste versie opstarten.</p></item> <tag>Verwijder uw oude kernel nog niet</tag> <item><p>Controleer eerst dat de nieuwe kernel opstart en alle hardware (zoals netwerkkaarten) die nodig is voor de opwaardering van het systeem werkt.</p></item><![ %sparc [ <tag>Maak uw systeem opstartbaar</tag> <item><p>Waarschijnlijk zult u het configuratiebestand van uw opstartlader, <file>/etc/silo.conf</file>, moeten aanpassen. Merk op dat de kernel nu gebruik maakt van een initrd terwijl Debian kernels in &oldreleasename; dat niet deden.</p></item>]]> <tag>Start het systeem opnieuw op met de nieuwe kernel</tag> <tag>Controleer uw systeem</tag> <item><p> Controleer met name invoer- en uitvoerapparaten, apparaten nodig om de &releasename; pakketten op te halen (zoals netwerkkaarten of CD-eenheid). Sommige stuurprogramma-modules kunnen hernoemd zijn; stuurprogramma's die eerst in de kernel waren gecompileerd kunnen nu geladen moeten worden als module, ...</p></item> </taglist>

source: Installing &oldreleasename; version of aptitude
nl: De &oldreleasename; versie van aptitude installeren

source: First you need to make sure you will install &oldreleasename;'s version of <package>aptitude</package> and not &releasename;'s by following the instructions in <ref id="old-sources">.
nl: Allereerst dient u ervoor te zorgen dat u de &oldreleasename; versie van <package>aptitude</package> en niet die &releasename; versie. Volg hiervoor de instructies in <ref id="old-sources">.

source: After that, just execute <example compact="compact"> # apt-get install aptitude </example> to install <package>aptitude</package>.
nl: Daarna kunt u <package>aptitude</package> installeren met:<example compact="compact"> # apt-get install aptitude </example> om

source: If you've made any changes, save the file and execute <example compact="compact"> # apt-get update </example> to refresh the package list.
nl: Als u wijzigingen heeft aangebracht, geef dan de opdracht<example compact="compact"> # apt-get update </example>om de pakkettendatabase te vernieuwen.

source: en
ja: ja
ml: ml

source: Release Notes for &debian; &release; (&releasename;), &arch-title;
ja: &debian; &release; (&releasename;) リリースノート (&arch-title; 用)
ml: &debian; &release; (&releasename;), &arch-title; പ്രസാധനക്കുറിപ്പ്

source: <ulink url="http://www.debian.org/doc/">The Debian Documentation Project</ulink>
ml: <ulink url="http://www.debian.org/doc/">ഡെബിയന്റെ സഹായക്കുറിപ്പുകള്‍ക്കുള്ള സംരംഭം</ulink>

source: There were more people!
ja: もっと沢山の人が居ます!
ml: ഇനിയും എത്രയോ പേരുണ്ടായിരുന്നു!

source: This document is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License, version 2, as published by the Free Software Foundation.
ja: この文書はフリーソフトウェアです。あなたは、Free Software Foundation が公表した GNU 一般公有使用許諾の第二版の条件に基づいて、本文書の再頒布および変更を行うことができます。
ml: ഈ പ്രമാണം ഒരു സ്വതന്ത്ര സോഫ്റ്റ്‌വെയറാണു്; സ്വതന്ത്ര സോഫ്റ്റ്‌വെയര്‍ ഫൌണ്ടേഷന്‍ പ്രസിദ്ധീകരിച്ച ഗ്നു ഗ്നൂ പൊതു അനുമതി പത്രിക, ലക്കം 2, പ്രകാരം നിങ്ങള്‍ക്കിതു് മാറ്റം വരുത്താവുന്നതോ വിതരണം ചെയ്യാവുന്നതോ ആണു്.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
ja: 本プログラムはその有用性が期待されて頒布されるものですが、市場性や特定の目的への適合性に関する暗黙の保証も含め、いかなる保証も行ないません。詳細については GNU 一般公有使用許諾書をご覧ください。
ml: ഈ പ്രോഗ്രാം നിങ്ങള്‍ക്കു് ഉപയോഗപ്രദമാകും എന്ന വിശ്വാസത്തില്‍, എന്നാല്‍ യാതൊരുവിധ ഉത്തരവാദിത്തങ്ങളോ ഒരു പ്രത്യേ‌ക ആവശ്യ‌ത്തിന് ഉതകുംവിധം വാണിജ്യസംബന്ധിയായ ഉത്തരവാദിത്തം പോലുമില്ലാതെയാണു് വിതരണം ചെയ്യുന്നതു്. കൂടുതല്‍ വിവരങ്ങള്‍ക്കു് ഗ്നു ഗ്നൂ പൊതു അനുമതി പത്രിക കാണുക.

source: You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
ja: あなたは、このプログラムとともに、GNU 一般公有使用許諾の写しを受け取っているはずです。そうでなければ Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA に手紙でお知らせください。
ml: നിങ്ങള്‍ക്ക് ഈ പ്രോഗ്രാമിനൊപ്പം ഗ്നൂ പൊതു അനുമതി പത്രികയുടെ ഒരു പകര്‍പ്പ് ലഭിച്ചിട്ടുണ്ടായിരിക്കണം; ഇല്ലാത്തപക്ഷം, Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA എന്ന വിലാസത്തിലേയ്ക്കെഴുതുക.

source: Contributors to the Release Notes
ja: リリースノートの貢献者たち
ml: പ്രസാധനക്കുറിപ്പിലേയ്ക്കു് സംഭാവന ചെയ്തവര്‍

source: Many people helped with the release notes, including, but not limited to
ja: たくさんの人々がリリースノートを手伝ってくれました。以下の方々もそうですが、他にもいらっしゃいます。
ml: താഴെ പറയുന്നവരുള്‍പ്പെടെ, പക്ഷേ ഇവര്‍ മാത്രമല്ല, പലരും പ്രസാധനക്കുറിപ്പിറക്കാന്‍ സഹായിച്ചു

source: <author> <firstname>Adam</firstname> <surname>Di Carlo</surname>
ja: <author lang="en"> <firstname>Adam</firstname> <surname>Di Carlo</surname>
ml: <author> <firstname>ആദം</firstname> <surname>ഡി കാര്‍ലോ</surname>

source: </author>, <author> <firstname>Andreas</firstname> <surname>Barth</surname>
ja: </author>, <author lang="en"> <firstname>Andreas</firstname> <surname>Barth</surname>
ml: </author>, <author> <firstname>ആന്‍ഡ്രിയാസ്</firstname> <surname>ബാര്‍ത്ത്</surname>

source: </author>, <author> <firstname>Andrei</firstname> <surname>Popescu</surname>
ja: </author>, <author lang="en"> <firstname>Andrei</firstname> <surname>Popescu</surname>
ml: </author>, <author> <firstname>ആന്‍ഡ്രേയി</firstname> <surname>പോപ്പസ്ക്യു</surname>

source: various contributions
ja: さまざまな貢献
ml: പല പല സംഭാവനകള്‍

source: </author>, <author> <firstname>Anne</firstname> <surname>Bezemer</surname>
ja: </author>, <author lang="en"> <firstname>Anne</firstname> <surname>Bezemer</surname>
ml: </author>, <author> <firstname>ആനി</firstname> <surname>ബെസിമര്‍</surname>

source: previous release
ja: 前リリース
ml: മുന്‍ പതിപ്പു്

source: </author>, <author> <firstname>Bob</firstname> <surname>Hilliard</surname>
ja: </author>, <author lang="en"> <firstname>Bob</firstname> <surname>Hilliard</surname>
ml: </author>, <author> <firstname>ബോബ്</firstname> <surname>ഹില്ലാര്‍ഡ്</surname>

source: </author>, <author> <firstname>Charles</firstname> <surname>Plessy</surname>
ja: </author>, <author lang="en"> <firstname>Charles</firstname> <surname>Plessy</surname>
ml: </author>, <author> <firstname>ചാള്‍സ്</firstname> <surname>പ്ലെസി</surname>

source: description of GM965 issue
ja: GM965 問題の解説
ml: GM965 പ്രശ്നത്തെക്കുറിച്ചുള്ള വിവരണം

source: </author>, <author> <firstname>Christian</firstname> <surname>Perrier</surname>
ja: </author>, <author lang="en"> <firstname>Christian</firstname> <surname>Perrier</surname>
ml: </author>, <author> <firstname>ക്രിസ്ത്യന്‍</firstname> <surname>പെറിയര്‍</surname>

source: </author>, <author> <firstname>Daniel</firstname> <surname>Baumann</surname>
ja: </author>, <author lang="en"> <firstname>Daniel</firstname> <surname>Baumann</surname>
ml: </author>, <author> <firstname>ഡാനിയല്‍</firstname> <surname>ബൌമാന്‍</surname>

source: Debian Live
ml: ഡെബിയന്‍ ലൈവ്

source: </author>, <author> <firstname>Eddy</firstname> <surname>Petrișor</surname>
ja: </author>, <author lang="en"> <firstname>Eddy</firstname> <surname>Petrișor</surname>
ml: </author>, <author> <firstname>എഡ്ഡി</firstname> <surname>പെട്രിസര്‍</surname>

source: </author>, <author> <firstname>Emmanuel</firstname> <surname>Kasper</surname>
ja: </author>, <author lang="en"> <firstname>Emmanuel</firstname> <surname>Kasper</surname>
ml: </author>, <author> <firstname>ഇമ്മാനുവല്‍</firstname> <surname>കാസ്പര്‍</surname>

source: backports
ja: バックポート
ml: ബാക്ക്പോര്‍ട്ടുകള്‍

source: </author>, <author> <firstname>Esko</firstname> <surname>Arajärvi</surname>
ja: </author>, <author lang="en"> <firstname>Esko</firstname> <surname>Arajärvi</surname>
ml: </author>, <author> <firstname>എസ്കോ</firstname> <surname>അരായാര്‍വി</surname>

source: rework X11 upgrade
ja: X11 アップグレードの書き直し
ml: X11 നവീകരണം വീണ്ടും ചെയ്തു

source: </author>, <author> <firstname>Giovanni</firstname> <surname>Rapagnani</surname>
ja: </author>, <author lang="en"> <firstname>Giovanni</firstname> <surname>Rapagnani</surname>
ml: </author>, <author> <firstname>ജിയോവാനി</firstname> <surname>റാപ്പഗ്നാനി</surname>

source: innumerable contributions
ja: 数え切れない貢献
ml: എണ്ണാവാത്തത്രയും സംഭാവനകള്‍

source: </author>, <author> <firstname>Gordon</firstname> <surname>Farquharson</surname>
ja: </author>, <author lang="en"> <firstname>Gordon</firstname> <surname>Farquharson</surname>
ml: </author>, <author> <firstname>ഗോര്‍ഡണ്‍</firstname> <surname>ഫാര്‍ക്കുഹാര്‍സന്‍</surname>

source: ARM port issues
ja: ARM 移植問題
ml: ആം പോര്‍ട്ടിലെ പ്രശ്നങ്ങള്‍

source: </author>, <author> <firstname>Javier</firstname> <surname>Fernández-Sanguino Peña</surname>
ja: </author>, <author lang="en"> <firstname>Javier</firstname> <surname>Fernández-Sanguino Peña</surname>
ml: </author>, <author> <firstname>ഹാവിയര്‍</firstname> <surname>ഫെര്‍ണാണ്ടസ്-സാങ്ക്വിനോ പെന</surname>

source: </author>, <author> <firstname>Jens</firstname> <surname>Seidel</surname>
ja: </author>, <author lang="en"> <firstname>Jens</firstname> <surname>Seidel</surname>
ml: </author>, <author> <firstname>ജെന്‍സ്</firstname> <surname>സീഡല്‍</surname>

source: German translation, innumerable contributions
ja: ドイツ語翻訳、数え切れない貢献
ml: ജര്‍മ്മന്‍ പരിഭാഷ, എണ്ണാവാത്തത്രയും സംഭാവനകള്‍

source: </author>, <author> <firstname>Jonas</firstname> <surname>Meurer</surname>
ja: </author>, <author lang="en"> <firstname>Jonas</firstname> <surname>Meurer</surname>
ml: </author>, <author> <firstname>ജോനാസ്</firstname> <surname>മ്യൂറര്‍</surname>

source: syslog issues
ja: syslog 問題
ml: സിസ്‌ലോഗ് പ്രശ്നങ്ങള്‍

source: </author>, <author> <firstname>Josip</firstname> <surname>Rodin</surname>
ja: </author>, <author lang="en"> <firstname>Josip</firstname> <surname>Rodin</surname>
ml: </author>, <author> <firstname>ജോസിപ്പ്</firstname> <surname> റോഡിന്‍</surname>

source: English fixes
ja: 英語修正
ml: ഇംഗ്ലീഷ് തിരുത്തലുകള്‍

source: </author>, <author> <firstname>LaMont</firstname> <surname>Jones</surname>
ja: </author>, <author lang="en"> <firstname>LaMont</firstname> <surname>Jones</surname>
ml: </author>, <author> <firstname>ലാമോണ്ട്</firstname> <surname>ജോണ്‍സ്</surname>

source: description of NFS issues
ja: NFS 問題の解説
ml: എന്‍എഫ്എസ് പ്രശ്നങ്ങള്‍

source: </author>, <author> <firstname>Luk</firstname> <surname>Claes</surname>
ja: </author>, <author lang="en"> <firstname>Luk</firstname> <surname>Claes</surname>
ml: </author>, <author> <firstname>ലൂക്ക്</firstname> <surname>ക്ലോസ്</surname>

source: editors motivation manager
ja: 編集者のモチベーション管理
ml: എഡിറ്റര്‍മാരക്കു് പ്രചോദനം നല്‍കി

source: </author>, <author> <firstname>Martin</firstname> <surname>Michlmayr</surname>
ja: </author>, <author lang="en"> <firstname>Martin</firstname> <surname>Michlmayr</surname>
ml: </author>, <author> <firstname>മാര്‍ട്ടിന്‍</firstname> <surname>മിച്ച്മേയര്‍</surname>

source: </author>, <author> <firstname>Michael</firstname> <surname>Biebl</surname>
ja: </author>, <author lang="en"> <firstname>Michael</firstname> <surname>Biebl</surname>
ml: </author>, <author> <firstname>മിഖേല്‍</firstname> <surname>ബീബല്‍</surname>

source: </author>, <author> <firstname>Moritz</firstname> <surname>Mühlenhoff</surname>
ja: </author>, <author lang="en"> <firstname>Moritz</firstname> <surname>Mühlenhoff</surname>
ml: </author>, <author> <firstname>മൊറിറ്റ്സ്</firstname> <surname>മുലന്‍ഹോഫ്</surname>

source: </author>, <author> <firstname>Noah</firstname> <surname>Meyerhans</surname>
ja: </author>, <author lang="en"> <firstname>Noah</firstname> <surname>Meyerhans</surname>
ml: </author>, <author> <firstname>നോവ</firstname> <surname>മെയര്‍ഹാന്‍സ്</surname>

source: </author>, <author> <firstname>Noritada</firstname> <surname>Kobayashi</surname>
ja: </author>, <author> <firstname>儀匡</firstname> <surname>小林</surname>
ml: </author>, <author> <firstname>നൊറിറ്റാഡ</firstname> <surname>കൊബായാഷി</surname>

source: Japanese translation (coordination), innumerable contributions
ja: 日本語翻訳 (コーディネート)、数え切れない貢献
ml: ജാപ്പനീസ് പരിഭാഷ (മുന്‍കൈ എടുത്തു), എണ്ണാവാത്തത്രയും സംഭാവനകള്‍
