Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: Also, review the contents of your <file>/etc/kernel-img.conf</file> and make sure that you have <em>do_bootloader = Yes</em> in it. That way the bootloader will always be rerun after a kernel upgrade.
ja: また、<file>/etc/kernel-img.conf</file> の内容を調べ、<em>do_bootloader = Yes</em> と書かれていることを確認してください。この設定のとおり、カーネルをアップグレードした後には必ずブートローダが再実行されます。
zh_cn: 同时，再次查看您的 <file>/etc/kernel-img.conf</file> 内容并确认其中有着 <em>do_bootloader = Yes</em>。那么，在内核升级后就会必定会自动执行开机程序了。

source: If you encounter any issues when running <prgn>lilo</prgn> review the symbolic links in <file>/</file> to <file>vmlinuz</file> and <file>initrd</file>, as well as the contents of your <file>/etc/lilo.conf</file> for discrepancies.
ja: <prgn>lilo</prgn> を再び実行しているときに何らかの問題が発生した場合は、<file>vmlinuz</file> と <file>initrd</file> へのシンボリックリンクが <file>/</file> 内に存在するか、また <file>/etc/lilo.conf</file> の内容に食い違いがないか、確認してください。
zh_cn: 如果您在执行 <prgn>lilo</prgn> 时遇到了任何问难，请再次检查在 <file>/</file> 里指向 <file>vmlinuz</file> 及 <file>initrd</file> 的符号连结，以及您的 <file>/etc/lilo.conf</file> 的内容是否有什么不对劲的地方。

source: If you forgot to rerun <prgn>lilo</prgn> before the reboot or the system is accidentally rebooted before you could do this manually, your system might fail to boot. Instead of the lilo prompt, you will only see <em>LI</em> when booting the system<footnote><p>For more information on <prgn>lilo</prgn>'s boot error codes please see <url id="http://tldp.org/HOWTO/Bootdisk-HOWTO/a1483.html" name="The Linux Bootdisk HOWTO">.</p></footnote>. In order to recover from this you will have to start up a media installation disk in <em>rescue</em> mode. For more information on how to do this please review the <url id="http://wiki.debian.org/DebianInstaller/FAQ" name="DebianInstaller FAQ">.
ja: 再起動する前に <prgn>lilo</prgn> を再実行し忘れたり、手動で再実行する前にシステムが偶発的に再起動してしまった場合、システムは起動できなくなるでしょう。その場合、システム起動時に lilo プロンプト全体は表示されず、最初の <em>LI</em> だけが表示されます<footnote><p><prgn>lilo</prgn> の起動エラーコードに関するさらに詳しい情報は、<url id="http://tldp.org/HOWTO/Bootdisk-HOWTO/a1483.html" name="The Linux Bootdisk HOWTO"> (<url id="http://www.linux.or.jp/JF/JFdocs/Bootdisk-HOWTO-12.html" name="日本語訳">) を参照してください。</p></footnote>。この状態からシステムを復旧させるには、メディアインストールディスクから <em>rescue</em> モードでシステムを起動しなければなりません。<em>rescue</em> モードでの起動方法に関してさらに詳しく知りたい場合は、<url id="http://wiki.debian.org/DebianInstaller/FAQ" name="DebianInstaller FAQ"> を参照してください。

source: Upgrading mdadm
ja: mdadm のアップグレード
pt: A actualizar o mdadm
ru: Обновление mdadm
sv: Uppgradera mdadm
zh_cn: 更新 mdadm

source: mdadm now needs a configuration file to assemble MD arrays (RAID) from the initial ramdisk and during the system initialisation sequence. Please make sure to read and act upon the instructions in <file>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</file> after the package has been upgraded <strong>and before you reboot</strong>. The latest version of this file is available at <url id="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file">; please consult it in case of problems.
ja: mdadm は、MD アレイ (RAID) を initial ramdisk から再構築したりシステム初期化シーケンス中に再構築するのに設定ファイルを必要とするようになりました。パッケージのアップグレードを終えた後、<strong>再起動する前に</strong>必ず <file>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</file> に書かれている説明を読み、それに従ってください。このファイルの最新版は <url id="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file"> から入手可能です。問題が生じた場合は参考にしてください。
pt: O mdadm precisa agora de um ficheiro de configuração para montar 'MD arrays' (RAID) a partir a ramdisk inicial e durante a sequência de inicialização do sistema. Por favor leia e siga as instruções em <file>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</file> depois de o pacote ter sido actualizado e <strong>depois de ter reiniciado o sistema</strong>. A última versão deste ficheiro está disponível em <url id="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file">; por favor consulte-o em caso de problemas.
ru: Для mdadm теперь нужен конфигурационный файл для составления MD массивов (RAID) с первоначального ramdisk и во время процесса инициализации системы. Прочитайте и выполните инструкции из <file>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</file> после обновления пакета <strong>и до перезагрузки</strong>. Последняя версия этого файла доступна <url id="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file">; обратитесь к ней, если возникнут проблемы.
sv: mdadm behöver nu en konfigurationsfil för att sätta samman MD-kedjor (RAID) från den initiala ramdisken och under systemets initieringssekvens. Se till att läsa och agera efter de instruktioner som finns i <file>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</file> efter att paketet har uppgraderats <strong>och innan du startar om</strong>. Den senaste versionen av den här filen finns tillgänglig på <url id="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file">; läs den om du får problem.
zh_cn: mdadm 现在需要设置文件来在 initial ramdisk 及系统初始化过程中建构 MD 阵列。在该软件包被更新后、<strong>在您重新启动之前</strong>，请务必阅读并依照 <file>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</file> 的内容进行。这个档案的最新版可以在 <url id="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file"> 取得，若遭遇任何问题请不妨参阅。

source: Obsolete packages
ja: 時代遅れ (Obsolete) なパッケージ
nl: Verouderde pakketten
pt: Pacotes obsoletos
ru: Устаревшие пакеты
sv: Föråldrade paket
zh_cn: 被废弃的软件包

source: Introducing several thousand new packages, &releasename; also retires and omits more than two thousand old packages that were in &oldreleasename;. It provides no upgrade path for these obsolete packages. While nothing prevents you from continuing to use an obsolete package where desired, the Debian project will usually discontinue security support for it a year after &releasename;'s release<footnote><p>Or for as long as there is not another release in that time frame. Typically only two stable releases are supported at any given time.</p></footnote>, and will not normally provide other support in the meantime. Replacing them with available alternatives, if any, is recommended.
ja: 数千個の新規パッケージが導入された一方で、&releasename; では &oldreleasename; にはあった 2000 個以上の古いパッケージが破棄されたり削除されてもいます。これら時代遅れのパッケージをアップグレードする手段は提供されていません。時代遅れのパッケージを使い続けても構いませんが、Debian プロジェクトは通常 &releasename; がリリースされてから 1 年後に<footnote><p>あるいはその期間中に別のリリースが出ない限り。ある時点では、通常 2 個のみの安定版リリースがサポートされています。</p></footnote>そのようなパッケージへのセキュリティサポートを打ち切り、その後は他のサポートも提供されないのが常です。もし存在するのなら、利用可能な代替品に置き換えることを推奨します。
nl: Naast de introductie van enkele duizenden nieuwe pakketten, verdwijnen met &releasename; ook meer dan 2000 oude pakketten die wel in &oldreleasename; voorkwamen. Voor deze vervallen pakketten wordt geen automatische vervanging geboden. Hoewel niets u ervan weerhoudt om een vervallen pakket te blijven gebruiken, zal door Debian normaal gesproken een jaar na de release<footnote><p>Of zolang als er nog geen nieuwe release is. Gangbaar is dat op een willekeurig moment maximaal twee 'stable' releases worden ondersteund.</p></footnote> van &releasename; geen veiligheidsondersteuning meer worden geboden, en ondertussen ook geen andere vormen van ondersteuning. Aanbevolen wordt de pakketten te vervangen door, als die er zijn, alternatieve pakketten.
ru: Вместе с появлением девяти тысяч новых пакетов, более двух тысяч пакетов из состава &oldreleasename; с появлением &releasename; устаревают. Устаревшие пакеты не включены в &releasename; и не будут больше обновляться. Ничто не мешает вам продолжить пользоваться этими пакетами, но приблизительно через год <footnote><p>Или при появлении нового выпуска Debian. Обычно поддержку получают одновременно не более двух стабильных выпусков.</p></footnote> после выхода &releasename; команда безопасности прекратит выпускать для них исправления. Мы рекомендуем перейти на использование альтернативных пакетов, если есть такая возможность.
sv: &releasename; introducerar tusentals nya paket men pensionerar och utelämnar mer än två tusen gamla paket som fanns i &oldreleasename;. Den tillhandahåller inget uppgraderingssätt för dessa föråldrade paket. Då ingenting hindrar dig från att fortsätta att använda ett föråldrat paket om så önskas, kommer Debian-projektet vanligtvis att sluta ge säkerhetsstöd för det ett år efter utgivningen av &releasename;<footnote><p>Eller så länge som ingen annan utgivning sker i den tidsperioden. Normalt sett stöds endast två stabila utgåvor åt gången.</p></footnote>, och kommer normalt sett inte att tillhandahålla annat stöd under den tiden. Att ersätta dem med tillgängliga alternativ, om det finns några, rekommenderas.

source: There are many reasons why packages might have been removed from the distribution: they are no longer maintained upstream; there is no longer a Debian Developer interested in maintaining the packages; the functionality they provide has been superseded by different software (or a new version); or they are no longer considered suitable for &releasename; due to bugs in them. In the later case, packages might still be present in the "unstable" distribution.
ja: あるパッケージが本ディストリビューションから削除された理由は、数多くあります - 上流ではもはや保守されていないため、そのパッケージを保守することに興味を抱く Debian 開発者がもはやいないため、提供していた機能が別のソフトウェア (あるいは新バージョン) に取って代わられたため、バグのために &releasename; にはもはや適さないとみなされたため、などです。最後の場合では、当該パッケージが "不安定版" ディストリビューション内には存在していることがあります。
pt: Existem muitas razões para que pacotes possam ter sido retirados de uma distribuição: não serem mais mantidos 'upstream'; não existência de um Debian 'Developer' interessado em manter estes pacotes; a funcionalidade que estes fornecem ter sido ultrapassada por outro software diferente (ou uma nova versão); ou considerados não adequados para a &releasename; devido a erros existentes. No último caso os pacotes podem no entanto continuar a existir na distribuição unstable.
ru: Пакет может быть удалён из дистрибутива по многим причинам: разработка программы прекращена, пакет не интересен никому из разработчиков Debian, программа вытеснена другой, более функциональной программой или версией программы. Возможно, пакет содержит ошибки, из-за которых пока не может быть включён в &releasename;, в последнем случае пакет может быть доступен в нестабильном ("unstable") дистрибутиве.
sv: Det finns många anledningar varför paket kan ha tagits bort från distributionen: de underhålls inte längre av upphovsmännen; det finns inte längre någon Debian-utvecklare som är intresserad i att underhålla paketen; funktionaliteten de tillhandahåller har ersatts av en annan programvara (eller en ny version); eller så anses de inte längre lämpliga för &releasename; på grund av fel i dem. I det senare fallet kan paket fortfarande finnas kvar i "unstable"-distributionen.
zh_cn: 而这些软件包为什么会从发行版中移去的原因不一而足：有的是因为它的原始程序已经没有人在继续维护了；有的是因为已经没有 Debian 的开发者有意愿想要继续维护这些套件了；有的是因为它们所提供的功能已经被其它的软件（或是新的版本）所取代了；有的是因为它们本身所包含的一些 Bug 使得我们认为它们已无法和 &releasename; 相容。如果是最后一个情况，这些软件包很可能是被放在 "unstable" 这个分类里。

source: Detecting which packages in an updated system are "obsolete" is easy since the package management front-ends will mark them as such. If you are using <prgn>aptitude</prgn>, you will see a listing of these packages in the "Obsolete and Locally Created Packages" entry. <prgn>dselect</prgn> provides a similar section but the listing it presents might differ. Also, if you have used <prgn>aptitude</prgn> to manually install packages in &oldreleasename; it will have kept track of those packages you manually installed and will be able to mark as obsolete those packages pulled in by dependencies alone which are no longer needed if a package has been removed. Also, <prgn>aptitude</prgn>, unlike <prgn>deborphan</prgn> will not mark as obsolete packages that you manually installed, as opposed to those that were automatically installed through dependencies.
ja: 更新されたシステム内のどのパッケージが "時代遅れ" なのかを検出するのは、パッケージ管理用フロントエンドが当該パッケージにその旨のマークを付けてくれるので簡単です。<prgn>aptitude</prgn> を使っているのなら、当該パッケージが "Obsolete and Locally Created Packages" 欄に列記されているのに気づくでしょう。<prgn>dselect</prgn> も同じようなセクションを提供しますが、表示される一覧はわずかに異なっています。さらに、&oldreleasename; で手作業でパッケージをインストールするのに <prgn>aptitude</prgn> を使っていたのなら、手作業でインストールされたパッケージの記録が取られており、依存元パッケージが削除されればもはや不要となる依存関係のみによって導入されたパッケージに時代遅れのマークを付けることができるでしょう。また <prgn>aptitude</prgn> は、<prgn>deborphan</prgn> とは異なり、手作業でインストールしたパッケージには時代遅れのマークを付けません (依存関係によって自動でインストールされたものにはマークを付けます)。
pt: A detecção dos pacotes que num sistema actualizado são obsoletos é fácil pelo facto dos 'front-ends' dos gestor de pacotes os marcarem. Se estiver a usar o <prgn>aptitude</prgn>, verá a lista destes pacotes na entrada "Pacotes obsoletos e criados localmente". O <prgn>dselect</prgn> disponibiliza uma secção idêntica mas a lista que apresenta pode ser diferente. Do mesmo modo se usou o <prgn>aptitude</prgn> para manualmente instalar pacotes na &oldreleasename;, ele irá seguir o caminho desses pacotes que instalou manualmente e será capaz de marcar como obsoletos os pacotes obtidos por dependências apenas que não são já necessárias pela remoção do pacote. Também o <prgn>aptitude</prgn>, ao contrário do <prgn>deborphan</prgn> não irá marcar como pacotes obsoletos que instalou manualmente, em oposição aos que foram instalados automaticamente através de dependências.
ru: Определить, какие пакеты устарели, очень легко, так как программы управления помечают их как "устаревшие". Если вы используете <prgn>aptitude</prgn>, то полный список этих пакетов находится в разделе "Устаревшие и локально созданные пакеты". В программе <prgn>dselect</prgn> есть аналогичный раздел, но список пакетов в нём может несколько отличаться. Если в &oldreleasename; вы использовали <prgn>aptitude</prgn> для установки пакетов вручную, то <prgn>aptitude</prgn> помнит об этом факте, и пометит такие пакеты как устаревшие, которые были установлены для удовлетворения зависимостей и которые больше не нужны, если пакет был удалён. В отличие от <prgn>deborphan</prgn>, <prgn>aptitude</prgn> не считает устаревшими пакеты, которые вы установили вручную, а не автоматически для удовлетворения зависимостей.
sv: Att identifiera vilka paket på ett uppdaterat system som är "föråldrade" är enkelt eftersom pakethanteringsvertygen markerar dem så. Om du använder <prgn>aptitude</prgn>, kommer du att se en lista över dessa paket under "Föråldrade och lokalt skapade paket". <prgn>dselect</prgn> tillhandahåller en liknande sektion men listning som visas kan skilja sig. Dessutom, om du har använt <prgn>aptitude</prgn> för att manuellt installera paket i &oldreleasename; kommer den att hålla kontroll på de paket som du manuellt installerat och kommer att kunna markera de paket som själva har hämtats in av beroenden, vilka inte längre behövs om ett paket har tagits bort. Dessutom, <prgn>aptitude</prgn>, till skillnad från <prgn>deborphan</prgn> kommer inte markera de manuellt installerade som föråldrade paket, i motsats till de som blev automatiskt installerade genom beroenden.
zh_cn: 因为软件包管理的前端界面会将这些软件包标示为 "废弃(obsolete)"，因而我们可以很轻易得就可以判断在一个已经过升级后的系统里，哪些软件包已遭废弃了。如果您所使用的是 <prgn>aptitude</prgn>，您可以在【废弃及本机所建立的软件包, Obsolete and Locally Created Packages】这个项目里看到这些软件包的列表。在 <prgn>dselect</prgn> 里也提供了类似的功能但它所显示的列表可能会有点不太一样。同时，如果您之前是手动使用 <prgn>aptitude</prgn> 来安装 &oldreleasename; 的软件包，它会持续得跟踪这些您手动安装的软件包，并且如果有某个软件包被移除了，而使得这些因依赖关系而被安装的软件包已经不再有任何作用时，它可以找出这些软件包并将其标示为 "废弃"。而像是 <prgn>deborphan</prgn> 并不会将您手动安装的软件包标示为 "废弃"；但 <prgn>aptitude</prgn> 则是完全相反，即使这些软件包是因为依赖性才被自动安装进来的。

source: There are additional tools you can use to find obsolete packages such as <prgn>deborphan</prgn>, <prgn>debfoster</prgn> or <prgn>cruft</prgn>. <prgn>deborphan</prgn> is highly recommended, although it will (in default mode) only report obsolete libraries: packages in the "libs" or "oldlibs" sections that are not used by any other packages. Do not blindly remove the packages these tools present, especially if you are using aggressive non-default options that are prone to produce false positives. It is highly recommended that you manually review the packages suggested for removal (i.e. their contents, size and description) before you remove them.
ja: 時代遅れのパッケージを見つけるのに使える追加ツールとしては、以下のものがあります - <prgn>deborphan</prgn> や <prgn>debfoster</prgn>、<prgn>cruft</prgn>。<prgn>deborphan</prgn> を強く推奨しますが、同プログラムは (デフォルトモードでは) 時代遅れのライブラリ - "libs" や "oldlibs" セクション内にあり、他のパッケージに使われていないパッケージ - しか報告しません。これらのプログラムが表示したパッケージをやみくもに削除しないでください。特に、誤報しやすい非デフォルトのオプションを積極的に使っている場合はなおさらです。実際に削除する前に、削除を提案されたパッケージを手作業で調査 (その中身やサイズ、説明文など) することを強く推奨します。
nl: Er zijn aanvullende hulpprogramma's, zoals <prgn>deborphan</prgn>, <prgn>debfoster</prgn> of <prgn>cruft</prgn>, die kunnen worden gebruikt om verouderde pakketten te traceren. <prgn>deborphan</prgn> wordt warm aanbevolen, hoewel het standaard (zonder extra parameters) alleen verouderde bibliotheekpakketten rapporteert: pakketten in de secties "libs" en "oldlibs" die niet door andere pakketten worden gebruikt. Verwijder nooit blindelings pakketten die door deze hulpprogramma's worden gerapporteerd, zeker niet als u gebruikt maakt van de meer aggressieve opties die een grote kans hebben ook valse meldingen te genereren. U wordt sterk aangeraden om de pakketten die voor verwijdering worden voorgesteld zelf na te lopen (d.w.z. hun inhoud, grootte en omschrijving te controleren) voordat u ze verwijdert.
pt: Existem ferramentas adicionais que pode utilizar para descobrir pacotes obsoletos tais como <prgn>deborphan</prgn>, <prgn>debfoster</prgn> ou <prgn>cruft</prgn>. O <prgn>deborphan</prgn> é fortemente recomendado, no entanto este irá (em modo por omissão) apenas reportar as bibliotecas obsoletas: pacotes nas secções "libs" ou "oldlibs" que não sejam usadas por outros pacotes. Não remova cegamente os pacotes que estas ferramentas apresentam, especialmente se estiver a utilizar opções agressivas que são sujeitas à produção de falsos positivos. É altamente recomendável que reveja manualmente os pacotes sugeridos para remoção (por ex. o seu conteúdo, dimensão e descrição) antes de os remover.
ru: Существуют и другие инструменты для определения неиспользуемых пакетов, в их число входят <prgn>deborphan</prgn>, <prgn>debfoster</prgn> и <prgn>cruft</prgn>. Советуем использовать <prgn>deborphan</prgn>, хотя по умолчанию он ищет только ненужные библиотеки (пакеты в секциях "libs" и "oldlibs", от которых не зависит ни один другой пакет). Не удаляйте подряд все пакеты, найденные такими инструментами (в особенности, если при запуске вы указали опции, отличные от опций по умолчанию), чтобы не удалить что-нибудь нужное. Настоятельно рекомендуем перед удалением внимательно просмотреть список предложенных пакетов (прочесть описание, посмотреть входящие файлы).
sv: Det finns ytterligare verktyg som du kan använda för att hitta föråldrade paket, såsom <prgn>deborphan</prgn>, <prgn>debfoster</prgn> eller <prgn>cruft</prgn>. <prgn>deborphan</prgn> rekommenderas starkt, även om det endast kommer (i standardläget) rapportera om föråldrade bibliotek: paket i sektionerna "libs" eller "oldlibs" som inte används av några andra paket. Ta inte helt blint bort de paket som dessa verktyg presenterar, speciellt om du använder aggressiva ickestandardalternativ som är benägna att producera felaktigheter. Det rekommenderas starkt att du manuellt granskar paketen som föreslås för borttagning (alltså deras innehåll, storlek och beskrivning) innan du tar bort dem.
zh_cn: 还有一些其它的软件包可以让您用来寻找这些废弃了的软件包，像是 <prgn>deborphan</prgn>、<prgn>debfoster</prgn> 或 <prgn>cruft</prgn>。其中推荐使用 <prgn>deborphan</prgn>，因为它在默认的模式下只会报告已遭废弃了的函数库：位于 "libs" 或 "oldlibs" 区的软件包就表示它们已不再被其它的软件包所使用了。但请不要轻率得依据这些工具所回报的列表就把这些软件包给移掉了，尤其是您在执行时使用的不是默认的，而是较为宽松的选项时，它们很可能会因而做出不正确的判定。因此在此强烈建议您，在进行移除的动作之前，您必须亲自再重新检视一次这些将要被移除的套件，包括它们的内容、大小，及它们的详细说明。

source: The <url id="&url-bts;" name="Debian Bug Tracking System"> often provides additional information on why the package was removed. You should review both the archived bug reports for the package itself and the archived bug reports for the <url id="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&#38;archive=yes" name="ftp.debian.org pseudo-package">.
ja: <url id="&url-bts;" name="Debian バグ追跡システム">は、パッケージが削除された理由についての情報を提供してくれることがよくあります。あるパッケージ自体についてのアーカイブ化されたバグ報告と、<url id="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&#38;archive=yes" name="ftp.debian.org pseudo-package"> のアーカイブ化されたバグ報告の両方を調査すべきです。
pt: O <url id="&url-bts;" name="Debian Bug Tracking System"> frequentemente fornece informação adicional sobre a razão da remoção do pacote. Deverá rever ambos os relatórios de erro do pacote e os relatórios de erros arquivados para o <url id="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&#38;archive=yes" name="ftp.debian.org pseudo-package">.
ru: В <url id="&url-bts;" name="системе отслеживания ошибок Debian"> зачастую содержится дополнительная информация о причинах удаления пакета. Просмотрите архив сообщений об ошибках интересующего вас пакета, а также архивированные ошибки для <url id="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org#38:archive=yes" name="псевдо-пакета ftp.debian.org">.
sv: <url id="&url-bts;" name="Debians felhanteringssystem"> tillhandahåller ofta ytterligare information om varför paketet blev borttaget. Du bör granska både de arkiverade felrapporterna för själva paketet och de arkiverade felrapporterna för pseudopaketet på <url id="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&#38;archive=yes" name="ftp.debian.org">.
zh_cn: 在 <url id="&url-bts;" name="Debian 错误跟踪系统"> 里常常会提供了为什么某个软件包会被移掉的相关信息。您可以使用该软件包本身的 bug report 数据库，或是在 <url id="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&#38;archive=yes" name="ftp.debian.org pseudo-package"> 里的 bug report 数据库来重新检视这些信息。

source: Dummy packages
ja: ダミーパッケージ
nl: Dummypakketten
pt: Pacotes 'dummy'
ru: Пакеты-пустышки
sv: Dummy-paket
zh_cn: 替代 (Dummy) 软件包
