Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: e-mail servers: Exim 4.63 (default email server for new installations), Postfix 2.3, Courier 0.53, Cyrus 2.2.
ja: メールサーバ: Exim 4.63 (新規インストール時のデフォルトのメールサーバ)、Postfix 2.3、Courier 0.53、Cyrus 2.2。
zh_cn: 电子邮件服务器：Exim 4.63（将是新安装系统默认的电子邮件服务器）、Postfix 2.3、Courier 0.53、Cyrus 2.2。

source: web servers: Apache 2.2, fnord 1.10
ja: ウェブサーバ: Apache 2.2、fnord 1.10。
zh_cn: Web 服务器：Apache 2.2、fnord 1.10

source: database servers: MySQL 5.0.32, PostgreSQL 8.1
ja: データベースサーバ: MySQL 5.0.32、PostgreSQL 8.1。
zh_cn: 数据库服务器：MySQL 5.0.32、PostgreSQL 8.1

source: the OpenSSH server, version 4.3.
ja: OpenSSH サーバのバージョン 4.3。
zh_cn: OpenSSH 服务器，4.3 版。

source: name servers: Bind 9.3, maradns 1.2.
ja: ネームサーバ: Bind 9.3、maradns 1.2。
zh_cn: 名称服务器：Bind 9.3、maradns 1.2。

source: directory server: OpenLDAP 2.3
ja: ディレクトリサーバ: OpenLDAP 2.3。
zh_cn: 目录服务器：OpenLDAP 2.3

source: <prgn>aptitude</prgn> is the preferred program for package management from console. <prgn>aptitude</prgn> supports most command line operations of <prgn>apt-get</prgn> and has proven to be better at dependency resolution than <prgn>apt-get</prgn>. If you are still using <prgn>dselect</prgn>, you should switch to <package>aptitude</package> as the official frontend for package management.
ja: <prgn>aptitude</prgn> は、コンソール上でのパッケージ管理に適したプログラムです。<prgn>apt-get</prgn> のコマンドライン操作の大半をサポートしており、<prgn>apt-get</prgn> よりも依存関係の解決の面で優れているとわかっています。まだ <prgn>dselect</prgn> を使用している場合は、公式のパッケージ管理用フロントエンドとして <package>aptitude</package> に移行すべきでしょう。
pt: O <prgn>aptitude</prgn> é o programa preferido para a gestão de pacotes através da consola. O<prgn>aptitude</prgn> suporta a maior parte das operações em comandos de linha do <prgn>apt-get</prgn> e provou resolver as dependências de um modo mais eficaz que o <prgn>apt-get</prgn>. . Se estiver ainda a utilizar o <prgn>dselect</prgn>, deverá passar para o <package>aptitude</package> como 'frontend' oficial para a gestão de pacotes.
ru: Рекомендуемой программой управления пакетами из консоли является <prgn>aptitude</prgn>. <prgn>aptitude</prgn> поддерживает большую часть операций командной строки <prgn>apt-get</prgn> и гораздо лучше разрешает зависимости. Если вы всё ещё пользуетесь <prgn>dselect</prgn>, то вам нужно перейти на официальный интерфейс управления пакетами <prgn>aptitude</prgn>.
sv: <prgn>Aptitude</prgn> är det föredragna programmet för pakethanteringen i konsollen. <prgn>Aptitude</prgn> har stöd för de flesta kommandoradsåtgärder som <prgn>apt-get</prgn> har och har visats sig vara bättre på att lösa beroendeproblem än <prgn>apt-get</prgn>. Om du fortfarande använder <prgn>dselect</prgn>, bör du byta till <package>aptitude</package> som det officiella verktyget för pakethantering.
zh_cn: <prgn>aptitude</prgn> 是在控制台 (Console) 上的软件包管理程序的第一选择。<prgn>aptitude</prgn> 支持了大部份的 <prgn>apt-get</prgn> 在命令行上的操作口令，且在处理依赖问题上，已证实它的表现优于 <prgn>apt-get</prgn>。如果您还在使用 <prgn>dselect</prgn>，您应该将软件包管理时的官方前端界面转换为使用 <package>aptitude</package>。

source: The official &debian; distribution now ships on thirteen to fifteen binary CDs (depending on the architecture) and a similar number of source CDs. A DVD version of the distribution is also available.
ja: 公式の &debian; ディストリビューションは、現在は 13〜15 枚のバイナリ CD と、ほぼ同数のソース CD の形で提供されています。DVD 版のディストリビューションも利用可能です。
pt: A distribuição &debian; oficial inclui agora aproximadamente treze a quinze CDs de binários (dependendo da arquitectura) e um número similar de CDs de código fonte. Também está disponível uma versão em DVD da distribuição.
ru: Официальный дистрибутив &debian; теперь занимает от тринадцати до пятнадцати компакт-дисков (в зависимости от архитектуры) с собранными пакетами, приблизительно столько же дисков занимают пакеты с исходными кодами. Также доступна версия дистрибутива на DVD.
sv: Den officiella &debian;-distributionen levereras på tretton till femton binär-cd-skivor (beroende på arkitektur) och ett liknande antal källkods-cd-skivor. En DVD-version av distributionen finns även tillgänglig.
zh_cn: 官方的 &debian; 发行版包含了十三至十五张（视系统架构而定）的程序光盘及数量相当的源码光盘，同时 DVD 发行版也已经推出。

source: Secure APT
ja: 安全な APT
zh_cn: 安全的 APT

source: <prgn>apt-secure</prgn> (also known as <em>Secure APT</em> is now available in &releasename;. This feature adds extra security to &debian; systems by easily supporting strong cryptography and digital signatures to validate downloaded packages. This release includes the <prgn>apt-key</prgn> tool for adding new keys to apt's keyring, which by default includes only the current Debian archive signing key, provided in the <package>debian-archive-keyring</package>.
ja: <prgn>apt-secure</prgn> (別名 <em>Secure APT</em>) が &releasename; で使えるようになりました。この機能は、強力な暗号化とデジタル署名を簡単にサポートし、ダウンロードしたパッケージを検証できるようにすることで、&debian; システムにさらなるセキュリティを追加します。今回のリリースには、apt のキーリングに新しい鍵を追加するための <prgn>apt-key</prgn> ツールも含まれています。apt のキーリングには、デフォルトでは現在の Debian アーカイブを署名するための鍵しか含まれていないからです。<prgn>apt-key</prgn> ツールは <package>debian-archive-keyring</package> パッケージで提供されています。
zh_cn: 在 &releasename; 中现已提供了 <prgn>apt-secure</prgn>（也称作 <em>Secure APT</em>）。这个功能能够轻易得支持强力的验证码及数位签章以用来检验下载到的软件包，让 &debian; 系统能得到更进一步的保障。这个发行版本中还包含了 <prgn>apt-key</prgn> 工具以便能将新的金钥加入 apt 的金钥库中。它默认上只收录了由 <package>debian-archive-keyring</package> 所提供的，当前的 Debian 档案库的签名金钥。

source: In its default configuration, <prgn>apt-secure</prgn> will warn if packages are downloaded from sources that are not authenticated. Future releases might force all packages to be verified before downloading them. Unofficial apt sources administrators are encouraged to generate a cryptographic key and sign their Release files, as well as providing a secure way to distribute their public keys.
ja: デフォルトの設定では、<prgn>apt-secure</prgn> は、証明されていないソースからパッケージをダウンロードする場合に警告を発します。将来のリリースでは、すべてのパッケージについて、ダウンロード前に検証しなければならないようになるでしょう。非公式な apt ソースの管理者には、暗号鍵を生成してその鍵で Release ファイルに署名し、さらにその公開鍵を配布する安全な手段を提供することをお勧めします。
zh_cn: 在默认的设置上，当软件包是下载自无法认证的来源时，<prgn>apt-secure</prgn> 会发出警告。未来的版本将可能会在下载软件包前就先强制进行检验。非官方的 apt 来源的管理者欢迎您建立您的密钥并在 Release 档上签名，并能寻求安全的方式来发布他们的公钥。

source: For more information please read <prgn>apt-secure</prgn>'s manual page, the <url id="http://www.debian.org/doc/manuals/securing-debian-howto/ch7#s-deb-pack-sign" name="Package signing in Debian"> chapter of the <em>Securing Debian Manual</em> and the <url id="http://wiki.debian.org/SecureApt" name="wiki documentation">.
ja: さらに詳しい情報は、<prgn>apt-secure</prgn> のマニュアルページ・<em>Debian 安全化マニュアル (Securing Debian Manual)</em> の <url id="http://www.debian.org/doc/manuals/securing-debian-howto/ch7#s-deb-pack-sign" name="Package signing in Debian"> の章・<url id="http://wiki.debian.org/SecureApt" name="Wiki 文書">を参照してください。
zh_cn: 请阅读 <prgn>apt-secure</prgn> 的说明手册来取得更详尽的信息：<em>加强 Debian 安全手册</em> 的 <url id="http://www.debian.org/doc/manuals/securing-debian-howto/ch7#s-deb-pack-sign" name="Debian 的软件包签名"> 一节，以及<url id="http://wiki.debian.org/SecureApt" name="Wiki 文件">。

source: debian-volatile now an official service
ja: debian-volatile が公式サービスに
pt: debian-volatile é agora um serviço oficial
ru: debian-volatile теперь предоставляется официально
sv: debian-volatile är nu en officiell tjänst
zh_cn: debian-volatile 现已是官方服务

source: The <em>debian-volatile</em> service that was introduced as an unofficial service with the release of &oldreleasename;, has now become an official &debian; service.
ja: &oldreleasename; のリリースとともに非公式のサービスとして導入された <em>debian-volatile</em> サービスが、&debian; の公式のサービスとなりました。
pt: O serviço <em>debian-volatile</em> introduzido como serviço não-oficial com o lançamento &oldreleasename;, tornou-se agora um serviço Debian &debian; oficial.
ru: Неофициальный сервис <em>debian-volatile</em>, появившийся в выпуске &oldreleasename, теперь стал официальным сервисом &debian;.
sv: Tjänsten <em>debian-volatile</em> som introducerades som en inofficiell tjänst med utgåvan av &oldreleasename, har nu blivit en officiell &debian;-tjänst.
zh_cn: 之前在 &oldreleasename; 里所介绍的 <em>debian-volatile</em> 非官方服务现已成为官方服务。

source: This means that it no longer has a <tt>.debian.net</tt> address, but now uses a <tt>.debian.org</tt> address. Please make sure to update your <file>/etc/apt/sources.list</file> accordingly if you were already using this service.
ja: つまり、これまでの <tt>.debian.net</tt> ではなく <tt>.debian.org</tt> がサービスのアドレスに使われるようになりました。このサービスを既に利用している場合は、忘れずに <file>/etc/apt/sources.list</file> を更新してサービスのアドレスを変更してください。
pt: Significa então que não possui mais um endereço <tt>.debian.net</tt>, usando agora um endereço <tt>.debian.org</tt>. Por favor certifique-se que actualiza o seu <file>/etc/apt/sources.list</file> de acordo, se estiver a utilizar este serviço.
ru: Это означает, что он больше не имеет адреса <tt>.debian.net</tt>, вместо него используется <tt>.debian.org</tt>. Если вы уже используете этот сервис, измените настройку в файле <file>/etc/apt/sources.list</file>.
sv: Det här betyder att den inte längre har en <tt>.debian.net</tt>-adress, utan använder numera en <tt>.debian.org</tt>-adress. Tänk på att uppdatera din <file>/etc/apt/sources.list</file> på lämpligt sätt om du redan använder den här tjänsten.
zh_cn: 这表示它已不再使用 <tt>.debian.net</tt> 网址，该网址现已改为 <tt>.debian.org</tt>。若您现正使用着该服务，请确认您的 <file>/etc/apt/sources.list</file> 是否已正确对应。

source: <em>debian-volatile</em> allows users to easily update stable packages that contain information that quickly goes out of date. Examples are a virus scanner's signatures list or a spam filter's pattern set. For more information and a list of mirrors, please see the archive's <url id="&url-debian-volatile" name="web page">.
ja: <em>debian-volatile</em> を利用すると、すぐに古くなってしまう情報を含む安定版 (stable) パッケージをユーザが容易に更新できます。そのような情報としては、例えばウイルススキャナのシグネチャリストや、スパムフィルタのパターンセットがあります。さらに詳しい情報やミラーのリストについては、アーカイブの<url id="&url-debian-volatile" name="ウェブページ">を参照してください。
pt: O <em>debian-volatile</em> permite aos utilizadores actualizar facilmente pacotes que contenham informação que rapidamente se torna obsoleta. Como exemplos, as listas de assinaturas de vírus 'scanner's' ou o conjunto de padrões para filtros de spam. Para mais informações e para uma lista de 'mirrors', por favor veja o arquivo <url id="&url-debian-volatile" name="web page">.
ru: <em>debian-volatile</em> позволяет пользователям легко обновлять те стабильные пакеты, которые содержат быстро устаревающую информацию. В их число, например, входят антивирусные сигнатуры и наборы шаблонов для спам-фильтров. Дополнительную информацию и список зеркальных сайтов можно найти на <url id="&url-debian-volatile" name="странице архива">.
sv: <em>debian-volatile</em> tillåter användare att enkelt uppdatera stabila paket som innehåller information som lätt blir utdaterad. Exempel är signaturlistorna för en antivirusprodukt eller mönsteruppsättningen för ett skräppostfiler. För mer information och en lista över spegelservrar, se arkivets <url id="&url-debian-volatile" name="webbsida">.
zh_cn: <em>debian-volatile</em> 服务可以让用户轻易得进行 stable 的软件包更新，因为某些软件包，像是病毒扫瞄引擎所使用的签名列表，或是垃圾邮件过滤器所使用的样本信息，往往很快得就过时了。请到这个档案库的 <url id="&url-debian-volatile" name="网页"> 来取得更多的详细信息及镜像站之列表。

source: What's new in the installation system?
ja: インストールシステムの最新情報
nl: Nieuw in het Installatiesysteem
pt: O que há de novo no novo sistema de instalação?
ru: Что нового в системе установки?
sv: Vad är nytt i installationssystemet?
zh_cn: 安装系统有何改变？

source: There has been a lot of development on the Debian Installer since its first official release with &oldreleasename; resulting in both improved hardware support and some exciting new features.
ja: Debian Installer は、&oldreleasename; での初めての公式リリース以降も大規模に開発されています。その結果、ハードウェアサポートが改良され、ワクワクするような新機能がいくつか追加されました。
pt: Houve um grande desenvolvimento no instalador Debian desde o seu primeiro lançamento oficial com o nome de &oldreleasename; resultando tanto em melhorias no suporte de hardware bem como em excitantes novas funcionalidades.
ru: Всё время с последнего официального выпуска &oldreleasename; велась активная разработка программы установки Debian. В результате улучшилась работа с аппаратным обеспечением и были добавлены новые захватывающие возможности.
sv: Det har skett en hel del utveckling med Debian Installer sedan dess första officiella utgivning med &oldreleasename; som resulterat i både förbättrat hårdvarustöd och ett antal nya spännande funktioner.
zh_cn: 自从 Debian Installer 在 &oldreleasename; 发行了首次的官方版本后，针对硬件支持及一些有趣的新功能方面又经历了大量的开发工作。

source: In these Release Notes we'll only list the major changes in the installer. If you are interested in an overview of the detailed changes since &oldreleasename;, please check the release announcements for the &releasename; beta and RC releases available from the Debian Installer's <url id="&url-installer-news" name="news history">.
ja: このリリースノートでは、インストーラにおける変更点のうち主要なもののみをリストアップします。&oldreleasename; 以降になされた詳細な変更一覧の概要に興味がある場合は、Debian Installer の<url id="&url-installer-news" name="ニュースの履歴">で閲覧可能な、&releasename; 用ベータ版やリリース候補版 (RC) のリリースアナウンスを参照してください。
pt: Nestas Notas de Lançamento apenas iremos referir as maiores alterações no instalador. Se estiver interessado numa visão dos detalhes das alterações desde a versão &oldreleasename;, por favor veja os anúncios da versão &releasename; beta e versões RC disponíveis a partir do instalador Debian em <url id="&url-installer-news" name="news history">.
ru: В информации о выпуске мы опишем только главные изменения в программе установки. Если вам нужен краткий обзор различий с &oldreleasename;, обратитесь к анонсам выпуска &releasename; beta и RC-релизов, доступным из <url id="&url-installer-news" name="старых новостей"> о программе установки Debian.
zh_cn: 在本发行注记里，我们只会列出在安装程序里的一些重大改变。如果您想知道在 &oldreleasename; 之后它的一些详尽的改变列表，请查阅在 Debian Installer 的 <url id="&url-installer-news" name="历史旧闻"> 上有关 &releasename; beta 及 RC 版发行公告。

source: Major changes
ja: 主要な変更点
pt: Grandes alterações
ru: Главные изменения
sv: Stora ändringar
zh_cn: 主要更改

source: No reboot during the installation
ja: インストール中の再起動が不要に
pt: Não é necessário reiniciar o sistema durante a instalação
ru: Нет перезагрузки во время установки
sv: Ingen omstart under installationen
zh_cn: 在安装过程中不需重新开机

source: The installation used to be split into two parts: setting up the base system and making it bootable, followed by a reboot and after that the execution of <prgn>base-config</prgn> which would take care of things like user setup, setup of the package management system and installation of additional packages (using tasksel).
ja: インストールは以前は 2 つの部分に分かれていました。ベースシステムをセットアップしてそれを起動可能にするステージと、その後で再起動してから、ユーザのセットアップ・パッケージ管理システムのセットアップ・(tasksel を使用した) 追加パッケージのインストールなどの面倒を見る <prgn>base-config</prgn> を実行するステージです。
pt: A instalação era dividida em duas partes: configuração do sistema base e definição como 'bootable', seguido do reinicio do sistema e execução do <prgn>base-config</prgn> que tomaria conta de tudo como a configuração do utilizador ('user setup'), configuração do sistema de gestão de pacotes e instalação de pacotes adicionais (utilizando o tasksel).
ru: Ранее процесс установки происходил в два этапа: установка базовой системы и делание её загрузочной, после чего происходила перезагрузка и запускалась программа <prgn>base-config</prgn>, с помощью которой выполнялась настройка пользователей, системы управления пакетами и установка дополнительных пакетов (посредством tasksel).
sv: Installationen brukade vara uppdelad i två delar: ställa in grundsystemet och göra det startbart, följt av en omstart och efter det, uppstarten av <prgn>base-config</prgn> som tog hand om saker som användarkonfigurering, konfigurering av pakethanteringssystem och installation av ytterligare paket (med tasksel).
zh_cn: 之前的安装程序会分成两个步骤：设置 base system 及让它能够开机、接下来是重开机然后执行 <prgn>base-config</prgn> 来进行像是用户设置、设置软件包的管理系统及使用 tasksel 来安装其它额外的软件包。

source: For &releasename; the second stage has been integrated into Debian Installer itself. This has a number of advantages, including increased security and the fact that after the reboot at the end of the installation the new system should already have the correct timezone and, if you installed the Desktop environment, will at once start the graphical user interface.
ja: &releasename; では、第 2 ステージが Debian Installer 本体に統合されました。この統合には多数の利点があります。例えば、セキュリティが強化されます。また、インストールの最後の再起動後には新システムが正しいタイムゾーンを既にもった状態となり、デスクトップ環境をインストールしている場合はすぐにグラフィカルユーザインタフェースが起動されます。
pt: Para a &releasename; o segundo estádio foi integrado no próprio instalador Debian. Consegue-se assim algumas vantagens, incluindo o aumento da segurança e o facto de que após o reinicio do sistema no final da instalação o novo sistema deverá já ter o fuso horário correcto, e ainda, se instalou um ambiente de Desktop, este irá ser iniciado pela interface gráfica do utilizador.
ru: В &releasename; второй этап был включён в саму программу установки Debian. Это дало ряд преимуществ: улучшение безопасности, после перезагрузки в конце установки новой системы есть уже правильный часовой пояс, если вы установили среду рабочего стола, то будет сразу запущен графический интерфейс пользователя.
sv: För &releasename; har det andra steget integrerats i själva Debian Installer. Det här har ett antal fördelar, inklusive ökad säkerhet och att, efter omstarten på slutet av installationen, det nya systemet redan bör ha den korrekta tidszonen och, om du installerade skrivbordsmiljön, kommer att starta det grafiska användargränssnittet.
zh_cn: 但从 &releasename; 开始，第二个步骤已整合至 Debian Installer 里。这么做有许多的优点，包含了像是增强了安全性、在安装完成并重新开机之后，新系统的时区就是正确的、如果您安装了桌面环境，将会直接启动图形界面。

source: UTF-8 encoding default for new systems
ja: 新システムでは UTF-8 エンコーディングがデフォルトに
pt: Codificação UTF-8 por omissão para novos sistemas
ru: В новых системах кодировкой по умолчанию является UTF-8
sv: Teckenkodningen UTF-8 är standard för nya system
zh_cn: 新系统将默认使用 UTF-8 编码

source: The installer will set up systems to use UTF-8 encoding rather than the old language-specific encodings (like ISO-8859-1, EUC-JP or KOI-8).
ja: インストーラは、古くから使われてきた言語固有のエンコーディング (ISO-8859-1、EUC-JP、KOI-8 など) ではなく UTF-8 エンコーディングを使用するシステムをセットアップします。
pt: O instalador irá configurar os sistemas de modo a utilizarem a codificação UTF-8 em vez das codificações especificas antigas (como ISO-8859-1, EUC-JP ou KOI-8).
ru: Программа установки устанавливает системной кодировку UTF-8, то есть системная кодировка теперь не зависит от выбранного языка (типа ISO-8859-1, EUC-JP или KOI-8).
zh_cn: 安装程序将会把系统设置为使用 UTF-8 编码，而不是使用专用于各语系的旧特定编码（像是 ISO-8859-1、EUC-JP 或 KOI-8）。

source: More flexible partitioning
ja: より柔軟なパーティション分割
pt: Modo de criar partições mais flexível
ru: Более гибкая разметка
sv: Mer flexibel partitionering
zh_cn: 更有弹性的分区程序

source: It is now possible to set up filesystems on an LVM volume using guided partitioning.
ja: ガイドパーティション分割を利用して LVM ボリュームにファイルシステムをセットアップ可能になりました。
pt: É agora possível criar sistemas de ficheiros num volume LVM utilizando o modo de criação de partições assistido.
ru: Теперь с помощью автоматической разметки стало возможно настраивать файловые системы на томе LVM.
zh_cn: 现已可以利用分区引导程序，在文件系统上使用 LVM Volume。

source: The installer is also able to set up encrypted filesystems. Using manual partitioning you have the choice between <tt>dm-crypt</tt> and <tt>loop-aes</tt>, using a passphrase or a random key, and you can tune various other options. Using guided partitioning, the installer will create an encrypted LVM partition that contains any other filesystems (except <file>/boot</file>) as logical volumes.
ja: インストーラは暗号化ファイルシステムもセットアップできます。パーティションの手動分割を使用する場合、<tt>dm-crypt</tt> と <tt>loop-aes</tt> のどちらを使用するか、パスフレーズとランダムなキーのどちらを使用するかを選択したり、様々な他のオプションを調整できます。ガイドパーティション分割を利用する場合、インストーラは、他の (<file>/boot</file> 以外の) あらゆるファイルシステムを論理ボリュームとして含む暗号化 LVM パーティションを作成します。
pt: O instalador é também capaz de criar sistemas de ficheiros encriptados. Ao utilizar a criação de partições manual, terá a opção de escolher entre <tt>dm-crypt</tt> e <tt>loop-aes</tt>, utilizando uma palavra-chave ou uma chave aleatória, e pode ainda afinar várias outras opções. Ao utilizar a criação de partições assistida o instalador cria uma partição encriptada LVM que contém qualquer outro sistema de ficheiros (excepto <file>/boot</file>) como volume lógico.
ru: Также через программу установки можно настраивать шифрованные файловые системы. Используя разметку, вручную вы можете выбирать между <tt>dm-crypt</tt> и <tt>loop-aes</tt>, использовать ключевую фразу или произвольный ключ, а также настраивать другие различные параметры. При использовании автоматической разметки, программа установки создаст шифрованный раздел LVM, который может содержать любые файловые системы (кроме <file>/boot</file>) в логических томах.
sv: Installeraren kan även konfigurera krypterade filsystem. Med manuell partitionering har du möjligheten att välja mellan <tt>dm-crypt</tt> och <tt>loop-aes</tt>, med en lösenfras eller en slumpmässig nyckel, och du kan finjustera olika alternativ. Med guidad partitionering kommer installeraren att skapa en krypterad LVM-partition som innehåller alla andra filsystem (förutom <file>/boot</file>) som logiska volymer.
zh_cn: 安装程序现也可以设置加密文件系统。若使用手动硬盘分区，您可以选择使用 <tt>dm-crypt</tt> 或是 <tt>loop-aes</tt>、使用密语或随机的密钥，同时您还可以调整其它各式各样的选项。使用分区引导程序，安装程序将会建立一个加密 LVM 分区，它包含了其它的文件系统（除了 <file>/boot</file> 之外）的 Logical Volumes。

source: Graphical user interface
ja: グラフィカルユーザインタフェース
pt: Interface gráfica de utilizador
ru: Графический интерфейс пользователя
sv: Grafiskt användargränssnitt
zh_cn: 图形安装界面

source: If you prefer a graphical user interface, try booting the installer with <tt>installgui</tt>.
ja: グラフィカルユーザインタフェースの方が好きな場合は、<tt>installgui</tt> をつけてインストーラを起動してみてください。
ru: Если вы предпочитаете графический интерфейс пользователя, запустите программу установки с помощью <tt>installgui</tt>.
zh_cn: 如果您比较喜欢使用图形界面，请试着以 <tt>installgui</tt> 来启动安装程序。

source: The functionality of the graphical installer is almost identical to the regular installer, only the presentation differs. There is one exception: the graphical frontend does not support setting up encrypted partitions using random keys.
ja: グラフィカルインストーラは、表現方法が異なるだけで、機能的には通常のインストーラとほぼ同等です。唯一の例外は、グラフィカルフロントエンドが、ランダムなキーを用いた暗号化パーティションのセットアップをサポートしていないということです。
pt: A funcionalidade do instalador gráfico é praticamente a mesma do instalador normal, apenas a apresentação difere. Existe uma única excepção: a interface gráfica não suporta a criação de partições encriptadas utilizando chaves aleatórias.
ru: Функциональность графической программы установки практически идентична обычной программе установки, отличается только внешний вид. Есть одно исключение: в графическом интерфейсе не поддерживается настройка шифрованных разделов с помощью произвольных ключей.
sv: Funktionaliteten för den grafiska installeraren är nästan identisk med den vanliga installeraren, endast presentationen skiljer sig. Det finns ett undantag: det grafiska gränssnittet har inte stöd för att konfigurera krypterade partitioner med slumpmässiga nycklar.
zh_cn: 除了在外表上，图形界面的安装程序和一般安装程序的功能几乎没有任何差别。但只有一个地方不同：使用图形界面的安装程序无法将加密分区设置为使用随机金钥。

source: Note: the graphical user interface is not available for all architectures.
ja: 注意: グラフィカルユーザインタフェースは全てのアーキテクチャで利用可能ではありません。
pt: Nota: a interface gráfica do utilizador não está disponível para todas as arquitecturas.
ru: Замечание: графический интерфейс доступен не на всех архитектурах.
sv: Observera: det grafiska användargränssnittet finns inte tillgängligt för alla arkitekturer.
zh_cn: 注意：并不是所有的系统平台都有图形界面可用。
