Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: For storage devices, you can avoid this reordering by using <package>initramfs-tools</package> and configuring it to load storage device driver modules in the same order they are currently loaded. To do this, identify the order the storage modules on your system were loaded by looking at the output of <prgn>lsmod</prgn>. <prgn>lsmod</prgn> lists modules in the reverse order that they were loaded in, i.e., the first module in the list was the last one loaded.
ja: ストレージデバイスについては、<package>initramfs-tools</package> を用いて、<package>initramfs-tools</package> が現在と同じ順序でストレージデバイスドライバモジュールをロードするように設定することで、この順序の変更を防げます。そうするには、<prgn>lsmod</prgn> の出力に目を通し、システム上のストレージモジュールがロードされた順序を特定してください。<prgn>lsmod</prgn> は、ロードされた順序とは逆の順序でモジュールをリストアップします。つまり、リストの最初のモジュールは最後にロードされていたものです。
pt: Para dispositivos de armazenamento, pode evitar esta re-ordenação ao utilizar <package>initramfs-tools</package> e configurando-o de modo a carregar os módulos do driver do dispositivo de armazenamento na mesma ordem em que estão actualmente carregados. Para fazer isto, identifique a ordem dos módulos de armazenamento no seu sistema aquando o arranque veja no 'output' de <prgn>lsmod</prgn>. O <prgn>lsmod</prgn> lista os módulos na ordem inversa em que são carregados, i.e., o primeiro modulo na lista foi o último a ser carregado.
ru: Для устройств хранения данных можно избежать переназначения с помощью утилиты <package>initramfs-tools</package> и настройки загрузки драйверов модулей в одном и том же порядке. Для этого определите порядок модулей устройств хранения в системе с помощью команды <prgn>lsmod</prgn>. <prgn>lsmod</prgn> выводит список модулей в обратном порядке, в котором они загружались, то есть первые модули в списке были загружены последними.
sv: För lagringsenheter kan du undvika den här omsorteringen genom att använda <package>initramfs-tools</package> och konfigurera det att läsa in drivrutinsmoduler för lagringsenheter i samma ordning som de för närvarande läses in i. För att för det här, identifiera ordningen på lagringsmodulerna på ditt system genom att se på utdatat från <prgn>lsmod</prgn>. <prgn>lsmod</prgn> listar moduler i omvänd ordning än den de lästes in i, alltså, den första modulen i listan är den som sist lästes in.
zh_cn: 在储存设备上，您可以借由 <package>initramfs-tools</package> 并将其设置为使用和目前相同的载入顺序来载入储存设备的驱动模块以避开这个问题。为此，您可以查看 <prgn>lsmod</prgn> 的输出来确认您的系统载入储存设备的驱动模块的顺序。<prgn>lsmod</prgn> 会以相反的顺序列出载入的模块。也就是说，在列表中的第一个模块是最后载入的。

source: However, removing and reloading modules after initial boot will affect this order. Also, your kernel may have some drivers linked statically, and these names will not appear in the output of <prgn>lsmod</prgn>. You may be able to decipher these driver names and load order from looking at <file>/var/log/kern.log</file>, or the output of <prgn>dmesg</prgn>.
ja: しかし、最初に起動した後にモジュールを削除したりロードしなおしたりすると、この順序にも影響が出ます。また、カーネルには静的にリンクされたドライバが含まれているかもしれず、そのようなドライバの名前は <prgn>lsmod</prgn> の出力に現れません。<file>/var/log/kern.log</file> や <prgn>dmesg</prgn> の出力に目を通すと、これらのドライバの名前やロード順を解読できるかもしれません。
pt: No entanto, remover e voltar a carregar os módulos após o arranque inicial afectará esta ordem. O kernel pode também ter alguns controladores estaticamente ligados ('linked'), e estes nomes podem não aparecer no 'output' de <prgn>lsmod</prgn>. Pode conseguir decifrar estes nomes de controladores e carregá-los pela ordem, ao ver o ficheiro <file>/var/log/kern.log</file>, ou o 'output' de <prgn>dmesg</prgn>.
ru: Однако на этот порядок также влияет удаление и перезагрузка модулей после первоначальной загрузки. Также некоторые драйвера могут быть включены в ядро статически, и их названия не появятся в результатах <prgn>lsmod</prgn>. Вы можете определить имена таких драйверов и их порядок загрузки, проанализировав файл <file>/var/log/kern.log</file> или результат команды <prgn>dmesg</prgn>.
sv: Dock kommer borttagning och omläsning av moduler efter initial uppstart att påverka ordningen. Din kärna kan även ha några drivrutiner som är statiskt länkade, och dessa namn kommer inte att visas i utdatat från <prgn>lsmod</prgn>. Du kan möjligen läsa ut dessa drivrutinsnamn och inläsningsordning genom att se i <file>/var/log/kern.log</file>, eller utdatat från <prgn>dmesg</prgn>.
zh_cn: 但是，在开机后移除或重新载入模块将会影响这份列表的顺序。同时，您的内核也许会以静态连结至某些模块，所以这些名称将不会出现在 <prgn>lsmod</prgn> 的输出里。您也可以经由查看 <file>/var/log/kern.log</file> 或 <prgn>dmesg</prgn> 的输出来辨认出这些驱动的名称及载入顺序。

source: Add these module names to <file>/etc/initramfs-tools/modules</file> in the order they should be loaded at boot time. Some module names may have changed between &oldreleasename; and &releasename;. For example, sym53c8xx_2 has become sym53c8xx.
ja: これらのモジュール名を、起動時にロードされるべき順序で <file>/etc/initramfs-tools/modules</file> に追加してください。モジュール名の一部は &oldreleasename; と &releasename; では異なるかもしれません。例えば、sym53c8xx_2 は sym53c8xx になりました。
pt: Adicione estes nomes de módulos a <file>/etc/initramfs-tools/modules</file> pela ordem em que os mesmos deverão ser carregados durante o arranque. Alguns nomes de módulos podem ter sido alterados entre a versão &oldreleasename; e &releasename;. Por exemplo, sym53c8xx_2 passou a sym53c8xx.
ru: Добавьте имена этих модулей в файл <file>/etc/initramfs-tools/modules</file> в том порядке, в котором они должны быть загружены во время запуска машины. Некоторые имена модулей могли измениться со времени &oldreleasename;. Например, sym53c8xx_2 теперь sym53c8xx.
zh_cn: 将这些模块名称以它们在开机时应有的载入顺序新增到 <file>/etc/initramfs-tools/modules</file> 里。有些模块名称在 &oldreleasename; 及 &releasename; 里是有所不同的。比如说，sym53c8xx_2 已变成了 sym53c8xx。

source: You will then need to regenerate your initramfs image(s) by executing <tt>update-initramfs -k all</tt>.
ja: その上で <tt>update-initramfs -k all</tt> を実行し、initramfs イメージを再生成する必要があります。
pt: Terá então de recriar a sua imagem initramfs executando <tt>update-initramfs -k all</tt>.
ru: Затем вам нужно будет перегенерировать образ(ы) initramfs запустив <tt>update-initramfs -k all</tt>.
sv: Du kommer att behöva generera om dina initramfs-avbild(er) genom att köra <tt>update-initramfs -k all</tt>.
zh_cn: 然后，您将必须执行 <tt>update-initramfs -k all</tt> 来重新产生您的 initramfs 镜像。

source: Once you are running an &releasename; kernel and <prgn>udev</prgn>, you may reconfigure your system to access disks by an alias that is not dependent upon driver load order. These aliases reside in the <file>/dev/disk/</file> hierarchy.
ja: 一旦 &releasename; のカーネルと <prgn>udev</prgn> を使用し始めたら、ドライバのロード順に依存しないエイリアスでディスクにアクセスするよう、システムの設定を変更してもよいでしょう。これらのエイリアスは <file>/dev/disk/</file> 階層にあります。
pt: Assim que estiver a correr um kernel da versão &releasename; e o <prgn>udev</prgn>, pode reconfigurar o seu sistema de modo a aceder aos discos através de um 'alias' que não é dependente da ordem em que os controladores são carregados. Estes 'aliases' residem na hierarquia <file>/dev/disk/</file>.
ru: После загрузки ядра из &releasename; и <prgn>udev</prgn>, вы можете перенастроить доступ к дискам системы через псевдонимы, которые не зависят от порядка загрузки драйверов. Эти псевдонимы находятся в подкаталогах <file>/dev/disk/</file>.
sv: När du väl kör en &releasename;-kärna tillsammans med <prgn>udev</prgn>, kan du konfigurera om ditt system till att komma åt diskarna genom ett alias som inte är beroende av inläsningsordningen. Dessa alias finns under <file>/dev/disk/</file>-hierarkin.
zh_cn: 若您使用的是 &releasename; 版的内核 及 <prgn>udev</prgn>，您也许要重新设置您的系统以便能以和驱动载入顺序无关的别名来进行访问。这些别名会分门别类得放在 <file>/dev/disk/</file> 里。

source: Serial device reordering
ja: シリアルデバイスの順序の変更
pt: Reordenação dos dispositivos de série (serial)
ru: Перенумерация последовательных устройств
sv: Ny ordning för serieenheter
zh_cn: 重新排序串联设备

source: If you have an HP machine and you're using the MP serial console port (the connector labelled "console" on the 3-headed cable), this kernel upgrade will break your console!
ja: HP のマシンで MP のシリアルコンソールポート (三頭ケーブルに "console" というラベルのついたコネクタ) を使用している場合、このカーネルのアップグレードでコンソールが壊れます!
pt: Se tem uma máquina HP e está a usar a porta da consola de série MP (o conector marcado como "console" no cabo de 3-cabeças), esta actualização de kernel irá tornar a consola inoperactiva!
ru: Если у вас машина HP и вы используете последовательный порт консоли MP (провод, помеченный как "console" на кабеле с 3-мя разъёмами), то обновление ядра сломает доступ к консоли!
sv: Om du har en HP-dator och du använder MP-seriekonsollporten (kontakten märkt "console" på 3-kontakters kabeln), denna kärnuppgraderingen kommer att göra din konsoll trasig!
zh_cn: 如果您手上的是 HP 的机器且您正在使用 MP 串联控制台连接埠（在三头的连接线上，其连接器有标注‘console’者），内核的升级将会中断您的控制台！

source: Please read the following information before upgrading.
ja: アップグレード前に以下の情報を読んでください。
pt: Por favor leia a seguinte informação antes da actualização.
ru: Перед обновлением, прочитайте далее этот раздел.
sv: Läs följande information innan uppgraderingen påbörjas.
zh_cn: 请在升级之前阅读以下信息。

source: The console device will change from <file>ttyS0</file> to <file>ttyS1</file>, <file>ttyS2</file>, or <file>ttyS3</file> so
ja: コンソールデバイスが <file>ttyS0</file> から <file>ttyS1</file>、<file>ttyS2</file>、<file>ttyS3</file> のいずれかに変更されます。したがって、
pt: O dispositivo de consola irá mudar de <file>ttyS0</file> para <file>ttyS1</file>, <file>ttyS2</file>, ou <file>ttyS3</file> por isso
ru: Имя устройства консоли будет изменено с <file>ttyS0</file> на <file>ttyS1</file>, <file>ttyS2</file> или <file>ttyS3</file>, поэтому
sv: Konsollenheten kommer att ändras från <file>ttyS0</file> till <file>ttyS1</file>, <file>ttyS2</file>, eller <file>ttyS3</file>
zh_cn: 因为控制台设备将会由 <file>ttyS0</file> 变成 <file>ttyS1</file>，<file>ttyS2</file> 或 <file>ttyS3</file>，所以

source: Edit <file>/etc/inittab</file> to add a getty entry for <file>/dev/ttyS1</file> (rx4640, rx5670, rx7620, rx8620, Superdome), <file>/dev/ttyS2</file> (rx1600), or <file>/dev/ttyS3</file> (rx2600).
ja: <file>/etc/inittab</file> を編集し、<file>/dev/ttyS1</file> (rx4640、rx5670、rx7620、rx8620、Superdome)、<file>/dev/ttyS2</file> (rx1600)、<file>/dev/ttyS3</file> (rx2600) のいずれかの getty エントリを追加してください。
pt: Edite <file>/etc/inittab</file> e adicione uma entrada getty para <file>/dev/ttyS1</file> (rx4640, rx5670, rx7620, rx8620, Superdome), <file>/dev/ttyS2</file> (rx1600), ou <file>/dev/ttyS3</file> (rx2600).
ru: Отредактируйте <file>/etc/inittab</file>, добавив запись getty для <file>/dev/ttyS1</file> (rx4640, rx5670, rx7620, rx8620, Superdome), <file>/dev/ttyS2</file> (rx1600) или <file>/dev/ttyS3</file> (rx2600).
sv: Redigera <file>/etc/inittab</file> för att lägga till en getty-post för <file>/dev/ttyS1</file> (rx4640, rx5670, rx7620, rx8620, Superdome), <file>/dev/ttyS2</file> (rx1600), eller <file>/dev/ttyS3</file> (rx2600).
zh_cn: 请编辑 <file>/etc/inittab</file> 并替 <file>/dev/ttyS1</file> (rx4640, rx5670, rx7620, rx8620, Superdome)，<file>/dev/ttyS2</file> (rx1600) 或 <file>/dev/ttyS3</file> (rx2600) 新增一个项目。

source: Edit <file>/etc/securetty</file> to add <file>ttyS1</file>, <file>ttyS2</file>, or <file>ttyS3</file>.
ja: <file>/etc/securetty</file> を編集し、<file>ttyS1</file>、<file>ttyS2</file>、<file>ttyS3</file> のいずれかを追加してください。
pt: Edite <file>/etc/securetty</file> e adicione <file>ttyS1</file>, <file>ttyS2</file>, ou <file>ttyS3</file>.
ru: Отредактируйте <file>/etc/securetty</file> добавив <file>ttyS1</file>, <file>ttyS2</file> или <file>ttyS3</file>.
sv: Redigera <file>/etc/securetty</file> för att lägga till <file>ttyS1</file>, <file>ttyS2</file>, eller <file>ttyS3</file>.
zh_cn: 编辑 <file>/etc/securetty</file> 以新增 <file>ttyS1</file>，<file>ttyS2</file> 或 <file>ttyS3</file>。

source: Leave the existing <file>ttyS0</file> entries in <file>/etc/inittab</file> and <file>/etc/securetty</file> so you can still boot old kernels.
ja: これからも古いカーネルを起動できるよう、<file>/etc/inittab</file> と <file>/etc/securetty</file> の既存の <file>ttyS0</file> エントリはそのまま残しておいてください。
pt: Deixe as entradas <file>ttyS0</file> existentes em <file>/etc/inittab</file> e em <file>/etc/securetty</file> de modo a poder arrancar com kernels antigos.
ru: Оставьте имеющиеся записи <file>ttyS0</file> в <file>/etc/inittab</file> и <file>/etc/securetty</file>, для того, чтобы можно было загружать старые ядра.
sv: Lämna kvar de befintliga <file>ttyS0</file>-posterna i <file>/etc/inittab</file> och <file>/etc/securetty</file> så att du fortfarande kan starta upp med äldre kärnor.
zh_cn: 保留在 <file>/etc/inittab</file> 中原有的 <file>ttyS0</file> 及 <file>/etc/securetty</file> 这样您才可以继续以旧的内核开机。

source: Edit <file>/etc/elilo.conf</file> to remove any "console=" arguments.
ja: <file>/etc/elilo.conf</file> を編集して "console=" 引数を全て削除してください。
pt: Edite <file>/etc/elilo.conf</file> e remova qualquer argumento "console=".
ru: Отредактируйте <file>/etc/elilo.conf</file>, удалив все параметры "console=".
sv: Redigera <file>/etc/elilo.conf</file> för att ta bort eventuella "console="-argument.
zh_cn: 编辑 <file>/etc/elilo.conf</file> 并移除所有的 "console=" 参数。

source: Run <prgn>elilo</prgn> to install the bootloader with new configuration.
ja: <prgn>elilo</prgn> を実行し、新しい設定のブートローダをインストールしてください。
pt: Corra <prgn>elilo</prgn> para instalar o gestor de arranque com a nova configuração.
ru: Запустите <prgn>elilo</prgn>, чтобы применить к системному загрузчику новую конфигурацию.
sv: Kör <prgn>elilo</prgn> för att installera starthanteraren med den nya konfigurationen.
zh_cn: 执行 <prgn>elilo</prgn> 来以新的设置安装开机程序。

source: Reboot and use the EFI boot option maintenance menu to select exactly one device for console output, input, and standard error. Then do a cold reset so the changes take effect.
ja: 再起動し、EFI 起動オプションメンテナンスメニューを用いてコンソール出力・入力・標準エラー出力にデバイスを 1 つだけ選択してください。その上で、コールドリセットを行って変更を有効にしてください。
pt: Reinicie o sistema e utilize a opção do menu de manutenção de arranque EFI para seleccionar exactamente um dispositivo para consola de 'output', 'input' e erros standards. Efectue depois um arranque a frio para que as alterações surtam efeito.
ru: Перезагрузитесь и с помощью EFI меню обслуживания загрузки выберите правильные устройства для консольного вывода, ввода и ошибок. Затем, чтобы изменения вступили в силу выполните "холодную" перезагрузку.
sv: Starta om och använd EFI-uppstartsalternativet för underhållsmenyn för att välja exakt en enhet för konsollutdata, inmatning och standard fel. Gör sedan en kall omstart så att ändringarna börjar gälla.
zh_cn: 重新开机并使用 EFI 开机选项管理菜单来选择控制台输出、输入及标准错误的正确设备。然后进行冷启动让这些设置生效。

source: For the MP console, be careful to select the device with "Acpi(HWP0002,700)/Pci(...)/Uart" in the path.
ja: MP コンソールについては、"Acpi(HWP0002,700)/Pci(...)/Uart" をパスに含むデバイスを選択するよう注意してください。
pt: Para a consola MP seja cuidadoso ao seleccionar o dispositivo com "Acpi(HWP0002,700)/Pci(...)/Uart" no caminho (path).
ru: Для консоли MP осторожно выберите в пути устройство "Acpi(HWP0002,700)/Pci(...)/Uart".
sv: För MP-konsollen, var noga med att välja enheten med "Acpi(HWP0002,700)/Pci(...)/Uart" i sökvägen.
zh_cn: 针对 MP 的控制台，请小心得在目录中选定 "Acpi(HWP0002,700)/Pci(...)/Uart" 设备。

source: More details about these changes and troubleshooting hints are available at <url id="http://lists.debian.org/debian-ia64/2005/01/msg00008.html">.
ja: これらの変更に関する詳細情報や問題解決のヒントは <url id="http://lists.debian.org/debian-ia64/2005/01/msg00008.html"> で閲覧可能です。
pt: Mais detalhes sobre estas alterações e dicas para resolução de problemas estão disponíveis em <url id="http://lists.debian.org/debian-ia64/2005/01/msg00008.html">.
ru: Более подробно об этих изменениях и выявлении неисправностей можно прочитать в <url id="http://lists.debian.org/debian-ia64/2005/01/msg00008.html">.
sv: Mera detaljer om dessa ändringar och problelösning finns tillgängliga på <url id="http://lists.debian.org/debian-ia64/2005/01/msg00008.html">.
zh_cn: 有关于这些改变及疑难排解技巧的更多详尽信息可于 <url id="http://lists.debian.org/debian-ia64/2005/01/msg00008.html"> 取得。

source: Upgrading the kernel
ja: カーネルのアップグレード
nl: De kernel opwaarderen
pt: A actualizar o kernel
ru: Обновление ядра
sv: Uppgradera kärnan
zh_cn: 进行内核的升级

source: When you dist-upgrade from &oldreleasename; to &releasename;, it is strongly recommended that you install a new linux-image-2.6-* metapackage. This package may be installed automatically by the dist-upgrade process. You can verify this by running:
ja: &oldreleasename; から &releasename; への dist-upgrade を実行する際には、新しい linux-image-2.6-* メタパッケージをインストールすることを強くお勧めします。このパッケージは、dist-upgrade の過程で自動的にインストールされるかもしれません。次のように実行すると、このパッケージがインストールされたか確認できます。
pt: Quando executa uma actualização de versão (dist-upgrade) da &oldreleasename; para &releasename;, é fortemente recomendado que instale um novo meta-pacote linux-image-2.6-*. Este pacote pode ser instalado automaticamente pelo processo dist-upgrade. Pode verificar isto ao correr:
ru: При dist-upgrade с &oldreleasename; до &releasename; настоятельно рекомендуется установить новый метапакет linux-image-2.6-*. Этот пакет может быть установлен автоматически процессом dist-upgrade. Вы можете проверить это командой:
sv: När du kör dist-upgrade från &oldreleasename; till &releasename;, rekommenderas det starkt att du installerar ett nytt linux-image-2.6-*-metapaket. Det här paketet kan installeras automatiskt av dist-upgrade-processen. Du kan verifiera det genom att köra:
zh_cn: 当您由 &oldreleasename; 完整升级至 &releasename; 后，强烈建议您安装某个 linux-image-2.6-* 虚拟软件包。这个软件包可能会在完整升级的过程中被自动安装。若想确认，请执行：

source: If you do not see any output, then you will need to install a new linux-image package by hand. To see a list of available linux-image-2.6 metapackages, run:
ja: 何も出力されない場合は、新しい linux-image パッケージを手作業でインストールする必要があります。利用可能な linux-image-2.6 メタパッケージの一覧を見るには次のように実行してください。
pt: Se não vê nenhum 'output' poderá ter que instalar um novo pacote linux-image manualmente. Para ver uma lista de meta-pacotes linux-image-2.6 disponíveis corra:
ru: Если в результате вы ничего не увидели, то вам нужно установить новый пакет linux-image вручную. Чтобы увидеть список доступных метапакетов linux-image-2.6, выполните:
sv: Om du inte ser något utdata, behöver du installera ett nytt linux-image-paket för hand. Kör följande kommando för att se en lista över tillgängliga linux-image-2.6-metapaket:
zh_cn: 如果您没有看到任何输出文字，那么您将得手动安装一个新的 linux-image 虚拟软件包。若想得到可用的 linux-image-2.6 虚拟软件包列表，请执行：

source: If you are unsure about which package to select, run <tt>uname -r</tt> and look for a package with a similar name. For example, if you see '2.4.27-3-686', it is recommended that you install <package>linux-image-2.6-686</package>. You may also use <prgn>apt-cache</prgn> to see a long description of each package in order to help choose the best one available. For example:
ja: どのパッケージを選択すればよいのか心配ならば、<tt>uname -r</tt> を実行し、似た名前をもつパッケージを探してください。例えば、コマンドの結果が '2.4.27-3-686' の場合は <package>linux-image-2.6-686</package> をインストールすることをお勧めします。利用可能なパッケージのうち最良のものを選ぶ手助けとして、次のように <prgn>apt-cache</prgn> を用いて各パッケージのパッケージ説明・詳細版を見てもよいでしょう。
pt: Se estiver inseguro sobre que pacote seleccionar, corra <tt>uname -r</tt> e procure um pacote com um nome similar, Por exemplo, se vir '2.4.27-3-686', é-lhe recomendado que instale <package>linux-image-2.6-686</package>. Pode também usar o <prgn>apt-cache</prgn> para ver uma descrição longa sobre cada pacote de modo a lhe ajudar a escolher o melhor disponível. Por exemplo:
ru: Если вы не знаете какой пакет выбрать, запустите <tt>uname -r</tt> и поищите пакет с похожим именем. Например, если вы увидели '2.4.27-3-686', то рекомендуется установить <package>linux-image-2.6-686</package>. Для выбора подходящего из возможных, вы можете воспользоваться <prgn>apt-cache</prgn>, чтобы посмотреть подробное описание каждого пакета. Например:
zh_cn: 如果您无法确定该选择哪一个软件包，请执行 <tt>uname -r</tt> 并查看是否有名称类似的软件包。比如说，如果您看到了 '2.4.27-3-686'，在此建议您安装<package>linux-image-2.6-686</package>。您也可以利用 <prgn>apt-cache</prgn> 来查看每个软件包的详细说明来让您能在其中选出最合适的软件包。比如说：

source: You should then use <tt>aptitude install</tt> to install it. Once this new kernel is installed you should reboot at the next available opportunity to get the benefits provided by the new kernel version.
ja: インストールするカーネルイメージが決まったら、<tt>aptitude install</tt> でインストールします。新しいカーネルがインストールされたら、再起動できる機会に再起動し、新しいバージョンのカーネルを有効にしてください。
zh_cn: 接下来，您应该使用 <tt>aptitude install</tt> 来进行安装。当新的内核安装完毕后，您应当找个适当时机重新开机，以便能享用新的内核版本所带来的种种好处。

source: For the more adventurous there is an easy way to compile your own custom kernel on &debian;. Install the <package>kernel-package</package> tool and read the documentation in <file>/usr/share/doc/kernel-package</file>.
ja: もうちょっと冒険したい人には、自分のカスタムカーネルをコンパイルする方法も &debian; は提供しています。<package>kernel-package</package> をインストールして、<file>/usr/share/doc/kernel-package</file> の文書を読んでみてください。
nl: Voor de meer avontuurlijk ingestelde personen is er een relatief eenvoudige manier om uw eigen maatwerk kernel te compileren op &debian;. Installeer hiervoor het pakket <package>kernel-package</package> en lees de documentatie in <file>/usr/share/doc/kernel-package</file>.
pt: Para os mais aventurosos existe um modo fácil de compilar o seu kernel personalizado na &debian;. Instale a ferramenta <package>kernel-package</package> e leia a documentação em <file>/usr/share/doc/kernel-package</file>.
ru: Если вы не боитесь трудностей, то можете скомпилировать ядро самостоятельно из исходного кода. Установите пакет <package>kernel-package</package> и прочитайте документацию в каталоге <file>/usr/share/doc/kernel-package</file>.
sv: För den mer äventyrlige finns det ett enkelt sätt att bygga din egna anpassade kärna på &debian;. Installera verktyget <package>kernel-package</package> och läs dokumentationen i <file>/usr/share/doc/kernel-package</file>.
zh_cn: 对于那些比较富有冒险心的人，我们也提供了一个在 &debian; 上自行编译内核 的简易方法。请安装 <package>kernel-package</package> 工具并详细阅读在 <file>/usr/share/doc/kernel-package</file> 里的说明文件。

source: Things to do before rebooting
ja: 再起動の前にすべきこと
nl: Voordat u het systeem opnieuw opstart
pt: Coisas a fazer antes de reinicializar
ru: Перед перезагрузкой
sv: Saker att göra före omstart
zh_cn: 在重新开机前应该完成的工作

source: When <tt>aptitude dist-upgrade</tt> has finished, the "formal" upgrade is complete, but there are some other things that should be taken care of <em>before</em> the next reboot.
ja: <tt>aptitude dist-upgrade</tt> が終了したら、「公式」にはアップグレードは終了したことになります。しかし次に再起動する<em>前に</em>、面倒を見てやらなければならないことがいくつかあります。
nl: Als <tt>aptitude dist-upgrade</tt> klaar is, is de "formele" migratievoltooid. Er zijn echter enkele zaken die gedaan zouden moeten worden <em>voordat</em> het systeem opnieuw wordt opgestart.
pt: Quando o <tt>aptitude dist-upgrade</tt> tiver terminado, a actualização "formal" estará completa, mas existem algumas coisas com as quais é preciso ter atenção <em>antes</em> da próxima reinicialização.
ru: Когда команда <tt>aptitude dist-upgrade</tt> закончила работу, формально обновление завершено, но <em>перед</em> перезагрузкой следует проделать ещё несколько действий.
sv: När <tt>aptitude dist-upgrade</tt> har kört färdigt är den "formella" uppgraderingen färdig, men det finns vissa andra saker som bör tas hand om <em>före</em> nästa omstart.
zh_cn: 当 <tt>aptitude dist-upgrade</tt> 执行完毕后，系统升级“形式上”已经完成了，但仍然有一些工作是在您下次重新启动系统<em>之前</em>应该要加以注意的。

source: Rerun lilo
ja: lilo の再実行
zh_cn: 重新执行 lilo

source: If you are using <package>lilo</package> as your bootloader (it is the default bootloader for some installations of &oldreleasename;) it is strongly recommended that you rerun lilo after the upgrade:
ja: (&oldreleasename; をインストールしたときに場合によってはデフォルトのブートローダとなる) <package>lilo</package> をブートローダとして使用している場合は、アップグレード後に以下のように lilo をもう一度実行しておくことを強くお勧めします。

source: Notice this is needed even if you did not upgrade your system's kernel, as lilo's second stage will change due to the package upgrade.
ja: 注意しなくてはならないのは、システムのカーネルをアップグレードしていない場合でもこの操作が必要になるということです。それは、パッケージのアップグレードによって lilo の第 2 ステージが変更されているからです。
zh_cn: 请注意到，如果您并没有升级您的系统的内核，这个动作还是必要的，因为 lilo 的第二阶段可能会因为软件包的升级而改变了。
