Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: The Mozilla programs <package>firefox</package> and <package>thunderbird</package> (rebranded in Debian to <package>iceweasel</package> and <package>icedove</package>, respectively), are important tools for many users. Unfortunately the upstream security policy is to urge users to update to new upstream versions, which conflicts with Debian's policy not to ship large functional changes in security updates. We cannot predict it today, but during lifetime of &releasename; the Debian Security Team may come to a point where supporting Mozilla products is no longer feasible and announce the end of security support for Mozilla products. You should take this into account when deploying Mozilla and consider alternatives available in Debian if the absence of security support would pose a problem for you.
ja: Mozilla のプログラムである <package>firefox</package> と <package>thunderbird</package> (Debian ではそれぞれ <package>iceweasel</package> と <package>icedove</package> に商標が変更されている。) は多数のユーザにとって重要なツールです。しかし残念なことに、上流のセキュリティポリシーは上流の新しいバージョンに更新するようユーザに強いることで、これは、セキュリティアップデートには大きな機能変更を含めないという Debian のポリシーと矛盾します。いつになるかは今のところわかりませんが、&releasename; のサポート期間の間に、Mozilla 製品のサポートがもはや Debian セキュリティチームにとって実現不可能になり、Debian セキュリティチームが Mozilla 製品のセキュリティサポートの終了を発表するときが来るかもしれません。Mozilla 製品をインストールするときはこのことを考慮に入れ、セキュリティサポートの終了が問題になると考えられる場合は Debian で提供されている代替プログラムの使用を検討してください。

source: KDE desktop
ja: KDE デスクトップ
zh_cn: KDE 桌面

source: KDE media handling has changed in the version available in &releasename; from using <file>device:/</file> to <file>media:/</file>. Some user configuration files might have stored <file>device:/</file> links in them which should be adapted. Notably, <file>~/.kde/share/apps/konqsidebartng/virtual_folders/services</file> contains this reference and can be safely deleted as it will not be created when setting up new users.
ja: &releasename; に含まれているバージョンの KDE では、メディアの取り扱い方法が、<file>device:/</file> を用いたアドレスから <file>media:/</file> を用いたアドレスへと変化しました。一部のユーザ設定ファイルには <file>device:/</file> を用いたリンクが含まれている可能性があるので、それらは新しいアドレスに合うよう修正すべきです。特に、<file>~/.kde/share/apps/konqsidebartng/virtual_folders/services</file> には <file>device:/</file> を用いた参照があります。このファイルは、新規ユーザをセットアップしたときには作成されないので、安全に削除できます。
zh_cn: 在 &releasename; 中所提供的 KDE 媒体管理程序因版本变更，已由使用 <file>device:/</file> 变为使用 <file>media:/</file>。有些还在使用着 <file>device:/</file> 连结的用户设置必须更正。请注意到，<file>~/.kde/share/apps/konqsidebartng/virtual_folders/services</file> 包含了这项设置且可以安全得删除，让它不会在设置新的用户时被再次建立。

source: There have been many changes in the KDE desktop environment from the version shipped in &oldreleasename; to the version in &releasename;, you can find more information in the <url id="http://www.kde.org/announcements/announce-3.5.php" name="KDE 3.5 Release Notes">.
ja: KDE デスクトップ環境は、&oldreleasename; に含まれていたバージョンから &releasename; に含まれているバージョンまでに多くの変更が加えられました。さらに詳しい情報は <url id="http://www.kde.org/announcements/announce-3.5.php" name="KDE 3.5 のリリースノート">にあります。
zh_cn: &oldreleasename; 所搭载的 KDE 桌面环境和 &releasename; 上的版本已有着许多不同，您可以在 <url id="http://www.kde.org/announcements/announce-3.5.php" name="KDE 3.5 Release Notes"> 上找到更多的详尽信息。

source: GNOME desktop changes and support
ja: GNOME デスクトップに関する変更とサポート
zh_cn: GNOME 桌面的变更和支持

source: If you used the GNOME desktop in &oldreleasename; you will not benefit of some of the changes introduced in the default configuration in Debian for &releasename;. In some extreme cases the GNOME desktop might not properly handle your old configuration and might not behave properly.
ja: &oldreleasename; で GNOME デスクトップを使用していた場合、&releasename; になって Debian でのデフォルトの設定に導入された変更のうち一部は役立たないでしょう。極端な場合、GNOME デスクトップは過去の設定内容を適切に扱えず、正しい振舞いをしない可能性があります。
zh_cn: 如果您使用着 &oldreleasename; 所搭载的 GNOME 桌面环境，您将无法在 Debian 里一些建议使用的默认设置的改变上得到助益。在一些极端的例子里，GNOME 桌面环境可能无法正确得使用您旧有的设置，且可能无法适当得运作。

source: If you have not heavily invested in configuring your GNOME desktop you might want to move the the <file>.gconf</file> directory in user's home directories to a different name (such as <file>.gconf.old</file>) so that it gets recreated, with the default configuration for &releasename;, upon starting a new session.
ja: GNOME デスクトップの設定を大幅に変更していないのであれば、ユーザのホームディレクトリ内の <file>.gconf</file> ディレクトリを別の名前 (<file>.gconf.old</file> など) に変更するとよいでしょう。そうすれば、新しいセッションを開始したときに <file>.gconf</file> ディレクトリは作成しなおされ、&releasename; のデフォルトの設定を含むようになります。
zh_cn: 如果您对于您的 GNOME 桌面的设置不是很在乎的话，您可以把用户主目录里的 <file>.gconf</file> 目录更名，（像是 <file>.gconf.old</file>），让它在启用新的连线时重新以 &releasename; 的默认设置重新产生。

source: With the release of &releasename;, Debian no longer contains packages for most of the obsolete version 1 release of GNOME. Although some packages remain in order to support some Debian packages which have not yet been updated to GNOME 2. Packages for GTK1.2 remain fully maintained.
ja: &releasename; のリリースから、Debian には、もはやサポートされていない GNOME バージョン 1 リリースのパッケージの大半が含まれなくなりました。しかし、GNOME 2 を使うよう更新されていないいくつかの Debian パッケージをサポートするため、一部のパッケージは残されています。GTK1.2 のパッケージはまだ完全に保守され続けています。
zh_cn: 在 &releasename; 释出版里， Debian 已不再包含大多数和 GNOME 已废弃的第 1 版的软件包。虽然有些软件包被保留了下来，但也只为了要支持一些尚未升级到 GNOE 2 的 Debian 软件包。而 GTK1.2 软件包则还是被完整维护着。

source: There have been many changes in the GNOME desktop environment from the version shipped in &oldreleasename; to the version in &releasename;, you can find more information in the <url id="http://www.gnome.org/start/2.14/notes/en/" name="GNOME 2.14 Release Notes">.
ja: GNOME デスクトップ環境は、&oldreleasename; に含まれていたバージョンから &releasename; に含まれているバージョンまでに多くの変更が加えられました。さらに詳しい情報は <url id="http://www.gnome.org/start/2.14/notes/en/" name="GNOME 2.14 のリリースノート">にあります。
zh_cn: &oldreleasename; 所搭载的 GNOME 桌面环境和 &releasename; 上的版本已有着许多不同，您可以在 <url id="http://www.gnome.org/start/2.14/notes/en/" name="GNOME 2.14 Release Notes"> 上找到更多的详尽信息。

source: Default editor
ja: デフォルトのエディタ

source: If you were using <prgn>vim</prgn> as your default editor, this may be changed to <prgn>nano</prgn> during the upgrade.
ja: <prgn>vim</prgn> をデフォルトのエディタとして使用していた場合、アップグレードの過程でデフォルトのエディタが <prgn>nano</prgn> に変更される可能性があります。

source: Administrators that wish to change the default editor for all users will have to update the alternatives system using:
ja: 管理者は、すべてのユーザ向けのデフォルトのエディタを変更したい場合、以下のようにして alternatives システムを更新してください。

source: Users wishing to change the default editor can define the environment variable <em>EDITOR</em> by introducing the following lines in their own profiles:
ja: ユーザは、デフォルトのエディタを変更したい場合、自分のプロファイルに以下のような行を加えて環境変数 <em>EDITOR</em> を設定してください。

source: More information on &debian;
ja: &debian; に関するさらなる情報
nl: Aanvullende informatie over &debian;
pt: Mais informação sobre a &debian;
ru: Более подробная информация о &debian;
sv: Mer information om &debian;
zh_cn: 更多关于 &debian; 的信息

source: Further reading
ja: もっと読みたい
nl: Aanvullende documentatie
pt: Leitura adicional
ru: Что ещё можно прочитать
sv: Ytterligare läsning
zh_cn: 阅读更多信息

source: Beyond these release notes and the installation guide, further documentation on &debian; is available from the Debian Documentation Project (DDP), whose goal is to create high quality documentation for Debian users and developers. Documentation including the Debian Reference, Debian New Maintainers Guide, and Debian FAQ are available, and many more. For full details of the existing resources see the <url id="&url-ddp;" name="DDP website">.
ja: このリリースノートやインストールガイドを越えた、&debian; に関するより進んだ文書は、Debian Documentation Project (DDP) から公開されています。DDP は Debian のユーザや開発者向けに、品質の高い文書を作成することを目的としています。Debian リファレンス、Debian メンテナ入門、Debian FAQ などなど、たくさんの文書があります。現在利用可能なリソースの詳細すべては <url id="&url-ddp;" name="DDP のウェブサイト">から得られます。
pt: Além destas notas de lançamento e do guia de instalação, mais documentação sobre a &debian; está disponível a partir do Debian Documentation Project (DDP), cujo objectivo é criar documentação de alta qualidade para os utilizadores da Debian e 'developers'. Documentação incluindo o guia Debian Reference, guia para novos Debian 'Maintainers', e Debian FAQ e muito mais estão disponíveis. Para detalhes completos sobre estes recursos existentes veja <url id="&url-ddp;" name="DDP website">.
ru: Помимо этой информации о выпуске и руководства по установке, существует документация по &debian;, разрабатываемая проектом Debian Documentaton Project (DDP), целью которого является создание высококачественной документации для пользователей и разработчиков Debian. В состав этой документации входят Руководство по Debian, Руководство нового сопровождающего Debian, FAQ по Debian и многое другое. Полную информацию о доступных документах можно получить на <url id="&url-ddp;" name=" веб-сайте DDP">.
sv: Förutom dessa kommentarer till utgåvan och installationsguiden finns ytterligare dokumentation för &debian; tillgänglig från Debian Documentation Project (DDP), som har som mål att skapa högkvalitativ dokumentation för Debian-användare och utvecklare. Dokumentation som till exempel Debian Reference, Debian New Maintainers Guide, och Debian FAQ finns tillgängliga tillsammans med många andra dokument. För fullständiga detaljer om tillgängliga resurser, se <url id="&url-ddp;" name="webbplatsen för DDP">.
zh_cn: 除了发行注记和安装指南之外，Debian 文件计划 (DDP) 也提供了许多 &debian; 更进一步的说明文件。Debian 文件计划的目标是替 Debian 的用户和开发者创作出高品质的文件，其中包括了 Debian 参考手册、Debian 新维护者指南、以及 Debian 常见问答集，以及其他更多的文件。如果您想了解关于这些资源的完整信息，请参考 <url id="&url-ddp;" name="DDP 网站">。

source: Documentation for individual packages is installed into <file>/usr/share/doc/<var>package</var></file>, this may include copyright information, Debian specific details and any upstream documentation.
ja: それぞれのパッケージの文書は <file>/usr/share/doc/<var>package</var></file> にインストールされています。ここには、著作権情報、Debian 固有の詳細、開発元の文書すべて、などが置かれています。
nl: Documentatie bij individuele pakketten wordt geïnstalleerd in <file>/usr/share/doc/<var>package</var></file>. Deze informatie kan o.a. omvatten: informatie over auteursrechten, Debian specifieke details en, indien aanwezig, documentatie van de auteurs.
pt: A documentação para pacotes individuais está instalada em <file>/usr/share/doc/<var>package</var></file>, pode conter informação sobre direitos de autor, detalhes específicos da Debian e qualquer documentação 'upstream'.
ru: Документация по конкретным пакетам устанавливается в каталог <file>/usr/share/doc/<var>пакет</var></file>. Там может находиться информация об авторских правах, специфичная для Debian информация и документация от авторов исходной программы.
sv: Dokumentation för individuella paket installeras i <file>/usr/share/doc/<var>paket</var></file>, den kan inkludera information om copyright, Debian-specifika detaljer och dokumentation från upphovsmännen.
zh_cn: 个别软件包的说明文件则会被安装到 <file>/usr/share/doc/<var>package</var></file> 目录之中，其中可能会包含了版权信息，专属于 Debian 的一些信息，以及任何原作者所提供的说明文件。

source: Getting help
ja: 助けを求めるには
nl: Ondersteuning verkrijgen
pt: Procurar ajuda
ru: Если нужна помощь
sv: Få hjälp
zh_cn: 获得帮助

source: There are many sources of help, advice and support for Debian users, but these should only be considered if research into documentation of the issue has exhausted all sources. This section provides a short introduction into these which may be helpful for new Debian users.
ja: Debian ユーザ向けのヘルプ・アドバイス・サポートなどは、いろいろな場所から得られます。しかしこれらを頼りにするのは、その問題について徹底的に文書を調査してからにしましょう。このセクションでは新しく Debian ユーザになった人向けに、これらを簡単に紹介します。
nl: Er zijn vele bronnen voor hulp, advies en ondersteuning voor gebruikers van Debian. Deze dienen echter pas te worden benut als zelfstandig onderzoek in documentatie over het onderwerp niets heeft opgeleverd. Deze sectie geeft een korte introductie van bronnen die van nut kunnen zijn voor nieuwe Debian gebruikers.
pt: Existem muitas fontes de ajuda, conselhos e suporte para os utilizadores de Debian, mas estas devem ser apenas consideradas se a investigação na documentação sobre determinado assunto tiver sido esgotada em todas as fontes. Esta secção fornece uma curta introdução sobre estas fontes que podem ser muito úteis para novos utilizadores Debian.
ru: Пользователи Debian могут воспользоваться помощью, советами и поддержкой из нескольких источников, но к ним следует прибегать только не удалось найти ответа на вопрос в документации. Этот раздел содержит краткое описание дополнительных источников помощи для новых пользователей.
sv: Det finns många källor för hjälp, råd och stöd för Debian-användare, men dessa bör endast användas om dokumentationen inte har hjälpt till att lösa problemet. Det här avsnittet tillhandahåller en kort introduktion till dessa, vilka kan vara till hjälp för nya Debian-användare.
zh_cn: Debian 的用户可以从许多的管道取得协助、建议、和支持，但您应该只有在用尽了各种手段却依然找不到问题的解答时才考虑寻求协助。这一节简单的介绍了对 Debian 的新用户可能会很有帮助的求助管道。

source: Mailing lists
ja: メーリングリスト
nl: Mailinglijsten
pt: Listas de mail
ru: Списки рассылки
sv: Sändlistor
zh_cn: 邮件列表

source: The mailing lists of most interest to Debian users are the debian-user list (English) and other debian-user-<var>language</var> lists (for other languages). For information on these lists and details of how to subscribe see <url id="&url-debian-list-archives;">. Please check the archives for answers to your question prior to posting and also adhere to standard list etiquette.
ja: Debian ユーザが最も興味を引かれるであろうメーリングリストは debian-user (英語) リストおよび debian-user-<var>language</var> (各国語) リストでしょう。これらのリストの詳細や講読のしかたについては、<url id="&url-debian-list-archives;"> を見てください。利用にあたっては、あなたの疑問に対する答えが以前の投稿ですでに答えられていないかどうか、アーカイブをチェックしてください。また標準的なメーリングリストのエチケットに従うようにしてください。
nl: De mailinglijsten die het meest interessant zijn voor gebruikers van Debian zijn debian-user (Engelstalig) en andere debian-user-<var>taal</var> mailinglijsten (in andere tabel). Informatie over deze mailinglijsten en details over het aanmelden daarvoor vindt u op <url id="&url-debian-list-archives;">. Zoek a.u.b. eerst in de archieven van de mailinglijsten naar een antwoord op uw vraag voordat u uw vraag stelt en volg ook de standaard etiquette voor mailinglijsten.
pt: As listas de mail mais interessantes para os utilizadores Debian são a debian-user list (em Inglês) e outras listas debian-user-<var>idioma</var> (para outros idiomas). Para mais informação sobre estas listas e detalhes sobre como as subscrever veja <url id="&url-debian-list-archives;">. Por favor verifique os arquivos antes de colocar uma questão e adira á etiqueta da lista.
ru: Основной интерес для пользователей Debian представляют англоязычный список рассылки debian-user и списки debian-user-<var>язык</var> или debian-<var>язык</var> для других языков. Для русского языка это список debian-russian. Информацию о списках рассылки и о том, как на них подписаться см. по адресу <url id="&url-debian-list-archives;">. Пожалуйста, перед тем, как отправить вопрос в список рассылки, поищите ответ на него в архивах. Просим также придерживаться общепринятых норм почтового этикета.
sv: De sändlistor som är mest intressanta för Debian-användarna är listan debian-user (Engelsk) och andra debian-user-<var>språkkod</var>-listor (för andra språk). För information om dessa listor och detaljer om hur man prenumererar, se <url id="&url-debian-list-archives;">. Leta i arkiven efter svar på dina frågor innan du postar en ny fråga och därmed följer listetiketten.
zh_cn: Debian 的用户最感兴趣的邮件列表应该是 debian-user 论坛（英文）以及其他的 debian-user-<var>language</var> 列表（其他语言）了。您可以在 <url id="&url-debian-list-archives;"> 取得这些列表的相关细节，以及订阅的方法。请您在列表中发言前先检查过去的列表存档中是否已经提供了问题的解答，并请遵守邮件列表上的基本礼节。

source: Internet Relay Chat
ja: インターネットリレーチャット (IRC)
nl: Internet Relay Chat (IRC)
pt: Internet Relay Chat (IRC)
ru: IRC
zh_cn: IRC(Internet Relay Chat) 网络聊天室

source: Debian has an IRC channel dedicated to the support and aid of Debian users located on the OFTC IRC network which exists to provide interactive services to peer-directed project communities. To access the channel, point your favourite IRC client at &debian-irc-server; and join #debian.
ja: Debian はサポート用の IRC チャンネルを Debian ユーザの協力によって運営しています。このチャンネルは OFTC IRC ネットワークにあります。このネットワークは、オープンソースコミュニティで資源共有や協力を進めるため、情報交換に使われているものです。このチャンネルにアクセスするには、お好みの IRC クライアントを &debian-irc-server; に接続し、#debian に join してください。
pt: A Debian possui um canal IRC dedicado ao suporte e ajuda de utilizadores Debian localizado na rede IRC OFTC, existindo para fornecer serviços interactivos a comunidades com projectos 'peer-directed'. Para aceder ao canal aponte o seu cliente IRC favorito em &debian-irc-server; e entre em #debian.
ru: У Debian есть IRC-канал, предназначенный для поддержки пользователей Debian. Он расположен в сети OFTC IRC, предоставляющей интерактивные сервисы сообществам по интересам. Чтобы войти на канал, соединитесь с сервером &debian-irc-server; с помощью своего любимого IRC-клиента и присоединитесь к каналу #debian. Для русскоязычных пользователей существует канал #debian-russian в той же сети.
sv: Debian har en IRC-kanal som är dedicerad till att ge stöd och hjälp till Debian-användare. Kanalen finns på IRC-nätverket OFTC och finns där för att tillhandahålla interaktiva tjänster till punktdrivna projektgemenskaper. För att komma åt kanalen, peka din favorit-IRC-klient till &debian-irc-server; och gå in i kanalen #debian.se.
zh_cn: OFTC IRC 网络主要的目的就是向同仁导向的专案社群提供互动式的服务。在那里 Debian 有一个 IRC 频道是专门用来支持并帮助 Debian 的用户的。您只要把您惯用的 IRC 客户端程序指向 &opn-irc-server; 并加入 #debian 就可以连上这个频道了。

source: Please follow the channel guidelines, respecting other users fully. For more information on OFTC please visit the <url id="&url-irc-host;" name="website">.
ja: チャンネルのガイドラインに従い、他のユーザを大切にしてください。OFTC に関する詳細は<url id="&url-irc-host;" name="ウェブサイト">を訪ねてみてください。
pt: Por favor siga as linhas de conduta do canal, respeitando os outros utilizadores. Para mais informação sobre a OFTC visite <url id="&url-irc-host;"name="website">.
ru: Просим вас следовать правилам поведения на канале и уважать других пользователей. Более подробную информацию об OFTC можно получить на <url id="&url-irc-host;" name="её веб-сайте">.
sv: Följ kanalens riktlinjer, respektera andra användare. För mer information om OFTC, besök dess <url id="&url-irc-host;" name="webbplats">.
zh_cn: 请遵循该频道的规定，并尊重在线的其他的用户。您可以在 <url id="&url-irc-host;" name="website"> 上取得更多 OFTC 的相关信息。

source: Reporting bugs
ja: バグを報告する
nl: Problemen rapporteren
pt: Reportar erros
ru: Как сообщить об ошибке
sv: Rapportera fel
zh_cn: 回报错误

source: We strive to make Debian GNU/Linux a high quality operating system, however that does not mean that the packages we provide are totally free of bugs. Consistent with Debian's "open development" philosophy and as a service to our users, we provide all the information on reported bugs at our own Bug Tracking System (BTS). The BTS is browseable at <url id="&url-bts;" name="bugs.debian.org">.
ja: 私たちは Debian GNU/Linux を高品質な OS にするよう努めていますが、だからといって私たちの提供するパッケージにバグが皆無というわけにはいきません。Debian の「オープンな開発体制」という考え方に合致し、また、ユーザに対するサービスとして、私たちは報告されたバグに関するすべての情報を <url id="&url-bts;" name="bugs.debian.org"> にあるバグ追跡システム (Bug Tracking System: BTS) で提供しています。
nl: Wij streven ernaar om van Debian GNU/Linux een besturingssysteem van hoge kwaliteit te maken. Dit betekent echter niet dat de pakketten die wij leveren volledig foutvrij zijn. In overeenstemming met de 'open ontwikkeling' filosofie van Debian en als dienst aan onze gebruikers, bieden wij volledig inzicht in problemen die gemeld zijn in ons eigen Bug Tracking System (BTS). Het BTS kan worden geraadpleegd op <url id="&url-bts;" name="bugs.debian.org">.
pt: Ansiamos por fazer da Debian GNU/Linux um sistema operativo de alta qualidade, no entanto isto não significa que os pacotes que fornecemos sejam totalmente livres de erros. Em consistência com a filosofia da Debian de "desenvolvimento livre" e como um serviço para os nossos utilizadores, fornecemos toda a documentação sobre relatórios de erros no nosso Bug Tracking System (BTS). A BTS é pesquisável em <url id="&url-bts;" name="bugs.debian.org">.
ru: Мы приложили немало усилий, чтобы сделать Debian GNU/Linux операционной системой высокого качества, однако это не означает, что поставляемые нами пакеты не содержат абсолютно никаких ошибок. Мы предоставляем нашим пользователям полную информацию обо всех обнаруженных ошибках в нашей Системе отслеживания ошибок (Bug Tracking System, BTS), расположенной по адресу <url id="&url-bts;" name="bugs.debian.org">. Такой подход согласуется с концепцией открытой разработки Debian.
sv: Vi strävar mot att göra Debian GNU/Linux till ett högkvalitativt operativsystem, det betyder dock inte att paketen som vi tillhandahåller är helt fria från fel. I enlighet med Debians filosofi om "öppen utveckling" och som en tjänst till våra användare, tillhandahåller vi all information om rapporterade fel på vårat eget felhanteringssystem (BTS). BTS är bläddringsbar på <url id="&url-bts;" name="bugs.debian.org">.
zh_cn: 我们尽心尽力地让 Debian GNU/Linux 成为一个高品质的操作系统，但这并不表示我们所提供的软件包都是完全没有任何问题的。为了和 Debian 一贯的开放发展原则相互呼应，也为了能对我们的用户提供更好的服务，我们在我们自己的错误跟踪系统 (BTS) 中提供了对所有报告过的错误的所有信息。您可以在 <url id="&url-bts;" name="bugs.debian.org"> 浏览错误跟踪系统的网站。

source: If you find a bug in the distribution or in packaged software that is part of it, please report it so that it can be properly fixed for next releases. Reporting bugs requires a valid email address, we ask for this so that we can trace bugs and developers can get in contact with submitters should they need more information.
ja: もしディストリビューションや、その一部であるパッケージされたソフトウェアにバグを見つけたら、次のリリースで修正できるよう、その問題点の報告をお願いします。バグを報告するには正しい電子メールアドレスが必要です。これをお願いしているのは、バグを追跡したり、開発者がより詳しい情報を必要とした場合に、報告者に連絡できるようにするためです。
nl: Wij verzoeken u om eventuele problemen die u tegenkomt in de distributie of de programmatuur in de pakketten die daar onderdeel van uitmaken, te rapporteren zodat deze verholpen kunnen worden voor een volgende release. Voor het rapporteren van een probleem is een geldig e-mailadres vereist. We vragen dit zodat we problemen kunnen volgen en zodat pakketbeheerders contact kunnen opnemen met de indiener van een probleem als ze aanvullende informatie nodig hebben.
pt: Se alguém encontrar um erro na distribuição ou num software empacotado que seja parte dela, por favor relate-o para que possa ser correctamente corrigido em futuras versões. O relatório de erros requer um endereço de email válido, assim o pedimos para que possa seguir o erro e os 'developers' possam entrar em contacto com os que o submetem, caso necessitem de mais informações.
ru: Если вы обнаружите ошибку в дистрибутиве или каком-то из его пакетов, пожалуйста, сообщите о ней, чтобы в следующем выпуске она была исправлена. Чтобы сообщить об ошибке, требуется работающий адрес электронной почты. Это необходимо для того, чтобы мы могли отслеживать ошибки, а разработчики - связываться с отправителями отчётов об ошибках, если им понадобится дополнительная информация.
sv: Om du hittar ett fel i distributionen eller i paketerad programvara som är en del av den, vänligen rapportera felet så att det kan rättas till inför nästa utgåva. För att rapportera fel krävs en giltig e-postadress, vi frågar efter den så att vi kan spåra fel och utvecklarna kan kunna komma i kontakt med insändarna om de skulle behöva mer information.
zh_cn: 如果您在我们的系统发行或其中的软件包中发现了任何问题，请向我们回报，这样我们才能在下一次发行前将它修复。您需要拥有一个正确的电子邮件信箱才能够回报问题，会有这个限制是因为这样我们才能藉此跟踪错误报告的进展，而当开发人员需要更多信息的时候也才能和原问题报告者取得连系。
