Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: Any package needed for installation that is fetched from the network is stored in <file>/var/cache/apt/archives</file> (and the <file>partial/</file> subdirectory, during download), so you must make sure you have enough space before attempting to start the installation. With a reasonably extended Debian installation, you can expect at least 300 MB of downloaded data.
ja: インストールに必要なパッケージのうち、ネットワークから取得されたものは、<file>/var/cache/apt/archives</file> ディレクトリ (およびダウンロード中のものは <file>partial/</file> サブディレクトリ) に置かれます。したがって、インストールを行う前には、十分な領域があるかどうか確認しなければなりません。割に大きめのインストールを行う場合には、ダウンロードデータとして少なくとも 300MB 程度を考慮しておきましょう。
nl: Elk pakket dat nodig is voor de installatie en wordt opgehaald vanaf het netwerk, wordt opgeslagen in <file>/var/cache/apt/archives</file> (en tijdens het ophalen in de submap <file>partial/</file>). U dient zorg te dragen dat u voldoende vrije ruimte heeft voordat u de installatie start. Voor een redelijk uitgebreide Debian installatie, dient u rekening te houden met tenminste 300MB aan op te halen pakketten.
pt: Qualquer pacote necessário para a instalação que tenha sido obtido pela rede é armazenado em <file>/var/cache/apt/archives</file> (e no directório <file>partial/</file> durante o download), deverá assim certificar-se que possui espaço suficiente antes de iniciar a instalação. Com uma instalação Debian razoavelmente estendida pode esperar um download de cerca de 300 MB.
ru: Все пакеты, требуемые для установки, после загрузки из сети размещаются в каталоге <file>/var/cache/apt/archives</file> (во время загрузки -- в подкаталоге <file>partial/</file>), поэтому перед началом установки вы должны убедиться в том, что там достаточно места. Для обычной установки понадобится приблизительно 300МБ дискового пространства.
sv: De paket som är nödvändiga för installation hämtas från nätverket och lagras i <file>/var/cache/apt/archives</file> (och underkatalogen <file>partial/</file>, under hämtning), så du måste se till att du har tillräckligt med ledigt utrymme innan du försöker påbörja installationen. Med en rimligt utökad installation av Debian, kan du förvänta dig att hämta ner åtminstone 300 MB data.
zh_cn: 所有由网络上下载来的安装所需软件包都会被存放在 <file>/var/cache/apt/archives</file> 目录中（而下载中的档案则会被存在 <file>partial/</file> 子目录中），所以在尝试开始安装前请确认您是否有足够的硬盘空间。对一个装有大量软件包的 Debian 系统来说，下载的资料量应该会超过 300 MB。

source: Adding APT sources for a local mirror
ja: APT のローカルミラーソースの追加
nl: Locale spiegelservers toevoegen als bron voor APT
pt: Acrescentar fontes APT para um 'mirror' local
ru: Как добавить локальное зеркало APT
sv: Lägg till APT-källor för en lokal spegelserver
zh_cn: 增加 APT 的本机镜像软件包来源

source: Instead of using HTTP or FTP packages mirrors, you may wish to modify <file>/etc/apt/sources.list</file> to use a mirror on a local disk (possibly mounted over NFS).
ja: HTTP や FTP のパッケージミラーを使うのではなく、ローカルディスク (多分 NFS マウントされたもの) にあるミラーを使うよう、<file>/etc/apt/sources.list</file> を変更したいこともあるかもしれません。
nl: In plaats van gebruik te maken van een HTTP- of FTP-spiegelserver, is het ook mogelijk om <file>/etc/apt/sources.list</file> zodanig te wijzigen dat gebruik wordt gemaakt van een Debian archief op een lokale harde schijf (mogelijk aangekoppeld als NFS).
pt: Em vez de usar os 'mirrors' HTTP ou FTP de pacotes, pode desejar modificar o <file>/etc/apt/sources.list</file> de modo a usar um mirror num disco local (possivelmente montado sobre NFS).
ru: Вместо HTTP- и FTP-зеркал, можно использовать зеркало на локальном диске (возможно, смонтированном по сети), изменив соответствующим образом файл <file>/etc/apt/sources.list</file>.
sv: Istället för att använda HTTP- eller FTP-paketspeglar, kanske du önskar ändra <file>/etc/apt/sources.list</file> till att använda en spegel på en lokal hårddisk (möjligen monterad över NFS).
zh_cn: 您可能也会想修改 <file>/etc/apt/sources.list</file> 中的设置，以使用本机（像是透过 NFS 挂载的）硬盘上的镜像资料来取代透过 HTTP 或 FTP 访问远程的软件包镜像站。

source: For example, your packages mirror may be under <file>/var/ftp/debian/</file>, and have main directories like this:
ja: 例えばパッケージのミラーが <file>/var/ftp/debian/</file> にあり、main などのディレクトリが次のように配置されているとします。
pt: Por exemplo, o seu 'mirror' de pacotes poderá estar sob <file>/var/ftp/debian/</file> e pode ter directórios principais como estes:
ru: Например, если ваше зеркало пакетов находится в каталоге <file>/var/ftp/debian/</file>, то его основные каталоги будут называться:
sv: Till exempel, din paketspegel kan finnas under <file>/var/ftp/debian/</file>, och innehålla huvudkataloger som dessa:
zh_cn: 举例来说，如果您的软件包镜像是放在 <file>/var/ftp/debian/</file> 之下，而主要的目录看起来是像这样的话：

source: To use this with <prgn>apt</prgn>, add this line to your <file>sources.list</file> file:
ja: これを <prgn>apt</prgn> から使うには、次の行を <file>sources.list</file> ファイルに追加します。
pt: Para usar com o <prgn>apt</prgn>, acrescente esta linha ao seu ficheiro <file>sources.list</file>:
ru: Чтобы программа <prgn>apt</prgn> могла использовать этот источник пакетов, добавьте в файл <file>sources.list</file>:
sv: Lägg till den här raden till din <file>sources.list</file> för att använda den här med <prgn>apt</prgn>:
zh_cn: 如果要和 <prgn>apt</prgn> 搭配使用，请把下行加入 <file>sources.list</file> 文件之中：

source: Adding APT source from CD-ROM or DVD
ja: APT の CD-ROM/DVD ソースの追加
nl: CD's of DVD's toevoegen als bron voor APT
pt: Acrescentar uma fonte APT de CD-ROM ou DVD
ru: Как добавить источник APT на компакт-диске или DVD
sv: Lägg till APT-källa från cd-rom eller dvd
zh_cn: 增加 APT 的 CD-ROM 或 DVD 的软件包来源

source: If you want to use CDs <em>only</em>, comment out the existing "<tt>deb</tt>" lines in <file>/etc/apt/sources.list</file> by placing a hash sign (<tt>#</tt>) in front of them.
ja: CD <em>だけ</em>でインストールをしたい場合は、<file>/etc/apt/sources.list</file> 中の "<tt>deb</tt>" 行の先頭にシャープ記号 (<tt>#</tt>) を置き、それらを無効にしてください。
nl: Als u <em>alleen</em> CD's wilt gebruiken, invalideer dan de bestaande "<tt>deb</tt>"-regels in <file>/etc/apt/sources.list</file> door er een hekje (<tt>#</tt>) voor te plaatsen.
pt: Se quiser utilizar CDs tem <em>apenas</em> que comentar as linhas "<tt>deb</tt>" existentes em <file>/etc/apt/sources.list</file> colocando um cardinal (<tt>#</tt>) em frente das mesmas.
ru: Если вы хотите использовать <em>только</em> компакт-диски, закомментируйте все присутствующие в файле <file>/etc/apt/sources.list</file> строки <tt>deb</tt>, поставив в начале каждой строки знак диеза (<tt>#</tt>).
sv: Om du <em>endast</em> vill använda cd-skivor, kommentera ut de befintliga "<tt>deb</tt>"-raderna i <file>/etc/apt/sources.list</file> genom att placera ett hash-tecken (<tt>#</tt>) framför dem.
zh_cn: 如果光盘是<em>唯一</em>您想使用的源，请在 <file>/etc/apt/sources.list</file> 中原有的 "<tt>deb</tt>" 设置行前加入井字符号 (<tt>#</tt>) 以关闭这些软件包来源。

source: Make sure there is a line in <file>/etc/fstab</file> that enables mounting your CD-ROM drive at the <file>/cdrom</file> mount point (the exact <file>/cdrom</file> mount point is required for <prgn>apt-cdrom</prgn>). For example, if <file>/dev/hdc</file> is your CD-ROM drive, <file>/etc/fstab</file> should contain a line like:
ja: CD-ROM ドライブをマウントポイント <file>/cdrom</file> にマウントすることを許可している行が <file>/etc/fstab</file> にあるかどうかを確認してください (<prgn>apt-cdrom</prgn> を使う場合は、マウントポイントを <file>/cdrom</file> 以外にはできません)。例えば <file>/dev/hdc</file> が CD-ROM ドライブなら、<file>/etc/fstab</file> には次のような行が必要です。
pt: Certifique-se que existe uma linha em <file>/etc/fstab</file> que permita a montagem da sua drive CD-ROM no ponto de montagem <file>/cdrom</file> (o ponto de montagem exacto <file>/cdrom</file> é necessário para o <prgn>apt-cdrom</prgn>). Por exemplo, se <file>/dev/hdc</file> for a sua drive CD-ROM, o <file>/etc/fstab</file> deverá conter uma linha como esta:
ru: Убедитесь в том, что в файле <file>/etc/fstab</file> есть строка, позволяющая смонтировать компакт-диск в каталог <file>/cdrom</file> (программа <prgn>apt-cdrom</prgn> требует монтирования именно в этом каталоге). Например, если файлом устройства вашего привода чтения компакт-дисков служит <file>/dev/hdc</file>, то файл <file>/etc/fstab</file> должен содержать строку:
sv: Se till att det finns en rad i <file>/etc/fstab</file> som aktiverar montering av din cd-rom-enhet på monteringspunkten <file>/cdrom</file> (den exakta monteringspunkten <file>/cdrom</file> krävs för <prgn>apt-cdrom</prgn>). Till exempel, om <file>/dev/hdc</file> är din cd-rom-enhet, ska <file>/etc/fstab</file> innehålla en rad som denna:
zh_cn: 请确定在 <file>/etc/fstab</file> 中有着能让您的光盘机挂载在 <file>/cdrom</file> 这个挂载点下的项目（<prgn>apt-cdrom</prgn> 限定挂载点必须是 <file>/cdrom</file>）。举例来说，如果您的光盘机的设备是 <file>/dev/hdc</file>，那么 <file>/etc/fstab</file> 中就应该要有像这样的一行：

source: Note that there must be <em>no spaces</em> between the words <tt>defaults,noauto,ro</tt> in the fourth field.
ja: 第 4 フィールドの <tt>defaults,noauto,ro</tt> の間にはスペースがあってはいけません。
nl: Merk op dat in het vierde veld <em>geen spaties</em> mogen staan tussen de woorden <tt>defaults,noauto,ro</tt>.
pt: Note que entre as palavras <tt>defaults,noauto,ro</tt> encontradas no quarto campo <em>não</em> deverão existir <em>espaços</em>.
ru: Обратите внимание на то, что между словами <tt>defaults,noauto,ro</tt> в четвёртом поле строки <em>не должно быть пробелов</em>.
sv: Observera att det <em>inte får finnas några blanksteg</em> mellan orden <tt>defaults,noauto,ro</tt> i det fjärde fältet.
zh_cn: 请注意在第四栏的 <tt>defaults,noauto,ro</tt> 的字中间一定<em>不能参杂空白字符</em>。

source: To verify it works, insert a CD and try running
ja: これが正しく機能しているか調べるには、CD を挿入して以下を実行してみてください。
pt: Para verificar que tal funciona, insira um CD e tente correr
ru: Чтобы проверить, что строка fstab написана верно, вставьте компакт-диск в привод и выполните команды
sv: För att verifiera att det fungerar, mata in en cd och försök köra
zh_cn: 要确认您的设置是否正确，请放入一张光盘，并试着执行

source: # mount /cdrom # this will mount the CD to the mount point # ls -alF /cdrom # this should show the CD's root directory # umount /cdrom # this will unmount the CD
ja: # mount /cdrom # マウントポイントに CD をマウントします # ls -alF /cdrom # CD のルートディレクトリを表示します # umount /cdrom # CD をアンマウントします
pt: # mount /cdrom # montará o CD no ponto de montagem # ls -alF /cdrom # mostrará o directório root do CD # umount /cdrom # desmontará o CD
sv: # mount /cdrom # det här monterar cd-skivan på monteringspunkten # ls -alF /cdrom # det här ska visa cd-skivans rotkatalog # umount /cdrom # det här kommer att avmontera cd-skivan
zh_cn: # mount /cdrom # 这样将会将这张 CD 挂载在该挂载点上 # ls -alF /cdrom # 这样将会列出 CD 的根目录 # umount /cdrom # 这样将会卸载这张 CD

source: Next, run:
ja: 問題がなければ
pt: A seguir, corra:
ru: Затем запустите:
sv: Kör sedan:
zh_cn: 接下来对每一张 Debian 的程序光盘执行

source: for each Debian Binary CD-ROM you have, to add the data about each CD to APT's database.
ja: を、Debian Binary CD-ROM それぞれに対して実行してください。各 CD に関するデータが APT のデータベースに追加されます。
pt: para cada CD-ROM de Binários Debian que possua, para adicionar informação de cada CD à base de dados APT.
ru: для каждого компакт-диска Debian Binary, чтобы добавить все диски в базу данных APT.
sv: för varje Debian Binary cd-rom som du har, för att lägga till data om varje cd till APT:s databas.
zh_cn: 来把每一张光盘的资料加到 APT 的数据库中。

source: Upgrading packages
ja: パッケージのアップグレード
nl: Pakketten opwaarderen
pt: Actualizar pacotes
ru: Обновление пакетов
sv: Uppgradera paket
zh_cn: 进行软件包的升级

source: The recommended way to upgrade from previous &debian; releases is to use the package management tool <prgn>aptitude</prgn>. This program makes safer decisions about package installations than running <prgn>apt-get</prgn> directly.
ja: 以前の &debian; からのアップグレード方法のお勧めは、パッケージ管理ツール <prgn>aptitude</prgn> を用いる方法です。このプログラムはパッケージに関する判断を <prgn>apt-get</prgn> よりも安全に行います。
pt: A forma recomendada para actualizar pacotes de lançamentos anteriores &debian; é o gestor de pacotes <prgn>aptitude</prgn>. Este programa produz decisões mais seguras sobre as instalações de pacotes do que correr o <prgn>apt-get</prgn> directamente.
ru: Для обновления &debian; до нового выпуска рекомендуется использовать программу управления пакетами <prgn>aptitude</prgn>. Этот инструмент принимает более безопасные решения об установке пакетов, чем при непосредственном запуске <prgn>apt-get</prgn>.
sv: Det rekommenderade sättet att uppgradera mellan utgåvor av &debian; är att använda pakethanteringsverktyget <prgn>aptitude</prgn>. Det här programmet gör säkrare val angående paketinstallationer än att köra <prgn>apt-get</prgn> direkt.
zh_cn: 若要从旧有的 &debian; 发行软件包进行升级时，建议的方法是使用软件包管理工具 <prgn>aptitude</prgn>。这个程序在软件包安装上会比起直接执行 <prgn>apt-get</prgn> 来得安全。

source: Don't forget to mount all needed partitions (notably the root and <file>/usr</file> partitions) read-write, with a command like:
ja: まず、必要なパーティションが read-write モードでマウントされていることを忘れずに確認しましょう (特にルートと <file>/usr</file> の各パーティション)。以下のようなコマンドラインが使えます。
pt: Não se esqueça de montar todas as partições necessárias (nomeadamente a partição root e <file>/usr</file>) em modo de leitura-escrita, com um comando como:
ru: Не забудьте смонтировать все необходимые разделы (в первую очередь, корневой раздел и каталог <file>/usr</file>) для чтения и записи. Это можно сделать командой
sv: Glöm inte att montera alla nödvändiga partitioner (speciellt rot- och <file>/usr</file>-partitionerna) läs- och skrivbara, med ett kommando som det här:
zh_cn: 不要忘了用类似以下的口令把所有会用到的分区（特别是 <file>/usr</file> 和 root 分区）重新以可读写的模式挂载：

source: Next you should double check that the APT source entries (in <file>/etc/apt/sources.list</file>) refer either to "<tt>&releasename;</tt>" or to "<tt>stable</tt>". Note: source lines for a CD-ROM will often refer to "<tt>unstable</tt>"; although this may be confusing, you should <em>not</em> change it.
ja: 次に、(<file>/etc/apt/sources.list</file> 内の) APT ソース記述が "<tt>&releasename;</tt>" か "<tt>stable</tt>" のいずれかを指定していることを念入りにチェックすべきです。注意: CD-ROM のソース行は "<tt>unstable</tt>"; を指定していることがよくあります。これは混乱の元ですが、変更しては<em>いけません</em>。
nl: Controleer nu nogmaals dat de bronregels voor APT (in <file>/etc/apt/sources.list</file>) ofwel naar <tt>&releasename;</tt>" of naar "<tt>stable</tt>" verwijzen. Let op: bronregels voor CD's verwijzen vaak naar "<tt>unstable</tt>"; hoewel dit verwarrend kan zijn, mag u deze <em>niet</em> wijzigen.
pt: De seguida deverá confirmar que as entradas das fontes do APT (em <file>/etc/apt/sources.list</file>), se referem ou a "<tt>&releasename;</tt>" ou a "<tt>stable</tt>". Note: as linhas das fontes para um CD-ROM normalmente irão referir-se a "<tt>unstable</tt>"; apesar de este facto ser confuso <em>não</em> o deverá alterar.
ru: Затем надо проверить и перепроверить, что источники APT в файле <file>/etc/apt/sources.list</file> ссылаются либо на "<tt>&releasename;</tt>", либо на "<tt>stable</tt>". Обратите внимание, источники на CD-ROM могут ссылаться на дистрибутив "<tt>unstable</tt>", хоть это и странно, но исправлять их <em>не нужно</em>.
sv: Härnäst ska du dubbelkontrollera att källposterna för APT (i <file>/etc/apt/sources.list</file>) refererar antingen till "<tt>&releasename;</tt>" eller till "<tt>stable</tt>". Observera: källrader för en cd-rom kommer ofta referera till "<tt>unstable</tt>"; även om det här är konstigt ska du <em>inte</em> ändra dem.
zh_cn: 接下来，您必须再次确认在 <file>/etc/apt/sources.list</file> 中的 APT 来源项目是指向 "<tt>&releasename;</tt>" 或是 <tt>'stable'</tt>。请注意，CD-ROM 的来源项目通常会指向 "<tt>unstable</tt>"，虽然您可能会觉得这有点奇怪，但您<em>不</em>应该去加以更动。

source: Recording the session
ja: セッションの記録

source: It is strongly recommended that you use the <prgn>/usr/bin/script</prgn> program to record a transcript of the upgrade session. Then if a problem occurs, you will have a log of what happened, and if needed, can provide exact information in a bug report. To start the recording, type:
ja: ここで強くお勧めしたいのですが、<prgn>/usr/bin/script</prgn> プログラムを使って、このアップグレード作業の記録を取るようにしましょう。こうすれば何らかの問題が生じたときに、何が起こったかを記録しておくことができ、バグ報告の必要が生じた場合に、その正確な情報を提供できます。記録を開始するには次のように入力します。
pt: É-lhe fortemente recomendado que utilize o programa <prgn>/usr/bin/script</prgn> para gravar uma transcrição da sessão de actualização. Assim caso ocorra qualquer problema, terá o relatório sobre o que aconteceu, e se necessário poderá fornecer informação exacta sob a forma de um relatório de erro. Para iniciar a gravação, escreva:
ru: Настоятельно рекомендуем использовать программу <prgn>/usr/bin/script</prgn> для записи ваших действий при обновлении. В этом случае, при возникновении каких-либо проблем у вас будет журнал произошедших событий, и если понадобится, вы сможете включить эту информацию в отчёт об ошибке. Чтобы начать запись, выполните команду
sv: Det rekommenderas starkt att du använder programmet <prgn>/usr/bin/script</prgn> för att spela in en utskrift av uppgraderingssessionen. Om problem uppstår har du en logg på vad som hände och, om det behövs, kan tillhandahålla exakt information i en felrapport. För att påbörja inspelningen, kör:
zh_cn: 我们强烈建议您使用 <prgn>/usr/bin/script</prgn> 这个程序来记录升级的完整过程。因为一旦发生了任何问题，您手上就会有发生了什么问题的确实记录，而在必要之时，在错误报告中也能据此提供确实的信息。若要开始进行记录，请使用

source: or similar. Do not put the typescript file in a temporary directory such as <file>/tmp</file> or <file>/var/tmp</file> (files in those directories may be deleted during the upgrade or during any restart).
ja: typescript ファイルは <file>/tmp</file> や <file>/var/tmp</file> のような一時ディレクトリには置かないでください (これらのディレクトリのファイルはアップグレードや再起動の際に削除されることがありますから)。
pt: ou qualquer coisa similar. Não coloque o ficheiro transcrito num directório temporário como <file>/tmp</file> ou <file>/var/tmp</file> (os ficheiros nesses directórios são apagados durante a actualização ou durante uma reinicialização).
ru: или похожую. Не размещайте файл с записью во временных каталогах, таких как <file>/tmp</file> и <file>/var/tmp</file>(файлы в этих каталогах могут быть удалены при обновлении или перезагрузке).
sv: eller liknande. Lägg inte typescript-filen i en temporär katalog såsom <file>/tmp</file> eller <file>/var/tmp</file> (filer i dessa kataloger kan tas bort under uppgraderingen eller under en omstart).
zh_cn: 或类似的指令。请不要把记录文件放在像是 <file>/tmp</file> 或 <file>/var/tmp</file> 之类的暂存目录下（这些目录中的文件可能会在升级的过程中或在重新开机时被清除掉）。

source: The typescript will also allow you to review information that has scrolled off-screen. Just switch to VT2 (using <tt>Alt-F2</tt>) and, after logging in, use <tt>less -R ~root/upgrade-&releasename;.script</tt> to view the file.
ja: typescript はまた、スクロールしてスクリーンから消えた情報を見ることができるようにもしてくれるでしょう。(<tt>Alt-F2</tt> を使って) 2 番の仮想コンソールに切り替えて、ログインしてから <tt>less -R ~root/upgrade-&releasename;.script</tt> と実行すれば当該ファイルを見ることができます。

source: After you have completed the upgrade, you can stop <prgn>script</prgn> by typing <tt>exit</tt> at the prompt.
ja: アップグレード完了後に <prgn>script</prgn> を停止するには、プロンプトから <tt>exit</tt> と入力してください。
pt: Depois de ter completado a actualização, pode parar o <prgn>script</prgn> escrevendo <tt>exit</tt>na consola.
ru: После завершения обновления, можно остановить <prgn>script</prgn> набрав <tt>exit</tt> в командной строке.
sv: Efter att du har färdigställt uppgraderingen, kan du stoppa <prgn>script</prgn> genom att ange <tt>exit</tt> vid prompten.
zh_cn: 在您完成升级操作后，您可以借由在命令行上输入 <tt>exit</tt> 来关闭 <prgn>script</prgn>。

source: If you have used the <em>-t</em> switch for <prgn>script</prgn> you can use the <prgn>scriptreplay</prgn> program to replay the whole session:
ja: <prgn>script</prgn> に <em>-t</em> スイッチをつけておくと、以下のようなコマンドで <prgn>scriptreplay</prgn> プログラムがすべてのセッションをリプレイするようになります。
zh_cn: 如果您在 <prgn>script</prgn> 上使用了 <em>-t</em> 参数，您可以利用 <prgn>scriptreplay</prgn> 程序来重新播放整个过程：

source: Updating the package list
ja: パッケージリストの更新
nl: De pakkettendatabase bijwerken
pt: Actualizar a lista de pacotes
ru: Обновление списка пакетов
sv: Uppgradera paketlistan
zh_cn: 更新软件包的列表

source: First the list of available packages for the new release needs to be fetched. This is done by executing<footnote><p>We use <prgn>apt-get</prgn> for this because the &oldreleasename; version <prgn>aptitude</prgn> may fail when new sources have been added to <file>sources.list</file>.</p></footnote>:
ja: まず、新規リリース用として入手可能なパッケージの一覧を取得する必要があります。次のように実行してください<footnote><p>&oldreleasename; 版の <prgn>aptitude</prgn> では新しいソースを <file>sources.list</file> に追加すると失敗するかもしれないので、ここでは <prgn>apt-get</prgn> を使います</p></footnote>:
nl: Eerst moet de database met beschikbare pakketten voor de nieuwe release worden opgehaald. Dit gebeurt met de volgende opdracht<footnote><p>We gebruiken hiervoor <prgn>apt-get</prgn> omdat de versie van<prgn>aptitude</prgn> uit &oldreleasename; kan stuklopen als nieuwe bronnen zijn toegevoegd in<file>sources.list</file>.</p></footnote>:
ru: Сначала нужно скачать список пакетов для нового выпуска. Это можно сделать, выполнив команду<footnote><p>Мы используем <prgn>apt-get</prgn>, потому что версия <prgn>aptitude</prgn> из выпуска &oldreleasename; может не сработать после добавления новых источников в <file>sources.list</file>.</p></footnote>
sv: Först behöver listan över tillgängliga paket för den nya åtgåvan hämtas. Det här görs genom att köra<footnote><p>Vi använder <prgn>apt-get</prgn> för det här på grund av att &oldreleasename;-versionen av <prgn>aptitude</prgn> kan misslyckas när nya källor har lagts till i <file>sources.list</file>.</p></footnote>:

source: Upgrading aptitude
ja: aptitude のアップグレード
nl: Het pakket aptitude opwaarderen
pt: Actualizar o aptitude
ru: Обновление aptitude
sv: Uppgradera aptitude
zh_cn: 更新 aptitude

source: Upgrade tests have shown that &releasename;'s version of <prgn>aptitude</prgn> is better at solving the complex dependencies during an upgrade than either <prgn>apt-get</prgn> or &oldreleasename;'s <prgn>aptitude</prgn>. It should therefore be upgraded first using:
ja: アップグレード中の複雑な依存関係の解決には、<prgn>apt-get</prgn> や &oldreleasename; の <prgn>aptitude</prgn> よりも、&releasename; 版の <prgn>aptitude</prgn> のほうが優れていることがアップグレードのテスト中に判明しました。したがって、次のように実行してまずアップグレードすべきです:
pt: Testes mostraram que a versão do <prgn>aptitude</prgn> da &releasename; melhora a resolução de dependências durante uma actualização comparado com o <prgn>apt-get</prgn> ou o <prgn>aptitude</prgn> da &oldreleasename;. Deverá deste modo fazer a actualização inicial utilizando:
ru: Пробные обновления показали, что версия <prgn>aptitude</prgn> из &releasename; разрешает сложные зависимости при обновлении лучше, чем <prgn>apt-get</prgn> и <prgn>aptitude</prgn> из &oldreleasename; <prgn>aptitude</prgn>. Поэтому её следует обновить в первую очередь, запустив:
sv: Uppgraderingstester har visat att <prgn>aptitude</prgn>-versionen i &releasename; är bättre på att lösa komplexa beroenden under en uppgradering än både <prgn>apt-get</prgn> och <prgn>aptitude</prgn> i &oldreleasename;. Den bör därför först uppgraderas genom att köra:
zh_cn: 在进行升级的测试中显示，&releasename; 版的 <prgn>aptitude</prgn> 在升级过程中，对于处理复杂的依赖上的问题，它的表现比 <prgn>apt-get</prgn> 或 &oldreleasename; 版的 <prgn>aptitude</prgn> 更为优异。因此，您可以先利用以下指令进行升级：
