Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: Remove packages that take up too much space and you do not have an immediate need for (you can always reinstall them after the upgrade). You can list packages that take up most of the disk space with <prgn>dpigs</prgn> (available in the <prgn>debian-goodies</prgn> package) or with <prgn>wajig</prgn> (running <prgn>wajig size</prgn>).
sv: Ta bort paket som tar upp för mycket utrymme och som du inte har ett omedelbart behov av (du kan alltid installera om dem efter uppgraderingen). Du kan lista paketen som tar upp mest utrymme genom att köra programmet <prgn>dpigs</prgn> (tillgängligt i paketet <prgn>debian-goodies</prgn>) eller med <prgn>wajig</prgn> (kör <prgn>wajig size</prgn>).

source: In case you run a kernel prior to 2.4.1, you need to upgrade to (at least) the 2.4-series before upgrading the <package>glibc</package>, which means: best before starting with the upgrade. It is recommended to upgrade to the 2.6-kernel series.
sv: Om du kör en kärna med ett versionsnummer lägre än 2.4.1, behöver du uppgradera till (åtminstone) 2.4-serien före uppgradering av <package>glibc</package>, vilket betyder: bäst att göra innan uppgraderingen. Det rekommenderas att uppgradera till en kärna ur 2.6-serien.

source: Upgrade your kernel or userland first?
pt: Actualizar o seu kernel ou o 'userland' primeiro?
ru: Обновлять сначала ядро или пользовательские программы?
sv: Uppgradera din kärna eller användarområdet först?

source: [FIXME: Needs decision/documentation whether to upgrade userland or kernel first.]
sv: [FIXME: Behöver klargörelse/dokumenation huruvida uppgradering av användarland eller kärna sker först.]

source: # dpkg --get-selections &gt; ~/curr-pkgs.txt
sv: # dpkg --get-selections &gt; ~/nuvarande-paket.txt

source: # aptitude hold <var>package_name</var>
sv: # aptitude hold <var>paketnamn</var>

source: # mount -o remount,rw /<var>mountpoint</var>
pt: # mount -o remount,rw /<var>ponto_montagem</var>
sv: # mount -o remount,rw /<var>monteringspunkt</var>

source: # script -a ~/upgrade-to-&releasename;.typescript
sv: # script -a ~/uppgradering-till-&releasename;.typescript

source: The typescript will also allow you to review information that has scrolled off-screen. Just switch to VT2 (using <tt>Alt-F2</tt>) and, after logging in, use <tt>less ~root/upgrade-to-&releasename;.typescript</tt> to view the file.
pt: O ficheiro transcrito permitir-lhe-á também rever informação que tenha sido passada para fora do ecrã. Alterne para VT2 (fazendo <tt>Alt-F2</tt>) e, depois de iniciar a sessão, faça <tt>less ~root/upgrade-to-&releasename;.typescript</tt> para ver o ficheiro.
ru: Запись также поможет вам прочитать информацию, которая была "промотана" за границу экрана. Просто переключитеcь на вторую консоль (нажав <tt>Alt-F2</tt>) и, войдя в систему, запустите <tt>less ~root/upgrade-to-&releasename;.typescript</tt> для просмотра файла.
sv: Typescript kommer även att låta dig granska informationen som har rullat ut från skärmen. Byt helt enkelt till VT2 (med <tt>Alt-F2</tt>) och, efter inloggning, använd <tt>less ~root/uppgradering-till-&releasename;.typescript</tt> för att visa filen.

source: # dpkg --remove <var>package_name</var>
pt: # dpkg --remove <var>nome_de_pacote</var>
sv: # dpkg --remove <var>paketnamn</var>

source: # dpkg --install <var>/path/to/package_name.deb</var>
sv: # dpkg --install <var>/sökväg/till/paketnamn.deb</var>

source: # dpkg -r --force-depends <var>package_name</var>
pt: # dpkg -r --force-depends <var>nome_de_pacote</var>
sv: # dpkg -r --force-depends <var>paketnamn</var>

source: All Linux kernel packages have been renamed from <tt>kernel-*</tt> to <tt>linux-*</tt> to clean up the namespace.
sv: Alla Linux-kärnpaket har bytt namn från <tt>kernel-*</tt> till <tt>linux-*</tt> för att rensa upp namnrymden.

source: If you are currently using a kernel from the 2.4 series, the older stable Linux kernel series, you should upgrade to a 2.6 series kernel, as 2.4 is no longer supported in &releasename;. If you are currently using a kernel from the 2.2 series, you must upgrade to (at least) the 2.4 series, better to a 2.6 series kernel prior to upgrading your packages. Some general issues associated with an upgrade to 2.6 are documented in <ref id="upgrade-to-2.6">.
sv: Om du för närvarande använder en kärna från 2.4-serien, den äldre stabila serien av Linux-kärnor, bör du uppgradera till en kärna ur 2.6-serien, eftersom 2.4 inte längre stöds i &releasename;. Om du för närvarande använder en kärna från 2.2-serien, måste du uppgradera till (minst) 2.4-serien, ännu bättre till en kärna ur 2.6-serien innan din paketuppgradering påbörjas. Några vanliga problem associerade med en uppgradering till 2.6 finns dokumenterade i <ref id="upgrade-to-2.6">.

source: &releasename; no longer provides support for <prgn>devfs</prgn>. It is recommended that users switch to udev for dynamic <file>/dev</file> management. Debian kernels no longer include support for <prgn>devfs</prgn>, so <prgn>devfs</prgn> users will need to manually convert their systems before upgrading to an &releasename; kernel.
sv: &releasename; tillhandahåller inte längre stöd för <prgn>devfs</prgn>. Det rekommenderas att användarna byter till udev för dynamisk hantering av <file>/dev</file>. Debian-kärnor inkluderar inte längre stöd för <prgn>devfs</prgn>, så användare med <prgn>devfs</prgn> behöver manuellt konvertera sina system innan uppgradering till en &releasename;-kärna.

source: If you see the string 'devfs' in <file>/proc/mounts</file>, you are likely using devfs. Any config files that reference devfs style names will need to be adjusted to use udev style names. Files that are most likely to refer to devfs style device names include <file>/etc/fstab</file>, <file>/etc/lilo.conf</file>, <file>/boot/grub/menu.lst</file>, etc.
sv: Om du ser strängen "devfs" i <file>/proc/mounts</file>, använder du säkerligen devfs. De konfigurationsfiler som refererar till devfs-liknande namn kommer att behöva justeras till att använda udev-liknande namn. Filer som antagligen refererar till devfs-liknande enhetsnamn inkluderar <file>/etc/fstab</file>, <file>/etc/lilo.conf</file>, <file>/boot/grub/menu.lst</file>, etc.

source: Standard kernels contain SMP abilities
pt: Os kernels convencionais contém funcionalidades SMP
ru: В стандартные ядра включена поддержка SMP
sv: Standardkärnor innehåller SMP-förmågor

source: For network devices, you can avoid this reordering by using the <prgn>ifrename</prgn> utility to bind physical devices to specific names at boot time. See <manref section="8" name="ifrename"> and <manref section="5" name="iftab"> for more information.
pt: Para dispositivos de rede, pode evitar esta re-ordenação usando a ferramenta <prgn>ifrename</prgn> para ligar dispositivos físicos a nomes específicos durante o arranque do sistema. Veja <manref section="8" name="ifrename"> e <manref section="5" name="iftab"> para mais informação.
ru: Для сетевых устройств можно избежать переназначения с помощью утилиты <prgn>ifrename</prgn>, привязав физические устройства к специальным именам во время загрузки. Подробней смотрите в <manref section="8" name="ifrename"> и <manref section="5" name="iftab">.
sv: För nätverksenheter kan du undvika den här omsorteringen genom att använda verktyget <prgn>ifrename</prgn> för att binda fysiska enheter till specifika namn vid uppstarten. Se <manref section="8" name="ifrename"> och <manref section="5" name="iftab"> för mer information.

source: Add these module names to <file>/etc/initramfs-tools/modules</file> in the order they should be loaded at boottime. Some module names may have changed between &oldreleasename; and &releasename;. For example, sym53c8xx_2 has become sym53c8xx.
sv: Lägg till dessa modulnamn till <file>/etc/initramfs-tools/modules</file> i den ordning som de ska läsas in i vid uppstarten. Vissa modulnamn kan ha ändrats mellan &oldreleasename; och &releasename;. Till exempel har sym53c8xx_2 blivit sym53c8xx.

source: If you are unsure about which package to select, run <tt>uname -r</tt> and look for a package with a similar name. For example, if you see '2.4.27-3-686', it is recommended that you install <package>linux-image-2.6-686</package>. You may also use apt-cache to see a long description of each package in order to help choose the best one available. For example:
sv: Om du är osäker på vilket paket du ska välja, kör <tt>uname -r</tt> och leta efter ett paket med liknande namn. Om du till exempel ser "2.4.27-3-686", rekommenderas det att du installerar <package>linux-image-2.6-686</package>. Du kan även använda apt-cache för att se en lång beskrivning för varje paket för att hjälpa dig att välja den bästa möjliga. Till exempel:

source: You should then use <tt>aptitude install</tt> to install it. Once this new kernel is installed you should reboot at the next available opportunity to get the benefit.
nl: Vervolgens kunt u de gewenste kernel installeren met <tt>aptitude install</tt>. Nadat de nieuwe kernel is geïnstalleerd, dient u bij de eerste gelegenheid de computer opnieuw op te starten om deze ook daadwerkelijk te gebruiken.
pt: Deverá usar <tt>aptitude install</tt> para o instalar. Uma vez que este novo kernel esteja instalado deverá reinicializar à primeira oportunidade para o começar a usar.
ru: Затем ядро нужно установить с помощью <tt>aptitude install</tt>. После установки ядра следует перезагрузить систему при первой возможности.
sv: Du bör sedan använda <tt>aptitude install</tt> för att installera den. När den här nya kärnan är installerad bör du starta om vid nästa möjliga tillfälle för att dra nytta av den.

source: Since 2.6.17, Linux uses TCP window scaling which is specified in RFC 1323 in an aggressive way. Some servers have a broken behaviour, and announce wrong window sizes for themselves. Please see the bugs <url id="http://bugs.debian.org/381262" name="#381262"> and <url id="http://bugs.debian.org/395066" name="#395066"> for more information.
pt: Desde o 2.6.17, o Linux usa redimensionamento de escala da janela TCP especificado em RFC 1323 de um modo agressivo. Alguns servidores apresentação um comportamento não funcional e apresentam eles próprios dimensões erradas das janelas. Por favor veja os erros <url id="http://bugs.debian.org/381262" name="#381262"> e <url id="http://bugs.debian.org/395066" name="#395066"> para mais informações.
ru: Начиная с версии 2.6.17, Linux использует изменение окна TCP, описанное в RFC 1323, в агрессивной манере. Некоторые серверы не удовлетворяют RFC и объявляют неверные размеры своих окон. Подробней смотрите ошибки <url id="http://bugs.debian.org/381262" name="#381262"> и <url id="http://bugs.debian.org/395066" name="#395066">.
sv: Sedan 2.6.17 använder Linux "TCP window scaling" på ett aggressivt sätt, vilket finns beskrivet i RFC 1323. Vissar servrar har ett trasigt beteende, och annonserar felaktiga "window sizes" för sig själva. Se felrapporterna <url id="http://bugs.debian.org/381262" name="#381262"> och <url id="http://bugs.debian.org/395066" name="#395066"> för mer information.

source: On some older systems, <prgn>shutdown -h</prgn> may not power off the system anymore (but just stop it). This happens because apm needs to be used there. Adding <tt>acpi=off apm=power_off</tt> to the kernel's command line, e.g. in <package>grub</package> or <package>lilo</package> configuration files should fix this issue. Please see bug <url id="http://bugs.debian.org/390547" name="#390547"> for additional information.
sv: På vissa äldre system, kan <prgn>shutdown -h</prgn> inte stänga ner systemet längre (bara stoppar det). Det här händer därför att apm behöver användas där. Lägg till <tt>acpi=off apm=power_off</tt> till kärnans kommandorad , t.ex. i konfigurationsfilen för <package>grub</package> eller <package>lilo</package> bör rätta till det här problemet. Se felrapporten <url id="http://bugs.debian.org/390547" name="#390547"> för ytterligare information.

source: There has been support added to <prgn>apt</prgn> to download only the difference between packages files. This is handy for people with bad network connections, but people having a very nearby mirror may want to disable this feature. One can disable it by adding <tt>Acquire::Pdiffs "false";</tt> to <file>/etc/apt/apt.conf</file>.
sv: Det har lagts till stöd i <prgn>apt</prgn> för att endast hämta ner skillnaderna mellan paketfilerna. Det här är lämpligt för personer som har långsamma nätverksanslutningar, men personer som har en spegelserver nära sig kanske vi inaktivera den här funktionen. Man kan inaktivera den genom att lägga till <tt>Acquire::Pdiffs "false";</tt> till filen <file>/etc/apt/apt.conf</file>.

source: For some SATA disk controllers, the device assigned to a drive and its partitions may change from <file>/dev/hdX</file> to <file>/dev/sdX</file>. If this happens, you will have to modify your <file>/etc/fstab</file> and bootloader configuration accordingly. Unless these changes are made correctly, your system may not boot correctly.
nl: Voor sommige SATA stuureenheden kan de apparaatnaam die wordt toegewezen aan een harde schijf en zijn partities veranderen van <file>/dev/hdX</file> naar <file>/dev/sdX</file>. Als dit gebeurt zult u uw <file>/etc/fstab</file> en de configuratie van uw opstartlader overeenkomstig moeten aanpassen. Als deze wijzigingen niet correct worden doorgevoerd, is de kans groot dat uw systeem niet juist zal opstarten.
pt: Para alguns controladores de discos SATA, o dispositivo atribuído a uma 'drive' e ás suas partições podem ser alteradas de <file>/dev/hdX</file> para <file>/dev/sdX</file>. Se isto acontecer, terá que modificar o seu <file>/etc/fstab</file> e a configuração do gestor de arranque de acordo. A não ser que estas alterações sejam feita correctamente, o seu sistema pode não arrancar com sucesso.
ru: Для некоторых контроллеров SATA-дисков имена устройств могут измениться с <file>/dev/hdX</file> на <file>/dev/sdX</file>. Если это случится, придётся внести соответствующие изменения в файл <file>/etc/fstab</file> и конфигурацию загрузчика ОС. При неверной настройке компьютер может перестать загружаться.
sv: För vissa SATA-diskkontroller, kan enheten som tilldelas en disk och dess partitioner ändras från <file>/dev/hdX</file> till <file>/dev/sdX</file>. Om det här händer, behöver du lämpligen ändra din <file>/etc/fstab</file> och konfiguration för starthanteraren. Såvida dessa ändringar inte görs korrekt, kan ditt system inte starta upp korrekt.

source: If your console keyboard is affected, you will probably also need to reconfigure your keyboard for the X Window System. You can do this either by running <tt>dpkg-reconfigure xserver-xfree86</tt> or by editing <file>/etc/X11/XF86Config-4</file> directly. Don't forget to read the documentation referred to in <ref id="nownownow">.
nl: Als uw toetsenbord voor console moet worden aangepast, zult u waarschijnlijk ook uw toetsenbordinstelling voor het X Window System moeten aanpassen.Dit kan ofwel met de opdracht <tt>dpkg-reconfigure xserver-xfree86</tt> of door handmatig <file>/etc/X11/XF86Config-4</file> te wijzigen. Vergeet niet om de documentatie te lezen waarnaar wordt verwezen in <ref id="nownownow">.
pt: Se o seu teclado foi afectado na consola, provavelmente terá que reconfigurar o seu teclado a partir do X Window System. Pode fazer isto correndo <tt>dpkg-reconfigure xserver-xfree86</tt> ou editando directamente <file>/etc/X11/XF86Config-4</file>. Não se esqueça de ler a documentação referida em <ref id="nownownow">.
ru: Если эта проблема проявляется при работе в консоли, то, скорее всего, придётся изменить настройки клавиатуры и для X Window System. Это можно сделать либо запуском <tt>dpkg-reconfigure xserver-xfree86</tt>, либо непосредственно исправив файл <file>/etc/X11/XF86Config-4</file> вручную. Не забудьте прочесть документацию, о которой упомянуто в <ref id="nownownow">.
sv: Om ditt konsolltangentbord berörs, behöver du antagligen också konfigurera om ditt tangentbord för X Window System. Du kan göra det här genom att antingen köra <tt>dpkg-reconfigure xserver-xfree86</tt> eller genom att redigera <file>/etc/X11/XF86Config-4</file> direkt. Glöm inte att läsa dokumentationen som refereras till i <ref id="nownownow">.

source: As <package>udev</package> is automatically installed as a dependency of the new default initrd generator used with the 2.6 kernels (<package>initramfs-tools</package>), upgrading to a 2.6 kernel will normally result in <package>udev</package> being activated.
pt: Como o <package>udev</package> é automaticamente instalado como uma dependência do novo gerador por omissão initrd usado pelos kernels 2.6 (<package>initramfs-tools</package>), ao actualizar para um kernel 2.6 irá normalmente resultar na activação do <package>udev</package>.
ru: Так как <package>udev</package> автоматически устанавливается по зависимостям от нового генератора initrd по умолчанию, используемого для ядер версий 2.6 (<package>initramfs-tools</package>), обновление до ядра версий 2.6 активирует работу <package>udev</package>.
sv: Eftersom <package>udev</package> installeras automatiskt som ett beroende för den nya standardgeneratorn för initrd som används med 2.6-kärnorna (<package>initramfs-tools</package>), kommer en uppgradering till en 2.6-kärna normalt sett resultera i att <package>udev</package> blir aktiverat.

source: One of the packages that has been obsoleted by the &releasename; release is the Mail Transfer Agent (MTA) exim, which has been replaced by the completely new package exim4.
pt: Um dos pacotes tornado obsoleto pela versão &releasename; é o Mail Transfer Agent (MTA) exim, que foi substituído completamente pelo novo pacote exim4.
ru: Одним из устаревших пакетов к выпуску &releasename; стал агент пересылки почты (MTA) exim, который был заменён полностью новым пакетом exim4.
sv: Ett av paketen som har föråldrats av &releasename;-utgåvan är e-postservern exim, som har ersatts av det helt nya paketet exim4.

source: exim (version 3.xx) has been unmaintained upstream for years, and Debian has dropped support for that version as well. If you are still using exim 3.xx, please upgrade your exim installation to exim4 manually. Since exim4 is already part of &oldreleasename, you can choose to do the upgrade on your &oldreleasename; system before the upgrade to &releasename;, or after the &releasename; upgrade at your convenience. Just remember that your old exim package is not going to be upgraded and that it won't get security support after support for &oldreleasename; will be discontinued.
sv: Exim (version 3.xx) har inte underhållits på flera år, och Debian har också tagit bort stödet för den versionen. Om du fortfarande använder exim 3.xx, uppgradera din exim-installation till exim4 manuellt. Eftersom exim4 redan är en del av &oldreleasename, kan du välja att göra uppgraderingen på ditt &oldreleasename;-system innan uppgradering till &releasename;, eller efter uppgraderingen till &releasename;. Kom ihåg att ditt gamla exim-paket inte kommer att uppgraderas och att det inte kommer att få säkerhetsstöd därför att stödet för &oldreleasename; har upphört.

source: The exim4 packages in Debian are extensively documented. The package's home page is <url id="http://wiki.debian.org/PkgExim4"> on the Debian Wiki, and the README file can be found at <url id="http://pkg-exim4.alioth.debian.org/README/etch/README.Debian.html"> and inside the packages as well.
sv: Paketen för exim4 i Debian är väldokumenterade. Paketets hemsida är <url id="http://wiki.debian.org/PkgExim4"> på Debians Wiki, och filen README kan hittas på <url id="http://pkg-exim4.alioth.debian.org/README/etch/README.Debian.html"> och även inne i paketet.

source: The README file has a chapter about Packaging, which explains the different package variations we offer, and it has a chapter about Updating from Exim 3, which will help you in doing the actual transition.
pt: O ficheiro README possui um capítulo sobre empacotamento que explica as diferenças entre pacotes que oferecemos, existe também um capítulo sobre como actualizar vindo do Exim 3 que o poderá ajudar a efectuar a transição actual.
ru: В файле README есть глава Packaging, в которой описаны различия пакетов, которые мы предлагаем, также есть глава об обновлении с Exim 3, которая поможет вам выполнить переход.
sv: Filen README har ett kapitel om paketering (Packaging), som förklarar de olika paketvarianterna som vi erbjuder, och den har ett kapitel om uppdatering från Exim 3 (Updating from Exim 3), som hjälper dig att göra den faktiska övergången.

source: Security status of mozilla products
sv: Säkerhetsstatus för Mozilla-produkter

source: Thanks to the huge efforts of translators, Debian can now be installed in $FIXME$ languages. <![ %g-i [ If the graphical user interface is used, an additional $FIXME$ languages are supported. ]]>
pt: Graças aos enormes esforços dos tradutores, a Debian pode agora ser instalada em $FIXME$ idiomas. <![ %g-i [ Se a interface de utilizador gráfica for utilizada, $FIXME$ idiomas são suportados.]]>
ru: Благодаря огромным усилиям переводчиков, Debian теперь можно устанавливать на $FIXME$ языках. <![ %g-i [ Если используется графический интерфейс программы установки, то поддерживаются ещё $FIXME$ языков. ]]>

source: In case you run a kernel prior to 2.4.1, you need to upgrade to (at least) the 2.4-series before upgrading <package>glibc</package>, so preferably before starting the upgrade. It is recommended to upgrade to the 2.6-kernel series.
pt: No caso de correr um kernel anterior a 2.4.1, irá necessitar de actualizar (no mínimo) para a série 2.4 antes de actualizar o pacote <package>glibc</package>, de preferência antes da actualização. É recomendado a actualização para a série 2.6-kernel.
ru: Если у вас работает ядро с версией меньшей 2.4.1, то вам нужно провести обновление до ветки 2.4 (по крайней мере) перед тем как обновлять <package>glibc</package> -- это лучше сделать до начала обновления. Рекомендуется обновить ядро до ветки 2.6.

source: If you are currently using a kernel from the 2.4 series, the older stable Linux kernel series, you should upgrade to a 2.6 series kernel, as 2.4 is no longer supported in &releasename;. If you are currently using a kernel from the 2.2 series, you must upgrade to (at least) the 2.4 series, preferably to a 2.6 series kernel prior to upgrading your packages. Some general issues associated with an upgrade to 2.6 are documented in <ref id="upgrade-to-2.6">.
pt: Se estiver actualmente a usar um kernel da série 2.4, a série antiga estável do kernel Linux, deverá actualizar para um kernel da série 2.6, já que o 2.4 não é mais suportado na &releasename;. Se estiver a usar um kernel 2.2, deverá actualizar (no mínimo) para a série 2.4, de preferência para a série de kernel 2.6, antes de actualizar os pacotes. Algumas questões gerais associadas à actualização do kernel para 2.6 estão documentadas em <ref id="upgrade-to-2.6">.
ru: Если вы используете ядро из ветки 2.4, раннюю стабильную ветку ядер Linux, то вам следует обновиться до ветки 2.6, так как 2.4 больше не поддерживается в &releasename;. Если вы используете ядро из ветки 2.2, то вы должны перейти на ветку 2.4 (как минимум), а лучше на 2.6, и сделать это начала обновления пакетов. Некоторые общие вопросы, связанные с обновлением до 2.6 описаны в <ref id="upgrade-to-2.6">.
