Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: If you see the string 'devfs' in <file>/proc/mounts</file>, you are likely using <prgn>devfs</prgn>. Any config files that reference devfs style names will need to be adjusted to use udev style names. Files that are most likely to refer to devfs style device names include <file>/etc/fstab</file>, <file>/etc/lilo.conf</file>, <file>/boot/grub/menu.lst</file>, etc.
pt: Se vir a string 'devfs' em <file>/proc/mounts</file> deverá estar a usar <prgn>devfs</prgn>. Quaisquer ficheiros de configuração que façam referência a devfs terão de ser ajustados de modo a utilizar udev. Os ficheiros que normalmente fazem referência a devfs são <file>/etc/fstab</file>, <file>/etc/lilo.conf</file>, <file>/boot/grub/menu.lst</file>, etc.
ru: Если вы видите строку 'devfs' в файле <file>/proc/mounts</file>, то, вероятно, используется <prgn>devfs</prgn>. Имена в стиле devfs во всех конфигурационных файлах нужно заменить на соответствующие имена в стиле udev. Имена в стиле devfs обычно упомянуты в файлах <file>/etc/fstab</file>, <file>/etc/lilo.conf</file>, <file>/boot/grub/menu.lst</file> и подобных им.

source: exim (version 3.xx) has been unmaintained upstream for years, and Debian has dropped support for that version as well. If you are still using exim 3.xx, please upgrade your exim installation to exim4 manually. Since exim4 is already part of &oldreleasename;, you can choose to do the upgrade on your &oldreleasename; system before the upgrade to &releasename;, or after the &releasename; upgrade at your convenience. Just remember that your old exim package is not going to be upgraded and that it won't get security support after support for &oldreleasename; will be discontinued.
pt: O exim (version 3.xx) perdeu a manutenção à alguns anos, a Debian abandonou o suporte a esta versão do mesmo modo. Se ainda estiver a usar o exim 3.xx, por favor actualize a sua instalação do exim manualmente para o exim 4. Como o exim4 é já parte da &oldreleasename;, pode escolher efectuar a actualização no seu sistema &oldreleasename; antes de actualizar para a versão &releasename;, ou depois de actualização para &releasename; conforme a sua conveniência. Lembre-se apenas que o pacote exim antigo não vai ser actualizado e que o suporte de segurança depois da actualização para &oldreleasename; será descontinuado.
ru: Программа exim (версии 3.xx) не поддерживалась разработчиком несколько лет, и поэтому в Debian также была прекращена поддержка этой версии. Если вы всё ещё используете exim 3.xx, обновите установленный exim до exim4 вручную. Так как exim4 уже был в &oldreleasename;, вы можете выполнить обновление в системе &oldreleasename; перед тем как обновляться до &releasename;, или после обновления до &releasename;, как хотите. Помните, что старый пакет exim обновлён не будет и для него не будет обеспечиваться поддержка безопасности после того, как поддержка &oldreleasename; будет прекращена.

source: The exim4 packages in Debian are extensively documented. The package's home page is <url id="http://wiki.debian.org/PkgExim4"> on the Debian Wiki, and the README file can be found at <url id="http://pkg-exim4.alioth.debian.org/README/README.Debian.html"> and inside the packages as well.
pt: Os pacote exim4 da Debian estão extensamente documentados. A página do pacote é <url id="http://wiki.debian.org/PkgExim4"> no Wiki Debian, e o ficheiro README pode ser encontrado em <url id="http://pkg-exim4.alioth.debian.org/README/README.Debian.html"> e também dentro do pacote.
ru: Пакеты exim4 в Debian очень хорошо документированы. Домашняя страница пакетов в Debian Wiki <url id="http://wiki.debian.org/PkgExim4">, файл README можно найти в <url id="http://pkg-exim4.alioth.debian.org/README/README.Debian.html">, а также внутри пакетов.

source: Release Notes for &debian; &release; (`&releasename'), &arch-title;
nl: Release Notities voor &debian; &release; ('&releasename'), &arch-title;

source: <name>Josip Rodin, Bob Hilliard, Adam Di Carlo, Anne Bezemer, Rob Bradford (current), Frans Pop (current)</name><email></email>
nl: <name>Josip Rodin, Bob Hilliard, Adam Di Carlo, Anne Bezemer, Rob Bradford (huidig), Frans Pop (huidig)</name><email></email>

source: What's new in the Release Notes
nl: Nieuw in de Release Notities

source: [The most recent version of this document is always available at <url id="&url-release-notes;">. If your version is more than a month old, you might wish to download the latest version.]
nl: [De meest recente versie van dit document is altijd beschikbaar op <url id="&url-release-notes;">. Als uw versie meer dan een maand oud is, kan het zinvol zijn om de nieuwste versie te downloaden.]

source: Please note that previous editions of the release notes contained information about upgrading from releases older than than the previous release. However such content often complicated the documentation so we have decided to only discuss upgrades from &debian; 3.0 ('woody'). If you need to upgrade from older releases please read previous editions of the release notes.
nl: Merk op dat voorgaande edities van de Release Notities informatie bevatten over het migreren vanaf oudere releases van Debian dan de voorgaande release. Deze informatie maakte de documentatie echter relatief complex. In verband hiermee hebben wij besloten om alleen de migratie vanaf &debian; 3.0 ('woody') te behandelen. Als u moet migreren vanaf een eerdere release, raden wij u aan om de voorgaande edities van de Release Notities te lezen.

source: The list of supported architectures has not changed since the previous release, &debian; 3.0 ('woody'). Here is the full list of architectures for this release.
nl: De lijst van ondersteunde platforms is niet gewijzigd ten opzichte van de vorige release, &debian; 3.0 ('woody'). Dit is de complete lijst met platforms voor deze release.

source: This is only the second official release of &debian; for the &arch-title; architecture. We feel that it has proven itself sufficiently to be released. However, because it has not had the exposure (and hence testing by users) that our other releases on other architectures have had, you may encounter a few bugs. Please use our <url id="&url-bts;" name="bug tracking system"> to report any problems; make sure to mention the fact that the bug is on the &architecture; platform.
nl: Dit is pas de tweede officiële release van &debian; voor het &arch-title; platform. Wij zijn van mening dat deze zich voldoende heeft bewezen om te worden uitgebracht. Omdat hij echter minder door gebruikers in de praktijk is getest dan onze andere releases op andere platforms, is het mogelijk dat u nog een enkel probleem tegenkomt. Wij verzoeken u ons <url id="&url-bts;" name="Bug Tracking System"> te gebruiken om problemen te rapporteren; zorgt u ervoor dat u daarbij vermeldt dat het probleem betrekking heeft op het &architecture;-platform.

source: On the &arch-title; architecture a 2.6 kernel is also available; this has kernel version &kernelversion-2.6;. Note that Debian's 2.6.8 kernel packages include the 2.6.8.1 kernel release and selected other patches.
nl: Voor het &arch-title;-platform is ook een 2.6 kernel beschikbaar; deze heeft kernelversie &kernelversion-2.6;. Merk op dat release 2.6.8.1 van de kernel en geselecteerde andere wijzigingen (patches) reeds zijn opgenomen in de 2.6.8 kernel-pakketten van Debian.

source: &debian; &release; for the &arch-title; architecture ships with kernel versions 2.2.25 and 2.4.27. For some subarchitectures 2.6.8 kernels are also available, but these should be considered experimental.
nl: &debian; &release; voor het &arch-title; platform wordt geleverd met kernelversies 2.2.25 en 2.4.27. Voor sommige subplatforms kunnen ook 2.6.8 kernels beschikbaar zijn; deze dienen echter als experimenteel te worden beschouwd.

source: This new release of Debian again comes with a lot more software than its predecessor &oldreleasename;; the distribution includes over 9000 new packages. Most of the software in the distribution has been updated: almost 6500 software packages (that is 73% of the number of packages in &oldreleasename;). Also, a significant number of packages has for various reasons been removed from the distribution. You will not see any updates for these packages and they will be marked as 'obsolete' in package management front-ends.
nl: Deze nieuwe release van Debian omvat wederom veel meer software dan zijn voorganger &oldreleasename;; de distributie bevat meer dan 9000 nieuwe pakketten. Van de meeste software is een nieuwe versie beschikbaar: bijna 6500 pakketten (dat is 73% van de pakketten in &oldreleasename;). Ook is, om diverse redenen, een behoorlijk aantal pakketten uit de distributie verwijderd. Voor deze pakketten zijn geen nieuwe versies beschikbaar en in de applicaties voor pakketbeheer worden ze gemarkeerd als 'verouderd'.

source: This release of &debian; contains the much improved XFree86 4.3 release, which includes support for a greater range of hardware, better autodetection support, and improved support for advanced technologies such as Xinerama and 3D acceleration.
nl: Deze release van &debian; bevat de sterk verbeterde versie 4.3 van XFree86; deze versie ondersteunt een breder assortiment aan hardware, verbeterde automatische detectie en verbeterde ondersteuning voor geavanceerde technologieën als Xinerama en 3D-acceleratie.

source: &debian; is more desktop orientated than ever in this new release, it now includes GNOME 2.8 and KDE 3.3. Also included for the first time is a complete office suite in the form of OpenOffice.org 1.1, other productivity tools included in the release are the Evolution groupware software and GAIM instant messaging client.
nl: Met deze release is &debian; meer dan ooit georiënteerd op desktop computers; het bevat nu GNOME 2.8 en KDE 3.3. Ook is, in de vorm van OpenOffice.Org 1.1, voor de eerste keer een compleet pakket voor kantoorautomatisering opgenomen. Andere vermeldenswaardige pakketten op dit gebied zijn de Evolution groupware programmatuur en het chat-programma GAIM.

source: The &releasename; version of <prgn>aptitude</prgn> is the preferred program for package management from console. It has proven to be better at dependency resolution than <prgn>apt-get</prgn>. <prgn>aptitude</prgn> supports most command line operations of <prgn>apt-get</prgn>. If you are still using <prgn>dselect</prgn>, you should also give <package>aptitude</package> a try as frontend for package management.
nl: Voor pakketbeheer vanaf de console verdient de &releasename;-versie van <prgn>aptitude</prgn> de voorkeur. Het heeft bewezen afhankelijkheden tussen pakketten beter op te lossen dan <prgn>apt-get</prgn>. De meeste operaties die u met <prgn>dselect</prgn> vanaf de opdrachtregel kunt uitvoeren, worden ook door <prgn>aptitude</prgn> ondersteund. Als u nog altijd gebruik maakt van <prgn>dselect</prgn>, dan zou u <package>aptitude</package> ook eens moeten proberen als interactieve interface voor pakketbeheer.

source: The official &debian; distribution now ships on thirteen to fifteen binary CDs (depending on the architecture) and a similar number of source CDs. A DVD version of the distribution is now also available.
nl: De officiële &debian; distributie bestaat nu uit dertien tot vijftien (afhankelijk van het platform) CD's met installeerbare pakketten en een vergelijkbaar aantal CD's met broncode; er is ook een versie van de distributie op DVD beschikbaar.

source: New service debian-volatile
nl: Nieuwe dienst debian-volatile

source: There is a new service <em>debian-volatile</em> allowing users to easily update stable packages that contain information that quickly goes out of date. Examples are a virus scanner's signatures list or a spam filter's pattern set. An administrator can use the "volatile.debian.net" archive with similar ease to the "security.debian.org" archive, and enjoy the use of packages with up-to-date information without the hassle and risks of maintaining an entire (or partial) system based on bleeding-edge packages. For more information and a list of mirrors, please see the archive's <url id="&url-debian-volatile" name="web page">.
nl: Er is een nieuwe dienst <em>debian-volatile</em> beschikbaar die gebruikers in staat stelt om pakketten uit de 'stable' distributie die snel verouderende informatie bevatten, op te waarderen. Voorbeelden zijn de databestanden van virus scanners of de sets met patronen voor spamfilters. Een systeembeheerder kan het 'volatile.debian.net' archief net zo eenvoudig gebruiken als het 'security.debian.org' archief, met de voordelen van het gebruik van actuele pakketten en zonder het gedoe en de risico's van het beheren van een volledig (of gedeeltelijk) systeem gebaseerd op "state of the art" pakketten. Voor nadere informatie en een lijst met spiegelservers kunt u terecht op de <url id="&url-debian-volatile" name="website van debian-volatile">.

source: Note that debian-volatile is <em>not</em> an official Debian service. Use it at your own discretion.
nl: Merk op dat debian-volatile <em>geen</em> officiële dienst van Debian is. Het besluit om er al dan niet gebruik van te maken is aan u.

source: non-US obsoleted
nl: non-US is vervallen

source: For the &releasename; release, packages that were formerly in the non-US part of the archive have been moved into the regular archive. If you have any lines referring to "non-us" in your <file>/etc/apt/sources.list</file>, you should remove them.
nl: Voor de &releasename; release zijn pakketten die voorheen deel uitmaakten van het non-US deel van het archief, verplaatst naar het hoofdarchief. Als u in uw <file>/etc/apt/sources.list</file> regels heeft die verwijzen naar "non-us", kunt u deze verwijderen.

source: The old &debian; installation system has been replaced by a completely new installation system called <prgn>debian-installer</prgn>. The new installation system is modular in design and so has been developed with extensibility in mind. It has been fully translated into almost forty languages; additional translations are in progress and may be added in point releases for &releasename;.
nl: Het oude installatiesysteem voor &debian; is vervangen door een geheel nieuw installatiesysteem genaamd <prgn>debian-installer</prgn>. Het nieuwe installatiesysteem is modulair van opzet en is dus ontwikkeld met het oog op uitbreidbaarheid. Het is volledig vertaald in bijna 40 talen; aan extra vertalingen wordt gewerkt en zullen mogelijk bij tussenreleases voor &releasename; worden toegevoegd.

source: Some of the new features in the installation system include improved hardware detection, support for booting off USB flash devices, the use of <prgn>aptitude</prgn> to install packages during configuration of the base system, and support for the <prgn>XFS</prgn> file system, <prgn>RAID</prgn> and <prgn>LVM</prgn> (logical volume management).
nl: Enkele van de nieuwe functies van het installatiesysteem zijn: verbeterde herkenning van hardware, ondersteuning voor het opstarten vanaf USB flash apparaten, de keuze voor <prgn>aptitude</prgn> voor de installatie van pakketten tijdens de configuratie van het basissysteem e ondersteuning voor het bestandssysteem <prgn>XFS</prgn>, <prgn>RAID</prgn> en <prgn>LVM</prgn> (logisch volumebeheer).

source: For full details on the new Debian installation system, users are advised to read the Debian Installation Guide included on the first CD or available from <url id="&url-install-manual;" name="the release pages">. The Installation Guide has been fully translated into eight languages and more are being worked on. Additional translations will be made available from the website when completed.
nl: Voor nadere details over het nieuwe Debian Installatiesysteem, adviseren wij gebruikers om de Debian Installatiehandleiding te lezen die u vindt op de eerste CD of op <url id="&url-install-manual;" name="de release pagina's">. De installatiehandleiding is volledig vertaald in acht talen en aan meer wordt gewerkt. Nieuwe vertalingen zullen worden gepubliceerd via de website als ze klaar zijn.

source: For the &arch-title; architecture, a special set of installation floppy disk images, "speakup", is available for the blind. These images have a special kernel that supports braille displays. A complete list of supported models may be found in the brltty documentation. See the <url id="&url-installer;index#speakup" name="debian-installer release page"> for further information on these images.
nl: Voor visueel gehandicapten is voor het &arch-title; platform een speciale set installatie diskettes, "speakup", beschikbaar. Deze diskettes bevatten een speciale kernel die braille apparatuur ondersteunt. Een volledige lijst met ondersteunde modellen is beschikbaar in de documentatie van brltty. Raadpleeg de <url id="&url-installer;index#speakup" name="release pagina voor debian-installer"> voor nadere informatie over deze diskettes.

source: The old &debian; installation system called <prgn>boot-floppies</prgn> has been replaced by a new componentized and more powerful installation system called <prgn>debian-installer</prgn>.
nl: Het oude &debian; installatiesysteem, <prgn>boot-floppies</prgn>, is vervangen door een nieuw, modulair opgebouwd en krachtiger installatiesysteem genaamd <prgn>debian-installer</prgn>.

source: The installer offers a variety of installation methods. Which methods are available to install your system depends on your architecture.
nl: Het installatiesysteem biedt verschillende installatiemethoden. Welke methoden beschikbaar zijn voor de installatie van uw systeem is afhankelijk van uw platform.

source: If you are making a new installation of Debian, you should read the Installation Guide, which is available on the Official CD at: <example compact="compact"> /doc/install/manual/<var>language</var>/index.html </example> or on the Internet from the <url id="&url-install-manual;" name="&releasename; release pages">. You may also want to check the <url id="&url-installer;index#errata" name="errata"> for debian-installer.
nl: Als u een nieuwe installatie van Debian uitvoert, raden wij u aan om de Installatiehandleiding te lezen. Deze is beschikbaar op de officiële CD in: <example compact="compact"> /doc/install/manual/<var>language</var>/index.html </example> of op het Internet op de <url id="&url-install-manual;" name="&releasename release pagina's">. Het is verstandig om ook de <url id="&url-installer;index#errata" name="errata"> voor debian-installer te controleren.

source: The installation system uses a 2.4 series kernel by default. Installation using a 2.6 based kernel is also possible for &arch-title;. For more details on how to use this please consult the Installation Guide.
nl: Het installatiesysteem maakt standaard gebruik van een kernel uit de 2.4 serie. Daarnaast is voor platform &arch-title; installatie met een 2.6 kernel mogelijk. Raadpleeg de Installatiehandleiding voor nadere informatie hierover.

source: The installation system uses a 2.6 series kernel by default for &arch-title;.
nl: Het installatiesysteem gebruikt voor &arch-title; standaard een kernel uit de 2.6 serie.

source: Depending on the subarchitecture, installation may be possible using either a 2.2.25 kernel or a 2.4.27 kernel or both. For mac the 2.2.25 kernel is preferred, for other subarchitectures the 2.4.27 kernel.
nl: Afhankelijk van het subplatform kunt u de installatie uitvoeren met een 2.2.25 kernel, een 2.4.27 kernel of heeft u de keuze uit beide. Voor het subplatform "mac" verdient de 2.2.25 kernel de voorkeur, voor de andere subplatforms is dit de 2.4.27 kernel.

source: There currently is no support for atari partitions in <prgn>partman</prgn>, the component used in <package>debian-installer</package> to partition and format disks. This means this step has to be performed manually. For further information please see the Installation Guide.
nl: Op dit moment bevat <prgn>partman</prgn> (de component die in <package>debian-installer</package> zorgt voor het indelen en formatteren van harde schijven) geen ondersteuning voor atari partities. Dit betekent dat deze stap handmatig dient te gebeuren. Raadpleeg de Installatiehandleiding voor nadere informatie.

source: The new installer can only be used to install on alpha systems which support the SRM console. Be sure to switch your system to SRM before starting the installation. If your machine supports only the AlphaBIOS/ARC console, you can still install &releasename; using a (minimal) &oldreleasename; installation and a subsequent upgrade. For more information about the different consoles please read the references on the <url id="http://www.debian.org/ports/alpha" name="Debian alpha port web pages">.
nl: Het nieuwe installatiesysteem kan alleen worden gebruik voor installatie op een alpha systeem dat de SRM-console ondersteunt. Zorg ervoor dat u uw systeem overschakelt op SRM voordat u de installatie start. Als uw systeem alleen de AlphaBIOS/ARC-console ondersteunt, kunt u &releasename; nog wel installeren door eerst een (minimaal) &oldreleasename; uit te voeren en vervolgens het systeem op te waarderen naar &releasename;. Voor nadere informatie over de verschillende consoles verwijzen wij naar de referenties op de <url id="http://www.debian.org/ports/alpha" name="web pagina's van de Debian alpha port">.

source: Issues with keyboards on &arch-title;
nl: Aandachtspunten m.b.t. toetsenborden voor &arch-title;

source: There are several issues with keyboard selection during installation.
nl: Er zijn verschillende aandachtspunten met betrekking tot toetsenborden tijdens een installatie.

source: The first issue is with USB keyboards by Sun as used on for example SunBlade systems. When installing using the default 2.4 kernel, these are incorrectly "recognized" by the installer as regular Sun keyboards. A workaround is documented in the Installation Guide (see link above, chapter "Using the Debian Installer").
nl: Het eerste probleem betreft USB-toetsenborden van Sun zoals bijvoorbeeld bij SunBlade systemen worden gebruikt. Bij installaties met de standaard 2.4 kernel, worden deze door het installatiesysteem onjuist "herkend" als een gewoon Sun toetsenbord. Een methode om dit te verhelpen is gedocumenteerd in de Installatiehandleiding (zie de verwijzing hiervoor, hoofdstuk "Het Debian installatiesysteem gebruiken").

source: The second issue is kernel related. Kernels in the 2.6 series use a different input layer that makes all keyboards look like "normal" PC keyboards. This means that if you boot the installer with a 2.4 kernel and configure it for a Sun or USB keyboard and later (in expert mode) select a 2.6 kernel for the new system, you will very likely end up with a non-working keyboard after reboot.
nl: Het tweede probleem is gerelateerd aan de kernel. Kernels in de 2.6 serie gebruiken een andere invoerlaag die ervoor zorgt dat alle toetsenborden zich presenteren als "normale" PC-toetsenborden. Dit betekent dat als u het installatiesysteem opstart met een 2.4 kernel en configureert voor een Sun- of USB-toetsenbord en u vervolgens (in "expert" modus) een 2.6 kernel selecteert voor het nieuwe systeem, de kans groot is dat uw toetsenbord niet meer werkt nadat het systeem opnieuw is opgestart.
