Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: Because of display problems on some systems, framebuffer support is disabled by default for &arch-title;. This can result in ugly display on systems that do properly support the framebuffer, like those with ATI graphical cards. If you see display problems in the installer, you can try booting the installer with parameter "debian-installer/framebuffer=true".
nl: Vanwege problemen met weergave op sommige systemen, is het gebruik van "framebuffer" standaard uitgeschakeld voor &arch-title;. Dit kan leiden tot een lelijke weergave op systemen die gebruik van "framebuffer" wel goed ondersteunen, zoals systemen uitgerust met een grafische kaart van ATI. Als u tijdens de installatie problemen in de weergave ziet, kunt u proberen het installatiesysteem te starten met parameter "debian-installer/framebuffer=true".

source: For technical reasons the <package>popcon</package> package is no longer installed by default for new &releasename; installations. This will probably be corrected in future releases.
nl: Om technische redenen wordt het pakket <package>popcon</package> niet meer standaard geïnstalleerd tijdens nieuwe installaties van &releasename;. Dit zal waarschijnlijk voor toekomstige releases worden hersteld.

source: <package>popcon</package> provides the Debian project with valuable information on which packages in the distribution are actually used. This information is used mainly to decide the order in which packages are included on installation CD-ROMs, but is also often consulted by Debian developers in deciding whether or not to adopt a package that no longer has a maintainer.
nl: <package>popcon</package> verschaft Debian met waardevolle informatie over welke pakketten in de distributie daadwerkelijk gebruikt worden. Deze informatie wordt hoofdzakelijk gebruikt voor het bepalen van de volgorde waarin pakketten worden opgenomen op installatie CD's, maar wordt ook vaak geraadpleegd door Debian ontwikkelaars bij beslissingen over het al dan niet adopteren van pakketten die niet langer worden beheerd.

source: Information from <package>popcon</package> is processed anonymously. We would appreciate it if you install the package and allow it to participate in the official survey; you will thereby help improve Debian.
nl: Gegevens afkomstig van <package>popcon</package> worden anoniem verwerkt. Het wordt zeer op prijs gesteld als u het pakket installeert en laat deelnemen aan de officiële steekproef; u helpt daarmee Debian te verbeteren.

source: It's wise to inform all users in advance of any upgrades you're planning, although users accessing your system via SSH (at least) shouldn't notice much during the upgrade, and may want to continue working. If you wish to take extra precautions, back up or unmount user's partitions (<file>/home</file>) before upgrading. A reboot will not normally be necessary, unless you plan to also upgrade your kernel.
nl: Het verdient aanbeveling om vooraf alle gebruikers te informeren over een geplande migratie. Echter, bijvoorbeeld gebruikers die via SSH toegang hebben tot uw systeem, hoeven niet al te veel van de migratie te merken en kunnen ervoor kiezen om gewoon door te werken. Als u extra voorzorgen wilt nemen, maak dan voor de migratie een reservekopie van de partitie met gebruikersgegevens (<file>/home</file>) of ontkoppel deze. Normaalgesproken zal het niet nodig zijn het systeem opnieuw op te starten, tenzij u besluit om ook de kernel op te waarderen.

source: The upgrade process described in this chapter has been designed for upgrades from "pure" &oldreleasename; systems. It assumes your system has been updated to the latest point release of &oldreleasename;. If you have not or are unsure, follow the instructions in <ref id="old-upgrade">.
nl: De procedure die in dit hoofdstuk wordt beschreven is ontwikkeld voor de migratie van "zuivere" &oldreleasename; systemen. Het gaat ervan uit dat uw systeem is opgewaardeerd tot de laatste tussenrelease van &oldreleasename;. Als u dat nog niet heeft gedaan of hiervan niet zeker bent, volg dan de instructies in <ref id="old-upgrade">.

source: It also assumes you have the &oldreleasename; version of <prgn>aptitude</prgn> installed. You can check if it is installed using <example compact="compact"> $ dpkg -l aptitude </example> If the line of output does <em>not</em> begin with "i", you should install it before you start the upgrade using the instructions in <ref id="old-aptitude">.
nl: Ook gaat het ervan uit dat de versie uit &oldreleasename; van <prgn>aptitude</prgn> is geïnstalleerd. U kunt controleren of dit het geval is met<example compact="compact"> $ dpkg -l aptitude </example>Als de uitvoerregel <em>niet</em> met "i" begint, dient u <package>aptitude</package> te installeren voordat u de migratie begint. Volg hiervoor de instructies in <ref id="old-aptitude">.

source: SGI IP22: set up arcboot
nl: SGI IP22: arcboot installeren

source: If you have an <em>SGI IP22</em> you should now prepare it to boot with <package>arcboot</package>, and not to boot the kernel directly. <package>arcboot</package> is available in &oldreleasename; so you can install it in the usual ways.
nl: Als u een <em>SGI IP22</em> heeft, dient u er nu voor te zorgen dat <package>arcboot</package> wordt gebruikt voor het opstarten van het systeem, in plaats van de kernel direct te laden. <package>arcboot</package> is beschikbaar in &oldreleasename; en kan dus op de gebruikelijke wijze worden geïnstalleerd.

source: Before you attempt to install <package>arcboot</package>, you should first check that entries in your <file>sources.list</file> still refer to &oldreleasename; as explained in <ref id="old-sources">.
nl: Voordat u echter <package>arcboot</package> probeert te installeren, dient u eerst te verifiëren dat de regels in uw <file>sources.list</file> nog altijd verwijzen naar &oldreleasename;. Instructies hiervoor vindt u in <ref id="old-sources">.

source: Regardless of the method used for upgrading, it is recommended that you check the status of all packages first, and verify that all packages are in an upgradable state. The following command will show any packages which have a status of Half-Installed or Failed-Config, and those with any error status. <example compact="compact"> # dpkg --audit </example>
nl: Ongeacht de methode die u gebruikt voor de migratie, wordt aangeraden dat u vooraf de status van alle pakketten controleert en nagaat dat alle pakketten opgewaardeerd kunnen worden. De volgende opdracht toont alle pakketten die een status 'Half-Installed' of 'Failed-Config' hebben alsmede de pakketten met een foutstatus: <example compact="compact"> # dpkg --audit </example>

source: You could also inspect the state of all packages on your system using <prgn>dselect</prgn>, <prgn>aptitude</prgn>, or with commands such as <example compact="compact"> # dpkg -l | pager </example> or <example compact="compact"> # dpkg --get-selections &gt; ~/curr-pkgs.txt </example>
nl: U kunt ook de status van alle pakketten controleren met behulp van <prgn>dselect</prgn>, <prgn>aptitude</prgn> of met opdrachten als <example compact="compact"> # dpkg -l | pager </example> of <example compact="compact"> # dpkg --get-selections &gt; ~/curr-pkgs.txt </example>

source: It is desirable to remove any holds before upgrading. If any package that is essential for the upgrade is on hold, the upgrade will fail. You can identify packages on hold with <example compact="compact"> # dpkg --get-selections | grep hold </example>
nl: Als u pakketten heeft met de 'hold'-status, is het wenselijk dat u deze vrijgeeft. Als een pakket dat essentieel is voor de migratie de 'hold'-status heeft, zal de migratie mislukken. U kunt pakketten die de 'hold'-status hebben identificeren met de opdracht: <example compact="compact"> # dpkg --get-selections | grep hold </example>

source: If you changed and recompiled a package locally, and didn't rename it or put an epoch in the version, you must put it on hold to prevent it from being upgraded. <![ %has-woody-aptitude [ The `hold' package state can be changed by using <prgn>aptitude</prgn>: <example compact="compact"> # aptitude hold | unhold &lt;package name&gt; </example> ]]> <![ %no-woody-aptitude [ The `hold' package state can be changed either by using <prgn>dselect</prgn> (in the Select menu, use the `H' and `G' keys to hold and unhold, respectively), or by editing the file produced by <example compact="compact"> # dpkg --get-selections &gt; ~/curr-sels.txt </example> to change "hold" to "install" (or vice versa), and then doing <example compact="compact"> # dpkg --set-selections &lt; ~/curr-sels.txt </example> ]]>
nl: Als u een pakket lokaal heeft gewijzigd en gecompileerd en het niet heeft hernoemd of een 'epoch' in de versie heeft opgenomen, dient u dit pakket op 'hold' te zetten om te voorkomen dat het wordt opgewaardeerd.<![ %has-woody-aptitude [De 'hold' status van een pakket kan worden gewijzigd met <prgn>aptitude</prgn>:<example compact="compact"> # aptitude hold | unhold &lt;package name&gt; </example>]]><![ %no-woody-aptitude [De 'hold' status van een pakket kan worden gewijzigd ofwel met <prgn>dselect</prgn> (gebruik de 'H' en 'G' toetsen in het 'Select' menu om respectievelijk de 'hold' status aan en uit te zetten) ofwel door met<example compact="compact"> # dpkg --get-selections &gt; ~/curr-sels.txt </example>een statusbestand te maken, daarin "hold" te wijzigen in "install" (of vice versa), en vervolgens dit bestand weer te laden met<example compact="compact"> # dpkg --set-selections &lt; ~/curr-sels.txt </example> ]]>

source: Checking kernel support
nl: Kernel ondersteuning controleren

source: All machines with a 64bit SPARC CPU (sun4u) should be upgradable without any special considerations about kernel support.
nl: Alle systemen met een 64-bit SPARC processor (sun4u) kunnen in beginsel worden opgewaardeerd zonder bijzondere aandacht voor kernel ondersteuning.

source: sun4c CPUs are <em>no longer supported</em> in &releasename;. The support for sun4d CPUs is in a rather unknown state since they are very rare. It is possible that sun4d CPUs with an MMU work.
nl: sun4c processoren worden <em> niet langer ondersteund</em> in &releasename;. De status van de ondersteuning voor sun4d processoren is onbekend omdat deze vrij zeldzaam zijn. Mogelijk dat sun4d processoren met een MMU werken.

source: sun4m CPUs are still supported but you need to install a newer kernel version first before upgrading the system. This is necessary because newer versions of glibc use assembler instructions not available on certain machines, so you need a updated kernel first that emulates the missing instructions.
nl: sun4m processoren worden nog ondersteund, maar u dient hiervoor wel, voor u het systeem migreert, een nieuwere kernel te installeren. Reden hiervoor is dat nieuwere versies van glibc assembler instructies gebruiken die op sommige systemen niet beschikbaar zijn; u heeft daarom eerst een aangepaste kernel nodig die de ontbrekende instructies emuleert.

source: Technically only <em>some</em> sun4m chips are affected, but as glibc can't reliably detect whether a system is affected it will refuse to be upgraded on any 32bit SPARC system before a fixed kernel is installed.
nl: Technisch gezien raakt dit slechts <em>sommige</em> sun4m chips, maar aangezien glibc niet in staat is om betrouwbaar te herkennen of een systeem hier wel of geen last van heeft, zal het de migratie afbreken op alle 32-bits SPARC-systemen als de kernel niet aangepast is.

source: For those interested in the gory details: some of the sun4m chips, produced by Cypress/ROSS, don't implement the <tt>umul</tt> instruction (RT601/CY7C601, same chip, only different names). They were used in the early SPARCserver 6xxMP models. Later models used chips manufactured by TI. Currently we don't know if these are also affected.
nl: Voor diegenen die geïnteresseerd zijn in de technische details: sommige sun4m processoren (geproduceerd door Cypress/ROSS) kennen instructie <tt>umul</tt> niet (RT601/CY7C60; identieke chip maar andere naam). Ze werden gebruikt in de vroege SPARCserver 6xxMP modellen. In latere modellen zijn chips gebruikt afkomstig van TI. Op dit moment weten we niet of dit probleem ook van toepassing is op deze chips.

source: On 64bit HPPA machines you will need to upgrade to a newer kernel version first before upgrading the system. This is necessary because newer versions of glibc use assembler instructions not available on certain machines, so you need an updated kernel first that emulates the missing instructions.
nl: Op 64-bit HPPA systemen zult u, voordat u uw systeem migreert, eerst uw kernel naar een nieuwere versie moeten opwaarderen. Reden hiervoor is dat nieuwere versies van glibc assembler instructies gebruiken die op sommige systemen niet beschikbaar zijn; u heeft daarom eerst een aangepaste kernel nodig die de ontbrekende instructies emuleert.

source: True "80386" CPUs are <em>no longer supported</em> by &releasename;. This does not affect any CPUs that are compatible with "80486" CPUs or above.
nl: Echte "80386" processoren worden in &releasename; <em>niet meer ondersteund</em>. Dit is niet van toepassing op processoren die compatibel zijn met "80486" processoren of hoger.

source: If (and only if) the previous section indicates that you should upgrade your kernel <em>before</em> the upgrade of the system, you should do so now.
nl: Als (en alleen als) in de voorgaande paragraaf is aangegeven dat u uw kernel dient op te waarderen <em>voor</em> de migratie van de rest van het systeem, is dit het moment om dit te doen.

source: Backports are available of all tools needed to install the current kernel from &releasename;. Detailed instructions on how to install the new kernel can be found in <ref id="kernel-upgrade-howto">.
nl: Voor alle hulpprogramma's nodig om een courante kernel uit &releasename; te installeren, zijn speciaal geprepareerde pakketten ("backports")beschikbaar. Gedetailleerde instructies voor het installeren van de nieuwe kernel vindt u in <ref id="kernel-upgrade-howto">.

source: For example, suppose your closest Debian mirror is <tt>&url-debian-mirror-eg;/</tt>. When inspecting that mirror with a web browser or FTP program, you will notice that the main directories are organized like this: <example compact="compact"> &url-debian-mirror-eg;/dists/&releasename;/main/binary-&architecture;/... &url-debian-mirror-eg;/dists/&releasename;/contrib/binary-&architecture;/... </example>
nl: Een voorbeeld. Stel dat de dichtstbij zijnde Debian spiegelserver <tt>&url-debian-mirror-eg;/</tt> is. Als u die server bekijkt met een webbrowser of een FTP-programma, zult u zien dat de hoofdmappen als volgt zijn ingedeeld: <example compact="compact"> &url-debian-mirror-eg;/dists/&releasename;/main/binary-&architecture;/... &url-debian-mirror-eg;/dists/&releasename;/contrib/binary-&architecture;/... </example>

source: To use this mirror with <prgn>apt</prgn>, you add this line to your <file>sources.list</file> file: <example compact="compact"> deb &url-debian-mirror-eg; &releasename; main contrib </example>
nl: Om met <prgn>apt</prgn> gebruik te maken van deze spiegelserver, voegt u de volgende regel toe in uw <file>sources.list</file> bestand: <example compact="compact"> deb &url-debian-mirror-eg; &releasename; main contrib </example>

source: For example, your packages mirror may be under <file>/var/ftp/debian/</file>, and have main directories like this: <example compact="compact"> /var/ftp/debian/dists/&releasename;/main/binary-&architecture;/... /var/ftp/debian/dists/&releasename;/contrib/binary-&architecture;/... </example>
nl: Een voorbeeld. Stel dat u een Debian archief heeft onder <file>/var/ftp/debian/</file> en daaronder de volgende hoofdmappen: <example compact="compact"> /var/ftp/debian/dists/&releasename;/main/binary-&architecture;/... /var/ftp/debian/dists/&releasename;/contrib/binary-&architecture;/... </example>

source: To use this with <prgn>apt</prgn>, add this line to your <file>sources.list</file> file: <example compact="compact"> deb file:/var/ftp/debian &releasename; main contrib </example>
nl: Voeg in <file>sources.list</file> de volgende regel toe om hiervan met <prgn>apt</prgn> gebruik te maken: <example compact="compact"> deb file:/var/ftp/debian &releasename; main contrib </example>

source: Make sure there is a line in <file>/etc/fstab</file> that enables mounting your CD-ROM drive at the <file>/cdrom</file> mount point (the exact <file>/cdrom</file> mount point is required for <prgn>apt-cdrom</prgn>). For example, if <file>/dev/hdc</file> is your CD-ROM drive, <file>/etc/fstab</file> should contain a line like: <example compact="compact"> /dev/hdc /cdrom auto defaults,noauto,ro 0 0 </example>
nl: Controleer dat er een regel in <file>/etc/fstab</file> aanwezig is die het mogelijk maakt om u CD-eenheid aan te koppelen op aanhechtpunt <file>/cdrom</file> (dit aanhechtpunt is noodzakelijk voor <prgn>apt-cdrom</prgn>). Als bijvoorbeeld <file>/dev/hdc</file> uw CD-eenheid is, dient <file>/etc/fstab</file> een regel te bevatten als:<example compact="compact"> /dev/hdc /cdrom auto defaults,noauto,ro 0 0 </example>

source: To verify it works, insert a CD and try running <example compact="compact"> # mount /cdrom # this will mount the CD to the mount point # ls -alF /cdrom # this should show the CD's root directory # umount /cdrom # this will unmount the CD </example>
nl: Om te verifiëren dat dit werkt kunt u een CD laden en proberen de volgende opdrachten uit te voeren:<example compact="compact"> # mount /cdrom #koppelt de CD aan op het aanhechtpunt # ls -alF /cdrom #zou de inhoud van de hoofdmap van de CD moeten tonen # umount /cdrom #ontkoppelt de CD </example>

source: Next, run: <example compact="compact"> # apt-cdrom add </example> for each Debian Binary CD-ROM you have, to add the data about each CD to APT's database.
nl: Geef vervolgens de volgende opdracht:<example compact="compact"> # apt-cdrom add </example>voor elke Debian CD met installeerbare pakketten ('Binary CD') om de lijsten met de op de diverse CD's beschikbare pakketten toe te voegen aan de database van APT.

source: The recommended tool for upgrading between &debian; releases is to use the package management tool <prgn>aptitude</prgn>. This tool makes safer decisions about package installations than running <prgn>apt-get</prgn> directly.
nl: De toepassing voor pakketbeheer <prgn>aptitude</prgn> heeft de voorkeur voor de migratie van de ene &debian; release naar de volgende. Deze toepassing neemt veiligere beslissingen over de installatie van pakketten dan wanneer u <prgn>apt-get</prgn> rechtstreeks uitvoert.

source: Don't forget to mount all needed partitions (notably the root and <file>/usr</file> partitions) read-write, with a command like: <example compact="compact"> # mount -o remount,rw /<var>mountpoint</var> </example>
nl: Vergeet niet om alle benodigde partities (met name root en <file>/usr</file>) met lees- en schrijfrechten aan te koppelen, bijvoorbeeld met <example compact="compact"> # mount -o remount,rw /<var>mountpoint</var> </example>

source: It is strongly recommended that you use the <prgn>/usr/bin/script</prgn> program to record a transcript of the upgrade session. Then if a problem occurs, you will have a log of what happened, and if needed, can provide exact information in a bug report. To start the recording, type: <example compact="compact"> # script -a ~/upgrade-to-&releasename;.typescript </example> or similar. Do not put the typescript file in a temporary directory such as <file>/tmp</file> or <file>/var/tmp</file> (files in those directories may be deleted during the upgrade or during any restart).
nl: Het wordt sterk aanbevolen om het programma <prgn>/usr/bin/script</prgn> te gebruiken om een log te maken van wat er gebeurt tijdens de migratie. Als er dan problemen ontstaan, kunt u, indien nodig, hieruit exacte informatie bijvoegen in een probleemrapport. Geef de volgende, of een vergelijkbare, opdracht om te beginnen met het opnemen van het log:<example compact="compact"> # script -a ~/upgrade-to-&releasename;.typescript </example>Bewaar dit logbestand niet in een tijdelijke map als <file>/tmp</file> of <file>/var/tmp</file> (bestanden in deze mappen kunnen worden gewist tijdens de migratie of bij een herstart van de computer).

source: The typescript will also allow you to review information that has scrolled off-screen. Just switch to VT2 (using <tt>alt-F2</tt>) and, after logging in, use <tt>less ~root/upgrade-to-&releasename;.typescript</tt> to view the file.
nl: Het logbestand stelt u ook in staat om informatie die al van het scherm af is gerold alsnog te bekijken. Schakel hiervoor naar VT2 (met <tt>alt-F2</tt>) en gebruik, nadat u bent aangelogd, <tt>less ~root/upgrade-to-&releasename;.typescript</tt> om het bestand te bekijken.

source: After you have completed the upgrade, you can stop <prgn>typescript</prgn> by typing <tt>exit</tt> at the prompt.
nl: Nadat de migratie is voltooid, kunt u <prgn>typescript</prgn> stoppen met het commando <tt>exit</tt>.

source: On &arch-title; machines you will need to upgrade to a newer kernel version first before upgrading the system. This is necessary because of a inconsistent definition of the inter process communication of the new libc and the kernel, so you need an updated kernel that provides the correct definition first.
nl: Op &arch-title; systemen zult u, voor u uw systeem verder migreert, eerst uw kernel naar een nieuwere versie moeten opwaarderen. Reden hiervoor is een inconsistentie tussen de nieuwe libc en de kernel in de definitie van de communicatie tussen processen. U heeft daarom eerst een aangepaste kernel nodig die de juiste definities bevat.

source: Detailed instructions on how to install the new kernel can be found in <ref id="kernel-upgrade-howto">.
nl: Gedetailleerde instructies voor het installeren van de nieuwe kernel vindt u in <ref id="kernel-upgrade-howto">.

source: Installing aptitude
nl: Het pakket aptitude installeren

source: Upgrade tests have shown that &releasename;'s version of <prgn>aptitude</prgn> is better at solving the complex dependencies during an upgrade than either <prgn>apt-get</prgn> or &oldreleasename;'s <prgn>aptitude</prgn>. <![ %has-woody-aptitude [ It should therefore be upgraded first using: <example compact="compact"> # aptitude install aptitude </example>
nl: Tijdens migratietests is gebleken dat de versie van <prgn>aptitude</prgn> uit &releasename;'s beter is in het oplossen van de complexe afhankelijkheden tijdens de migratie dan zowel <prgn>apt-get</prgn> als de versie van <prgn>aptitude</prgn> uit &oldreleasename;'s. <![ %has-woody-aptitude [Het dient daarom te worden opgewaardeerd met:<example compact="compact"> # aptitude install aptitude </example>

source: Upgrading doc-base
nl: Het pakket doc-base opwaarderen

source: <em>If you have <package>doc-base</package> installed</em>, it must be upgraded before the rest of the system too. Reason is that it may fail if <package>perl</package> is upgraded at the same time. You can find out if it is installed using:
nl: <em>Als het pakket <package>doc-base</package> is geïnstalleerd</em>, dan moet ook dit worden opgewaardeerd voor de rest van het systeem. Reden is dat dit pakket fouten kan veroorzaken als het tegelijk met <package>perl</package> wordt opgewaardeerd. U kunt nagaan of het is geïnstalleerd met:

source: If the line of output begins with "i" then it is installed and must be upgraded before continuing.
nl: Als de uitvoerregel begint met "i", dan is het geïnstalleerd en dient het te worden opgewaardeerd voor u verder gaat.
