Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: Because of display problems on some systems, framebuffer support is disabled by default for &arch-title; for most graphics cards. This can result in ugly display on systems that do properly support the framebuffer. If you see display problems in the installer, you can try booting the installer with the parameter <tt>framebuffer=true</tt>. Please let us know if the framebuffer is not used by default, but works for your hardware.
ja: 一部のシステムで表示に問題があるため、&arch-title; においては、大部分のグラフィックカードでフレームバッファのサポートがデフォルトで無効になっています。そのため、フレームバッファをきちんとサポートしているシステムにおいては、表示が醜くなる可能性があります。インストーラの表示に問題が見られる場合は、<tt>framebuffer=true</tt> をパラメータとして与えて、インストーラを起動してみてください。フレームバッファがデフォルトでは使われないにもかかわらずあなたのハードウェアで有効になってしまっている場合は、どうぞ私たちに教えてください。
pt: Devido aos problemas de visualização em alguns sistemas, o suporte ao 'framebuffer' está por omissão desactivado para a maioria das placas gráficas de &arch-title;. Pode assim resultar numa má visualização em sistemas que suportem devidamente o 'framebuffer'. Se detectar problemas com a visualização no instalador pode tentar arrancar o mesmo com o parâmetro <tt>framebuffer=true</tt>. Por favor avise-nos se o 'framebuffer' não for utilizado por omissão, mas funcione correctamente no seu hardware.
ru: Так как на некоторых системах использование framebuffer вызывало проблемы, на архитектуре &arch-title; его поддержка отключена по умолчанию для большинства видеокарт. Из-за этого на машинах, где framebuffer поддерживается, текст на экране может выглядеть плохо. Если у вас возникли проблемы с отображением в программе установки, попробуйте загрузить программу установки с параметром <tt>framebuffer=true</tt>. Сообщите нам, если framebuffer не выключен по умолчанию, но хорошо работает на вашем компьютере.
sv: På grund av skärmproblem på vissa system, är stödet för "framebuffer" som standard inaktiverat för de flesta grafikkort för &arch-title;. Det här kan innebära en mindre fin skärmvisning på system som har bra stöd för "framebuffer". Om du upplever skärmproblem i installeraren, kan du prova att starta upp installeraren med parametern <tt>framebuffer=true</tt>. Informera oss om din "framebuffer" inte används som standard, men fungerar för din hårdvara.
zh_cn: 由于在某些系统上会有显示上的问题，所以在 &arch-title; 里，大多的显示卡默认上是不使用 framebuffer 的。这会使得一些对 framebuffer 支持良好的系统上的显示效果变差。如果您在安装程序里遇到了显示上的问题，您可以试着加上 <tt>framebuffer=true</tt> 这个参数来启动安装程序。如果您的硬件在默认上并不使用 framebuffer 但却能正常运作，请告知我们。

source: System improvements
ja: システムの改良
zh_cn: 系统改善

source: inetd: new default is OpenBSD's
ja: inetd: OpenBSD のものが新たなデフォルトになりました
zh_cn: inetd: 现在默认是采用 OpenBSD 的

source: vi: the variant installed by default is a compact version of <prgn>vim</prgn> (<package>vim-tiny</package>) instead of <package>nvi</package>
ja: vi: デフォルトでインストールされるバリアントが、<package>nvi</package> から <prgn>vim</prgn> のコンパクトバージョン (<package>vim-tiny</package>) に変わりました

source: mail server setup for local delivery per default (sarge users retain their config)
ja: メールサーバのセットアップにおいてローカルの配送がデフォルトとなりました (sarge のユーザの設定はそのまま保持されます)

source: development packages now priority optional, will not get installed (#301138), sarge users need to manually remove gcc, binutils et al
ja: 開発用パッケージの優先度が任意 (optional) になり、インストールされなくなりました (#301138)。sarge のユーザは gcc や binutils などを手動で削除する必要があります

source: new standard task in tasksel installs all packages of priority standard and higher
ja: tasksel のインストールにおいて新たに加わった標準のタスクは、優先度が標準 (standard) 以上のパッケージをすべてインストールします
zh_cn: 在 tasksel 中的 Standard 主题现在将会安装所有优先权为标准或以上的软件包

source: filesystem improvements, see wiki
ja: ファイルシステムが改良されました。Wiki を参照してください

source: packages pulled in for laptops
ja: パッケージのインストール時にラップトップ向けのパッケージが引き込まれるようになりました
zh_cn: 笔记本电脑会安装的软件包

source: Regressions
ja: 改悪

source: localization-config NOT installed by d-i, actually not available in etch (#402566). Some i18n/l10n steps need to be done manually (such as installing some packages based on locale).
ja: localization-config が d-i によってインストール *されなく* なりました。実際には、etch ではパッケージが存在しません (#402566)。国際化 (i18n) や地域化 (l10n) の一部の手続き (ロケールに応じたいくつかのパッケージのインストールなど) は手動で実施する必要があります。

source: Popularity contest
ja: 人気コンテスト
nl: Populariteitsmeting
pt: Concurso de popularidade
ru: Частота использования пакетов
sv: Popularitetstävling
zh_cn: 热门软件包竞赛

source: The installation system will again offer to install the <package>popularity-contest</package> package. This package was not installed by default in &oldreleasename; but it was installed in older releases.
ja: インストールシステムが昔のように <package>popularity-contest</package> パッケージをインストールするよう提案します。このパッケージは &oldreleasename; にはデフォルトではインストールされませんでしたが、それより前のリリースではインストールされていました。
zh_cn: 安装系统将会再次安装 <package>popularity-contest</package> 软件包。在 &oldreleasename; 里，默认上并不会安装这个软件包，但会在更旧的系统上被安装。

source: <package>popularity-contest</package> provides the Debian project with valuable information on which packages in the distribution are actually used. This information is used mainly to decide the order in which packages are included on installation CD-ROMs, but is also often consulted by Debian developers in deciding whether or not to adopt a package that no longer has a maintainer.
ja: <package>popularity-contest</package> は、ディストリビューション内のどのパッケージが実際に使われているかについての有益な情報を、Debian プロジェクトに提供してくれます。この情報は、主にインストール CD-ROM に収録されるパッケージの優先順位を決めるために使われますが、Debian 開発者がもはやメンテナのいないパッケージを引き受けるかどうかを決める際にもよく参照されます。
pt: O <package>popularity-contest</package> fornece informação valiosa ao Projecto Debian sobre quais os pacotes na distribuição que estão actualmente em uso. Esta informação é usada principalmente para decidir a ordem de inclusão dos mesmos em CD-ROMs de instalação, mas também para ser consultada por Debian 'developers' para decidirem a adopção ou não de um pacote que deixa de possuir um 'maintainer'.
ru: <package>popularity-contest</package> снабжает проект Debian ценной информацией о том, какие пакеты дистрибутива действительно используются. Эта информация не только влияет на то, в каком порядке пакеты пакеты будут расположены на установочных компакт-дисках, но и используется разработчиками Debian для принятия решения о продолжении/прекращении поддержки пакетов, у которых больше нет сопровождающих.
sv: <package>popularity-contest</package> tillhandahåller värdefull information till Debian-projektet om vilka paket i distributionen som faktiskt används. Den här informationen används huvudsakligen för att bestämma ordningen i vilken paket inkluderas på installationsskivorna, men används också ofta av Debians utvecklare för att bestämma huruvida ett paket som saknar en paketansvarig ska adopteras eller inte.
zh_cn: <package>popularity-contest</package> 能够向 Debian 专案提供在发行版中哪些软件包正在被使用着的这个极有价值信息。这个信息主要是用来决定该将哪些软件包放入安装光盘的优先顺序。而且 Debian 的开发者也常常根据它的报告来决定是否该放弃某个已经没有维护者的软件包。

source: Information from <package>popularity-contest</package> is processed anonymously. We would appreciate it if you would participate in this official survey; you will thereby help improve Debian.
ja: <package>popularity-contest</package> からの情報は、匿名で処理されます。公式調査に参加して頂けると感謝します。というのもそれにより、Debian の改良を手伝って頂けることになるからです。
pt: A informação do <package>popularity-contest</package> é processada de modo anónimo. Ficaríamos muito agradecidos se pudesse participar neste inquérito oficial; estará deste modo a ajudar na melhoria da Debian.
ru: Информация, собранная <package>popularity-contest</package>, обрабатывается анонимно. Мы будем вам очень благодарны, если вы установите этот пакет и примете участие в этом официальном опросе, этим вы поможете Debian.
sv: Informationen från <package>popularity-contest</package> behandlas anonymt. Vi skulle uppskatta om du vill deltaga i den officiella kartläggningen; du kan på så sätt hjälpa till att förbättra Debian.
zh_cn: 由 <package>popularity-contest</package> 所提交的报告是匿名进行的。如果您能参与这个官方的调查工作，对我们将是极大的帮助；而您也能够藉此来促使 Debian 的进步。

source: Upgrades from previous releases
ja: 以前のリリースからアップグレードする
nl: Migreren vanaf een eerdere release
pt: Actualizações a partir de lançamentos anteriores
ru: Обновление с предыдущих выпусков
sv: Uppgraderingar från tidigare utgåvor
zh_cn: 从先前的发行版进行升级

source: Preparing for the upgrade
ja: アップグレードの準備
nl: De migratie voorbereiden
pt: Preparar para a actualização
ru: Подготовка к обновлению
sv: Förberedelse inför uppgraderingen
zh_cn: 系统升级的准备事项

source: We suggest that before upgrading you also read the information in <ref id="information">. That chapter covers potential issues not directly related to the upgrade process but which could still be relevant.
ja: アップグレードの前には、<ref id="information"> に書かれている情報も読むことをお勧めします。この章は、アップグレードの過程と直接ではなくても関連する可能性がある、生じうる問題点について書かれています。
pt: Sugerimos que antes de actualizar o sistema, leia a informação em <ref id="information">. Esse capítulo cobre problemas potenciais não directamente relacionados com o processo de actualização, mas podem no entanto ser relevantes.
ru: Перед обновлением мы рекомендуем вам прочитать <ref id="information">. В этом разделе дано описание потенциальных проблем, которые не имеют прямого отношения к процессу обновления, но всё же оно будет не лишним.
sv: Vi föreslår att du läser informationen i <ref id="information"> innan du uppgraderar. Det kapitlet täcker in möjliga problem som inte direkt relaterar till uppgraderingsprocessen men som fortfarande kan vara relevanta.
zh_cn: 在进行升级之前，我们建议您能同时参阅 <ref id="information"> 所提供的信息。在那个章节里包含了一些和升级程序无直接相关的可能潜在的相关问题。

source: Before upgrading your system, it is strongly recommended that you make a full backup, or at least backup any data or configuration information you can't afford to lose. The upgrade tools and process are quite reliable, but a hardware failure in the middle of an upgrade could result in a severely damaged system.
ja: システムをアップグレードする前に、完全なバックアップを取っておくよう強くお勧めします。少なくとも、失いたくないデータや設定情報だけでもバックアップしておきましょう。アップグレードのツールや処理はきわめて信頼性の高いものですが、アップグレードの最中にハードウェア障害が起こると、システムに大きなダメージを与えることがありえます。
nl: Voordat u uw systeem migreert, wordt u dringend aangeraden een volledige reservekopie te maken, of tenminste van alle gegevens en configuratie-informatie die u niet wilt verliezen. Het migratieproces en de daarbij gebruikte hulpmiddelen zijn behoorlijk betrouwbaar, maar een storing in uw apparatuur gedurende de migratie kan resulteren in een ernstig beschadigd systeem.
pt: Antes de actualizar o seu sistema é fortemente recomendado que efectue um cópia de segurança total, ou pelo menos salvaguardar quaisquer dados ou informações de configuração que não esteja disposto a perder. As ferramentas de actualização e o processo são bastante fiáveis, mas uma falha de hardware durante a actualização poderia resultar num sistema extremamente danificado.
ru: Перед обновлением настоятельно рекомендуется сделать резервную копию всей системы или, по крайней мере, всех данных и настроек, которые вы не хотите потерять. Инструменты для обновления и сам процесс достаточно надёжны, но сбой аппаратного обеспечения в ходе обновления может привести к серьёзному повреждению системы.
sv: Innan du uppgraderar ditt system, rekommenderas det starkt att du gör en fullständig säkerhetskopia, eller åtminstone en säkerhetskopia av de data eller den konfiguration som du inte vill riskera att förlora. Uppgraderingsverktygen är ganska tillförlitliga, men ett hårdvarufel mitt i en uppgradering kan resultera i ett allvarligt skadat system.
zh_cn: 在升级您的系统之前，我们强烈建议您能进行一次完整的备份，或至少您也应该把那些绝对不能出任何差错的资料和设置信息给备份起来。升级时所使用的工具和升级过程应该不会出什么差错，但在升级过程中若发生了什么硬件错误可能会导致系统严重受损。

source: The main things you'll want to back up are the contents of <file>/etc</file>, <file>/var/lib/dpkg</file> and the output of <tt>dpkg --get-selections "*"</tt> (the quotes are important).
ja: バックアップしたくなるであろう主な対象としては、<file>/etc</file> や <file>/var/lib/dpkg</file> の中身、<tt>dpkg --get-selections "*"</tt> (引用符を忘れてはいけません) の出力などでしょう。
nl: De belangrijkste zaken om een reservekopie van te maken zijn: de inhoud van <file>/etc</file>, <file>/var/lib/dpkg</file> en de uitvoer van <tt>dpkg --get-selections "*"</tt> (de aanhalingstekens zijn belangrijk).
pt: A principal informação que quererá salvaguardar é o conteúdo de <file>/etc</file>, <file>/var/lib/dpkg</file> e saída de <tt>dpkg --get-selections "*"</tt> (as aspas são importantes).
ru: В первую очередь необходимо сохранить резервные копии содержимого каталогов <file>/etc</file> и <file>/var/lib/dpkg</file>, а также вывод команды <tt>dpkg --get-selections "*"</tt> (кавычки необходимы).
sv: De huvudsakliga delar du vill säkerhetskopiera är innehållet i <file>/etc</file>, <file>/var/lib/dpkg</file> och utdata från <tt>dpkg --get-selections "*"</tt> (citationstecknen är viktiga).
zh_cn: 您可能会想进行备份的内容主要包括了 <file>/etc</file> 目录和 <file>/var/lib/dpkg</file> 目录中的内容，以及 <tt>dpkg --get-selections "*"</tt>（请别忘了双引号）所输出的信息。

source: The upgrade process in itself does not modify anything in the <file>/home</file> directory. However, some applications (e.g. parts of the Mozilla suite, and the GNOME and KDE desktop environments) are known to overwrite existing user settings with new defaults when a new version of the application is first started by a user. As a precaution, you may want to make a backup of the hidden files and directories ("dotfiles") in users' home directories. This backup may help to restore or recreate the old settings. You may also want to inform users about this.
ja: アップグレードの過程では、<file>/home</file> ディレクトリ以下は一切変更されません。とはいえ、(Mozilla スイートの一部や GNOME や KDE のデスクトップ環境などのように) ユーザが初めて新しいバージョンのアプリケーションを起動するときに、既存のユーザ設定を新たなデフォルト値で上書きしてしまうものがあるのも事実です。万一に備えて、ユーザのホームディレクトリにある隠しファイルと隠しディレクトリ (いわゆる「ドットファイル」) をバックアップしておくのがよいでしょう。古い状態に戻したり、再度設定する場合に役立つはずです。ユーザにもこのことについて知らせておいてください。
pt: O processo de actualização enquanto decorre não altera nada no seu directório <file>/home</file>. No entanto, algumas aplicações (por exemplo artes do conjunto Mozilla, e os ambientes de desktop GNOME e KDE) são conhecidas por sobreporem as definições pessoais existentes pelas novas definições por omissão quando uma nova versão da aplicação é iniciada pela primeira vez por um utilizador. Como precaução, pode querer uma cópia de segurança dos ficheiros e directório escondidos ("dotfiles") nos directórios dos utilizadores. Esta cópia de segurança pode ajudá-lo a recuperar ou recriar as antigas definições. Pode também querer informar os utilizadores sobre isto.
ru: Само по себе обновление никак не затрагивает каталог <file>/home</file>, но некоторые приложения (в частности, некоторые приложения Mozilla, GNOME и KDE) при первом запуске новой версии перезаписывают пользовательские настройки настройками "по умолчанию". На всякий случай стоит сделать резервную копию скрытых файлов и каталогов ("точечные файлы") в домашних каталогах пользователей. Это поможет вам затем восстановить старые настройки в случае необходимости. Не лишним будет предупредить пользователей об этой проблеме.
sv: Själva uppgraderingsprocessen ändrar ingenting i katalogen <file>/home</file>. Dock är det känt att vissa program (exempelvis delar av Mozilla-sviten, och skrivbordsmiljöerna GNOME och KDE) skriver över befintliga användarinställningar med nya standardvärden när en ny version av programmet startas för första gången av en användare. Som en försiktighetsåtgård kanske du vill göra en säkerhetskopia av de dolda filerna och katalogerna ("punktfiler") i användarnas hemkataloger. Den säkerhetskopian kan hjälpa till att återställa eller återskapa de gamla inställningarna. Du kanske även vill informera dina användare om det här.
zh_cn: 这个升级的程序它本身并不会修改在 <file>/home</file> 目录里的任何资料，但是已知有某些应用程序（例如：部份的 Mozilla 家族程序及 GNOME、KDE 桌面环境）在用户第一次以新的版本启动时，会以新的默认值覆盖用户原有的设置。为了以防万一，您也许想要针对在用户的主目录里的隐藏文件及目录（"dotfiles"，以 . 开头的档案或目录）进行备份。这个备份可以用来回复或重新建立旧有的设置。您也许有必要让用户知道有这个问题存在。

source: It's wise to inform all users in advance of any upgrades you're planning, although users accessing your system via an <prgn>ssh</prgn> connection should notice little during the upgrade, and should be able to continue working. If you wish to take extra precautions, back up or unmount users' partitions (<file>/home</file>) before upgrading. A reboot will not normally be necessary, unless you also plan to upgrade your kernel.
ja: アップグレードの前には、その予定をすべてのユーザに知らせるとよいでしょう。しかしシステムに <prgn>ssh</prgn> 接続などでアクセスしてきているユーザは、アップグレードの最中にそうと気付くことはほとんどないはずですし、作業を続行できるはずです。万一の用心をしたければ、アップグレードの前にユーザのパーティション (<file>/home</file>) をバックアップして、アンマウントしてしまいましょう。同時にカーネルもアップグレードする場合を除いて、通常は再起動は必要ないでしょう。
pt: É sensato informar todos os utilizadores de antemão sobre qualquer actualização que estiver a planear, apesar dos utilizadores que estejam a aceder ao sistema via uma ligação <prgn>ssh</prgn> pouco ou nada notem durante esta actualização, e possam continuar a trabalhar. Se desejar tomar precauções extra, efectue uma cópia de segurança e desmonte as partições dos utilizadores (<file>/home</file>) antes de actualizar. Normalmente não é necessária uma reinicialização do sistema, a não ser que planeie actualizar o seu kernel.
ru: Желательно заранее сообщить всем пользователям обо всех планируемых обновлениях, хотя пользователи, работающие в системе через <prgn>ssh</prgn>, не должны испытать особых проблем в процессе обновления и вполне могут продолжать работу. Если вы хотите принять дополнительные меры предосторожности, создайте резервную копию каталога с файлами пользователей (<file>/home</file>) или перед обновлением размонтируйте раздел, где он расположен. Перезагрузка после обновления не потребуется, если вы, конечно, не планируете обновление ядра системы.
sv: Det är bra att informera alla användare i förväg angående de uppgraderingar som du planerar att göra, även om användarna som kommer åt ditt system via en <prgn>ssh</prgn>-anslutning knappt kommer att märka det under uppgraderingen, och bör kunna fortsätta att arbeta som vanligt. Om du vill kan du säkerhetskopiera eller avmontera användarnas partitioner (<file>/home</file>) innan uppgraderingen som en extra försiktighetsåtgärd. En omstart är normalt sett inte nödvändligt, såvida du inte planerar att även uppgradera din kärna.
zh_cn: 您应该在进行任何升级之前先把您的计划告知所有用户，虽然一些像是利用 <prgn>ssh</prgn> 连线来从远程访问系统的用户在升级过程中可能不会发现什么异状，且他们的工作也应该不会因而中断。如果您希望能采取额外的预防措施的话，请在升级前备份或卸载用户的分区 (<file>/home</file>)。除非您计划同时进行内核的升级，否则您在升级前后通常并不需要重新开机。

source: Distribution upgrade should be done either locally from a textmode virtual console (or a directly connected serial terminal), or remotely via an <prgn>ssh</prgn> link.
ja: ディストリビューションのアップグレードは、ローカルのテキストモードの仮想コンソール (あるいは直接接続されたシリアル端末) から行うか、リモートなら <prgn>ssh</prgn> 接続経由で行いましょう。
nl: Het migreren van de distributie dient te gebeuren ofwel lokaal vanaf een niet-grafische virtuele terminal (of een direct verbonden seriële terminal), ofwel op afstand via een <prgn>ssh</prgn>-verbinding.
pt: A actualização da distribuição deve ser efectuada localmente a partir de uma consola virtual de texto (ou directamente ligada a um terminal 'serial'), ou remotamente através de uma ligação <prgn>ssh</prgn>.
ru: Обновление дистрибутива возможно как с локальной консоли (или подключённого напрямую последовательного терминала), так и через удалённое подключение <prgn>ssh</prgn>.
sv: Uppgradering av distributionen bör göras antingen lokalt från en virtuell textkonsoll (eller en direktansluten serieterminal), eller från ett fjärrsystem via en <prgn>ssh</prgn>-länk.
zh_cn: 您应该在本机透过文字模式的虚拟控制台（或直接连线的序列终端机）、或由远程透过 <prgn>ssh</prgn> 连线来进行升级至发行版的动作。

source: <strong>Important!</strong> You should <em>not</em> upgrade using <prgn>telnet</prgn>, <prgn>rlogin</prgn>, <prgn>rsh</prgn>, or from an X session managed by <prgn>xdm</prgn>, <prgn>gdm</prgn> or <prgn>kdm</prgn> etc on the machine you are upgrading. That is because each of those services may well be terminated during the upgrade, which can result in an <em>inaccessible</em> system that is only half-upgraded.
ja: <strong>重要!</strong> <prgn>telnet</prgn>、<prgn>rlogin</prgn>、<prgn>rsh</prgn> を用いてアップグレードをしては<em>いけません</em>。アップグレードマシンの <prgn>xdm</prgn>、<prgn>gdm</prgn>、<prgn>kdm</prgn> などが管理している X セッションからのアップグレードも行うべきではありません。これらのサービスはアップグレードの最中に切断されてしまう可能性が高く、するとアップグレード途中のシステムへの<em>接続が不可能になってしまう</em>からです。
nl: <strong>Belangrijk</strong>: Het is <em>niet</em> mogelijk om de migratie uit te voeren via <prgn>telnet</prgn>, <prgn>rlogin</prgn>, <prgn>rsh</prgn>, of vanuit een X-sessie die wordt beheerd door <prgn>xdm</prgn>, <prgn>gdm</prgn>, <prgn>kdm</prgn> of dergelijke op de machine die u wilt migreren. Reden hiervoor is dat er een grote kans is dat elk van deze diensten tijdens de migratie opnieuw zal worden gestart, wat kan resulteren in een <em>ontoegankelijk</em> systeem dat slechts half is opgewaardeerd.
pt: <strong>Importante!</strong> <em>Não</em> deve actualizar através de <prgn>telnet</prgn>, <prgn>rlogin</prgn>, <prgn>rsh</prgn>, ou a partir de uma sessão X gerida por <prgn>xdm</prgn>, <prgn>gdm</prgn> ou <prgn>kdm</prgn> etc na máquina que estiver a actualizar. Isto porque cada um dos serviços podem ser terminados durante esta actualização, o que pode resultar num sistema <em>inacessível</em> que ficou apenas com a actualização a meio.
ru: <em>Внимание!</em> <em>Ни в коем случае</em> не обновляйте систему через <prgn>telnet</prgn>, <prgn>rlogin</prgn>, <prgn>rsh</prgn> или из графического сеанса под управлением <prgn>xdm</prgn>, <prgn>gdm</prgn>, <prgn>kdm</prgn> и т.д., запущенного на обновляемой системе. Это связано с тем, что все эти серверы могут быть перезапущены при обновлении, что может привести к <em>недоступности</em> системы, обновлённой только наполовину.
sv: <strong>Viktigt!</strong> Du bör <em>inte</em> uppgradera via <prgn>telnet</prgn>, <prgn>rlogin</prgn>, <prgn>rsh</prgn>, eller från en X-session som hanteras av <prgn>xdm</prgn>, <prgn>gdm</prgn> eller <prgn>kdm</prgn> etc, på maskinen som du uppgraderar. Det är på grund av att de processer som hanterar dessa tjänster kan avslutas under uppgraderingen, vilket kan resultera i ett <em>oåtkomligt</em> system som endast är halvt uppgraderat.
zh_cn: <strong>极重要！</strong>您<em>不应该</em>透过 <prgn>telnet</prgn>、<prgn>rlogin</prgn>、<prgn>rsh</prgn>，或是由您要进行升级的机器上的 <prgn>xdm</prgn>、<prgn>gdm</prgn> 或 <prgn>kdm</prgn> 等等所管理的 X 行程来进行升级。这是因为这些服务在升级的过程中都可能会被中断，因而将会留下了一个只完成部分升级而<em>无法访问</em>的系统。

source: Any package installation operation must be run with superuser privileges, so either login as root or use <prgn>su</prgn> or <prgn>sudo</prgn> to gain the necessary access rights.
ja: あらゆるパッケージのインストール処理はスーパーユーザ特権で実行されなければならないため、必要なアクセス権を得るために root としてログインするか <prgn>su</prgn> や <prgn>sudo</prgn> を使ってください。
nl: Elke handeling met betrekking tot de installatie van pakketten dient te worden uitgevoerd met beheerdersrechten; log daarom aan als root of gebruik <prgn>su</prgn> of <prgn>sudo</prgn> om de noodzakelijke toegangsrechten te verkrijgen.
pt: Qualquer operação de instalação de um pacote terá que ser efectuada com privilégios de super-utilizador, assim ou inicie a sessão como root ou use <prgn>su</prgn> ou <prgn>sudo</prgn> para ganhar os direitos de acesso necessários.
ru: Установка любого пакета должна производиться с привилегиями суперпользователя. Поэтому вы должны либо войти в систему под именем суперпользователя (root), либо использовать программы <prgn>su</prgn> или <prgn>sudo</prgn>, чтобы получить необходимые права.
sv: Alla paketinstallationsåtgärder måste köras med superanvändarens rättigheter, så logga antingen in som root eller använd <prgn>su</prgn> eller <prgn>sudo</prgn> för att få de nödvändiga åtkomsträttigheterna.
zh_cn: 任何软件包安装的动作都需要有系统管理者的权限才能进行，所以您必须以 root 登入，或使用 <prgn>su</prgn> 或 <prgn>sudo</prgn> 来取得所需的权限。
