Repository: lurdan/trans-ddp
Catalog: release-notes/*/release-notes.*.po
Languages: ja, ml, nl, pt, ru, sv, zh_cn

source: You will be shown a list of the changes that will be made and asked you to confirm them. You should take a careful look at the proposed changes, especially packages that will be removed by the upgrade, before you confirm.
ja: 発生した変更点の一覧が表示され、承認を求めてくるでしょう。承認する前に提示された変更点、特にアップグレードによって削除されるであろうパッケージに注意を払ってください。
nl: Er zal een overzicht worden getoond van de wijzigingen die het gevolg zullen zijn en u zult worden gevraagd deze te bevestigen. Bekijk de voorgestelde wijzigingen zorgvuldig, met name de pakketten die door de opwaardering zullen worden verwijderd, voordat u de bevestiging geeft.
pt: Ser-lhe-á mostrada uma lista de alterações a efectuar e pedido que as confirme. Deverá ter cuidado com as alterações propostas, especialmente pacotes que sejam removidos pela actualização, antes que as confirme.
ru: Вы сможете просмотреть список изменений и либо утвердить его, либо отказаться. Перед тем, как согласиться с предложенными изменениями, обратите особое внимание на пакеты, которые будут удалены при обновлении.
sv: Du kommer att bli visad en lista över ändringar som kommer att göras och bli tillfrågad att bekräfta dem. Du bör noga undersöka de föreslagna ändringarna, speciellt paket som kommer att tas bort av uppgraderingen, innan du bekräftar.
zh_cn: 您应该会得到将会进行什么样的改变的一串联表，并询问您是否要继续进行。在您确认之前，您应该仔细得查看将会进行什么样的改变，尤其要注意在升级的过程中将会被移除掉的那些软件包。

source: In some cases if a large number of packages is listed for removal, you may be able to reduce this list by "pre-upgrading" selected other packages alongside <package>aptitude</package>. An example may clarify this. During upgrade tests for systems having KDE installed, we have seen that this step would cause removal of a large number of KDE packages and/or perl. The solution proved to be to <tt>install aptitude perl</tt> instead of <tt>install aptitude</tt>.
ja: 非常に多くのパッケージが削除対象としてリストアップされてしまう場合があります。この場合、<package>aptitude</package> とともに事前にアップグレードするパッケージを選択しておくと、リストアップされるパッケージを減らせるかもしれません。わかりやすい例を挙げてみましょう - すでに KDE がインストールされたシステムのアップグレードテスト中に、大量の KDE パッケージや perl が削除対象になることがありました。ここでは <tt>install aptitude</tt> ではなく <tt>install aptitude perl</tt> とすると、うまくいくことがわかりました。
pt: Nalguns casos, se estiver listado um grande número de pacotes para serem removidos, pode reduzir essa lista através da pré-selecção de outros pacotes existentes no <package>aptitude</package>. Um exemplo clarificará melhor este aspecto. Durante os testes de actualização para sistemas com o KDE instalado, vimos que este passo causa a remoção de inúmeros pacotes KDE e/ou perl. A solução provada foi <tt>install aptitude perl</tt> em vez de <tt>install aptitude</tt>.
ru: В некоторых случаях на этом шаге предлагается удалить большое количество пакетов. Можно попытаться сократить количество удаляемых пакетов, обновляя одновременно с <package>aptitude</package> что-нибудь ещё. Поясним на примере. При пробных обновлениях систем с установленным KDE этот шаг вызывал удаление многих пакетов KDE, зачастую вместе с <package>perl</package>. Решением в этом случае стал запуск <tt>install aptitude perl</tt> вместо <tt>install aptitude</tt>.
sv: I vissa fall kan ett stort antal paket listas för borttagning. Du kan eventuellt minska den listan genom att "föruppgradera" andra markerade paket tillsammans med <package>aptitude</package>. Ett exempel kan tydliggöra detta. Under uppgraderingstester för system som har KDE installerat, har vi sett att det här steget skulle orsaka borttagning av ett stort antal KDE-paket och/eller perl. Lösningen visade sig vara <tt>install aptitude perl</tt> istället för <tt>install aptitude</tt>.
zh_cn: 在某些状况之下，会列出来一大串将会被移除的软件包的列表。您可以借由使用 "预先升级, pre-upgrading" 的方式，也就是在安装 <package>aptitude</package> 的同时再多安装另一个特定的软件包，来减少这些会被移除的软件包的列表。用一个范例来说明可能会比较好理解。在一个安装了 KDE 的系统的升级测试中，我们会发现在这个步骤里，将会移除一大堆的 KDE 软件包及/或 perl。而在此提供的解决方案就是使用 <tt>install aptitude perl</tt> 来取代 <tt>install aptitude</tt> 指令。

source: Upgrading the rest of the system
ja: 残りのシステムのアップグレード
nl: De rest van het systeem opwaarderen
pt: Actualizar do restante sistema
ru: Обновление остальной системы
sv: Uppgradera resten av systemet
zh_cn: 升级系统的其它部份

source: You are now ready to continue with the main part of the upgrade. Execute:
ja: さて、アップグレードの主要部分を続行する準備が整いました。以下のコマンドを実行してください:
nl: U kunt nu verder gaan met het voornaamste deel van de migratie. Voer het volgende commando uit:
pt: Está agora pronto para continuar a actualização da parte principal. Execute:
ru: Теперь можно приступить собственно к обновлению. Выполните команду
sv: Du är nu redo att fortsätta med huvuddelen av uppgraderingen. Kör:
zh_cn: 那么，现在已经准备好可以进行升级作业的重头戏了。请执行：

source: This will perform a complete upgrade of the system, i.e. install the newest available versions of all packages, and resolve all possible dependency changes between packages in different releases. If necessary, it will install some new packages (usually new library versions, or renamed packages), and remove any conflicting obsoleted packages (such as <package>console-tools-libs</package>).
ja: これによってシステムの完全なアップグレードを行います。すなわちすべてのパッケージの最新版を入手し、パッケージのリリースが変わったことによって生じる依存関係の変更すべてを解決します。必要に応じて、新しいパッケージ (通常は更新版のライブラリや、名前の変わったパッケージ) をインストールしたり、衝突している古いパッケージ (<package>console-tools-libs</package> など) を削除したりもします。
nl: Dit commando zal een volledige opwaardering van uw systeem uitvoeren; dat wil zeggen: de nieuwste beschikbare versies van alle pakketten installeren en alle mogelijke afhankelijkheden tussen pakketten oplossen. Indien noodzakelijk zal het ook nieuwe pakketten installeren (meestal nieuwe versies van bibliotheken of hernoemde pakketten) en eventuele conflicterende verouderde pakketten verwijderen (zoals het pakket <package>console-tools-libs</package>).
pt: Isto irá executar a actualização completa do sistema, i.e. instalar as novas versões disponíveis de todos os pacotes, e resolverá toda as possíveis dependências entre pacotes entre diferentes versões. Se necessário, irá instalar novos pacotes (normalmente novas versões de bibliotecas, ou renomear pacotes), e remover quaisquer pacotes em conflito e obsoletos (tais como <package>console-tools-libs</package>).
ru: Эта команда произведёт полное обновление системы, т.е. установку последних доступных версий всех пакетов и разрешение всех изменившихся между выпусками зависимостей. При необходимости она установит новые пакеты (обычно это новые версии библиотек или переименованные пакеты) и удалит все вызывающие конфликты устаревшие пакеты (такие как <package>console-tools-libs</package>).
sv: Det här kommer att genomföra en fullständig uppgradering av systemet, alltså installera de senaste tillgängliga versionerna av samtliga paket, och lösa alla tänkbara beroendeändringar mellan paket i olika utgåvor. Om det är nödvändigt kommer det även att installera några nya paket (vanligtvis nya versioner av bibliotek, eller paket som fått nya namn), och ta bort eventuella föråldrade paket som är i konflikt (såsom <package>console-tools-libs</package>).
zh_cn: 这将会在您的系统上进行完整的更新，也就是安装所有软件包目前所提供的最新版本，并解决软件包在不同发行版之间可能会有的依赖性问题。如果有必要的话，它也会安装一些新的软件包（通常是新版的函数库或是被更名的软件包），并移除任何和新版软件包发生冲突的过时软件包（像是 <package>console-tools-libs</package>。）

source: When upgrading from a set of CD-ROMs, you will be asked to insert specific CDs at several points during the upgrade. You might have to insert the same CD multiple times; this is due to inter-related packages that have been spread out over the CDs.
ja: CD-ROM のセットからアップグレードする場合には、アップグレード作業の最中に CD を交換するよう、数回指定されることになります。同じ CD を複数回入れなければならないかもしれません。これはパッケージ間の相互依存関係のせいで、これらのパッケージが別々の CD に入っていることもあるからです。
nl: Als de opwaardering wordt uitgevoerd vanaf een set CD's, zal u gedurende de opwaardering enkele keren worden gevraagd om een bepaalde CD te laden. Mogelijk zult u dezelfde CD meermalen moeten laden; dit wordt veroorzaakt door onderling afhankelijke pakketten die over verschillende CD's zijn verdeeld.
pt: Quando a actualização for feita a partir de um conjunto de CD-ROMs, ser-lhe-á pedido que insira CDs específicos num determinado ponto durante a actualização. Pode ter que inserir o mesmo CD múltiplas vezes, isto devido a pacotes interrelacionados que foram distribuídos pelos CDs.
ru: При обновлении с набора компакт-дисков система несколько раз попросит вас вставить в привод соответствующий диск. Возможно, вам придётся вставлять один диск несколько раз, это вызвано тем, что взаимосвязанные пакеты могут находится на разных дисках.
sv: Vid uppgradering från en uppsättning cd-skivor, kommer du att bli uppmanad att mata in specifika cd-skivor vid olika tillfällen under uppgraderingen. Du kanske måste mata in samma cd-skiva flera gånger; det här är på grund av sammankopplade paket som har blivit utspridda över cd-skivorna.
zh_cn: 如果您是从光盘组来进行升级的话，系统将会在升级进行时不时要求您放入某张特定的光盘片。您可能会需要反覆放入同一张光盘数次；这是由于相关的软件包被分散在多张光碟之中所造成的。

source: New versions of currently installed packages that cannot be upgraded without changing the install status of another package will be left at their current version (displayed as "held back"). This can be resolved by either using <prgn>aptitude</prgn> to choose these packages for installation or by trying <tt>aptitude -f install <var>package</var></tt>.
ja: 現在インストールされているパッケージの更新版が、他のパッケージのインストール状態を変更しなければならないような場合には、そのパッケージは現在のバージョンのままになります ("held back" と表示されます)。この状態は、<prgn>aptitude</prgn> でこれらのパッケージをインストール対象として選択するか、<tt>aptitude -f install <var>package</var></tt> を試すかのどちらかで解決できます。
nl: Nieuwe versies van op dit moment geïnstalleerde pakketten die niet kunnen worden opgewaardeerd zonder de installatie-status van andere pakketten te wijzigen, zal op zijn huidige versie blijven (wordt weergegeven als "held back"). Dit kan worden verholpen door ofwel met hulp van <prgn>aptitude</prgn> deze pakketten te selecteren voor installatie, ofwel door <tt>aptitude -f install <var>package</var></tt> te proberen.
pt: Novas versões dos pacotes actualmente instalados que não possam ser actualizadas sem alterar o estado de instalação de outro pacote serão deixadas na sua versão actual (visíveis como "held back"). Isto pode ser resolvido ou usando o <prgn>aptitude</prgn> de modo a escolher estes pacotes para instalação ou tentando <tt>aptitude -f install <var>pacote</var></tt>.
ru: Новые версии уже установленных пакетов, которые нельзя обновить не меняя состояние других пакетов не будут установлены (программа выведет сообщение, что пакет зафиксирован, "held back"). Разрешить ситуацию можно либо отметив такой пакет как подлежащий установке с помощью <prgn>aptitude</prgn>, либо выполнив команду <tt>aptitude -f install &lt;пакет&gt;</tt>.
sv: Nya versioner av installerade paket, som inte kan uppgraderas utan att ändra installationsstatus för ett annat paket, kommer att lämnas kvar vid deras nuvarande version (visas som "held back"). Det kan lösas genom att antingen använda <prgn>aptitude</prgn> för att välja dessa paket för installation eller genom att prova <tt>aptitude -f install <var>paket</var></tt>.
zh_cn: 如果升级某些已安装的软件包至新版本时会改变其他软件包的安装状态的话，这些软件包就会被保留在原来的状态（并显示为 "留置, held back"）。可以使用 <prgn>aptitude</prgn> 选择这些软件包并进行安装，或是试着键入 <tt>aptitude -f install <var>package</var></tt>，就能够解决这个问题。

source: The <tt>--fix-broken</tt> (or just <tt>-f</tt>) option causes <package>apt</package> to attempt to correct a system with broken dependencies in place. <package>apt</package> does not allow broken package dependencies to exist on a system.
ja: <tt>--fix-broken</tt> (または単に <tt>-f</tt>) オプションを与えると、<package>apt</package> はシステムに存在する壊れた依存関係を修復しようとします。<package>apt</package> は、壊れたパッケージ依存関係がシステムに存在するのを許しません。
nl: De optie <tt>--fix-broken</tt> (of <tt>-f</tt>) laat <package>apt</package> proberen 'verbroken' afhankelijkheden op een systeem te herstellen. <package>apt</package> staat niet toe dat op een systeem gebroken afhankelijkheden tussen pakketten bestaan.
pt: A opção <tt>--fix-broken</tt> (ou apenas <tt>-f</tt>) provoca a tentativa de correcção pelo <package>apt</package> de um sistema com dependências danificadas. O <package>apt</package> não permite que pacotes com dependências danificadas permaneçam num sistema.
ru: Параметр <tt>--fix-broken</tt> (или просто <tt>-f</tt>) приведёт к тому, что <package>apt</package> будет пытаться сразу исправлять нарушенные зависимости. Система <package>apt</package> не позволяет, чтобы какие-либо зависимости в системе были не удовлетворены.
sv: Flaggan <tt>--fix-broken</tt> (eller bara <tt>-f</tt>) gör att <package>apt</package> försöker rätta till ett system med trasiga beroenden. <package>Apt</package> tillåter inte att trasiga paketberoenden finns på ett system.
zh_cn: <tt>--fix-broken</tt>（或只是 <tt>-f</tt>）选项会让 <package>apt</package> 尝试适当地修正系统中错误的依赖关系。<package>apt</package> 不允许系统中存在任何在依赖关系上的错误。

source: Possible issues during upgrade
ja: アップグレード中の注意点
nl: Mogelijke problemen tijdens het opwaarderen
pt: Possíveis problemas durante a actualização
ru: Возможные проблемы во время обновления
sv: Möjliga problem under uppgraderingen
zh_cn: 在升级过程中可能会发生的问题

source: If an operation using <prgn>aptitude</prgn>, <prgn>apt-get</prgn> or <prgn>dpkg</prgn> fails with the error
ja: <prgn>aptitude</prgn>、<prgn>apt-get</prgn>、<prgn>dpkg</prgn> の操作中に次のようなエラーが出た場合、
pt: Se uma operação a utilizar o <prgn>aptitude</prgn>, <prgn>apt-get</prgn> ou <prgn>dpkg</prgn>falha com o erro
ru: Если запуск <prgn>aptitude</prgn>, <prgn>apt-get</prgn> или <prgn>dpkg</prgn> завершается с ошибкой
sv: Om en åtgärd med <prgn>aptitude</prgn>, <prgn>apt-get</prgn> eller <prgn>dpkg</prgn> misslyckas med felet
zh_cn: 如果在使用 <prgn>aptitude</prgn>、<prgn>apt-get</prgn> 或 <prgn>dpkg</prgn> 的过程中失败了并显示以下错误

source: the default cache space is insufficient. You can solve this by either removing or commenting lines you don't need in <file>/etc/apt/sources.list</file> or by increasing the cache size. The cache size can be increased by setting <tt>APT::Cache-Limit</tt> in <file>/etc/apt/apt.conf</file>. The following command will set it to a value that should be sufficient for the upgrade:
ja: デフォルトのキャッシュ容量では不十分だということです。これを解決するには、<file>/etc/apt/sources.list</file> から不要な行を削除もしくはコメントアウトするか、キャッシュサイズを増やします。キャッシュサイズを増やすには、<file>/etc/apt/apt.conf</file> に <tt>APT::Cache-Limit</tt> を設定します。以下のコマンドを実行すれば、アップグレードするには十分な値が設定されます:
pt: o espaço de cache, por omissão, é insuficiente. Pode resolver tanto pela remoção ou comentado as linhas que não necessita em <file>/etc/apt/sources.list</file> ou aumentando a dimensão da cache. A dimensão da cache pode ser aumentada pela definição de <tt>APT::Cache-Limit</tt> em <file>/etc/apt/apt.conf</file>. O seguinte comando definirá para um valor que deverá ser suficiente para a actualização:
ru: то это значит, что размера кэша по умолчанию недостаточно. Проблему можно решить либо удалив ненужные записи в файле <file>/etc/apt/sources.list</file>, либо увеличив размер кэша. Увеличить размер кэша можно с помощью параметра <tt>APT::Cache-Limit</tt> в файле <file>/etc/apt/apt.conf</file>. Следующая команда увеличит кэш до размера, достаточного для обновления:
sv: räcker inte standardutrymmet för cachen till. Du kan lösa det här genom att antingen ta bort eller kommentera rader som du inte behöver i <file>/etc/apt/sources.list</file> eller genom att öka storleken på cachen. Storleken på cachen kan ökas genom att ställa in <tt>APT::Cache-Limit</tt> i <file>/etc/apt/apt.conf</file>. Följande kommando kommer att ställa in den till ett värde som ska vara tillräckligt för uppgraderingen:
zh_cn: 那么，就表示默认的缓存空间不够了。您可以从 <file>/etc/apt/sources.list</file> 中将您不需要的项目加上注解或是干脆将它移去，或是增加缓存空间，来解决这个问题。可以经由设置 <file>/etc/apt/apt.conf</file> 里的 <tt>APT::Cache-Limit</tt> 来增加缓存空间。假设您还没有在这个文件里替这个变数设置任何的数值，那么以下的命令应该可以替升级的动作设置足够的缓存空间：<example>

source: This assumes that you do not yet have this variable set in that file.
ja: ここでは、<file>/etc/apt/apt.conf</file> ファイル内にまだこの値を設定していない場合を想定しています。
pt: Assume que não tem ainda nenhuma variável definida neste ficheiro.
ru: Здесь предполагается, что эта переменная раньше не была указана в файле.
sv: Det här förutsätter att du inte redan har ställt in variabeln i den filen.
zh_cn: 在此则假设了您尚未在该文件中设置这个变数。

source: Sometimes it's necessary to enable APT::Force-LoopBreak option in APT to be able to temporarily remove an essential package due to a Conflicts/Pre-Depends loop. <prgn>aptitude</prgn> will alert you of this and abort the upgrade. You can work around that by specifying <tt>-o APT::Force-LoopBreak=1</tt> option on <prgn>aptitude</prgn> command line.
ja: 場合によっては衝突や依存関係のループのために、APT の APT::Force-LoopBreak オプションを有効にして、必須パッケージを一時的に削除しなければならないかもしれません。その場合 <prgn>aptitude</prgn> はこのことを警告してアップグレードを中断します。<prgn>aptitude</prgn> のコマンドラインに <tt>-o APT::Force-LoopBreak=1</tt> を指定すれば、この状態を回避できます。
nl: Soms is het noodzakelijk om in APT de optie APT::Force-LoopBreak te activeren zodat in verband met een 'Conflicts/Pre-Depends'-lus een vereist pakket tijdelijk kan worden verwijderd. <prgn>aptitude</prgn> zal u hierover informeren en de opwaardering afbreken. U kunt deze situatie verhelpen door op de opdrachtregel voor <prgn>aptitude</prgn> de optie <tt>-o APT::Force-LoopBreak=1</tt> mee te geven.
pt: Por vezes é necessário activar a opção APT::Force-LoopBreak no APT para ser possível remover temporariamente um pacote essencial devido a um ciclo de Conflitos/Pré-Dependências. O <prgn>aptitude</prgn> irá alertá-lo disto e abortará a actualização. Pode contornar o problema especificando a opção <tt>APT::Force-LoopBreak=1</tt> na linha de comandos do <prgn>aptitude</prgn>.
ru: Иногда необходимо активизировать параметр APT::Force-LoopBreak, чтобы разрешить временное удаление пакета первой необходимости при возникновении циклической зависимости типа конфликт/требование предварительной установки. Программа <prgn>aptitude</prgn> сообщит об этом и прекратит обновление. Чтобы решить эту проблему, следует указать в командной строке <prgn>aptitude</prgn> параметр <tt>-o APT::Force-LoopBreak=1</tt>.
sv: Ibland är det nödvändigt att aktivera alternativet APT::Force-LoopBreak i APT för att temporärt kunna ta bort ett systemkritiskt paket på grund av en Conflicts/Pre-Depends-slinga. <prgn>Aptitude</prgn> kommer att varna dig om det här och avbryta uppgraderingen. Du kan lösa det genom att ange alternativet <tt>-o APT::Force-LoopBreak=1</tt> på kommandoraden för <prgn>aptitude</prgn>.
zh_cn: 有时候您会需要启用 APT::Force-LoopBreak 选项让 APT 暂时移除某个重要的软件包，以解决循环的 相互冲突(Conflicts) / 相互依赖(Pre-Depends) 关系。<prgn>aptitude</prgn> 会对此提出警告，并终止升级的进行。您可以在 <<prgn>aptitude</prgn> 的命令行中加入 <tt>-o APT::Force-LoopBreak=1</tt> 来解决这个问题。

source: It is possible that a system's dependency structure can be so corrupt as to require manual intervention. Usually this means using <prgn>aptitude</prgn> or
ja: システムの依存関係の構造が非常に混乱していて、手動での介入が必要となることもあります。通常これは <prgn>aptitude</prgn> を用いるか、あるいは
pt: É possível que uma estrutura de dependências do sistema se torne corrupta de modo a necessitar de intervenção manual. Normalmente isto significa usar o <prgn>aptitude</prgn> ou
ru: Возможна ситуация, когда структура зависимостей в системе может быть настолько нарушена, что потребуется ручное вмешательство. Обычно это делается с помощью <prgn>aptitude</prgn> или
sv: Det är möjligt att beroendestrukturen för ett system kan vara så skadat att det kräver handpåläggning. Vanligtvis innebär det att använda <prgn>aptitude</prgn> eller
zh_cn: 系统中的依赖关系也可能混乱到需要手动介入才得以解决。通常这代表您需要使用 <prgn>aptitude</prgn> 或

source: to eliminate some of the offending packages, or
ja: として、目ざわりなパッケージを消す作業になります。または次の作業でもよいかもしれません。
pt: para eliminar alguns dos pacotes que estão a prejudicar, ou
ru: чтобы удалить "проблемные" пакеты или
sv: för att plocka bort några av de störande paketen, eller
zh_cn: 来清除一些会造成问题的软件包，或

source: In extreme cases you might have to force re-installation with a command like
ja: 極端な場合には、コマンドラインから次のように入力して、再インストールしなければならないかもしれません。
pt: Em casos extremos poderá ter que forçar a reinstalação com um comando como
ru: В чрезвычайных случаях вам может потребоваться принудительная переустановка командой типа
sv: I extrema fall kan du behöva tvinga fram en ominstallation med ett kommando som detta
zh_cn: 在极端的情况下，您可能需要利用类似以下的指令来强制进行重新安装的动作：

source: File conflicts should not occur if you upgrade from a "pure" &oldreleasename; system, but can occur if you have unofficial backports installed. A file conflict will result in an error like:
ja: 「純粋な」&oldreleasename; システムからのアップグレードでは、ファイルの競合は起こらないはずですが、非公式なバックポートパッケージをインストールしているなら起こるかもしれません。ファイルの競合が起こると、次のようなエラーになります:
pt: Os conflitos de ficheiros não ocorrem se estiver a actualizar a partir de um sistema &oldreleasename; "puro", mas pode acontecer se tiver instalado 'backports' não-oficiais. Um conflito de ficheiros pode resultar no seguinte erro:
ru: При обновлении с "чистого" &oldreleasename; конфликтов файлов быть не должно, но они вполне возможны, если у вас установлены неофициальные адаптации (backports). Конфликт файлов вызывает ошибки вида:
sv: Filkonflikter bör inte inträffa om du uppgraderar från ett "rent" &oldreleasename;-system, men kan inträffa om du har inofficiella bakåtporteringar installerade. En filkonflikt resulterar i ett fel som:
zh_cn: 如果您是由一个 "纯粹" 的 &oldreleasename; 进行升级的话，应该不会有文件冲突的情况发生；但如果您安装了非官方的 backports 软件包时就不一定了。如果发生文件冲突时，会产生类似以下的错误：

source: Unpacking replacement <var>&lt;package-foo&gt;</var> ... dpkg: error processing <var>&lt;package-name-for-foo&gt;</var> (--unpack): trying to overwrite `<var>&lt;some-file-name&gt;</var>', which is also in package <var>&lt;package-bar&gt;</var>
ja: <var>&lt;package-foo&gt;</var> を展開し、置換しています... dpkg: <var>&lt;package-name-for-foo&gt;</var> の処理中にエラーが発生しました (--unpack): `<var>&lt;some-file-name&gt;</var>' を上書きしようとしています。 これはパッケージ <var>&lt;package-bar&gt;</var> にも含まれています
pt: A desempacotar o substituto <var>&lt;package-foo&gt;</var> ... dpkg: erro ao processar <var>&lt;package-name-for-foo&gt;</var> (--unpack): a tentar sobrescrever `<var>&lt;some-file-name&gt;</var>', que também existe no pacote <var>&lt;package-bar&gt;</var>
sv: Packar upp ersättande <var>&lt;paket-foo&gt;</var> ... dpkg: fel vid hantering av <var>&lt;paketnamn-för-foo&gt;</var> (--unpack): försöker skriva över "<var>&lt;ett-filnamn&gt;</var>", som också finns i paketet <var>&lt;paket-bar&gt;</var>
zh_cn: 解开并置换 <var>&lt;package-foo&gt;</var> ... dpkg: 程序错误 <var>&lt;package-name-for-foo&gt;</var> (--unpack): 尝试覆写 `<var>&lt;some-file-name&gt;</var>', 而同时存在于软件包 <var>&lt;package-bar&gt;</var>

source: You can try to solve a file conflict by forcibly removing the package mentioned on the <em>last</em> line of the error message:
ja: ファイルの競合を解消するには、エラーメッセージの<em>最後の</em>行に表示されたパッケージを強制的に削除します:
pt: Pode tentar resolver um conflito de ficheiro, efectuando a remoção forçada do pacote mencionado na <em>última</em> linha da mensagem de erro:
ru: Конфликт файлов можно попытаться разрешить принудительным удалением пакета, указанного в <em>последней</em> строке сообщения об ошибке:
sv: Du kan försöka lösa en filkonflikt genom att tvinga igenom borttagning av paketet som nämns på <em>sista</em> raden i felmeddelandet:
zh_cn: 您可以强制移除出现在错误信息里最<em>后</em>一行的那个软件包，以解决文件冲突的问题：

source: After fixing things up, you should be able to resume the upgrade by repeating the previously described <tt>aptitude</tt> commands.
ja: 問題が修正できたら、先に示したように <tt>aptitude</tt> コマンドを繰り返し入力すれば、アップグレードを再開できます。
nl: Nadat een en ander hersteld is, zou u in staat moeten zijn om de opwaardering te hervatten door de hiervoor beschreven <tt>aptitude</tt> opdrachten te herhalen.
pt: Depois de corrigir as coisas, deverá ser capaz de continuar a actualização repetindo os comandos <tt>aptitude</tt> descritos atrás.
ru: После исправления ошибок вы можете продолжить обновление, повторив ранее описанные команды <tt>aptitude</tt>.
sv: Efter att problemen har lösts, bör du kunna återuppta uppgraderingen genom att upprepa tidigare beskrivna <tt>aptitude</tt>-kommandon.
zh_cn: 在问题都修正了之后，您就应该可以重新输入先前所描述的 <tt>aptitude</tt> 指令并继续升级的工作了。
