Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: This will perform a complete upgrade of the system, i.e. install the newest available versions of all packages, and resolve all possible dependency changes between packages in different releases. If necessary, it will install some new packages (usually new library versions, or renamed packages), and remove any conflicting obsoleted packages.
fr: Cette commande effectue une mise à niveau complète du système, c.-à-d. installe les versions les plus récentes de tous les paquets, et résoud tous les changements possibles de dépendances entre paquets des différentes versions. Si nécessaire, elle installe de nouveaux paquets (habituellement de nouvelles versions de bibliothèques, ou des paquets ayant changé de nom), et retire les paquets obsolètes en conflit.
it: Questo comando eseguirà un aggiornamento completo del sistema, ossia installerà le versioni più recenti disponibili di tutti i pacchetti e risolverà i possibili cambiamenti di dipendenze fra i pacchetti dei diversi rilasci. Se necessario, esso installerà taluni nuovi pacchetti (normalmente nuove versioni di librerie o pacchetti rinominati) e rimuoverà i pacchetti resi obsoleti in conflitto.
ja: これによってシステムの完全なアップグレードが行われます。すなわち、すべてのパッケージの最新版がインストールされ、リリース間で発生しうるパッケージの依存関係の変化すべてが解決されます。必要に応じて、新しいパッケージ (通常は、新しいバージョンのライブラリや、名前の変わったパッケージ) がインストールされたり、衝突した古いパッケージが削除されたりもします。
ml: വ്യ‌‌വസ്ഥിതിയുടെ മുഴുവന്‍ പുതുക്കലും ഇത് നടത്തിക്കൊള്ളും. അതായത്, ലഭ്യ‌‌മായ എല്ലാ പൊതികളുടേയും ഏറ്റവും പുതിയ പതിപ്പുകള്‍ പ്രതിഷ്ഠിക്കുകയും, വ്യ‌‌ത്യ‌‌സ്ത പ്രകാശനങ്ങളിലെ പൊതികള്‍ തമ്മില്‍ വരാവുന്ന ആശ്രിതത്വ പ്രശ്നങ്ങള്‍ പരിഹരിക്കുകയും ചെയ്യും. വേണ്ടിവന്നാല്‍, പുതിയ ചില പൊതികള്‍ (സാധാരണയായി ഗ്രന്ഥാവലിയുടെ പുതിയ പതിപ്പുകളോ പുനര്‍നാമകരണം ചെയ്യപ്പെട്ട പൊതികളോ) കൂടി സ്ഥാപിക്കുകയും, വൈരുദ്ധ്യ‌‌മുള്ള കാലഹരണപ്പെട്ട പൊതികള്‍ നീക്കിക്കളയുകയും ചെയ്യും.
pt: Isto irá executar a actualização completa do sistema, i.e. instalar as versões disponíveis mais recentes de todos os pacotes, e resolver todas as possíveis alterações de dependências entre pacotes em diferentes lançamentos. Se necessário, irá instalar alguns pacotes novos (normalmente novas versões de bibliotecas, ou pacotes renomeados), e remover quaisquer pacotes em conflito e obsoletos.
ro: Aceasta va efectua o actualizare completă a sistemului, și anume, va instala cele mai noi versiuni disponibile ale tuturor pachetelor și va rezolva toate posibilele schimbări de dependențe dintre pachetele din diferitele versiuni. Dacă este necesar, va instala câteva pachete noi (de obicei, versiuni de biblioteci mai noi sau pachete redenumite) și va elimina orice pachete depășite care sunt în conflict.
sv: Det här kommer att genomföra en fullständig uppgradering av systemet, alltså installera de senaste tillgängliga versionerna av samtliga paket och lösa alla tänkbara beroendeändringar mellan paketen i olika utgåvor. Om det är nödvändigt kommer det även att installera några nya paket (vanligtvis nya versioner av bibliotek eller paket som fått nya namn) samt ta bort eventuella föråldrade paket som står i konflikt med varandra.
zh_tw: 這將會在您的系統上進行完整的更新，也就是安裝所有套件目前所提供的最新版本，並解決套件在不同發行版之間可能會有的相依性問題。如果有必要的話，它也會安裝一些新的套件（通常是新版的函式庫或是被更名的套件），並移除任何和新版套件發生衝突的過時套件。

source: When upgrading from a set of CD-ROMs (or DVDs), you will be asked to insert specific CDs at several points during the upgrade. You might have to insert the same CD multiple times; this is due to inter-related packages that have been spread out over the CDs.
fr: Lorsque la mise à niveau se fait à partir d'un ensemble de CD (ou DVD), on vous demandera d'insérer d'autres CD ou DVD à plusieurs moments de la mise à niveau. Vous pourriez devoir insérer plusieurs fois le même CD ou DVD. Cela est dû aux relations entre paquets répartis sur plusieurs supports.
it: In caso di aggiornamento da una serie di CD-ROM (o DVD), verrà chiesto di inserire uno specifico CD in parecchi momenti dell'aggiornamento. Potrebbe capitare di dover inserire più volte lo stesso CD: ciò è dovuto a pacchetti correlati tra loro che sono stati distribuiti su diversi CD.
ja: CD-ROM (または DVD) のセットからアップグレードする場合には、アップグレードの最中に、特定の CD を入れるよう何回か指示されることになります。同じ CD を複数回入れなければならないかもしれません。これは、相互に依存しているパッケージが別々の CD に分散しているためです。
ml: ഒരു കൂട്ടം സിഡിറോമുകള്‍ (ഡിവിഡികള്‍) ഉപയോഗിച്ച് പുതുക്കല്‍ നടത്തുമ്പോള്‍ ഒരു പ്രത്യേ‌‌ക സിഡിതന്നെ പുതുക്കലിനിടയ്ക്കുള്ള വിവിധ ഘട്ടങ്ങളില്‍ ഇടാനാവശ്യ‌‌‌‌പ്പെട്ടെന്നു വരും.ഒരേ സിഡി തന്നെ പലതവണ ഇടേണ്ടതായി വരും. സിഡിയില്‍ പലയിടത്തായി ചിതറിക്കിടക്കുന്ന പരസ്പര ബന്ധമുള്ള പൊതികളാണതിന് കാരണം.
pt: Quando a actualização for feita a partir de um conjunto de CD-ROMs (ou DVDs), ser-lhe-á pedido que insira CDs específicos em determinados pontos durante a actualização. Pode ter que inserir o mesmo CD múltiplas vezes, isto devido a pacotes inter-relacionados que foram espalhados pelos CDs.
ro: Când actualizați de pe un set de CD-uri (sau DVD-uri), vi se va cere să introduceți anumite CD-uri la diverse momente în timpul actualizării. S-ar putea să trebuiască să introduceți de mai multe ori același CD, datorită pachetelor interdependente dispersate pe mai multe CD-uri.
sv: Vid uppgradering från en uppsättning cd-skivor (eller dvd-skivor), kommer du bli uppmanad att mata in specifika cd-skivor vid olika tillfällen under uppgraderingen. Du kanske måste mata in samma cd-skiva flera gånger; detta beror på att sammankopplade paket har blivit utspridda över cd-skivorna.

source: New versions of currently installed packages that cannot be upgraded without changing the install status of another package will be left at their current version (displayed as <quote>held back</quote>). This can be resolved by either using <command>aptitude</command> to choose these packages for installation or by trying <literal>apt-get -f install <replaceable>package</replaceable></literal>.
fr: Les paquets déjà installés ayant une nouvelle version, mais qui ne peuvent être installés sans modifier l'état d'un autre paquet, seront laissés dans leur version actuelle (et affichés comme retenu &mdash; <quote>held back</quote>). Cela peut être résolu soit en utilisant <command>aptitude</command> et en choisissant d'installer ces paquets, soit en essayant <literal>apt-get -f install <replaceable>paquet</replaceable></literal>.
it: Nuove versioni di pacchetti attualmente installati che non possono essere aggiornati senza modificare lo stato d'installazione di un altro pacchetto saranno lasciate alla loro attuale versione (contrassegnati come <quote>held back</quote>;, <quote>bloccati</quote>). Questo fatto può essere risolto o utilizzando <command>aptitude</command>, per designare tali pacchetti per l'installazione, o provando con <literal>apt-get -f install <replaceable>pacchetto</replaceable></literal>.
ja: 現在インストールされているパッケージを新しいバージョンへとアップグレードする際に、他のパッケージのインストール状態を変更しなければならないような場合には、そのパッケージは現在のバージョンのままになります (<quote>固定されている</quote> と表示されます)。この状態は、<command>aptitude</command> でこれらのパッケージをインストール対象として選択するか、または <literal>apt-get -f install <replaceable>パッケージ名</replaceable></literal> を実行してみると、解決できます。
pt: As novas versões dos pacotes actualmente instalados que não possam ser actualizadas sem alterar o estado de instalação de outro pacote serão deixadas na sua versão actual (mostradas como <quote>held back</quote>). Isto pode ser resolvido ou utilizando o <command>aptitude</command> de modo a escolher estes pacotes para instalação ou tentando <literal>apt-get -f install <replaceable>pacote</replaceable></literal>.
ro: Pachetele deja instalate care nu pot fi înnoite la versiuni mai noi fără a schimba statutul instalării altui pachet vor fi lăsate la versiunea curentă (marcate ca <quote>held back</quote>). Acest lucru poate fi rezolvat prin utilizarea comenzii <command>aptitude</command> și alegerea acestor pachete pentru instalare sau prin rularea comenzii <literal>apt-get -f install <replaceable>pachet</replaceable></literal>.
sv: Nya versioner av installerade paket, som inte kan uppgraderas utan att ändra installationsstatus för ett annat paket, kommer att lämnas kvar vid deras nuvarande version (visas som <quote>återhållna</quote>). Det kan lösas genom att antingen använda <command>aptitude</command> för att välja dessa paket för installation eller genom att prova <literal>apt-get -f install <replaceable>paket</replaceable></literal>.

source: Possible issues during upgrade
fr: Problèmes possibles pendant une mise à niveau
it: Possibili problemi durante l'aggiornamento
ja: アップグレード中の注意点
ml: നവീകരിക്കുമ്പോള്‍ ഉണ്ടാകാന്‍ സാധ്യതയുള്ള പ്രശ്നങ്ങള്‍
pt: Possíveis problemas durante a actualização
ro: Probleme posibile în timpul actualizării
sv: Möjliga problem under uppgraderingen
zh_tw: 在升級過程中可能會發生的問題

source: The following sections describe known issues that might appear during an upgrade to &releasename;.
fr: Les parties suivantes décrivent les problèmes connus pouvant survenir lors d'une mise à niveau vers &Releasename;.
it: Nelle prossime sezioni sono descritti i problemi noti che potrebbero verificarsi durante l'aggiornamento a &releasename;.
ja: 以下の章では、&releasename; へのアップグレードの最中に現れるかもしれない既知の問題を記述しています
pt: As seguinte secções descrevem problemas conhecidos que podem aparecer durante uma actualização para &releasename;.
ro: Secțiunile următoare descriu probleme cunoscute care pot apărea pe timpul procesului de actualizare la &releasename;.
sv: Följande kapitel beskriver kända problem som kan uppstå under uppgradering till &releasename;.

source: cryptoloop support not included in the &releasename; Linux kernel
fr: Le noyau Linux inclus dans &Releasename; ne prend plus en charge cryptoloop
it: Il Supporto cryptoloop non è incluso nel kernel Linux di &releasename;
ja: &releasename; の Linux カーネルでは cryptloop がサポートされません
pt: Suporte a cryptoloop não incluído no kernel Linux de &releasename;
ro: Suportul pentru cryptoloop nu este inclus în nucleul Linux din &releasename;
sv: stöd för cryptoloop finns inte i Linuxkärnan i &releasename;

source: Support for cryptoloop has been dropped from the Linux kernel packages included in Debian &release;. Existing installations using cryptoloop need to be transitioned to dm-crypt before the upgrade.
fr: Le noyau Linux inclus dans Debian &release; ne prend plus en charge cryptoloop. Les installations utilisant cryptoloop doivent migrer à dm-crypt avant d'effectuer la mise à niveau.
it: Il supporto per cryptoloop è stato rimosso dai pacchetti del kernel Linux in Debian &release;. Se si usa cryptoloop, è necessario migrare a dm-crypt prima dell'aggiornamento.
ja: cryptloop のサポートは、Debian &release; の Linux カーネルパッケージから外されています。cryptloop を使っている既存のインストールは、アップグレード前に dm-crypt へ移行する必要があります。
pt: O suporte para cryptoloop foi abandonado dos pacotes de kernel Linux incluídos em Debian &release;. As instalações existentes que usam cryptoloop precisam de ser transitadas para dm-crypt antes da actualização.
ro: cryptoloop nu mai este suportat în nucleele Linux kernel incluse în Debian &release;. Instalările existente ce folosesc cryptoloop trebuie să fie trecute la dm-crypt înainte de actualizare.
sv: Stöd för cryptoloop togs bort från paketen för Linuxkärnan som levereras med Debian &release;. Installationer som använder cryptoloop måste migreras till dm-crypt innan uppgraderingen.

source: Expected removals
fr: Suppressions attendues
it: Rimozioni attese
ja: 予期されるパッケージの削除
pt: Remoções esperadas
ro: Programe îndepărtate
sv: Förväntade raderingar

source: The upgrade process to &releasename; might ask for removal of packages in the system. The precise list of packages will vary depending on the set of packages that you have installed. These release notes give general advice on these removals, but if in doubt, it is recommended that you examine the package removals proposed by each method before proceeding.
fr: La mise à niveau vers &Releasename; peut demander la suppression de paquets sur le système. Leur liste exacte dépendra des paquets installés sur le système. Ces notes de publication donnent des conseils généraux sur la méthode à utiliser, mais en cas de doute, il est recommandé d'examiner les suppressions de paquets proposées par chacune des méthodes avant de les effectuer réellement.
it: Il processo d'aggiornamento a &releasename; potrebbe richiedere la rimozione di pacchetti dal sistema. L'elenco preciso dei pacchetti varia in base ai pacchetti installati. Queste note di rilascio forniscono un suggerimento generico riguardo le rimozioni di pacchetti, ma, nel dubbio, prima di proseguire si raccomanda di esaminare le rimozioni dei pacchetti che vengono proposte.
ja: &releasename; へのアップグレード作業では、システム中のパッケージ削除を尋ねてくるかもしれません。実際のパッケージ一覧は、インストールしてあるパッケージの構成に従って異なってくるでしょう。このリリースノートでは、どのような方法をとるべきかに関する一般的なアドバイスをします。しかし、確信がもてない場合は、それぞれの方法でアップグレードを先に進める前に、どのパッケージを削除するよう提案されているのか、きちんと調べることをお勧めします。
pt: O processo de actualização para &releasename; pode pedir a remoção de pacotes no sistema. A lista precisa de pacotes irá variar dependendo do conjunto de pacotes que você tem instalados. Estas notas de lançamento dão conselhos gerais acerca destas remoções, mas em caso de dúvidas, é recomendado que examine as propostas de remoção de pacotes de cada método antes de prosseguir.
ro: Procesul de actualizare la &releasename; vă poate cere îndepărtarea unor pachete din sistem. Lista exactă de pachete va varia în funcție de setul de pachete pe care le aveți instalate. Aceste note de lansare oferă sfaturi generice despre programele care vor fi îndepărtate, însă dacă aveți îndoieli, se recomandă examinarea listei cu pachete propuse pentru a fi șterse, înainte de a continua.
sv: Uppgraderingsprocessen till &releasename; kan begära att paket tas bort från systemet. Exakt vilka paket som påverkas kommer att variera beroende på vilken uppsättning av paket som är installerade. Dessa Kommentarer till utgåvan ger allmänna råd om paketradering, men om du är osäker är det rekommenderat att du undersöker de paketborttagningar som föreslås av varje metod innan du fortsätter.

source: Some common packages that are expected to be removed include: <systemitem role="package">autofs</systemitem> (replaced by <systemitem role="package">autofs5</systemitem>), <systemitem role="package">dhcp3</systemitem> (replaced by <systemitem role="package">isc-dhcp</systemitem>), <systemitem role="package">madwifi-source</systemitem>, <systemitem role="package">python-setuptools</systemitem> and <systemitem role="package">python2.4</systemitem> (replaced by <systemitem role="package">python2.6</systemitem>). For more information about packages obsoleted in &releasename;, see <xref linkend="obsolete"/>.
fr: On peut s'attendre à la suppression de certains paquets courants comme <systemitem role="package">autofs</systemitem>(remplacé par <systemitem role="package">autofs5</systemitem>), <systemitem role="package">dhcp3</systemitem>(remplacé par <systemitem role="package">isc-dhcp</systemitem>), <systemitem role="package">madwifi-source</systemitem>, <systemitem role="package">python-setuptools</systemitem> et <systemitem role="package">python2.4</systemitem> (remplacé par <systemitem role="package">python2.6</systemitem>). Pour plus d'informations sur les paquets obsolètes dans &Releasename;, consultez <xref linkend="obsolete"/>.
it: Alcuni pacchetti comuni che ci si attende vengano rimossi includono: <systemitem role="package">autofs</systemitem> (sostituito da <systemitem role="package">autofs5</systemitem>), <systemitem role="package">dhcp3</systemitem> (sostituito da <systemitem role="package">isc-dhcp</systemitem>), <systemitem role="package">madwifi-source</systemitem>, <systemitem role="package">python-setuptools</systemitem> e <systemitem role="package">python2.4</systemitem> (sostituito da <systemitem role="package">python2.6</systemitem>). Per un elenco più completo di pacchetti resi obsoleti con &releasename; si consulti <xref linkend="obsolete"/>.
ja: 削除されるだろうと予想されるパッケージには以下のものがあります。<systemitem role="package">autofs</systemitem> (<systemitem role="package">autofs5</systemitem> で置き換え)、<systemitem role="package">dhcp3</systemitem> (<systemitem role="package">isc-dhcp</systemitem> で置き換え)、<systemitem role="package">madwifi-source</systemitem>、<systemitem role="package">python-setuptools</systemitem>、<systemitem role="package">python2.4</systemitem> (<systemitem role="package">python2.6</systemitem> で置き換え)。&releasename; で時代遅れとなるパッケージについての詳細な情報は、<xref linkend="obsolete"/>を参照してください。
pt: Alguns pacotes comuns que é de esperar que sejam removidos incluem: <systemitem role="package">autofs</systemitem> (substituído pelo <systemitem role="package">autofs5</systemitem>), <systemitem role="package">dhcp3</systemitem> (substituído pelo <systemitem role="package">isc-dhcp</systemitem>), <systemitem role="package">madwifi-source</systemitem>, <systemitem role="package">python-setuptools</systemitem> e <systemitem role="package">python2.4</systemitem> (substituído pelo <systemitem role="package">python2.6</systemitem>). Para mais informação sobre pacotes obsoletos em &releasename;, veja <xref linkend="obsolete"/>.
ro: Câteva pachete comune care este de așteptat să fie îndepărtate: <systemitem role="package">autofs</systemitem> (înlocuit de <systemitem role="package">autofs5</systemitem>), <systemitem role="package">dhcp3</systemitem> (înlocuit de <systemitem role="package">isc-dhcp</systemitem>), <systemitem role="package">madwifi-source</systemitem>, <systemitem role="package">python-setuptools</systemitem> și <systemitem role="package">python2.4</systemitem> (înlocuit de <systemitem role="package">python2.6</systemitem>). Pentru informații suplimentare despre pachetele învechite în &releasename;, citiți <xref linkend="obsolete"/>.
sv: Några vanliga paket som förväntas bli borttagna är bland annat <systemitem role="package">autofs</systemitem>(ersatt av <systemitem role="package">autofs5</systemitem>), <systemitem role="package">dhcp3</systemitem> (ersatt av <systemitem role="package">isc-dhcp</systemitem>), <systemitem role="package">madwifi-source</systemitem>, <systemitem role="package">python-setuptools</systemitem> och <systemitem role="package">python2.4</systemitem> (ersatt av <systemitem role="package">python2.6</systemitem>). För mer information om föråldrade paket i &releasename;, läs <xref linkend="obsolete"/>.

source: Errors running aptitude or apt-get
fr: Erreurs lors de l'utilisation d'aptitude ou d'apt-get
it: Errori durante l'esecuzione di aptitude o apt-get
ja: aptitude あるいは apt-get 実行中のエラー
pt: Erros ao correr o aptitude ou o apt-get
ro: Erori la rularea aptitude sau apt-get
sv: Fel under exekvering av aptitude eller apt-get

source: If an operation using <command>aptitude</command>, <command>apt-get</command>, or <command>dpkg</command> fails with the error
fr: Si une opération utilisant <command>aptitude</command>, <command>apt-get</command> ou <command>dpkg</command> échoue avec l'erreur suivante :
it: Se un'operazione che usa <command>aptitude</command>, <command>apt-get</command> o <command>dpkg</command> fallisce con l'errore
ja: <command>aptitude</command> や <command>apt-get</command>、<command>dpkg</command> を使用した操作が次のようなエラーで失敗に終わるかもしれません。
ml: ഒരു <command>aptitude</command>, <command>apt-get</command>, അല്ലെങ്കില്‍ <command>dpkg</command> നടപടി താഴെ പറയുന്നൊരു പിശകോടെ പരാജയപ്പെടുകയാണെങ്കില്‍
pt: Se uma operação que utilize o <command>aptitude</command>, <command>apt-get</command> ou o <command>dpkg</command> falhar com o erro
ro: Dacă o operațiune ce utilizează <command>aptitude</command>, <command>apt-get</command> sau <command>dpkg</command> eșuează cu eroarea
sv: Om en åtgärd med <command>aptitude</command>, <command>apt-get</command> eller <command>dpkg</command> misslyckas med felet
zh_tw: 如果在使用 <command>aptitude</command>、<command>apt-get</command> 或 <command>dpkg</command> 的過程中失敗了並顯示以下錯誤

source: E: Dynamic MMap ran out of room
sv: F: Dynamisk MMap fick slut på utrymme E: Dynamic MMap ran out of room

source: the default cache space is insufficient. You can solve this by either removing or commenting lines you don't need in <filename>/etc/apt/sources.list</filename> or increasing the cache size. The cache size can be increased by setting <literal>APT::Cache-Limit</literal> in <filename>/etc/apt/apt.conf</filename>. The following command will set it to a value that should be sufficient for the upgrade:
fr: l'espace de cache par défaut est insuffisant. Vous pouvez résoudre cela soit en enlevant ou en commentant des lignes dont vous n'avez pas besoin dans <filename>/etc/apt/sources.list</filename>, soit en augmentant la taille du cache. La taille du cache peut être augmentée en positionnant <literal>APT::Cache-Limit</literal> dans <filename>/etc/apt/apt.conf</filename>. La commande suivante le positionne à une valeur qui devrait être suffisante pour la mise à niveau :
it: significa che lo spazio predefinito della cache è insufficiente. È possibile risolvere questo problema rimuovendo o riducendo a commenti righe inutili in <filename>/etc/apt/sources.list</filename>, oppure aumentando la dimensione della cache, dando un opportuno valore alla variabile <literal>APT::Cache-Limit</literal> in <filename>/etc/apt/apt.conf</filename>. Il seguente comando la imposterà a un valore che dovrebbe essere sufficiente per l'aggiornamento:
ja: この場合、デフォルトのキャッシュ容量では不十分だということになります。これを解決するには、<filename>/etc/apt/sources.list</filename> から不要な行を削除もしくはコメントアウトするか、キャッシュサイズを増やします。キャッシュサイズを増やすには、<filename>/etc/apt/apt.conf</filename> に <literal>APT::Cache-Limit</literal> を設定します。以下のコマンドを実行すれば、アップグレードするのに十分な値が設定されます。
ml: സഹജമായ സൂക്ഷിപ്പ്സ്ഥലം വേണ്ടത്ര ഇല്ല. സൂക്ഷിപ്പ് സ്ഥലത്തിന്റെ വ്യാ‌‌പ്തി വര്ദ്ധിപ്പിച്ചോ <filename>/etc/apt/sources.list</filename>ലെ നിങ്ങള്ക്ക് അവശ്യ‌‌മില്ലാത്ത വരികളില്‍ അഭിപ്രായപ്രകടനം നടത്തിയോ നീക്കംചെയ്തോ ഇത് പരിഹരിക്കാവുന്നതേ ഉള്ളൂ. തഴെകൊടുത്ത ആജ്ഞ പുതുക്കല്‍ നടപടികള്‍ക്കാവശ്യ‌‌മായ ഒരു മൂല്യം നല്‍കിക്കൊള്ളും.
pt: o espaço de cache predefinido é insuficiente. Pode resolver isto tanto pela remoção ou comentar as linhas de que não necessita em <filename>/etc/apt/sources.list</filename> ou aumentando o tamanho da cache. A dimensão da cache pode ser aumentada definindo <literal>APT::Cache-Limit</literal> em <filename>/etc/apt/apt.conf</filename>. O seguinte comando definirá para um valor que deverá ser suficiente para a actualização:
ro: înseamnă că spațiul de stocare temporară implicit este insuficient. Puteți rezolva această problemă fie prin eliminarea sau comentarea liniilor de care nu aveți nevoie din <filename>/etc/apt/sources.list</filename>, fie prin mărirea dimensiunii spațiului de stocare temporară. Dimensiunea acestuia poate fi mărită prin opțiunea de configurare <literal>APT::Cache-Limit</literal> în <filename>/etc/apt/apt.conf</filename>. Următoarea comandă va configura o valoare suficientă pentru actualizare:
sv: räcker inte standardutrymmet för cachen till. Du kan lösa det här genom att antingen ta bort eller kommentera rader som du inte behöver i <filename>/etc/apt/sources.list</filename> eller genom att öka storleken på cachen. Storleken på cachen kan ökas genom att ställa in <literal>APT::Cache-Limit</literal> i <filename>/etc/apt/apt.conf</filename>. Följande kommando kommer att ställa in den till ett värde som ska vara tillräckligt för uppgraderingen:

source: This assumes that you do not yet have this variable set in that file.
fr: Cela suppose que vous n'avez pas déjà positionné cette variable dans ce fichier.
it: Questo assume che la variabile non sia ancora stata impostata in quel file.
ja: ここでは、<filename>/etc/apt/apt.conf</filename> ファイル内にまだこの値を設定していない場合を想定しています。
ml: ആ ഫയലില്‍ ഈ ചരം നിങ്ങള്‍ സജ്ജീകരിച്ചിട്ടില്ലെന്നിതു് ഊഹിയ്ക്കുന്നു.
pt: Assume que não tem ainda nenhuma variável definida neste ficheiro.
ro: Aceasta presupune că nu aveți configurată în prealabil o valoare pentru această variabilă.
sv: Det här förutsätter att du inte redan har ställt in variabeln i den filen.
zh_tw: 在此則假設了您尚未在該檔案中設定這個變數。
