Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: for each Debian Binary CD-ROM you have, to add the data about each CD to APT's database.
fr: pour chaque CD binaire Debian en votre possession, afin d'ajouter ses données dans la base d'apt.
it: per ciascun CD-ROM di binari di Debian che si possiede, al fine di aggiungere i dati di ciascun CD al database di APT.
ja: を、Debian Binary CD-ROM それぞれに対して実行してください。各 CD に関するデータが APT のデータベースに追加されます。
ml: നിങ്ങളുടെ കയ്യിലുള്ള ഓരോ ഡെബിയന്‍ ബൈനറി സിഡിയെക്കുറിച്ചുമുള്ള വിവരം ആപ്റ്റ് ഡാറ്റാബേസില്‍ ചേര്‍ക്കുക.
pt: para cada CD-ROM de Binários Debian que possua, para adicionar informação de cada CD à base de dados APT.
ro: pentru fiecare CD-ROM Debian cu binare pe care îl aveți, pentru a adăuga date despre fiecare CD în baza de date APT.
sv: för varje Debian cd-rom med binärer som du har tillgång till för att lägga till data om varje cd till APT:s databas.
zh_tw: 來把每一張光碟的資料加到 APT 的資料庫中。

source: Upgrading packages
fr: Mettre à niveau les paquets
it: Aggiornare i pacchetti
ja: パッケージのアップグレード
ml: പൊതികള്‍ നവീകരിയ്ക്കുന്നതു്
pt: Actualizar pacotes
ro: Actualizarea pachetelor
sv: Uppgradering av paket
zh_tw: 進行套件的升級

source: The recommended way to upgrade from previous &debian; releases is to use the package management tool <command>apt-get</command>. In previous releases, <command>aptitude</command> was recommended for this purpose, but recent versions of <command>apt-get</command> provide equivalent functionality and also have shown to more consistently give the desired upgrade results.
fr: Pour une mise à niveau des versions précédentes de &debian;, il est recommandé d'utiliser le gestionnaire de paquets <command>apt-get</command>. Lors des versions précédentes, <command>aptitude</command> était recommandé, mais les dernières versions d'<command>apt-get</command> fournissent des fonctions équivalentes et se sont montré plus robustes pour fournir le résultat de mise à niveau attendu.
it: Il metodo raccomandato per l'aggiornamento dalle versioni precedenti di &debian; prevede l'utilizzo del gestore dei pacchetti <command>apt-get</command>. Nelle versioni precedenti era consigliato <command>aptitude</command> per questo scopo, ma le versioni più recenti di <command>apt-get</command> forniscono delle funzionalità equivalenti e si sono mostrate anche più affidabili negli aggiornamenti.
ja: &debian; の前回のリリースからのお勧めのアップグレード方法は、パッケージ管理ツール <command>apt-get</command> を用いる方法です。前回のリリースでは、この作業には <command>aptitude</command> が推奨されていましたが、<command>apt-get</command> の最近のバージョンでは同等の機能が提供されており、さらにより高い整合性により望ましいアップグレード結果をもたらします。
pt: A forma recomendada para actualizar a partir de lançamentos anteriores &debian; é usar a ferramenta de gestão de pacotes <command>apt-get</command>. Em lançamentos anteriores, o <command>aptitude</command> era recomendado para este objectivo, mas as versões recentes do <command>apt-get</command> disponibilizam funcionalidades equivalentes e também têm mostrado serem mais consistentes a dar os resultados de actualização desejados.
ro: Metoda recomandată pentru actualizarea de la versiuni &debian; precedente este folosirea utilitarului pentru administrarea pachetelor <command>apt-get</command>. În lansările anterioare utilitarului <command>aptitude</command> era recomandat pentru acest scop, dar versiuni recente ale <command>apt-get</command> oferă același nivel de funcționalitate și se pare că produce în mai multe cazuri rezultatul dorit la actualizări.
sv: Det rekommenderade sättet att uppgradera från tidigare &debian; utgåvor är att använda pakethanteringsverktyget <command>apt-get</command>. I tidigare utgåvor har <command>aptitude</command> varit det rekommenderade verktyget men nya versioner av <command>apt-get</command> ger likvärdig funktionalitet och har visat sig mer konsekvent i beräkning av uppgraderingsvägen och dess resultat.

source: Don't forget to mount all needed partitions (notably the root and <filename>/usr</filename> partitions) read-write, with a command like:
fr: N'oubliez pas de monter les partitions requises (notamment les partitions racine et <filename>/usr</filename>) en lecture et écriture, avec une commande de ce type :
it: Non ci si dimentichi di montare tutte le partizioni necessarie (in particolare le partizioni radice e <filename>/usr</filename>) in modalità di lettura e scrittura, con un comando del tipo:
ja: まず、必要なすべてのパーティション (特にルートパーティションと <filename>/usr</filename> パーティション) を read-write モードでマウントするのを忘れずに行いましょう。それには以下のようなコマンドを使います。
ml: ആവശ്യമായ എല്ലാ ഡിസ്ക് ഭാഗങ്ങളും (റൂട്ട്, <filename>/usr</filename> എന്നീ ഡിസ്ക്ക് ഭാഗങ്ങള്‍ പ്രത്യേകിച്ചു്) എഴുതാനും വായിയ്ക്കാനും പറ്റുന്ന തരത്തില്‍ താഴെ പറയുന്ന പൊലൊരു ആജ്ഞ ഉപയോഗിച്ചു് ചേര്‍ക്കാന്‍ മറക്കരുതു്:
pt: Não se esqueça de montar todas as partições necessárias (nomeadamente a partição root e <filename>/usr</filename>) em modo de leitura-escrita, com um comando como:
ro: Nu uitați să montați toate partițiile necesare (în special partiția rădăcină și partiția <filename>/usr</filename>) în mod citire-scriere, cu o comandă ca:
sv: Glöm inte att montera alla nödvändiga partitioner (speciellt rot- och <filename>/usr</filename>-partitionerna) läs- och skrivbara, med ett kommando som det här:
zh_tw: 不要忘了用類似以下的指令把所有會用到的分割區（特別是 <filename>/usr</filename> 和 root 分割區）重新以可讀寫的模式掛載：

source: # mount -o remount,rw /<replaceable>mountpoint</replaceable>
fr: # mount -o remount,rw /<replaceable>point_de_montage</replaceable>
it: # mount -o remount,rw /<replaceable>puntodimount</replaceable>
ja: # mount -o remount,rw /<replaceable>マウントポイント</replaceable>
ro: # mount -o remount,rw /<replaceable>punct_de_montare</replaceable>
sv: # mount -o remount,rw /<replaceable>monteringsplats</replaceable>

source: Next you should double-check that the APT source entries (in <filename>/etc/apt/sources.list</filename>) refer either to <quote><literal>&releasename;</literal></quote> or to <quote><literal>stable</literal></quote>. There should not be any sources entries pointing to &oldreleasename;.
fr: Puis, vérifiez à nouveau que les sources d'apt (dans <filename>/etc/apt/sources.list</filename>) se réfèrent soit à <quote><literal>&releasename;</literal></quote> soit à <quote><literal>stable</literal></quote>. Il ne doit y avoir aucune source pointant vers &Oldreleasename;.
it: Si dovrebbe poi controllare molto attentamente che le voci sulle fonti di APT (contenute in <filename>/etc/apt/sources.list</filename>) facciano riferimento a <quote><literal>&releasename;</literal></quote> o a <quote><literal>stable</literal></quote>. Non ci dovrebbero essere voci di fonti che puntano a &oldreleasename;.
ja: 次に、(<filename>/etc/apt/sources.list</filename> 内の) APT ソースのエントリが <quote><literal>&releasename;</literal></quote> と <quote><literal>stable</literal></quote> のいずれか一方を指定していることを念入りにチェックしてください。&oldreleasename; を指し示すソースエントリが含まれてはいけません。
ml: അടുത്തതായി നിങ്ങള്‍ (<filename>/etc/apt/sources.list</filename> ലെ) ആപ്റ്റ് ഉറവിട ചാര്‍ത്തുകള്‍ <quote><literal>&releasename;</literal></quote> അല്ലെങ്കില്‍ <quote><literal>stable</literal></quote> എന്നാണു് സൂചിപ്പിയ്ക്കുന്നതെന്നു് ഒന്നുകൂടി ഉറപ്പാക്കുക. &oldreleasename; നെ സൂചിപ്പിയ്ക്കുന്ന ഒരു വരികളും ഉണ്ടാകരുതു്.
pt: De seguida você deverá confirmar novamente que as entradas das fontes do APT (em <filename>/etc/apt/sources.list</filename>), se referem a <quote><literal>&releasename;</literal></quote> ou a <quote><literal>stable</literal></quote>. Não deverão existir quaisquer entradas de fontes que apontem para &oldreleasename;.
ro: În continuare ar trebui să verificați că sursele APT (din <filename>/etc/apt/sources.list</filename>) se referă la <quote><literal>&releasename;</literal></quote> sau la <quote><literal>stable</literal></quote>. Nu ar trebui să fie nici o sursă care se referă la &oldreleasename;.
sv: Efter det ska du kontrollera att källraderna för APT (i <filename>/etc/apt/sources.list</filename>) refererar antingen till <quote><literal>&releasename;</literal></quote> eller till <quote><literal>stable</literal></quote>. Det ska inte finnas några källrader som pekar till &oldreleasename;.

source: Source lines for a CD-ROM might sometimes refer to <quote><literal>unstable</literal></quote>; although this may be confusing, you should <emphasis>not</emphasis> change it.
fr: Les lignes de source pour un CD se réfèrent souvent à <quote><literal>unstable</literal></quote> ; bien que cela soit trompeur, vous ne devez <emphasis>pas</emphasis> les changer.
it: Qualche volta le righe delle fonti per un CD-ROM potrebbero fare riferimento a <quote><literal>unstable</literal></quote>; sebbene ciò possa generare confusione <emphasis>non</emphasis> le si dovrebbe modificare.
ja: CD-ROM のソース行は <quote><literal>unstable</literal></quote> を指定していることがよくあります。これは混乱の元かもしれませんが、変更すべきでは<emphasis>ありません</emphasis>。
pt: As linhas de fontes de um CD-ROM poderão por vezes referirem-se a <quote><literal>unstable</literal></quote>; e embora isto possa ser confuso, você <emphasis>não</emphasis> deverá alterá-las.
ro: Liniile de surse pentru CD-ROM pot uneori conține <quote><literal>unstable</literal></quote>. Deși asta ar putea fi derutant, ele <emphasis>nu</emphasis> trebuie schimbate.
sv: Källrader för en cd-skiva kommer ofta att referera till <quote><literal>unstable</literal></quote>, även om det här är konstigt ska du <emphasis>inte</emphasis> ändra dem.

source: Recording the session
fr: Enregistrer la session
it: Registrazione della sessione
ja: セッションの記録
ml: പ്രവര്‍ത്തനവേള പിടിച്ചുവയ്ക്കുന്നതു്
pt: Gravar a sessão
ro: Înregistrarea sesiunii
sv: Spela in sessionen
zh_tw: 記錄歷程

source: It is strongly recommended that you use the <command>/usr/bin/script</command> program to record a transcript of the upgrade session. Then if a problem occurs, you will have a log of what happened, and if needed, can provide exact information in a bug report. To start the recording, type:
fr: Il est fortement recommandé d'utiliser le programme <command>/usr/bin/script</command> pour enregistrer une transcription de la session de mise à niveau. Ainsi, quand un problème survient, vous avez un enregistrement de ce qui s'est passé, et vous pouvez fournir les informations exactes pour un rapport de bogue. Pour démarrer un enregistrement, saisissez :
it: È fortemente raccomandato l'utilizzo del programma <command>/usr/bin/script</command> per registrare una trascrizione della sessione di aggiornamento. In tal modo, se si verificasse un problema si disporrà di una registrazione di quanto accaduto e, se necessario, si potranno fornire le informazioni esatte in un'eventuale segnalazione di errori. Per avviare la registrazione, si digiti:
ja: ここで強くお勧めしたいのですが、<command>/usr/bin/script</command> プログラムを使って、このアップグレードセッションの記録を取るようにしましょう。こうすれば、何らかの問題が生じたときに何が起こったかを記録しておくことができ、必要に応じてバグ報告に正確な情報を含めることができます。記録を開始するには次のように入力します。
ml: <command>/usr/bin/script</command> എന്ന ആജ്ഞ ഉപയോഗിച്ചു് നിങ്ങളുടെ നവീകരണ പ്രവര്‍ത്തനവേളയുടെ ഒരു ട്രാന്‍സ്ക്രിപ്റ്റ് സൂക്ഷിച്ചു് വയ്ക്കണമെന്നു് ശക്തമായി ശുപാര്‍ശ ചെയ്യുന്നു. ഇങ്ങനെ ചെയ്താല്‍ എന്തെങ്കിലും പ്രശ്നം സംഭവിയ്ക്കുന്ന സന്ദര്‍ഭത്തില്‍ നിങ്ങള്‍ക്കു് എന്താണു് സംഭവിച്ചതെന്നതിന്റെ ഒരു നാള്‍വഴി കയ്യിലുണ്ടാവുകയും, ആവശ്യം വന്നാല്‍, പിഴവറിയിയ്ക്കുമ്പോള്‍ നല്‍കുകയും ചെയ്യാം. പിടിച്ചു് വയ്ക്കാന്‍‌, താഴെ പറയുമ്പോലെ അടിച്ചു് വയ്ക്കുക:
pt: É-lhe fortemente recomendado que utilize o programa <command>/usr/bin/script</command> para gravar uma transcrição da sessão de actualização. Assim caso ocorra qualquer problema, terá o relatório sobre o que aconteceu, e se necessário poderá fornecer informação exacta sob a forma de um relatório de erro. Para iniciar a gravação, escreva:
ro: Este recomandat să utilizați programul <command>/usr/bin/script</command> pentru a înregistra sesiunea de actualizare. În cazul în care intervine vreo problemă veți avea un istoric a ceea ce s-a întâmplat, iar dacă este nevoie, veți putea oferi informații exacte când raportați problema. Pentru a porni înregistrarea, tastați:
sv: Det rekommenderas starkt att du använder programmet <command>/usr/bin/script</command> för att spela in en utskrift av uppgraderingssessionen. Om problem uppstår har du en logg på vad som hände och, om det behövs, kan tillhandahålla exakt information i en felrapport. För att påbörja inspelningen, kör:
zh_tw: 我們強烈建議您使用 <command>/usr/bin/script</command> 這個程式來記錄升級的完整過程。因為一旦發生了任何問題，您手上就會有發生了什麼問題的確實記錄，而在必要之時，在錯誤報告中也能據此提供確實的資訊。若要開始進行記錄，請使用

source: or similar. If you have to rerun the typescript (e.g. if you have to reboot the system) use different <replaceable>step</replaceable> values to indicate which step of the upgrade you are logging. Do not put the typescript file in a temporary directory such as <filename>/tmp</filename> or <filename>/var/tmp</filename> (files in those directories may be deleted during the upgrade or during any restart).
it: o un comando simile. Se fosse necessario fare la trascrizione di un'altra sessione (perché, per esempio, è necessario riavviare il sistema), usare valori diversi per <replaceable>step</replaceable> in modo da indicare anche la fase dell'aggiornamento che si sta registrando. Non si collochi il file della registrazione in una directory temporanea come <filename>/tmp</filename> o <filename>/var/tmp</filename>, in quanto i file in queste directory potrebbero venir cancellati durante l'aggiornamento o durante un qualunque riavvio.
ro: sau similar. Dacă trebuie să porniți înregistrarea din nou (ex. dacă trebuie să reporniți sistemul) folosiți valori diferite pentru <replaceable>etapă</replaceable> pentru a indica ce etapă a actualizării este înregistrată. Nu puneți fișierul script într-un director temporar cum ar fi <filename>/tmp</filename> sau <filename>/var/tmp</filename> (fișiere în aceste directoare ar putea fi șterse în timpul actualizării sau la o repornire).
sv: eller liknande. Om du behöver köra typescript-filen igen (exempelvis om du behövde starta om systemet) ska du använda olika <replaceable>step</replaceable>-värden för att peka ut vilket steg av uppgraderingen du loggar. Lägg inte typescript-filen i en temporär katalog såsom<filename>/tmp</filename> eller <filename>/var/tmp</filename> (filer i dessa kataloger kan tas bort under uppgraderingen eller under en omstart).

source: The typescript will also allow you to review information that has scrolled off-screen. If you are at the system's console, just switch to VT2 (using <keycombo action='simul'><keycap>Alt</keycap><keycap>F2</keycap></keycombo>) and, after logging in, use <literal>less -R ~root/upgrade-&releasename;.script</literal> to view the file.
fr: Le fichier d'enregistrement vous permettra également de revoir les informations qui ont défilé. Basculez simplement sur la deuxième console (en utilisant <keycombo action='simul'><keycap>Alt</keycap><keycap>F2</keycap></keycombo>) et, après la connexion, utilisez <literal>less -R ~root/upgrade-&releasename;.script</literal> pour voir le fichier.
it: Il file generato permetterà anche di rileggere le informazioni scorse fuori dalla schermata. Se si usa la console di sistema, basterà passare a VT2 (con <keycombo action='simul'><keycap>Alt</keycap><keycap>F2</keycap></keycombo>) e, dopo aver effettuato l'accesso, utilizzare il comando <literal>less -R ~root/upgrade-&releasename;.script</literal> per visualizzare il file.
ja: また、typescript ファイルに記録することで、スクロールしてスクリーンから消えた情報をもう一度見ることができるようにもなります。システムのコンソールの前に居る場合は、(<keycombo action='simul'><keycap>Alt</keycap><keycap>F2</keycap></keycombo> を使って) 2 番の仮想コンソールに切り替えて、ログインしてから <literal>less -R ~root/upgrade-&releasename;.script</literal> と実行すれば当該ファイルを見ることができます。
pt: O transcrito permitir-lhe-á também rever informação que tenha sido deslocada para fora do ecrã. Se está na consola do sistema, mude para VT2 (utilizando <keycombo action='simul'><keycap>Alt</keycap><keycap>F2</keycap></keycombo>) e, depois de iniciar a sessão, utilize <literal>less -R ~root/upgrade-&releasename;.script</literal> para visualizar o ficheiro.
ro: Fișierul script vă va permite, de asemenea, să consultați informația care a defilat în afara ecranului. Dacă sunteți la consola sistemul puteți schimba la VT2 (folosind <keycombo action='simul'><keycap>Alt-F2</keycap></keycombo>) și, după ce vă autentificați, utilizați <literal>less -R ~root/actualizare-&releasename;.script</literal> pentru a vedea fișierul.
sv: Typescript kommer även att låta dig granska informationen som har rullat ut från skärmen. Om du använder systemets konsoll kan du helt enkelt växla till VT2 (med <keycombo action='simul'><keycap>Alt</keycap><keycap>F2</keycap></keycombo>) och, efter inloggning, använd <literal>less -R ~root/upgrade-&releasename;.script</literal> för att visa filen.

source: After you have completed the upgrade, you can stop <command>script</command> by typing <literal>exit</literal> at the prompt.
fr: Après avoir terminé la mise à niveau, vous pouvez stopper l'enregistrement en entrant <literal>exit</literal> à l'invite de commandes.
it: Dopo aver completato l'aggiornamento si può arrestare <command>script</command>, digitando <literal>exit</literal> al prompt.
ja: アップグレード完了後に <command>script</command> を停止するには、プロンプトから <literal>exit</literal> と入力してください。
ml: നവീകരണം പൂര്‍ത്തിയാക്കിയ ശേഷം <literal>exit</literal> എന്നു് പ്രോംറ്റില്‍ അടിച്ചു് <command>script</command> നിര്‍ത്താം.
pt: Depois de ter completado a actualização, pode parar o <command>script</command> escrevendo <literal>exit</literal> na aviso de comando.
ro: După terminarea actualizării, puteți opri comanda <command>script</command> tastând <literal>exit</literal> la prompt.
sv: Efter att du har färdigställt uppgraderingen, kan du stoppa <command>script</command> genom att ange <literal>exit</literal> vid prompten.
zh_tw: 在您完成升級作業後，您可以藉由在命令列上鍵入 <literal>exit</literal> 來關閉 <command>script</command>。

source: If you have used the <emphasis>-t</emphasis> switch for <command>script</command> you can use the <command>scriptreplay</command> program to replay the whole session:
fr: Si vous avez utilisé l'option <emphasis>-t</emphasis> de <command>script</command>, vous pouvez utiliser le programme <command>scriptreplay</command> pour rejouer la session entière :
it: Se si è utilizzato il parametro <emphasis>-t</emphasis> per <command>script</command>, si può utilizzare il programma <command>scriptreplay</command> per replicare l'intera sessione:
ja: <command>script</command> に <emphasis>-t</emphasis> スイッチをつけておいた場合は、以下のように <command>scriptreplay</command> プログラムでセッション全体をリプレイできます。
ml: <command>script</command>ന് വേണ്ടി <emphasis>-t</emphasis>സ്വിച്ച് ഉപയോഗിച്ചിട്ടുണ്ടെങ്കില്‍ <command>scriptreplay</command> പരിപാടി ഉപയോഗിച്ച് ആ മണ്ഡലം(session) മുഴുവന്‍ പുനര്‍പ്രവര്‍ത്തനം നടത്താം.‍
pt: Se você utilizou a opção <emphasis>-t</emphasis> para o <command>script</command> você pode utilizar o programa <command>scriptreplay</command> para ver uma repetição de toda a sessão:
ro: Dacă ați folosit opțiunea <emphasis>-t</emphasis> a lui <command>script</command> puteți folosi programul <command>scriptreplay</command> pentru a reda întreaga sesiune:
sv: Om du har använt flaggan <emphasis>-t</emphasis> för <command>script</command> kan du använda programmet <command>scriptreplay</command> för att spela upp hela sessionen:
zh_tw: 如果您在 <command>script</command> 上使用了 <emphasis>-t</emphasis> 參數，您可以利用 <command>scriptreplay</command> 程式來重新播放整個過程：

source: Updating the package list
fr: Mettre à jour la liste des paquets
it: Aggiornamento della lista dei pacchetti
ja: パッケージリストの更新
ml: പൊതികളുടെ പട്ടിക പുതുക്കിക്കാന്‍
pt: Actualizar a lista de pacotes
ro: Actualizarea listei de pachete
sv: Uppdatering av paketlistan
zh_tw: 更新套件的列表

source: First the list of available packages for the new release needs to be fetched. This is done by executing:
fr: La liste des paquets disponibles pour la nouvelle version doit tout d'abord être récupérée, avec cette commande :
it: Anzitutto deve essere recuperata la lista dei pacchetti disponibili per la nuova versione. Lo si fa eseguendo:
ja: まず、新しいリリースで利用可能なパッケージの一覧を取得する必要があります。そのためには以下のコマンドを実行してください。
ml: ആദ്യം പുതിയ പതിപ്പിനു് ലഭ്യമായ എടുക്കേണ്ട പൊതികള്‍ കാണുക. താഴെ പറയുന്നതു് പ്രവര്‍ത്തിപ്പിച്ചു് ഇതു് ചെയ്യാം:
pt: Primeiro precisa de ser obtida a lista de pacotes disponíveis para o novo lançamento. Isto é feito executando:
ro: Mai întâi trebuie preluată lista pachetelor disponibile în noua versiune. Aceasta se face cu:
sv: Först behöver listan över tillgängliga paket för den nya utgåvan hämtas. Det görs genom att köra:
zh_tw: 首先，必須先取得在新釋出版上的可取用的套件列表。這可以利用以下指令進行：

source: Make sure you have sufficient space for the upgrade
fr: Assurez-vous d'avoir suffisamment d'espace disque pour la mise à niveau
it: Accertarsi di avere spazio disponibile a sufficienza per l'aggiornamento
ja: アップグレードするのに十分な領域があることを確認する
ml: നവീകരണത്തിനാവശ്യമായ സ്ഥലം നിങ്ങള്‍ക്കുണ്ടെന്നുറപ്പുവരുത്തുക
pt: Certificar-se que possui espaço suficiente para a actualização
ro: Verificați dacă aveți suficient spațiu pentru actualizare
sv: Se till att du har tillräckligt med utrymme för uppgraderingen
zh_tw: 確認您有足夠的空間可以用來進行升級
