Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: If you have a 2.4 kernel installed, and your system relies on <systemitem role="package">hotplug</systemitem> for its hardware detection you should first upgrade to a 2.6 series kernel from &oldreleasename; before attempting the upgrade. Make sure that the 2.6 series kernel boots your system and all your hardware is properly detected before you perform the upgrade. The <systemitem role="package">hotplug</systemitem> package is removed from the system (in favor of <systemitem role="package">udev</systemitem>) when you do a full system upgrade. If you do not do the kernel upgrade before this your system might not boot up properly from this point on. Once you have done an upgrade to a 2.6 series kernel in &oldreleasename; you can do a kernel upgrade as described in <xref linkend="upgrade-from-2.6"/>.
ml: ഖരസാമാഗ്രികളുടെ കണ്ടെത്തലിന് <systemitem role="package">hotplug</systemitem> നെ അടിസ്ഥാനമാക്കിയുള്ള 2.4കേര്‍ണലാണ് നിങ്ങള്‍ക്കുള്ളതെങ്കില്‍ നവീകരണത്തിന് ശ്രമിക്കുന്നതിന് മുമ്പായി &oldreleasename;ലെ കേര്‍ണല്‍ 2.6ശ്രേണിയിലേക്ക് ഉയര്‍ത്തിയിരിക്കണം. പുതുക്കല്‍ നടപടിയ്ക്കു മുമ്പായി 2.6ശ്രേണിയിലെ കേര്‍ണല്‍ ശരിയായി ബൂട്ട് ചെയ്ത് ഖരസാമാഗ്രികളെല്ലാം‍ കൃത്യ‌‌മായി കണ്ടെത്തുന്നു എന്ന് ഉറപ്പ് വരുത്തിയിരിക്കണം. ഒരു മുഴുവ്യ‌‌വസ്ഥാനവീകരണം നടത്തുമ്പോള്‍ (<systemitem role="package">udev</systemitem>നു പകരമുള്ള) <systemitem role="package">hotplug</systemitem> പൊതി നീക്കം ചെയ്യും. ഇതിനു മുമ്പായി നിങ്ങളുടെ കേര്‍ണല്‍ നവീകരണം നടത്തിയില്ലെങ്കില്‍ ഈ നിമിഷം മുതല്‍ വ്യവസ്ഥ ശരിയായി ബൂട്ട് ചെയ്യുന്നതിന് പ്രയാസം നേരിടും. &oldreleasename;ല്‍നിന്ന് 2.6ശ്രേണിയിലുള്ള കേര്‍ണലിലേക്ക് ഒരിക്കലെങ്കിലും ഉയര്‍ത്തിയിട്ടുണ്ടെങ്കില്‍, <xref linkend="upgrade-from-2.6"/>.ല്‍ പറഞ്ഞ പ്രകാരമുള്ള കേണല്‍ നവീകരണം നടത്താവുന്നതാണ്.

source: &releasename; features a more robust mechanism for hardware discovery than previous releases. However, this may cause changes in the order devices are discovered on your system, affecting the order in which device names are assigned. For example, if you have two network adapters that are associated with two different drivers, the devices eth0 and eth1 refer to may be swapped. Please note that the new mechanism means that if you e.g. exchange ethernet adapters in a running &releasename; system, the new adapter will also get a new interface name.
ml: മുന്‍പതിപ്പുകളെ അപേക്ഷിച്ച് ഖരസാമാഗ്രികള്‍ കണ്ടെത്തുന്നതിന് &releasename; കൂടുതല്‍ കരുത്തുള്ള പ്രകടനമാണ് കാഴ്ചവെക്കുന്നത്. എന്നിരുന്നാലും, ഉപകരണങ്ങള്‍ക്ക് പേരുകള്‍ നല്‍കുന്ന ക്രമത്തെ ബാധിക്കുന്ന മട്ടില്‍ നിങ്ങളുടെ വ്യവസ്ഥിതിയില്‍ ഉപകരണനാമങ്ങള്‍ കണ്ടെത്തുന്ന മുറയ്ക്ക് മാറ്റം വരാന്‍ കാരണമാകുന്നുണ്ട്. ഉദാഹാണത്തിന്, നിങ്ങള്‍ക്ക് രണ്ട് വ്യ‌‌ത്യ‌‌സ്ഥ സാരഥി (drivers) കളുമായി ബന്ധപ്പെട്ട രണ്ട് ശൃംഖലാ കര്മ്മ അഡാപ്റ്ററുകളുണ്ടെന്ന് കരുതുക, eth0 എന്നും eth1എന്നും സൂചിപ്പിക്കപ്പെട്ട അവ തമ്മില്‍ പരസ്പരം മാറിപ്പോവാം. ഓടിക്കൊണ്ടിരിക്കുന്ന ഒരു വ്യ‌‌വസ്ഥിതിയില്‍ ഈതര്‍നെറ്റ് അഡാപ്റ്ററുകള്‍ പരസ്പരം മാറ്റുകയാണെങ്കില്‍ പുതിയ അഡാപ്റ്ററിന് ഒരു പുതിയ ഇടനിലനാമം(interface name) ലഭിക്കും എന്നുള്ളതാണ് പുതിയ ഘടനകൊണ്ട് ഉദ്ദേശിക്കുന്നത്.
zh_tw: 比起先前的釋出版本，&releasename; 在判斷硬體設備方面提供了一個更為穩健的機制。然而，這將可能會改變在您的系統上所找到的硬體的順序，進而會影響到所使用的裝置名稱。比如說，如果您有著兩片使用著不同的驅動程式的網路卡，那麼 eth0 和 eth1 的順序很可能會互換。請注意到，新的機制也代表了如果您像是置換了正在運作中的 &releasename; 系統上的網路卡，新的網路卡將會拿到一個新的介面名稱。

source: For network devices, you can avoid this reordering by using <systemitem role="package">udev</systemitem> rules, more specifically, through the definitions at <filename>/etc/udev/rules.d/70-persistent-net.rules</filename><footnote>
ml: ശൃംഖലാകര്‍മ്മ ഉപകരണങ്ങളെ സംബധിച്ചിടത്തോളം <systemitem role="package">udev</systemitem> നിയമങ്ങള്‍ ഉപയോഗിച്ച് , കൂടുതല്‍ കൃത്യ‌‌മായി പറഞ്ഞാല്‍, <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> <footnote>

source: The rules there are automatically generated by the script <filename>/etc/udev/rules.d/75-persistent-net-generator.rules</filename> to have persistent names for network interfaces. Delete this symlink to disable persistent device naming for <acronym>NIC</acronym>s by <systemitem role="package">udev</systemitem>.
ml: ശൃംഖലാകര്മ്മ വിനിമയതലങ്ങള്‍ക്ക് വിടാതെ പിന്തുടരുന്ന പേരുകളുണ്ടാവാന്‍ <filename>/etc/udev/rules.d/75-persistent-net-generator.rules</filename>ചെറു ആജ്ഞ ഉപയോഗിച്ച് യാന്ത്രികമായി സൃഷ്ടിക്കാം. <systemitem role="package">udev</systemitem>കൊണ്ട് <acronym>NIC</acronym>ക്ക് ഇത്തരം ഉപകരണങ്ങള്‍ക്കുള്ള സ്ഥിരനാമങ്ങള്‍ സൃഷ്ടിക്കുന്നത് അസാധുവാക്കാന്‍ ഈ symlink നീക്കം ചെയ്യണം.

source: </footnote>. Alternatively you can use the <command>ifrename</command> utility to bind physical devices to specific names at boot time. See <citerefentry> <refentrytitle>ifrename</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> and <citerefentry> <refentrytitle>iftab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information. The two alternatives (<systemitem role="package">udev</systemitem> and <command>ifrename</command>) should not be used at the same time.
ml: </footnote>. ലെ നിര്‍വ്വചനം വഴി ഇത്തരം പുന:ക്രമീകരണങ്ങള്‍ ഒഴിവാക്കാം. ഭൌതിക ഉപകരണങ്ങള്‍ പ്രത്യേ‌‌ക പേരുകളുമായി ബൂട്ടിംഗ് സമയത്തുതന്നെ ബന്ധിക്കാന്‍ <command>ifrename</command>ചെറു പ്രയോഗം ഉപയോഗിക്കുന്നത് വേറൊരു പോംവഴിയാണ്. കൂടുതല്‍ വിവരങ്ങള്ക്ക് <citerefentry> <refentrytitle>ifrename</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> and <citerefentry> <refentrytitle>iftab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> കാണുക. (<systemitem role="package">udev</systemitem>, <command>ifrename</command>) എന്നീ രണ്ട് പോംവഴികളും ഒരേസമയം ഉപയോഗിക്കരുത്.
zh_tw: </footnote>。除此之外，您也可以利用 <command>ifrename</command> 工具程式來在開機時替實體裝置指定特定的名稱。請參閱 <citerefentry> <refentrytitle>ifrename</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> 及 <citerefentry> <refentrytitle>iftab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> 以取得更詳盡的資訊。這兩個方案（<systemitem role="package">udev</systemitem> 及 <command>ifrename</command>）只能選擇其一，無法同時採用。

source: For storage devices, you can avoid this reordering by using <systemitem role="package">initramfs-tools</systemitem> and configuring it to load storage device driver modules in the same order they are currently loaded. To do this, identify the order the storage modules on your system were loaded by looking at the output of <command>lsmod</command>. <command>lsmod</command> lists modules in the reverse order that they were loaded in, i.e., the first module in the list was the last one loaded. Note that this will only work for devices which the kernel enumerates in a stable order (like PCI devices).
ml: സൂക്ഷിപ്പ് ഉപകരണങ്ങളുടെ കാര്യ‌‌ത്തില്‍ , <systemitem role="package">initramfs-tools</systemitem> ഉപയോഗിച്ച്, നിലവില്‍ സൂക്ഷിപ്പ് ഉപാധികളുടെ സാരഥീഘടകങ്ങള്‍ (driver modules) കയറ്റിയ അതേ ക്രമത്തില്‍ കയറ്റാന്‍ ക്രമീകരിച്ചാല്‍ ഈ ക്രമീകരണമാറ്റങ്ങള്‍ ഒഴിവാക്കാം. അതിനായി <command>lsmod</command>ന്റെ ഉത്പന്നം നോക്കി സൂക്ഷിപ്പ് ഉപാധികള്‍ കയറ്റുന്ന ക്രമം മനസ്സിലാക്കണം. <command>lsmod</command> പുറത്ത് വിടുന്ന പട്ടികയിലെ ക്രമത്തിന് നേര്‍വിപരീത ക്രമത്തിലാണ് അവ കയറ്റിയിട്ടുണ്ടാവുക, അതായത്; പട്ടികയിലെ ആദ്യ‌‌ത്തെ ഘടകം അവസാനമാണ് കയറ്റുക. കേര്‍ണല്‍ സ്ഥിരസ്വഭാവത്തോടെ കണക്കിടുന്ന (PCI ഉപകരണങ്ങളെപ്പോലെ) ഉപകരണങ്ങളുടെ കാര്യ‌‌ത്തില്‍ മാത്രമെ ഇത് പ്രാവര്ത്തികമാകൂ എന്ന് പ്രത്യേ‌‌കം ശ്രദ്ധിക്കണം.
zh_tw: 對於儲存裝置而言，您可以藉由使用 <systemitem role="package">initramfs-tools</systemitem> 並將其設定為依照目前相同的載入順序來載入儲存裝置的驅動模組以避開這個問題。為此，您可以查看 <command>lsmod</command> 的輸出來確認您的系統載入儲存裝置的驅動模組的順序。<command>lsmod</command> 會以相反的順序列出載入的模組。也就是說，在列表中的第一個模組是最後載入的。請注意到，這只在那些 Kernel 會以一定的順序來載入的裝置（像是 PCI 裝置）上能生效。

source: However, removing and reloading modules after initial boot will affect this order. Also, your kernel may have some drivers linked statically, and these names will not appear in the output of <command>lsmod</command>. You may be able to decipher these driver names and load order from looking at <filename>/var/log/kern.log</filename>, or the output of <command>dmesg</command>.
ml: ഏതായാലും, ആദ്യത്തെ ബൂട്ടിങ്ങിന് ശേഷം ഘടകങ്ങള്‍ നീക്കലും വീണ്ടും കയറ്റലും ഈ ക്രമം മാറ്റിമറിക്കും. മാത്രമല്ല, നിങ്ങളുടെ കേര്‍ണലിന് സ്ഥിരമായി ബന്ധപ്പെട്ട ചില സാരഥികളുണ്ടാവും, അവയുടെ പേരുകള്‍ <command>lsmod</command>ന്റെ ഉത്പന്നത്തില്‍ പ്രത്യ‌‌ക്ഷപ്പെടില്ല. ഈ സാരഥീനാമങ്ങള്‍ <filename>/var/log/kern.log</filename>ല്‍ നോക്കിയോ, <command>dmesg</command>ന്റെ ഉത്പന്നത്തില്‍നിന്നോ ഊഹിച്ചെടുത്ത് ക്രമത്തില്‍ കയറ്റാന്‍ കഴിഞ്ഞേക്കും.
zh_tw: 但是，在開機後移除或重新載入模組將會影響這份列表的順序。同時，您的 Kernel 也許會以靜態連結至某些模組，所以這些名稱將不會出現在 <command>lsmod</command> 的輸出裡。您也可以經由查看 <filename>/var/log/kern.log</filename> 或 <command>dmesg</command> 的輸出來辨認出這些驅動的名稱及載入順序。

source: Add these module names to <filename>/etc/initramfs-tools/modules</filename> in the order they should be loaded at boot time. Some module names may have changed between &oldreleasename; and &releasename;. For example, <literal>sym53c8xx_2</literal> has become <literal>sym53c8xx</literal>.
ml: ബൂട്ടിങ്ങ് സമയത്ത് കയറ്റിവിടേണ്ട അതേ ക്രമത്തില്‍ ഘടകങ്ങളുടെ പേരുകള്‍ <filename>/etc/initramfs-tools/modules</filename>ല്‍ ചേര്‍ക്കുക. &oldreleasename; നും &releasename;നും ഇടക്ക് ചില ഘടകങ്ങളുടെ പേരുകള്‍ക്ക് മാറ്റം വന്നിട്ടുണ്ടാവും;.ഉദാഹരണത്തിന്, <literal>sym53c8xx_2</literal> എന്നത് <literal>sym53c8xx</literal>എന്നായി മാറിയിട്ടുണ്ട്.

source: You will then need to regenerate your initramfs image(s) by executing <literal>update-initramfs -u -k all</literal>.
ml: അതിനു ശേഷം <literal>update-initramfs -u -k all</literal>.പ്രവര്‍ത്തിപ്പിച്ചുകൊണ്ട് നിങ്ങളുടെ initramfs image(s)ന്റെ പുന:സൃഷ്ടി നടത്തേണ്ടിവരും.
zh_tw: 然後，您將必須執行 <literal>update-initramfs -u -k all</literal> 來重新產生您的 initramfs 影像。

source: Once you are running a &releasename; kernel and <systemitem role="package">udev</systemitem>, you may reconfigure your system to access disks by an alias that is not dependent upon driver load order. These aliases reside in the <filename>/dev/disk/</filename> hierarchy.
ml: ഒരിക്കല്‍ ഒരു &releasename; കേര്‍ണലും <systemitem role="package">udev</systemitem>വും ഓടിത്തുടങ്ങിയാല്‍, സാരഥിയെ കയറ്റുന്ന ക്രമത്തിനെ ആശ്രയിക്കാത്ത ഉപനാമത്താല്‍ ഡിസ്കിനെ സമീപിക്കാന്‍ നിങ്ങളുടെ വ്യ‌‌വസ്ഥിതി പുന:ക്രമീകരിക്കേണ്ടതായിട്ടുണ്ട്. ഈ ഉപനാമങ്ങള്‍ <filename>/dev/disk/</filename> പരമ്പരയിലാണ് കുടിപാര്‍ക്കുന്നത്.
zh_tw: 若您使用的是 &releasename; 版的 kernel 及 <systemitem role="package">udev</systemitem>，您也許要重新設定您的系統以便能以和驅動載入順序無關的別名來進行存取。這些別名會分門別類得放在 <filename>/dev/disk/</filename> 裡。

source: When <literal>aptitude dist-upgrade</literal> has finished, the <quote>formal</quote> upgrade is complete, but there are some other things that should be taken care of <emphasis>before</emphasis> the next reboot.
ml: <literal>aptitude dist-upgrade</literal> തീര്‍ന്നാല്‍ <quote>ഔപചാരികമായ</quote> നവീകരണം പൂര്‍ത്തിയായിട്ടുണ്ടാവും എന്നാല്‍ അടുത്ത റീബൂട്ടിനു മുന്‍പ് ചെയ്യേണ്ടതായ മറ്റു ചില കാര്യങ്ങള്‍ ഉണ്ടു്

source: If you are using <systemitem role="package">lilo</systemitem> as your bootloader (it is the default bootloader for some installations of &oldreleasename;) it is strongly recommended that you rerun <command>lilo</command> after the upgrade:
ml: നിങ്ങളുടെ ബൂട്ട് ലോഡറായി <systemitem role="package">lilo</systemitem> ആണ് ഉപയോഗിക്കുന്നതെങ്കില്‍ (&oldreleasename;ലെ ചില പ്രതിഷ്ഠാപനങ്ങള്‍ക്ക് ഇതാണ് സഹജമായ ബൂട്ട്‌ലോഡറായി ഉപയോഗിക്കുന്നത്) നവീകരണത്തിനു ശേഷം <command>lilo</command> വീണ്ടും ഓടിക്കാന്‍ ശുപാര്ശ ചെയ്യുന്നു:
zh_tw: 如果您還是使用 <systemitem role="package">lilo</systemitem> 做為您的開機程式（它是 &oldreleasename; 裡某些安裝程式的預設開機程式），在此強烈建議您在升級完畢後重新執行 <command>lilo</command>：

source: If you encounter any issues when running <command>lilo</command>, review the symbolic links in <filename>/</filename> to <filename>vmlinuz</filename> and <filename>initrd</filename> and the contents of your <filename>/etc/lilo.conf</filename> for discrepancies.
ml: <command>lilo</command> ഓടിക്കുന്ന സമയത്ത് എന്തെങ്കിലും പ്രയാസം നേരിടുകയാണെങ്കില്‍ <filename>/</filename> to <filename>vmlinuz</filename>ലേയും <filename>initrd</filename>ലേയും പ്രതീകാത്മക കണ്ണികള്ളും, നിങ്ങളുടെ <filename>/etc/lilo.conf</filename> ഫയലിന്റെ ഉള്ളടക്കവും പരിശോധിക്കുമല്ലോ.
zh_tw: 如果您在執行 <command>lilo</command> 時遇到了任何問難，請再次檢查在 <filename>/</filename> 裡指向 <filename>vmlinuz</filename> 及 <filename>initrd</filename> 的符號連結，以及您的 <filename>/etc/lilo.conf</filename> 的內容是否有什麼不對勁的地方。

source: This problem can occur when the upgrade of the kernel introduces the use of the new generation of <acronym>IDE</acronym> drivers. The <acronym>IDE</acronym> disk naming convention for the old drivers was <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal>. The new drivers will name the same disks respectively <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>. The problem appears when the upgrade does not generate a new <filename>/boot/grub/menu.lst</filename> file to take the new naming convention into account. During the boot, Grub will pass a system root partition to the kernel that the kernel doesn't find.
ml: കേര്‍ണലിന്റെ നവീകരണം പുതിയ തലമുറയിലെ <acronym>IDE</acronym> സാരഥികളെ തിരുകിക്കയറ്റുമ്പോള്‍ ഇങ്ങനെ സംഭവിക്കാറുണ്ട്. <acronym>IDE</acronym> ഡിസ്കിന്റെ പഴയ സാരഥികളുടെ നാമകരണ കീഴ്‌‌വഴക്കം <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> എന്നിങ്ങനെയായിരുന്നു. അതേ ഡിസ്കുകളുടെ പുതിയ സാരഥികള്ക്ക് ക്രമത്തില്‍ <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal> എന്നുമായിരിക്കും പേര്. പുതിയ നാമകരണ കീഴ്‌‌വഴക്കം കണക്കിലെടുക്കാന്‍ നവീകരണ പ്രക്രിയ ഒരു പുതിയ <filename>/boot/grub/menu.lst</filename>ഫയലുണ്ടാക്കുന്നില്ലെങ്കിലാണ് പ്രശ്നങ്ങള്‍ പ്രത്യ‌‌ക്ഷപ്പെടുന്നത്. ബൂട്ടിങ്ങിനിടെ ഗ്രബ് അയച്ചുകൊടുക്കുന്ന അടിസ്ഥാന വിഭാജനം കേര്‍ണലിന് കണ്ടെത്താനാവുന്നില്ല.
zh_tw: 這個問題可能會發生在升級後的 kernel 採用了新的 <acronym>IDE</acronym> 裝置命名規則。舊的 <acronym>IDE</acronym> 裝置命名規則為 <literal>hda</literal>、<literal>hdb</literal>、<literal>hdc</literal>、<literal>hdd</literal>，而新的裝置則依次對應為 <literal>sda</literal>、<literal>sdb</literal>、<literal>sdc</literal>、<literal>sdd</literal>。而這個問題的發生是因為在升級過程中並沒有根據新的命名方式而建立新的 <filename>/boot/grub/menu.lst</filename>，而在開機過程中，Grub 會傳送系統 root 分割區給 kernel，但 kernel 卻找不到這個分割區。

source: One can avoid this problem entirely by using an identifier for the root filesystem that does not change from one boot to the next. There are two possible methods for doing this - labeling the filesystem, or using the filesystem's universally unique identifier (<acronym>UUID</acronym>). These methods are supported in Debian since the 'etch' release.
ml: രണ്ടു തുടര്‍ബൂട്ടിങ്ങുകള്‍ക്കിടക്ക് മാറ്റം വരാത്ത അടിസ്ഥാന ഫയല്‍വ്യവസ്ഥയുടെ താദാത്മ്യ‌‌നിരൂപകം(Identifier) ഉപയോഗിച്ചാല്‍ ഈ പ്രശ്നം അപ്പാടെ ഒഴിവാക്കാവുന്നതാണ്. ഇത് സാധിച്ചെടുക്കാന്‍ രണ്ടു പോംവഴികളുണ്ട് - ഫയല്‍വ്യ‌‌വസ്ഥക്ക് നാമപത്രം(label) ഘടിപ്പിക്കുക, അല്ലെങ്കില്‍ ഫയല്‍ വ്യ‌‌വസ്ഥക്ക് ആഗോള പ്രത്യേ‌‌കതയുള്ള തിരിച്ചറിയല്‍ ഉപാധി (<acronym>UUID</acronym>) ഉപയോഗിക്കുക. ഡെബിയന്റെ എച് പ്രകാശനത്തിന് ശേഷം ഈ രീതിക്ക് പിന്തുണ ലഭ്യ‌‌മാണ്.

source: Find out the universally unique identifier of your filesystem by issuing: <command>ls -l /dev/disk/by-uuid | grep hda6</command>
ml: താങ്കളുടെ ഫയല്‍ സിസ്റ്റത്തിന്റെ യൂണിവേഴ്സലി യൂണീക്ക് ഐഡന്റിഫയര്‍ <command>ls -l /dev/disk/by-uuid | grep hda6</command>ഉപയോഗിച്ച് കണ്ടുപിടിക്കുക

source: You should get a line similar to this one:
ml: ഇതു പോലൊരു വരി താങ്കള്‍ക്കു് കിട്ടേണ്ടതാണു്:
zh_tw: 您應該會得到類似的結果如下：

source: ## ## End Default Options ## title Debian GNU/Linux, kernel 2.6.26-1-686 root (hd0,0) kernel /vmlinuz-2.6.26-1-686 root=/dev/hda6 ro initrd /initrd.img-2.6.26-1-686 title Debian GNU/Linux, kernel 2.6.26-1-686 (single-user mode) root (hd0,0) kernel /vmlinuz-2.6.26-1-686 root=/dev/hda6 ro single initrd /initrd.img-2.6.26-1-686 ### END DEBIAN AUTOMAGIC KERNELS LIST
ml: ## ## സഹജമയ ഐച്ഛികങ്ങള്‍ അവസാനിക്കുന്നു ## ## title ഡെബിയന് ഗ്നൂ ലീനക്സ്, കേര്‍ണല്‍ 2.6.26-1-686 root (hd0,0) kernel /vmlinuz-2.6.26-1-686 root=/dev/hda6 ro initrd /initrd.img-2.6.26-1-686 title ഡെബിയന്‍ ഗ്നൂ ലീനക്സ്, കേര്‍ണല്‍ 2.6.26-1-686 (ഒരു ഉപയോക്താവിനു മാത്രമായ തരത്തില്‍) root (hd0,0) kernel /vmlinuz-2.6.26-1-686 root=/dev/hda6 ro initrd /initrd.img-2.6.26-1-686 ### ഡെബിയന്‍ യാന്ത്രിക കേര്‍ണല്‍ പട്ടിക അവസാനിക്കുന്നു.

source: If the new kernel image metapackage was pulled in as a dependency of the old one, it will be marked as automatically installed, which should be corrected:
ml: പുതിയ കേര്‍ണല്‍ ബിംബ (image)ത്തിന്റെ മെറ്റാപാക്കേജ് പഴയതിന്റെ ആശ്രിതത്വ നിലക്ക് ഉള്ളിലേക്ക് വലിച്ചെടുത്തിട്ടുണ്ടെങ്കില്‍, അത് യാന്ത്രികമായി പ്രതിഷ്ഠിക്കപ്പെട്ടതായി കണക്കാക്കും, ഇത് ഒഴിവാക്കപ്പെടേണ്ടതാണ്.
zh_tw: 如果是因為舊的 kernel image 虛擬套件之相依性關係才將新的安裝進來的話，它會被標示為被自動安裝進來的，而這必須加以修正：

source: Deprecated packages
ml: ഒഴിവാക്കപ്പെടേണ്ട പൊതികള്‍
zh_tw: 棄用的套件

source: With the next release of &debian; &nextrelease; (codenamed &nextreleasename;) a bigger number of server packages will be deprecated, thus updating to newer versions of those now will save you from trouble when updating to &nextrelease;.
ml: &debian; &nextrelease;ന്റെ അടുത്ത പ്രകാശനത്തോടുകൂടി(codenamed &nextreleasename;) കുറെയധികം സേവക പൊതികള്‍ പുതിയ പതിപ്പിലേക്ക് നവീകരിച്ചുകൊണ്ട്, ഒഴിവാക്കപ്പെടേണ്ടതായി വരും. അടുത്ത &nextrelease;ലേക്കുള്ള പുത്ക്കാല്‍ നടപടികളിലെ പ്രയാസങ്ങള്‍ ഒഴിവാക്കാന്‍ ഇതു സഹായിക്കും.

source: This includes the following packages:
ml: താഴെപ്പറയുന്ന പൊതികള്‍ ഇതിലുള്‍‌പ്പെടുന്നു:
zh_tw: 這包含了如下的套件：

source: <systemitem role="package">apache</systemitem> (1.x), successor is <systemitem role="package">apache2</systemitem>
ml: <systemitem role="package">അപ്പാച്ചെ(apache)</systemitem> (1.x), പിന്‍ഗാമിയായി(successor is) <systemitem role="package">apache2</systemitem>

source: <systemitem role="package">bind8</systemitem>, successor is <systemitem role="package">bind9</systemitem>
ml: <systemitem role="package">(ബൈന്‍ഡ്8)bind8</systemitem>, പിന്‍‌ഗാമിയായി( successor is) <systemitem role="package">(ബൈന്‍ഡ്9)bind9</systemitem>

source: <systemitem role="package">exim3</systemitem>, successor is <systemitem role="package">exim4</systemitem>
ml: <systemitem role="package">എക്സിം3(exim3)</systemitem>, പിന്‍‌ഗാമിയായി(successor is) <systemitem role="package">എക്സിം4(exim4)</systemitem>

source: <systemitem role="package">php4</systemitem>, successor is <systemitem role="package">php5</systemitem>
ml: <systemitem role="package">പിഎഛ്പി4(php4)</systemitem>, പിന്‍ഗാമിയായി(successor is) <systemitem role="package">പിഎഛ്പി5(php5)</systemitem>

source: <systemitem role="package">postgresql-7.4</systemitem>, successor is <systemitem role="package">postgresql-8.1</systemitem>
ml: <systemitem role="package">postgresql-7.4</systemitem>, പിന്‍ഗാമിയായി(successor is) <systemitem role="package">postgresql-8.1</systemitem>

source: <systemitem role="package">uw-imapd</systemitem>, no successor defined yet
ml: <systemitem role="package">uw-imapd</systemitem>, പിന്‍ഗാമിയായി ഒന്നും തീരുമാനിക്കപ്പെട്ടിട്ടില്ല.

source: Introducing several thousand new packages, &releasename; also retires and omits more than two thousand old packages that were in &oldreleasename;. It provides no upgrade path for these obsolete packages. While nothing prevents you from continuing to use an obsolete package where desired, the Debian project will usually discontinue security support for it a year after &releasename;'s release<footnote>
ml: പുതിയതായി വളരെ അധികം പൊതികള്‍ ഉള്‍‍‌‌ക്കൊള്ളിക്കുന്നുണ്ട്, &oldreleasename;ല്‍നിന്ന് ഏതാണ്ട് രണ്ടായിരത്തോളം പൊതികള്‍ക്ക് സ്ഥിരവിശ്രമം നല്‍കി ഒഴിവാക്കുന്നുമുണ്ട്. കാലാനുസൃതമല്ലാത്ത ഇത്തരം പൊതികള്‍ക്ക് മേലില്‍ നവീകരണ സാദ്ധ്യ‌‌ത ഉണ്ടായിരിക്കില്ല. ആഗ്രഹിക്കുന്നു എങ്കില്‍, ഇത്തരം കാലഹരണപ്പെട്ട പൊതികള്‍ തുടര്‍ന്നും ഉപയോഗിക്കുന്നതില്‍നിന്ന് നിങ്ങളെ ആരും വിലക്കുന്നില്ല, എങ്കിലും &releasename;ന്റെ പ്രകാശനത്തിന് ശേഷം ഒരു വര്‍ഷം കഴിഞ്ഞാല്‍ ഇവക്കുള്ള സുരക്ഷ ഡെബിയന്‍ പദ്ധതി തുടരുകയില്ല.<footnote>
zh_tw: 雖然在 &releasename; 裡採用了數千個新的套件，但它同時也撤除並捨棄了超過兩千個曾經包含在 &oldreleasename; 裡的舊套件。它將不會再提供這些已遭廢棄的套件任何的升級途徑，雖然我們並不會禁止您企圖繼續使用這些已遭廢棄的套件，但依慣例，在 &releasename; 發佈的一年之後 Debian 專案將不會再針對它們繼續提供安全上的支援<footnote>

source: Also, if you have used <command>aptitude</command> to manually install packages in &oldreleasename; it will have kept track of those packages you manually installed and will be able to mark as obsolete those packages pulled in by dependencies alone which are no longer needed if a package has been removed. Also, <command>aptitude</command>, unlike <command>deborphan</command> will not mark as obsolete packages that you manually installed, as opposed to those that were automatically installed through dependencies.
ml: &oldreleasename;ല്‍ പൊതികളുടെ പ്രതിഷ്ഠാനത്തിന് <command>aptitude</command>ആജ്ഞ നിങ്ങള്‍ ഉപയോഗിച്ചിട്ടുണ്ടെങ്കില്‍; കായികമായി പ്രതിഷ്ഠിച്ച അത്തരം പൊതികള്‍ നിരീക്ഷിക്കപ്പെട്ട്, പൊതികള്‍ നീക്കം ചെയ്തതുകൊണ്ട് മേലില്‍ ആവശ്യ‌‌മില്ലാതെവന്നതും ആശ്രിതത്വം മാത്രം കാരണം ഉള്ളിലേക്കെടുത്തതുമായ അവ കാലഹരണപ്പെട്ടതായി മുദ്രകുത്താന്‍ കഴിയും. മാത്രവുമല്ല, <command>deborphan</command> പോലെ <command>aptitude</command> ആജ്ഞ, ആശ്രിതത്വം കാരണം യാന്ത്രികമായി പ്രതിഷ്ഠിക്കപ്പെട്ടവയെപ്പോലെ കൈയാല്‍ പ്രതിഷ്ഠിക്കപ്പെട്ട പൊതികള്‍ കാലഹരണപ്പെട്ടതായി അടയാളപ്പെടുത്തില്ല.

source: Most (but not all) dummy packages' descriptions indicate their purpose. Package descriptions for dummy packages are not uniform, however, so you might also find <command>deborphan</command> with the <literal>--guess</literal> options useful to detect them in your system. Note that some dummy packages are not intended to be removed after an upgrade but are, instead, used to keep track of the current available version of a program over time.
ml: മിക്കവാറും (എല്ലാമില്ല.) വ്യാജപ്പൊതികളുടെ വിശദീകരണങ്ങളില്‍ ആവശ്യ‌‌കത വെളിപ്പെടുത്താറുണ്ട്. വ്യാ‌ജപ്പൊതികളുടെ വിശദീകരണങ്ങള്‍ ഏകീകരിക്കപ്പെട്ടവയല്ല, എങ്കിലും, നിങ്ങളുടെ വ്യ‌‌വസ്ഥിതിയില്‍ അവ കണ്ടെത്തുന്നതിന് ഉപകാരപ്പെടുന്ന <command>deborphan</command>നോടൊപ്പം <literal>--guess</literal> ഐച്ഛികം കൂടി കാണണം. നവീകരണത്തിനു ശേഷം നീക്കം ചെയ്യപ്പെടാനുദ്ദേശിക്കപ്പെട്ടവയല്ല ചില വ്യാ‌‌ജപ്പൊതികള്‍, മറിച്ച്, കാലങ്ങള്‍ക്കു ശേഷം പരിപാടിയുടെ നിലവിലുള്ള പതിപ്പിന്റെ വിവരങ്ങള്‍ ലഭ്യ‌‌മാക്കാന്‍ കൂടിയാണ് എന്നു കൂടി ഓര്മ്മിക്കണം.
zh_tw: 大多數（但不是所有）的替代套件會在套件的說明中會介紹它們的用途，雖然它們的說明的格式並不統一，所以您可能會發現 <command>deborphan</command> 在搭配 <literal>--guess</literal> 選項時可以輕易得把它們從您的系統中找出來。請注意，有些替代套件並不希望您在升級後就將其刪除，因為日後您可以替而使用它來追蹤是否有任何新版本出現。

source: Plans for the next Debian release
ml: അടുത്ത ഡെബിയന്‍ പ്രസാധന പദ്ധതി
zh_tw: 下個 Debian 釋出版的預備計劃

source: Drop of the ARM ABI port, in favor of the ARM EABI port
ml: ARM EABI ഗമനമാര്‍ഗ്ഗ(port)ത്തിന്റെ ARM ABI ഗമനമാര്‍ഗ്ഗം ഉപേക്ഷിക്കുന്നു.

source: Debian lenny has two different and incompatible ARM ports: the old ABI port (arm) and the new EABI port (armel). Debian lenny is the last release with support for the ARM ABI port and future releases will only support the ARM EABI or armel port. It's therefore recommended to use armel for new installations of lenny.
ml: ഡെബിയന്‍ ലെന്നിക്ക് രണ്ടു വ്യ‌‌ത്യ‌‌സ്തവും തമ്മില്‍ യോജിക്കാത്തതുമായ ARM ഗമനമാര്‍ഗ്ഗ(port)ങ്ങളുണ്ട്. പഴയ ABI ഗമനമാര്‍ഗവും(arm), പുതിയ EABIഗമന മാര്ഗ്ഗവും(armel). ഭാവി പതിപ്പുകളില്‍ ARM EABI അലെങ്കില്‍ armel ഗമനമാര്ഗ്ഗം മാത്രമേ ഉണ്ടാകൂ. അതുകൊണ്ട് ലെന്നിയുടെ പുതിയ പതിപ്പ് പ്രതിഷ്ഠാപനത്തില്‍ armel ഉപയോഗപ്പെടുത്താന്‍ ശുപാര്‍ശ ചെയ്യുന്നു.

source: With the exception of Netwinder, installer images for supported ARM machines are available for both arm and armel in lenny. Netwinder support is only available for arm and it will be dropped after lenny along with the arm port. <indexterm><primary>Netwinder</primary></indexterm>
ml: നെറ്റ്‌‌വൈന്ഡര്‍ ഒഴിച്ചു നിര്‍ത്തിയാല്‍, പിന്തുണയുള്ള ARM യന്ത്രങ്ങള്‍ക്ക് ലെന്നിയില്‍ armനും armelനും വേണ്ട പ്രതിഷ്ഠാപന ബിംബങ്ങള്‍(installer image) ലഭ്യ‌‌മാണ്. നെറ്റ്‌‌വൈന്ഡര്‍ പിന്തുണ armനു മാത്രമേയുള്ളൂ. ലെന്നിക്ക് ശേഷം armഗമനമാര്ഗ്ഗത്തോടുകൂടി ഇത് ഒഴിവാക്കപ്പെടും. <indexterm><primary>നെറ്റ്‌‌വൈന്ഡര്(Netwinder)</primary></indexterm>

source: Please visit <ulink url="http://wiki.debian.org/ArmEabiPort">this page</ulink> to learn more about the ARM EABI (armel) port.
ml: ARM EABI (armel) ഗമനമാര്ഗ്ഗത്തെ കൂടുതല്‍ പഠന വിധേയമാക്കാന്‍ ദയവായി <ulink url="http://(വിക്കി.ഡെബിയന്‍.ഓര്ഗ്)wiki.debian.org/ArmEabiPort">this page</ulink>നോക്കുക.
zh_tw: 請參閱 <ulink url="http://wiki.debian.org/ArmEabiPort">這個頁面</ulink> 來取得關於 ARM EABI (armel) 移植計劃的更多資訊。
