Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: Conflicts or Pre-Depends loops
fr: Boucles de conflits ou de prédépendances
it: Conflitti e pre-dipendenze cicliche
ja: 衝突 (Conflicts) あるいは事前依存 (Pre-Depends) のループ
pt: Conflitos ou Ciclos de Pré-Dependências
ro: Conflicte sau cicluri de pre-dependențe
sv: Konflikter vid förberoende-loop

source: Sometimes it's necessary to enable the <literal>APT::Force-LoopBreak</literal> option in APT to be able to temporarily remove an essential package due to a Conflicts/Pre-Depends loop. <command>apt-get</command> will alert you of this and abort the upgrade. You can work around this by specifying the option <literal>-o APT::Force-LoopBreak=1</literal> on the <command>apt-get</command> command line.
fr: Il est parfois nécessaire d'activer l'option d'apt <literal>APT::Force-LoopBreak</literal> pour pouvoir temporairement retirer un paquet essentiel à cause de boucles «&nbsp;Conflicts/Pre-Depends&nbsp;». <command>apt-get</command> vous alertera à ce propos et interrompra la mise à niveau. Vous pouvez contourner ce problème en passant l'option <literal>-o APT::Force-LoopBreak=1</literal> sur la ligne de commande d'<command>apt-get</command>.
it: Talvolta è necessario abilitare l'opzione <literal>APT::Force-LoopBreak</literal> affinché APT possa rimuovere temporaneamente un pacchetto essenziale, a causa di un circolo <quote>è in conflitto con</quote>/<quote>pre-dipende da</quote>. Di norma <command>apt-get</command> emetterà un avviso e cesserà l'aggiornamento. Si può evitare questa situazione specificando l'opzione <literal>-o APT::Force-LoopBreak=1</literal> nella riga di comando di <command>apt-get</command>.
ja: 場合によっては衝突や事前依存のループのために、APT の <literal>APT::Force-LoopBreak</literal> オプションを有効にして、必須パッケージを一時的に削除しなければならないかもしれません。その場合 <command>apt-get</command> はこのことを警告してアップグレードを中断します。<command>apt-get</command> のコマンドラインにオプション <literal>-o APT::Force-LoopBreak=1</literal> を指定すれば、この状態を回避できます。
pt: Por vezes é necessário activar a opção <literal>APT::Force-LoopBreak</literal> no APT para ser possível remover temporariamente um pacote essencial devido a um ciclo vicioso de Conflitos/Pré-Dependências. O <command>apt-get</command> irá alertá-lo disto e abortará a actualização. Você pode contornar isto especificando a opção <literal>-o APT::Force-LoopBreak=1</literal> na linha de comandos do <command>apt-get</command>.
ro: Uneori este necesar să activați opțiunea <literal>APT::Force-LoopBreak</literal> în APT pentru a putea elimina temporar un pachet esențial, datorită unei bucle Conflict/Pre-Dependență. <command>apt-get</command> vă va avertiza în legătură cu aceasta și va abandona actualizarea. Puteți ocoli această situație precizând opțiunea <literal>-o APT::Force-LoopBreak=1</literal> în linia de comandă a lui <command>apt-get</command>.
sv: Ibland är det nödvändigt att aktivera alternativet <literal>APT::Force-LoopBreak</literal> i APT för att temporärt ta bort ett systemkritiskt paket på grund av en Konflikt/Förberoende-slinga. <command>Apt-get</command> kommer att varna dig om det här och avbryta uppgraderingen. Du kan lösa det genom att ange alternativet <literal>-o APT::Force-LoopBreak=1</literal> på kommandoraden för <command>apt-get</command>.

source: It is possible that a system's dependency structure can be so corrupt as to require manual intervention. Usually this means using <command>apt-get</command> or
fr: Il est possible que la structure de dépendances d'un système soit tellement défectueuse qu'elle requiert une intervention manuelle. Habituellement, cela signifie qu'il faut utiliser <command>apt-get</command> ou :
it: È possibile che la struttura di dipendenze di un sistema sia talmente compromessa da richiedere un intervento manuale; ciò normalmente significa l'uso di <command>apt-get</command> o di
ja: システムの依存関係の構造があまりに問題だらけで、手動での介入が必要となることもあります。通常、手動での介入とは、<command>apt-get</command> を用いるか、あるいは
pt: É possível que uma estrutura de dependências do sistema se torne corrupta de modo a necessitar de intervenção manual. Normalmente isto significa utilizar o <command>apt-get</command> ou
ro: Este posibil ca structura dependențelor dintr-un sistem să fie coruptă într-o asemenea măsură încât să necesite intervenție manuală. În mod obișnuit aceasta înseamnă utilizarea <command>apt-get</command> sau
sv: Det är möjligt att beroendestrukturen för ett system kan vara så skadat att det kräver handpåläggning. Vanligtvis innebär det att använda <command>apt-get</command> eller

source: # dpkg --remove <replaceable>package_name</replaceable>
fr: # dpkg --remove <replaceable>nom_du_paquet</replaceable>
it: # dpkg --remove <replaceable>nome_pacchetto</replaceable>
ja: # dpkg --remove <replaceable>パッケージ名</replaceable>
ro: # dpkg --remove <replaceable>nume_pachet</replaceable>
sv: # dpkg --remove <replaceable>paketnamn</replaceable>

source: to eliminate some of the offending packages, or
fr: pour éliminer certains des paquets en cause, ou :
it: per eliminare alcuni dei pacchetti che generano il problema, o
ja: で問題の原因となるパッケージを消す作業になります。または次の方法を用いてもよいかもしれません。
ml: വഴി ചില പ്രശ്നക്കാരായ പൊതികളെ നീക്കം ചെയ്യാം, അല്ലെങ്കില്‍
pt: para eliminar alguns dos pacotes que estão a criar problemas, ou
ro: pentru a elimina pachetele problemă, sau
sv: för att plocka bort några av de störande paketen, eller
zh_tw: 來清除一些會造成問題的套件，或

source: In extreme cases you might have to force re-installation with a command like
fr: Dans certains cas extrêmes, vous pourriez devoir forcer une réinstallation à l'aide d'une commande comme :
it: In casi estremi potrebbe essere necessario forzare la re-installazione con un comando del tipo di
ja: 極端な場合には、コマンドラインから次のように入力して、再インストールしなければならないかもしれません。
ml: വിരളമായ സന്ദര്‍ഭങ്ങളില്‍ നിങ്ങള്‍ക്കു് താഴെ പറയു പോലൊരു ആജ്ഞ ഉപയോഗിച്ചു് വീണ്ടും ഇന്‍സ്റ്റോള്‍ ചെയ്യാന്‍ നിര്‍ബന്ധിയ്ക്കേണ്ടി വന്നേയ്ക്കാം
pt: Em casos extremos poderá ter que forçar a reinstalação com um comando como
ro: În cazuri extreme s-ar putea să fie nevoie să forțați o reinstalare cu o comandă cum ar fi
sv: I extrema fall kan du behöva tvinga fram en ominstallation med ett kommando som detta
zh_tw: 在極端的情況下，您可能需要利用類似以下的指令來強制進行重新安裝的動作：

source: # dpkg --install <replaceable>/path/to/package_name.deb</replaceable>
fr: # dpkg --install <replaceable>/chemin/vers/nom_du_paquet.deb</replaceable>
it: # dpkg --install <replaceable>/percorso/di/nome_pacchetto.deb</replaceable>
ja: # dpkg --install <replaceable>/path/to/パッケージ名.deb</replaceable>
ro: # dpkg --install <replaceable>/cale/către/nume_pachet.deb</replaceable>
sv: # dpkg --install <replaceable>/sökväg/till/paketnamn.deb</replaceable>

source: File conflicts
fr: Conflits de fichier
it: Conflitti tra file
ja: ファイルの衝突
pt: Conflitos de ficheiros
ro: Conflict de fișiere
sv: Filkonflikter

source: File conflicts should not occur if you upgrade from a <quote>pure</quote> &oldreleasename; system, but can occur if you have unofficial backports installed. A file conflict will result in an error like:
fr: Les conflits de fichiers ne devraient pas se produire si vous mettez à niveau depuis un système &Oldreleasename; <quote>pur</quote>, mais ils peuvent se produire si des rétroportages non officiels sont installés. Un conflit de fichiers entraînera une erreur de ce type :
it: Non si dovrebbero verificare conflitti tra file se si aggiorna da un sistema &oldreleasename; <quote>puro</quote>, ma potrebbero verificarsi se sono stati installati backport non ufficiali. Un conflitto tra file causerà un errore simile al seguente:
ja: <quote>純粋</quote> な &oldreleasename; システムからのアップグレードでは、ファイルの衝突は起こらないはずですが、非公式のバックポートパッケージをインストールしているなら起こるかもしれません。ファイルの競合が起こると、次のようなエラーになります:
ml: <quote>pure</quote> &oldreleasename;ല്‍ നിന്ന് പുതുക്കല്‍ നടത്തുമ്പോള്‍ ഫയലുകളുടെ സംഘട്ടനം ഉണ്ടാവാന്‍ പാടില്ല; എന്നാല്‍ അനൌദ്യോ‌‌ഗിക പരിപാടികള്‍ പ്രതിഷ്ഠിച്ചിട്ടുണ്ടെങ്കില്‍ ഇങ്ങനെ സംഭവിക്കാം. ഒരു ഫയല്‍ സംഘട്ടനം ഇതുപോലൊരു പിശകിന് കാരണമായേക്കും:
pt: Os conflitos de ficheiros não devem ocorrer se estiver a actualizar a partir de um sistema &oldreleasename; <quote>pure</quote>, mas podem acontecer se tiver instalado 'backports' não-oficiais. Um conflito de ficheiros irá resultar num erro como:
ro: Dacă actualizați de la un sistem &oldreleasename; <quote>pur</quote> nu ar trebui să apară conflicte de fișiere, însă acestea pot interveni dacă aveți pachete neoficiale de tip backport. Un conflict de fișiere poate rezulta într-o eroare de genul:
sv: Filkonflikter bör inte inträffa om du uppgraderar från ett <quote>rent</quote> &oldreleasename;-system, men kan inträffa om du har inofficiella bakåtporteringar installerade. En filkonflikt resulterar i ett fel som:

source: Unpacking <replaceable>&lt;package-foo&gt;</replaceable> (from <replaceable>&lt;package-foo-file&gt;</replaceable>) ... dpkg: error processing <replaceable>&lt;package-foo&gt;</replaceable> (--install): trying to overwrite `<replaceable>&lt;some-file-name&gt;</replaceable>', which is also in package <replaceable>&lt;package-bar&gt;</replaceable> dpkg-deb: subprocess paste killed by signal (Broken pipe) Errors were encountered while processing: <replaceable>&lt;package-foo&gt;</replaceable>
fr: Préparation du remplacement de <replaceable>&lt;paquet-toto&gt;</replaceable> (en utilisant <replaceable>&lt;fichier-paquet-toto&gt;</replaceable>) ... dpkg: erreur de traitement de <replaceable>&lt;paquet-toto&gt;</replaceable> (--install): tentative de remplacement de « <replaceable>&lt;un-nom-de-fichier&gt;</replaceable> », qui appartient aussi au paquet <replaceable>&lt;paquet-titi&gt;</replaceable> dpkg-deb: sous-processus paste tué par le signal (Broken pipe) Des erreurs ont été rencontrées pendant l'exécution : <replaceable>&lt;paquet-toto&gt;</replaceable>
it: Spacchetto <replaceable>&lt;pacchetto-tizio&gt;</replaceable> (da <replaceable>&lt;file-del-pacchetto-tizio&gt;</replaceable>) ... dpkg: errore processando <replaceable>&lt;pacchetto-tizio&gt;</replaceable> (--install): tentata sovrascrittura di `<replaceable>&lt;nome-di-qualche-file&gt;</replaceable>', che si trova anche nel pacchetto <replaceable>&lt;pacchetto-caio&gt;</replaceable> dpkg-deb: il sottoprocesso paste è stato terminato da un segnale (Pipe rotta) Sono occorsi degli errori processando: <replaceable>&lt;pacchetto-tizio&gt;</replaceable>
ja: (<replaceable>&lt;package-foo-file&gt;</replaceable> から) <replaceable>&lt;package-foo&gt;</replaceable> を展開しています... dpkg: <replaceable>&lt;package-foo&gt;</replaceable> の処理中にエラーが発生しました (--install): `<replaceable>&lt;some-file-name&gt;</replaceable>' を上書きしようとしています。これはパッケージ <replaceable>&lt;package-bar&gt;</replaceable> にも含まれています dpkg-deb: サブプロセス paste がシグナル (Broken pipe) によって強制終了しました 以下のパッケージの処理中にエラーが発生しました: <replaceable>&lt;package-foo&gt;</replaceable>
sv: Packar upp <replaceable>&lt;paket-foo&gt;</replaceable> (från <replaceable>&lt;paket-foo-fil&gt;</replaceable>) ... dpkg: fel vid hantering av <replaceable>&lt;paket-foo&gt;</replaceable> (--install): försöker skriva över "<replaceable>&lt;något-fil-namn&gt;</replaceable>", som också finns i paketet <replaceable>&lt;paket-bar&gt;</replaceable> dpkg-deb: underprocessen paste dödad av signal (Brutet rör) Fel uppstod vid hantering: <replaceable>&lt;paket-foo&gt;</replaceable>
zh_tw: 正在解開 <replaceable>&lt;package-foo&gt;</replaceable>（由 <replaceable>&lt;package-foo-file&gt;</replaceable>）... dpkg: 在處理時出錯 <replaceable>&lt;package-foo&gt;</replaceable> (--install): 試圖覆寫 `<replaceable>&lt;some-file-name&gt;</replaceable>'， 但它同時包含於套件 <replaceable>&lt;package-bar&gt;</replaceable> 中 dpkg-deb: 子程序 paste 因錯誤訊息（損毀的 pipe）而被中斷 在處理時發生了錯誤： <replaceable>&lt;package-foo&gt;</replaceable>

source: You can try to solve a file conflict by forcibly removing the package mentioned on the <emphasis>last</emphasis> line of the error message:
fr: Vous pouvez tenter de résoudre un conflit de fichiers en forçant la suppression du paquet mentionné sur la <emphasis>dernière</emphasis> ligne du message d'erreur :
it: Si può tentare di risolvere un conflitto fra file rimuovendo forzatamente il pacchetto menzionato nell'<emphasis>ultima</emphasis> riga del messaggio d'errore:
ja: ファイルの衝突を解消するには、エラーメッセージの<emphasis>最後の</emphasis>行に表示されたパッケージを強制的に削除します:
ml: പിശക് കാണിക്കുന്ന സന്ദേശത്തിന്റെ <emphasis>last</emphasis> വരിയില്‍ പരാമര്‍ശിച്ച പൊതി നിര്‍ബ്ബന്ധമായി നീക്കം ചെയ്തുകൊണ്ട് ഫയല്‍ സംഘട്ടനം നിങ്ങള്‍ക്ക് ഒഴിവാക്കാം:
pt: Pode tentar resolver um conflito de ficheiro, efectuando a remoção forçada do pacote mencionado na <emphasis>última</emphasis> linha da mensagem de erro:
ro: Puteți încerca să rezolvați un conflict de fișiere prin eliminarea forțată a pachetelor menționate în <emphasis>ultima</emphasis> linie a mesajului de eroare:
sv: Du kan försöka lösa en filkonflikt genom att tvinga igenom borttagning av paketet som nämns på <emphasis>sista</emphasis> raden i felmeddelandet:
zh_tw: 您可以強制移除出現在錯誤訊息裡最<emphasis>後</emphasis>一行的那個套件，以解決檔案衝突的問題：

source: # dpkg -r --force-depends <replaceable>package_name</replaceable>
fr: # dpkg -r --force-depends <replaceable>nom_du_paquet</replaceable>
it: # dpkg -r --force-depends <replaceable>nome_pacchetto</replaceable>
ja: # dpkg -r --force-depends <replaceable>パッケージ名</replaceable>
ro: # dpkg -r --force-depends <replaceable>nume_pachet</replaceable>
sv: # dpkg -r --force-depends <replaceable>paketnamn</replaceable>

source: After fixing things up, you should be able to resume the upgrade by repeating the previously described <command>apt-get</command> commands.
fr: Après cela, vous devriez être en mesure de continuer la mise à niveau, en utilisant les commandes d'<command>apt-get</command> précédemment décrites.
it: Dopo aver risolto questo problema, si dovrebbe poter riprendere l'aggiornamento ripetendo i comandi <command>apt-get</command> descritti in precedenza.
ja: 問題が修正できたら、先程説明した <command>apt-get</command> のコマンドを再度入力すれば、アップグレードを再開できます。
pt: Depois de corrigir as coisas, deverá ser capaz de continuar a actualização repetindo os comandos do <command>apt-get</command> descritos atrás.
ro: După ce ați rezolvat problema, ar trebui să puteți continua actualizarea prin repetarea comenzilor <command>apt-get</command> descrise mai sus.
sv: Efter att problemen har lösts, bör du kunna återuppta uppgraderingen genom att upprepa tidigare beskrivna <command>apt-get</command>-kommandon.

source: Configuration changes
fr: Changements de configuration
it: Modifiche alla configurazione
ja: 設定の変更
pt: Alterações de configuração
ro: Modificări de configurare
sv: Inställningsförändringar

source: During the upgrade, you will be asked questions regarding the configuration or re-configuration of several packages. When you are asked if any file in the <filename>/etc/init.d</filename> directory, or the <filename>/etc/manpath.config</filename> file should be replaced by the package maintainer's version, it's usually necessary to answer `yes' to ensure system consistency. You can always revert to the old versions, since they will be saved with a <literal>.dpkg-old</literal> extension.
fr: Durant la mise à niveau, on vous posera des questions pour configurer ou reconfigurer de nombreux paquets. Quand on vous demandera si des fichiers du répertoires <filename>/etc/init.d</filename> ou le fichier <filename>/etc/manpath.config</filename> doivent être remplacés par la version du responsable du paquet, il est généralement nécessaire de répondre «&nbsp;oui&nbsp;» pour assurer la cohérence du système. Vous pouvez toujours revenir aux versions précédentes, puisqu'elles sont sauvegardées avec une extension <literal>.dpkg-old</literal>.
it: Durante l'aggiornamento verranno poste domande riguardanti la configurazione o la riconfigurazione di parecchi pacchetti. Quando viene chiesto se un qualsiasi file nella directory <filename>/etc/init.d</filename> o il file <filename>/etc/manpath.config</filename> deve essere sostituito con quello fornito dal manutentore del pacchetto, di solito è necessario rispondere affermativamente, per garantire la coerenza del sistema. Si può sempre ritornare alle versioni precedenti, dal momento che queste verranno salvate con l'estensione <literal>.dpkg-old</literal>.
ja: アップグレードの最中に、いくつかのパッケージの設定・再設定に関する質問が表示されます。<filename>/etc/init.d</filename> ディレクトリと <filename>/etc/manpath.config</filename> ファイルに関しては、パッケージメンテナのバージョンに置き換えるようにしてください。システムの整合性を保つためには `yes' と答えることが必要になります。古いバージョンも <literal>.dpkg-old</literal> という拡張子をつけられて保存されていますので、戻すのはいつでもできます。
pt: Durante a actualização, ser-lhe-ão colocadas questões relacionadas com a configuração ou re-configuração de vários pacotes. Quando lhe for perguntado se algum ficheiros dos directórios <filename>/etc/init.d</filename>, ou o ficheiro <filename>/etc/manpath.config</filename> deve ser substituídos pela versão do 'maintainer' do pacote, normalmente é necessário responder 'sim' para garantir a consistência do sistema. Pode sempre reverter às versões anteriores, já que estas serão guardadas com uma extensão <literal>.dpkg-old</literal>.
ro: În timpul actualizării este posibil să apară întrebări referitor la configurarea sau re-configurarea mai multor pachete. Dacă sunteți întrebat dacă un fișier din directorul <filename>/etc/init.d</filename>, sau fișierul <filename>/etc/manpath.config</filename> ar trebui înlocuit cu versiunea responsabilului de pachet, în general este necesar să răspundeți cu „da” (`yes' în engleză) pentru a asigura integritatea sistemului. Puteți oricând reveni la versiunile vechi, deoarece acestea vor fi salvate cu extensia <literal>.dpkg-old</literal>.
sv: Under uppgraderingen kommer det att ställas frågor om konfiguration eller omkonfigurationen av flera paket. När du blir tillfrågad om någon fil i katalogen <filename>/etc/init.d</filename> eller filen <filename>/etc/manpath.config</filename> ska ersättas av paketansvariges version, är det oftast nödvändigt att svara <quote>ja</quote> för att upprätthålla systemets tillstånd. Du kan alltid återgå till de gamla versionerna, eftersom de kommer att sparas med en <literal>.dpkg-old</literal>-ändelse.

source: If you're not sure what to do, write down the name of the package or file and sort things out at a later time. You can search in the typescript file to review the information that was on the screen during the upgrade.
fr: Si vous n'êtes pas certain de ce qu'il faut faire, notez le nom du paquet ou du fichier et examinez le problème plus tard. Vous pouvez chercher dans le fichier d'enregistrement pour revoir les informations qui étaient à l'écran lors de la mise à niveau.
it: Se non si è sicuri sul da farsi, ci si annoti il nome del pacchetto o del file e si sistemino le cose in un momento successivo. Le informazioni presentate sullo schermo durante l'aggiornamento possono essere riesaminate dopo essere state cercate nel file generato durante l'aggiornamento.
ja: どうすればよいかわからなくなったら、そのパッケージやファイルの名前を書き留めておいて、その問題解決は後回しにしましょう。typescript ファイルを検索すれば、アップグレードの最中に画面に表示された情報をもう一度見ることもできます。
ml: എന്താണ് ചെയ്യേണ്ടതെന്ന് കൃത്യ‌‌മായി നിങ്ങള്‍ക്ക് അറിയില്ലെങ്കില്‍, പൊതികളുടേയോ, ഫയലുകളുടേയോ പേര് കുറിച്ചെടുത്ത് പിന്നീടൊരിക്കല്‍ ശരിയാക്കാം. പുതുക്കിക്കൊണ്ടിരിക്കുമ്പോള്‍ യവനികയില്‍ തെളിഞ്ഞിരുന്ന വിവരങ്ങള്‍ typescript ഫയലില്‍ നിന്ന് തെരഞ്ഞെടുക്കാവുന്നതാണ്.
pt: Se não tiver a certeza acerca do que fazer, anote o nome do pacote ou do ficheiro e resolva os problemas mais tarde. Pode procurar o ficheiro transcrito de modo a rever a informação que esteve no ecrã durante a actualização.
ro: Dacă nu știți sigur ce să faceți, scrieți numele pachetului sau fișierului și amânați rezolvarea problemelor pentru mai târziu. Puteți căuta în fișierul script informația afișată în timpul actualizării.
sv: Om du inte är säker på vad som behöver göras, skriv ner namnet på paketet eller filen och red ut saker och ting senare. Du kan söka i typescript-filen för att granska informationen som visades på skärmen under uppgraderingen.
zh_tw: 如果您不太確定要怎麼做的話，把套件或檔案的名稱寫下來，等稍後再想辨法理出頭緒來。您可以在記錄檔中搜尋，以便能重新檢視在系統升級時出現在螢幕上的資訊。

source: Change of session to console
fr: Changement de la session vers la console
it: Cambiare la sessione sulla console
ja: コンソール接続へセッションの変更
pt: Mudança de sessão para consola
ro: Schimbare a sesiunii la consolă
sv: Flytt av sessionen till konsoll

source: If you are running the upgrade using the system's local console you might find that at some points during the upgrade the console is shifted over to a different view and you lose visibility of the upgrade process. For example, this will happen in desktop systems when <command>gdm</command> is restarted.
fr: Si vous utilisez le système depuis la console locale, il est possible qu'à certains moments de la mise à niveau la console passe à une vue différente, et que la mise à niveau du système ne soit plus observable. C'est par exemple le cas pour les systèmes de bureau quand <command>gdm</command> est relancé.
it: Quando si usa la console locale del sistema per fare l'aggiornamento, potrebbe accadere che durante l'aggiornamento la console sia spostata su una vista diversa e che si perda la visibilità del processo d'aggiornamento. Questo può accadere, per esempio, sui sistemi desktop quando viene riavviato <command>gdm</command>.
ja: システムのローカルコンソールを使ってアップグレードを実行している場合、アップグレードの最中に何回かコンソールが別の画面へ移動してしまい、アップグレード作業が見えなくなることに気づくかもしれません。例えば、デスクトップシステムで <command>gdm</command> が再起動した際に起こります。
pt: Se você está a correr a actualização usando a consola local do sistema, pode descobrir que em certos pontos durante a actualização a consola é mudada para uma vista diferente e você perde a visibilidade do processo de actualização. Por exemplo, isto vai acontecer em sistemas de ambiente de trabalho quando o <command>gdm</command> for reiniciado.
ro: Dacă faceți actualizare folosind conosla de sistem locală, veți observa că la un moment dat în timpul actualizării consola va fi mutată într-o altă vizualizare și procesul de actualizare nu va mai fi vizibil. Acest lucru se poate întâmpla spre exemplu pe sisteme de birou când este repornit <command>gdm</command>.
sv: Om du kör uppgraderingen i systemets lokala konsoll kan det tänkas att under några delar av uppgraderingen så flyttar konsollen till en annan vy och du kan inte längre se uppgraderingsprocessen. Exempelvis händer detta på skrivbordssystem när <command>gdm</command> startas om.
