Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: This step will automatically upgrade <systemitem role="package">libc6</systemitem> and <systemitem role="package">locales</systemitem> and will pull in SELinux support libraries (<systemitem role="package">libselinux1</systemitem>). At this point, some running services will be restarted, including <command>xdm</command>, <command>gdm</command> and <command>kdm</command>. As a consequence, local X11 sessions might be disconnected. <indexterm><primary>SELinux</primary></indexterm>
ml: ഈ ചുവട് വെപ്പില്‍ <systemitem role="package">libc6</systemitem>ഉം <systemitem role="package">locales</systemitem>ഉം സ്വയം പുതുക്കപ്പെടുകയും SELinux പിന്തുണക്കുള്ള ഗ്രന്ഥാവലികള്‍ ഉള്ളിലേക്ക് വലിച്ചെടുക്കപ്പെടുകയും ചെയ്യും. ഈ സമയത്ത് ഓടിക്കൊണ്ടിരിക്കുന്ന <command>xdm</command>, <command>gdm</command> and <command>kdm</command> മുതലായ ചില സേവനങ്ങള്‍ പുനരാരംഭിക്കും. തദ്ഫലമായി X11ഘട്ടം വിച്ഛേദിക്കപ്പെടും. <indexterm><primary>SELinux</primary></indexterm>

source: Using aptitude's list of automatically-installed packages with apt
ml: ആപ്റ്റിറ്റ്യൂഡ് സൂക്ഷിയ്ക്കുന്ന യന്ത്രികമായി ഇന്‍സ്റ്റോള്‍ ചെയ്ത പൊതികളുടെ പട്ടിക ആപ്റ്റിനൊപ്പം ഉപയോഗിയ്ക്കുന്നതു്

source: <systemitem role="package">aptitude</systemitem> maintains a list of packages that were installed automatically (for instance, as dependencies of another package). In &releasename;, <systemitem role="package">apt</systemitem> now has this feature as well.
ml: <systemitem role="package">aptitude</systemitem> യാന്ത്രികമായി ഇന്‍സ്റ്റോള്‍ചെയ്ത (ഉദാഹരണത്തിനു് മറ്റൊരു പൊതിയുടെ ആശ്രയത്വമായി) പൊതികളുടെ പട്ടിക സൂക്ഷിയ്ക്കുന്നുണ്ടു്. &releasename; യില്‍ <systemitem role="package">apt</systemitem> നും ഈ കഴിവുണ്ടു്.

source: The first time the &releasename; version of <systemitem role="package">aptitude</systemitem> is run, it will read in its list of automatically installed packages and convert it for use with the &releasename; version of <systemitem role="package">apt</systemitem>. If you have <systemitem role="package">aptitude</systemitem> installed, you should at least issue one <command>aptitude</command> command to do the conversion. One way to do this is by searching for a non-existent package:
ml: ആദ്യ‌‌മായി <systemitem role="package">aptitude</systemitem>ലെ &releasename; വെര്ഷന്‍ ഓടിച്ചാല്‍, അത് പ്രതിഷ്ഠാപനം നടത്തിയ എല്ലാ പൊതികളും യാന്ത്രികമായി വായിച്ചെടുത്ത് <systemitem role="package">apt</systemitem>ന്റെ &releasename; വെര്ഷനന് ഉപയോഗിക്കത്തക്കവിധം മാറ്റിയെടുക്കും. <systemitem role="package">aptitude</systemitem> നിങ്ങള്‍ പ്രതിഷ്ഠാപനം നടത്തിയിട്ടുണ്ടെങ്കില്‍, ഈ മാറ്റം നടപ്പിലാക്കാന്‍ നിങ്ങള്‍ ഒരു <command>aptitude</command>ആജ്ഞ നല്‍കേണ്ടതുണ്ട്. നിലവിലില്ലാത്ത ഒരു പൊതിക്കായി തെരച്ചില്‍ നടത്തുകയാണ് അതിനുള്ള ഒരു മാര്ഗ്ഗം:

source: Because of certain necessary package conflicts between &oldreleasename; and &releasename;, running <literal>aptitude dist-upgrade</literal> directly will often remove large numbers of packages that you will want to keep. We therefore recommend a two-part upgrade process, first a minimal upgrade to overcome these conflicts, then a full <literal>dist-upgrade</literal>.
ml: &oldreleasename; ലേയും &releasename;ലേയും പൊതികള്‍ തമ്മില്‍ ആവശ്യ‌‌‌‌മായിട്ടുള്ള ചില വൈരുദ്ധ്യ‌‌ങ്ങള്‍ ‍കാരണം <literal>aptitude dist-upgrade</literal> നേരിട്ട് ഓടിച്ചാല്‍ നിങ്ങള്‍ നിലനിര്ത്താനാഗ്രഹിച്ച പല പൊതികളും പലപ്പോഴും നീക്കം ചെയ്യപ്പെടാനിടയുണ്ട്. ഈ വിഷമം മറികടക്കാന്‍ ആദ്യം ഏറ്റവും കുറഞ്ഞ ഒരു പുതുക്കലും, പിന്നീട് ഒരു മുഴു <literal>dist-upgrade</literal>.പുതുക്കലും എന്നിങ്ങനെ രണ്ടു ഘട്ടങ്ങളിലായി നടത്താന്‍ ഞങ്ങള്‍ ശുപാര്ശ ചെയ്യുന്നു.
zh_tw: 由於在 &oldreleasename; 和 &releasename; 間有不少必需套件是相互衝突的，直接執行 <literal>aptitude dist-upgrade</literal> 常常會把一堆您希望保留的套件移除掉。因而我們在此建議進行二段式升級，首先是最低限度升級以克服衝突問題，然後再是完整的 <literal>dist-upgrade</literal>。

source: First, run:
ml: ആദ്യം, പ്രവര്‍ത്തിപ്പിയ്ക്കേണ്ടതു്:
zh_tw: 首先，執行：

source: The next step will vary depending on the set of packages that you have installed. These release notes give general advice about which method should be used, but if in doubt, it is recommended that you examine the package removals proposed by each method before proceeding.
ml: അടുത്ത നടപടിക്രമം നിങ്ങള്‍ ഇന്‍സ്റ്റോള്‍ ചെയ്ത പൊതികളുടെ ഗണത്തിനനുസരിച്ചു് മാറും. ഈ പ്രസാധനക്കുറിപ്പുകള്‍ ഏതു് രീതിയാണുപയോഗിയ്ക്കേണ്ടതെന്നതിനെക്കുറിച്ചു് പൊതുവായുള്ള ഉപദേശങ്ങള്‍ നല്‍കുന്നു, പക്ഷേ സംശയമുണ്ടെങ്കില്‍, മുന്നോട്ടു് പോകുന്നതിനു് മുമ്പു്, ഓരോ രീതിയും നീക്കം ചെയ്യാന്‍ ശുപാര്‍ശ ചെയ്യുന്ന പൊതികള്‍, സൂക്ഷിച്ചു് പരിശോധിയ്ക്കാന്‍ ശുപാര്‍ശ ചെയ്യുന്നു.
zh_tw: 下個步驟會根據您所安裝的套件組合之不同而有所不同。本發行情報在關於該採取什麼樣的方式上是給予最常見的建議。但為確保萬一，建議您在實地進行之前先試過種種不同手法所建議的套件移除方案。

source: Some common packages that are expected to be removed include <systemitem role="package">base-config</systemitem>, <systemitem role="package">hotplug</systemitem>, <systemitem role="package">xlibs</systemitem>, <systemitem role="package">netkit-inetd</systemitem>, <systemitem role="package">python2.3</systemitem>, <systemitem role="package">xfree86-common</systemitem>, and <systemitem role="package">xserver-common</systemitem>. For more information about packages obsoleted in &releasename;, see <xref linkend="obsolete"/>.
ml: നീക്കം ചെയ്യാന്‍ ഉദ്ദേശിച്ച ചില സാധാരണ പൊതികളില്‍ <systemitem role="package">base-config</systemitem>, <systemitem role="package">hotplug</systemitem>, <systemitem role="package">xlibs</systemitem>, <systemitem role="package">netkit-inetd</systemitem>, <systemitem role="package">python2.3</systemitem>, <systemitem role="package">xfree86-common</systemitem>, and <systemitem role="package">xserver-common</systemitem>എന്നിവ ഉള്‍‌പ്പെടുന്നു. &releasename;ല്‍ കാലഹരണപ്പെട്ട പൊതികളുടെ കൂടുതല്‍ വിവരങ്ങള്‍ക്ക് <xref linkend="obsolete"/>കാണുക.

source: Upgrading a desktop system
ml: ഒരു പണിയട സിസ്റ്റം നവീകരിയ്ക്കുന്നതു്
zh_tw: 升級桌面系統

source: This step concerns systems with the <literal>desktop</literal> task installed, or with the GNOME or KDE packages installed.
ml: <literal>desktop</literal> എന്ന ജോലി ഇന്‍സ്റ്റോള്‍ ചെയ്തിട്ടുണ്ടെങ്കിലോ ഗ്നോം അല്ലെങ്കില്‍ കെഡിഇ പൊതികള്‍ ഇന്‍സ്റ്റോള്‍ ചെയ്തിട്ടുണ്ടെങ്കിലോ ഈ നടപടിക്രമം പ്രധാനമാണു്.

source: Check whether you have the <systemitem role="package">libfam0c102</systemitem> package installed:
ml: നിങ്ങള്‍ <systemitem role="package">libfam0c102</systemitem> ഇന്‍സ്റ്റോള്‍ ചെയ്തിട്ടുണ്ടോ എന്നു് പരിശോധിയ്ക്കുക:

source: If you do have it installed, run:
ml: ഇതു് ഇന്‍സ്റ്റോള്‍ ചെയ്തിട്ടുണ്ടെങ്കില്‍, പ്രവര്‍ത്തിപ്പിയ്ക്കേണ്ടതു്:

source: Note that installing <systemitem role="package">libfam0</systemitem> will also install the File Alteration Monitor (<systemitem role="package">fam</systemitem>) as well as the <acronym>RPC</acronym> portmapper (<systemitem role="package">portmap</systemitem>) if not already available in your system. Both packages will enable a new network service in the system although they can both be configured to be bound to the (internal) loopback network device.
ml: <systemitem role="package">libfam0</systemitem>പ്രതിഷ്ഠിക്കുന്ന സമയത്ത്, നിങ്ങളുടെ കമ്പ്യൂ‌‌ട്ടറില്‍ നിലവിലില്ലെങ്കില്‍ <acronym>RPC</acronym> portmapper (<systemitem role="package">portmap</systemitem>)നോടൊപ്പം ഫയല്‍ മാറ്റങ്ങള്‍ നിരീക്ഷിക്കുന്ന (<systemitem role="package">fam</systemitem>)കൂടി പ്രതിഷ്ഠിക്കപ്പെടും എന്ന കാര്യം ശ്രദ്ധിക്കുമല്ലൊ. ഈ രണ്ടു പൊതികളും ലൂപ്ബാക്ക് (ആന്തരിക) ശൃംഖലോപകരണത്തിന് വിധേയമാകും വിധം ക്രമീകരിക്കാമെങ്കിലും ഇവ വ്യ‌‌വസ്ഥിതികളിലെ ശൃംഖലാ സേവനം സജീവമാക്കാന്‍ പര്യാപ്തമാണ്.

source: Upgrading a system with no X support installed
ml: എക്സ് പിന്തുണയില്ലാത്ത സിസ്റ്റത്തെ നവീകരിയ്ക്കാന്‍
zh_tw: 升級沒有安裝任何 X 的系統

source: On a system with no X, no additional <literal>aptitude install</literal> command should be required, and you can move on to the next step.
ml: എക്സ് ഇല്ലാത്ത സിസ്റ്റത്തില്‍ കൂടുതല്‍ <literal>aptitude install</literal> ആജ്ഞകള്‍ ആവശ്യമില്ല, നിങ്ങള്‍ക്കു് അടുത്ത നടപടിക്രമവുമായി മുന്നോട്ടു് പോകാം.
zh_tw: 在沒有 X 的系統上，就沒有必要執行任何額外的 <literal>aptitude install</literal> 指令了。您可以直接進行下一個步驟。

source: Upgrading the kernel
ml: കെര്‍ണല്‍ നവീകരീക്കുന്നു.
zh_tw: 升級 Kernel

source: The <systemitem role="package">udev</systemitem> version in &releasename; does not support kernel versions earlier than 2.6.15 (which includes &oldreleasename; 2.6.8 kernels), and the <systemitem role="package">udev</systemitem> version in &oldreleasename; will not work properly with the latest kernels. In addition, installing the &releasename; version of <systemitem role="package">udev</systemitem> will force the removal of <systemitem role="package">hotplug</systemitem>, used by Linux 2.4 kernels.
ml: &releasename;ന്റെ <systemitem role="package">udev</systemitem>വെര്ഷന്‍ 2.6.15നു മുമ്പുള്ള (2.6.8 കേര്ണല്‍ ഉള്‍‌ക്കൊള്ളുന്ന &oldreleasename;) കേര്‍ണലിനെ പിന്തുണക്കുന്നില്ല അതുപോലെ &oldreleasename;ലെ <systemitem role="package">udev</systemitem> വെര്ഷന്‍ പുതിയ കേര്ണലില്‍ ശരിയായി പ്രവര്ത്തിക്കില്ല. മാത്രവുമല്ല, &releasename;ന്റെ <systemitem role="package">udev</systemitem> വെര്ഷന്‍ പ്രതിഷ്ഠിക്കുന്നത് ലീനക്സ് 2.4 കേര്ണല്‍ ഉപയോഗപ്പെടുത്തുന്ന <systemitem role="package">hotplug</systemitem>നെ ശക്തമായി പുറംതള്ളുകയും ചെയ്യും.
zh_tw: 在 &releasename; 所搭載的 <systemitem role="package">udev</systemitem> 版本並不支援比 2.6.15 版更早期的 Kernel（也包含了 &oldreleasename; 的 2.6.8 版的 Kernel）。在此同時，在 &oldreleasename; 所搭載的 <systemitem role="package">udev</systemitem> 版本也無法正常地和最新的 Kernel 搭配使用。此外，安裝 &releasename; 版的 <systemitem role="package">udev</systemitem> 將會強迫移除 Linux 2.4 kernel 所需的 <systemitem role="package">hotplug</systemitem>。

source: As a consequence, the previous kernel package will probably not boot properly after this upgrade. Similarly, there is a time window during the upgrade in which <systemitem role="package">udev</systemitem> has been upgraded but the latest kernel has not been installed. If the system were to be rebooted at this point, in the middle of the upgrade, it might not be bootable because of drivers not being properly detected and loaded. (See <xref linkend="upgrade-preparations"/> for recommendations on preparing for this possibility if you are upgrading remotely.)
ml: അതിന്റെ ഫലമായി പുതുക്കലിനുശേഷം മുമ്പത്തെ കേര്ണല്‍ പൊതി മിക്കവാറും ബൂട്ട് ചെയ്യാന്‍ വിസമ്മതിച്ചേക്കാം. അതുപോലെ, പുതുക്കലിനിടയില്‍ <systemitem role="package">udev</systemitem>ന്റെ പുതുക്കല്‍ നടന്ന് പുതിയ കേര്ണല്‍ പ്രതിഷ്ഠിക്കപ്പെടുന്നതിന് മുമ്പ് ഒരു ഒഴിവുസമയമുണ്ടാകും. പുതുക്കലിനിടെയുള്ള ഈ ഘട്ടത്തില്‍ വ്യ‌വസ്ഥ വീണ്ടും ബൂട്ട് ചയ്യേണ്ടി വന്നാല്‍ സാരഥികള്‍ കയറുകയും, കണ്ടുപിടിക്കപ്പെടുകയും ചെയ്യാത്തതിനാല്‍ ബൂട്ട്ചെയ്യാന്‍ കഴിയാതെ വരും. (വിദൂരത്തിരുന്നുള്ള പുതുക്കല്‍ നടത്തുമ്പോള്‍ വരാവുന്ന ഇത്തരം സാദ്ധ്യ‌‌‌തകള്‍ക്കുള്ള പരിഹാര മാര്ഗ്ഗത്തിന് <xref linkend="upgrade-preparations"/>നോക്കുക.)
zh_tw: 也因此在進行升級後，可能再也無法利用之前的 kernel 套件來開機了。同樣的，在進行升級時，當 <systemitem role="package">udev</systemitem> 已升級、但卻未安裝最新版的 kernel 期間有個空窗期，如果系統安裝到一半，卻在這個節骨眼系統重新開機了，它可能再也無法開機，因為無法偵測並載入正確的驅動模組。（請參閱 <xref linkend="upgrade-preparations"/> 裡，一些當您是用遠端進行升級的一些建議及可行的預防方案。）

source: Unless your system has the <literal>desktop</literal> task installed, or other packages that would cause an unacceptable number of package removals, it is therefore recommended that you upgrade the kernel on its own at this point.
ml: നിങ്ങളുടെ വ്യ‌‌വസ്ഥയില്‍ <literal>desktop</literal>ഓ, അല്ലെങ്കില്‍ അസ്വീകാര്യ‌‌മായ എണ്ണം പൊതികള്‍ നീക്കം ചെയ്യപ്പെടേണ്ടിവരാന്‍ കാരണമാകുന്ന പൊതികളോ‍ സ്ഥാപിച്ചിട്ടില്ലെങ്കില്‍, ‍ അതിലെ സ്വന്തം കേര്ണല്‍ തന്നെ പുതുക്കാന്‍ ഈ ഘട്ടത്തില്‍ ശുപാര്ശ ചെയ്യുന്നു.
zh_tw: 除非您的系統安裝了<literal>桌面</literal>主題，或有其它的套件會導致必須移除大量套件，在此還是建議您能在此時個別得進行 kernel 的升級。

source: In the desktop case, it is unfortunately not possible to ensure the new kernel package is installed immediately after the new <systemitem role="package">udev</systemitem> is installed, so there is a window of unknown length when your system will have no kernel installed with full hotplug support. See <xref linkend="newkernel"/> for information on configuring your system to not depend on hotplug for booting.
ml: പണിയിടത്തിന്റെ കാര്യ‌‌ത്തില്‍, പുതിയ <systemitem role="package">udev</systemitem> പ്രതിഷ്ഠിച്ച ഉടനെത്തന്നെ കേര്‍ണല്‍ പൊതി പ്രതിഷ്ഠിക്കപ്പെടും എന്ന് നിര്‍ഭാഗ്യ‌‌വശാല്‍ ഉറപ്പിച്ചു പറയാന്‍ കഴിയില്ല, അതുകൊണ്ട് നിങ്ങളുടെ വ്യവസ്ഥിതിയില്‍ മുഴുവന്‍ hotplug പിന്തുണയോടുകൂടിയ കേര്‍ണലില്ലാത്ത അനിശ്ചിത ഇടവേള വരും. ബൂട്ടിങ്ങിന് hotplug പിന്തുണ ആശ്രയിക്കാത്ത വിധം ക്രമീകരിക്കാനുള്ള വിവരങ്ങള്‍ക്ക് <xref linkend="newkernel"/> കാണുക.
zh_tw: 對於桌面而言，糟糕的是很難去確保在安裝了新的 <systemitem role="package">udev</systemitem> 後，是否會立刻安裝新的 kernel 套件，所以無法確認在您的系統上僅安裝了 kernel、但卻沒有完整的 hotplug 支援的空窗期到底是多長。請參閱 <xref linkend="newkernel"/> 以取得如何將您的系統設定為不需依賴 hotplug 就能開機之資訊。

source: Upgrading the rest of the system
ml: ബാക്കിയുള്ള സിസ്റ്റം നവീകരിയ്ക്കുന്നതു്
zh_tw: 升級系統的其它部份

source: You are now ready to continue with the main part of the upgrade. Execute:
ml: നിങ്ങളിപ്പോള്‍ നവീകരണത്തിന്റെ പ്രധാന ഭാഗവുമായി തുടരാന്‍ തയ്യാറാണു്. പ്രവര്‍ത്തിപ്പിയ്ക്കേണ്ടതു്:
zh_tw: 那麼，現在已經準備好可以進行升級作業的重頭戲了。請執行：

source: New versions of currently installed packages that cannot be upgraded without changing the install status of another package will be left at their current version (displayed as <quote>held back</quote>). This can be resolved by either using <command>aptitude</command> to choose these packages for installation or by trying <literal>aptitude -f install <replaceable>package</replaceable></literal>.
ml: മറ്റു പൊതികളുടെ പ്രതിഷ്ഠാപന നിലവാരം മാറാതെ പുതുക്കാന്‍ കഴിയാത്തതും നിലവിലുള്ളതുമായ പൊതികളുടെ പുതിയ വെര്ഷനുകള്‍ മാറ്റങ്ങള്‍ വരുത്താതെ അതേപടി തുടരാന്‍ വിടും (<quote>held back</quote>എന്ന് പ്രദര്ശിപ്പിച്ചുകൊണ്ട്). ഈ പൊതികള്‍ പ്രതിഷ്ഠാപനത്തിന് തെരഞ്ഞെടുക്കാന്‍ <command>aptitude</command> ഉപയോഗിച്ചുകൊണ്ടോ അല്ലെങ്കില്‍ <literal>aptitude -f install <replaceable>package</replaceable></literal>.പ്രയോഗിച്ചോ ഇതു പരിഹരിക്കാവുന്നതാണ്.

source: Getting package signatures
ml: പൊതികളുടെ ഒപ്പുകള്‍ കിട്ടാന്‍
zh_tw: 取得套件簽名

source: After the upgrade, with the new version of <systemitem role="package">apt</systemitem> you can now update your package information, which will include the new package signature checking mechanism:
ml: <systemitem role="package">apt</systemitem>ന്റെ പുതിയ പതിപ്പ് കൊണ്ട് പുതുക്കിയ ശേഷം, പുതിയ പൊതികളിലെ ഒപ്പുകള്‍ പരിശോധിക്കുന്ന സംവിധാനത്തോടുകൂടിയ പൊതിവിവരങ്ങളും ഇനി പുതുക്കാവുന്നതാണ്:

source: The upgrade will have already retrieved and enabled the signing keys for Debian's package archives. If you add other (unofficial) package sources, <systemitem role="package">apt</systemitem> will print warnings related to its inability to confirm that packages downloaded from them are legitimate and have not been tampered with. For more information please see <xref linkend="pkgmgmt"/>.
ml: ഡെബിയന്റെ പൊതിശേഖരങ്ങള്‍‌ക്കുള്ള signing keys ഇതിനിടെ വീണ്ടെടുത്ത് സജീവമാക്കപ്പെട്ടിരിക്കും. നിങ്ങള്‍ മറ്റു സ്രോതസ്സുകളില്നിന്നുള്ള ‍(അനൌദ്യോ‌‌ഗിക) പൊതികള്‍ ചേര്ക്കുന്നുണ്ടെങ്കില്‍, അവയില്‍നിന്ന് ഇറക്കുമതി ചെയ്ത പൊതികള്‍ ന്യാ‌‌യയുക്തമാണെന്നും അവ താറുമാറാക്കപ്പെട്ടിട്ടില്ലെന്നും ഉറപ്പുവരുത്താനുള്ള കഴിവുകേടിനോട് ബന്ധപ്പെട്ട താക്കീത് അച്ചടിക്കും. കൂടുതല്‍ വിവരങ്ങള്‍ക്ക് <xref linkend="pkgmgmt"/> കാണുക.

source: Sometimes it's necessary to enable the <literal>APT::Force-LoopBreak</literal> option in APT to be able to temporarily remove an essential package due to a Conflicts/Pre-Depends loop. <command>aptitude</command> will alert you of this and abort the upgrade. You can work around this by specifying the option <literal>-o APT::Force-LoopBreak=1</literal> on the <command>aptitude</command> command line.
ml: സംഘട്ടനാത്മകത്വം/മുന്‍-ആശ്രിതത്വ ലൂപ്പ് കാരണം ചില അത്യാ‌‌വശ്യ‌‌മായ പൊതികള്‍ താല്‍ക്കാലികമായി നീക്കം ചെയ്യാന്‍ കഴിവുറ്റതാക്കാന്‍ ചില സന്ദര്‍ഭങ്ങളില്‍ <literal>APT::Force-LoopBreak</literal> ഐച്ഛികം സജീവമാക്കേണ്ടിവരും. <command>aptitude</command> ഇതിനെപ്പറ്റി നിങ്ങളെ ജാഗ്രതയുള്ളവരാക്കുകയും പുതുക്കല്‍ നടപടി ഉപേക്ഷിക്കുകയും ചെയ്യും.

source: It is possible that a system's dependency structure can be so corrupt as to require manual intervention. Usually this means using <command>aptitude</command> or
ml: ഒരു വ്യവസ്ഥിതിയിലെ ആശ്രിതത്വഘടന മാനുഷികമായ ഇടപെടല്‍ അനിവാര്യ‌‌മാക്കുന്ന വിധത്തില്‍ കെട്ടുപോയ സന്ദര്‍ഭങ്ങളുണ്ടാവാം.സാധാഅണ ഇതുകൊണ്ട് അര്ത്ഥമാക്കേണ്ടത് <command>aptitude</command>ന്റെ ഉപയോഗം അല്ലെങ്കില്‍
zh_tw: 系統中的相依關係也可能混亂到需要手動介入才得以解決。通常這代表您需要使用 <command>aptitude</command> 或

source: After fixing things up, you should be able to resume the upgrade by repeating the previously described <command>aptitude</command> commands.
ml: ഇത്തരത്തില്‍ കാര്യ‌‌ങ്ങള്‍ ശരിയാക്കിയ ശേഷം മുമ്പ് വിശദീകരിച്ച <command>aptitude</command> ആജ്ഞ ആവര്‍ത്തിച്ചുകൊണ്ട് പുതുക്കല്‍ നടപടി പുനരാരംഭിക്കാന്‍ കഴിയണം.

source: During the upgrade, you will be asked questions regarding the configuration or re-configuration of several packages. When you are asked if any file in the <filename>/etc/init.d</filename> or <filename>/etc/terminfo</filename> directories, or the <filename>/etc/manpath.config</filename> file should be replaced by the package maintainer's version, it's usually necessary to answer `yes' to ensure system consistency. You can always revert to the old versions, since they will be saved with a <literal>.dpkg-old</literal> extension.
ml: പുതുക്കല്‍ നടന്നുകൊണ്ടിരിക്കേ, പല പൊതികളുടേയും ക്രമീകരണങ്ങളേയും പുന:ക്രമീകരണങ്ങളേയും കുറിച്ച് നിങ്ങളോട് ചോദ്യ‌‌ങ്ങള്‍ ഉണ്ടായേക്കാം. ഇങ്ങനെ <filename>/etc/init.d</filename>ലേയോ, <filename>/etc/terminfo</filename>തട്ടുകളിലേയോ അല്ലെങ്കില്‍ <filename>/etc/manpath.config</filename>ലേയോ ഏതെങ്കിലും ഫയല്‍ പൊതിപരിപാലന വെര്‍ഷന്‍ കൊണ്ട് പുനസ്ഥാപിക്കണോ എന്ന ചോദ്യം വരുമ്പോള്‍ സാധാരണയായി വ്യവസ്ഥിതിയുടെ കെട്ടുറപ്പിന് 'വേണം' എന്ന ഉത്തരം നല്‍കണം. നിങ്ങള്‍ക്കെപ്പോഴും പഴയ പതിപ്പിലേക്ക് മടങ്ങിപ്പോകാന്‍ കഴിയും, കാരണം <literal>.dpkg-old</literal> അനുബന്ധത്തില്‍ അവ സൂക്ഷിക്കപ്പെട്ടിട്ടുണ്ട്.
zh_tw: 在升級的過程中，系統可能會詢問您一些問題，以便能對套件進行設定或重新設定。當您被問到是否要把在 <filename>/etc/init.d</filename> 或 <filename>/etc/terminfo</filename> 目錄中的檔案或是 <filename>/etc/manpath.config</filename> 這個檔案置換成套件維護者所提供的版本時，您通常必須回答 `yes' 以維護系統的一致性。您可以在稍後再復原為舊的設定檔，因為它們都會以在檔名後附加 <literal>.dpkg-old</literal> 的方式給保留下來。

source: If you are unsure about which package to select, run <literal>uname -r</literal> and look for a package with a similar name. For example, if you see '<literal>2.6.18-6-686</literal>', it is recommended that you install <systemitem role="package">linux-image-2.6-686</systemitem>. (Note that the <literal>k7</literal> flavor no longer exists; if you are currently using the <literal>k7</literal> kernel flavor, you should install the <literal>686</literal> flavor instead.) You may also use <command>apt-cache</command> to see a long description of each package in order to help choose the best one available. For example:
ml: ഏതു പൊതിയാണ് തെരഞ്ഞെടുക്കേണ്ടതെന്ന് ഉറപ്പില്ലെങ്കില്‍, <literal>uname -r</literal> പ്രവര്‍ത്തിപ്പിച്ച് സമാനമായ പേരുള്ള ഒരു പൊതിക്കായി തെരയുക. ഉദാഹരണത്തിന്, '<literal>2.6.18-6-686</literal>കണ്ടെത്തുകയാണെങ്കില്‍, <systemitem role="package">linux-image-2.6-686</systemitem> പ്രതിഷ്ഠിക്കാന്‍ ശുപാര്ശ ചെയ്യുന്നു. (<literal>k7</literal>രസം മേലില്‍ ഉണ്ടാവില്ലെന്ന് പ്രത്യേ‌‌കം ഓര്‍ക്കണം; <literal>k7</literal>കേര്‍ണല്‍ രസമാണ് നിങ്ങള്‍ ഇപ്പോള്‍ ഉപയോഗിക്കുന്നതെങ്കില്‍, അതിന് പകരം <literal>686</literal>രസം പ്രതിഷ്ഠിക്കണം.) ലഭ്യ‌‌മായതില്‍നിന്ന് ഏറ്റവും നല്ല‌‌ത് തെരഞ്ഞെടുക്കാന്‍ ഓരോ പൊതിയുടേയും സുദീര്‍ഘമായ ഒരു വിവരണത്തിന് <command>apt-cache</command>ആജ്ഞയും നിങ്ങള്‍ക്ക് ഉപയോഗിക്കാം. ഉദാഹരണത്തിന്:

source: You should then use <literal>aptitude install</literal> to install it. Once this new kernel is installed you should reboot at the next available opportunity to get the benefits provided by the new kernel version.
ml: ഇത് പ്രതിഷ്ഠിക്കാന്‍ പിന്നീട് നിങ്ങള്ക്ക് <literal>aptitude install</literal>ഉപയോഗിക്കാം. ഒരിക്കല്‍ ഈ പുതിയ കേര്ണല്‍ പ്രതിഷ്ഠിച്ചുകഴിഞ്ഞാല്‍ പുതിയ കേര്‍ണല്‍ പതിപ്പിന്റെ ഗുണങ്ങള്‍ ലഭ്യ‌‌മാക്കാന്‍ തൊട്ടടുത്ത സന്ദര്‍ഭത്തിലല്‍ ‍തന്നെ റീബൂട്ട് ചെയ്യേണ്ടതാണ്.
zh_tw: 接下來，您應該使用 <literal>aptitude install</literal> 來進行安裝。當新的 Kernel 安裝完畢後，您應當找個適當時機重新開機，以便能享用新的 Kernel 版本所帶來的種種好處。

source: For the more adventurous there is an easy way to compile your own custom kernel on &debian;. Install the <systemitem role="package">kernel-package</systemitem> tool and read the documentation in <filename>/usr/share/doc/kernel-package</filename>.
ml: &debian; ല്‍ ഇഷ്ടപ്പെട്ട കേര്ണല്‍ സമാഹരിക്കാന്‍ (compile) സാഹസികരായവര്ക്ക് വേറൊരു എളുപ്പവഴിയുണ്ട്. <systemitem role="package">kernel-package</systemitem>ആയുധം പ്രതിഷ്ഠിച്ച് <filename>/usr/share/doc/kernel-package</filename>ലുള്ള വിവരണം നോക്കുക.
zh_tw: 對於那些比較富有冒險心的人，我們也提供了一個在 &debian; 上自行編譯 Kernel 的簡易方法。請安裝 <systemitem role="package">kernel-package</systemitem> 工具並詳細閱讀在 <filename>/usr/share/doc/kernel-package</filename> 裡的說明文件。

source: Upgrading from a 2.6 kernel
ml: ഒരു 2.6 കെര്‍ണലില്‍ നിന്നും കയറുന്നതു്
zh_tw: 由某個 2.6 版的 Kernel 進行升級

source: If you are currently running a 2.6 series kernel from &oldreleasename; this upgrade will take place automatically after you do a full upgrade of the system packages (as described in <xref linkend="upgradingpackages"/> ).
ml: &oldreleasename;ലെ 2.6 ശ്രേണിയിലെ കേര്‍ണലാണ് നിങ്ങള്‍ ഇപ്പോള്‍ ഉപയോഗിക്കുന്നതെങ്കില്‍, വ്യ‌‌വസ്ഥയുടെ മുഴുനവീകരണത്തിന് ശേഷം ഇത് യാന്ത്രികമായിത്തന്നെ പുതുക്കിയതായി കാണാം. (<xref linkend="upgradingpackages"/> ല്‍ വിവരിച്ച പോലെ).
zh_tw: 如果您所運行的是 &oldreleasename; 所搭載的 2.6 系列的 kernel，在您進行系統套件的完整升級時，就會自動進行這項升級。（如同 <xref linkend="upgradingpackages"/> 裡所說明的）。

source: You can also take this step if you are using your own custom kernel and want to use the kernel available in &releasename;. If your kernel version is not supported by <systemitem role="package">udev</systemitem> then it is recommended that you upgrade after the minimal upgrade. If your version is supported by <systemitem role="package">udev</systemitem> you can safely wait until after the full system upgrade.
ml: സ്വേച്ഛാനുസൃതമായ ഒരു കേര്‍ണല്‍ ഉപയോഗിക്കുന്ന നിങ്ങള്‍ &releasename;ല്‍ ലഭ്യ‌‌മാകുന്ന കേര്‍ണല്‍ ഉപയോഗിക്കാനാഗ്രഹിക്കുന്നു എങ്കില്‍ നിങ്ങള്ക്ക് ഈ നടപടിയും സ്വീകരിക്കാം. <systemitem role="package">udev</systemitem> നിങ്ങളുടെ കേര്‍ണല്‍ പതിപ്പിന് പിന്തുണ നല്‍കുന്നില്ലെങ്കില്‍ ചുരുങ്ങിയ നവീകരണത്തിനു ശേഷം പുതുക്കലിന് ശുപാര്ശ ചെയ്യുന്നു. <systemitem role="package">udev</systemitem>ന്റെ പിന്തുണ നിങ്ങള്‍ക്കുണ്ടെങ്കില്‍ സുരക്ഷിതമായ ഒരു മുഴുവന്‍ വ്യ‌‌വസ്ഥാ നവീകരണത്തിനായി കാത്തിരിക്കാം.
zh_tw: 如果您是使用著自訂的 Kernel，且您希望使用 &releasename; 所搭載的 Kernel，您也可以按照這些步驟進行。如果您的 Kernel 並不被 <systemitem role="package">udev</systemitem> 所支援，在此建議您能先進行最低限度的升級後再進行 kernel 的升級。如果您的版本已被 <systemitem role="package">udev</systemitem> 所支援，您可以放心得等到全系統升級後再進行。

source: Upgrading from a 2.4 kernel
ml: കെര്‍ണലിന്റെ 2.4 പതിപ്പില്‍ നിന്നും നവീകരിക്കുന്നു
zh_tw: 由某個 2.4 版的 Kernel 進行升級
