Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: Upgrading the kernel and udev
fr: Mettre à niveau le noyau et udev
it: Aggiornamento del kernel e udev
ja: カーネルと udev のアップグレード
pt: Actualizar o kernel e o udev
ro: Actualizarea nucleului și a udev
sv: Uppgradering av kärnan och udev

source: The <systemitem role="package">udev</systemitem> version in &releasename; requires a kernel of version 2.6.26 or newer with the <literal>CONFIG_SYSFS_DEPRECATED</literal> option disabled and the <literal>CONFIG_INOTIFY_USER</literal> and <literal>CONFIG_SIGNALFD</literal> options enabled. Because the standard Debian kernels in &oldreleasename; (version 2.6.26) have <literal>CONFIG_SYSFS_DEPRECATED</literal> enabled, and the <systemitem role="package">udev</systemitem> version in &oldreleasename; will not provide all the functionality expected by the latest kernels, special care must be taken when upgrading to avoid putting your system in an unbootable state.
fr: La version du paquet <systemitem role="package">udev</systemitem> de &Releasename; nécessite un noyau 2.6.26 ou plus récent avec l'option <literal>CONFIG_SYSFS_DEPRECATED</literal> désactivée et les options <literal>CONFIG_INOTIFY_USER</literal> et <literal>CONFIG_SIGNALFD</literal> activées. Sachant que l'option <literal>CONFIG_SYSFS_DEPRECATED</literal> est activée dans le noyau Debian standard de &Oldreleasename; (version 2.6.26), et que la version d'<systemitem role="package">udev</systemitem> fournie par &Oldreleasename; n'offre pas toutes les fonctionnalités attendues par les derniers noyaux, il faut faire très attention lors de la mise à niveau pour garder le système amorçable.
it: La versione di <systemitem role="package">udev</systemitem> in &releasename; necessita di un kernel 2.6.26 o più recente con l'opzione <literal>CONFIG_SYSFS_DEPRECATED</literal> disattiva e le opzioni <literal>CONFIG_INOTIFY_USER</literal> e <literal>CONFIG_SIGNALFD</literal> attive. Poiché i kernel Debian standard in &oldreleasename; (versione 2.6.26) hanno <literal>CONFIG_SYSFS_DEPRECATED</literal> attiva e la versione in &oldreleasename; di <systemitem role="package">udev</systemitem> non fornisce tutte le funzionalità attese dai kernel più recenti, si deve prestare particolare attenzione durante l'aggiornamento in modo da evitare di rendere il proprio sistema non avviabile.
ja: &releasename; バージョンの <systemitem role="package">udev</systemitem> には、<literal>CONFIG_SYSFS_DEPRECATED</literal> が無効で、<literal>CONFIG_INOTIFY_USER</literal> と <literal>CONFIG_SIGNALFD</literal> オプションが有効な 2.6.26 以降のカーネルが必要です。&oldreleasename; での標準 Debian カーネル (バージョン 2.6.26) は <literal>CONFIG_SYSFS_DEPRECATED</literal> が有効になっており、&oldreleasename; バージョンの <systemitem role="package">udev</systemitem> は最新のカーネルが期待する機能をすべて提供していなかったため、アップグレードの際にはシステムを起動不可能な状態にしないように特別に注意を払う必要があります。
pt: A versão do <systemitem role="package">udev</systemitem> em &releasename; requer um kernel de versão 2.6.26 ou posterior com a opção <literal>CONFIG_SYSFS_DEPRECATED</literal> desactivada e as opções <literal>CONFIG_INOTIFY_USER</literal> e <literal>CONFIG_SIGNALFD</literal> activadas. Porque os kernels Debian standard em &oldreleasename; (versão 2.6.26) têm <literal>CONFIG_SYSFS_DEPRECATED</literal> activo, e a versão de <systemitem role="package">udev</systemitem> em &oldreleasename; não irá disponibilizar todas as funcionalidades esperadas pelos kernels mais recentes, é preciso tomar cuidado especial ao actualizar para evitar que o seu sistema fique num estado que não arranque.
ro: Versiunea <systemitem role="package">udev</systemitem> din &releasename; necesită un nucleu versiunea 2.6.26 sau mai nou cu opțiunea <literal>CONFIG_SYSFS_DEPRECATED</literal> dezactivată și cu opțiunile <literal>CONFIG_INOTIFY_USER</literal> și <literal>CONFIG_SIGNALFD</literal> activate. Deoarece nucleele standard din Debian &oldreleasename; (versiunea 2.6.26) au <literal>CONFIG_SYSFS_DEPRECATED</literal> activată, și versiunea <systemitem role="package">udev</systemitem> din &oldreleasename; nu poate oferi toată funcționalitatea necesară acestor nuclee, trebuie acordată atenție atunci când se actualizează pentru a evita ca sistemului să devină de nepornit.
sv: <systemitem role="package">udev</systemitem>-versionen i &releasename; kräver en kärna med version 2.6.26 eller nyare där flaggan <literal>CONFIG_SYSFS_DEPRECATED</literal> är avaktiverad och flaggorna <literal>CONFIG_INOTIFY_USER</literal> och <literal>CONFIG_SIGNALFD</literal> är aktiverade. Eftersom Debians standardkärna i &oldreleasename; (version 2.6.26) har <literal>CONFIG_SYSFS_DEPRECATED</literal> aktiverad och <systemitem role="package">udev</systemitem>-versionen i &oldreleasename; inte kan leverera all funktionalitet som nyare kärnor förväntar sig måste speciella åtgärder genomföras vid uppgradering för att inte sätta systemet i ett ostartbart skick.

source: Booting the 2.6.26 kernel from &oldreleasename; with the <systemitem role="package">udev</systemitem> from &releasename; may result in a failure to correctly assign names to network devices, and will also fail to apply certain additional permissions to block devices (such as access by the <literal>disk</literal> group). The software itself will appear to be working, but some rules (for example, network-based rules) will not be loaded properly. It is therefore strongly recommended that you upgrade the kernel on its own at this point, to ensure a compatible kernel is available before upgrading <systemitem role="package">udev</systemitem>.
fr: Démarrer sur le noyau 2.6.26 de &Oldreleasename; avec le paquet <systemitem role="package">udev</systemitem> de &Releasename; peut entraîner un échec lors du nommage des périphériques réseau, et aussi lors de l'application de certaines permissions additionnelles sur des périphériques bloc (par exemple les accès du groupe <literal>disk</literal>). Le logiciel semblera marcher, mais certaines règles (par exemple celles basées sur le réseau) ne seront pas effectivement chargées. Avant de mettre à niveau <systemitem role="package">udev</systemitem>, nous vous recommandons donc fortement de mettre à niveau le noyau, afin de vous assurer que le noyau présent sera compatible avec <systemitem role="package">udev</systemitem>.
it: L'avvio del kernel 2.6.26 da &oldreleasename; con la versione di <systemitem role="package">udev</systemitem> di &releasename; potrebbe comportare l'impossibilità di assegnare correttamente i nomi alle interfacce di rete e potrebbe fallire anche l'assegnazione di alcuni permessi aggiuntivi ai device a blocchi (per esempio l'accesso al gruppo <literal>disk</literal>). Sembra che il programma funzioni ma alcune regole (per esempio le regole per la rete) non sono caricate correttamente. Quindi si raccomanda fortemente di aggiornare adesso il kernel per conto proprio, in modo da assicurarsi di avere a disposizione un kernel compatibile prima dell'aggiornamento di <systemitem role="package">udev</systemitem>.
ja: &oldreleasename; の 2.6.26 カーネルを &releasename; の <systemitem role="package">udev</systemitem> と共に起動すると、ネットワークデバイスへの正しい名前の割り当てや、(<literal>disk</literal> グループによってアクセスされるような) ブロックデバイスへの特定の追加パーミッション適用に、失敗することがあります。ソフトウェアそのものは動いている様に見えますが、いくつかのルール (例えば、ネットワークベースのルール) が正しく読み込まれません。したがって、<systemitem role="package">udev</systemitem> をアップグレードする前に互換性があるカーネルが利用可能になっているのを確実にするため、この時点でカーネルそのものをアップグレードすることを強くお勧めします。
pt: Arrancar o kernel 2.6.26 de &oldreleasename; com o <systemitem role="package">udev</systemitem> de &releasename; pode resultar em falha ao atribuir correctamente os nomes dos dispositivos de rede, e irá também falhar ao aplicar certas permissões adicionais a dispositivos de bloco (tais como o acesso pelo grupo <literal>disk</literal>). O software em si irá parecer estar a funcionar, mas algumas regras (por exemplo, regras baseadas em rede) não serão carregadas correctamente. Por isto é fortemente recomendado que actualize o próprio kernel neste ponto, para assegurar que está disponível um kernel compatível antes de actualizar o <systemitem role="package">udev</systemitem>.
ro: Încărcarea nucleului 2.6.26 din &oldreleasename; cu <systemitem role="package">udev</systemitem> din &releasename; poate determina atribuirea incorectă a numelor dispozitivelor de rețea, și de asemena aplicarea greșită a anumitor permisiuni suplimentare a dispozitivelor tip bloc (cum ar fi accesul la grupul <literal>disk</literal>). Programul în sine va apărea că funcționează, dar unele reguli (spre exemplu, regulile ce țin de rețea) nu vor fi încărcate corespunzător. Este așadar foarte indicat să actualizați nucleul acum, pentru a asigura disponibilitatea unui nucleu compatibil înainte de a actualiza <systemitem role="package">udev</systemitem>.
sv: Att starta med kärna 2.6.26 från &oldreleasename; med <systemitem role="package">udev</systemitem> från &releasename; kan innebära att rätt namn inte kan sättas på nätverksenheter och att vissa rättigheter inte kan sättas på blockenheter (exempelvis tillgång för <literal>disk</literal>-gruppen). Mjukvaran som sådan kommer att se ut som att den fungerar men vissa regler (exempelvis nätverksbaserade regler) kommer inte att läsas in korrekt. Det rekommenderas därför starkt att du uppgraderar kärnan för sig för att försäkra att en kompatibel kärna är tillgänglig före uppgradering av <systemitem role="package">udev</systemitem>.

source: To proceed with this kernel upgrade, run:
fr: Pour effectuer cette mise à niveau du noyau, exécutez :
it: Per procedere con questo aggiornamento del kernel, si esegua:
ja: このカーネルアップグレードを実行するには、次のコマンドを実行してください。
ml: ഈ കെര്‍ണല്‍ നവീകരണവുമായി മുമ്പോട്ടു് പോകാന്‍, പ്രവര്‍ത്തിപ്പിയ്ക്കേണ്ടതു്:
pt: Para proceder com a actualização deste kernel, corra:
ro: Pentru a începe această actualizare de nucleu, executați:
sv: För att fortsätta med den här kärnuppgraderingen ska du köra:
zh_tw: 要進行 kernel 的升級，請執行：

source: # apt-get install linux-image-2.6-<replaceable>flavor</replaceable>
fr: # apt-get install linux-image-2.6-<replaceable>variante</replaceable>
ro: # apt-get install linux-image-2.6-<replaceable>varianta</replaceable>
sv: # apt-get install linux-image-2.6-<replaceable>variant</replaceable>

source: See <xref linkend="kernel-metapackage"/> for help in determining which flavor of kernel package you should install.
fr: Consultez <xref linkend="kernel-metapackage"/> pour de l'aide sur la détermination de la variante du paquet de noyau que vous devriez installer.
it: Si consulti <xref linkend="kernel-metapackage"/> per poter determinare quale flavor del pacchetto kernel si dovrebbe installare.
ja: カーネルパッケージのどのフレーバーをインストールすべきか、判断に迷ったら、<xref linkend="kernel-metapackage"/>を参照してください。
ml: കെര്‍ണല്‍ പൊതിയുടെ ഏതു് വകഭേദമാണു് ഇന്‍സ്റ്റോള്‍ ചെയ്യേണ്ടതെന്നതിനെക്കുറിച്ചു് സഹായത്തിനു് <xref linkend="kernel-metapackage"/> കാണുക.
pt: Veja <xref linkend="kernel-metapackage"/> para ajuda em determinar qual o 'flavor' do pacote de kernel que deve instalar.
ro: A se vedea <xref linkend="kernel-metapackage"/> pentru a vă ajuta să decideți care variantă de pachet de nucleu ar trebui să instalați.
sv: Se <xref linkend="kernel-metapackage"/> för hjälp med att fastställa vilken variant av kärnpaketen som du ska installera.
zh_tw: 請參閱 <xref linkend="kernel-metapackage"/> 來幫助您決定您該安裝的 kernel 套件的類別。

source: The move of some firmware to separate packages in the non-free archive (see <xref linkend="nonfree-firmware"/>) means that it may be necessary to install additional firmware packages after upgrading to the new kernel to support some hardware. Some hardware that was operating correctly before the upgrade might fail to work once the kernel is upgraded. Look out for warning messages from the kernel install or initramfs generation scripts, and make sure the necessary firmware packages are installed.
sv: Flytten av vissa inbäddade mjukvaror till paket i den ofria (non-free) delen av arkivet (läs mer i kapitlet <xref linkend="nonfree-firmware"/>) kan innebära att det kan behövas nya paket installerade efter uppgraderingen till ny kärna. En del hårdvara som fungerade korrekt innan uppgraderingen kan sluta fungera när kärnan är uppgraderad. Var vaksam för varningsmeddelanden under kärnans installationsskript och när skripten som skapar initramfs körs. Tillse att nödvändiga paket för inbäddad mjukvara är installerad.

source: Users of the <systemitem role="package">grub</systemitem> bootloader should make sure that <command>update-grub</command> is run as part of the kernel upgrade, or run it manually.
fr: Les utilisateurs du programme d'amorçage <systemitem role="package">grub</systemitem> doivent s'assurer que <command>update-grub</command> est lancé lors la mise à niveau du noyau, ou doivent le lancer manuellement.
it: Gli utenti del bootloader <systemitem role="package">grub</systemitem> devono essere sicuri che <command>update-grub</command> sia eseguito durante il processo di aggiornamento del kernel oppure di eseguirlo manualmente.
ja: <systemitem role="package">grub</systemitem> ブートローダのユーザは、カーネルのアップグレードの一部分としてして <command>update-grub</command> が走るのを確認するか、手動で実行する必要があります。
pt: Os utilizadores do carregador de arranque <systemitem role="package">grub</systemitem> deve certificar-se que <command>update-grub</command> é executado como parte da actualização do kernel, ou executá-lo manualmente.
ro: Utilizatorii încărcătorului de sistem <systemitem role="package">grub</systemitem> trebuie să se asigure că <command>update-grub</command> este rulat ca parte a procesului de actualizare, sau să-l ruleze manual.
sv: Användare av uppstartshanteraren <systemitem role="package">grub</systemitem> ska tillse att <command>update-grub</command> körs som en del av uppgradering av kärnan eller köra det manuellt.

source: Immediately after upgrading the kernel, you should also install the new <systemitem role="package">udev</systemitem> to minimize the risk of other incompatibilities caused by using the old udev with a new kernel <footnote>
fr: Juste après la mise à niveau du noyau, vous devriez aussi installer le nouveau <systemitem role="package">udev</systemitem>, afin de minimiser le risque d'incompatibilité entre le vieux udev et le nouveau noyau <footnote>
it: Immediatamente dopo aver aggiornato il kernel, si raccomanda l'installazione anche del nuovo <systemitem role="package">udev</systemitem> per minimizzare il rischio di altre incompatibilità causate dall'uso del vecchio udev con il nuovo kernel<footnote>
ja: カーネルのアップグレード直後に、古い udev と新しいカーネルを使うことによる非互換性のリスクを最小限にするため、新しい <systemitem role="package">udev</systemitem> もインストールする必要があります <footnote>
pt: Imediatamente após actualizar o kernel, você deve também instalar o novo <systemitem role="package">udev</systemitem> para minimizar o risco de outras incompatibilidades causadas por usar o udev antigo com um kernel novo<footnote>
ro: Imediat după actualizarea nucleului, va trebui să instalați de asemenea și noul <systemitem role="package">udev</systemitem> pentru a micșora riscul altor incompatibilități cauzate de folosirea vechiului udev cu noul nucleu <footnote>
sv: Direkt efter att kärnan uppgraderats ska du också installera den nya <systemitem role="package">udev</systemitem> för att minimera risken för andra fel orsakade av den äldre versionen av udev används med en ny kärna <footnote>

source: There are also known incompatibilities between the old kernel and the new <systemitem role="package">udev</systemitem>. If you find issues after the reboot with the new kernel you will have to downgrade the <systemitem role="package">udev</systemitem> in order to use the old one.
fr: Il y a aussi des incompatibilités connues entre le vieux noyau et le nouveau paquet <systemitem role="package">udev</systemitem>. Si vous avez des problèmes lors du redémarrage avec le nouveau noyau, vous devrez repasser sur l'ancien <systemitem role="package">udev</systemitem>.
it: Esistono delle incompatibilità note tra il vecchio kernel e il nuovo <systemitem role="package">udev</systemitem>. Se si riscontrano dei problemi dopo aver riavviato con il nuovo kernel è necessario retrocedere <systemitem role="package">udev</systemitem> in modo da usare la versione precedente.
ja: 古いカーネルと新しい <systemitem role="package">udev</systemitem> の間には、既知の非互換性があります。新しいカーネルで再起動後に問題が見つかった場合には、以前のものを使うために <systemitem role="package">udev</systemitem> をダウングレードする必要があるでしょう。
pt: Também existem incompatibilidades conhecidas entre o kernel antigo e o novo <systemitem role="package">udev</systemitem>. Se você encontrar problemas após o reiniciar do sistema com o novo kernel, vai precisar de fazer o downgrade ao <systemitem role="package">udev</systemitem> de modo a usar o antigo.
ro: Se cunosc de asemena incompatibilități între vechiul nucleu și noul <systemitem role="package">udev</systemitem>. Dacă observați probleme după repornirea cu noul nucleu va trebuie să instalați o versiune mai veche a <systemitem role="package">udev</systemitem> pentru a putea să îl folosiți pe cel vechi.
sv: Kombinationen gammal kärna och ny <systemitem role="package">udev</systemitem> har kända fel. Om du drabbas av fel efter omstarten med den nya kärnan kommer du att behöva nedgradera <systemitem role="package">udev</systemitem>-paketet för att kunna använda den gamla.

source: </footnote>. You can do this by running:
fr: </footnote>. Vous pouvez le faire en lançant :
it: </footnote>. Per farlo eseguire:
ja: </footnote>。以下のように実行します。
pt: </footnote>. Você pode fazer isto ao correr:
ro: </footnote>. Puteți face asta rulând:
sv: </footnote>. Du kan göra detta genom att köra:

source: You should reboot the system <footnote>
it: Riavviare il sistema<footnote>
ro: Ar trebui să reporniți sistemul <footnote>
sv: Du bör starta om systemet <footnote>

source: If you are logging the upgrade as described in <xref linkend="upgradingpackages"/>, please, use <command>script</command> again to log the next steps of the upgrade after the reboot in order to log the result of the actions described in <xref linkend="upgrading-full"/>.
sv: om du loggar uppgraderingsprocessen så som beskrivs i <xref linkend="upgradingpackages"/> ska du återigen köra <command>script</command> för att efter omstarten åter logga resultaten av åtgärderna som beskrivs i <xref linkend="upgrading-full"/>.

source: </footnote> once you have upgraded both the kernel and <systemitem role="package">udev</systemitem>.
it: </footnote> dopo aver aggiornato il kernel e <systemitem role="package">udev</systemitem>.
ro: </footnote> imediat ce ați actualizat atât nucleul cât și <systemitem role="package">udev</systemitem>.
sv: </footnote> när du har uppgraderat både kärna och <systemitem role="package">udev</systemitem>.

source: Upgrading the system
fr: Mettre à niveau le système
it: Aggiornamento del sistema
ja: システムのアップグレード
pt: Actualizar o sistema
ro: Actualizarea sistemului
sv: Uppgradering av systemet

source: Once you have taken the previous steps, you are now ready to continue with the main part of the upgrade. Execute:
fr: Vous êtes maintenant prêt à continuer avec la partie principale de la mise à niveau. Exécutez :
it: Una volta completati i passaggi descritti in precedenza, si è pronti per continuare con la parte principale dell'aggiornamento. Si esegua:
ja: これまでの手順を実行し終わったら、アップグレードの主要な部分を続ける準備ができています。以下のコマンドを実行してください。
pt: Após ter executado os passos anteriores, você está agora pronto para continuar com a parte principal da actualização. Execute:
ro: Odată executați pașii anteriori, sunteți gata să continuați cu partea principală a actualizării. Executați:
sv: När du genomfört föregående steg är du redo att fortsätta med huvuddelen av uppgraderingen. Kör:

source: The upgrade process for other releases recommended the use of <command>aptitude</command> for the upgrade. This tool is not recommended for upgrades from &oldreleasename; to &releasename;.
fr: Nous recommandions d'utiliser <command>aptitude</command> lors du processus de mise à niveau pour d'autres versions. Cet outil n'est pas recommandé pour les mises à niveau de &Oldreleasename; à &Releasename;.
it: Nelle versioni precedenti era raccomandato l'uso di <command>aptitude</command> per l'aggiornamento. Questo programma non è raccomandato per l'aggiornamento da &oldreleasename; a &releasename;.
ja: 他のリリースでのアップグレード作業では、アップグレードに <command>aptitude</command> の利用を推奨していました。このツールは &oldreleasename; から &releasename; へのアップグレードには推奨されません。
pt: O processo de actualização dos outros lançamentos recomendava o uso do <command>aptitude</command> para a actualização. Esta ferramenta não é recomendada para actualizações de &oldreleasename; para &releasename;.
ro: Procesul de actualizare pentru alte lansări recomanda utilizarea <command>aptitude</command> pentru actualizare. Această unealtă nu este recomandată pentru actualizări de la &oldreleasename; la &releasename;.
sv: Uppgraderingsprocessen för andra utgåvor rekommenderade att använda <command>aptitude</command> för uppgraderingen. Detta verktyg är inte rekommenderat för uppgradering från &oldreleasename; till &releasename;.
