Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: If you do not see any output, then you will need to install a new linux-image package by hand. To see a list of available linux-image-2.6 metapackages, run:
fr: Si cela ne donne rien, vous devez alors installer un paquet linux-image vous-même. Pour voir la liste des métapaquets linux-image-2.6 disponibles, exécutez :
it: Se non si vede alcun output, si dovrà installare manualmente un nuovo pacchetto linux-image. Per vedere un elenco dei metapacchetti linux-image-2.6 disponibili si esegua:
ja: 何も出力されない場合は、新しい linux-image パッケージを手作業でインストールする必要があります。利用可能な linux-image-2.6 メタパッケージの一覧を見るには次のように実行してください。
ml: ഫലപ്രാപ്തി ഒന്നും കാണുന്നില്ലെങ്കില്‍, നിങ്ങള്ക്ക് ഒരു പുതിയ ലീനക്സ്- ഇമേജ് പൊതി കൈയോടെ പ്രതിഷ്ഠിക്കേണ്ടതായിവരും. നിലവില്‍ ലഭ്യ‌‌മായ ലീനക്സ്-ഇമേജ്-2.6 മെറ്റാ പൊതികളുടെ ഒരു പട്ടിക കാണാന്‍ ഇത് പ്രവര്‍ത്തിപ്പിക്കുക:
pt: Se não vê nenhum 'output' poderá ter que instalar um novo pacote linux-image manualmente. Para ver uma lista de meta-pacotes linux-image-2.6 disponíveis corra:
ro: Dacă această comandă nu afișează nimic, atunci va trebui să instalați manual un pachet linux-image nou. Pentru a vedea o listă cu meta-pachetele linux-image-2.6 disponibile, rulați comanda:
sv: Om du inte ser något utdata, behöver du installera ett nytt linux-image-paket för hand. Kör följande kommando för att se en lista över tillgängliga linux-image-2.6-metapaket:
zh_tw: 如果您沒有看到任何輸出文字，那麼您將得手動安裝一個新的 linux-image 虛擬套件。若想得到可用的 linux-image-2.6 虛擬套件列表，請執行：

source: If you are unsure about which package to select, run <literal>uname -r</literal> and look for a package with a similar name. For example, if you see '<literal>2.6.26-2-686</literal>', it is recommended that you install <systemitem role="package">linux-image-2.6-686</systemitem>. You may also use <command>apt-cache</command> to see a long description of each package in order to help choose the best one available. For example:
fr: Si vous ne savez pas quel paquet sélectionner, exécutez <literal>uname -r</literal> et recherchez un paquet avec un nom similaire. Par exemple, si vous voyez <literal>2.6.18-6-686</literal>, il est recommandé d'installer <systemitem role="package">linux-image-2.6-686</systemitem>. Vous pouvez également utiliser <command>apt-cache</command> pour voir une description longue de chaque paquet. Cela peut vous aider à choisir le meilleur paquet disponible. Par exemple :
it: Se non si è sicuri sul pacchetto da selezionare, si esegua <literal>uname -r</literal> e si cerchi un pacchetto con un nome simile. Ad esempio, se si vede <quote><literal>2.6.26-2-686</literal></quote> è consigliata l'installazione di <systemitem role="package">linux-image-2.6-686</systemitem>. Si può anche utilizzare <command>apt-cache</command> per vedere una lunga descrizione di ciascun pacchetto che aiuti a scegliere il migliore disponibile. Ad esempio:
ja: どのパッケージを選択すればよいのかわからない場合は、<literal>uname -r</literal> を実行し、似た名前をもつパッケージを探してください。例えば、コマンドの出力が '<literal>2.6.26-2-686</literal>' の場合は <systemitem role="package">linux-image-2.6-686</systemitem> をインストールすることをお勧めします。利用可能なパッケージのうち最良のものを選ぶ手助けとして、次のように <command>apt-cache</command> を用いて各パッケージのパッケージ説明の詳細版を参照してもよいでしょう。
pt: Se estiver inseguro sobre que pacote seleccionar, corra <literal>uname -r</literal> e procure um pacote com um nome semelhante. Por exemplo, se vir '<literal>2.6.26.2-686</literal>', é-lhe recomendado que instale o <systemitem role="package">linux-image-2.6-686</systemitem>. Também pode utilizar o <command>apt-cache</command> para ver uma descrição longa sobre cada pacote de modo a ajudar a escolher o melhor disponível. Por exemplo:
ro: Dacă nu sunteți siguri ce pachet ar trebui să alegei, rulați comanda <literal>uname -r</literal> și căutați un pachet cu un nume asemănător. De exemplu, dacă va fi afișat '<literal>2.6.26-2-686</literal>' este recomadat să instalați <systemitem role="package">linux-image-2.6-686</systemitem>. De asemenea, se poate rula comanda <command>apt-cache</command> ca să vedeți descrierea lungă a fiecărui pachet pentru a face o alegere potrivită. De exemplu:
sv: Om du är osäker på vilket paket du ska välja, kör <literal>uname -r</literal> och leta efter ett paket med liknande namn. Om du till exempel ser <quote><literal>2.6.26-2-686</literal></quote> rekommenderas det att du installerar <systemitem role="package">linux-image-2.6-686</systemitem>. Du kan även använda <command>apt-cache</command> för att se en lång beskrivning för varje paket för att hjälpa dig att välja den bästa möjliga. Till exempel:

source: You should then use <literal>apt-get install</literal> to install it. Once this new kernel is installed you should reboot at the next available opportunity to get the benefits provided by the new kernel version.
fr: Vous pouvez alors installer le paquet choisi en utilisant la commande <literal>apt-get install</literal>. Une fois ce nouveau noyau installé, vous devriez redémarrer dès que possible afin de profiter des améliorations fournies par la nouvelle version du noyau.
it: Si dovrebbe quindi utilizzare <literal>apt-get install</literal> per installarlo. Una volta che questo nuovo kernel è installato si dovrebbe riavviare alla prossima opportunità disponibile per poter apprezzare i benefici offerti dalla nuova versione del kernel.
ja: インストールするカーネルイメージが決まったら、<literal>apt-get install</literal> でインストールします。新しいカーネルがインストールされたら、再起動できる時に再起動し、新しいバージョンのカーネルを有効にしてください。
pt: Deverá então utilizar <literal>apt-get install</literal> para o instalar. Uma vez que este novo kernel esteja instalado deverá reinicializar na primeira oportunidade para obter os benefícios disponibilizados pela nova versão do kernel.
ro: Utilizați apoi comanda <literal>apt-get install</literal> pentru instalare. Odată ce ați instalat noul nucleu va trebui să reporniți sistemul cu prima ocazie pentru a beneficia de acesta.
sv: Du bör sedan använda <literal>apt-get install</literal> för att installera den. När den här nya kärnan har installerats bör du starta om vid nästa möjliga tillfälle för att dra nytta av den nya kärnversionen.

source: For the more adventurous there is an easy way to compile your own custom kernel on &debian;. Install the <systemitem role="package">kernel-package</systemitem> tool and read the documentation in <filename>/usr/share/doc/kernel-package</filename>. Alternatively, you can also use the kernel sources, provided in the <systemitem role="package">linux-source-2.6</systemitem> package. You can make use of the <literal>deb-pkg</literal> target available in the sources' makefile for building a binary package. There are some differences in these two approaches, please consult the respective package's documentation.
fr: Pour les plus courageux, il existe un moyen facile pour compiler votre propre noyau sous &debian;. Installez les outils <systemitem role="package">kernel-package</systemitem> et lisez la documentation dans <filename>/usr/share/doc/kernel-package</filename>. Sinon, vous pouvez aussi utiliser les sources du noyau en installant le paquet <systemitem role="package">linux-source-2.6</systemitem>. Vous pouvez utiliser la cible <literal>deb-pkg</literal> du fichier Makefile fourni dans les sources pour construire un paquet binaire. Il existe cependant des différences entre les approches, merci de consulter les documentations respectives des paquets.
it: Per i più avventurosi esiste un modo agevole per compilare il proprio kernel personalizzato su &debian;. Si installi lo strumento <systemitem role="package">kernel-package</systemitem> e si legga la documentazione contenuta in <filename>/usr/share/doc/kernel-package</filename>. In alternativa, è anche possibile usare i sorgenti del kernel, forniti dal pacchetto <systemitem role="package">linux-source-2.6</systemitem>. Usare il target <literal>deb-pkg</literal> disponibile nel makefile dei sorgenti per creare il pacchetto binario. Ci sono alcune differenze tra questi due approcci, consultare la documentazione dei rispettivi pacchetti.
ja: 少し勇気のある人には、&debian; 上で簡単に自分のカスタムカーネルをコンパイルするやり方があります。<systemitem role="package">kernel-package</systemitem> ツールをインストールして、<filename>/usr/share/doc/kernel-package</filename> にあるドキュメントを読んでください。あるいは、<systemitem role="package">linux-source-2.6</systemitem> で提供されるカーネルソースを使うこともできます。バイナリパッケージの構築には、ソース中の Makefile 中の <literal>dep-pkg</literal> ターゲットが使えます。この二つのやり方にはいくつか違いがあるので、それぞれのパッケージのドキュメントを確認してください。
pt: Para os mais aventureiros existe um modo mais fácil de compilar o seu próprio kernel personalizado em &debian;. instale a ferramenta <systemitem role="package">kernel-package</systemitem> e leia a documentação em <filename>/usr/share/doc/kernel-package</filename>. Alternativamente, você também pode usar as fontes do kernel, disponibilizadas no pacote <systemitem role="package">linux-source-2.6</systemitem>. Você pode fazer uso do alvo do <literal>deb-pkg</literal> disponível no makefile das fontes para construir um pacote binário. Existem algumas diferenças nestas duas maneiras, por favor consulte a documentação do pacote respectivo.
ro: Pentru cei mai îndrăzneți există un mod mai ușor să compilați propriul nucleu folosind &debian;. Instalați unealta <systemitem role="package">kernel-package</systemitem> și citiți documentația din <filename>/usr/share/doc/kernel-package</filename>. Ca variantă, puteți de asemenea să folosiți sursele nucleului oferite de pachetul <systemitem role="package">linux-source-2.6</systemitem>. Puteți folosi ținta <literal>deb-pkg</literal> disponibilă în fișierul „makefile” ce vine cu sursele pentru a construi fișierele binare. Există unele diferențe între cele două abordări, citiți documentația fiecărui pachet pentru detalii.
sv: För den äventyrlige finns ett enkelt sätta att kompilera sina egen modifierade kärna på &debian;. Installera verktyget <systemitem role="package">kernel-package</systemitem> och läs dokumentationen i <filename>/usr/share/doc/kernel-package</filename>. Alternativt kan du använda kärnans källkod genom paketet <systemitem role="package">linux-source-2.6</systemitem>. Du kan använda målet <literal>deb-pkg</literal> i källkodens makefil för att bygga binärpaketet. Det finns några skillnader mellan dessa två vägar, läs i respektive pakets dokumentation.

source: If possible, it is to your advantage to upgrade the kernel package separately from the main <literal>dist-upgrade</literal> to reduce the chances of a temporarily non-bootable system. Note that this should only be done after the minimal upgrade process described in <xref linkend="minimal-upgrade"/>.
fr: Si possible, vous devriez mettre à niveau le noyau (par le paquet idoine) séparément de la mise à niveau (<literal>dist-upgrade</literal>) principale pour réduire les risques d'avoir un système temporairement non amorçable. Notez que cela devrait être effectué uniquement après le processus de mise à niveau minimal décrit en <xref linkend="minimal-upgrade"/>.
it: Se possibile, è preferibile aggiornare il pacchetto del kernel separatamente dall'aggiornamento <literal>dist-upgrade</literal> principale, per ridurre i rischi di trovarsi con un sistema temporaneamente non avviabile. Si noti che questo dovrebbe essere fatto soltanto dopo il processo di aggiornamento minimo descritto in <xref linkend="minimal-upgrade"/>.
ja: 可能なら、カーネルパッケージのアップグレードをメインの <literal>dist-upgrade</literal> と分けることで、一時的にでも起動不能なシステムにしてしまうことを極力避けられます。カーネルパッケージのアップグレードは、<xref linkend="minimal-upgrade"/>で説明した最小アップグレードの手順の後以外では行うべきでないことに注意してください。
ml: താല്‍ക്കാലികമായി ബൂട്ട് ചെയ്യാത്ത ഒരവസ്ഥ വരാതിരിക്കാന്‍, കഴിയുമെങ്കില്‍ പ്രധാനപ്പെട്ട <literal>dist-upgrade</literal> നവീകരണത്തില്‍നിന്ന് ഭിന്നമായി കേര്‍ണല്‍ പൊതി ഒറ്റക്ക് നവീകരിക്കുന്നതാണ് നിങ്ങളുടെ നന്മക്ക് നല്ല‌‌ത്. <xref linkend="minimal-upgrade"/>ല്‍ വിവരിച്ച കുറഞ്ഞ നവീകരണപ്രക്രിയക്ക് ശേഷം മാത്രമേ ചെയ്യാവൂ എന്ന് ശ്രദ്ധിച്ചിരിക്കണം.
pt: Se possível, é vantajoso para si em actualizar o pacote do kernel separadamente do <literal>dist-upgrade</literal> principal para reduzir as probabilidades de ter um sistema temporariamente incapaz de arrancar. Note que isto deve apenas ser feito após o processo mínimo de actualização descrito em <xref linkend="minimal-upgrade"/>.
ro: Dacă este posibil, ar fi spre avantajul dumneavoastră să înnoiți pachetul cu nucleul separat de procedura de <literal>dist-upgrade</literal> pentru a reduce șansele de a avea temporar probleme la inițializarea sistemului. A se reține că aceasta ar trebui să se facă doar după înnoirea minimală descrisă în <xref linkend="minimal-upgrade"/>.
sv: Om möjligt är det till din fördel att uppgradera kärnpaketet separat från själva <literal>dist-upgrade</literal> för att minska chanserna för ett temporärt icke-startbart system. Observera att det här endast bör göras efter den minimala uppgraderingsprocessen, beskriven i <xref linkend="minimal-upgrade"/>.

source: Device enumeration reordering
fr: Réordonnancement de l'énumération des périphériques
it: Riordino dell'enumerazione dei dispositivi
ja: デバイスの整列順序の変更
ml: ഉപകരണങ്ങള്‍ക്കു് സംഖ്യയിടുന്നതില്‍ മാറ്റം
pt: Reordenação da enumeração de dispositivos
ro: Reordonarea enumerării dispozitivelor
sv: Ny ordning för enhetsnumrering
zh_tw: 重新排序裝置列表

source: In &oldreleasename; and later, a new kernel mechanism for hardware discovery may change the order in which devices are discovered on your system on each boot, affecting the device names assigned to them. For example, if you have two network adapters that are associated with two different drivers, the devices eth0 and eth1 refer to may be swapped.
fr: Dans &Oldreleasename; et suivantes, un nouveau mécanisme noyau en charge de l'identification du matériel peut changer l'ordre dans lequel les périphériques sont trouvés sur le système à chaque démarrage, ce qui affecte le nom qui leur est associé. Par exemple, si vous avez des cartes réseau qui sont associées à deux pilotes différents, les périphériques auxquels eth0 et eth1 se réfèrent peuvent être inversés.
it: Da &oldreleasename; in poi un nuovo meccanismo del kernel per il rilevamento dell'hardware potrebbe cambiare l'ordine in cui i dispositivi vengono rilevati sul sistema a ogni avvio, interessando l'ordine in cui i nomi dei dispositivi sono assegnati. Per esempio, se si hanno due adattatori di rete associati a due diversi driver i dispositivi ai quali eth0 e eth1 fanno riferimento potrebbero venire scambiati.
ja: &oldreleasename; 以降では、ハードウェアの検出に関する新しいカーネルの仕組みは、システム上でデバイスが検出される順番を起動時ごとに変えるかもしれず、与えられるデバイス名が影響を受けます。例えば、2 つの異なるドライバと結び付いた 2 つのネットワークアダプタがある場合、eth0 と eth1 が参照するデバイスは入れ替わるかもしれません。
pt: Em &oldreleasename; e posteriores, um novo mecanismo de kernel para descoberta de hardware pode alterar a ordem pela qual os dispositivos são descobertos no seu sistema a cada arranque, afectando os nomes de dispositivos atribuídos a eles. Por exemplo, se possuir duas placas de rede que estejam associadas a dois controladores diferentes, os dispositivos eth0 e eth1 podem ser trocados.
ro: În &oldreleasename; și ulterior, un nou mecanism pentru descoperirea dispozitivelor fizice folosit de nucleu, poate schimba ordinea în care dispozitivele sunt descoperite în sistem la fiecare repornire afectând în acest mod numele atribuite fiecărui dispozitiv. Ca de exemplu dacă aveți două adaptoare de rețea asociate cu două drivere diferite, dispozitivele eth0 și eth1 la care se referă pot să se schimbe între ele.
sv: &oldreleasename; har en mer robust mekanism för att identifiera hårdvara än tidigare utgåvor. Dock kan den här orsaka ändringar på den ordning som enheter identifieras på ditt system vilket påverkar ordningen i vilken enhetsnamnen tilldelas. Om du till exempel har två nätverkskort som associeras med två olika drivrutiner, kan de enheter som eth0 och eth1 refererar till ändras.

source: For network devices, this reordering is normally avoided by the definitions at <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> for <systemitem role="package">udev</systemitem>. Since these rules were already in place in &oldreleasename;, no additional action should be required when upgrading to &releasename; to get the benefit of stable network device names. Please note, however, that this udev mechanism means that a given network device name is tied to a particular piece of hardware; if you, for instance, exchange ethernet adapters in a deployed &releasename; system, the new adapter will get a new interface name instead of using the existing one. To reuse an existing device name for new hardware, you will need to delete the associated entry from <filename>/etc/udev/rules.d/70-persistent-net.rules</filename>.
fr: Pour les périphériques réseau, cette réorganisation est normalement évitée par l'utilisation de définitions dans le fichier <systemitem role="package">udev</systemitem> <filename>/etc/udev/rules.d/70-persistent-net.rules</filename>. Ces règles étaient déjà en place dans &Oldreleasename;, vous n'avez donc normalement rien besoin de faire lors de la mise à niveau vers &Releasename; pour avoir des noms de périphériques réseau stables. Notez cependant que le mécanisme udev de nommage est lié à un périphérique particulier, et que, par exemple, si vous changez la carte réseau sur un système &Releasename; en fonctionnement, cette carte se verra attribuer une nouvelle interface réseau au lieu d'utiliser l'existante. Afin d'utiliser le même nom pour de nouveaux matériels, vous devrez supprimer les entrées concernées dans <filename>/etc/udev/rules.d/70-persistent-net.rules</filename>.
it: Per i dispositivi di rete si può evitare questo riordino utilizzando le definizioni in <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> di <systemitem role="package">udev</systemitem>. Visto che queste regole erano già presenti in &oldreleasename;, non è necessario fare alcuna operazione per l'aggiornamento a &releasename; e beneficiare dei nomi persistenti per i dispositivi di rete. Si noti che questo meccanismo di udev comporta che il nome di un dispositivo di rete è associato a un particolare componente hardware; se, per esempio, si scambiano gli adattatori hardware su un sistema con &releasename;, il nuovo adattatore prenderà un nuovo nome per l'interfaccia anziché usare il nome esistente. Per riusare il nome del dispositivo esistente per il nuovo hardware è necessario cancellare l'associazione da <filename>/etc/udev/rules.d/70-persistent-net.rules</filename>.
ja: ネットワークデバイスについては、通常 <systemitem role="package">udev</systemitem> の <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> で定義することでこの並べ替えを回避します。このルールは &oldreleasename; で既に導入されているので、固定のネットワークデバイス名の恩恵を受けるために &releasename; へのアップグレードの際に追加の作業をする必要はありません。しかし、この udev の仕組みは、割り当てられたネットワークデバイス名が特定のハードウェアに紐付けられているということに注意してください。例えば、もしあなたが &releasename; を導入したシステムでイーサネットアダプタを交換した場合、新しいアダプタは既存の名前ではなく新しいインターフェイス名を使います。既存のデバイス名を新しいハードウェアで使う場合は、<filename>/etc/udev/rules.d/70-persistent-net.rules</filename> から関連するエントリを削除する必要があります。
pt: Para dispositivos de rede, esta reordenação é evitada normalmente pelas definições em <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> para o <systemitem role="package">udev</systemitem>. Como estas regras já estavam colocadas no lugar em &oldreleasename;, não deverá ser necessário nenhuma acção adicional quando se actualiza para &releasename; para obter o benefício dos nomes estáticos de dispositivos de rede. No entanto, por favor note que neste mecanismo udev significa que um determinado nome de dispositivo de rede está unido a uma determinada peça de hardware; se você , por exemplo, trocar os adaptadores ethernet num sistema &releasename; implantado, o novo adaptador irá obter um novo nome de interface em vez de usar o existente. Para reutilizar um nome de dispositivo existente para um novo hardware, você precisa de apagar a entrada associada de <filename>/etc/udev/rules.d/70-persistent-net.rules</filename>.
ro: Pentru dispozitivele de rețea, această reordonare este evitată în mod normal de definiții în <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> pentru <systemitem role="package">udev</systemitem>. Deoarece aceste reguli erau deja stabilite în &oldreleasename;, nu trebuie să luați măsuri suplimentare când actualizați la &releasename; pentru a beneficia de nume stabile pentru dispozitivele de rețea. Remarcați că, folosind mecanismul udev înseamnă că un nume de dispozitiv de rețea este legat de un anumit dispozitiv fizic; dacă, spre exemplu schimbați adaptorul de rețea într-un sistem &releasename; aflat în producție, noul adaptor va utiliza un nou nume de interfață în locul celui folosit de adaptorul precedent. Pentru a reutiliza nume existente pentru dispozitive fizice noi va trebui să ștergeți înregistrarea asociată numelui din fișierul <filename>/etc/udev/rules.d/70-persistent-net.rules</filename>.
sv: För nätverksenheter undviks denna omsortering vanligen genom definitioner i <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> i <systemitem role="package">udev</systemitem>. Eftersom dessa regler redan är på plats i &oldreleasename; behövs inga ytterligare ingrepp vid uppgradering till &releasename; för att dra nytta av stabila namn på nätverksenheter. Kom dock ihåg att udev-funktionen innebär att ett givet namn på en nätverksenhet binds till en specifik hårdvarukomponent. Om du exempelvis byter nätverkskort i ett system som kör &releasename; kommer det nya nätverkskortet få ett nytt gränssnittsnamn istället för att använda det redan existerande namnet. För att återanvända ett existerande enhetsnamn för ny hårdvara måste du ta bort den gamla bindingen från <filename>/etc/udev/rules.d/70-persistent-net.rules</filename>.
