Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: The precise downtime for these services will vary depending on the number of packages being upgraded in the system, and it also includes the time the system administrator answers the configuration questions from different package upgrades (if any). Notice that if the upgrade process is left unattended and the system requests input throughout the upgrade there is a high possibility of services being unavailable<footnote>
fr: Le temps d'arrêt de ces services va dépendre du nombre de paquets mis à niveau sur le système, en prenant en compte le temps mis par l'administrateur système pour répondre aux possibles questions de configuration posées lors de la mise à niveau. Veuillez noter que si le processus de mise à niveau est laissé sans surveillance et que le système demande une information à un moment de la mise à niveau, il y a de grandes chances que des services soient indisponibles ensuite<footnote>
it: La durata del disservizio varia a seconda del numero di pacchetti da aggiornare sul sistema e comprende anche il tempo che occorre all'amministratore di sistema per rispondere alle (eventuali) domande sulla configurazione poste dall'aggiornamento dei pacchetti. Notare che se l'aggiornamento non è presidiato e il sistema richiede una risposta per andare avanti è probabile che i servizi rimangano non disponibili<footnote>
ja: これらのサービスに対する実際のダウン期間は、システム中でアップグレードされるパッケージ数に応じて違いますし、このダウン期間には (もしあれば) 各パッケージのアップグレードに対する設定の質問にシステム管理者が答える時間も含まれます。アップグレード作業が放置されたままでいて、システムがアップグレード中に入力を必要とした場合、非常に長期間<footnote>
ro: Timpul precis de indisponibilitate a acestor servicii variază în funcție de numărul de pachete înnoite în sistem și include de asemenea timpul necesar administratorului de sistem să răspundă la întrebările de configurare ale diverselor pachete înnoite (dacă există). Țineți cont că în cazul în care procesul de înnoire se face nesupraveghat și sistemul solicită indicații pe parcursul actualizăriii, este foarte posibil ca serviciile să fie indisponibile<footnote>
sv: Exakt hur lång tid tjänsterna är bortkopplade varierar med antalet paket som uppgraderas i systemet. Dessutom ingår tiden som det tar för systemadministratören att besvara (eventuella) frågor om inställningar från olika paket som uppgraderas. Kom ihåg att om uppgraderingsprocessen lämnas oövervakad och systemet frågar efter information är det mycket troligt att tjänsterna är otillgängliga<footnote>

source: If the debconf priority is set to a very high level you might prevent configuration prompts, but services that rely on default answers that are not applicable to your system will fail to start.
fr: Si la priorité de debconf est configurée à un très haut niveau, certaines demandes de configuration seront passées sous silence, mais les services qui dépendent de réponses par défaut qui ne s'appliquent pas au système ne vont pas pouvoir démarrer.
it: Se la priorità di debconf è impostata ad un valore molto alto potrebbe bloccare i prompt di configurazione quindi i servizi che si basano su risposte predefinite che non sono appropriate per il proprio sistema non partiranno.
ja: debconf の優先度を、とても高いレベルに設定していると設定プロンプトを抑制できますが、デフォルト値があなたのシステムに合わない場合、サービスはそのままでは起動に失敗することでしょう。
pt: Se a prioridade de debconf estiver definida para um nível muito alto pode prevenir avisos de configuração, mas os serviços que se regem em respostas predefinidas que não estão aplicáveis no seu sistema irão falhar o arranque.
ro: Dacă prioritatea debconf este stabilită la un nivel foarte ridicat puteți preveni întrebările de configurare, dar serviciile care depind de opțiuni de configurare implicite ce nu se potrivesc sistemului dumneavoastră nu vor porni.
sv: Om debconf-prioriteringen är satt till en väldigt hög nivå kan du kanske undvika instälningsfrågor men tjänster som är beroende av standardsvar som inte fungerar för ditt system kommer inte att kunna starta.

source: </footnote> for a significant period of time.
fr: </footnote> pour un bon moment.
it: </footnote> per un periodo di tempo significativo.
ja: </footnote>サービスが利用できなくなる可能性が高いことにご注意ください。
pt: </footnote> por um período significativo de tempo.
ro: </footnote> pentru o perioadă însemnată de timp.
sv: </footnote> under en längre tidsperiod.

source: If the system being upgraded provides critical services for your users or the network<footnote>
fr: Si le système mis à niveau fournit des services critiques aux utilisateurs ou au réseau<footnote>
it: Se il sistema da aggiornare fornisce dei servizi critici agli utenti o per la rete<footnote>
ja: アップグレードされるシステムが、ユーザあるいはネットワークに対して非常に重要なサービスを提供している場合<footnote>
ro: Dacă sistemul actualizat oferă servicii critice utilizatorilor sau rețelei dumneavoastră<footnote>
sv: Om systemet som uppgraderas tillhandahåller viktiga tjänster för dina användare eller nätverket<footnote>

source: For example: DNS or DHCP services, specially when there is no redundancy or failover. In the DHCP case end-users might be disconnected from the network if the lease time is lower than the time it takes for the upgrade process to complete.
fr: Par exemple : services DNS ou DCHP, en particulier s'il n'y a pas de redondance ou de serveur de secours. Dans le cas de DHCP, l'utilisateur peut être déconnecté du réseau si le temps d'attribution de l'adresse est inférieur à celui mis par le processus de mise à niveau.
it: Per esempio i servizi DNS e DHCP, in modo particolare se non c'è ridondanza o failover. Nel caso del DHCP gli utenti finali potrebbero essere disconnessi dalla rete se il lease time è inferiore al tempo necessario per la conclusione dell'aggiornamento.
ja: 例: DNS や DHCP サービス、特に冗長性やフェイルオーバー機能が無い場合。DHCP の例では、リースタイムがアップグレード作業が完了する時間よりも短い場合、エンドユーザはネットワークから切り離されるでしょう。
ro: Spre exemplu: serviciile DNS sau DHCP, îndeosebi când nu există redundanță sau soluție de rezervă. În cazul DHCP utilizatorii pot fi deconectați de la rețea dacă timpul de deținere a adresei este mai mic decât timpul necesar procesului de înnoire.
sv: Exempelvis: DNS- eller DHCP-tjänster, speciellt om det inte finns någon redundans eller automatiskt byte av huvudtjänst. I fallet med DHCP kan slutanvändare bli nedkopplade från nätverket om lånperioden är kortare än tiden det tar för uppgraderingsprocessen att slutföra.

source: </footnote>, you can reduce the downtime if you do a minimal system upgrade, as described in <xref linkend="minimal-upgrade"/>, followed by a kernel upgrade and reboot (see <xref linkend="upgrading-udev"/>), and then upgrade the packages associated with your critical services. Upgrade these packages prior to doing the full upgrade described in <xref linkend="upgrading-full"/>. This way you can ensure that these critical services are running and available through the full upgrade process, and their downtime is reduced.
fr: </footnote>, vous pouvez réduire le temps d'arrêt en faisant une mise à niveau minimale du système (consultez <xref linkend="minimal-upgrade"/>), puis une mise à niveau du noyau et un redémarrage (consultez <xref linkend="upgrading-udev"/>), et ensuite une mise à niveau des paquets fournissant vos services critiques. Mettez-les à niveau avant de lancer la mise à niveau totale (<xref linkend="upgrading-full"/>) pour vous assurer que ces services critiques sont lancés et sont disponibles pendant la mise à niveau, et réduisez ainsi leur temps d'arrêt.
it: </footnote>, è possibile ridurre il tempo di disservizio facendo un aggiornamento minimo, come descritto in <xref linkend="minimal-upgrade"/>, seguito da un aggiornamento del kernel, un riavvio (vedere <xref linkend="upgrading-udev"/>) e poi l'aggiornamento dei pacchetti associati ai servizi critici. Fare l'aggiornamento di questi pacchetti prima di fare l'aggiornamento completo descritto in <xref linkend="upgrading-full"/>. Questo metodo assicura che i servizi critici restino in funzione mentre è in corso l'aggiornamento completo del sistema e che il periodo di disservizio sia breve.
ja: </footnote>、<xref linkend="minimal-upgrade"/> で記述しているように最小限のシステムアップグレードを行い、次にカーネルのアップグレードと再起動 (<xref linkend="upgrading-udev"/> 参照) をし、そしてもっとも重要なサービスに関連するパッケージをアップグレードすれば、ダウン期間を減らすことができます。
pt: </footnote>, você pode reduzir o tempo de desligado se fizer uma actualização mínima ao sistema, como descrito em as described in <xref linkend="minimal-upgrade"/>, seguido de uma actualização do kernel e um reiniciar do sistema (veja <xref linkend="upgrading-udev"/>), e depois actualizar os pacotes associados aos seus serviços críticos. Actualizar estes pacotes antes de fazer a actualização completa descrita em <xref linkend="upgrading-full"/>. Deste modo você assegura que estes serviços críticos estão a funcionar e disponíveis durante todo o processo de actualização, e o seu tempo de inactividade é reduzido.
ro: </footnote>, puteți reduce timpul de indisponibilitate dacă faceți o înnoire minimală, cum este descrisă în <xref linkend="minimal-upgrade"/>, urmată de o înnoire a nucleului și o repornire (citiți <xref linkend="upgrading-udev"/>), și apoi înnoiți pachetele asociate cu serviciile critice. Înnoiți aceste pachete înainte de înnoirea completă a sistemului, descrisă în <xref linkend="upgrading-full"/>. În acest fel puteți să vă asigurați că aceste servicii critice rulează și sunt disponibile pe durata întregului proces de înnoire și timpul cât sunt indisponibile este redus.
sv: </footnote>, kan du minimera nedtiden om du gör en minimal systemuppgradering vilket beskrivs i <xref linkend="minimal-upgrade"/>, följt av en kärnuppgradering och en omstart (läs <xref linkend="upgrading-udev"/>) och sedan uppgraderar paketen som hör till den viktiga tjänsten. Uppgradera dessa paket innan den kompletta uppgraderingen utförs enligt instruktionen i <xref linkend="upgrading-full"/>. På detta sätt kan du säkerställa att dessa viktiga tjänster körs och är tillgängliga genom hela den kompletta uppgraderingsprocessen och att nedtiden reduceras.

source: Prepare for recovery
fr: Soyez prêts à récupérer le système
it: Preparazione per il ripristino
ja: 復旧の準備
ml: തിരിച്ചെടുക്കാന്‍ തയ്യാറെടുക്കുക
pt: Preparar para recuperação
ro: Pregătiți recuperarea
sv: Förbered för återställning
zh_tw: 回復準備

source: Because of the many changes in the kernel between &oldreleasename; and &releasename; regarding drivers, hardware discovery and the naming and ordering of device files, there is a real risk that you may experience problems rebooting your system after the upgrade. A lot of known potential issues are documented in this and the next chapters of these Release Notes.
fr: En raison des nombreux changements dans le noyau entre &Oldreleasename; et &Releasename; en ce qui concerne les pilotes, la détection matérielle, le nommage et l'ordre des fichiers de périphérique, il existe un risque réel que vous rencontriez des problèmes lors du redémarrage du système après la mise à niveau. Un grand nombre des problèmes potentiels sont documentés dans les chapitres de ces notes de publication.
it: A causa dei numerosi cambiamenti nel kernel fra &oldreleasename; e &releasename; inerenti i driver, il rilevamento dell'hardware e la denominazione e l'ordinamento dei file device, c'è un rischio reale di avere dei problemi al momento di riavviare il proprio sistema dopo l'aggiornamento. Molti di questi potenziali problemi sono documentati in questo e nei prossimi capitoli delle presenti note di rilascio.
ja: ドライバやハードウェア検出、デバイスファイルの命名法や順序に関して &oldreleasename; と &releasename; との間ではカーネルに多くの変更が加えられたため、アップグレード後のシステム再起動で問題に直面するリスクが高くなっています。既知の潜在的な問題点の多くは、このリリースノートの本章と次章で述べられています。
ml: &oldreleasename; നും &releasename; യ്ക്കുമിടയില്‍ കെര്‍ണലില്‍ പ്രവര്‍ത്തകങ്ങള്‍, ഹാര്‍ഡ്‌വെയര്‍ കണ്ടെത്തല്‍, ഉപകരണ ഫയലുകളുടെ പേരും സ്ഥാനവും നിര്‍ണ്ണയിയ്ക്കുന്നതു് തുടങ്ങി വളരെയധികം മാറ്റങ്ങള്‍ വന്നതു് കൊണ്ടു് നവീകരണത്തിനു് ശേഷം നിങ്ങള്‍‌ക്കു് വീണ്ടും ബൂട്ട് ചെയ്യാന്‍ പറ്റാതാവാനുള്ള ശരിയ്ക്കുമൊരു അപകടമസാധ്യതയുണ്ടു്. ഈ പ്രസാധനക്കുറിപ്പുകളുടെ ഈ അദ്ധ്യായത്തിലും വരാനുള്ളവയിലും വളരെയധികം അറിയാവുന്ന പ്രശ്ന സാധ്യതകളെക്കുറിച്ചു് വിവരിച്ചിട്ടുണ്ടു്.
pt: Devido às muitas alterações no kernel entre &oldreleasename; e &releasename; no que diz respeito a drivers, descoberta de hardware e nomeação e ordenação de ficheiros de dispositivos, há um risco real que experimente problemas quando reiniciar o sistema depois da actualização. Muitos dos problemas potenciais conhecidos estão documentados neste e nos próximos capítulos destas Notas de Lançamento.
ro: Datorită multiplelor schimbări din nucleu între &oldreleasename; și &releasename;, în ceea ce privește modulele, detectarea, numirea componentelor și ordonarea fișierelor dispozitiv, există un risc real să întâmpinați probleme la reinițializarea sistemului, după actualizare. Multe dintre potențialele probleme cunoscute sunt documentate aici și în următorul capitol al Notelor de lansare.
sv: På grund av många ändringar i kärnan mellan &oldreleasename; och &releasename; gällande drivrutiner, identifiering av hårdvara, namnstandarden och ordning på enhetsfiler, finns det en risk att du kan uppleva problem vid omstart av ditt system efter uppgraderingen. En del kända tänkbara problem finns dokumenterade i det här och de nästkommande kapitlen av Kommentarer till utgåvan.
zh_tw: 由於 &oldreleasename; 和 &releasename; 間的 kernel 在像是驅動程式、硬體偵測、命名方式及裝置檔的順序上之變動太大了，在升級完成之後、重新啟動系統之時，您必須冒著可能會遭遇問題的風險。一些已知的可能問題記述於發行情報中的這個及下個章節。

source: For that reason it makes sense to ensure that you will be able to recover if your system should fail to reboot or, for remotely managed systems, fail to bring up networking.
fr: Pour cette raison, il est raisonnable de s'assurer que vous pourrez récupérer le système s'il ne redémarrait pas, ou, pour les systèmes gérés à distance, si la connexion au réseau échouait.
it: Pertanto è sensato assicurarsi di essere in grado di ripristinare il proprio sistema se questi non riesce a riavviarsi o, per sistemi gestiti da remoto, a tirare su la rete.
ja: 上述の理由により、システムが再起動に失敗したり、リモート管理されているシステムならネットワーク接続の確立に失敗した場合に備え、復旧できる手立てを整えておくことが大切です。
ml: ആ കാരണം കൊണ്ടു് തന്നെ നിങ്ങളുടെ സിസ്റ്റം വീണ്ടും ബൂട്ട് ചെയ്യുന്നതില്‍ പരാജയപ്പെടുകയോ വിദൂരത്തുള്ള സിസ്റ്റങ്ങളില്‍ ശൃംഖലാബന്ധം തുടങ്ങാന്‍ പരാജയപ്പെടുകയോ ചെയ്താല്‍ നിങ്ങളുടെ സിസ്റ്റം പഴയ അവസ്ഥയില്‍ കൊണ്ടു് വരാന്‍ സാധ്യമാണെന്നുറപ്പു് വരുത്തുന്നതു് നല്ലതാണു്.
pt: Por essa razão faz sentido assegurar que será capaz de recuperar o seu sistema se este não conseguir reiniciar ou, para sistemas geridos remotamente, não conseguir configurar a rede.
ro: Din acest motiv are sens să vă asigurați că veți putea să recuperați sistemul în eventualitatea că acesta nu va mai putea reporni sau, în cazul sistemelor la distanță, nu va putea să activeze conexiunile la rețea.
sv: Av den anledningen är det klokt att försäkra sig om att du kan återställa ifall ditt system skulle misslyckas att starta om eller, för fjärrhanterade system, misslyckas att komma åt nätverket.
zh_tw: 也因此，當您的系統可能會再也無法開機，或者是無法啟用網路（對於遠端管理系統而言）之時，確保您有辨法進行回復就變得很重要了。

source: If you are upgrading remotely via an <command>ssh</command> link it is highly recommended that you take the necessary precautions to be able to access the server through a remote serial terminal. There is a chance that, after upgrading the kernel and rebooting, some devices will be renamed (as described in <xref linkend="device-reorder"/> ) and you will have to fix the system configuration through a local console. Also, if the system is rebooted accidentally in the middle of an upgrade there is a chance you will need to recover using a local console.
fr: Si vous effectuez une mise à niveau à distance par un lien <command>ssh</command>, il est fortement recommandé de prendre toutes les précautions nécessaires pour pouvoir accéder au serveur par un terminal série distant. Il est possible qu'après la mise à niveau du noyau et le redémarrage, les noms de quelques périphériques soient changés (comme décrit en <xref linkend="device-reorder"/>) et vous devrez corriger la configuration du système depuis une console locale. Par ailleurs, si le système est redémarré accidentellement au milieu de la mise à niveau, il est possible que vous deviez utiliser une console locale pour réparer le système.
it: Se si sta aggiornando da remoto tramite una connessione <command>ssh</command> è fortemente raccomandato prendere tutte le precauzioni necessarie per essere in grado di accedere al server tramite un terminale seriale remoto. È possibile che, dopo l'aggiornamento del kernel e il riavvio del sistema, taluni device vengano rinominati come descritto in <xref linkend="device-reorder"/> e si debba sistemare la configurazione del sistema tramite una console locale. Analogamente, se il sistema viene accidentalmente riavviato nel mezzo di un aggiornamento è possibile che lo si debba ripristinare usando una console locale.
ja: <command>ssh</command> 接続経由でリモートからアップグレードを行うのなら、リモートのシリアル端末からサーバにアクセスできるよう、必要な事前準備をしておくことを強くお勧めします。カーネルをアップグレードして再起動した後、(<xref linkend="device-reorder"/> で述べるように) 一部のデバイス名が変更され、ローカルコンソール経由でシステム設定を修正しなければならないことがあります。また、アップグレード中に誤ってシステムが再起動された場合にも、ローカルコンソールを使って復旧する必要に迫られることがあります。
ml: നിങ്ങള്‍ ദൂരെയിരുന്നൊരു <command>ssh</command> ബന്ധത്തിലൂടെയാണു് നവീകരിയ്ക്കുന്നതെങ്കില്‍ വിദൂരമായ സീരിയല്‍ കണ്‍സോള്‍ വഴി സെര്‍വറിനെ സമീപിയ്ക്കാന്‍ സാധ്യമാകുന്ന തരത്തിലുള്ള എല്ലാ മുന്‍കരുതലുകളുമെടുക്കാന്‍ ശക്തമായി ശുപാര്‍ശ ചെയ്യുന്നു. കെര്‍ണല്‍ പുതുക്കി വീണ്ടും ബൂട്ട് ചെയ്യുമ്പോള്‍ ചില ഉപകരണങ്ങളുടെ പേരുകള്‍ മാറിയിരിയ്ക്കാന്‍ (<xref linkend="device-reorder"/> ല്‍ വിശദീകരിച്ചിരിയ്ക്കുന്നു) സാധ്യതയുള്ളതു് കൊണ്ടു് ഒരു പ്രദേശിക കണ്‍സോളിലൂടെ നിങ്ങളുടെ സിസ്റ്റം ക്രമീകരണം ശരിയാക്കേണ്ടി വരാം. നവീകരണത്തിനിടയില്‍ സിസ്റ്റം വീണ്ടും ബൂട്ടു് ചെയ്യുകയാണെങ്കില്‍ ഒരു പ്രാദേശിക കണ്‍സോളുപയോഗിച്ചു് വീണ്ടെടുക്കേണ്ടിയും വന്നേയ്ക്കാം.
pt: Se está a actualizar remotamente através de uma ligação <command>ssh</command> é altamente recomendado que tome as precauções necessárias para ser capaz de aceder ao servidor através de um terminal série remoto. Existe uma hipótese de que, após actualizar o kernel e reiniciar, alguns dispositivos sejam renomeados (conforme é descrito em <xref linkend="device-reorder"/>) e você terá de corrigir a configuração do sistema através duma consola local. Além disso, se o sistema for reiniciado acidentalmente a meio de uma actualização existe a hipótese de que você necessite de fazer a recuperação utilizando uma consola local.
ro: Dacă faceți actualizarea de la distanță printr-o conexiune <command>ssh</command> este recomandabil să luați măsurile necesare pentru a putea accesa serverul printr-un terminal serial. Există posibilitatea ca după actualizarea nucleului și repornirea sistemului, anumite dispozitive să fie redenumite (după cum este descris în <xref linkend="device-reorder"/>) și va trebui să reparați configurația sistemului printr-o consolă locală. De asemenea, dacă sistemul este repornit accidental în mijlocul actualizării există șansa să fie nevoie să recuperați folosind o consolă locală.
sv: Om du fjärruppgraderar via en <command>ssh</command>-länk är det starkt rekommenderat att du vidtar nödvändiga säkerhetsåtgärder för att kunna komma åt servern genom en fjärrserieterminal. Det finns en chans att, efter uppgradering av kärnan och omstart, vissa enheter kommer att få nya namn (som beskrivs i <xref linkend="device-reorder"/>) och du kommer att behöva rätta till systemkonfigurationen genom en lokal konsoll. Om systemet av misstag startas om mitt i en uppgradering finns det en chans att du behöver återställa systemet med hjälp av en lokal konsoll.
zh_tw: 如果您是藉由 <command>ssh</command> 連線來從遠端進行更新的話，在此非常建議您能採取必要的預防措施，讓您能有辨法經由遠端序列終端來存取伺服器。這是因為偶爾在升級 Kernel 並重新開機之後，有些裝置的名稱被改變了（如同 <xref linkend="device-reorder"/> 裡的說明），導致您得經由本機主控台才能修正系統的設定。同樣的，如果系統在升級途中意外得重新開機了，您將可能得由本機主控台才能進行修復。

source: The most obvious thing to try first is to reboot with your old kernel. However, for various reasons documented elsewhere in this document, this is not guaranteed to work.
fr: L'action la plus évidente à tenter est de redémarrer sur l'ancien noyau. Cependant, pour diverses raisons expliquées ailleurs dans ce document, il n'est pas sûr que cela fonctionne.
it: La cosa più ovvia da fare per prima è riavviare il sistema con il vecchio kernel. Tuttavia, per varie ragioni documentate altrove nel presente documento, non è sicuro che questo funzioni.
ja: 最初に試すべきもっとも明白なことは、古いカーネルでの再起動です。しかしながら、本文書の別の場所で述べられているいくつかの理由により、これがうまくいくという保証はありません。
ml: ആദ്യമായി ചെയ്യേണ്ടതു നിങ്ങളുടെ കമ്പ്യുട്ടറിലെ പഴയ കെര്‍ണല്‍ വച്ച് റീബൂട്ട് ചെയ്യുക എന്നതാണു് . എന്നാലും, ഈ വിവരണത്തില്‍ മറ്റു പലയിടത്തും പറഞ്ഞ കാരണങ്ങള്‍ കൊണ്ട്, ഇതു പ്രവര്‍ത്തിക്കുമെന്നു ഉറപ്പില്ല.
pt: A coisa mais óbvia a tentar primeiro é reiniciar com o antigo kernel. No entanto, devido a várias razões documentadas noutro sítio deste documento, não é garantido que funcione.
ro: Cel mai evident lucru care poate fi încercat este să reporniți cu vechiul nucleu. Totuși, din diverse motive documentate în altă parte a acestui document, nu este garantat că acest lucru va funcționa.
sv: Det självklara är att först försöka starta om med din gamla kärna. Av olika anledningar, dokumenterade på annan plats i det här dokumentet, är det inte garanterat att det fungerar.
zh_tw: 第一個最顯而易見的方法是試著用您舊的 Kernel 開機，儘管如此，由於在本文件其它地方所陳述的種種原因，這個方法無法保証一定有效。
