Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: en
fr: fr
it: it
ja: ja
ml: ml
pt: pt
ro: ro
sv: sv
zh_tw: zh_TW

source: Upgrades from Debian &oldrelease; (&oldreleasename;)
fr: Mises à niveau depuis Debian &oldrelease; (&Oldreleasename;)
it: Aggiornamenti da Debian &oldrelease; (&oldreleasename;)
ja: Debian &oldrelease; (&oldreleasename;) からのアップグレード
pt: Actualizações a partir de Debian &oldrelease; (&oldreleasename;)
ro: Actualizarea de la Debian &oldrelease; (&oldreleasename;)
sv: Uppgraderingar från Debian &oldrelease; (&oldreleasename;)

source: Preparing for the upgrade
fr: Actions nécessaires avant la mise à niveau
it: Preparazione all'aggiornamento
ja: アップグレードの準備
ml: നവീകരിക്കുന്നതിനു തയ്യാറെടുക്കുന്നു
pt: Preparar para a actualização
ro: Pregătirile pentru actualizare
sv: Förberedelse inför uppgraderingen
zh_tw: 系統升級之準備

source: We suggest that before upgrading you also read the information in <xref linkend="ch-information"/>. That chapter covers potential issues not directly related to the upgrade process but which could still be important to know about before you begin.
fr: Nous vous suggérons, avant la mise à niveau, de lire les informations du <xref linkend="ch-information"/>. Ce chapitre couvre des problèmes potentiels non liés directement au processus de mise à niveau, mais qu'il est important de connaître avant de commencer.
it: Prima di procedere all'aggiornamento si consiglia di leggere anche le informazioni contenute in <xref linkend="ch-information"/>, dove vengono trattati i potenziali problemi non direttamente collegati al processo di aggiornamento, ma che potrebbe essere comunque importante conoscere prima di iniziare.
ja: アップグレードの前には、<xref linkend="ch-information"/> に書かれている情報も読むことをお勧めします。この章に書かれている問題点は、アップグレードの過程と直接は関係がないかもしれませんが、それでもアップグレードを開始する前に知っておくべき重要事項である可能性があります。
ml: നവീകരിക്കുന്നതിനു മുമ്പായി ഇതു <xref linkend="ch-information"/> കൂടി വായിക്കാന്‍ താല്പര്യപ്പെടുന്നു.നവീകരിക്കല്‍ പ്രക്രിയയുമായി നേരിട്ടു ബന്ധമില്ലാത്ത ചില സുപ്രധാന പ്രശ്നങ്ങള്‍ ഈ അധ്യായത്തില്‍ പറഞ്ഞിട്ടുണ്ട്. പ്രക്രിയ തുടങ്ങുന്നതിനു മുമ്പ് ഇവ അറിഞ്ഞിരിക്കുന്നതു നന്നായിരിക്കും.
pt: Nós sugerimos que antes de actualizar também leia a informação em <xref linkend="ch-information"/>. Esse capítulo cobre potenciais problemas não directamente relacionados com o processo de actualização mas que podem no entanto ser importantes conhecer antes de começar.
ro: Vă sugerăm ca înainte de actualizare să citiți informațiile din <xref linkend="ch-information"/>. Acel capitol tratează probleme potențiale care nu sunt legate direct de procesul de actualizare, dar care ar putea fi important de știut înainte să începeți.
sv: Du bör läsa informationen i <xref linkend="ch-information"/> innan du uppgraderar. Det kapitlet täcker in möjliga problem som inte direkt relaterar till uppgraderingsprocessen men som fortfarande kan vara viktiga att känna till innan du påbörjar arbetet.

source: Back up any data or configuration information
fr: Sauvegarder toutes les données et informations de configuration
it: Salvare i dati e le informazioni di configurazione
ja: あらゆるデータや設定情報をバックアップする
ml: ഏതു് ഡാറ്റയുടേയും ക്രമീകരണ വിവരത്തിന്റേയും കരുതല്‍ പകര്‍പ്പെടുക്കുക
pt: Salvaguardar quaisquer dados ou informação de configuração
ro: Faceți copii de siguranță pentru orice date sau configurații
sv: Säkerhetskopiera all data och konfigurationsinformation
zh_tw: 備份資料及設定資訊

source: Before upgrading your system, it is strongly recommended that you make a full backup, or at least back up any data or configuration information you can't afford to lose. The upgrade tools and process are quite reliable, but a hardware failure in the middle of an upgrade could result in a severely damaged system.
fr: Avant de mettre à niveau le système, il est fortement conseillé de faire une sauvegarde complète ou, du moins, une sauvegarde des données et des informations de configuration que vous ne pouvez pas vous permettre de perdre. Les outils de mise à niveau sont tout à fait fiables, mais une panne matérielle au milieu de la mise à niveau peut fortement endommager le système.
it: Prima di aggiornare il proprio sistema si raccomanda di effettuare un salvataggio completo o quantomeno una copia di sicurezza di tutti quei dati e quelle informazioni di configurazione che non ci si può permettere di perdere. Gli strumenti e i processi di aggiornamento sono abbastanza affidabili, ma un problema dell'hardware durante l'aggiornamento potrebbe generare un sistema fortemente danneggiato.
ja: システムをアップグレードする前に、完全なバックアップを取っておくよう強くお勧めします。少なくとも、失いたくないデータや設定情報だけでもバックアップしておきましょう。アップグレードのツールや処理はきわめて信頼性の高いものですが、アップグレードの最中にハードウェア障害が起こると、システムに大きなダメージを与えることがありえます。
ml: നിങ്ങളുടെ സിസ്റ്റം നവീകരിയ്ക്കുന്നതിനു് മുമ്പു് നിങ്ങള്‍ ഒരു മുഴുവന്‍ കരുതല്‍ പകര്‍പ്പു് അല്ലെങ്കില്‍ ഒരു കാരണവശാലും നഷ്ടപ്പെടാന്‍ പറ്റാത്ത ഡാറ്റയുടേയോ ക്രമീകരണ വിവരത്തിന്റേയോ കരുതല്‍ പകര്‍പ്പു് എടുത്തിരിയ്ക്കണമെന്നു് ശുപാര്‍ശ ചെയ്തിരിയ്ക്കുന്നു. നവീകരിയ്ക്കാനുള്ള ഉപകരണങ്ങള്‍ വളരെ വിശ്വസ്ഥമാണു്, എങ്കിലും നവീകരണത്തിനിടയില്‍ ഒരു ഹാര്‍ഡ്‌വെയര്‍ തകരാറു് വന്നാല്‍ സിസ്റ്റം വളരെ ഗുരുതരമായി പരിക്കേറ്റ അവസ്ഥയില്‍ കിടന്നേയ്ക്കാം.
pt: Antes de actualizar o seu sistema é fortemente recomendado que efectue uma cópia de segurança total, ou que pelo menos salvaguarde quaisquer dados ou informações de configuração a que não se pode dar ao luxo de perder. As ferramentas de actualização e o processo são bastante fiáveis, mas uma falha de hardware durante a actualização poderia resultar num sistema extremamente danificado.
ro: Înainte de a vă actualiza sistemul, este indicat să faceți o copie de siguranță completă, sau cel puțin a datelor sau a configurațiilor pe care nu vă permiteți să le pierdeți. Uneltele și procesele de actualizare sunt foarte fiabile, însă o problemă hardware apărută în mijlocul actualizării poate afecta sever un sistem.
sv: Innan uppgradering av ditt system rekommenderas det starkt att du gör en fullständig säkerhetskopia, eller åtminstone en säkerhetskopia av data eller konfigurationsinformation som du inte vill riskera att förlora. Uppgraderingsverktygen och -processen är tillförlitlig men ett hårdvarufel mitt i en uppgradering kan resultera i ett allvarligt skadat system.
zh_tw: 在升級您的系統之前，我們強烈建議您能進行一次完整的備份，或至少您也應該把那些絕對不能出任何差錯的資料和設定資訊給備份起來。升級時所使用的工具和升級過程應該不會出什麼差錯，但在升級過程中若發生了什麼硬體錯誤可能會導致系統嚴重受損。

source: The main things you'll want to back up are the contents of <filename>/etc</filename>, <filename>/var/lib/dpkg</filename>, <filename>/var/lib/apt/extended_states</filename> and the output of <literal>dpkg --get-selections "*"</literal> (the quotes are important). If you use <command>aptitude</command> to manage packages on your system, you will also want to back up <filename>/var/lib/aptitude/pkgstates</filename>.
fr: Ce que vous devriez principalement sauvegarder est le contenu des répertoires <filename>/etc</filename> et <filename>/var/lib/dpkg</filename>, du fichier <filename>/var/lib/apt/extended_states</filename> et la sortie de <literal>dpkg --get-selections "*"</literal> (les guillemets sont importants). Si vous utilisez <command>aptitude</command> pour gérer les paquets du système, vous devriez aussi sauvegarder <filename>/var/lib/aptitude/pkgstates</filename>.
it: Le cose principali che si potrebbe considerare di salvare sono i contenuti di <filename>/etc</filename>, <filename>/var/lib/dpkg</filename>, <filename>/var/lib/apt/extended_states</filename> e l'output di <literal>dpkg --get-selections "*"</literal> (le virgolette sono importanti). Se si usa <command>aptitude</command> per gestire i pacchetti, si dovrebbe salvare anche <filename>/var/lib/aptitude/pkgstates</filename>.
ja: バックアップしておくべき主な対象として、<filename>/etc</filename>、<filename>/var/lib/dpkg</filename>、<filename>/var/lib/apt/extended_states</filename> の中身、<literal>dpkg --get-selections "*"</literal> (引用符を忘れてはいけません) の出力などがあります。システムの管理に <command>aptitude</command> を使っている場合は、<filename>/var/lib/aptitude/pkgstates</filename> もバックアップしておくと良いでしょう。
pt: A principal informação que quererá salvaguardar é o conteúdo de <filename>/etc</filename>, <filename>/var/lib/dpkg</filename>, <filename>/var/lib/apt/extended_states</filename> e o resultado de <literal>dpkg --get-selections "*"</literal> (as aspas são importantes). Se você usa o <command>aptitude</command> para gerir os pacotes no seu sistema, vai querer também salvaguardar <filename>/var/lib/aptitude/pkgstates</filename>.
ro: Cele mai importate lucruri de copiat sunt conținutul lui <filename>/etc</filename>, al lui <filename>/var/lib/dpkg</filename>, al lui <filename>/var/lib/apt/extended_states</filename> și rezultatul comenzii <literal>dpkg --get-selections "*"</literal> (ghilimelele sunt importante). Dacă folosiți <command> aptitude</command> pentru administrarea pachetelor pe sistemul dumneavoastră, va trebui să salvați și <filename>/var/lib/aptitude/pkgstates</filename>.
sv: De huvudsakliga delar du vill säkerhetskopiera är innehållet i <filename>/etc</filename>, <filename>/var/lib/dpkg</filename>, <filename>/var/lib/apt/extended_states</filename> och utdata från <literal>dpkg --get-selections "*"</literal> (citationstecknen är viktiga). Om du använder <command>aptitude</command> för att hantera paket på ditt system vill du också göra en säkerhetskopia på <filename>/var/lib/aptitude/pkgstates</filename>.

source: The upgrade process itself does not modify anything in the <filename>/home</filename> directory. However, some applications (e.g. parts of the Mozilla suite, and the GNOME and KDE desktop environments) are known to overwrite existing user settings with new defaults when a new version of the application is first started by a user. As a precaution, you may want to make a backup of the hidden files and directories (<quote>dotfiles</quote>) in users' home directories. This backup may help to restore or recreate the old settings. You may also want to inform users about this.
fr: Le processus de mise à niveau en lui-même ne modifie rien dans le répertoire <filename>/home</filename>. Cependant, certaines applications (par exemple, des parties de la suite Mozilla et les environnements de bureau GNOME et KDE) sont connues pour écraser des paramètres utilisateur existants avec de nouvelles valeurs par défaut quand une nouvelle version de l'application est lancée pour la première fois par un utilisateur. Comme précaution, vous pouvez faire une sauvegarde des fichiers et répertoires cachés (les <quote>dotfiles</quote>) dans les répertoires personnels des utilisateurs. Vous pouvez également informer les utilisateurs de ce problème.
it: Il processo di aggiornamento in quanto tale non modifica nulla nelle directory <filename>/home</filename>, tuttavia alcune applicazioni (come ad esempio alcune parti della suite Mozilla e gli ambienti desktop GNOME e KDE) sovrascrivono le impostazioni dell'utente preesistenti con i nuovi valori predefiniti quando un utente avvia per la prima volta la nuova versione dell'applicazione. Per precauzione si potrebbe quindi voler fare una copia di sicurezza dei file e delle directory nascosti (<quote>dotfile</quote>, cioè file i cui nomi iniziano con un punto) che si trovano nelle directory <quote>home</quote> degli utenti. Tale copia potrebbe aiutare a ripristinare o a ricreare le vecchie impostazioni. Potrebbe anche essere il caso di informare gli utenti su questo argomento.
ja: アップグレードの過程自体は、<filename>/home</filename> ディレクトリ以下は一切変更しません。とはいえ、(Mozilla スイートの一部や、GNOME・KDE といったデスクトップ環境のように) ユーザが初めて新しいバージョンのアプリケーションを起動するときに、既存のユーザ設定を新たなデフォルト値で上書きしてしまうものがあるのも事実です。万一に備えて、ユーザのホームディレクトリにある隠しファイルと隠しディレクトリ (いわゆる <quote>ドットファイル</quote>) をバックアップしておくのがよいでしょう。古い状態に戻したり、再度設定する場合に役立つはずです。ユーザにもこのことについて知らせておいてください。
ml: നവീകരണ പ്രക്രിയ സ്വന്തമായി <filename>/home</filename> തട്ടിലെ ഒന്നും മാറ്റുകയില്ല. എന്നാല്‍, ചില പ്രയോഗങ്ങള്‍ (ഉദാ. മോസില്ല സ്വീറ്റിലെ ഭാഗങ്ങള്‍, ഗ്നോം, കെഡിഇ പണിയിട പരിസരങ്ങള്‍) ഒരു ഉപയോക്താവു് ആദ്യമായി അവയുടെ പുതിയ പതിപ്പുകള്‍ തുടങ്ങുമ്പോള്‍ നിലവിലുള്ള ഉപയോക്താവിന്റെ സജ്ജീകരണങ്ങള്‍ മായ്ച്ചു് കളഞ്ഞു് പകരമായി പുതിയവയുടെ സഹജവിലകള്‍ എഴുതുന്നതായി കേട്ടിട്ടുണ്ടു്. ഒരു മുന്‍കരുതലായി ഉപയോക്താവിന്റെ ആസ്ഥാന തട്ടുകളിലെ ഒളിപ്പിച്ച ഫയലുകളുടേയും തട്ടുകളുടേയും (<quote>dotfiles</quote>) ഒരു കരുതല്‍ പകര്‍പ്പെടുത്തു് വച്ചേയ്ക്കൂ. ഈ കരുതല്‍ പകര്‍പ്പു് പഴയ സജ്ജീകരണങ്ങള്‍ തിരിച്ചു് വയ്ക്കാനോ പുനര്‍നിമ്മിയ്ക്കാനോ സഹായിച്ചേയ്ക്കാം. ഉപയോക്താക്കളെ ഇതിനെക്കുറിച്ചറിച്ചേയ്ക്കൂ.
pt: O processo de actualização em si não modifica nada no directório <filename>/home</filename>.No entanto, algumas aplicações (e.g. partes do conjunto Mozilla, e dos ambientes de desktop GNOME e KDE) são conhecidos por sobrescreverem configurações existentes dos utilizadores por novos valores predefinidos quando uma nova versão da aplicação é iniciada pela primeira vez por um utilizador. Como precaução, você pode querer fazer uma cópia de segurança dos ficheiros e directórios ocultos (<quote>dotfiles</quote>) nos directórios dos utilizadores. Esta cópia de segurança pode ajudar a restaurar ou recriar as antigas configurações. Pode também querer informar os utilizadores acerca disto.
ro: Procesul de actualizare, în sine, nu modifică nimic în directorul <filename>/home</filename>. Totuși, unele aplicații (cum ar fi unele componente ale suitei Mozilla, mediile grafice GNOME și KDE) sunt cunoscute pentru faptul că suprascriu valorile existente ale configurațiilor utilizatorilor cu noi valori implicite în momentul în care o versiune nouă a aplicației este pornită pentru prima oară de către utilizator. Ca măsură de precauție, veți dori probabil să faceți o copie de siguranță a fișierelor și directoarelor ascunse (care încep cu punct, „dotfiles”) din directoarele utilizatorilor. Copia ar putea să vă ajute să recreați vechile configurații. Probabil veți dori să informați și utilizatorii în legătură cu această problemă.
sv: Själva uppgraderingsprocessen ändrar ingenting i katalogen <filename>/home</filename>. Dock är det känt att vissa program (exempelvis delar av Mozilla-sviten och skrivbordsmiljöerna GNOME och KDE) skriver över befintliga användarinställningar med nya standardvärden när en ny version av programmet startas för första gången av en användare. Som en försiktighetsåtgård bör du göra en säkerhetskopia av de dolda filerna och katalogerna (så kallade <quote>punktfiler</quote>) i användarnas hemkataloger. Denna säkerhetskopia kan hjälpa till att återställa eller återskapa de gamla inställningarna. Du kanske även vill informera dina användare om det här.

source: Any package installation operation must be run with superuser privileges, so either log in as <literal>root</literal> or use <command>su</command> or <command>sudo</command> to gain the necessary access rights.
fr: Toutes les opérations d'installation de paquets doivent être exécutées avec les privilèges du superutilisateur, vous devez donc soit vous connecter en tant que <literal>root</literal>, soit utiliser <command>su</command> ou <command>sudo</command> pour obtenir les droits nécessaires.
it: Tutte le installazioni di pacchetti devono essere eseguite con i privilegi di superutente, per cui è necessario effettuare il login come utente <literal>root</literal>, oppure usare <command>su</command> o <command>sudo</command>, per ottenere i diritti d'accesso necessari.
ja: あらゆるパッケージのインストール処理はスーパーユーザ特権で実行されなければならないため、<literal>root</literal> としてログインするか <command>su</command> や <command>sudo</command> を使って、必要なアクセス権限を得てください。
ml: പൊതികള്‍ ഇന്‍സ്റ്റോള്‍ ചെയ്യാനുള്ള നടപടികളെല്ലാം സൂപ്പര്‍ഉപയോക്താവിന്റെ അനുമതികളോടെ പ്രവര്‍ത്തിപ്പിയ്ക്കേണ്ടതിനാല്‍ <literal>root</literal> ആയി അകത്തുകയറുകയോ ആവശ്യ‌‌മായി അനുമതികള്‍ കിട്ടാന്‍ <command>su</command> അല്ലെങ്കില്‍ <command>sudo</command> ആജ്ഞകള്‍ ഉപയോഗിയ്ക്കുകയോ ചെയ്യാം.
pt: Qualquer operação de instalação de um pacote tem que ser corrida com privilégios de super-utilizador, por isso ou inicie uma sessão como <literal>root</literal> ou utilize <command>su</command> ou <command>sudo</command> para obter os direitos de acesso necessários.
ro: Orice operație de instalare a pachetelor trebuie executată cu drepturi de superutilizator, deci fie vă autentificați ca <literal>root</literal>, fie utilizați <command>su</command> sau <command>sudo</command> pentru a obține drepturile de acces necesare.
sv: Alla paketinstallationsåtgärder måste köras med superanvändarens rättigheter, så logga in som root eller använd <command>su</command> eller <command>sudo</command> för att få de nödvändiga åtkomsträttigheterna.

source: The upgrade has a few preconditions; you should check them before actually executing the upgrade.
fr: Il existe quelques conditions préalables à la mise à niveau&nbsp;; vous devriez les vérifier avant d'effectuer réellement la mise à niveau.
it: L'aggiornamento ha alcune condizioni preliminari; prima di eseguirlo si dovrebbe verificarle.
ja: アップグレードにあたって事前に整えなければならない条件がいくつかあります。実際にアップグレードを実行する前にそれらを確認してください。
ml: നവീകരിക്കല്‍ പ്രക്രിയയ്ക്കു കുറച്ചു മുന്‍ ഉപാധികളുണ്ടു്.; നവീകരിക്കുന്നതിനു മുമ്പ് അവയെല്ലാം പരിശോധിക്കേണ്ടതാണു്.
pt: Esta actualização possui poucas condições prévias, deverá verificá-las antes de iniciar a actualização.
ro: Operația de actualizare trebuie să respecte câteva precondiții; va trebui să verificați dacă sunt respectate înainte de actualizare.
sv: Uppgraderingen innebär att vissa förutsättningar måste mötas; du bör kontrollera dem innan den faktiska uppgraderingen påbörjas.
zh_tw: 升級有其必要條件，您應該在實地進行升級之前先行確認一次。

source: Inform users in advance
fr: Informer les utilisateurs à l'avance
it: Informare gli utenti in anticipo
ja: 事前にユーザに通知する
ml: ഉപയോക്താക്കളെ മുന്‍കൂട്ടി അറിയിക്കുക
pt: Informar os utilizadores com antecedência
ro: Informați utilizatorii din timp
sv: Informera användarna i förväg
zh_tw: 事先知會使用者

source: It's wise to inform all users in advance of any upgrades you're planning, although users accessing your system via an <command>ssh</command> connection should notice little during the upgrade, and should be able to continue working.
fr: Il est sage d'informer à l'avance tous les utilisateurs que vous planifiez une mise à niveau, bien que les utilisateurs accédant au système par connexion <command>ssh</command> ne devraient pas remarquer grand chose durant la mise à niveau et devraient pouvoir continuer à travailler.
it: È saggio informare in anticipo tutti gli utenti di qualunque aggiornamento si stia pianificando, anche se gli utenti che accedono al sistema tramite una connessione <command>ssh</command> non dovrebbero notare granché durante l'aggiornamento e dovrebbero poter continuare a lavorare.
ja: アップグレードの前には、その予定をすべてのユーザに知らせるとよいでしょう。ただ、システムに <command>ssh</command> 接続などでアクセスしてきているユーザが、アップグレードの最中にそうと気付くことはほとんどないはずで、また、作業を続行できるはずです。
ml: <command>ssh</command> ബന്ധം വഴി നിങ്ങളുടെ സിസ്റ്റം ഉപയോഗിയ്ക്കുന്ന ഉപയോക്താക്കള്‍ക്കു് നവീകരണത്തിനിടയില്‍ അസാധാരണമായെന്തെങ്കിലും അറിയാതെ തുടര്‍ന്നു പ്രവര്‍ത്തിയ്ക്കാന്‍ സാധിയ്ക്കുമെങ്കിലും നിങ്ങള്‍ തയ്യാറെടുത്തുകൊണ്ടിരിയ്ക്കുന്ന നവീകരണത്തെക്കുറിച്ചു് നിങ്ങളുടെ ഉപയോക്താക്കളെ അറിയിയ്ക്കുന്നതു് ബുദ്ധിപരമാണു്.
pt: É sensato informar todos os utilizadores com antecedência sobre qualquer actualização que estiver a planear, apesar dos utilizadores que acedam ao sistema através uma ligação <command>ssh</command> pouco devem notar durante a actualização, e devem conseguir continuar a trabalhar.
ro: Este o idee bună să vă informați din timp toți utilizatorii despre actualizările planificate, chiar dacă utilizatorii ce vă accesează sistemul prin conexiuni <command>ssh</command> n-ar trebui să sesizeze prea multe în timpul actualizării și ar trebui să-și poată continua lucrul.
sv: Det är klokt att informera alla användare i förväg angående de uppgraderingar som du planerar att göra, även om användarna som kommer åt ditt system via en ssh-anslutning knappt kommer att märka det under uppgraderingen, och bör kunna fortsätta att arbeta som vanligt.
zh_tw: 您應該在進行任何升級之前先把您的計畫告知所有使用者，雖然一些像是利用 <command>ssh</command> 連線來從遠端存取系統的使用者在升級過程中可能不會發現什麼異狀，且他們的工作也應該不會因而中斷。如果您希望能採取額外的預防措施的話，請在升級前備份或卸載使用者的分割區 (<filename>/home</filename>)。除非您計劃同時進行 Kernel 的升級，否則您在升級前後通常並不需要重新開機。

source: If you wish to take extra precautions, back up or unmount the <filename>/home</filename> partition before upgrading.
fr: Si vous voulez prendre des précautions supplémentaires, sauvegardez ou démontez la partition <filename>/home</filename> avant la mise à niveau.
it: Se si desidera prendere delle precauzioni supplementari, si esegua un salvataggio delle partizioni degli utenti (<filename>/home</filename>) o le si smonti prima di aggiornare il sistema.
ja: 万一の対策をしたければ、アップグレードの前に <filename>/home</filename> パーティションをバックアップするか、アンマウントしてしまいましょう。
ml: ഇനിയും കൂടുതല്‍ മുന്‍കരുതലെടുക്കണമെന്നുണ്ടെങ്കില്‍ നവീകരണത്തിന് മുമ്പ് ഉപയോക്താക്കളുടെ ഭാഗങ്ങളുടെ (<filename>/home</filename>) കരുതല്‍ പകര്‍പ്പെടുക്കുകയോ അവ വേര്‍പ്പെടുത്തുകയോ ചെയ്യാം.
pt: Se quiser tomar precauções extra, faça uma cópia de segurança ou desmonte a partição <filename>/home</filename> antes de fazer a actualização.
ro: Dacă doriți să vă luați măsuri suplimentare de precauție, faceți o copie de siguranță sau demontați partiția <filename>/home</filename> înainte de actualizare.
sv: Om du vill vidta extra försiktighetsåtgärder bör du säkerhetskopiera eller avmontera <filename>/home</filename> före uppgradering.

source: You will have to do a kernel upgrade when upgrading to &releasename;, so a reboot will be necessary.
fr: Vous devrez probablement faire une mise à niveau du noyau lors de la mise à niveau vers &Releasename;, un redémarrage sera donc normalement nécessaire.
it: Con l'aggiornamento a &releasename; si dovrà anche fare un aggiornamento del kernel, per cui sarà necessario riavviare il sistema.
ja: &releasename; にアップグレードするときはおそらくカーネルをアップグレードしなければならないので、通常は再起動が必要です。
pt: Você terá de fazer uma actualização do kernel para &releasename;, por isso será necessário reiniciar a máquina.
ro: Va trebui sa faceți o înnoire de nucleu odată cu trecerea la &releasename;, deci o repornire va fi necesară.
sv: Du kommer behöva göra en kärnuppgradering vid uppgradering till &releasename;, så en omstart kommer att vara nödvändig.

source: Prepare for downtime on services
fr: Préparez-vous à un arrêt des services
it: Preparazione all'indisponibilità dei servizi
ja: サービスのダウン期間の準備
pt: Preparar para desligar temporariamente os serviços
ro: Pregătire pentru oprirea serviciilor
sv: Förbered för att tjänster blir oåtkomliga

source: There might be services that are offered by the system which are associated with packages that will be included in the upgrade. If this is the case, please note that, during the upgrade, these services will be stopped while their associated packages are being replaced and configured. During this time, these services will not be available.
fr: Certains services fournis par le système peuvent être associés à des paquets concernés par une mise à niveau. Dans ce cas, ces services seront interrompus lorsque les paquets correspondants seront remplacés et configurés. Pendant ce temps, ces services seront indisponibles.
it: Tra i pacchetti interessati all'aggiornamento ce ne potrebbero essere alcuni a cui sono associati dei servizi. In questo caso, tali servizi potrebbero essere fermati mentre è in corso l'aggiornamento, la sostituzione o la configurazione dei pacchetti. In questo periodo di tempo i servizi non saranno disponibili.
ja: システムが提供しているサービスで、アップグレードに含まれるパッケージが関連するサービスがあるかもしれません。この場合、注意して欲しいのですが、アップグレード作業中に関連パッケージが置換・設定される際、これらのサービスが停止します。この間、サービスは利用できなくなります。
ro: Pot exista servicii oferite de sistem, care sunt asociate cu pachete care vor fi incluse in actualizare. În acest caz țineți cont că aceste servicii vor fi oprite în timp ce pachetele asociate sunt înlocuite și configurate. În această perioadă, serviciile respective nu vor fi disponibile.
sv: Under uppgraderingsprocessen kan det finnas tjänster knutna till paket som ingår i uppgraderingen. Om detta är fallet kommer dessa tjänster stoppas under tiden som paketen byts ut och får nya inställningar. Under tiden kommer dessa tjänster inte vara tillgängliga.
