Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: If you have listed the <literal>proposed-updates</literal> section in your <filename>/etc/apt/sources.list</filename> file, you should remove it from that file before attempting to upgrade your system. This is a precaution to reduce the likelihood of conflicts.
fr: Si vous avez ajouté la section <literal>proposed-updates</literal> dans le fichier <filename>/etc/apt/sources.list</filename>, il est conseillé de la supprimer avant de tenter la mise à niveau. Il s'agit essentiellement d'une précaution pour éviter des conflits possibles.
it: Se la sezione <literal>proposed-updates</literal> è elencata nel proprio <filename>/etc/apt/sources.list</filename>, la si dovrebbe rimuovere da quel file prima di tentare l'aggiornamento del sistema. Questa precauzione serve per ridurre il rischio di conflitti.
ja: <filename>/etc/apt/sources.list</filename> ファイルに <literal>proposed-updates</literal> セクションを含めている場合は、システムのアップグレードを試みる前に、それらのセクションをファイルから削除してください。これは、衝突の可能性を減らすための予防策です。
ml: <literal>proposed-updates</literal> വിഭാഗം <filename>/etc/apt/sources.list</filename> ഫയലില്‍ നിങ്ങള്‍ ചേര്‍ത്തിട്ടുണ്ടെങ്കില്‍, നവീകരിയ്ക്കാന്‍ ശ്രമിയ്ക്കുന്നതിനു് മുമ്പു് നിങ്ങളതു് നീക്കം ചെയ്യണം. കൂട്ടിമുട്ടലിനുള്ള സാധ്യത തടയാനുള്ള മുന്‍കരുതലാണതു്.
pt: Se você listou a secção <literal>proposed-updates</literal> no seu ficheiro <filename>/etc/apt/sources.list</filename>, deverá removê-la desse ficheiro antes de tentar actualizar o seu sistema. Isto é uma precaução para reduzir a probabilidade de conflitos.
ro: Dacă aveți secțiunea <literal>proposed-updates</literal> enumerată în fișierul <filename>/etc/apt/sources.list</filename>, ar fi bine să o ștergeți înainte de a încerca să actualizați sistemul. Aceasta este o măsură de precauție pentru a reduce probabilitatea de apariție a unor conflicte.
sv: Om du har <literal>proposed-updates</literal> i din <filename>/etc/apt/sources.list</filename> ska du ta bort det innan du försöker uppdatera ditt system. Detta är en försiktighetsåtgärd för att minska risken att konflikter uppstår.

source: Unofficial sources and backports
fr: Sources non officielles et rétroportages
it: Fonti non ufficiali e backport
ja: 非公式なソースとバックポートパッケージ
ml: അനൌദ്യോഗിക ഉറവിടങ്ങളും ബാക്ക്പോര്‍ട്ടുകളും
pt: Fontes não oficiais e 'backports'
ro: Sursele neoficiale și backportări
sv: Inofficiella källor och bakåtporteringar
zh_tw: 非官方的來源及 backports

source: If you have any non-Debian packages on your system, you should be aware that these may be removed during the upgrade because of conflicting dependencies. If these packages were installed by adding an extra package archive in your <filename>/etc/apt/sources.list</filename>, you should check if that archive also offers packages compiled for &releasename; and change the source line accordingly at the same time as your source lines for Debian packages.
fr: Si des paquets non-Debian sont présents sur le système, vous devez savoir qu'ils peuvent être supprimés pendant la mise à niveau à cause de dépendances conflictuelles. Si ces paquets ont été installés par l'ajout d'une archive de paquets dans <filename>/etc/apt/sources.list</filename>, vous devez vérifier si cette archive propose également des paquets compilés pour &Releasename; et changer la ligne de source en conséquence en même temps que les lignes de source pour les paquets Debian.
it: Se si ha un qualsiasi pacchetto non-Debian nel proprio sistema, si presti attenzione al fatto che questi possono essere rimossi durante l'aggiornamento a causa di conflitti di dipendenze. Se questi pacchetti sono stati installati aggiungendo un archivio di pacchetti supplementare nel proprio <filename>/etch/apt/sources.list</filename>, si dovrebbe controllare che tale archivio offra anche pacchetti compilati per &releasename; e modificare di conseguenza la riga della fonte contemporaneamente alle righe delle fonti per i pacchetti Debian.
ja: システムに Debian 以外のパッケージがインストールされている場合、依存関係の衝突のためアップグレード中に削除されるかもしれないことに注意してください。当該パッケージが <filename>/etc/apt/sources.list</filename> に Debian 以外のパッケージアーカイブを追加することでインストールされたのなら、そのアーカイブが &releasename; 用にコンパイルされたパッケージも提供しているかをチェックし、Debian パッケージ用のソース行と一緒にそのソース行も適切に修正してください。
ml: നിങ്ങളുടെ സിസ്റ്റത്തില്‍ ഡെബിയനു് പുറമെ നിന്നുള്ള പൊതികളേതെങ്കിലുമുണ്ടെങ്കില്‍ ആശ്രയത്വങ്ങളുടെ കൂട്ടിമുട്ടലുകള്‍ മൂലം നവീകരണത്തിനിടയില്‍ ഇവ നീക്കം ചെയ്യപ്പെടാമെന്നു് മനസ്സിലാക്കിയിരിയ്ക്കണം. നിങ്ങളുടെ <filename>/etc/apt/sources.list</filename> ല്‍ അധികം വരികള്‍ ചേര്‍ത്താണു് നിങ്ങള്‍ ഇവ ഇന്‍സ്റ്റോള്‍ ചെയ്തതെങ്കില്‍ &releasename; യ്ക്കു് വേണ്ടി കമ്പൈല്‍ ചെയ്ത പൊതികളും ആ ശേഖരത്തിലുണ്ടെങ്കില്‍ ഡെബിയന്‍ പൊതികള്‍ക്കു് വേണ്ടി വരികള്‍ മാറ്റുന്ന സന്ദര്‍ഭത്തില്‍ അനുയോജ്യമായ മാറ്റങ്ങള്‍ ഇവയ്ക്കു് കൂടി നടത്തണം.
pt: Se possuir pacotes que não sejam da Debian no seu sistema, deverá saber que estes podem ser removidos durante a actualização, devido a conflitos entre dependências. Se estes pacotes foram instalados adicionando um arquivo de pacotes extra ao seu <filename>/etc/apt/sources.list</filename>, deverá verificar se aquele arquivo também oferece pacotes compilados para a &releasename; e altere a linha da fonte de acordo com o mesmo tipo de linhas de fontes para os pacotes Debian.
ro: Dacă aveți pachete non-Debian pe sistemul dumneavoastră, ar trebui să știți că acestea ar putea fi eliminate în cursul actualizării datorită dependențelor conflictuale. Dacă aceste pachete au fost instalate prin adăugarea unei arhive suplimentare în <filename>/etc/apt/sources.list</filename>, ar trebui să verificați dacă această arhivă oferă pachete compilate pentru &releasename; și să schimbați linia cu sursa corespunzătoare la același moment cu schimbarea surselor pentru pachetele Debian.
sv: Om du har några icke-Debianpaket på ditt system, bör du tänka på att dessa kan tas bort under uppgraderingen på grund av beroendekonflikter. Om dessa paket blev installerade genom att lägga till extra paketarkiv i din <filename>/etc/apt/sources.list</filename>, bör du kontrollera om det arkivet även erbjuder paket som är byggda för &releasename; och ändra källraden på lämpligt sätt samtidigt som dina källrader för Debian-paket.
zh_tw: 如果在您的系統裡安裝了不是由 Debian 所提供的套件，您必須要知道，在升級的過程中它們可能會因為相依性的關係而被移除掉。如果這些套件是先在 <filename>/etc/apt/sources.list</filename> 新增了額外的套件檔案庫然後再加以安裝的，您應該檢查一下那個檔案庫是否也提供了特別為 &releasename; 而編譯的套件，在替 Debian 變更套件來源時也同時適當得修改這些套件的來源項目。

source: Some users may have unofficial backported <quote>newer</quote> versions of packages that <emphasis>are</emphasis> in Debian installed on their &oldreleasename; system. Such packages are most likely to cause problems during an upgrade as they may result in file conflicts<footnote>
fr: Certains utilisateurs peuvent avoir installé sur leur système &Oldreleasename; des versions non officielles rétroportées de paquets plus récentes que celles qui <emphasis>sont</emphasis> dans Debian. De tels paquets sont les plus susceptibles de poser problème lors d'une mise à niveau car ils peuvent entraîner un conflit de fichiers<footnote>
it: Taluni utenti potrebbero aver installato nel proprio sistema versioni non ufficiali <quote>più recenti</quote> da backport rispetto ai pacchetti che <emphasis>sono</emphasis> in Debian &oldreleasename;. Tali pacchetti sono i candidati più probabili a causare problemi durante un aggiornamento, in quanto potrebbero generare conflitti fra file<footnote>
ja: 非公式にバックポートされた、Debian に<emphasis>存在する</emphasis>パッケージの <quote>新バージョン</quote> を &oldreleasename; システムにインストールしているユーザもいるかもしれません。そのようなパッケージはファイルが競合する可能性があるので、まず間違いなくアップグレード中に問題を起こします<footnote>
ml: ചില ഉപയോക്താക്കള്‍ അനൌദ്യോഗികമായി ബാക്ക്പോര്‍‌ട്ട് ചെയ്ത ഡെബിയനില്‍ <emphasis>ഉള്ള</emphasis> പൊതികളുടെ <quote>പുതിയ</quote> പതിപ്പുകള്‍ &oldreleasename; ല്‍ തന്നെ ഇന്‍സ്റ്റോള്‍ ചെയ്തിട്ടുണ്ടാകാം. അങ്ങനെയുള്ള പൊതികള്‍ നവീകരണത്തിനിടയില്‍ ഫയലുകള്‍ കൂട്ടിമുട്ടി പ്രശ്നമുണ്ടാക്കാന്‍ സാധ്യതയുണ്ടു്<footnote>
pt: Alguns utilizadores poderão ter versões <quote>mais recentes</quote> de pacotes que <emphasis>estão</emphasis> em Debian instalados no seu sistema &oldreleasename;. Tais pacotes irão provavelmente criar problemas durante a actualização, pois podem criar conflitos de ficheiros<footnote>
ro: Unii utilizatori ar putea avea instalate pe sistemele lor &oldreleasename; versiuni neoficiale <quote>mai noi</quote> a unor pachete care <emphasis>sunt</emphasis> în Debian. Aceste pachete pot cauza probleme în timpul unei actualizări deoarece pot rezulta în conflicte de fișiere<footnote>
sv: Vissa användare kan ha inofficiella bakåtporterade versioner av paket, som är <quote>nyare</quote> än de som finns i Debian, installerade på sina &oldreleasename;-system. Sådana paket kommer med stor sannolikhet att orsaka problem under en uppgradering eftersom de kan resultera i filkonflikter<footnote>

source: Debian's package management system normally does not allow a package to remove or replace a file owned by another package unless it has been defined to replace that package.
fr: Le système de gestion des paquets de Debian ne permet pas qu'un paquet supprime ou remplace un fichier appartenant à un autre paquet sauf si ce paquet est prévu pour remplacer cet autre paquet.
it: Normalmente il sistema di gestione di pacchetti di Debian non consente a un pacchetto di rimuovere o sostituire un file controllato da un altro pacchetto, a meno che non sia stato definito che il primo pacchetto sostituisce il secondo.
ja: Debian のパッケージ管理システムにおいて、別のパッケージを置き換えるように指定されていないパッケージは、通常、別のパッケージの所有ファイルを削除したり置き換えたりすることはできません。
ml: ഡെബിയനിലെ പൊതികളുടെ നടത്തിപ്പു് സാധാരണയായി ഒരു പൊതിയ്കു് പകരമാണെന്നു് പറയാത്ത സന്ദര്‍ഭങ്ങളില്‍ മറ്റേ പൊതിയുടെ ഫയലുകള്‍ മാറ്റാനോ നീക്കം ചെയ്യാനോ സമ്മതിയ്ക്കാറില്ല.
pt: O sistema de gestão de pacotes da Debian normalmente não permite que um pacote remova ou substitua um ficheiro pertencente a outro pacote, a não ser que tenha definido para substituir esse pacote.
ro: Sistemul de management al pachetelor din Debian nu permite, în mod normal, unui pachet să șteargă sau să înlocuiască un fișier deținut de alt pachet, decât dacă a fost definit ca înlocuitor pentru acel pachet.
sv: Debians pakethanteringssystem tillåter vanligtvis inte att ett paket tar bort eller ersätta en fil som ägs av ett annat paket såvida det inte har definierats att ersätta det paketet.
zh_tw: 因為 Debian 的套件管理程式不允許某一個套件移除或取代了屬於另一個套件的檔案，除非那一個套件本來就是用來取代這個套件的。

source: </footnote>. <xref linkend="trouble"/> has some information on how to deal with file conflicts if they should occur.
fr: </footnote>. <xref linkend="trouble"/> contient des informations sur la façon de gérer des conflits de fichiers s'ils se produisent.
it: </footnote>. Alcune informazioni sulla gestione di conflitti fra file che potrebbero verificarsi sono disponibili in <xref linkend="trouble"/>.
ja: </footnote>。ファイルの競合が発生した場合の対処方法については、<xref linkend="trouble"/>にいくつかの情報があります。
ml: </footnote>. കൂട്ടിമുട്ടലുകള്‍ ഉണ്ടാകുകയാണെങ്കില്‍ അവയെ എങ്ങനെ നേരിടാം എന്നു് <xref linkend="trouble"/> ല്‍ ചില വിവരങ്ങളുണ്ടു്.
pt: </footnote>. <xref linkend="trouble"/> tem alguma informação em como lidar com conflitos de ficheiros caso eles possam ocorrer.
ro: </footnote>. <xref linkend="trouble"/> are anumite informații despre cum să tratați conflictele de fișiere dacă apar.
sv: </footnote>. <xref linkend="trouble"/> innehåller information om hur man hanterar filkonflikter om de skulle inträffa.
zh_tw: </footnote>。在 <xref linkend="trouble"/> 有一些當發生了檔案衝突時該如何解決的資訊。

source: Preparing sources for APT
fr: Préparer les sources d'apt
it: Preparazione delle fonti per APT
ja: APT の取得先 (ソース) の準備
ml: ആപ്റ്റിനായി ഉറവിടങ്ങള്‍ തയ്യാറാക്കുന്നതു്
pt: Preparar as fontes para o APT
ro: Pregătirea surselor pentru APT
sv: Förbered källor för APT
zh_tw: APT 來源之準備工作

source: Before starting the upgrade you must set up <systemitem role="package">apt</systemitem>'s configuration file for package lists, <filename>/etc/apt/sources.list</filename>.
fr: Avant de commencer la mise à niveau, vous devez ajuster le fichier de configuration des listes de paquets d'<systemitem role="package">apt</systemitem>, <filename>/etc/apt/sources.list</filename>.
it: Prima di iniziare l'aggiornamento è necessario predisporre per le liste dei pacchetti il file di configurazione di <systemitem role="package">apt</systemitem>, <filename>/etc/apt/sources.list</filename>.
ja: アップグレードを始める前に、<systemitem role="package">apt</systemitem> の設定ファイル <filename>/etc/apt/sources.list</filename> を編集して、パッケージ一覧の取得先を設定する必要があります。
ml: നവീകരണം തുടങ്ങുന്നതിനു് മുമ്പു് നിങ്ങള്‍ പൊതികളുടെ പട്ടികയ്ക്കായുള്ള <systemitem role="package">apt</systemitem> ന്റെ ക്രമീകരണ ഫയലായ <filename>/etc/apt/sources.list</filename> സജ്ജീകരിച്ചിരിയ്ക്കണം.
pt: Antes de iniciar a actualização deverá configurar o ficheiro de configuração do <systemitem role="package">apt</systemitem> para listas de pacotes, o <filename>/etc/apt/sources.list</filename>.
ro: Înainte de a începe actualizarea trebuie să ajustați fișierul de configurare <systemitem role="package">apt</systemitem> pentru listele de pachete, <filename>/etc/apt/sources.list</filename>.
sv: Innan du påbörjar uppgraderingen måste du redigera konfigurationsfilen för paketlistor i <systemitem role="package">apt</systemitem>, <filename>/etc/apt/sources.list</filename>.
zh_tw: 在開始進行升級之前，您必須先在 <systemitem role="package">apt</systemitem> 的設定檔 <filename>/etc/apt/sources.list</filename> 中設定套件列表。

source: <systemitem role="package">apt</systemitem> will consider all packages that can be found via any <quote><literal>deb</literal></quote> line, and install the package with the highest version number, giving priority to the first line in the file (thus where you have multiple mirror locations, you'd typically first name a local hard disk, then <acronym>CD-ROM</acronym>s, and then HTTP/FTP mirrors).
fr: <systemitem role="package">apt</systemitem> prendra en compte tout paquet qui peut être trouvé par chacune des lignes <quote><literal>deb</literal></quote> et installera le paquet ayant le numéro de version le plus élevé, en donnant la priorité aux premières lignes mentionnées (ainsi, dans le cas de plusieurs miroirs, on indiquera d'abord un disque dur local, puis des <acronym>CD</acronym>, puis les miroirs FTP et HTTP).
it: <systemitem role="package">apt</systemitem> prenderà in considerazione tutti i pacchetti che possono essere trovati tramite le righe <quote><literal>deb</literal></quote> e installerà il pacchetto con il numero di versione più alto, dando la priorità alle righe menzionate per prime (in questo modo, nel caso in cui siano presenti varie fonti equivalenti, tipicamente si dovrebbe menzionare per primo un disco fisso locale, poi il CD-ROM e infine il mirror HTTP/FTP).
ja: <systemitem role="package">apt</systemitem> は、あらゆる <quote><literal>deb</literal></quote> 行を通して見つかったすべてのパッケージを見比べ、最も大きなバージョン番号のパッケージをインストールします。同じパッケージが取得可能な場合は、ファイルで最初に現れた行を優先します (したがって、複数のミラーを指定する場合は、最初にローカルのハードディスクを、次に <acronym>CD-ROM</acronym> を、最後に HTTP/FTP ミラーを指定するといいでしょう)。
ml: <systemitem role="package">apt</systemitem> ഏതു് <quote><literal>deb</literal></quote> വരിയുപയോഗിച്ചും കാണാവുന്ന എല്ലാ പൊതികളേയും കണക്കിലെടുക്കുകയും, ഫയലിലെ ആദ്യത്തെ വരിയ്ക്കു് മുന്‍ഗണന കൊടുത്തു് (അതുകൊണ്ടു് തന്നെ ഒന്നിലധികം മിററുകളുടെ സ്ഥാനമുണ്ടെങ്കില്‍ സാധാരണയായി നിങ്ങള്‍ ഒരു പ്രാദേശിക ഹാര്‍ഡ് ഡിസ്ക് ആദ്യവും, അതിനു ശേഷം <acronym>സിഡി-റോമുകളും</acronym>, പിന്നെ എച്ച്ടിടിപി/എഫ്‌ടിപി മിററുകളും കൊടുക്കും), ഏറ്റവും ഉയര്‍ന്ന പതിപ്പിന്റെ സംഖ്യയുള്ള പൊതി തെരഞ്ഞെടുക്കുകയും ചെയ്യും.
pt: O <systemitem role="package">apt</systemitem> irá considerar todos os pacotes que podem ser encontrados através de qualquer linha <quote><literal>deb</literal></quote>, e instalará o pacote com o número de versão mais elevado, dando prioridade às primeiras linhas no ficheiro (assim onde tiver múltiplas localizações de 'mirrors', tipicamente deverá ter primeiro um disco local, depois CD-ROMs e então 'mirrors' HTTP/FTP).
ro: <systemitem role="package">apt</systemitem> va lua în considerare toate pachetele care pot fi găsite prin intermediul unei linii <quote><literal>deb</literal></quote> și va instala pachetul cu cea mai mare versiune, stabilind prioritatea în funcție de poziția liniilor (astfel, în cazul mai multor locații ar trebui să listați în primul rând un harddisk local, după care <acronym>CD</acronym>-uri și după aceea situri-oglindă HTTP/FTP).
sv: <systemitem role="package">Apt</systemitem> kommer att överväga alla paket som kan hittas via någon <quote><literal>deb</literal></quote>-rad, och installera paketet med högsta versionsnumret, där prioritet ges till de förstnämnda raderna (om du nyttjar flera redundanta speglar, skulle du vanligtvis först namnge en lokal hårddisk, sedan cd-skivor, och sedan HTTP/FTP-speglar).

source: A release can often be referred to both by its codename (e.g. <literal>&oldreleasename;</literal>, <literal>&releasename;</literal>) and by its status name (i.e. <literal>oldstable</literal>, <literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal>). Referring to a release by its codename has the advantage that you will never be surprised by a new release and for this reason is the approach taken here. It does of course mean that you will have to watch out for release announcements yourself. If you use the status name instead, you will just see loads of updates for packages available as soon as a release has happened.
fr: Une version peut être référencée à la fois par son nom de code (par exemple, <literal>&oldreleasename;</literal>, <literal>&releasename;</literal>) et par son nom d'état (c'est-à-dire <emphasis>oldstable</emphasis>, <emphasis>stable</emphasis>, <emphasis>testing</emphasis>, <emphasis>unstable</emphasis>). Se référer à une version par son nom de code évite d'être surpris par une nouvelle version et c'est pour cette raison que cette approche a été choisie ici. Bien sûr, vous devez surveiller vous-même les annonces des nouvelles versions. Si vous utilisez les noms d'état, vous verrez simplement une grande quantité de mises à jour de paquets disponibles dès qu'une publication a eu lieu.
it: Si fa spesso riferimento a un rilascio sia tramite il suo nome in codice (ad esempio <literal>&oldreleasename;</literal>, <literal>&releasename;</literal>), sia tramite la denominazione del suo stato (cioè <literal>oldstable</literal>, <literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal>). Fare riferimento ad un rilascio attraverso il suo nome in codice presenta il vantaggio che non si sarà mai sorpresi da un nuovo rilascio, pertanto è il metodo qui adottato. Questo naturalmente significa che si dovrà prestare attenzione agli annunci di rilascio. Se invece si utilizza la denominazione dello stato, si vedrà una grande quantità di aggiornamenti disponibili per i propri pacchetti non appena avviene un rilascio.
ja: リリースを指定するのに、コードネーム (<literal>&oldreleasename;</literal> や <literal>&releasename;</literal>) と状態名 (<literal>oldstable</literal>、<literal>stable</literal>、<literal>testing</literal>、<literal>unstable</literal>) のどちらもよく使用されます。コードネームによる指定には、新しいリリースが出たときに驚かずに済むという利点があるため、ここではコードネームを使用しています。当然ですが、コードネームを使用している場合は自分でリリースアナウンスに注意を払わなければいけません。代わりに状態名を使用している場合は、リリースが行われた直後に、パッケージが大量に更新可能になったことに気づくでしょう。
ml: ഓരോ പ്രകാശനവും പലപ്പോഴും രണ്ടു വിധത്തില്‍ പരാമര്ശിക്കപ്പെടാറുണ്ട്. ഒന്ന്, അതിന്റെ രഹസ്യപ്പേര് ഉപയോഗിച്ചും (ഉദാ:<literal>&oldreleasename;</literal>, <literal>&releasename;</literal>)രണ്ട്: അതിന്റെ പദവി അനുസരിച്ചും (ഉദാ: (i.e. <literal>oldstable</literal>, <literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal>). രഹസ്യ‌‌നാമത്തിനാല്‍ പരാമര്ശിക്കപ്പെടുമ്പോള്‍ ഒരു പുതിയ പ്രകാശനം നിങ്ങളെ ഒരിക്കലും അത്ഭുതപ്പെടുത്തില്ല എന്ന മെച്ചമുണ്ട്. ഇക്കാരണത്താലാണ് ഇങ്ങനെ ഒരു നിലപാടെടുത്തത്. അതിന്റെ പ്രകാശന പ്രഖ്യാ‌‌പനത്തിനായി നിങ്ങള്‍ സ്വയം ശ്രദ്ധിച്ചിരിക്കണമെന്ന് അതിന് ഒരിക്കലും അര്‍ത്ഥമില്ല. പകരം പദവിയുടെ പേരാണ് ഉപയോഗിക്കുന്നതെങ്കില്‍ പ്രകാശനം നടന്ന ഉടനെത്തന്നെ പുതുക്കാനായി വണ്ടിക്കണക്കിന് പൊതികളുടെ ലഭ്യ‌‌ത കണ്ടെത്താനാവും.
pt: Um lançamento pode ser normalmente referido pelo seu nome de código (por ex. <literal>&oldreleasename;</literal>;, <literal>&releasename;</literal>) e pelo seu nome de estado (por ex. <literal>oldstable</literal>, <literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal>). Referir-se a um lançamento pelo seu nome de código tem a vantagem que que nunca será surpreendido por um novo lançamento e por esta razão é o método utilizado aqui. Significa com certeza que terá de ser você mesmo a estar atento a anúncios de lançamento. Se pelo contrário utilizar o nome de estado, irá ver carregamentos de actualizações para os pacotes disponíveis assim que acontecer um lançamento.
ro: O versiune poate fi referită deseori atât prin numele de cod (de ex: <literal>&oldreleasename;</literal>, <literal>&releasename;</literal>) cât și prin numele de stare (ex: <literal>oldstable</literal>, <literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal>). Referirea la o versiune folosind numele de cod are avantajul că nu veți avea surpriza unei noi versiuni, motiv pentru care am folosit această abordare aici. Evident, aceasta înseamnă că va trebui să urmăriți anunțurile de lansare. Dacă utilizați numele de stare, veți observa multe actualizări pentru pachete, disponibile imediat ce o versiune a fost lansată.
sv: En utgåva kan ofta refereras till både dess kodnamn (t.ex. <literal>&oldreleasename;</literal>, <literal>&releasename;</literal>) och efter dess statusnamn (alltså <literal>oldstable</literal>, <literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal>). Att referera till en utgåva efter dess kodnamn har fördelen att du aldrig blir överraskad av en ny utgåva och av den anledningen används den här metoden här. Det kan naturligtvis betyda att du själv måste hålla utkik efter nya utgåvor. Om du istället använder statusnamnet kommer systemet automatiskt att uppgraderas utan förvarning genom att uppdatera en mängd paket så snart en utgivning har skett.

source: Adding APT Internet sources
fr: Ajouter des sources Internet à apt
it: Aggiunta di fonti internet per APT
ja: APT のインターネットソースの追加
ml: അപ്റ്റ് ഇന്റര്‍നെറ്റ് ഉറവിടങ്ങള്‍ ചേര്‍ക്കുന്നതു്
pt: Acrescentar fontes APT da Internet
ro: Adăugarea de surse APT din Internet
sv: Lägg till APT-källor på Internet
zh_tw: 加入網際網路上的 APT 套件來源
