Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: Now you should have shell access as user <literal>root</literal> on your root file system mounted on <filename>/target</filename>. You need access to the contents of the <filename>/boot</filename>, <filename>/sbin</filename> and <filename>/usr</filename> directories on your hard disk, which should now be available under <filename>/target/boot</filename>, <filename>/target/sbin</filename> and <filename>/target/usr</filename>. If these directories need to be mounted from other partitions, do so (see <filename>/etc/fstab</filename> if you have no idea of which partition to mount).
fr: Vous devriez avoir maintenant une ligne de commande vous donnant un accès <literal>superutilisateur</literal> au système de fichiers racine, monté sur <filename>/target</filename>. Vous avez besoin d'accéder au contenu des répertoires <filename>/boot</filename>, <filename>/sbin</filename> et <filename>/usr</filename> du disque dur, qui devraient être disponibles sur <filename>/target/boot</filename>, <filename>/target/sbin</filename> et <filename>/target/usr</filename>. Si ces répertoires doivent être montés à partir d'autres partitions, faites-le. (Consultez <filename>/etc/fstab</filename> si vous n'avez aucune idée de la partition à monter).
it: Ora si dovrebbe avere l'accesso shell come utente <literal>root</literal> al proprio file system radice montato su <filename>/target</filename>. Sarà necessario poter accedere al contenuto delle directory <filename>/boot</filename>, <filename>/sbin</filename> e <filename>/usr</filename>, che dovrebbero essere disponibili sotto <filename>/target/boot</filename>, <filename>/target/sbin</filename> e <filename>/target/usr</filename>. Se queste directory devono essere montate da altre partizioni, lo si faccia (si veda <filename>/etc/fstab</filename> se non si ha idea di quali partizioni vanno montate).
ja: これで、<filename>/target</filename> にマウントされたルートファイルシステムに、ユーザ <literal>root</literal> としてシェルでアクセスすることが可能になるはずです。ハードディスクの <filename>/boot</filename> ディレクトリや <filename>/sbin</filename> ディレクトリ、<filename>/usr</filename> ディレクトリの内容にもアクセスできる必要があります。これらは、それぞれ <filename>/target/boot</filename> や <filename>/target/sbin</filename>、<filename>/target/usr</filename> でアクセス可能になっているはずですが、必要であれば、これらのディレクトリを他のパーティションからマウントしてください (どのパーティションをマウントすればよいか分からない場合は、<filename>/etc/fstab</filename> を参照してください)。
ml: ഇപ്പോള്‍ നിങ്ങള്ക്ക് ഒരു ഉപഭോക്താവായി <filename>/target</filename>ല്‍ കയറ്റിയ അടിസ്ഥാന ഫയല്‍വ്യവസ്ഥയെ സമീപിക്കാനാവും. ഖരഡിസ്കിലുള്ള <filename>/boot</filename>, <filename>/sbin</filename> ഉം, <filename>/usr</filename> തട്ടുകളും എന്നിവയുടെ ഉള്ളടക്കത്തിലേക്കാണ് നിങ്ങള്‍ക്ക് പ്രവേശിക്കേണ്ടത്. അവ ഇപ്പോള്‍ <filename>/target/boot</filename>, <filename>/target/sbin</filename> <filename>/target/usr</filename> എന്നിവയില്‍ ലഭ്യ‌‌മാവണം. ഈ തട്ടുകള്‍ മറ്റു വിഭാജനങ്ങളില്‍ കയറ്റണ്ട ആവശ്യ‌‌മുണ്ടെങ്കില്‍, അങ്ങനെ ചെയ്യാം.( എന്താണ് ചെയ്യേണ്ടതെന്ന് നിങ്ങള്‍ക്ക് അറിയില്ലെങ്കില്‍ ‍ <filename>/etc/fstab</filename> കാണുക).
pt: Agora deverá ter acesso à 'shell' como utilizador <literal>root</literal> no seu sistema de ficheiros raiz montado em <filename>/target</filename>. Você precisa aceder ao conteúdo dos directórios <filename>/boot</filename>, <filename>/sbin</filename> e <filename>/usr</filename> do seu disco, os quais deverão estar agora disponíveis em <filename>/target/boot</filename>, <filename>/target/sbin</filename> e <filename>/target/usr</filename>. Se estes directórios precisarem ser montados de outras partições, faça-o. (veja <filename>/etc/fstab</filename> se não tem ideia de qual partição montar).
ro: Acum ar trebui să aveți acces la shell cu numele de utilizator <literal>root</literal> pe sistemul de fișiere rădăcină montat în <filename>/</filename>. Aveți nevoie de acces la conținutul directoarelor <filename>/boot</filename>, <filename>/sbin</filename> și <filename>/usr</filename>, care acum ar trebui să se găsească în <filename>/target/boot</filename>, <filename>/target/sbin</filename> și <filename>/target/usr</filename>. Dacă aceste directoare trebuie să fie montate de pe alte partiții, montați-le (consultați <filename>/etc/fstab</filename> dacă nu știți care sunt partițiile corespunzătoare).
sv: Nu bör du ha skaltillgång som rotanvändaren på ditt rotfilsystem monterat på <filename>/target</filename>. Du behöver ha tillgång till innehållet i katalogerna <filename>/boot</filename>, <filename>/sbin</filename> och <filename>/usr</filename> på din hårddisk, dessa bör finnas i sökvägarna <filename>/target/boot</filename>, <filename>/target/sbin</filename> och <filename>/target/usr</filename>. Om dessa kataloger måste monteras från andra partitioner så ska du göra det först. (Konsultera <filename>/etc/fstab</filename> om du inte vet vilka partitioner som ska monteras.)

source: Jump to <xref linkend="avoid-problems-before-upgrading"/> and apply one of the two proposed procedures to fix the problem permanently. Then type <literal>exit</literal> to leave the rescue shell and select <literal>reboot</literal> for rebooting the system as usual (don't forget to remove the bootable media).
fr: Référez-vous à <xref linkend="avoid-problems-before-upgrading"/> et appliquez une des deux procédures proposées pour corriger le problème de manière permanente. Puis saisissez <literal>exit</literal> pour quitter le shell de secours et sélectionnez <literal>reboot</literal> pour redémarrer le système normalement. N'oubliez pas de retirer les supports amovibles.
it: Si vada a <xref linkend="avoid-problems-before-upgrading"/> e si applichi una delle due procedure proposte per risolvere il problema in modo definitivo. Poi si digiti <literal>exit</literal> per uscire dalla shell di ripristino e si selezioni <literal>reboot</literal> per riavviare il sistema come al solito (non ci si dimentichi di rimuovere il supporto di avvio).
ja: <xref linkend="avoid-problems-before-upgrading"/>に飛んで、提示されている 2 つの手順のうちいずれかを実行し、この問題を恒久的に解決します。その上で、<literal>exit</literal> と入力してレスキュー用のシェルから抜け出し、<literal>reboot</literal> を選択してシステムを通常どおり再起動します (起動可能なメディアを取り出すのを忘れないでください)。
ml: സ്ഥിരമയ ഒരു പ്രശ്ന പരിഹാരത്തിന് <xref linkend="avoid-problems-before-upgrading"/>ല്‍ എത്തി രണ്ടിലൊരു നിര്ദ്ദിഷ്ട മാര്ഗ്ഗം സ്വീകരിക്കാവുന്നതാണ്. <literal>exit</literal> എന്ന് അടിച്ചു ചേര്ത്ത് വീണ്ടെടുപ്പില്‍നിന്ന് പുറത്ത് കടന്നശേഷം സാധാരണപോലെ വീണ്ടും ബൂട്ട് ചെയ്യാന്‍ <literal>reboot</literal> തെരഞ്ഞെടുക്കുക.( ബൂട്ട് മാദ്ധ്യ‌‌മം നീക്കം ചെയ്യാന്‍ മറക്കണ്ട.)
pt: Vá até <xref linkend="avoid-problems-before-upgrading"/> e aplique um dos dois procedimentos propostos para resolver o problema permanentemente. Depois escreva <literal>exit</literal> para abandonar a 'shell' de recuperação e seleccione <literal>reboot</literal> para reiniciar o sistema normalmente (não se esqueça de remover a média de arranque).
ro: Accesați <xref linkend="avoid-problems-before-upgrading"/> și aplicați una din cele două proceduri propuse pentru a rezolva complet problema. Apoi tastați <literal>exit</literal> pentru a părăsi interpretorul de comenzi pentru recuperare și alegeți <literal>reboot</literal> pentru repornirea obișnuită a sistemului (a nu se uita înlăturarea mediilor pentru pornirea sistemului).
sv: Hoppa till <xref linkend="avoid-problems-before-upgrading"/> och genomför en av metoderna för att permanent laga felet. Ange sedan <literal>exit</literal> för att lämna återhämtningsskalet och välj <literal>omstart</literal> (<literal>reboot</literal> på engelska) för att starta om systemet som vanligt (glöm inte att avlägsna det startbara mediet).

source: Solution 3
it: Soluzione 3
ja: 解決方法 3
ml: പ്രതിവിധി 3
pt: Solução 3
ro: Soluția 3
sv: Lösning 3
zh_tw: 方案 3

source: Boot from your favorite LiveCD distribution, such as Debian Live, Knoppix, or Ubuntu Live.
fr: Démarrez depuis la distribution autonome (<quote>Live CD</quote>) préférée, par exemple Debian Live, Knoppix ou Ubuntu Live.
it: Si avvii mediante la propria distribuzione Live CD preferita, come ad esempio Debian Live, Knoppix o Ubuntu Live.
ja: お気に入りの LiveCD ディストリビューション (例えば Debian Live、Knoppix、Ubuntu Live など) から起動します。
ml: സജീവ ഡെബിയന്‍(Debiyan Live), നോപ്പിക്സ്, സജീവ ഉബുണ്ടു ഇവയില്‍ നിങ്ങളുടെ പ്രിയ വിതരണ സജീവ സിഡി വഴി ബൂട്ട് ചെയ്യുക.
pt: Arranque pela sua distribuição LiveCD favorita, como a Debian Live, Knoppix, ou Ubuntu Live.
ro: Porniți sistemul cu distribuția de LiveCD preferată, ca, de exemplu, Debian Live, Knoppix sau Ubuntu Live.
sv: Starta systemet från en cd-skiva med ett körbart system, exempelvis Debian Live, Knoppix eller Ubuntu Live.

source: Mount the partition where your <filename>/boot</filename> directory is. If you don't know which one it is, use the output of the command <command>dmesg</command> to find whether your disk is known as <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> or <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>. Once you know which disk to work on, for example <literal>sdb</literal>, issue the following command to see the partition table of the disk and to find the right partition: <command>fdisk -l /dev/sdb</command>
fr: Montez la partition où se trouve le répertoire <filename>/boot</filename>. Si vous ne la connaissez pas, utilisez le résultat de la commande <command>dmesg</command> pour savoir si le disque est vu comme <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> ou <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>. Une fois le disque déterminé, par exemple <literal>sdb</literal>, utilisez la commande suivante pour obtenir la table des partitions du disque et trouver la bonne partition : <command>fdisk -l /dev/sdb</command>.
it: Si monti la partizione in cui si trova la propria directory <filename>/boot</filename>. Se non si sa quale sia, si usi l'output del comando <command>dmesg</command> per vedere se il proprio disco è conosciuto come <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> o <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>. Dopo aver trovato qual è il disco su cui si deve lavorare, per esempio <literal>sdb</literal>, eseguire il comando seguente per visualizzare la tabella delle partizioni del disco e trovare la partizione giusta: <command>fdisk -l /dev/sdb</command>.
ja: <filename>/boot</filename> ディレクトリが置かれているパーティションをマウントします。どのパーティションに <filename>/boot</filename> ディレクトリがあるか分からない場合は、<command>dmesg</command> コマンドの出力を用いて、ディスクが <literal>hda</literal>、<literal>hdb</literal>、<literal>hdc</literal>、<literal>hdd</literal>、<literal>sda</literal>、<literal>sdb</literal>、<literal>sdc</literal>、<literal>sdd</literal> のいずれであるか調べてください。どのディスクを調べればよいか分かったら、次のコマンド (ディスクが <literal>sdb</literal> である場合の例) を発行してそのディスクのパーティションテーブルを表示し、適切なパーティションを見つけてください: <command>fdisk -l /dev/sdb</command>
ml: നിങ്ങളുടെ <filename>/boot</filename>തട്ട് കിടക്കുന്ന വിഭാജനം കയറ്റുക. ഇത് ഏതാണെന്ന് നിങ്ങള്‍ക്ക് അറിയില്ലെങ്കില്‍ <command>dmesg</command>ആജ്ഞയുടെ ഉത്പന്നം പരിശോധിച്ച് നിങ്ങളുടെ ഡിസ്ക് <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> എന്നാണോ, അതോ <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal> എന്നാണോ അറിയപ്പെടുന്നത് എന്ന് കണ്ടെത്തുക. ഏതു ഡിസ്കിലാണ് ജോലി എന്ന് ഒരിക്കല്‍ മനസ്സിലാക്കി കഴിഞ്ഞാല്‍ ഉദാഹരണത്തിന്, <literal>sdb</literal>,ഡിസ്കിന്റെ വിഭാജന പട്ടികയും ശരിയായ വിഭാജനവും കണ്ടെത്താന്‍ താഴെ കൊടുത്ത ആജ്ഞ നടപ്പിലാക്കുക: <command>fdisk -l /dev/sdb</command>
pt: Monte a partição onde o seu directório <filename>/boot</filename> está. Se não sabe qual deles é, use a saída do comando <command>dmesg</command> para descobrir se o seu disco é conhecido como <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> ou <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>. Assim que souber em que disco deverá trabalhar, por exemplo <literal>sdb</literal>, emita o seguinte comando para ver a tabela de partições do disco e para encontrar a partição correcta: <command>fdisk -l /dev/sdb</command>
ro: Montați partiția ce conține directorul <filename>/boot</filename>. Dacă nu știți care este partiția, vedeți rezultatul rulării comenzii <command>dmesg</command> pentru a afla dacă discul dumneavoastră este văzut drept <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> sau <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>. După ce ați aflat care este discul potrivit, de exemplu <literal>sdb</literal>, rulați următoarea comandă pentru a vedea tabela de partiții a discului și pentru a găsi partiția corectă: <command>fdisk -l /dev/sdb</command>
sv: Montera partitionen där katalogen <filename>/boot</filename> finns. Om du inte vet vilken det är kan du använda kommandot <command>dmesg</command> för att se om din disk kallas <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> eller <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>. När du har kommit fram till vilken disk du ska använda, exempelvis <literal>sdb</literal>, kör följande kommando för att visa partitionstabellen och hitta rätt partition: <command>fdisk -l /dev/sdb</command>

source: Assuming that you have mounted the right partition under <filename>/mnt</filename> and that this partition contains the <filename>/boot</filename> directory and its content, edit the <filename>/mnt/boot/grub/menu.lst</filename> file.
fr: En supposant que la bonne partition est montée sous <filename>/mnt</filename> et que cette partition contient le répertoire <filename>/boot</filename> ainsi que son contenu, éditez le fichier <filename>/mnt/boot/grub/menu.lst</filename>.
it: Presumendo che si sia montata la partizione corretta in <filename>/mnt</filename> e che la partizione contenga la directory <filename>/boot</filename> e il suo contenuto, si modifichi il file <filename>/mnt/boot/grub/menu.lst</filename>.
ja: <filename>/mnt/boot/grub/menu.lst</filename> ファイルを編集します。ただし、適切なパーティションを <filename>/mnt</filename> にマウントしており、このパーティションが <filename>/boot</filename> ディレクトリやその内容を含んでいるとします。
ml: നിങ്ങള്‍ ശരിയായ വിഭാജനം <filename>/mnt</filename>ല്‍ കയറ്റിയിട്ടുണ്ടെന്നും ഈ വിഭാജനത്തില്‍ <filename>/boot</filename>തട്ട് ഉള്‍‌‍പ്പെടുനുണ്ടെന്നും അനുമാനിച്ചാല്‍ <filename>/mnt/boot/grub/menu.lst</filename>ഫയലില്‍ തിരുത്തുകള്‍ വരുത്താം.
pt: Assumindo que montou a partição correcta em <filename>/mnt</filename> e esta partição contém o directório <filename>/boot</filename> no seu conteúdo, edite o ficheiro <filename>/mnt/boot/grub/menu.lst</filename>.
ro: Dacă ați montat partiția corectă în <filename>/mnt</filename> și acea partiție conține directorul <filename>/boot</filename> și conținutul său, atunci editați fișierul <filename>/mnt/boot/grub/menu.lst</filename>.
sv: Så länge du har monterat rätt partition i <filename>/mnt</filename> och att den partitionen innehåller katalogen <filename>/boot</filename> med rätt innehåll så ska du redigera filen <filename>/mnt/boot/grub/menu.lst</filename>.
zh_tw: 在此假設您已將正確的分割區掛載在 <filename>/mnt</filename> 下，且這個分割區也包含了 <filename>/boot</filename> 目錄及裡面的所有東西，然後修改 <filename>/mnt/boot/grub/menu.lst</filename> 檔案，

source: Find the section similar to:
fr: Repérez la section similaire à :
it: Si trovi la sezione simile a:
ja: 次のようなセクションを見つけます:
ml: ഇതുപോലൊരു ഭാഗം കണ്ടെത്തുക:
pt: Encontre a secção semelhante a:
ro: Găsiți secțiunea similară cu:
sv: Hitta avsnittet som liknar följande:
zh_tw: 找到類似的段落如下：

source: and replace every <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> with <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>, as appropriate. Don't modify the line similar to:
fr: et remplacez respectivement chaque <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> par <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>. Ne modifiez pas la ligne similaire à :
it: e si sostituisca ogni <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> rispettivamente con <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>. Non si modifichi la riga simile a:
ja: <literal>hda</literal>、<literal>hdb</literal>、<literal>hdc</literal>、<literal>hdd</literal> をそれぞれ、<literal>sda</literal>、<literal>sdb</literal>、<literal>sdc</literal>、<literal>sdd</literal> に置換します。次のような行は変更しないでください:
ml: എന്നിട്ട് <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal>എന്നിവ യഥാക്രമം <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal> എന്നാക്കി മാറ്റുക. വരികള്‍ ഇങ്ങനെ പരിഷ്കരിക്കരുത്:
pt: e substitua todos os <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> por <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>, como apropriado. Não modifique a linha semelhante a:
ro: și înlocuiți fiecare <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> cu <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, respectiv <literal>sdd</literal>, după caz. Nu modificați rândurile similare cu:
sv: och ersätt alla <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal> och <literal>hdd</literal> med <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal> respektive <literal>sdd</literal>. Ersätt inte rader som liknar:

source: Reboot the system, remove the LiveCD and your system should boot correctly.
fr: Redémarrez le système, retirez le CD autonome et le système devrait démarrer correctement.
it: Si riavvii il sistema, si rimuova il LiveCD e il proprio sistema dovrebbe avviarsi correttamente.
ja: システムを再起動し、LiveCD を取り出します。これでシステムは適切に起動するはずです。
ml: വീണ്ടും ബൂട്ട് ചെയ്യുക, സജീവ സിഡി എടുത്തു മാറ്റുക നിങ്ങളുടെ വ്യ‌‌വസ്ഥിതി ശരിയായി ബൂട്ട് ചെയ്യും.
pt: Reinicie o sistema, remova o LiveCD e o seu sistema deverá arrancar correctamente.
ro: Reporniți sistemul, scoateți LiveCD-ul și sistemul dumneavoastră ar trebui să pornească corect.
sv: Starta om systemet, ta ut den körbara cd-skivan så startar ditt system som det ska.
zh_tw: 將系統重新開機，移除 LiveCD 然後您的系統應該能正常開機了。

source: When it has booted, apply one of the two proposed procedures under <xref linkend="avoid-problems-before-upgrading"/> to fix the problem permanently.
fr: Maintenant que le système a démarré, il vous faut régler le problème définitivement. Référez-vous à <xref linkend="avoid-problems-before-upgrading"/> et appliquez une des deux procédures proposées.
it: Dopo il riavvio, si applichi una delle due procedure proposte in <xref linkend="avoid-problems-before-upgrading"/> per risolvere il problema in modo definitivo.
ja: システムが起動したら、<xref linkend="avoid-problems-before-upgrading"/>で提示されている 2 つの手順のうちいずれかを実行して、この問題を恒久的に解決します。
ml: ബൂട്ട് ചെയ്തു കഴിഞ്ഞാല്‍, സ്ഥിരമായ പ്രശ്നപരിഹാരത്തിന് <xref linkend="avoid-problems-before-upgrading"/>ലെ രണ്ടു നിര്‍ദ്ദിഷ്ട പോംവഴികളിലൊന്ന് പ്രയോഗിക്കാം.
pt: Quando o arranque estiver concluído, aplique um dos dois procedimentos propostos em <xref linkend="avoid-problems-before-upgrading"/> para resolver o problema permanentemente.
ro: După ce sistemul e pornit, aplicați una din cele două proceduri propuse la <xref linkend="avoid-problems-before-upgrading"/> pentru a rezolva complet problema.
sv: När systemet har startat genomför du en av metodena som beskrivs i <xref linkend="avoid-problems-before-upgrading"/> för att laga felet permanent.
zh_tw: 在關機後，請採取在 <xref linkend="avoid-problems-before-upgrading"/> 中那 2 種解決方案之一來手動修正這些問題。

source: Preparing for the next release
fr: Préparations pour la prochaine version
it: Preparazione per il prossimo rilascio
ja: 次期リリースへの準備
ml: അടുത്ത പ്രകാശനത്തിനുള്ള ഒരുക്കങ്ങള്‍
pt: Preparar para o próximo lançamento
ro: Pregătirile pentru următoarea versiune
sv: Förberedelse inför nästa utgåva
zh_tw: 替下一個釋出版本進行準備

source: After the upgrade there are several things you can do to prepare for the next release.
fr: Après la mise à niveau, il y a plusieurs choses que vous pouvez faire pour préparer la prochaine version.
it: Dopo l'aggiornamento ci sono molte cose che si possono fare per prepararsi per il prossimo rilascio.
ja: アップグレードの後で、次期リリースに向けてできるいくつかの準備があります。
ml: നവീകരണത്തിന് ശേഷം അടുത്ത പ്രസാധനത്തിനുള്ള തയ്യാറെടുപ്പിനായി നിങ്ങള്ക്ക് ഒട്ടനവധി കാര്യ‌‌ങ്ങള്‍ ചെയ്യാനാവും.
pt: Após a actualização existem várias coisas que você pode fazer para se preparar para o próximo lançamento.
ro: După actualizare sunt mai multe lucruri pe care le puteți face pentru a pregăti următoarea lansare.
sv: Efter uppgraderingen finns det flera saker som du kan göra för att förbereda inför nästa utgåva.
zh_tw: 在更新完畢之後，您可以進行某些工作來替下一個釋出版本進行準備：

source: Remove obsolete and unused packages as described in <xref linkend="obsolete"/>. You should review which configuration files they use and consider purging the packages to remove their configuration files.
fr: Supprimez tous les paquets obsolètes et non utilisés comme décrit en <xref linkend="obsolete"/>. Vous devriez contrôler les fichiers de configuration qu'ils utilisent et envisager de purger les paquets pour supprimer leurs fichiers de configuration.
it: Si rimuovano i pacchetti obsoleti e quelli non utilizzati come descritto in <xref linkend="obsolete"/>. Si dovrebbe controllare quali file di configurazione questi usano e considerare di effettuare una rimozione completa per eliminarli.
ja: <xref linkend="obsolete"/> で説明するように、時代遅れ (obsolete) のパッケージや、使用していないパッケージを削除してください。それらのパッケージが使用する設定ファイルを確認し、パッケージの完全削除 (purge) によって、設定ファイルも含めて削除することを検討してください。
ml: കാലഹരണപ്പെട്ടതും ഉപയോഗശൂന്യ‌‌വുമായ പൊതികള്‍ <xref linkend="obsolete"/>ല്‍ പറഞ്ഞ പ്രകാരം നീക്കം ചെയ്യണം. അവ ഏതു ക്രമീകരണ ഫയലുകളാണ് ഉപയോഗപ്പെടുത്തുന്നത് എന്ന് പുനപരിശോധിച്ച് ക്രമീകരണ ഫയലുകള്‍ നീക്കം ചെയ്യാന്‍ പൊതികള്‍ ഒഴിവാക്കല്‍ പരിഗണിക്കാം.
pt: Remova os pacotes obsoletos e não utilizados conforme é descrito em <xref linkend="obsolete"/>. Você deve rever que ficheiros de configuração eles utilizam e considerar purgar os pacotes para remover os seus ficheiros de configuração.
ro: Îndepărtați pachetele depășite nefolosite după cum este descris în <xref linkend="obsolete"/>. Ar trebui să verificați ce fișiere de configurare folosesc acestea și să luați în considerare eliminarea pachetelor pentru a îndepărta fișierele de configurare.
sv: Ta bort föråldrade och oanvända paket som beskrivs i <xref linkend="obsolete"/>. Du bör granska vilka konfigurationsfiler som de använder och överväga att avinstallera paketen fullständigt för att ta bort deras konfigurationsfiler.

source: Upgrade to GRUB 2
fr: Mise à niveau vers GRUB 2
it: Aggiornamento a GRUB 2
ja: GRUB 2 へアップグレードする
pt: Actualização para GRUB 2
ro: Actualizare la GRUB 2
sv: Uppgradera till GRUB 2
