Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: During the upgrade process, there might be services associated with packages that will be include in the upgrade. If this is the case, these services might be stopped while the packages that are going to be upgraded are being replaced and configured. During this time, these services will not be available.
pt: Durante o processo de actualização, podem existir serviços associados a pacotes que serão incluídos na actualização. Se for este o caso, esses serviços podem ser parados enquanto os pacotes a ser actualizados estão a ser substituídos e configurados. Durante este tempo, estes serviços não estarão disponíveis.

source: The precise downtime for these service will vary depending on the number of packages being upgraded in the system, and it also includes the time the system administrator answers the configuration questions from different package upgrades (if any). Notice that if the upgrade process is left unattended and the system requests input throughout the upgrade there is a high possibility of services being unavailable<footnote>
pt: O tempo preciso que estes serviços estarão desligados irá variar dependendo do número de pacotes a serem actualizados no sistema, e também inclui o tempo que o administrador do sistema responde às perguntas de configuração dos diferentes pacotes a actualizar (se algumas). Note que se o processo de actualização for deixado desacompanhado e o sistema pedir entrada durante toda a actualização, existem uma grande possibilidade dos serviços estarem indisponíveis<footnote>

source: If the system being upgraded provides critical services for your users or network<footnote>
pt: Se o sistema a ser actualizado disponibilizar serviços críticos para os seus utilizadores ou rede<footnote>

source: Any package installation operation must be run with superuser privileges, so either login as root or use <command>su</command> or <command>sudo</command> to gain the necessary access rights.
zh_tw: 任何套件安裝的動作都需要有系統管理者的權限才能進行，所以您必須以 root 登入，或使用 <command>su</command> 或 <command>sudo</command> 來取得所需的權限。

source: If you wish to take extra precautions, back up or unmount users' partitions (<filename>/home</filename>) before upgrading.
zh_tw: 如果您希望能採取額外的預防措施的話，請在升級前備份或卸載使用者的分割區。

source: Note, however, that doing this will cause <systemitem role="package">initramfs-tools</systemitem> to install only those modules that are required for the particular hardware that it is run on, onto the initramfs; as such, if you want to generate a boot medium that will work on more hardware than just the one you're generating it on, you should leave the setting to
zh_tw: 但請注意，這麼一來將會使得 <systemitem role="package">initramfs-tools</systemitem> 只會把那些正在運作中的硬體所使用的模組給包含進 initramfs 裡；因此，如果您想要產生一個能在其它不同硬體上使用的開機媒體，您必須保留其設定為

source: Instead of using HTTP or FTP packages mirrors, you may wish to modify <filename>/etc/apt/sources.list</filename> to use a mirror on a local disk (possibly mounted over <acronym>NFS</acronym>).
zh_tw: 您可能也會想修改 <filename>/etc/apt/sources.list</filename> 中的設定，以使用本機（像是透過 <acronym>NFS</acronym> 掛載的）磁碟上的鏡像資料來取代透過 HTTP 或 FTP 存取遠端的套件鏡像站。

source: For example, your packages mirror may be under <filename>/var/ftp/debian/</filename>, and have main directories like this:
zh_tw: 舉例來說，如果您的套件鏡像是放在 <filename>/var/ftp/debian/</filename> 之下，而主要的目錄看起來是像這樣的話：

source: # aptitude -y -s -f --with-recommends dist-upgrade [ ... ] XXX upgraded, XXX newly installed, XXX to remove and XXX not upgraded. Need to get xx.xMB/yyyMB of archives. After unpacking AAAMB will be used. Would download/install/remove packages.
zh_tw: # aptitude -y -s -f --with-recommends dist-upgrade [ ... ] 更新了 XXX、新安裝了 XXX、要移除 XXX 而 XXX 將不會被升級。 必須下載 xx.xMB/yyyMB 的檔案。在解壓縮之後將會用掉 AAAMB。 將會進行 下載/安裝/移除 套件。

source: Running this command at the beginning of the upgrade process may give an error, for the reasons described in the next sections. In that case you will need to wait until you've done the minimal system upgrade as in <xref linkend="minimal-upgrade"/> and upgraded your kernel as in <xref linkend="upgrading-kernel"/> before running this command to estimate the disk space.
zh_tw: 在升級過程的開始之時就執行這個指命可能會導致錯誤，發生原因將會在下個章節中說明。在此情況下，您必須先完成在 <xref linkend="minimal-upgrade"/> 所提及的『最小系統升級』，並如同 <xref linkend="upgrading-kernel"/> 所提及的『升級您的 Kernel』，然後再執行這個指令來評估磁碟空間。

source: Remove packages that have been previously downloaded for installation (at <filename>/var/cache/apt/archive</filename>). Cleaning up the package cache by running <command>apt-get clean</command> or <command>aptitude clean</command> will remove all previously downloaded package files.
zh_tw: 移除那些之前為了用來安裝而下載至 <filename>/var/cache/apt/archive</filename> 的套件。執行 <command>apt-get clean</command> 或 <command>aptitude clean</command> 將會清除之前所下載的所有套件檔。

source: Remove packages taking up too much space, which are not currently needed (you can always reinstall them after the upgrade). You can list the packages that take up most of the disk space with <command>dpigs</command> (available in the <systemitem role="package">debian-goodies</systemitem> package) or with <command>wajig</command> (running <literal>wajig size</literal>).
zh_tw: 移除佔用了太多空間但目前尚用不著的套件。（您可以在升級後再把它們重新安裝回來）。您可以利用 <command>dpigs</command>（包含於 <systemitem role="package">debian-goodies</systemitem> 之中）或 <command>wajig</command>（執行 <literal>wajig size</literal>）來列出佔用最多磁碟空間的套件。

source: This upgrade path has been verified to work on systems with the &oldreleasename; <literal>desktop</literal> task installed. It is probably the method that will give the best results on systems with the <literal>desktop</literal> task installed, or with the <literal>gnome</literal> or <literal>kde</literal> packages installed.
zh_tw: 升級途徑已被適度修改，讓它能和安裝了 <literal>desktop</literal> 主題的 &oldreleasename; 系統搭配運作。在安裝了 <literal>desktop</literal> 主題或是安裝了 <literal>gnome</literal> 或 <literal>kde</literal> 套件的系統上，它可能是提供了最佳解決方案的辨法了。

source: It is probably <emphasis>not</emphasis> the correct method to use if you do not already have the <systemitem role="package">libfam0c102</systemitem> and <systemitem role="package">xlibmesa-glu</systemitem> packages installed:
zh_tw: 如果您並未安裝 <systemitem role="package">libfam0c102</systemitem> 及 <systemitem role="package">xlibmesa-glu</systemitem> 套件，這可能並<emphasis>不是</emphasis>應該採用的正確方案。

source: If you do have a full desktop system installed, run:
zh_tw: 如果您安裝了完整的桌面環境，請執行：

source: Upgrading a system with some X packages installed
zh_tw: 升級安裝了部份 X 套件的系統

source: Systems with some X packages installed, but not the full <literal>desktop</literal> task, require a different method. This method applies in general to systems with <systemitem role="package">xfree86-common</systemitem> installed, including some server systems which have <systemitem role="package">tasksel</systemitem> server tasks installed as some of these tasks include graphical management tools. It is likely the correct method to use on systems which run X, but do not have the full <literal>desktop</literal> task installed.
zh_tw: 對於安裝了部份的 X 套件卻沒有安裝完整的<literal>桌面</literal>主題的系統，升級方式也有所不同。這個方式一般適用於安裝了 <systemitem role="package">xfree86-common</systemitem>，其中包含了一些安裝了 <systemitem role="package">tasksel</systemitem> 裡的伺服器主題的伺服器系統，因為這些主題裡可能會包含了圖形的管理工具。這對於那些有執行 X，但並沒有安裝完整的<literal>桌面</literal>主題的系統可能是最佳的方法。

source: First, check whether you have the <systemitem role="package">libfam0c102</systemitem> and <systemitem role="package">xlibmesa-glu</systemitem> packages installed.
zh_tw: 首先，請確認您是否安裝了 <systemitem role="package">libfam0c102</systemitem> 及 <systemitem role="package">xlibmesa-glu</systemitem> 套件。

source: If you do not have <systemitem role="package">libfam0c102</systemitem> installed, do not include <systemitem role="package">libfam0</systemitem> in the following commandline. If you do not have <systemitem role="package">xlibmesa-glu</systemitem> installed, do not include it in the following commandline. <footnote>
zh_tw: 如果您並未安裝 <systemitem role="package">libfam0c102</systemitem>，請去掉下面的指令中的 <systemitem role="package">libfam0</systemitem>。如果您並未安裝 <systemitem role="package">xlibmesa-glu</systemitem>，請將其從下面的指令中去掉。<footnote>

source: Note that installing <systemitem role="package">libfam0</systemitem> will also install the File Alteration Monitor (<systemitem role="package">fam</systemitem>) as well as the RPC portmapper (<systemitem role="package">portmap</systemitem>) if not already available in your system. Both packages will enable a new network service in the system although they can both be configured to be bound to the (internal) loopback network device.
zh_tw: 請注意到，安裝 <systemitem role="package">libfam0</systemitem> 的同時也將會把『檔案變化監看程式』(<systemitem role="package">fam</systemitem>) 以及『RPC 連接埠對應程式』(<systemitem role="package">portmap</systemitem>) 安裝進來，若您的系統上尚未安裝的話。這兩個套件都會在系統中啟用新的網路服務程式，雖然他們都能夠設定為使用（內部的）loopback 網路裝置。

source: When upgrading from a set of CD-ROMs, you will be asked to insert specific CDs at several points during the upgrade. You might have to insert the same CD multiple times; this is due to inter-related packages that have been spread out over the CDs.
zh_tw: 如果您是從光碟組來進行升級的話，系統將會在升級進行時不時要求您放入某張特定的光碟片。您可能會需要反覆放入同一張光碟數次；這是由於相關的套件被分散在多張光碟之中所造成的。

source: the default cache space is insufficient. You can solve this by either removing or commenting lines you don't need in <filename>/etc/apt/sources.list</filename> or by increasing the cache size. The cache size can be increased by setting <literal>APT::Cache-Limit</literal> in <filename>/etc/apt/apt.conf</filename>. The following command will set it to a value that should be sufficient for the upgrade:
zh_tw: 那麼，就表示預設的快取空間不夠了。您可以從 <filename>/etc/apt/sources.list</filename> 中將您不需要的項目加上註解或是乾脆將它移去，或是增加快取空間，來解決這個問題。可以經由設定 <filename>/etc/apt/apt.conf</filename> 裡的 <literal>APT::Cache-Limit</literal> 來增加快取空間。假設您還沒有在這個檔案裡替這個變數設定任何的數值，那麼以下的命令應該可以替升級的動作設定足夠的快取空間：

source: Sometimes it's necessary to enable the <literal>APT::Force-LoopBreak</literal> option in APT to be able to temporarily remove an essential package due to a Conflicts/Pre-Depends loop. <command>aptitude</command> will alert you of this and abort the upgrade. You can work around that by specifying <literal>-o APT::Force-LoopBreak=1</literal> option on <command>aptitude</command> command line.
zh_tw: 有時候您會需要啟用 <literal>APT::Force-LoopBreak</literal> 選項讓 APT 暫時移除某個重要的套件，以解決循環的 相互衝突(Conflicts) / 相互依存(Pre-Depends) 關係。<command>aptitude</command> 會對此提出警告，並終止升級的進行。您可以在 <command>aptitude</command> 的指令行中加入 <literal>-o APT::Force-LoopBreak=1</literal> 來解決這個問題。

source: Note also that if <systemitem role="package">udev</systemitem> is <emphasis>not</emphasis> installed on your system, it is still possible to use <systemitem role="package">hotplug</systemitem> for hardware discovery.
zh_tw: 請注意到，如果 <systemitem role="package">udev</systemitem> <emphasis>並沒有</emphasis> 安裝在您的系統上，那麼還是可以使用 <systemitem role="package">hotplug</systemitem> 來進行硬體偵測。

source: If you are currently using a 2.4 kernel, you should also read <xref linkend="upgrade-to-2.6"/> carefully.
zh_tw: 如果您正在使用 2.4 版的 kernel，您也應該仔細得閱讀 <xref linkend="upgrade-to-2.6"/>。

source: If your system does not rely on <systemitem role="package">hotplug</systemitem><footnote>
zh_tw: 如果您的系統並不依賴 <systemitem role="package">hotplug</systemitem>，<footnote>

source: For network devices, you can avoid this reordering by using <systemitem role="package">udev</systemitem> rules, more specifically, through the definitions at <filename>/etc/udev/rules.d/z25_persistent-net.rules</filename><footnote>
zh_tw: 對於網路裝置而言，您可以利用 <systemitem role="package">udev</systemitem> 的規則；更明確得說，經由 <filename>/etc/udev/rules.d/z25_persistent-net.rules</filename> 裡的定義來避免重新排序<footnote>

source: Add these module names to <filename>/etc/initramfs-tools/modules</filename> in the order they should be loaded at boot time. Some module names may have changed between &oldreleasename; and &releasename;. For example, sym53c8xx_2 has become sym53c8xx.
zh_tw: 將這些模組名稱以它們在開機時應有的載入順序新增到 <filename>/etc/initramfs-tools/modules</filename> 裡。有些模組名稱在 &oldreleasename; 及 &releasename; 裡是有所不同的。比如說，sym53c8xx_2 已變成了 sym53c8xx。

source: The usual symptoms are that the boot will fail because the root file system cannot be mounted and you are dropped into a debug shell, but that when you check afterwards, all devices that are needed are present in <filename>/dev</filename>. This has been observed in cases where the root file system is on a <acronym>USB</acronym> disk or on <acronym>RAID</acronym>, especially if lilo is used.
zh_tw: 一般而言，無法正常開機的原因多是因為無法掛載 root 檔案系統，然後您會進入一個除錯介面，但當您在稍後再進行檢查時，卻發現所有必要的裝置都已出現於 <filename>/dev</filename> 內。這種情況會發生在 root 檔案系統是放在 <acronym>USB</acronym> 裝置或 <acronym>RAID</acronym> 上，尤其又和 lilo 搭配運用時。

source: Procedure to recover from <filename>/dev/hda</filename> became <filename>/dev/sda</filename>
zh_tw: 將 <filename>/dev/hda</filename> 變成 <filename>/dev/sda</filename> 的回復步驟

source: Some users have reported that an upgrade could cause the kernel not finding the system root partition after a system reboot.
zh_tw: 有些使用者反應說，升級可能會導致 kernel 在重開機後找不到系統的 root 分割區。

source: and after a few seconds a bare busybox prompt will show.
zh_tw: 在幾秒之後，會出現一個簡單的 busybox 提示符號。

source: One can avoid this problem entirely by using an identifier for the root filesystem that does not change from one boot to the next. There are two possible methods for doing this - labelling the filesystem, or using the filesystem's universal unique identifier (<acronym>UUID</acronym>). These methods are supported in Debian since the 'etch' release.
zh_tw: 可以完全避開這個問題的方法就是替 root 檔案系統貼上標籤，讓它不會在下次開機時改變了。有兩個方案可以達到這個目的 - 替檔案系統命名，或使用檔案系統的通用唯一識別碼 (Universal Unique Identifier, <acronym>UUID</acronym>)。Debian 自 etch 發行版之後就支援這些方案。

source: The two approaches have advantages and disadvantages. The labelling approach is more readable, but there may be problems if another filesystem on your machine has the same label. The uuid approach is uglier, but having two clashing uuids is highly unlikely.
zh_tw: 這兩個方案各有其優缺點。替檔案系統命名似乎是比較容易理解，但如果您的系統上有其它的檔案系統使用了相同名稱的話，就可能會出問題。而 uuid 這個方案看起來是笨拙了點，但 uuids 會相互衝突的機會就微乎其微了。

source: To implement the labelling approach:
zh_tw: 實作命名方案：

source: Label the filesystem (the name must be &lt; 16 characters) by running the command:
zh_tw: 可以利用以下指令來替檔案系統命外：（該名稱必須 &lt; 16 個字元）

source: Edit <filename>/etc/fstab</filename> and change the line that mounts the <filename>/</filename> partition, eg.:
zh_tw: 修改 <filename>/etc/fstab</filename>，修改用來掛載 <filename>/</filename> 分割區的那一行，例如：

source: To implement the uuid approach:
zh_tw: 實作 uuid 方案：

source: Find out the universal unique identifier of your filesystem by issuing: <command>ls -l /dev/disk/by-uuid | grep hda6</command>
zh_tw: 使用以下方式找到您的檔案系統的通用唯一識別碼：<command>ls -l /dev/disk/by-uuid | grep hda6</command>

source: The <acronym>UUID</acronym> is the name of the symbolic link pointing to <filename>/dev/hda6</filename> ie.: <literal>d0dfcc8a-417a-41e3-ad2e-9736317f2d8a</literal>.
zh_tw: <acronym>UUID</acronym> 就是那個指向 <filename>/dev/hda6</filename> 的符號連結。亦即：<literal>d0dfcc8a-417a-41e3-ad2e-9736317f2d8a</literal>。

source: Edit <filename>/boot/grub/menu.lst</filename> and change the line
zh_tw: 編輯 <filename>/boot/grub/menu.lst</filename> 並修改

source: This is applicable when Grub shows you the menu interface for selecting the entry you want to boot from. If such menu does not appear, try pressing <keycap>Esc</keycap> key before the kernel boots in order to make it appear. If you can't get into this menu, try <xref linkend="solution2"/> or <xref linkend="solution3"/>.
zh_tw: 讓 Grub 顯示開機選單，讓您能夠選擇您要從哪個項目開機是個很合乎情理的作法。但若這個選單沒有出現，請在 kernel 開機之前按下 <keycap>Esc</keycap> 鍵即可讓這個選單出現。如果還是沒辨法弄出這個選單的話，請試試 <xref linkend="solution2"/> 或 <xref linkend="solution3"/>。

source: In the Grub menu, highlight the entry you want to boot from. Press <keycap>e</keycap> key to edit the options related to this entry. You will see something like:
zh_tw: 在 Grub 選單上，選擇您想要開機的項目，然後按下 <keycap>e</keycap> 鍵來修改這個項目的相關選項。您會看到類似的文字如下：

source: Then press <keycap>Enter</keycap> to save the modification. If other lines show <literal>hd<replaceable>X</replaceable></literal>, change these line too. Don't modify the entry similar to <literal>root (hd0,0)</literal>. Once all modifications are done, press <keycap>b</keycap> key. And your system should now boot as usual.
zh_tw: 然後按下 <keycap>Enter</keycap> 來儲存這些修改。如果有其它的項目中也有 show <literal>hd<replaceable>X</replaceable></literal>，請也同時修改。不要將這些項目修改成類似 <literal>root (hd0,0)</literal>。在全數修改完成後，按下 <keycap>b</keycap> 鍵，然後您的系統應該就能正常開機了。

source: Boot from a debian installation media (<acronym>CD</acronym>/<acronym>DVD</acronym>) and when prompt, type <literal>rescue</literal> to launch the rescue mode. Select your language, location, keyboard mapping, let it configure the network no matter if it success or not. After a while, you should be asked for selecting a partition you want to use as root file system. The proposed choices will look something like:
zh_tw: 從一個 Debian 安裝媒體 (<acronym>CD</acronym>/<acronym>DVD</acronym>) 開機，並在提示符號下鍵入 <literal>rescue</literal> 以進入救援模式。選擇您的語言、地區、鍵盤排列方式、讓它設定網路，成功與否無所謂。然後再等上一點時間，您會被問到要將哪個分割區做為 root 檔案系統。這個選項會看起來像是：

source: If you know which partition is your root file system, choose the right one. If you don't, just try with the first. If it complains about an invalid root file system partition, try the next one, and so on. Trying one after the other shouldn't arm your partitions and if you have only one system installed on your disks, you should easily find the right root file system partition. If you have many systems installed on your disks, it would be better to know exactly which is the right partition.
zh_tw: 如果您知道哪個分割區是您的 root 檔案系統，請直接選擇。否則，請直接嘗試第一個。如果程式回覆說這並不是一個 root 檔案系統，再試下一個，依此類推。這樣依次嘗試並不會對您的分割區造成什麼影響，但如果您的磁碟上只安裝了一個系統的話，您可以輕易得找到正確的 root 檔案系統分割區。但如果您在您的磁碟上安裝了好幾個系統，那麼您最好能清楚得知道哪個才是正確的分割區。

source: Once you have choosen a partition, you will be proposed among several actions. Make the choice of executing a shell in the selected partition. If it complains that it cannot do that then try with another partition.
zh_tw: 一旦您選擇了一個分割區，您可以有數個方案可供選擇。在那個選定的分割區上執行一個 shell，如果程式回覆說無法進行，請再試另一個分割區。

source: Now you should have shell access as user root on your root file system mounted on <filename>/</filename>. You need access to the <filename>/boot</filename>, <filename>/sbin</filename> and <filename>/usr</filename> directories content. If these directories need to be mounted from other partitions, do it. (see <filename>/etc/fstab</filename> if you have no idea of which partition to mount).
zh_tw: 現在您應當可以用 shell 來存取現正掛載在 <filename>/</filename> 上的 root 檔案系統了，您還需要能夠存取 <filename>/boot</filename>、<filename>/sbin</filename> 及 <filename>/usr</filename> 裡的東西。如果必須由其它的分割區來掛載這幾個目錄，請動手。（請查看 <filename>/etc/fstab</filename> 如果您不清楚該掛載哪些目錄的話。）

source: Jump to <xref linkend="avoid-problems-before-upgrading"/> and apply one of the two proposed procedures to fix the problem parmanently. Then type <literal>exit</literal> to leave the rescue shell and select <literal>reboot</literal> for rebooting the system as usual. (Don't forget to remove the bootable media)
zh_tw: 請參閱 <xref linkend="avoid-problems-before-upgrading"/> 並採取 2 種解決方案之一來手動修正這些問題。然後按下 <literal>exit</literal> 來離開這個救援 shell，然後選擇 <literal>reboot</literal> 來將系統重新開機。（別忘了要取出開機媒體）

source: Boot from your favorite LiveCD distribution (Debian Live, Knoppix, Ubuntu Live and many other).
zh_tw: 從您想用的 LiveCD 發行版（Debian Live、Knoppix、Ubuntu Live，或其它）開機。

source: Mount the partition where your <filename>/boot</filename> directory is. If you don't know which one it is, use the output of the command <command>dmesg</command> to find whether your disk is known as <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> or <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>. Once you know which disk to work on, for example <literal>sdb</literal>, issue the following command to see the partition table of the disk and to find the right partition <command>fdisk -l /dev/sdb</command>
zh_tw: 將您的 <filename>/boot</filename> 分割區給掛載起來。如果您不清楚是哪一個，請利用 <command>dmesg</command> 命令的輸出文字來找出您的磁碟是 <literal>hda</literal>、<literal>hdb</literal>、<literal>hdc</literal>、<literal>hdd</literal> 或是 <literal>sda</literal>、<literal>sdb</literal>、<literal>sdc</literal>、<literal>sdd</literal>。等到您知道是哪個磁碟後，比如說是 <literal>sdb</literal>，執行 <command>fdisk -l /dev/sdb</command> 命令來檢視該碟碟的磁碟分割表，並找到正確的分割區。

source: and replace every <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> respectively with <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>. Don't modify the line similar to:
zh_tw: 然後將所有的 <literal>hda</literal>、<literal>hdb</literal>、<literal>hdc</literal>、<literal>hdd</literal> 以 <literal>sda</literal>、<literal>sdb</literal>、<literal>sdc</literal>、<literal>sdd</literal> 取代。不要修改類似以下文字的那幾行：

source: With the release of <literal>Lenny</literal> a bigger number of server packages will be deprecated, thus updating to newer versions of those now will save you from trouble when updating to <literal>Lenny</literal>.
zh_tw: 隨著 <literal>Lenny</literal> 的釋出，有為數可觀的伺服器套件將會被棄用，因此立即將它們昇級到較新的版本將會讓升級到 <literal>Lenny</literal> 的過程更為平順。

source: apache (1.x), successor is apache2
zh_tw: apache (1.x)，取而代之的是 apache2

source: bind8, successor is bind9
zh_tw: bind8，取而代之的是 bind9

source: php4, successor is php5
zh_tw: php4，取而代之的是 php5

source: postgresql-7.4, successor is postgresql-8.1
zh_tw: postgresql-7.4，取而代之的是 postgresql-8.1

source: Drop of the ARM port, in favour of the ARM EABI port
zh_tw: 放棄移植至 ARM，轉而移植至 ARM EABI。

source: Debian lenny has two different and incompatible ARM ports: the old ABI port (arm) and the new EABI port (armel). Debian lenny is the last release with support for the ARM port and future releases will only support the ARM EABI or armel port. It's therefore recommended to use armel for new installations of lenny.
zh_tw: Debian lenny 有 2 個不同且不相容的 ARM 移植計劃：舊的 ABI 移植計劃 (arm) 及新的 EABI 移植計劃 (armel)。Debian lenny 將會是最後一個支援 ABI 移植計劃的發行版，之後的發行版將只會支援 ARM EABI 或 armel 移植計劃。因此在此建議能在新安裝的 lenny 系統上使用 armel。

source: With the exception of Netwinder, installer images for supported ARM machines are available for both arm and armel in lenny. Netwinder support is only available for arm and it will be dropped after lenny along with the arm port.
zh_tw: 除了 Netwinder 之外，在 Lenny 裡會同時替 ARM 機器提供 arm 及 armel 安裝影像檔。對於 Netwinder 將只提供 arm 的支援，且會隨著 lenny 的 arm 支援計劃而被放棄掉。
