Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: During the upgrade, you will normally have been offered the option to "chainload" GRUB 2: that is, to keep GRUB Legacy as the primary boot loader but to add an option to it to load GRUB 2 and then start your &debian; system from that. This allows you to verify that GRUB 2 works on your system before committing to use it permanently.
fr: Pendant la mise à niveau, la question de l'utilisation en chaîne («&nbsp;chainload&nbsp;») de GRUB 2 vous sera posée, c'est-à-dire garder GRUB Legacy comme programme d'amorçage, avec une entrée pour charger GRUB 2 qui s'occupera de démarrer le système &debian;. Ceci vous permet de vérifier que GRUB 2 marche sur le système avant de l'utiliser de manière exclusive.
it: Durante l'aggiornamento verrà chiesto se "caricare in cascata" GRUB 2: cioè di tenere GRUB Legacy come bootloader principale e di aggiungergli una voce in modo da caricare GRUB 2 e poi proseguire l'avvio del sistema Debian con esso. Questo permette di verificare se sul proprio sistema GRUB 2 funziona prima di usarlo definitivamente.
ja: アップグレード中、GRUB 2 を「チェーンロード」するオプションを進められることでしょう。これは GRUB Legacy をブートローダとして優先したままですが、GRUB 2 を読み込むオプションをそこに追加し、&debian; システムをそこから起動するようにします。これによって、GRUB 2 を使うという恒久的な変更を加える前に、GRUB 2 があなたのシステム上で動くかどうかを確認できるようになります。
pt: Durante a actualização, será-lhe normalmente oferecida a opção de carregar o GRUB 2 "em cadeia": isto é, manter o GRUB Legacy como o carregador de arranque principal mas adicionar uma opção a ele para carregar o GRUB 2 e depois arrancar o seu sistema a partir dai. Isto permite verificar que o GRUB 2 funciona no sue sistema antes de se submeter a usá-lo permanentemente.
ro: Pe timpul procesului de actualizare, veți avea posibilitatea să alegeți opțiunea să „încărcați în lanț” GRUB 2: adică, să păstrați GRUB Legacy ca încărcător de sistem principal, dar să adăugați o opțiune să încarce GRUB 2 și să pornească sistemul &debian; cu acesta. Acest lucru vă va permite să verificați că GRUB 2 funcționează pe sistemul dumneavoastră înainte de a face modificarea permanentă.
sv: Vid uppgraderingen kommer du vanligen få möjligheten att "kedjeladda" GRUB 2. Det möjliggör den äldre GRUB-versionen kan behållas som primär uppstartshanterare och låta den läsa in GRUB 2 för att därefter starta ditt &debian;-system. Detta innebär att du kan verifiera att GRUB 2 fungerar på ditt system innan du bestämmer dig för att använda det permanent.

source: Once you have confirmed that GRUB 2 works, you should switch to using it properly: the chainloading setup is only intended to be used temporarily. You can do this by running <command>upgrade-from-grub-legacy</command>.
fr: Une fois certain que GRUB 2 marche, vous devriez l'utiliser , le chargement en chaîne n'étant qu'une solution temporaire. Vous pouvez faire le changement par la commande <command>upgrade-from-grub-legacy</command>.
it: Una volta verificato che GRUB 2 è funzionante, si dovrebbe iniziare a usarlo correttamente: la configurazione con il caricamento in cascata dovrebbe essere usata solo temporaneamente. Eseguire <command>upgrade-from-grub-legacy</command> per installarlo definitivamente.
ja: GRUB 2 が動くことが確認できたら、これをちゃんと使うように切り換えをすべきです。チェーンロード設定は一時的な利用のみを意図しています。<command>upgrade-from-grub-legacy</command> を実行すれば、この切り換えが行えます。
pt: Após ter confirmado que o GRUB 2 funciona, você deve mudar para usá-lo de modo apropriado. A configuração de carga e cadeia destina-se apenas a ser usada temporariamente. Você pode fazer isto ao executar <command>upgrade-from-grub-legacy</command>.
ro: Odată ce ați confirmat că GRUB 2 funcționează, ar trebui să treceți la folosirea lui în mod corespunzător: încărcarea înlănțuită este destinată pentru a fi folosită doar temporar. Puteți face acest lucru cu comanda <command>upgrade-from-grub-legacy</command>.
sv: När du väl har säkerställt att GRUB 2 fungerar bör du byta till att använda det uteslutande. Kedjeladdningen är bara tänkt att användas temporärt. Du kan slutföra uppgraderingen genom att köra <command>upgrade-from-grub-legacy</command>.

source: The GRUB Manual has <ulink url="http://www.gnu.org/software/grub/manual/grub.html#Changes-from-GRUB-Legacy">more information</ulink> on the changes between GRUB Legacy and GRUB 2, some of which may require changes to complex configurations. If you have not modified your boot loader configuration, you should not need to do anything further.
fr: Le manuel de GRUB donne <ulink url="http://www.gnu.org/software/grub/manual/grub.html#Changes-from-GRUB-Legacy">plus d'informations</ulink> sur les différences entre GRUB Legacy et GRUB 2. Certaines peuvent demander des changements dans des configurations complexes. Si vous n'avez pas modifié la configuration du gestionnaire de démarrage, vous ne devriez pas avoir besoin d'aller plus loin.
it: Il manuale di GRUB contiene <ulink url="http://www.gnu.org/software/grub/manual/grub.html#Changes-from-GRUB-Legacy">altre informazioni</ulink> sui cambiamenti tra GRUB Legacy e GRUB 2, alcuni dei quali potrebbero richiedere delle modifiche alle configurazioni più complesse. Se non è stata modificata la configurazione del bootloader, non dovrebbe essere necessario fare nulla.
ja: GRUB マニュアルには、GRUB Legacy と GRUB 2 の違いについて<ulink url="http://www.gnu.org/software/grub/manual/grub.html#Changes-from-GRUB-Legacy">より詳細な情報</ulink>が載っています。このうちの幾つかは、複雑な設定の場合には必要な変更かもしれません。ブートローダの設定をいじっていない場合は、これ以上何もするべきことはありません。
pt: O Manual do The GRUB tem <ulink url="http://www.gnu.org/software/grub/manual/grub.html#Changes-from-GRUB-Legacy">mais informação</ulink> sobre as alterações entre GRUB Legacy e GRUB 2, algumas delas podem requerer alterações a configurações complexas. Se você não modificou a configuração so seu carregador de arranque, não deverá precisar de fazer mais nada.
ro: Manualul GRUB oferă <ulink url="http://www.gnu.org/software/grub/manual/grub.html#Changes-from-GRUB-Legacy">mai multe informații</ulink> despre modificările între GRUB Legacy and GRUB 2, unele necesitând schimbări de configurații complexe. Dacă nu ați modificat configurația inițială a încărcătorului de sistem nu ar trebui să faceți altceva.
sv: GRUB-manualen har <ulink url="http://www.gnu.org/software/grub/manual/grub.html#Changes-from-GRUB-Legacy">mer information</ulink> om ändringarna mellan den äldre GRUB-versionen och GRUB 2, vissa ändringar påverkar särskilt komplexa instälningar. Om du inte har modifierat inställningarna för uppstartshanteraren ska du inte behöva redigera något ytterligare.

source: Deprecated components
fr: Composants obsolètes
it: Componenti deprecati
ja: 廃止予定のコンポーネント
pt: Componentes descontinuados
ro: Componente depășite
sv: Utfasade komponenter

source: With the next release of &debian; &nextrelease; (codenamed &nextreleasename;) some features will be deprecated. Users will need to migrate to other alternatives to prevent trouble when updating to &nextrelease;.
fr: Avec la publication de &debian; &nextrelease; (nom de code &Nextreleasename;), un nombre important de fonctions seront obsolètes, et les utilisateurs devront changer pour de nouvelles alternatives pour prévoir le passage en &nextrelease;.
it: Con la prossima versione di &debian; &nextrelease; (nome in codice &nextreleasename;) alcune funzionalità verranno rese deprecate. Gli utenti dovranno migrare verso una delle alternative in modo da prevenire problemi durante l'aggiornamento a &nextrelease;.
ja: &debian; の次期リリース &nextrelease; (コードネーム &nextreleasename;) では、いくつかの機能が廃止されます。システムを &nextrelease; へと更新する際の手間を省くため、ユーザは他の代替へ移行する必要があります。
pt: Com o próximo lançamento da &debian; &nextrelease; (nome de código &nextreleasename;) algumas funções serão descontinuadas. Os utilizadores terão que migrar para outras alternativas para prevenir problemas quando actualizar para &nextrelease;.
ro: Odată cu următoarea lansare &debian; &nextrelease; (numită &nextreleasename;) unele caracteristici vor fi învechite. Utilizatorii vor trebui să migreze către alternative pentru a preveni apariția problemelor la actualizare la &nextrelease;.
sv: I och med nästa utgåva av &debian; &nextrelease; (kodnamn &nextreleasename;) kommer ett större antal funktioner att föråldras. Användare kommer att behöva byta till alternativ för att förhindra problem vid uppgradering till &nextrelease;.

source: This includes the following features:
fr: Cela inclut les fonctions suivantes :
it: Questo include le seguenti funzionalità:
ja: 以下の機能が廃止予定となっています:
pt: Isto inclui as seguintes funcionalidades:
ro: Acestea includ următoarele caracteristici:
sv: Det inkluderar följande funktioner:

source: OpenVZ and Linux-Vserver: &debian; &release; will be the last release to include Linux kernel virtualization featuresets outside of mainline. This means that the OpenVZ and Linux-Vserver featuresets should be considered deprecated, and users should migrate to linux-2.6 upstream merged virtualization solutions like KVM, Linux Containers or Xen.
fr: OpenVZ et Linux-Vserver : &debian; &release; sera la dernière version stable qui inclut les technologies de virtualisation du noyau Linux hors de la branche principale. Cela signifie que les solutions OpenVZ et Linux-Vserver vont devenir obsolètes, et que les utilisateurs devraient migrer vers les solutions de virtualisation intégrées en amont à linux-2.6 comme KVM, Linux Container ou Xen ;
it: OpenVZ e Linux-Vserver: &debian; &release; è l'ultimo rilascio a includere gli insiemi di funzioni di virtualizzazione non presenti ufficialmente nel kernel Linux. Questo comporta che gli insiemi di funzioni OpenVZ e Linux-Vserver devono essere considerati deprecati e che gli utenti dovrebbero migrare verso una delle soluzioni di virtualizzazione presenti in linux-2.6 quali KVM, Linux Containers o Xen.
ja: OpenVZ と Linux-Vserver: &debian; &release; は、メインライン外の Linux カーネルの仮想化機能を含む最後のリリースになります。これは OpenVZ と Linux-Vserver の機能は非推奨 (deprecated) だとみなされ、ユーザが、KVM や Linux コンテナ、あるいは Xen のような linux-2.6 の開発元で統合済みの仮想化ソリューションへ移行しなければならないことを意味します。
pt: OpenVZ e Linux-Vserver: &debian; &release; será o último lançamento a incluir conjuntos de funcionalidades de virtualização do kernel Linux fora da linha principal. Isto significa que os conjuntos de funcionalidades do OpenVZ e Linux-Vserver deverão ser considerados descontinuados, e os utilizadores devem migrar para soluções de virtualização fundidas na origem do linux-2.6 como o KVM, Linux Containers ou Xen.
ro: OpenVZ și Linux-Vserver: &debian; &release; va fi ultima versiune care include soluții de virtualizare ce nu sunt incluse în nucleu. Acest lucru înseamnă că OpenVZ și Linux-Vserver ar trebui considerate învechite iar utilizatorii ar trebui să migreze către soluții de virtualizare incluse în nucleul linux-2.6, ca: KVM, Linux Containers sau Xen.
sv: OpenVZ och Linux-Vserver: &debian; &release; kommer att vara den sista utgåvan som inkluderar virtualiseringsfunktioner för Linuxkärnan som inte ingår i huvudutgåvan. Detta innebär att funktionspaketen i OpenVZ och Linux-Vserver ska anses vara utfasade och användare ska migrera till virtualiseringsfunktion som KVM, Linux Containers eller XEN som finns i linux-2.6 huvudutgåva.

source: The <systemitem role="package">gdm</systemitem> package (GNOME Display Manager version 2.20) will be obsoleted by <systemitem role="package">gdm3</systemitem>, a rewritten version. See <xref linkend="gnome-desktop-changes" /> for more information.
fr: le paquet <systemitem role="package">gdm</systemitem> (GNOME Display Manager -- version 2.20) sera rendu obsolète par <systemitem role="package">gdm3</systemitem>, qui est une version réécrite. Consultez <xref linkend="gnome-desktop-changes" /> pour de plus amples informations.
it: Il pacchetto <systemitem role="package">gdm</systemitem> (GNOME Display Manager versione 2.20) è reso obsoleto da <systemitem role="package">gdm3</systemitem>, una versione riscritta. Si consulti <xref linkend="gnome-desktop-changes" /> per ulteriori dettagli.
ja: <systemitem role="package">gdm</systemitem> パッケージ (GNOME ディスプレイマネージャー バージョン 2.20) は、書き直されたバージョンの <systemitem role="package">gdm3</systemitem> によって時代遅れなもの (Obsolete) となっています。詳細については <xref linkend="gnome-desktop-changes"/> を参照してください。
pt: O pacote <systemitem role="package">gdm</systemitem> (Gestor de Ecrã do GNOME versão 2.20) irá ficar obsoleto pelo <systemitem role="package">gdm3</systemitem>, uma versão rescrita. Veja <xref linkend="gnome-desktop-changes" /> para mais informação.
ro: Pachetul <systemitem role="package">gdm</systemitem> (Administratorul de ecran GNOME versiunea 2.20) va fi învechit de <systemitem role="package">gdm3</systemitem>, o versiune rescrisă a sa. Citiți <xref linkend="gnome-desktop-changes" /> pentru mai multe informații.
sv: Paketet <systemitem role="package">gdm</systemitem> (GNOME Display Manager version 2.20) kommer att fasas ut till förmån för <systemitem role="package">gdm3</systemitem>, en omskriven version. Läs mer i <xref linkend="gnome-desktop-changes" /> för närmare information.

source: Obsolete packages
fr: Paquets obsolètes
it: Pacchetti obsoleti
ja: 時代遅れ (Obsolete) のパッケージ
ml: കാലഹരണപ്പെട്ട പൊതികള്‍
pt: Pacotes obsoletos
ro: Pachete învechite
sv: Föråldrade paket
zh_tw: 被廢棄的套件

source: Introducing several thousand new packages, &releasename; also retires and omits more than four thousand old packages that were in &oldreleasename;. It provides no upgrade path for these obsolete packages. While nothing prevents you from continuing to use an obsolete package where desired, the Debian project will usually discontinue security support for it a year after &releasename;'s release<footnote>
fr: Avec &Releasename;, plusieurs milliers de nouveaux paquets apparaissent, tandis que plus de quatre mille anciens paquets présents dans &Oldreleasename; disparaissent. Il n'est pas prévu de procédure de mise à niveau pour ces paquets obsolètes. Bien que rien ne vous empêche de continuer à utiliser ces paquets si vous le désirez, le projet Debian arrête habituellement le suivi en sécurité un an après la sortie de &Releasename;<footnote>
it: &releasename; introduce molte migliaia di nuovi pacchetti, ma nel contempo ritira e omette più di quattromila vecchi pacchetti che erano in &oldreleasename;. Non viene fornito alcun percorso di aggiornamento per questi pacchetti obsoleti. Nulla impedisce di continuare a usare pacchetti obsoleti, se così si desidera, ma il progetto Debian terminerà il supporto di sicurezza per essi un anno dopo il rilascio di &releasename;<footnote>
ja: &releasename; では、数千個の新規パッケージが導入された一方で、&oldreleasename; にあった 4,000 個以上の古いパッケージの破棄や削除が行われています。これら時代遅れのパッケージをアップグレードする手段は提供されていません。時代遅れのパッケージを使い続けても構いませんが、Debian プロジェクトでは通常、&releasename; がリリースされてから 1 年後に<footnote>
pt: Ao introduzir vários milhares de novos pacotes, a &releasename; também remove e omite mais de quatro milhares de antigos pacotes que estavam na &oldreleasename;. Não fornece um caminho de actualização para estes pacotes obsoletos. Ao mesmo tempo que nada o impede de continuar a utilizar um pacote obsoleto enquanto o desejar, o projecto Debian irá normalmente descontinuar o suporte de segurança para o mesmo um ano depois do lançamento da &releasename;<footnote>
ro: Deși aduce câteva sute de pachete noi, &releasename; mai înlocuiește și omite mai mult de patru mii de pachete vechi care au fost în &oldreleasename;. Nu se oferă nici o modalitate de înnoire a pachetelor depășite. În timp ce nimic nu vă oprește să continuați să folosiți pachetele depășite, proiectul Debian va opri suportul de securitate pentru ele la un an după lansarea lui &releasename;<footnote>
sv: &releasename; introducerar tusentals nya paket men pensionerar och utelämnar mer än 4000 gamla paket som fanns i &oldreleasename;. Det tillhandahålls inget uppgraderingssätt för dessa föråldrade paket. Ingenting hindrar dig från att fortsätta att använda ett föråldrat paket om så önskas men Debianprojektet kommer vanligtvis att sluta ge säkerhetsstöd för dessa ett år efter utgivningen av &releasename;<footnote>

source: Or for as long as there is not another release in that time frame. Typically only two stable releases are supported at any given time.
fr: Ou aussi longtemps qu'il n'y a pas de nouvelle version pendant cet intervalle de temps. Il n'y a typiquement qu'au plus deux versions stables de supportées à tout moment.
it: O per tutto il tempo in cui non uscirà un altro rilascio. Tipicamente solo due rilasci stabili sono supportati contemporaneamente.
ja: あるいは、1 年以内でも別のリリースが出るときに。一般に、どの時点でも、サポートされる安定版リリースは 2 つだけです。
ml: അല്ലെങ്കില്‍ ആ കാലഘട്ടത്തില്‍ വേറൊരു പ്രകാശനം നടക്കാത്തിടത്തോളം. കൃത്യ‌‌മായി പറഞ്ഞാല്‍, സുസ്ഥിരമായ രണ്ടു പതിപ്പുകള്ക്ക് മാത്രമേ ഒരേസമയം പിന്തുണയുണ്ടാകൂ.
pt: Ou enquanto não for feito outro lançamento durante esse periodo de tempo. Tipicamente apenas dois lançamentos estáveis são suportados em qualquer altura.
ro: Sau atât timp cât nu este o altă lansare în acel interval de timp. În mod obișnuit sunt doar două versiuni stabile suportate în același timp.
sv: Eller så länge som ingen annan utgivning sker i den tidsperioden. Normalt sett stöds endast två stabila utgåvor åt gången.
zh_tw: 或是直到在這段期間內有新的發行版推出為止。基本上，我們只會同時維護兩個 stable 的發行版。

source: </footnote>, and will not normally provide other support in the meantime. Replacing them with available alternatives, if any, is recommended.
fr: </footnote> et ne fournira normalement pas d'autre support entre temps. Il vous est recommandé de les remplacer par d'autres logiciels, s'il en existe.
it: </footnote> e non fornirà normalmente alcun altro supporto nel frattempo. La loro sostituzione con alternative disponibili, se ve ne sono, è raccomandata.
ja: </footnote>そのようなパッケージへのセキュリティサポートを打ち切ります。またセキュリティサポート期間内であっても、時代遅れのパッケージへの他のサポートは通常は提供しません。利用可能な代替品があるのであれば、代わりにそれを使うようにすることをお勧めします。
ml: </footnote>, ഇതിനിടക്ക് മറ്റു തരത്തിലുള്ള പിന്തുണയും സാധാരണ ഉണ്ടാവില്ല. ലഭ്യ‌‌മായ മറ്റ് ഏതെങ്കിലും ഉപയോഗിച്ച് പകരം വെയ്ക്കാന്‍ ശുപാര്ശ ചെയ്യുന്നു.
pt: </footnote>, e normalmente não irá disponibilizar outro suporte durante esse tempo. É recomendado substitui-los por alternativas disponíveis, se existirem.
ro: </footnote>, și, în mod normal, nici nu va oferi altfel de suport între timp. Este recomandată înlocuirea lor cu alternative, dacă sunt disponibile.
sv: </footnote> och kommer normalt sett inte att tillhandahålla annat stöd under den tiden. Att ersätta dem med tillgängliga alternativ, om det finns några, rekommenderas.
zh_tw: </footnote>，而除此之外，我們在這段期間內一般並不會再提供其它方面的支援。如果可以的話，我們建議您能採用其它的替代方案來取代這些套件。

source: There are many reasons why packages might have been removed from the distribution: they are no longer maintained upstream; there is no longer a Debian Developer interested in maintaining the packages; the functionality they provide has been superseded by different software (or a new version); or they are no longer considered suitable for &releasename; due to bugs in them. In the latter case, packages might still be present in the <quote>unstable</quote> distribution.
fr: Il y a plusieurs raisons pour lesquelles un paquet peut avoir été retiré de la distribution : il n'est plus maintenu en amont, il n'y a plus de responsable Debian intéressé par la maintenance du paquet, la fonctionnalité fournie par le paquet a été remplacée par un logiciel différent (ou une nouvelle version) ou il n'est plus considéré comme convenable pour &Releasename; en raison de ses bogues. Dans ce dernier cas, le paquet peut cependant toujours être présent dans la distribution <quote>unstable</quote>.
it: Vi sono molte ragioni per cui i pacchetti possono essere stati rimossi dalla distribuzione: non sono più mantenuti a monte, non vi sono più sviluppatori Debian interessati alla manutenzione dei pacchetti, le funzionalità fornite sono state superate da altri software o da una nuova versione, oppure non sono più considerati adatti per &releasename; a causa di errori. In quest'ultimo caso, i pacchetti potrebbero continuare a essere presenti nella distribuzione <quote>unstable</quote>.
ja: パッケージがディストリビューションから削除された理由は、数多くあります――もう上流で保守されていない、そのパッケージの保守作業に興味を抱く Debian 開発者がもういない、提供していた機能が別のソフトウェア (または新しいバージョン) に取って代わられた、バグのために &releasename; にはもう適さないと見なされた、などです。最後の場合では、当該パッケージが <quote>不安定版</quote> ディストリビューション内にはまだ存在していることがあります。
ml: വിതരണങ്ങളില്‍നിന്ന് പൊതികള്‍ നീക്കം ചെയ്യപ്പെടേണ്ടിവരുന്നതിന് പല കാരണങ്ങളുമുണ്ട്: അവയൊന്നും വരുംകാലത്തേക്കായി പരിപാലിക്കപ്പെടില്ല; ഡെബിയന്‍ നിര്മ്മാതാക്കളിലാരും അവ പരിപാലിക്കാന്‍ ഒരിക്കലും താത്പര്യം കാണിക്കില്ല; അവയുടെ പ്രവര്ത്തന ശേഷി മറ്റു സോഫ്റ്റ്‌‌വേറുകള്‍ (മറ്റു പതിപ്പുകള്‍) അതിലംഘിച്ചുകഴിഞ്ഞു: അല്ലെങ്കില്‍, അവയിലെ പിഴവുകള്‍ ‍കാരണം &releasename;നു യോജിച്ചതായി പരിഗണിക്കാനാവില്ല. എങ്കിലും അത്തരം പൊതികള്‍ വിതരണത്തിലെ <quote>unstable</quote>പതിപ്പില്‍ ഉണ്ടായിരിക്കും.
pt: Existem muitas razões para que pacotes possam ter sido retirados da distribuição: não serem mais mantida uma evolução; não existir mais um Debian 'Developer' interessado em manter os pacotes; a funcionalidade que estes fornecem ter sido ultrapassada por outro software diferente (ou uma nova versão); ou deixados de serem considerados adequados para a &releasename; devido a bugs neles. No último caso, os pacotes podem no entanto continuar a estarem presentes na distribuição <quote>unstable</quote>.
ro: Există multe motive pentru care pachetele pot fi eliminate din distribuție: nu mai sunt întreținute de către autorii originari, nu mai există un dezvoltator Debian interesat de întreținerea pachetelor, funcționalitatea oferită a fost înlocuită de alt software (sau o nouă versiune), sau nu mai sunt considerate a fi potrivite pentru &releasename; datorită problemelor avute. În cazul din urmă, pachetele ar putea fi încă prezente în distribuția <quote>unstable</quote>.
sv: Det finns många anledningar till varför paket kan ha tagits bort från distributionen: de underhålls inte längre av upphovsmännen; det finns inte längre någon Debianutvecklare som är intresserad av att underhålla paketen; funktionaliteten de tillhandahåller har ersatts av en annan programvara (eller en ny version); eller så anses de inte längre vara lämpliga för &releasename; på grund av fel i dem. I det senare fallet kan paket fortfarande finnas i <quote>unstable</quote>-distributionen.
