Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: Detecting which packages in an updated system are <quote>obsolete</quote> is easy since the package management front-ends will mark them as such. If you are using <command>aptitude</command>, you will see a listing of these packages in the <quote>Obsolete and Locally Created Packages</quote> entry. <command>dselect</command> provides a similar section but the listing it presents might differ.
fr: Détecter quels paquets sont <quote>obsolètes</quote> dans un système à jour est facile car les interfaces de gestion des paquets les marquent comme tel. Si vous utilisez <command>aptitude</command>, vous verrez une liste de ces paquets sous l'entrée <quote>Paquets obsolètes ou créés localement</quote>. <command>Dselect</command> fournit une section similaire, mais la liste présentée peut être différente.
it: Trovare quali pacchetti in un sistema aggiornato sono <quote>obsoleti</quote> è facile, poiché le interfacce dei gestori di pacchetti li marcheranno come obsoleti. Se si usa <command>aptitude</command>, si vedrà una lista di questi pacchetti nella sezione <quote>Pacchetti obsoleti e creati localmente</quote>. <command>dselect</command> fornisce una sezione simile, ma l'elenco presentato potrebbe essere differente.
ja: 更新が完了したシステム内のどのパッケージが <quote>時代遅れ</quote> なのかを検出するのは、パッケージ管理用フロントエンドが当該パッケージにその旨のマークをつけてくれるので簡単です。<command>aptitude</command> を使っているのなら、当該パッケージが <quote>廃止された、またはローカルで作成されたパッケージ</quote> 欄に列記されているのに気づくでしょう。<command>dselect</command> も同じようなセクションを提供しますが、表示される一覧はわずかに異なっています。
ml: നവീകരിക്കപ്പെട്ട വ്യ‌‌വസ്ഥിതിയിലെ <quote>obsolete</quote>പൊതികള്‍ കണ്ടെത്തുന്നത് വളരെ എളുപ്പമാണ്, കാരണം പൊതികള്‍ കൈകാര്യം ചെയ്യുന്ന മുന്‍‌തല (front end) അങ്ങനെ അടയാളപ്പെടുത്തിയിരിക്കും. നിങ്ങള്‍ <command>aptitude</command>ആജ്ഞ ഉപയോഗിക്കുകയാണെങ്കില്‍, ഇത്തരത്തിലുള്ള പൊതികളെ <quote>Obsolete and Locally Created Packages</quote>ല്‍ പട്ടിക തിരിച്ചു കാണിക്കും. <command>dselect</command> ആജ്ഞ ഇതുപോലുള്ള ഒരു അദ്ധ്യാ‌‌യം സൃഷ്ടിയ്ക്കും, എന്നാല്‍ പട്ടികയില്‍ അല്‍‌പം ചില മാറ്റങ്ങളുണ്ടാകും.
pt: A detecção dos pacotes que num sistema actualizado são <quote>obsoletos</quote> é fácil pelo facto dos 'front-ends' do gestor de pacotes os marcarem como tal. Se estiver a utilizar o <command>aptitude</command>, verá a lista destes pacotes na entrada <quote>Pacotes obsoletos e criados localmente</quote>. O <command>dselect</command> disponibiliza uma secção idêntica mas a lista que apresenta pode ser diferente.
ro: Detectarea pachetelor <quote>depășite</quote> într-un sistem actualizat este ușoară, deoarece vor fi marcate ca atare în interfețele de administrare a pachetelor. Dacă folosiți <command>aptitude</command>, veți observa o listă a acestor pachete în secțiunea <quote>Pachete învechite și pachete create local</quote>. <command>dselect</command> oferă o secțiune similară, însă afișarea poate diferi.
sv: Att identifiera vilka paket på ett uppdaterat system som är <quote>föråldrade</quote> är enkelt eftersom pakethanteringsvertygen markerar dem så. Om du använder <command>aptitude</command>, kommer du att se en lista över dessa paket under <quote>Föråldrade och lokalt skapade paket</quote>. <command>dselect</command> tillhandahåller en liknande sektion men listan som visas kan skilja sig.

source: Also, if you have used <command>aptitude</command> or <command>apt-get</command> to manually install packages in &oldreleasename; it will have kept track of those packages you manually installed and will be able to mark as obsolete those packages pulled in by dependencies alone which are no longer needed if a package has been removed. <command>aptitude</command> and <systemitem role="package">apt</systemitem>, unlike <command>deborphan</command>, will not mark for removal packages that you manually installed, as opposed to those that were automatically installed through dependencies. To remove automatically installed packages that are no longer used, run:
fr: Si vous avez utilisé <command>aptitude</command> ou <command>apt-get</command> pour installer manuellement des paquets dans &Oldreleasename;, le programme aura gardé la trace de ces paquets ; ainsi, quand un paquet est supprimé, le programme peut marquer comme obsolètes les paquets installés par le seul jeu des dépendances et qui ne sont plus nécessaires. À la différence de <command>deborphan</command>, <command>aptitude</command> et <systemitem role="package">apt</systemitem> ne marque pas comme obsolètes les paquets que vous avez installés, au contraire de ceux qui ont été installés automatiquement par les dépendances. Pour supprimer automatiquement les paquets installé que vous n'utilisez plus, tapez&nbsp;:
it: Inoltre, se si è usato <command>aptitude</command> o <command>apt-get</command> per installare manualmente dei pacchetti in &oldreleasename;, questi avranno tenuto traccia dei pacchetti installati manualmente e saranno capaci di marcare come obsoleti quei pacchetti installati solo per soddisfare delle dipendenze e che non sono più necessari se un pacchetto viene rimosso. <command>aptitude</command> e <systemitem role="package">apt</systemitem>, a differenza di <command>deborphan</command>, non marcheranno per la rimozione i pacchetti che sono stati installati manualmente dall'utente, all'opposto di quelli che sono stati installati automaticamente a seguito di dipendenze. Per rimuovere automaticamente i pacchetti che non sono più usati, eseguire:
ja: さらに、&oldreleasename; で手作業でパッケージをインストールするのに <command>aptitude</command> や <command>apt-get</command>を使っていたのなら、手作業でインストールされたパッケージの記録が取られています。依存関係のみによって引きずられてインストールされたパッケージに対して、依存元パッケージが削除されてもう不要となった場合に、時代遅れのマークをつけることができるでしょう。<command>aptitude</command> と <systemitem role="package">apt</systemitem> は、<command>deborphan</command> とは異なり、手作業でインストールしたパッケージには時代遅れのマークをつけません (依存関係によって自動でインストールされたものにはマークをつけます)。自動的にインストールされたがもはや使われていないパッケージを削除するには、以下を実行してください:
pt: Também, se usou o <command>aptitude</command> ou o <command>apt-get</command> para instalar manualmente pacotes na &oldreleasename;, ele irá seguir esses pacotes que instalou manualmente e será capaz de marcar como obsoletos os pacotes obtidos apenas por dependências e que já não são necessários se o pacote foi removido. O <command>aptitude</command> e o <systemitem role="package">apt</systemitem>, ao contrário do <command>deborphan</command>, não irá marcar para remoção pacotes que você instalou manualmente, em oposição aos que foram instalados automaticamente através de dependências. Para remover os pacotes instalados automaticamente e que já não têm uso, execute:
ro: Dacă ați utilizat <command>aptitude</command> sau <command>apt-get</command> pentru a instala manual pachete în &oldreleasename;, acesta va reține faptul că au fost instalate manual și va putea marca drept învechite pachetele care au fost instalate doar ca dependențe și nu mai sunt necesare deoarece pachetele care aveau nevoie de ele au fost șterse. <command>aptitude</command> și <systemitem role="package">apt</systemitem>, spre deosebire de <command>deborphan</command>, nu va marca pentru ștergere pachetele pe care le-ați instalat manual, spre deosebire de cele instalate automat ca dependențe. Pentru a îndepărta pachetele instalate automat și care nu mai sunt folosite, executați:
sv: Om du har använt <command>aptitude</command> för att manuellt installera paket i &oldreleasename; kommer den att hålla kontroll på de paket som du manuellt installerat och kan markera de paket som har hämtats in via beroenden, vilka inte längre behövs om ett paket har tagits bort. <command>Aptitude</command> och <systemitem role="package">apt</systemitem>, till skillnad från <command>deborphan</command>, kommer inte markera de manuellt installerade paketen som föråldrade, i motsats till de som blev automatiskt installerade genom beroenden. Kör följande för att ta bort automatiskt installerade paket som inte längre används:

source: There are additional tools you can use to find obsolete packages such as <command>deborphan</command>, <command>debfoster</command> or <command>cruft</command>. <command>deborphan</command> is highly recommended, although it will (in default mode) only report obsolete libraries: packages in the <quote><literal>libs</literal></quote> or <quote><literal>oldlibs</literal></quote> sections that are not used by any other packages. Do not blindly remove the packages these tools present, especially if you are using aggressive non-default options that are prone to produce false positives. It is highly recommended that you manually review the packages suggested for removal (i.e. their contents, size and description) before you remove them.
fr: Il existe des outils supplémentaires que vous pouvez utiliser pour trouver les paquets obsolètes comme <command>deborphan</command>, <command>debfoster</command> ou <command>cruft</command>. <command>Deborphan</command> est hautement recommandé, bien qu'il n'indique (dans le mode par défaut) que les bibliothèques obsolètes : les paquets dans les sections <quote><literal>libs</literal></quote> ou <quote><literal>oldlibs</literal></quote> qui ne sont utilisés par aucun autre paquet. Ne supprimez pas aveuglément les paquets que ces outils présentent, particulièrement si vous utilisez des options non standard agressives, car ils sont susceptibles de produire des faux positifs. Il est hautement recommandé d'examiner manuellement les paquets suggérés à la suppression (c.-à-d. leurs contenu, taille et description) avant de les supprimer.
it: Vi sono diversi strumenti supplementari che possono essere utilizzati per trovare pacchetti obsoleti, come ad esempio <command>deborphan</command>, <command>debfoster</command> o <command>cruft</command>. <command>deborphan</command> è altamente raccomandato, malgrado riporti, in modalità predefinita, solo le librerie obsolete: i pacchetti nelle sezioni <quote><literal>libs</literal></quote> od <quote><literal>oldlibs</literal></quote> che non vengono più utilizzati da alcun pacchetto. Non si rimuovano alla cieca i pacchetti presentati dagli strumenti, soprattutto se si usano opzioni aggressive non predefinite che possono produrre dei falsi positivi. È altamente raccomandato controllare manualmente i pacchetti suggeriti per la rimozione (ossia il loro contenuto, la loro dimensione e la descrizione) prima di rimuoverli.
ja: 時代遅れのパッケージを見つけるのに使える追加ツールとしては、以下のものがあります―― <command>deborphan</command> や <command>debfoster</command>、<command>cruft</command>。<command>deborphan</command> を強くお勧めしますが、同ツールは (デフォルトモードでは) 時代遅れのライブラリ―― <quote><literal>libs</literal></quote> や <quote><literal>oldlibs</literal></quote> セクション内にあり、他のパッケージに使われていないパッケージ――しか報告しません。これらのツールが表示したパッケージをやみくもに削除しないでください。特に、誤検出しやすい非デフォルトの凶暴なオプションを使っている場合はなおさらです。実際に削除する前に、削除を提案されたパッケージ (の内容やサイズ、説明など) を手作業で調べなおすことを強くお勧めします。
ml: <command>deborphan</command>, <command>debfoster</command> or <command>cruft</command> പോലുള്ള മറ്റു അധിക ഉപകരണങ്ങള്‍ ഉപയോഗിച്ചും കാലഹരണപ്പെട്ട പൊതികള്‍ കണ്ടെത്താവുന്നതാണ്. <command>deborphan</command>ആജ്ഞയാണ് ശക്തിയായി ശുപാര്‍ശ ചെയ്യുന്നത്, തനതായ രീതിയില്‍ കാലഹരണപ്പെട്ട ഗ്രന്ഥാവലികളും <quote><literal>libs</literal></quote>ലെ അല്ലെങ്കില്‍ വേറൊരു പൊതികളും ഉപയോഗിക്കതെ കിടക്കുന്ന <quote><literal>oldlibs</literal></quote>ലെ ഭാഗങ്ങളും മാത്രമേ കാലഹരണപ്പെട്ടതായി പ്രസ്താവിക്കൂ. അബദ്ധമായ ഫലങ്ങള്‍ ഉണ്ടാക്കാന്‍ സാദ്ധ്യ‌‌‌തയുളള സഹജമല്ലാത്ത പരുക്കന്‍ ഐച്ഛികങ്ങള്‍ ഉപയോഗിക്കുന്നുണ്ടെങ്കില്‍ പ്രത്യേ‌‌കിച്ചും, ഈ ഉപകരണങ്ങള്‍ മുന്നോട്ട് വെയ്ക്കുന്ന പൊതികള്‍ കണ്ണടച്ച് നീക്കം ചെയ്യരുത്. അവ നീക്കം ചെയ്യുന്നതിന് മുമ്പായി, നീക്കം ചെയ്യാനായി നിര്‍ദ്ദേശിക്കപ്പെട്ട പൊതികളുടെ ഉള്ളടക്കം നിങ്ങള്‍ വ്യ‌‌ക്തിപരമായി പുന:പരിശോധിക്കാന്‍ ശക്തമായി ശുപാര്ശ ചെയ്യുന്നു.
pt: Existem ferramentas adicionais que pode utilizar para descobrir pacotes obsoletos tais como <command>deborphan</command>, <command>debfoster</command> ou <command>cruft</command>. O <command>deborphan</command> é fortemente recomendado, no entanto este irá (em modo predefinido) apenas relatar as bibliotecas obsoletas: pacotes nas secções <quote><literal>libs</literal></quote> ou <quote><literal>oldlibs</literal></quote> que não sejam utilizada por outros pacotes. Não remova cegamente os pacotes que estas ferramentas apresentam, especialmente se estiver a utilizar opções agressivas e não-predefinidas que são sujeitas à produção de falsos positivos. É altamente recomendável que reveja manualmente os pacotes sugeridos para remoção (por ex. o seu conteúdo, dimensão e descrição) antes de os remover.
ro: Există unelte adiționale pe care le puteți folosi pentru a detecta pachetele depășite, cum ar fi <command>deborphan</command>, <command>debfoster</command> sau <command>cruft</command>. <command>deborphan</command> este indicat, deși implicit va raporta doar bibliotecile depășite, adică pachetele din secțiunile <quote>libs</quote> sau <quote>oldlibs</quote> care nu sunt utilizate de alte pachete. Nu dezinstalați pachetele prezentate de aceste unelte fără a vă gândi bine, mai ales dacă folosiți opțiunile agresive, neimplicite, ce sunt susceptibile de a da rezultate eronate cu privire la starea pachetelor. Este indicat să analizați pachetele sugerate pentru dezinstalare (ex: conținutul, dimensiunea și descrierea) înainte de a le dezinstala.
sv: Det finns ytterligare verktyg som du kan använda för att hitta föråldrade paket, såsom <command>deborphan</command>, <command>debfoster</command> eller <command>cruft</command>. <command>deborphan</command> rekommenderas starkt, även om det (i standardläget) endast kommer rapportera om föråldrade bibliotek: paket i sektionerna <quote>libs</quote> eller <quote>oldlibs</quote> som inte används av några andra paket. Ta inte helt blint bort de paket som dessa verktyg presenterar, speciellt om du använder aggressiva ickestandardalternativ som är benägna att producera felaktigheter. Det rekommenderas starkt att du manuellt granskar paketen som föreslås för borttagning (alltså deras innehåll, storlek och beskrivning) innan du tar bort dem.

source: The <ulink url="&url-bts;">Debian Bug Tracking System</ulink> often provides additional information on why the package was removed. You should review both the archived bug reports for the package itself and the archived bug reports for the <ulink url="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&amp;archive=yes">ftp.debian.org pseudo-package</ulink>.
fr: Le <ulink url="&url-bts;">système de suivi des bogues de Debian</ulink> fournit souvent des informations complémentaires sur les raisons pour lesquelles un paquet a été retiré. Vous devriez consulter à la fois les comptes-rendus de bogue archivés pour le paquet lui-même et ceux du <ulink url="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&amp;archive=yes">pseudo-paquet ftp.debian.org</ulink>.
it: Il <ulink url="&url-bts;">Sistema di tracciamento dei bug (BTS) di Debian</ulink> fornisce spesso informazioni aggiuntive sul perché un determinato pacchetto è stato rimosso. Si dovrebbero visionare sia i rapporti per il pacchetto stesso, sia i rapporti archiviati dei bug per lo <ulink url="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&amp;archive=yes">pseudo-pacchetto ftp.debian.org</ulink>.
ja: <ulink url="&url-bts;">Debian バグ追跡システム</ulink>は、パッケージが削除された理由についての追加情報を提供してくれることがよくあります。そのパッケージ自体と <ulink url="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&#38;archive=yes">ftp.debian.org 擬似パッケージ</ulink>の両方の、アーカイブ化されたバグ報告を調べてください。
ml: <ulink url="&url-bts;">ഡെബിയന്റെ പിഴവ് കണ്ടെത്തല്‍ സംവിധാനം(Debian Bug Tracking System)</ulink> പലപ്പോഴും പൊതികള്‍ നീക്കം ചെയ്തതിന്റെ അധികവിവരണം തരാറുണ്ട്. പൊതിയുടെ സംഗ്രഹിക്കപ്പെട്ട പിഴവ് ശേഖരങ്ങളും <ulink url="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&amp;archive=yes">ftp.debian.org pseudo-package</ulink>ലെ പിഴവ് ശേഖരങ്ങളും രണ്ടും നിങ്ങള്‍ പരിശോധിച്ചിരിക്കണം.
pt: O <ulink url="&url-bts;">Debian Bug Tracking System</ulink> frequentemente fornece informação adicional sobre a razão da remoção do pacote. Deverá rever ambos os relatórios de erro do pacote e os relatórios de bugs arquivados para o <ulink url="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&amp;archive=yes">ftp.debian.org pseudo-package</ulink>.
ro: <ulink url="&url-bts;">Sistemul Debian de raportare a problemelor (Debian Bug Tracking System)</ulink> oferă deseori informații suplimentare despre motivele pentru care un pachet a fost eliminat. Ar trebui să analizați atât arhiva problemelor pentru pachetul în sine, cât și pentru <ulink url="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&amp;archive=yes">pseudo-pachetul ftp.debian.org</ulink>.
sv: <ulink url="&url-bts;">Debian Bug Tracking System</ulink> tillhandahåller ofta ytterligare information om varför paketet blev borttaget. Du bör granska både de arkiverade felrapporterna för själva paketet och de arkiverade felrapporterna för pseudopaketet på <ulink url="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&amp;archive=yes">ftp.debian.org</ulink>.
zh_tw: 在 <ulink url="&url-bts;">Debian 錯誤追蹤系統</ulink> 裡常常會提供了為什麼某個套件會被移掉的相關資訊。您可以使用該套件本身的錯誤回報資料庫，或是在 <ulink url="&url-bts;cgi-bin/pkgreport.cgi?pkg=ftp.debian.org&amp;archive=yes">ftp.debian.org pseudo-package</ulink> 裡的錯誤回報資料庫來重新檢視這些資訊。

source: The list of obsolete packages includes:
fr: La liste des paquets obsolètes comprend&nbsp;:
it: L'elenco dei pacchetti obsoleti comprende:
ja: 非推奨パッケージ (obsolete) の一覧:
pt: A lista de pacotes obsoletos inclui:
ro: Lista pachetelor depășite include:
sv: Lista med föråldrade paket inkluderar:

source: The <systemitem role="package">plone</systemitem> content management suite. This has been done on request by the developers to use the Unified Installer for Linux, which they consider their only supported deployment platform. The recommended tool for installing Plone on a &debian; system is the Unified Installer, available for download from <ulink url="http://plone.org/" />
fr: le système de gestion de contenu <systemitem role="package">plone</systemitem>. Ceci a été fait à la demande de développeurs qui préfèrent utiliser Unified Installer for Linux comme seule plate-forme de déploiement. Le moyen recommandé d'installer Plone sur un système &debian; est donc l'Unified Installer, disponible par téléchargement depuis <ulink url="http://plone.org/" /> ;
it: La suite di gestione dei contenuti <systemitem role="package">plone</systemitem>. Su richiesta da parte degli sviluppatori di usare lo Unified Installer per Linux perché ritenuto l'unica piattaforma di distribuzione supportata. Lo strumento per l'installazione di Plone su un sistema Debian è lo Unified Installer, scaricabile da <ulink url="http://plone.org/" />
ja: <systemitem role="package">plone</systemitem> コンテンツマネジメントシステム。Unified Installer for Linux を使ってほしい、という開発者の要求に従って行われました。Unified Installer for Linux は、開発者らが唯一サポートしているとみなされるデプロイメントプラットフォームです。&debian; システム上で Plone をインストールするのにお勧めのツールは、<ulink url="http://plone.org/" /> からダウンロードできる Unified Installer です。
pt: A suite de gestão de conteúdo <systemitem role="package">plone</systemitem>. Isto tem sido feito a pedido dos programadores para se usar o Instalador Unificado para Linux, o qual eles consideram a sua única plataforma de desenvolvimento suportada. A ferramenta recomendada para instalar o Plone num sistema &debian; é o Instalador Unificado, disponível para download em <ulink url="http://plone.org/" />
ro: Suita <systemitem role="package">plone</systemitem> de administrare a conținutului. Îndepărtarea a fost făcută la solicitarea dezvoltatorilor, pentru a se folosi Instalatorul unificat pentru Linux (eng. Unified Installer for Linux), unealtă pe care ei o consideră singura platforma de desfășurare. Unealta recomandată pentru a instala Plone pe sisteme &debian; este Instalatorul unificat (Unified Installer), disponibil pentru descărcat de la <ulink url="http://plone.org/" />
sv: Kontorssviten <systemitem role="package">plone</systemitem>. Detta har gjorts efter en förfrågan av utvecklarna av Unified Installer for Linux, vilken de anser vara deras enda platform med stöd. Rekomenderat verktyg för att installera Plone på ett &debian;-system är att använda Unified Installer som finns att hämta på <ulink url="http://plone.org/" />.

source: <systemitem role="package">nessus</systemitem>, the vulnerability scanning server and its associated libraries and other software. It has been deprecated in favor of the software provided by OpenVAS which includes <systemitem role="package">openvas-server</systemitem> and <systemitem role="package">openvas-client</systemitem>. As there is no automatic upgrade path you will have to install OpenVAS and manually move over your Nessus service configuration (users, certificates, etc.) to OpenVAS.
fr: <systemitem role="package">nessus</systemitem>, le serveur de scan de vulnérabilité système et ses bibliothèques associés, ainsi que quelques autres logiciels. Il a été rendu obsolète par les logiciels fournis par OpenVAS, comme par exemple <systemitem role="package">openvas-server</systemitem> et <systemitem role="package">openvas-client</systemitem>. Comme il n'y a pas de système de mise à niveau automatique à ce niveau, vous devrez installer OpenVAS et configurer vous-même le service Nessus (utilisateurs, certificats, etc.) à OpenVAS ;
it: <systemitem role="package">nessus</systemitem>, il server di scansione delle vulnerabilità e le relative librerie e altro software. È stato deprecato in favore del software fornito da OpenVAS che include <systemitem role="package">openvas-server</systemitem> e <systemitem role="package">openvas-client</systemitem>. Poiché non esiste una procedura d'aggiornamento automatica è necessario installare OpenVAS e migrare manualmente la configurazione del servizio Nessus (utenti, certificati, ecc.) su OpenVAS.
ja: <systemitem role="package">nessus</systemitem> 脆弱性スキャンサーバと関連のライブラリおよびその他のソフト。<systemitem role="package">openvas-server</systemitem> と <systemitem role="package">openvas-client</systemitem> を含む OpenVAS によって提供されるソフトウェアがあるため、非推奨 (deprecated) となりました。自動的にアップグレードする方法はないので、手動で OpenVAS をインストールして Nessus のサービス設定 (ユーザ、証明書など) を OpenVAS に移植する必要があります。
pt: <systemitem role="package">nessus</systemitem>, o servidor de sondagem de vulnerabilidades a as suas bibliotecas associadas e outro software. Foi descontinuado a favor do software disponibilizado pelo OpenVAS que inclui o <systemitem role="package">openvas-server</systemitem> e o <systemitem role="package">openvas-client</systemitem>. Como não há nenhum caminho de actualização automático, você terá que instalar o OpenVAS e mover manualmente a configuração do seu serviço Nessus (utilizadores, certificados, etc.) para o OpenVAS.
ro: <systemitem role="package">nessus</systemitem>, serverul pentru scanat vulnerabilități, bibliotecile asociate și alte aplicații conexe. A fost învechi în favoarea aplicațiilor oferite de OpenVAS care include <systemitem role="package">openvas-server</systemitem> și <systemitem role="package">openvas-client</systemitem>. Deoarece nu este o cale de actualizare automată va trebui să instalați OpenVAS și să mutați toate configurațiile Nessus (utilizatori, certificate, etc.) manual către OpenVAS.
sv: <systemitem role="package">nessus</systemitem>, säkerhetssökningsservern och dess bibliotek och andra mjukvaror. Den har varit under utfasning till förmån för OpenVAS som inkluderar paketen <systemitem role="package">openvas-server</systemitem> och <systemitem role="package">openvas-client</systemitem>. Eftersom det inte finns någon väg att uppgradera måste du installera OpenVAS och manuellt flytta dina inställningar för Nessustjänsten (användare, certifikat m.m.) till OpenVAS.
