Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: If you are logging the upgrade as described in <xref linkend="upgradingpackages"/>, please, use again <command>script</command> to log the next steps of the upgrade after the reboot in order to log the result of the actions described in <xref linkend="upgrading-full"/>.
it: Se si sta registrando l'aggiornamento come descritto in <xref linkend="upgradingpackages"/>, si raccomanda di continuare ad usare <command>script</command> per registrare le fasi dell'aggiornamento successive al riavvio in modo da avere la registrazione dei risultati delle azioni descritte in <xref linkend="upgrading-full"/>.
ro: Dacă înregistrați actualizarea așa cum este descris în <xref linkend="upgradingpackages"/> vă rugăm folosiți din nou <command>script</command> pentru a înregistra și etapele actualizării de după pornire, cu scopul de a avea o înregistrare completă pașilor descriși în <xref linkend="upgrading-full"/>.

source: Evolution
ro: Clientul Evolution

source: You should <emphasis>not</emphasis> upgrade using <command>telnet</command>, <command>rlogin</command>, <command>rsh</command>, or from an X session managed by <command>xdm</command>, <command>gdm</command> or <command>kdm</command> etc on the machine you are upgrading. That is because each of those services may well be terminated during the upgrade, which can result in an <emphasis>inaccessible</emphasis> system that is only half-upgraded.
fr: Important&nbsp;: vous <emphasis>ne devez pas</emphasis> effectuer la mise à niveau en utilisant <command>telnet</command>, <command>rlogin</command>, <command>rsh</command>, ou depuis une session X gérée par <command>gdm</command>, <command>kdm</command>, etc. sur la machine que vous mettez à niveau. En effet, chacun de ces services pourrait être interrompu pendant la mise à niveau, ce qui peut rendre <emphasis>inaccessible</emphasis> un système à moitié mis à niveau.
ja: <command>telnet</command>、<command>rlogin</command>、<command>rsh</command> を用いてアップグレードをしては<emphasis>いけません</emphasis>。アップグレードするマシンの <command>xdm</command>、<command>gdm</command>、<command>kdm</command> などが管理している X セッションからのアップグレードも行うべきではありません。これらのサービスはアップグレードの最中に切断されてしまう可能性が高く、そうなるとアップグレード途中のシステムへの<emphasis>接続が不可能になってしまう</emphasis>からです。
ml: നിങ്ങള്‍ <command>telnet</command>, <command>rlogin</command>, <command>rsh</command>, അല്ലെങ്കില്‍ നിങ്ങള്‍ നവീകരിയ്ക്കുന്ന മഷീനിലുള്ള <command>xdm</command>, <command>gdm</command> or <command>kdm</command> തുടങ്ങിയവ കൈകാര്യം ചെയ്യുന്നൊരു എക്സ് പ്രവര്‍ത്തനവേളയില്‍ വച്ചോ നിങ്ങള്‍ നവീകരണം <emphasis>നടത്തരുതു്</emphasis>. ഈ പറഞ്ഞ ഓരോ സേവനങ്ങളും നവീകരണത്തിനിടയില്‍‌ നിന്നു പോകുകയും നിങ്ങളുടെ സിസ്റ്റം പകുതി നവീകരിച്ചതും <emphasis>കയറാന്‍ സാധ്യമല്ലാത്തതുമായ</emphasis> അവസ്ഥയില്‍ വരാനും സാധ്യതയുണ്ടു് എന്നതാണു് അതിനു് കാരണം.
pt: Você <emphasis>Não</emphasis> deve actualizar usando <command>telnet</command>, <command>rlogin</command>, <command>rsh</command>, ou a partir de uma sessão X gerida pelo <command>xdm</command>, pelo <command>gdm</command> ou pelo <command>kdm</command> etc na máquina que estiver a actualizar. Isto porque cada um desses serviços podem ser terminados durante esta actualização, o que pode resultar num sistema <emphasis>inacessível</emphasis> que ficou apenas meio actualizado.

source: or similar. Do not put the typescript file in a temporary directory such as <filename>/tmp</filename> or <filename>/var/tmp</filename> (files in those directories may be deleted during the upgrade or during any restart).
fr: ou quelque chose d'équivalent. Ne mettez pas le fichier d'enregistrement dans un répertoire temporaire tel que <filename>/tmp</filename> ou <filename>/var/tmp</filename> (les fichiers de ces répertoires peuvent être détruits pendant la mise à niveau ou pendant un redémarrage).
ja: typescript ファイルは <filename>/tmp</filename> や <filename>/var/tmp</filename> のような一時ディレクトリには置かないでください (これらのディレクトリ内のファイルはアップグレードや再起動の際に削除されることがありますから)。
ml: ടൈപ്പ്സ്ക്രിപ്റ്റ് ഫയല്‍ <filename>/tmp</filename> അല്ലെങ്കില്‍ <filename>/var/tmp</filename> പോലൊരു താത്കാലിക തട്ടില്‍ വയ്ക്കരുതു് (ഈ തട്ടില്‍ വച്ച ഫയലുകള്‍ നവീകരണത്തിനിടയിലോ വീണ്ടും തുടങ്ങുന്നതിനിടയിലോ നീക്കം ചെയ്യാന്‍ സാധ്യതയുണ്ടു്).
pt: ou semelhante. Não coloque o ficheiro transcrito num directório temporário como <filename>/tmp</filename> ou <filename>/var/tmp</filename> (os ficheiros nesses directórios podem ser apagados durante a actualização ou durante qualquer reiniciação).
zh_tw: 或類似的指令。請不要把記錄檔放在像是 <filename>/tmp</filename> 或 <filename>/var/tmp</filename> 之類的暫存目錄下（這些目錄中的檔案可能會在升級的過程中或在重新開機時被清除掉）。

source: # cp -ax /var/cache/apt/archives /media/usbkey/
fr: # cp -ax /var/cache/apt/archives /media/cleusb/

source: # mount --bind /media/usbkey/archives /var/cache/apt/archives
fr: # mount --bind /media/cleusb/archives /var/cache/apt/archives

source: # umount /media/usbkey/archives
fr: # umount /media/cleusb/archives

source: Once you have upgraded both the kernel and <systemitem role="package">udev</systemitem> the system should be rebooted.
fr: Une fois le noyau et <systemitem role="package">udev</systemitem> mis à niveau, le système doit être redémarré.
ja: 一旦カーネルと <systemitem role="package">udev</systemitem> の両方をアップグレードし終わったら、システムを再起動してください。
pt: Após ter actualizado ambos o kernel e o <systemitem role="package">udev</systemitem> o sistema deve ser reiniciado.

source: # kopt=root=LABEL=rootfilesys ro
fr: # kopt=root=LABEL=systemeracine ro

source: LABEL=rootfilesys / ext3 defaults,errors=remount-ro 0 1
fr: LABEL=systemeracine / ext3 defaults,errors=remount-ro 0 1

source: Upgrades from previous releases
ml: പഴയ പതിപ്പില്‍ നിന്നും നവീകരിക്കുക
zh_tw: 從先前的發行版進行升級

source: The main things you'll want to back up are the contents of <filename>/etc</filename>, <filename>/var/lib/dpkg</filename>, <filename>/var/lib/aptitude/pkgstates</filename> and the output of <literal>dpkg --get-selections "*"</literal> (the quotes are important).
ml: നിങ്ങള്‍ക്കു് കരുതല്‍ പകര്‍പ്പെടുക്കേണ്ടി വരുന്ന പ്രധാന സംഗതികള്‍ <filename>/etc</filename>, <filename>/var/lib/dpkg</filename>, <filename>/var/lib/aptitude/pkgstates</filename> എന്നിവയുടെ ഉള്ളടക്കവും <literal>dpkg --get-selections "*"</literal> (ക്വോട്ടുകള്‍ പ്രധാനമാണു്) എന്നതിന്റെ ഫലവുമാണു്.

source: Make sure you are on a suitable kernel
ml: ചേര്‍ന്നൊരു കെര്‍ണലാണുപയോഗിയ്ക്കുന്നതെന്നുറപ്പാക്കുക

source: &releasename;'s version of <systemitem role="package">glibc</systemitem> will not work with kernels older than <literal>2.6.8</literal> on any architecture and some architectures have higher requirements. We strongly recommend that you upgrade to and test an &oldreleasename; <literal>2.6.18</literal> or <literal>2.6.24</literal> kernel or a custom kernel of at least version <literal>2.6.18</literal> before beginning the upgrade process.
ml: &releasename; യിലെ <systemitem role="package">glibc</systemitem> യുടെ പതിപ്പു് <literal>2.6.8</literal> നെക്കാള്‍ പഴയ കെര്‍ണലുമായി ഒരു വാസ്തുവിദ്യയിലും പ്രവര്‍ത്തിയ്ക്കില്ല. ചില വാസ്തുവിദ്യകള്‍ക്കു് ഇതിലും ഉയര്‍ന്നതാവശ്യമുണ്ടു്.

source: You will probably have to do a kernel upgrade when upgrading to &releasename;, so a reboot will normally be necessary. Typically, this will be done after the upgrade is finished.
ml: &releasename; യിലേയ്ക്കു് കയറുമ്പോള്‍ നിങ്ങള്‍ക്കു് കെര്‍ണല്‍ പുതുക്കേണ്ടി വരാനുള്ള സാധ്യതയുള്ളതിനാല്‍ സാധാരണയായി ഒരു റീബൂട്ട് ആവശ്യമാണു്. പൊതുവെ ഇതു് നവീകരണം കഴിഞ്ഞ ശേഷമാണു് ചെയ്യാറു്.
zh_tw: 在升級至 &releasename; 的同時，您大概也必須進行 Kernel 的升級。因此重新開機通常是無可避免的。一般而言，這將會在升級完畢後進行。

source: Prepare initramfs for <acronym>LILO</acronym><indexterm><primary>LILO</primary></indexterm>
ml: <acronym>ലിലൊ</acronym> യ്ക്കുള്ള initramfs തയ്യാറാക്കുക<indexterm><primary>ലിലൊ</primary></indexterm>
zh_tw: <acronym>LILO</acronym><indexterm><primary>LILO</primary></indexterm> 專用的 initramfs

source: Users using the <acronym>LILO</acronym> bootloader should note that the default settings for <systemitem role="package">initramfs-tools</systemitem> now generate an initramfs that is too large for <acronym>LILO</acronym> to load. Such users should either switch to <systemitem role="package">grub</systemitem>, or edit the file <filename>/etc/initramfs-tools/initramfs.conf</filename>, changing the line
ml: <systemitem role="package">initramfs-tools</systemitem> ഇപ്പോള്‍ സൃഷ്ടിയ്ക്കുന്ന initramfs <acronym>ലിലോ</acronym>യ്ക്കു് എടുക്കാവുന്നതിനേക്കാളും വളരെ വലുതാണു് എന്നു് <acronym>ലിലോ</acronym> ബൂട്ട്‌ലോഡര്‍ ഉപയോഗിയ്ക്കുന്നവര്‍ ഓര്‍ക്കണം. അങ്ങനെയുള്ളവര്‍ <systemitem role="package">grub</systemitem> ലേയ്ക്കു് മാറുകയോ <filename>/etc/initramfs-tools/initramfs.conf</filename> എന്ന ഫയല്‍ തിരുത്തി, താഴെ പറഞ്ഞ വരി മാറ്റണം
zh_tw: 使用 <acronym>LILO</acronym> 開機程式的使用者應該要注意到，<systemitem role="package">initramfs-tools</systemitem> 的預設值會建立一個大到 <acronym>LILO</acronym> 無法載入的 initramfs。因此，這些使用者應該要替而使用 <systemitem role="package">grub</systemitem>，或編輯 <filename>/etc/initramfs-tools/initramfs.conf</filename>，並將

source: to read
ml: വായിക്കാനുള്ളതു
zh_tw: 修改為

source: Note, however, that doing this will cause <systemitem role="package">initramfs-tools</systemitem> to install onto the initramfs only those modules that are required for the particular hardware that it is being run on. If you want to generate boot media that will work on more hardware than just the machine you're generating it on, you should leave the line as
ml: എന്നിരുന്നാലും ഇങ്ങനെ ചെയ്യുന്നത് <systemitem role="package">initramfs-tools</systemitem> പ്രവര്‍ത്തിയ്ക്കുന്ന വാസ്തുവിദ്യയ്ക്കുള്ള ഭാഗങ്ങള്‍ മാത്രം initramfs ലേയ്ക്ക് ഇന്‍സ്റ്റോള്‍ ചെയ്യുന്നതിന് കാരണമാകും; നിങ്ങള്‍ക്ക് സൃഷ്ടിയ്ക്കുന്ന വാസ്തുവിദ്യയേക്കാളും കൂടുതല്‍ ഹാര്‍ഡ്‌വെയറില്‍ പ്രവര്‍ത്തിയ്ക്കുന്ന ബൂട്ട് മാദ്ധ്യ‌‌മം സൃഷ്ടിയ്ക്കണമെങ്കില്‍ നിങ്ങള്‍ സജ്ജീകരണം താഴെ പറയുന്ന പോലെ വയ്ക്കുകയും

source: and make sure you do not use <acronym>LILO</acronym>.
ml: <acronym>ലിലോ</acronym> ഉപയോഗിയ്ക്കുന്നില്ലെന്നു് ഉറപ്പുവരുത്തുകയും വേണം.
zh_tw: 並確認您不是使用 <acronym>LILO</acronym>。

source: The <quote>hold</quote> package state for <command>aptitude</command> can be changed using:
ml: <command>aptitude</command> നുള്ള പൊതിയുടെ <quote>തടഞ്ഞുവച്ച (hold)</quote>അവസ്ഥ മാറ്റാന്‍ താഴെ പറയുന്ന ആജ്ഞ ഉപയോഗിയ്ക്കാം:

source: Replace <literal>hold</literal> with <literal>unhold</literal> to unset the <quote>hold</quote> state.
ml: <literal>hold</literal> നു് പകരം <literal>unhold</literal> ഉപയോഗിച്ചു് <quote>hold</quote> അവസ്ഥ ഇല്ലാതാക്കാം.

source: Using <literal>backports.org</literal> packages
ml: <literal>backports.org</literal> പൊതികള്‍ ഉപയോഗിയ്ക്കുന്നതു്

source: <literal>backports.org</literal> is a semi-official repository provided by &debian; developers, which provides newer packages for the stable release, based on a rebuild from the packages from the <quote>testing</quote> archive.
ml: സ്റ്റേബിള്‍ ശേഖരത്തിനു് വേണ്ടി <quote>ടെസ്റ്റിങ്ങ്</quote> ശേഖരത്തില്‍ നിന്നും വിണ്ടും നിര്‍മ്മിച്ച പുതിയ പൊതികള്‍ നല്‍കുന്ന &debian; രചയിതാക്കള്‍ നല്‍കുന്ന പാതി-ഔദ്യോഗികമായ ശേഖരമാണു് <literal>backports.org</literal>.

source: The <literal>backports.org</literal> repository mainly contains packages from <quote>testing</quote>, with reduced version numbers so that the upgrade path from &oldreleasename; backports to &releasename; still works. However, there are a few backports which are made from unstable: security updates, plus the following exceptions: Firefox, the Linux kernel, OpenOffice.org, and X.Org.
ml: <quote>testing</quote>ല്‍നിന്നുള്ള ചുരുക്കിയ വെര്‍ഷന്‍ നമ്പറുകളോടുകൂടിയ പൊതികളാണ് <literal>backports.org</literal> ശേഖരത്തില്‍ പ്രധാനമായും ഉള്ളത്; അതുകൊണ്ട് &oldreleasename;backports ല്‍ നിന്ന് &releasename;ലേക്കുള്ള പുതുക്കല്‍ മാര്ഗ്ഗം ഇപ്പോഴും സജീവമാണ്. എങ്ങനെയായാലും അസ്ഥിരമായ സുരക്ഷാപുതുക്കലുകള്‍, പിന്നെ ഒഴിവാക്കാവുന്ന താഴെപ്പറയുന്നവ എന്നിവയില്‍നിന്ന് സൃഷ്ടിക്കപ്പെട്ട ചില ചില്ലറ backports ഉണ്ട്: ഫയര്‍ഫോക്സ്, ലീനക്സ് കേര്‍ണല്‍, ഓപ്പണ്‍‌ഓഫീസ്.ഓര്ഗ്, പിന്നെ എക്സ്.ഓര്ഗ്ഗും.

source: If you do not use one of these exceptions, you can safely upgrade to &releasename;. If you use one of these exceptions, set the <literal>Pin-Priority</literal> (see <citerefentry> <refentrytitle>apt_preferences</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>) temporarily to <literal>1001</literal> for all packages from &releasename;, and you should be able to do a safe dist-upgrade too. See the <ulink url="http://backports.org/dokuwiki/doku.php?id=faq">backports FAQ</ulink>.
ml: ഇവയിലൊന്നു് നിങ്ങള്‍ ഉപയോഗിയ്ക്കുന്നില്ലെങ്കില്‍ നിങ്ങള്‍ക്കു് സുരക്ഷിതമായി &releasename; യിലേയ്ക്കു് കയറാം. നിങ്ങള്‍ ഈ പറഞ്ഞവയിലൊരെണ്ണം ഉപയോഗിയ്ക്കുന്നെങ്കില്‍ &releasename; യില്‍ നിന്നുള്ള പൊതികള്‍ക്കു് <literal>1001</literal> എന്ന <literal>Pin-Priority</literal> (<citerefentry> <refentrytitle>apt_preferences</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> നോക്കുക) താത്കാലികമായി വയ്ക്കുകയാണെങ്കില്‍ സുരക്ഷിതമായി dist-upgrade ചെയ്യാന്‍‌ നിങ്ങള്‍ക്കു് സാധിയ്ക്കും. <ulink url="http://backports.org/dokuwiki/doku.php?id=faq">backports ചോദ്യോത്തരങ്ങള്‍</ulink> കാണുക.

source: Manually unmarking packages
ml: പൊതികളെ തന്നത്താന്‍ ഒഴിവാക്കുന്നതു്
zh_tw: 手動將套件解除標註

source: To prevent <command>aptitude</command> from removing some packages that were pulled in through dependencies, you need to manually unmark them as <emphasis>auto</emphasis> packages. This includes OpenOffice and Vim for desktop installs:
ml: ആശ്രിതത്വം കാരണം ഉള്ളിലേക്ക് വലിച്ചെടുത്ത ചില പൊതികള്‍ <command>aptitude</command> നീക്കം ചെയ്യാതിരിക്കണമെങ്കില്‍ അവ കൈയോടെ <emphasis>auto</emphasis>പൊതികളെന്ന് ചിഹ്നപ്പെടുത്തേണ്ടിയിരിക്കുന്നു. പണിയിട പ്രതിഷ്ഠാനത്തിലെ വിം ഓപ്പണ്‍ ഓഫീസ്‌ ഇവ അതില്‍ പെടുന്നു.
zh_tw: 為了避免 <command>aptitude</command> 將某些因為相依性而安裝進來的套件移除掉，您必須手動將這些套件解除標註為<emphasis>自動</emphasis>套件。在安裝桌面時，這包含了 OpenOffice 和 Vim：

source: And 2.6 kernel images if you have installed them using a kernel metapackage:
ml: നിങ്ങളൊരു കെര്‍ണല്‍ മെറ്റാപാക്കേജുപയോഗിച്ചിട്ടുണ്ടെങ്കില്‍ 2.6 കെര്‍ണല്‍ ഇമേജുകളും:
zh_tw: 以及 2.6 Kernel 影像檔，如果您是使用 Kernel 虛擬套件來安裝的話：

source: You can review which packages are marked as <emphasis>auto</emphasis> in aptitude by running:
ml: aptitude ല്‍ <emphasis>auto</emphasis> എന്നടയാളപ്പെടുത്തിയിരിയ്ക്കുന്നതേതെല്ലാമെന്നു് താഴെ പറയുന്ന പോലെ പ്രവര്‍ത്തിപ്പിച്ചാലറിയാം:
zh_tw: 您可以藉由以下指令來重新檢視有哪些套件是被標註成<emphasis>自動</emphasis>的：

source: # aptitude search '~i~M'
ml: # aptitude search '~i~M <replaceable>package_name</replaceable>'

source: You might need to add an <acronym>GPG</acronym> checking exception for <acronym>DVD</acronym>s and <acronym>CD-ROM</acronym>s. Add the following line to <filename>/etc/apt/apt.conf</filename>, if it's not already in <filename>/etc/apt/apt.conf.d/00trustcdrom</filename>:
ml: <acronym>ഡിവിഡി</acronym>കള്‍ക്കും <acronym>സിഡിറോം</acronym>കള്‍ക്കുമുള്ള വ്യ‌‌ത്യ‌സ്ഥതകള്‍ പരിശോധിച്ച് <acronym>ജിപിജി</acronym>ക്കുള്ള ഒരു ചുരുക്കപ്പേര് ചേര്ക്കണ്ടതാണ്. <filename>/etc/apt/apt.conf.d/00trustcdrom</filename>ഫയലില്‍ ഇപ്പോഴതില്ലെങ്കില്‍ താഴെപ്പറയുന്ന വരി <filename>/etc/apt/apt.conf</filename>നോട് ചേര്ക്കുക:

source: This does not work with <acronym>DVD</acronym>/<acronym>CD-ROM</acronym> image files, however.
ml: എന്നാലും, ഇതു് <acronym>ഡിവിഡി</acronym>/<acronym>സിഡി-റോം</acronym> ഇമേജ് ഫയലുകള്‍ക്കു് ബാധകമല്ല.

source: The recommended way to upgrade from previous &debian; releases is to use the package management tool <command>aptitude</command>. This program makes safer decisions about package installations than running <command>apt-get</command> directly.
ml: മുമ്പത്തെ &debian; പതിപ്പില്‍ നിന്നും കയറാന്‍ ശുപാര്‍ശ ചെയ്തിരിയ്ക്കുന്നതു് പൊതികളെ കൈകാര്യം ചെയ്യുന്നതിനുള്ള ഉപകരണമായ <command>aptitude</command> ഉപയോഗിയ്ക്കാനാണു്. ഇതു് <command>apt-get</command> നേരിട്ടു് പ്രവര്‍ത്തിപ്പിയ്ക്കുന്നതിനേക്കാള്‍ സുരക്ഷിതമായി പൊതികളുടെ ഇന്‍സ്റ്റലേഷനെക്കുറിച്ചുള്ള തീരുമാനങ്ങള്‍ എടുക്കും.
zh_tw: 若要從舊有的 &debian; 發行套件進行升級時，建議的方法是使用套件管理工具 <command>aptitude</command>。這個程式在套件安裝上會比起直接執行 <command>apt-get</command> 來得安全。

source: Source lines for a CD-ROM will often refer to <quote><literal>unstable</literal></quote>; although this may be confusing, you should <emphasis>not</emphasis> change it.
ml: സിഡി-റോമിനുള്ള വരികള്‍ പലപ്പോഴും <quote><literal>unstable</literal></quote> എന്നു് സൂചിപ്പിയ്ക്കാറുണ്ടു്; ഇതു് ആശയക്കുഴപ്പമുണ്ടാക്കുമെങ്കിലും നിങ്ങളതു് <emphasis>മാറ്റരുതു്</emphasis>.

source: The typescript will also allow you to review information that has scrolled off-screen. Just switch to VT2 (using <keycombo action='simul'><keycap>Alt</keycap><keycap>F2</keycap></keycombo>) and, after logging in, use <literal>less -R ~root/upgrade-&releasename;.script</literal> to view the file.
ml: യവനികയില്‍ ‍നിന്ന് മാറിക്കഴിഞ്ഞാലും വിവരങ്ങളുടെ പുന:പരിശോധനക്ക് അച്ചടി അക്ഷരങ്ങള്‍ (typescript) നിങ്ങളെ അനുവദിക്കുന്നു. <keycombo action='simul'><keycap>Alt</keycap><keycap>F2</keycap></keycombo> ഉപയോഗിച്ച് VT2വിലേക്കിടുകയേ വേണ്ടൂ, എന്നിട്ട് അകത്തുകടന്ന് <literal>less -R ~root/upgrade-&releasename;.script</literal> ഉപയോഗിച്ച് ഫയല്‍ വീക്ഷിക്കാം.

source: Running this the first time new sources are updated will print out some warnings related to the availability of the sources. These warnings are harmless and will not appear if you rerun the command again.
ml: പുതിയ ഉറവിടങ്ങള്‍ ചേര്‍ത്തതിനു് ശേഷം ആദ്യമായി ഇതു് പ്രവര്‍ത്തിപ്പിയ്ക്കുമ്പോള്‍ ഉറവിടങ്ങളുടെ ലഭ്യതയെക്കുറിച്ചു് മുന്നറിയിപ്പുകള്‍ എഴുതിക്കാണിച്ചേയ്ക്കാം. ഈ മുന്നറിയിപ്പുകള്‍ പ്രശ്നമില്ലാത്തതും വീണ്ടും ഈ ആജ്ഞകള്‍ പ്രവര്‍ത്തിപ്പിച്ചാല്‍ വരാത്തതുമാണു്.
zh_tw: 首次執行時，新的來源若有更新將會顯示一些關於可取得來源之警告訊息。這些警告訊息是無關緊要的，且如果您再次執行該指令，這些訊息將不會再出現。

source: You have to make sure before upgrading your system that you have sufficient hard disk space when you start the full system upgrade described in <xref linkend="upgrading-other"/>. First, any package needed for installation that is fetched from the network is stored in <filename>/var/cache/apt/archives</filename> (and the <filename>partial/</filename> subdirectory, during download), so you must make sure you have enough space on the file system partition that holds <filename>/var/</filename> to temporarily download the packages that will be installed in your system. After the download, you will probably need more space in other file system partitions in order to both install upgraded packages (which might contain bigger binaries or more data) and new packages that will be pulled in for the upgrade. If your system does not have sufficient space you might end up with an incomplete upgrade that might be difficult to recover from.
ml: <xref linkend="upgrading-other"/>.ല്‍ വിവരിച്ച പോലെ മുഴുവന്‍ വ്യ‌‌വസ്ഥിതിയും പുതുക്കാന്‍ തുടങ്ങുമ്പോള്‍ നിങ്ങളുടെ ഹാര്‍ഡ് ഡിസ്കില്‍ മതിയായ സ്ഥലമുണ്ടെന്ന് മുന്‍കൂട്ടി ഉറപ്പ് വരുത്തിയിരിക്കണം.

source: Both <command>aptitude</command> and <systemitem role="package">apt</systemitem> will show you detailed information of the disk space needed for the installation. Before executing the upgrade, you can see this estimate by running:
ml: <command>aptitude</command> ഉം <systemitem role="package">apt</systemitem> ഇന്‍സ്റ്റലേഷനു് വേണ്ട ഡിസ്ക്ക് സ്ഥലത്തെപ്പറ്റി വിശദമായ വിവരം നിങ്ങളെ കാണിയ്ക്കും. നവീകരണം തുടങ്ങുന്നതിനു് മുമ്പു് ഇതു് കാണാന്‍ നിങ്ങള്‍ താഴെ പറയുന്നതു് പ്രവര്‍ത്തിപ്പിയ്ക്കാം:

source: If you do not have enough space for the upgrade, make sure you free up space beforehand. You can:
ml: നിങ്ങള്‍ക്കു് നവീകരണത്തിനു് വേണ്ടത്ര സ്ഥലമില്ലെങ്കില്‍ മുമ്പെ തന്നെ സ്ഥലം സ്വതന്ത്രമാക്കാന്‍ മറക്കരുതു്. നിങ്ങള്‍ക്കു് താഴെ പറയും പോലെ ചെയ്യാം:
zh_tw: 如果您沒有足夠的空間可供升級，請在事先就清出磁碟空間。您可以：

source: Remove packages that have been previously downloaded for installation (at <filename>/var/cache/apt/archives</filename>). Cleaning up the package cache by running <command>apt-get clean</command> or <command>aptitude clean</command> will remove all previously downloaded package files.
ml: നേരത്തെ ഇന്‍സ്റ്റോള്‍ ചെയ്യാന്‍ വേണ്ടി (<filename>/var/cache/apt/archives</filename> ല്‍) എടുത്തു് വച്ചിരിയ്ക്കുന്ന പൊതികള്‍ നീക്കം ചെയ്യുക. <command>apt-get clean</command> അല്ലെങ്കില്‍ <command>aptitude clean</command> പ്രവര്‍ത്തിപ്പിച്ചു് നേരത്തെ എടുത്തുവച്ച പൊതികള്‍ നീക്കം ചെയ്യാം.

source: You can list packages that take up most of the disk space with <systemitem role="package">aptitude</systemitem>. Start <command>aptitude</command> into <emphasis>visual mode</emphasis>, select <menuchoice><guimenu>Views</guimenu><guimenuitem>New Flat Package List</guimenuitem></menuchoice> (this menu entry is available only after etch version), press <keycap>l</keycap> and enter <literal>~i</literal>, press <keycap>S</keycap> and enter <literal>~installsize</literal>, then it will give you nice list to work with. Doing this after upgrading <systemitem role="package">aptitude</systemitem> should give you access to this new feature.
ml: <systemitem role="package">aptitude</systemitem> ഉപയോഗിച്ച് ഡിസ്കിലെ കൂടുതല്‍ സ്ഥലം ഉപയോഗപ്പെടുത്തുന്ന പൊതികള്‍ കണ്ടെത്താം. <emphasis>visual mode</emphasis>ല്‍<command>aptitude</command>കൊടുത്ത് തുടങ്ങുക,<menuchoice><guimenu>Views</guimenu><guimenuitem>New Flat Package List</guimenuitem></menuchoice> തെരഞ്ഞെടുക്കുക, (എച്ച് വെര്‍ഷനു ശേഷം മാത്രമേ വിഭവങ്ങളിലെ ഈ ഇനം ലഭ്യ‌‌മാകൂ) <keycap>l</keycap>അമര്‍ത്തുക,<literal>~i</literal>അടിച്ചുചേര്‍ക്കുക, <keycap>S</keycap> അമര്‍ത്തുക, <literal>~installsize</literal>എന്ന് ചേര്ക്കുക, ഇത് നിങ്ങള്ക്ക് പ്രവര്ത്തിക്കാനുള്ള ഹൃദ്യ‌‌മായ ഒരു പട്ടിക തയ്യാറാക്കിത്തരും. പുതുക്കലിന് ശേഷം ഇത് ചെയ്യുന്നത് <systemitem role="package">aptitude</systemitem> പുതിയ ഭാവത്തിലേക്ക് സമീപിക്കാന്‍ വഴിയൊരുക്കും.

source: Upgrade apt and/or aptitude first
ml: ആദ്യമായി apt ഉം/ഓ aptitude ഉം/ഓ നവീകരിയ്ക്കുക

source: Several bug reports have shown that the versions of the <systemitem role="package">aptitude</systemitem> and <systemitem role="package">apt</systemitem> packages in etch are often unable to handle the upgrade to &releasename;. In &releasename;, <systemitem role="package">apt</systemitem> is better at dealing with complex chains of packages requiring immediate configuration and <systemitem role="package">aptitude</systemitem> is smarter at searching for solutions to satisfy the dependencies. These two features are heavily involved during the dist-upgrade to &releasename;, so it is necessary to upgrade these two packages before upgrading anything else. For <systemitem role="package">apt</systemitem>, run:
ml: <systemitem role="package">aptitude</systemitem> ന്റേയും <systemitem role="package">apt</systemitem> ന്റേയും വെര്‍ഷനുകള്‍ എച്ചിലെ പൊതിക‍ളുടെ &releasename;ലേക്കുള്ള ചുവട് മാറ്റം കൈകാര്യംചെയ്യാന്‍ അശക്തമാണെന്ന് പല ശല്യ‌‌പ്രസ്താവനകളും (bugreport) കാണിക്കുന്നുണ്ട്. &releasename;ല്‍ <systemitem role="package">apt</systemitem>ഉടനടി ക്രമീകരണം ആവശ്യ‌‌മുള്ള പൊതികളുടെ നൂലാമാലകളുമായി ഇടപെടാന്‍ ത്രാണിയുള്ളതും <systemitem role="package">aptitude</systemitem>ആശ്രിതത്വ പ്രശ്നങ്ങള്‍ ഫലപ്രദമായി പരിഹരിക്കാന്‍വേണ്ടി അന്വേഷണചാതുര്യ‌‌‌മുള്ളതുമാണ്. ഈ രണ്ടു സവിശേഷതകളും &releasename;ലേക്കുള്ള അധിരോഹണ(upgrade) വ്യ‌‌വസ്ഥയില്‍ ശക്തമായി ഉള്‍ക്കൊള്ളിച്ചിട്ടുണ്ട്. അതുകൊണ്ട് മറ്റുള്ള പൊതികളുടെ അധിരോഹണത്തിന് മുമ്പേ ഈ രണ്ടു പൊതികളും അധിരോഹണം നടത്തേണ്ടതുണ്ട്. <systemitem role="package">apt</systemitem>നുവേണ്ടി പ്രവര്ത്തിപ്പിക്കുക:

source: and for <systemitem role="package">aptitude</systemitem> (if you have it installed) run:
ml: നിങ്ങള്‍ <systemitem role="package">aptitude</systemitem> ഇന്‍സ്റ്റോള്‍ ചെയ്തിട്ടുണ്ടെങ്കില്‍ താഴെ പറയും പോലെ പ്രവര്‍ത്തിപ്പിയ്ക്കുക:
