Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: To perform this review, launch <command>aptitude</command> in <quote>visual mode</quote> and press <keycap>g</keycap> (<quote>Go</quote>). If it shows any actions, you should review them and either fix them or implement the suggested actions. If no actions are suggested you will be presented with a message saying <quote>No packages are scheduled to be installed, removed, or upgraded</quote>.
fr: Pour faire cette vérification, vous devez lancer <command>aptitude</command> en <quote>mode interactif</quote> et appuyer sur <keycap>g</keycap> (<quote>Go</quote>). S'il affiche une ou plusieurs action(s), vous devez les contrôler et les corriger ou les mettre en œuvre. Si aucune action n'est suggérée, un message sera affiché indiquant <quote>Il n'est prévu d'installer, mettre à jour ou enlever aucun paquet.</quote>
it: A tal fine è necessario eseguire l'<quote>interfaccia grafica</quote> di <command>aptitude</command> e premere <keycap>g</keycap> (<quote>Scarica/Installa/Rimuovi</quote>). Se viene mostrata una qualsiasi azione, si dovrebbe controllarla e o risolverla o eseguirla. Se non viene proposta alcuna azione sarà mostrato il messaggio <quote>Non ci sono pacchetti da installare, rimuovere o aggiornare</quote>.
ja: この確認を行うには、<command>aptitude</command> を <quote>ビジュアルモード</quote> で起動して <keycap>g</keycap> (<quote>Go</quote>) を押してください。何らかのアクションが表示されたなら、その内容を確認して、修正するかあるいは提案されたアクションを実行すべきです。いかなるアクションの提案もない場合は、<quote>インストール・削除・更新予定のパッケージがありません</quote> というメッセージを表示します。
ml: പുന:പരിശോധനക്കായി <quote>visual mode</quote> ല്‍ <command>aptitude</command> വിക്ഷേപിച്ച് <keycap>g</keycap> (<quote>Go</quote>)അമര്‍ത്തുക. എന്തെങ്കിലും പ്രതികരണം കാണുകയാണെങ്കില്‍ അവ പരിശോധിച്ച് തെറ്റുകള്‍ തിരുത്തുകയോ നിര്ദ്ദേശിക്കപ്പെട്ട നടപടികള്‍ നടപ്പിലാക്കുകയോ ചെയ്യണം. നടപടിക്രമങ്ങളൊന്നും നിര്ദ്ദേശിക്കപ്പെട്ടിട്ടില്ലെങ്കില്‍ <quote>പൊതികള്‍ പ്രതിഷ്ഠിക്കാനോ, പുതുക്കാനോ, നീക്കം ചെയ്യാനോ ഇല്ല</quote>എന്ന് ഒരു സന്ദേശം പ്രദര്ശിപ്പിക്കപ്പെടും.
pt: Para fazer esta revisão, arranque o <command>aptitude</command> em <quote>modo visual</quote> e carregue em <keycap>g</keycap> (<quote>Go</quote>). Se mostrar quaisquer acções, você deve revê-las e, ou corrigi-las ou implementar as acções sugeridas. Se não forem sugeridas acções ser-lhe-á apresentada uma mensagem a dizer <quote>Nenhum pacote está marcado para ser instalado, removido ou actualizado</quote>.
ro: Pentru a face această verificare porniți <command>aptitude</command> în <quote>modul visual</quote> și apăsați <keycap>g</keycap> (de la <quote>Go</quote>). Dacă vă arată vreo acțiune ar trebui să revizuiți și să anulați sau să efectuați acțiunile sugerate. Dacă nu este sugerată nici o acțiune va fi afișat mesajul <quote>No packages are scheduled to be installed, removed, or upgraded</quote> (sau <quote>Nici un pachet nu este programat sa fie instalat, șters sau înnoit</quote>).
sv: För att genomföra denna granskning ska du köra <command>aptitude</command> i <quote>visuellt läge</quote> och trycka <keycap>g</keycap> (<quote>Gå</quote>). Om det indikerar att det finns åtgärder att utföra kontrollera vad det är och lös dem eller kör föreslagen åtgärd. Om inga åtgärder föreslås visas ett meddelande, <quote>Inga paket är schemalagda för installation, borttagning eller uppgradering</quote>.

source: Disabling APT pinning
fr: Désactiver l'étiquetage apt
it: Disattivare il pinning di APT
ja: APT の pin 機能を無効にする
ml: ആപ്റ്റ് പിന്നിങ്ങ് പ്രവര്‍ത്തനരഹിതമാക്കാന്‍
pt: Desactivar o APT pinning
ro: Dezactivarea alegerilor selective APT
sv: Inaktivera APT-nålning
zh_tw: 關閉 APT 的釘鎖 (Pinning) 功能

source: If you have configured APT to install certain packages from a distribution other than stable (e.g. from testing), you may have to change your APT pinning configuration (stored in <filename>/etc/apt/preferences</filename>) to allow the upgrade of packages to the versions in the new stable release. Further information on APT pinning can be found in <citerefentry> <refentrytitle>apt_preferences</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
fr: Si vous avez configuré apt pour installer certains paquets d'une distribution autre que <emphasis>stable</emphasis> (par exemple, de <emphasis>testing</emphasis>), il se peut que vous deviez changer la configuration d'étiquetage apt (« APT pinning ») (stockée dans <filename>/etc/apt/preferences</filename>) pour permettre la mise à niveau de paquets vers les versions de la nouvelle version stable. Vous trouverez plus d'informations sur l'étiquetage apt dans <citerefentry> <refentrytitle>apt_preferences</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
it: Se si è configurato APT in modo da installare taluni pacchetti da una distribuzione diversa da stable (ad esempio da testing), si potrebbe dover modificare la configurazione del pinning del proprio APT (memorizzata in <filename>/etc/apt/preferences</filename>) in modo da consentire l'aggiornamento dei pacchetti alle versioni nel nuovo rilascio stable. Maggiori informazioni sul pinning di APT sono disponibili in <citerefentry> <refentrytitle>apt_preferences</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
ja: 特定のパッケージを安定版以外のディストリビューション (テスト版など) からインストールするように APT を設定している場合、そのパッケージが新しい安定版リリース内のバージョンにアップグレードできるように、(<filename>/etc/apt/preferences</filename> 内に保存されている) APT の pin 設定を変更しなければならないかもしれません。APT の pin 機能に関する、より詳しい情報は、<citerefentry> <refentrytitle>apt_preferences</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> にあります。
ml: നിങ്ങള്‍ സ്റ്റേബിള്‍ അല്ലാത്തൊരു വിതരണത്തില്‍ നിന്നും (ഉദാ. ടെസ്റ്റിങ്ങ്) ചില പൊതികള്‍ ഇന്‍സ്റ്റോള്‍ ചെയ്യാന്‍ ആപ്റ്റ് ക്രമീകരിച്ചിട്ടുണ്ടെങ്കില്‍, പുതിയ സ്റ്റേബിള്‍ പതിപ്പില്‍ നിന്നുള്ള പൊതികളുടെ പതിപ്പുകളേയ്ക്കു് കയറ്റുവാന്‍ നിങ്ങളുടെ ആപ്റ്റ് പിന്നിങ്ങ് ക്രമീകരണം (<filename>/etc/apt/preferences</filename> ല്‍ സൂക്ഷിച്ചിരിയ്ക്കുന്നു) മാറ്റേണ്ടി വന്നേയ്ക്കാം. ആപ്റ്റ് പിന്നിങ്ങിനെക്കുറിച്ചുള്ള കൂടുതല്‍ വിവരങ്ങള്‍ <citerefentry> <refentrytitle>apt_preferences</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> ല്‍ കാണാം.
pt: Se configurou o APT para instalar determinados pacotes a partir de uma distribuição que não a estável (por ex. a partir da testing), pode ter que alterar a sua configuração de APT pinning (armazenada em <filename>/etc/apt/preferences</filename>) para permitir a actualização de pacotes para versões existentes na nova versão estável. Mais informação acerca do APT pinning pode ser encontrada em <citerefentry> <refentrytitle>apt_preferences</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
ro: Dacă ați configurat APT să instaleze anumite pachete dintr-o distribuție diferită de cea stabilă (ex. din testare), ar putea fi nevoie să schimbați configurația alegerilor selective APT (prezentă în <filename>/etc/apt/preferences</filename>) pentru a permite actualizarea pachetelor la versiunile din noua versiune stabilă. Mai multe informații despre alegeri selective APT pot fi găsite în <citerefentry> <refentrytitle>apt_preferences</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
sv: Om du har konfigurerat APT att installera vissa paket från en annan distribution än den stabila (exempelvis från testing), kan du ändra din konfiguration för paketnålning i APT (lagrad i <filename>/etc/apt/preferences</filename>) för att tillåta uppgraderingen av paket till versionerna i den nya stabila utgåvan. Ytterligare information om APT-nålning kan hittas i <citerefentry> <refentrytitle>apt_preferences</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
zh_tw: 如果您將 APT 設定為可以安裝除了 stable 發行版之外的套件，（像是：testing），您可能必須修改您的 APT 的釘鎖 (Pinning) 設定（儲存於 <filename>/etc/apt/preferences</filename> 中）來讓將要進行升級的套件能夠升級至新的 stable 發行版。您可以在 <citerefentry> <refentrytitle>apt_preferences</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> 取得 APT 的釘鎖功能的更多詳盡資訊。

source: Checking packages status
fr: Vérification de l'état des paquets
it: Verifica dello stato dei pacchetti
ja: パッケージの状態をチェックする
ml: പൊതികളുടെ അവസ്ഥ പരിശോധിച്ചു് കൊണ്ടിരിയ്ക്കുന്നു
pt: Verificar o estado dos pacotes
ro: Verificarea stării pachetelor
sv: Kontrollera paketstatus
zh_tw: 檢查套件的狀態

source: Regardless of the method used for upgrading, it is recommended that you check the status of all packages first, and verify that all packages are in an upgradable state. The following command will show any packages which have a status of Half-Installed or Failed-Config, and those with any error status.
fr: Quelle que soit la méthode utilisée pour mettre à niveau, il est recommandé de tester d'abord l'état de tous les paquets et de vérifier que tous les paquets se trouvent dans un état permettant la mise à niveau. La commande suivante vous indiquera tous les paquets qui sont dans l'état «&nbsp;Half-Installed&nbsp;» ou «&nbsp;Failed-Config&nbsp;», ainsi que ceux qui sont dans un état d'erreur :
it: Si raccomanda di controllare dapprima lo stato di tutti i pacchetti e di verificare che tutti siano in uno stato aggiornabile, indipendentemente dal metodo usato per l'aggiornamento. Il comando seguente mostrerà tutti i pacchetti con uno stato «Half-Installed» o «Failed-Config» e quelli con un qualsiasi stato di errore.
ja: アップグレードの方法に関係なく、まず全パッケージの状態を調べ、全パッケージがアップグレード可能な状態にあるのを確認することをお勧めします。次のコマンドは、インストールが未完了のパッケージ (Half-Installed) や設定に失敗したパッケージ (Failed-Config)、何らかのエラー状態にあるパッケージを表示します:
ml: നവീകരിയ്ക്കാനുള്ള മാര്‍ഗ്ഗം ഏതു് തന്നെ തെരഞ്ഞെടുത്താലും എല്ലാ പൊതികളുടേയും അവസ്ഥയെന്താണെന്നു് പരിശോധിയ്ക്കാനും എല്ലാ പൊതികളും നവീകരിയ്ക്കാവുന്ന അവസ്ഥയിലാണെന്നുറപ്പു് വരുത്താനും ശക്തമായി ശുപാര്‍ശ ചെയ്തിരിയ്ക്കുന്നു. താഴെ പറയുന്ന ആജ്ഞകള്‍ പകുതി-ഇന്‍സ്റ്റോള്‍ ചെയ്തതോ ക്രമീകരിയ്ക്കാന്‍-പരാജയപ്പെട്ടതോ ഏതെങ്കിലും തരത്തിലുള്ള പിശകു് വന്ന അവസ്ഥയിലുള്ള പൊതികളുടെ പട്ടിക കാണിയ്ക്കും.
pt: Independentemente do método utilizado para a actualização, é recomendado que primeiro verifique o estado de todos os pacotes, e verificar que todos os pacotes estão em modo de actualização. O seguinte comando listará todos os pacotes que possuem o estado Metade-Instalado (Half-Installed) ou Configuração-Falhada (Failed-Config), e aqueles que apresentem qualquer erro no estado.
ro: Indiferent de metoda utilizată pentru actualizare, este recomandat să verificați, mai întâi, starea tuturor pachetelor, asigurându-vă că toate pachetele sunt într-o stare actualizabilă. Următoarea comandă vă va afișa eventualele pachete care au starea de jumătate-instalat sau eșec-configurare, precum și cele cu o stare eronată.
sv: Oavsett vilken metod som används för uppgradering, rekommenderas det att du kontrollerar statusen på paketen först och verifierar att alla paket är möjliga att uppgradera. Följande kommando kommer att visa de paket som har statusen Half-Installed eller Failed-Config, och de som har någon form av felstatus.
zh_tw: 不論您是用什麼方式進行系統的更新，我們都建議您先檢查所有套件的狀態，並確認所有的套件都能夠順利升級。以下的指令會顯示所有狀態為半安裝 (Half-Installed) 或設定失敗 (Failed-Config) 或有其他任何錯誤的套件。

source: You could also inspect the state of all packages on your system using <command>dselect</command>, <command>aptitude</command>, or with commands such as
fr: Vous pouvez aussi vérifier l'état de tous les paquets du système en utilisant <command>dselect</command>, <command>aptitude</command>, ou avec des commandes comme&nbsp;:
it: È anche possibile controllare lo stato di tutti i pacchetti sul proprio sistema usando <command>dselect</command>, <command>aptitude</command> o con comandi come ad esempio
ja: <command>dselect</command> や <command>aptitude</command>、あるいは次のようなコマンドを使ってシステムの全パッケージの状態を検査することもできます。
ml: നിങ്ങളുടെ സിസ്റ്റത്തിലെ എല്ലാ പൊതികളുടേയും അവസ്ഥ <command>dselect</command>, <command>aptitude</command> എന്നിവയുപയോഗിച്ചോ അല്ലെങ്കില്‍ താഴെ പറയുന്ന ആജ്ഞകള്‍ ഉപയോഗിച്ചോ പരിശോധിയ്ക്കാവുന്നതാണു്
pt: Pode também inspeccionar o estado de todos os pacotes no seu sistema utilizando <command>dselect</command>, <command>aptitude</command>, ou com comandos como
ro: Ați putea, de asemenea, să inspectați starea tuturor pachetelor de pe sistemul dumneavoastră utilizând <command>dselect</command>, <command>aptitude</command> sau folosind comenzi precum
sv: Du kan även inspektera tillståndet för alla paket på ditt system med <command>dselect</command>, <command>aptitude</command>, eller med kommandon som
zh_tw: 除此之外，檢查系統中所有套件狀態的方法還包括使用使用 <command>dselect</command>、<command>aptitude</command>、或是利用以下的指令：

source: or
fr: ou&nbsp;:
it: o
ja: または
ml: അല്ലെങ്കില്‍
pt: ou
ro: sau
sv: eller
zh_tw: 或是

source: It is desirable to remove any holds before upgrading. If any package that is essential for the upgrade is on hold, the upgrade will fail.
fr: Il est souhaitable d'enlever tous les blocages de paquets (<emphasis>on hold</emphasis>) avant de passer à la nouvelle version. Si un paquet essentiel pour la mise à niveau est bloqué, la mise à niveau va échouer.
it: È auspicabile la rimozione di qualsiasi blocco prima dell'aggiornamento. Se qualsiasi pacchetto essenziale per l'aggiornamento è bloccato (<quote>on hold</quote>) l'aggiornamento fallirà.
ja: アップグレード前に、あらゆる hold 状態を解除しておいたほうがよいでしょう。アップグレードに不可欠なパッケージが hold 状態にある場合、アップグレードに失敗します。
ml: തടഞ്ഞുവച്ചിരിയ്ക്കുന്നവയേതെങ്കിലുമുണ്ടെങ്കില്‍ നവീകരണത്തിനു് മുമ്പു് അവ നീക്കം ചെയ്യുന്നതാണു് നല്ലതു്. നവീകരണത്തിനത്യാവശ്യമുള്ള ഏതെങ്കിലും പൊതി തടഞ്ഞുവച്ചിരിയ്ക്കുകയാണെങ്കില്‍ നവീകരണം പരാജയപ്പെടും.
pt: É desejável que remova todos os bloqueios ('holds') antes da actualização. Se algum pacote essencial à actualização estiver bloqueado, a actualização irá falhar.
ro: Este preferabil să ștergeți marcajul „păstrat” al oricărui pachet în această stare, înaintea actualizării. Dacă un pachet esențial care trebuie actualizat este „păstrat”, actualizarea va eșua.
sv: Det är önskvärt att ta bort eventuella tillbakahållna paket innan uppgradering. Om något paket är systemkritiskt och hålls tillbaka för uppgraderingen, kommer uppgraderingen att misslyckas.
zh_tw: 最佳的做法是在進行系統升級前將所有的套件解除保留 (hold) 狀態。如果在升級過程中有任何的關鍵套件的狀態被設定為保留，那麼升級的作業就會失敗。

source: Note that <command>aptitude</command> uses a different method for registering packages that are on hold than <command>apt-get</command> and <command>dselect</command>. You can identify packages on hold for <command>aptitude</command> with
fr: Notez que pour enregistrer les paquets qui sont bloqués, <command>aptitude</command> utilise une méthode différente de celles d'<command>apt-get</command> et <command>dselect</command>. Vous pouvez identifier les paquets bloqués pour <command>aptitude</command> avec :
it: Si noti che <command>aptitude</command> usa un metodo differente per registrare i pacchetti bloccati rispetto ad <command>apt-get</command> e <command>dselect</command>. È possibile identificare i pacchetti bloccati per <command>aptitude</command> eseguendo
ja: hold 状態にあるパッケージを記録するのに、<command>aptitude</command> は <command>apt-get</command> や <command>dselect</command> とは異なる手法を用いることに注意してください。<command>aptitude</command> で hold 状態にあるパッケージを確認するには、以下のように実行します。
ml: <command>apt-get</command> ഉം <command>dselect</command> ഉം പൊതികള്‍ തടഞ്ഞുവയ്ക്കാന്‍ ഉപയോഗിയ്ക്കുന്ന രീതിയില്‍ നിന്നും വ്യത്യസ്തമായാണു് <command>aptitude</command> തടയാനുള്ള പൊതികളെ രേഖപ്പെടുത്തുന്നതെന്നു് ഓര്‍ക്കുക. <command>aptitude</command> തടഞ്ഞുവച്ച പൊതികളെ നിങ്ങള്‍ക്കു് താഴെ പറയുന്ന ആജ്ഞ ഉപയോഗിച്ചു് തിരിച്ചറിയാം.
pt: Note que o <command>aptitude</command> utiliza um método diferente para registar os pacotes bloqueados que o <command>apt-get</command> e <command>dselect</command>. Pode identificar pacotes bloqueados para o <command>aptitude</command> com
ro: A se reține că <command>aptitude</command> folosește o metodă diferită de a marca pachetele care sunt păstrate față de <command>apt-get</command> și <command>dselect</command>. Puteți identifica pachetele păstrate pentru <command>aptitude</command> cu
sv: Observera att <command>aptitude</command> använder en annan metod för att registrera paket som hålls tillbaka än <command>apt-get</command> och <command>dselect</command>. Du kan identifiera paket som hålls tillbaka med <command>aptitude</command> med
zh_tw: 請注意到，<command>aptitude</command> 使用了和 <command>apt-get</command> 及 <command>dselect</command> 迥然不同的方式來登錄哪些是保留套件。您可以使用以下方式來確認在 <command>aptitude</command> 裡有哪些套件是被保留住的：

source: If you want to check which packages you had on hold for <command>apt-get</command>, you should use
fr: Si vous désirez vérifier quels paquets étaient bloqués pour <command>apt-get</command>, il vous faudra utiliser&nbsp;:
it: Se si desidera controllare quali pacchetti erano bloccati per <command>apt-get</command>, si dovrebbe eseguire
ja: <command>apt-get</command> でどのパッケージが hold 状態にあるのかを調べたければ、以下のように実行してください。
ml: <command>apt-get</command> ഉപയോഗിച്ചു് തടഞ്ഞുവച്ച പൊതികള്‍ പരിശോധിയ്ക്കണമെങ്കില്‍ നിങ്ങള്‍ ഉപയോഗിയ്ക്കേണ്ടതു്
pt: Se quiser verificar que pacotes tem bloqueados para o <command>apt-get</command> deverá utilizar
ro: Dacă vreți să verificați ce pachete aveți păstrate pentru <command>apt-get</command>, ar trebui să folosiți
sv: Om du vill kontrollera vilka paket som hålls tillbaka vid användning av <command>apt-get</command>, ska du använda
zh_tw: 如果您想要檢查那些套件是被 <command>apt-get</command> 所保留住的，請使用：

source: If you changed and recompiled a package locally, and didn't rename it or put an epoch in the version, you must put it on hold to prevent it from being upgraded.
fr: Si vous aviez modifié et recompilé un paquet localement, sans changer son nom et sans mettre d'époque («&nbsp;epoch&nbsp;») dans la version, vous devez le bloquer pour éviter qu'il ne soit mis à niveau.
it: Se un pacchetto è stato modificato e ricompilato localmente, e non lo si è rinominato né vi si è aggiunto un numero di epoca nella versione, è necessario bloccarlo per impedire che venga aggiornato.
ja: パッケージをローカルで変更・再コンパイルしており、パッケージの名前を変えたりバージョン番号に epoch フィールドを追加していないなら、アップグレードしないよう hold 状態にしておかなければなりません。
ml: നിങ്ങളൊരു പൊതി പ്രാദേശികമായി മാറ്റം വരുത്തുകയും വീണ്ടും കമ്പൈല്‍ ചെയ്യുകയും പേരു് മാറ്റാതിരിയ്ക്കുകയോ പതിപ്പില്‍ സമയം രേഖപ്പെടുത്താതിരിയ്ക്കുകയോ ചെയ്തിട്ടുണ്ടെങ്കില്‍ അതിനെ നവീകരിയ്ക്കുന്നതില്‍ നിന്നും ഒഴിവാക്കാന്‍‌ നിങ്ങളതിനെ തടഞ്ഞുവയ്ക്കണം.
pt: Se alterar e recompilar localmente um pacote e não o renomear ou colocar numa versão modificada, terá que o bloquear para prevenir que o mesmo seja alterado.
ro: Dacă ați modificat și recompilat un pachet local și nu l-ați redenumit sau nu i-ați atașat o epocă în versiune, trebuie să îl plasați pe „păstrat” pentru a preveni actualizarea sa.
sv: Om du ändrat och byggt om ett paket lokalt, och inte bytte namn på det eller la in ett datum i versionen, måste du hålla tillbaka det för att förhindra att det uppgraderas.
zh_tw: 如果您自行在系統中變更並重新編譯了某個套件，但卻沒有將其更名或在版本號碼中使用 epoch（自行定義版本號碼），那您就必須把它設定為保留狀態，以防止它被升級到新的版本。

source: The <quote>hold</quote> package state for <command>apt-get</command> can be changed using:
fr: Vous pouvez activer un blocage sur un paquet pour <command>apt-get</command> en utilisant :
it: Lo stato <quote>bloccato</quote> di un pacchetto per <command>apt-get</command> può essere modificato eseguendo il comando:
ja: <command>apt-get</command> でパッケージを <quote>hold</quote> 状態に変更するには、以下のように実行してください。
pt: O estado <quote>hold</quote> do pacote para o <command>apt-get</command> pode ser alterado utilizando:
ro: Starea „păstrat” pentru <command>apt-get</command> poate fi schimbată folosind:
sv: Pakettillståndet <quote>hold</quote>(håll) för <command>apt-get</command> kan ändras med:

source: # echo <replaceable>package_name</replaceable> hold | dpkg --set-selections
it: # echo <replaceable>nome_pacchetto</replaceable> hold | dpkg --set-selections
ja: # echo <replaceable>パッケージ名</replaceable> hold | dpkg --set-selections
ro: # echo <replaceable>nume_pachet</replaceable> hold | dpkg --set-selections
sv: # echo <replaceable>paketnamn</replaceable> hold | dpkg --set-selections

source: Replace <literal>hold</literal> with <literal>install</literal> to unset the <quote>hold</quote> state.
fr: Remplacez <literal>hold</literal> par <literal>install</literal> pour débloquer un paquet.
it: Si sostituisca <literal>hold</literal> con <literal>install</literal> per rimuovere lo stato <quote>bloccato</quote> del pacchetto.
ja: <quote>hold</quote> 状態を解除するには <literal>hold</literal> の代わりに <literal>install</literal> を使用してください。
pt: Substitua <literal>hold</literal> por <literal>install</literal> para remover o estado <quote>hold</quote>.
ro: Înlocuiți <literal>hold</literal> cu <literal>install</literal> pentru a demarca starea <quote>hold</quote>.
sv: Ersätt <literal>hold</literal> med <literal>unhold</literal> för att ändra <quote>hold</quote>-tillståndet.

source: If there is anything you need to fix, it is best to make sure your <filename>sources.list</filename> still refers to &oldreleasename; as explained in <xref linkend="old-sources"/>.
fr: Si vous devez corriger quelque chose, il est préférable de vous assurer que <filename>sources.list</filename> fait toujours référence à &Oldreleasename; comme expliqué en <xref linkend="old-sources"/>.
it: Se c'è bisogno di sistemare qualcosa è meglio controllare che il proprio <filename>sources.list</filename> punti sempre a &oldreleasename; come illustrato in <xref linkend="old-sources"/>.
ja: 修正が必要なことがあるなら、<xref linkend="old-sources"/>で説明するように <filename>sources.list</filename> が &oldreleasename; を指定したままにしておくべきです。
ml: നിങ്ങള്‍ക്കെന്തെങ്കിലും പരിഹരിയ്ക്കാന്‍ ബാക്കിയുണ്ടെങ്കില്‍ <xref linkend="old-sources"/> ല്‍ പറഞ്ഞ പോലെ <filename>sources.list</filename> ഇപ്പോഴും &oldreleasename; നെയാണു് സൂചിപ്പിയ്ക്കുന്നതെന്നുറപ്പാക്കുക.
pt: Se existe alguma coisa que necessita de corrigir, o melhor é certificar-se que o seu ficheiro <filename>sources.list</filename> continua a apontar para a &oldreleasename; conforme é explicado em <xref linkend="old-sources"/>.
ro: Dacă este ceva ce trebui rezolvat, cel mai bine vă asigurați că <filename>sources.list</filename> încă se referă la &oldreleasename; după cum este explicat în <xref linkend="old-sources"/>.
sv: Om det är någonting du behöver rätta till är det bäst att se till att din <filename>sources.list</filename> fortfarande refererar till &oldreleasename; vilket förklaras i <xref linkend="old-sources"/>.

source: The proposed-updates section
fr: La section proposed-updates
it: La sezione <quote>proposed-updates</quote> (aggiornamenti proposti)
ja: proposed-updates セクション
ml: proposed-updates എന്ന വിഭാഗം
pt: Secção de actualizações propostas (proposed-updates)
ro: Secțiunea proposed-updates
sv: Avsnittet proposed-updates
