Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: In order to gain extra safety margin when upgrading remotely, we suggest that you run upgrade processes in the virtual console provided by the <command>screen</command> program, which enables safe reconnection and ensures the upgrade process is not interrupted even if the remote connection process fails.
fr: Pour avoir une marge de sécurité supplémentaire lors des mises à niveau à distance, nous vous suggérons d'exécuter les processus de mise à niveau dans la console virtuelle fournie par le programme <command>screen</command> qui permet de se reconnecter en cas de coupure et garantit que le processus de mise à niveau ne sera pas interrompu même si le processus de connexion à distance était coupé.
it: Per ottenere un margine supplementare di sicurezza durante l'aggiornamento da remoto si suggerisce di eseguire i processi di aggiornamento nella console virtuale fornita dal programma <command>screen</command>, che consente la riconnessione sicura e garantisce che il processo di aggiornamento non venga interrotto nemmeno nel caso in cui il processo di connessione remota si interrompa.
ja: リモートでのアップグレード時にさらなる安全マージンを得るため、<command>screen</command> プログラムが提供する仮想コンソール内でアップグレード作業を行うことを提案します。このプログラムは安全な再接続を可能にし、リモート接続プロセスが切断された場合でもアップグレード作業が中断しないようにしてくれます。
ml: ദൂരെ നിന്നും നവീകരിയ്ക്കുമ്പോള്‍ കൂടുതല്‍ സുരക്ഷയ്ക്കായി വിദൂര ബന്ധം നല്‍കുന്ന പ്രക്രിയ പരാജയപ്പെട്ടാല്‍ കൂടി നവീകരണ പ്രക്രിയ തടസ്സപ്പെടില്ല എന്നതുറപ്പാക്കാന്‍ വീണ്ടും ബന്ധിപ്പിയ്ക്കുന്നതു് സാധ്യമായ <command>screen</command> പ്രോഗ്രാം നല്‍കുന്ന മായാ കണ്‍സോളില്‍ വച്ചു് നവീകരണ പ്രക്രിയ പ്രവര്‍ത്തിപ്പിയ്ക്കണം.
pt: De modo a ganhar uma margem extra de segurança quando actualizar remotamente, nós sugerimos que corra os processos de actualização na consola virtual disponibilizada pelo programa <command>screen</command>, o qual permite uma re-ligação segura e assegura que o processo de actualização não é interrompido mesmo que o processo da ligação remota falhe.
ro: Pentru a avea încă o măsură de siguranță când actualizați de la distanță, vă sugerăm să rulați procesul de actualizare într-o consolă virtuală furnizată de programul <command>screen</command>, lucru care vă va permite să vă reconectați în siguranță și oferă siguranța că procesul de instalare nu va fi întrerupt, chiar dacă procesul care întreține conexiunea la distanță eșuează.
sv: För att öka säkerhetsmarginalen vid en fjärruppgradering föreslår vi att du kör uppgraderingsprocesser i den virtuella konsollen som tillhandahålls av programmet <command>screen</command>, vilket gör att man säkert kan återansluta till sessionen och försäkra sig om att uppgraderingsprocessen inte avbryts även om fjärranslutningen avbryts.
zh_tw: 在以遠端進行更新時，為了能得到更多的安全保障，在此建議您在 <command>screen</command> 程式所提供的虛擬主控台裡進行升級程序。它能夠讓您一再地重複連線，以確保如果遠端連線中斷時，也不會干擾到升級程序的進行。

source: You should <emphasis>not</emphasis> upgrade using <command>telnet</command>, <command>rlogin</command>, <command>rsh</command>, or from an X session managed by <command>xdm</command>, <command>gdm</command> or <command>kdm</command> etc on the machine you are upgrading. That is because each of those services may well be terminated during the upgrade, which can result in an <emphasis>inaccessible</emphasis> system that is only half-upgraded. Use of the GNOME application <command>update-manager</command> is <emphasis>strongly discouraged</emphasis> for upgrades to new releases, as this tool relies on the desktop session remaining active.
it: <emphasis>Non</emphasis> si dovrebbe eseguire l'aggiornamento usando <command>telnet</command>, <command>rlogin</command>, <command>rsh</command>, o da una sessione X gestita da <command>xdm</command>, <command>gdm</command> o <command>kdm</command> e simili sul sistema che si sta aggiornando, poiché ciascuno di questi servizi potrebbe essere terminato durante l'aggiornamento, generando quindi un sistema <emphasis>inaccessibile</emphasis> e aggiornato solo a metà. L'uso dell'applicazione GNOME <command>update-manager</command> per l'aggiornamento alla nuova versione è <emphasis>fortemente sconsigliato</emphasis> poiché tale programma fa affidamento sul fatto che la sessione desktop rimanga attiva.
ro: <emphasis>Nu</emphasis> actualizați sistemul folosind o sesiune <command>telnet</command>, <command>rlogin</command>, <command>rsh</command>, sau dintr-o sesiune X administrată de <command>xdm</command>, <command>gdm</command> sau <command>kdm</command>, etc. pe sistemul pe care îl actualizați. Acest lucru este necesar deoarece oricare dintre aceste servicii poate fi oprit în timpul actualizării, ceea ce poate rezulta într-un sistem <emphasis>inaccesibil</emphasis>, actualizat doar parțial. Utilizarea aplicației GNOME <command>update-manager</command> pentru actualizarea la versiuni noi de sistem este <emphasis>descurajată</emphasis>, deoarece acest utilitar depinde de sesiunea de birou curentă.
sv: Du bör inte uppgradera via <command>telnet</command>, <command>rlogin</command>, <command>rsh</command> eller från en X-session som hanteras av <command>xdm</command>, <command>gdm</command> eller <command>kdm</command> etc på maskinen som du uppgraderar. Detta då processer som hanterar dessa tjänster kan avslutas under uppgraderingen vilket kan resultera i ett <emphasis>oåtkomligt</emphasis> system som endast är halvt uppgraderat. Att använda GNOME-applikationen <command>update-manager</command> avråds starkt ifrån när det kommer till att uppgrade till nya utgåvor eftersom verktyget förutsätter att skrivbordssessionen är aktiv.

source: TODO: surely gdm/kdm are sane? (vorlon) haha, no, gdm is not; I had that thought, and tested a gdm restart on my live session ;)
it: TODO: siamo sicuri che gdm/kdm siano sensati? (vorlon) haha, no, gdm non lo è; ho avuto quel pensiero e testato un riavvio gdm sulla mia sessione live ;)
ja: TODO: 本当に gdm や kdm はまともなのかな? (vorlon) あはは、いや gdm はまともじゃないよ。 俺もそう思って、動いているセッションにおいて gdm を再起動してみたんだ ;)
sv: TODO: är verkligen gdm/kdm vettiga? (vorlon) haha, nej, gdm är det inte; jag provade genom att starta om gdm på min live-session ;)

source: Remove conflicting packages
fr: Supprimer les paquets conflictuels
it: Rimozione dei pacchetti in conflitto
ja: 衝突しているパッケージを削除する
pt: Remover pacotes em conflito
ro: Îndepărtați pachetele în conflict
sv: Ta bort paket i konflikt

source: Due to bug <ulink url="&url-bts;512951">#512951</ulink>, the <systemitem role="package">splashy</systemitem> package needs to be purged prior to the upgrade.
fr: À cause du bogue <ulink url="&url-bts;512951">nº 512951</ulink>, le paquet <systemitem role="package">splashy</systemitem> doit être supprimé complètement ainsi que sa configuration avant la mise à niveau.
it: A causa del bug <ulink url="&url-bts;512951">#512951</ulink>, è necessario disinstallare completamente il pacchetto <systemitem role="package">splashy</systemitem> prima dell'aggiornamento.
ja: bug <ulink url="&url-bts;512951">#512951</ulink> のため、アップグレードの前に <systemitem role="package">splashy</systemitem> パッケージを完全削除 (purge) しておく必要があります。
pt: Devido ao bug <ulink url="&url-bts;512951">#512951</ulink>, o pacote <systemitem role="package">splashy</systemitem> precisa de ser purgado antes da actualização.
ro: Datorită defectului <ulink url="&url-bts;512951">#512951</ulink>, pachetul <systemitem role="package">splashy</systemitem> trebuie eliminat înainte de înnoire.
sv: På grund av symptom beskrivna i felrapport <ulink url="&url-bts;512951">#512951</ulink> måste paketet <systemitem role="package">splashy</systemitem> tas bort före uppgraderingen.

source: Checking system status
fr: Vérifier l'état du système
it: Verifica dello stato del sistema
ja: システムの状態をチェックする
ml: സിസ്റ്റത്തിന്റെ നില പരിശോധിക്കുന്നതു്
pt: Verificar o estado do sistema
ro: Verificarea stării sistemului
sv: Kontrollera systemets status
zh_tw: 檢查系統的狀況

source: The upgrade process described in this chapter has been designed for upgrades from <quote>pure</quote> &oldreleasename; systems without third-party packages. For the greatest reliability of the upgrade process, you may wish to remove third-party packages from your system before you begin upgrading.
fr: Le processus de mise à niveau décrit dans ce chapitre a été conçu pour des mises à niveau des systèmes &Oldreleasename; <quote>purs</quote> sans paquet provenant d'autres sources. Pour une meilleure fiabilité du processus de mise à niveau, vous pouvez supprimer ces paquets du système avant de commencer la mise à niveau.
it: Il processo di aggiornamento descritto nel presente capitolo è stato concepito per aggiornamenti da sistemi &oldreleasename; <quote>puri</quote>, ossia senza pacchetti di terze parti. Per ottenere un processo di aggiornamento il più affidabile possibile si potrebbero voler rimuovere i pacchetti di terze parti dal proprio sistema prima di iniziare l'aggiornamento.
ja: この章で述べられているアップグレード手順は、サードパーティ製のパッケージが無い <quote>純粋</quote> な &oldreleasename; システムからのアップグレード用です。アップグレードプロセスにおいて最大限の信頼性を確保するために、アップグレード開始前にシステムからサードパーティ製パッケージを削除しておいた方が良いでしょう。
ml: ഈ അദ്ധ്യായത്തില്‍ വിവരിച്ച നവീകരണ പ്രക്രിയ മറ്റുള്ളവരില്‍ നിന്നുള്ള പൊതികളില്ലാത്ത <quote>ശുദ്ധമായ</quote> &oldreleasename; ല്‍ നിന്നും കയറാനുള്ളതായാണു് രൂപകല്‍പന ചെയ്തിരിയ്ക്കുന്നതു്. ഏറ്റവും കൂടി ഉറപ്പിനു് മറ്റുള്ളവരില്‍ നിന്നുളള പൊതികള്‍ നവീകരണത്തിനു് മുമ്പു് നീക്കം ചെയ്യുന്നതു് നന്നായിരിയ്ക്കും.
pt: O processo de actualização descrito neste capítulo foi desenhado para actualizações de sistemas &oldreleasename; <quote>puros</quote> sem pacotes de terceiros. Para uma maior fiabilidade do processo de actualização, pode querer remover pacotes de terceiros do seu sistema antes de começar a actualização.
ro: Procedeul de actualizare descris în acest capitol a fost conceput pentru actualizări de la sisteme &oldreleasename; <quote>pure</quote>, fără pachete din surse terțe. Pentru o mai mare fiabilitate a procedeului de actualizare veți dori să ștergeți pachetele provenite din surse terțe înainte să începeți actualizarea.
sv: Uppgraderingsprocessen som beskrivs i detta kapitel har tagits fram med uppgradering från ett <quote>rent</quote> &oldrelease;-system, utan några tredjepartspaket, i åtanke. För störst tillförlitlighet i uppgraderingsprocessen bör du ta bort eventuella tredjepartsprogram från ditt system innan uppgraderingen påbörjas.

source: Direct upgrades from Debian releases older than &oldrelease; (&oldreleasename;) are not supported. Please follow the instructions in the <ulink url="http://www.debian.org/releases/&oldreleasename;/releasenotes">Release Notes for &debian; &oldrelease;</ulink> to upgrade to &oldrelease; first.
fr: Les mises à niveau directement depuis des versions de Debian plus vieilles que &oldrelease; (&Oldreleasename;) ne sont pas prises en charge. Merci de suivre les instructions dans les <ulink url="http://www.debian.org/releases/&oldreleasename;/releasenotes">Notes de publication&nbsp;;</ulink> et de mettre la machine à niveau vers &oldrelease; d'abord.
it: L'aggiornamento diretto dalle versioni di Debian precedenti a &oldrelease; (&oldreleasename;) non è supportato. Seguire le istruzioni nelle <ulink url="http://www.debian.org/releases/&oldreleasename;/releasenotes">Note di Rilascio per &debian; &oldrelease;</ulink> per aggiornare prima a &oldrelease;.
ja: &oldrelease; (&oldreleasename;) より古い Debian のリリースバージョンからの直接のアップグレードはサポートされていません。&oldrelease; へのアップグレードは、まず<ulink url="http://www.debian.org/releases/&oldreleasename;/releasenotes">&debian; &oldrelease; のリリースノート</ulink>の指示に従ってください。
pt: As actualizações directas a partir de lançamentos Debian mais antigos que &oldrelease; (&oldreleasename;) não são suportados. Por favor siga as instruções nas <ulink url="http://www.debian.org/releases/&oldreleasename;/releasenotes">Notas de Lançamento para &debian; &oldrelease;</ulink> para primeiro actualizar para &oldrelease;.
ro: Înnoiri direct de la versiuni mai vechi ca &oldrelease; (&oldreleasename;) nu sunt suportate. Urmați instrucțiunile de la <ulink url="http://www.debian.org/releases/&oldreleasename;/releasenotes">Note de lansare pentru &debian; &oldrelease;</ulink> pentru a înnoi mai întâi la &oldrelease;.
sv: Direkta uppgraderingar från Debian-utgåvor äldre än &oldrelease; (&oldreleasename;) stöds inte. Följ instruktionerna i <ulink url="http://www.debian.org/releases/&oldreleasename;/releasenotes.sv.html">Kommentarer till utgåvan &debian; &oldrelease;</ulink> för att uppgradera till &oldrelease; först.

source: This procedure also assumes your system has been updated to the latest point release of &oldreleasename;. If you have not done this or are unsure, follow the instructions in <xref linkend="old-upgrade"/>.
fr: Cette procédure suppose également que le système a été mis à niveau jusqu'à la dernière révision de &Oldreleasename;. Si vous ne l'avez pas fait ou si vous n'en êtes pas certain, veuillez suivre les instructions en <xref linkend="old-upgrade"/>.
it: Questa procedura presume altresì che il proprio sistema sia stato aggiornato fino all'ultimo aggiornamento disponibile per &oldreleasename;: se non è così o non si è sicuri, si seguano le istruzioni contenute in <xref linkend="old-upgrade"/>.
ja: またこの手順は、システムが &oldreleasename; の最新ポイントリリースにアップデート済みであるものと想定しています。そうではなかったり、アップグレード済みかどうか不明なら、<xref linkend="old-upgrade"/>内の指示に従ってください。
ml: ഈ രീതി നിങ്ങള്‍ &oldreleasename; ന്റെ ഏറ്റവും പുതിയ പോയിന്റ് പതിപ്പിലേയ്ക്കു് കയറിയിട്ടുണ്ടെന്നു് ഊഹിയ്ക്കുന്നു. നിങ്ങളിതു് ചെയ്തിട്ടില്ലെങ്കിലോ ഉറപ്പില്ലെങ്കിലോ <xref linkend="old-upgrade"/> ല്‍ നല്‍കിയ നിര്‍ദ്ദേശങ്ങള്‍ പിന്തുടരുക.
pt: Este procedimento também assume que o seu sistema foi actualizado até ao último ponto da versão &oldreleasename;. Se não tiver feito esta actualização ou não tem a certeza, siga as instruções em <xref linkend="old-upgrade"/>.
ro: De asemenea, se pleacă de la premiza că ați actualizat până la ultima versiune minoră a lui &oldreleasename;. Dacă nu ați făcut acest lucru sau dacă aveți dubii, urmați instrucțiunile din <xref linkend="old-upgrade"/>.
sv: Processen förutsätter även att ditt system har uppdaterats till den senaste punkutgåven av &oldrelease;. Om du inte har gjort detta eller är osäker, följ instruktionerna i <xref linkend="old-upgrade"/>.

source: Review actions pending in package manager
fr: Vérifier les actions en cours dans le gestionnaire de paquets
it: Rivedere le azioni in sospeso nel gestore di pacchetti
ja: パッケージマネージャにおいて中断しているアクションの確認
ml: പൊതികളുടെ നടത്തിപ്പുകാരനില്‍ ബാക്കിയുള്ള നടപടികള്‍ ഒന്നു കൂടി നോക്കുക
pt: Rever as acções pendentes no gestor de pacotes
ro: Verificați în managerul de pachete acțiunile de efectuat
sv: Kontrollera kommande åtgärder i pakethanteraren
zh_tw: 重新檢視在套件管理程式的懸而未決之動作

source: In some cases, the use of <command>apt-get</command> for installing packages instead of <command>aptitude</command> might make <command>aptitude</command> consider a package as <quote>unused</quote> and schedule it for removal. In general, you should make sure the system is fully up-to-date and <quote>clean</quote> before proceeding with the upgrade.
fr: Dans certains cas, l'utilisation d'<command>apt-get</command> pour l'installation de paquets au lieu d'<command>aptitude</command> peut induire <command>aptitude</command> à considérer un paquet comme <quote>unused</quote> (inutilisé) et à le programmer pour suppression. En général, vous devez vous assurer que le système est complètement à jour et <quote>propre</quote> avant de commencer la mise à niveau.
it: In certi casi l'uso di <command>apt-get</command> per l'installazione di pacchetti in sostituzione di <command>aptitude</command> potrebbe far sì che <command>aptitude</command> consideri un pacchetto come <quote>inutilizzato</quote> e ne programmi la rimozione. In generale, ci si dovrebbe accertare che il proprio sistema sia completamente aggiornato e <quote>pulito</quote> prima di procedere all'aggiornamento.
ja: パッケージをインストールするのに <command>aptitude</command> の代わりに <command>apt-get</command> を使用すると、時として、<command>aptitude</command> がそのパッケージを <quote>使われていない</quote> とみなし、削除対象とすることがあります。一般的には、アップグレードを先に進める前に、システムが完全に最新かつ <quote>クリーン</quote> な状態となっているかを確認するべきです。
ml: ചില സമയങ്ങളില്‍ പൊതികള്‍ ഇന്‍സ്റ്റോള്‍ ചെയ്യാന്‍ <command>aptitude</command> നു് പകരം <command>apt-get</command> ഉപയോഗിയ്ക്കുന്നതു് <command>aptitude</command> ആ പൊതിയെ <quote>ഉപയോഗിയ്ക്കാത്തതു് (unused)</quote> ആയി കണക്കാക്കുവാനും നീക്കം ചെയ്യാനുള്ളവയുടെ പട്ടികയില്‍ ചേര്‍ക്കാനും കാരണമാകും. പൊതുവെ, നവീകരണത്തിനു് മുമ്പേ നിങ്ങളുടെ സിസ്റ്റം ഏറ്റവും പുതിയതും (fully up-to-date) <quote>വൃത്തിയുള്ളതും (clean)</quote> ആണെന്നു് ഉറപ്പാക്കണം.
pt: Em alguns casos, a utilização do <command>apt-get</command> para instalar pacotes em vez do <command>aptitude</command> pode fazer o <command>aptitude</command> considerar um pacote como <quote>não utilizado</quote> e marcá-lo para remoção. De um modo geral, você deve assegurar-se que o sistema está totalmente actualizado e <quote>limpo</quote> antes de proceder com a actualização.
ro: În anumite cazuri, dacă ați folosit <command>apt-get</command> să instalați pachete în loc să folosiți <command>aptitude</command>, <command>aptitude</command> poate considera un pachet ca fiind nefolosit și să-l înregistreze pentru ștergere. În general, ar trebui să vă asigurați că sistemul este adus la zi și curat, înainte de a continua procesul de actualizare.
sv: I vissa fall kan användandet av <command>apt-get</command> för installation av paket istället för <command>aptitude</command> orsaka att <command>aptitude</command> anser att ett paket är <quote>oanvänt</quote> och markera det för radering. Tillse att ditt system är helt uppdaterat och <quote>rent</quote> innan du fortsätter med uppgraderingen.

source: Because of this you should review if there are any pending actions in the package manager <command>aptitude</command>. If a package is scheduled for removal or update in the package manager, it might negatively impact the upgrade procedure. Note that correcting this is only possible if your <filename>sources.list</filename> still points to <emphasis>&oldreleasename;</emphasis> and not to <emphasis>stable</emphasis> or <emphasis>&releasename;</emphasis>; see <xref linkend="old-sources"/>.
fr: Ainsi, vous devez commencer par vérifier s'il y a des actions en cours dans le gestionnaire de paquets <command>aptitude</command>. Si un paquet est programmé pour être supprimé ou mis à jour dans le gestionnaire des paquets, cela peut poser problème lors de la procédure de mise à niveau. Notez que la correction d'un tel problème n'est possible que si le fichier <filename>sources.list</filename> pointe encore vers <emphasis>&oldreleasename;</emphasis> et pas vers <emphasis>stable</emphasis> ou <emphasis>&releasename;</emphasis>&nbsp;; consultez <xref linkend="old-sources"/>.
it: Pertanto bisognerebbe controllare se vi sono operazioni in sospeso nel gestore di pacchetti <command>aptitude</command>: se è programmato l'aggiornamento o la rimozione di un pacchetto, questo potrebbe influire negativamente sul processo di aggiornamento. Si noti che la correzione di questa situazione è possibile solo se il proprio <filename>sources.list</filename> punta tuttora a <emphasis>&oldreleasename;</emphasis> e non a <emphasis>stable</emphasis> o a <emphasis>&releasename;</emphasis>. A tale proposito si consulti <xref linkend="old-sources"/>.
ja: そのため、パッケージマネージャ <command>aptitude</command> において中断しているアクションがないか確認すべきでしょう。パッケージマネージャにおいて、あるパッケージが削除あるいは更新の対象となっているなら、アップグレード手順に好ましくない影響を与えるかもしれません。パッケージマネージャにおけるアクションの修正は、<filename>sources.list</filename> に <emphasis>stable</emphasis> や <emphasis>&releasename;</emphasis> ではなく、<emphasis>&oldreleasename;</emphasis> が指定されている段階でのみ可能なことに注意してください。<xref linkend="old-sources"/> も参照してください。
ml: ഇതു കാരണം <command>aptitude</command>പൊതിനിര്‍വ്വാഹകത്തില്‍ എന്തെങ്കിലും നടപടിക്രമങ്ങള്‍ ബാക്കിയുണ്ടോ എന്ന് പരിശോധിക്കേണ്ടിയിരിക്കുന്നു. ഏതെങ്കിലും പൊതികള്‍ പുതുക്കാനോ നീക്കം ചെയ്യാനോ നിര്‍വ്വാഹകത്തില്‍ ചട്ടം കെട്ടിയിട്ടുണ്ടെങ്കില്‍ അത് പുതുക്കല്‍ നാപടിയെ പ്രതികൂലമായി ബാധിക്കും. നിങ്ങളുടെ <filename>സ്രോതസ്സ്.പട്ടിക</filename><emphasis>stable</emphasis> ഓ അല്ലെങ്കില്‍ <emphasis>&releasename;</emphasis>ഓ അല്ലാതെ <emphasis>&oldreleasename;</emphasis>ലേക്ക് മുഖം തിരിച്ചിരിക്കുകയാണെങ്കില്‍ മാത്രമേ ഇത് ശരിപ്പെടുത്താന്‍ കഴിയൂ എന്ന് ശ്രദ്ധിക്കുമല്ലൊ ; <xref linkend="old-sources"/>കാണുക.
pt: Devido a disto você deve verificar novamente se existem acções pendentes no gestor de pacotes <command>aptitude</command>. Se um pacote estiver marcado para remoção ou para actualização no gestor de pacotes, poderá ter um impacto negativo no procedimento de actualização. Note que para corrigir isto apenas é possível se o seu <filename>sources.list</filename> ainda apontar para <emphasis>&oldreleasename;</emphasis>; e não para <emphasis>stable</emphasis> ou <emphasis>&releasename;</emphasis>; veja <xref linkend="old-sources"/>.
ro: Din această cauză ar trebui să verificați dacă sunt acțiuni în așteptare în managerul de pachete <command>aptitude</command>. Dacă un pachet este programat pentru ștergere sau actualizare în managerul de pachete ar putea avea un impact negativ asupra procedeului de actualizare. Țineți cont că acest lucru nu poate fi corectat decât dacă <filename>sources.list</filename> se referă încă la <emphasis>&oldreleasename;</emphasis> și nu la <emphasis>stable</emphasis> sau <emphasis>&releasename;</emphasis>, vedeți <xref linkend="old-sources"/>.
sv: På grund av detta bör du kontrollera om det finns några kommande åtgärder i pakethanteraren <command>aptitude</command>. Om ett paket är markerat för radering eller uppdatering i pakethanteraren kan det innebära att uppgraderingen drabbas negativt. Kom ihåg att detta endast kan åtgärdas om din <filename>sources.list</filename> fortfarande pekar på <emphasis>&oldreleasename;</emphasis> och inte på <emphasis>stable</emphasis> eller <emphasis>&releasename;</emphasis>, läs mer i <xref linkend="old-sources"/>.
