Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: You can list packages that take up most of the disk space with <systemitem role="package">aptitude</systemitem>. Start <command>aptitude</command> in <quote>visual mode</quote>, select <menuchoice><guimenu>Views</guimenu><guimenuitem>New Flat Package List</guimenuitem></menuchoice>, press <keycap>l</keycap> and enter <literal>~i</literal>, press <keycap>S</keycap> and enter <literal>~installsize</literal>, then it will give you nice list to work with.
fr: Vous pouvez afficher les paquets qui prennent le plus de place avec <systemitem role="package">aptitude</systemitem>. Lancez <command>aptitude</command> en <emphasis>mode interactif</emphasis>, choisissez <menuchoice><guimenu>Vues</guimenu><guimenuitem>Nouvelle vue des paquets</guimenuitem></menuchoice> (cette entrée de menu n'est disponible que depuis la version fournie dans etch), tapez <keycap>l</keycap> puis <literal>~i</literal>, tapez <keycap>S</keycap> puis <literal>~installsize</literal>, ce qui créera une liste patique pour travailler.
it: Si possono elencare i pacchetti che occupano molto spazio sul disco con <systemitem role="package">aptitude</systemitem>. Si avvii <command>aptitude</command> in <quote>modalità grafica</quote>, si selezioni <menuchoice><guimenu>Viste</guimenu><guimenuitem>Nuovo elenco unito dei pacchetti</guimenuitem></menuchoice>, si prema <keycap>l</keycap> e si inserisca <literal>~i</literal>, si prema <keycap>S</keycap> e si inserisca <literal>~installsize</literal>, a quel punto si dovrebbe ottenere un bell'elenco con cui lavorare.
ja: <systemitem role="package">aptitude</systemitem> を使っても、ディスク領域の大部分を占めているパッケージをリストアップできます。<command>aptitude</command> を<emphasis>ビジュアルモード</emphasis>で起動します。<menuchoice><guimenu>表示</guimenu><guimenuitem>平坦なパッケージ一覧を新規に作成</guimenuitem></menuchoice>を実行し、<keycap>l</keycap> を押して、<literal>~i</literal> と入力します。<keycap>S</keycap> を押して <literal>~installsize</literal> と入力します。すると、作業しやすい一覧が得られます。
pt: Você pode listar os pacotes que ocupam a maioria do espaço com o <systemitem role="package">aptitude</systemitem>. Arranque o <command>aptitude</command> em <quote>modo visual</quote>, seleccione <menuchoice><guimenu>Vistas</guimenu><guimenuitem>Nova Lista Plana de Pacotes</guimenuitem></menuchoice>, pressione <keycap>l</keycap> e insira <literal>~i</literal>, pressione <keycap>S</keycap> e insira <literal>~installsize</literal>, então irá ter uma boa lista para trabalhar.
ro: Puteți vedea lista cu pachetele ce ocupă cel mai mult spațiu cu <systemitem role="package">aptitude</systemitem>. Porniți <command>aptitude</command> în <quote>modul vizual</quote>, alegeți <menuchoice><guimenu>Vizualizări</guimenu><guimenuitem>Listă nouă simplă de pachete</guimenuitem></menuchoice> (<menuchoice><guimenu>Views</guimenu><guimenuitem>New Flat Package List</guimenuitem></menuchoice> în varianta engleză), apăsați tasta <keycap>l</keycap> și introduceți <literal>~i</literal>, apăsați <keycap>S</keycap> și introduceți <literal>~installsize</literal> și ca rezultat veți obține o listă cu care veți putea lucra ușor.
sv: Du kan visa de paket som tar upp mest plats på disken med <systemitem role="package">aptitude</systemitem>. Kör <command>aptitude</command> i <emphasis>visuellt läge</emphasis>, välj <menuchoice><guimenu>Vyer</guimenu><guimenuitem>Ny flat paketlista</guimenuitem></menuchoice> , tryck <keycap>l</keycap> och ange <literal>~i</literal>, tryck <keycap>S</keycap> och ange <literal>~installsize</literal>, så visas en praktisk lista att arbeta med.

source: Remove translations and localization files from the system if they are not needed. You can install the <systemitem role="package">localepurge</systemitem> package and configure it so that only a few selected locales are kept in the system. This will reduce the disk space consumed at <filename>/usr/share/locale</filename>.
fr: supprimer les traductions et les fichiers de localisation du système, s'ils ne sont pas nécessaires. Vous pouvez installer le paquet <systemitem role="package">localepurge</systemitem> et le configurer de manière à ce qu'un jeu restreint de paramètres régionaux (« locales ») soit conservé sur le système. Cela réduira la place occupée dans <filename>/usr/share/locale</filename>.
it: Si eliminino tutti i file di traduzioni e localizzazioni dal sistema se non sono necessari. È possibile installare il pacchetto <systemitem role="package">localepurge</systemitem> e configurarlo in modo che solo poche localizzazioni selezionate vengano mantenute sul sistema. Questo ridurrà lo spazio su disco occupato da <filename>/usr/share/locale</filename>.
ja: 翻訳や地域化用ファイルが不要なら、それらをシステムから削除する。<systemitem role="package">localepurge</systemitem> パッケージをインストールして設定すれば、選んだ少数のロケールのみがシステムに残るようにすることが可能です。これによって、<filename>/usr/share/locale</filename> の消費するディスク領域を減らせるでしょう。
ml: ആവശ്യമില്ലാത്ത പരിഭാഷകളും പ്രാദേശികവത്കരണ ഫയലുകളും നീക്കം ചെയ്യുക. <systemitem role="package">localepurge</systemitem> എന്ന പൊതി ഇന്‍സ്റ്റോള്‍ ചെയ്തു് തെരഞ്ഞെടുത്ത ലൊക്കേലുകള്‍ മാത്രമേ സിസ്റ്റത്തില്‍ സൂക്ഷിയ്ക്കുന്നുള്ളൂ എന്നു് ക്രമീകരിയ്ക്കുക. ഇതു് <filename>/usr/share/locale</filename> ല്‍ എടുക്കുന്ന ഡിസ്ക്ക് സ്ഥലം കുറയ്ക്കും.
pt: Remova ficheiros de localizações e traduções do seu sistema se não forem necessárias. Você pode instalar o pacote <systemitem role="package">localepurge</systemitem> e configurá-lo para que apenas os 'locales' seleccionados são mantidos no sistema. Isto irá reduzir o espaço de disco consumido em <filename>/usr/share/locale</filename>.
ro: Din sistem se pot șterge fișierele de traducere și localizare, în caz că nu mai sunt necesare. Se poate instala <systemitem role="package">localepurge</systemitem> și configura astfel încât doar câteva din localizări să fie păstrate în sistem. Aceasta va reduce din spațiul ocupat în <filename>/usr/share/locale</filename>.
sv: Ta bort översättningar och lokalanpassade filer för systemet om de inte behövs. Du kan installera paketet <systemitem role="package">localepurge</systemitem> och ställa in det så att endast de lokalanpassaningar som du vill ha sparas på systemet. Detta kommer att minska mängden hårddiskutrymme som används i <filename>/usr/share/locale</filename>.

source: Temporarily move to another system, or permanently remove, system logs residing under <filename>/var/log/</filename>.
fr: déplacer temporairement vers un autre système les journaux système résidant sous<filename>/var/log/</filename> (ou les supprimer définitivement).
it: Spostare temporaneamente su un altro sistema o rimuovere in modo permanente i log di sistema che si trovano in <filename>/var/log</filename>.
ja: <filename>/var/log/</filename> の下にあるシステムログを、一時的に他のシステムに移動するか、永久に削除する。
ml: <filename>/var/log/</filename> ലെ നാള്‍വഴികള്‍ തത്കാലം മറ്റൊരു സിസ്റ്റത്തിലേയ്ക്കു് നീക്കുകയോ എന്നേയ്ക്കുമായി നീക്കം ചെയ്യുകയോ ചെയ്യാം.
pt: Mova temporariamente para outro sistema, ou remova permanentemente, os relatórios do sistema residentes em <filename>/var/log/</filename>.
ro: Mutați temporar pe un alt sistem sau ștergeți permanent fișierele jurnal de sistem din <filename>/var/log/</filename>.
sv: Flytta systemloggar från <filename>/var/log/</filename> till ett annat system, eller ta bort permanent.
zh_tw: 把存放在 <filename>/var/log/</filename> 裡的系統記錄檔暫時移至其它的系統，或是乾脆刪除它們。

source: Use a temporary <filename>/var/cache/apt/archives</filename>: You can use a temporary cache directory from another filesystem (<acronym>USB</acronym> storage device, temporary hard disk, filesystem already in use, ...)
fr: utiliser un répertoire <filename>/var/cache/apt/archives</filename> temporaire. Vous pouvez utiliser un cache temporaire depuis un autre système de fichiers, un périphérique de stockage par <acronym>USB</acronym>, un disque dur temporaire, un système de fichier déjà utilisé, etc.
it: Usare un <filename>/var/cache/apt/archives</filename> temporaneo: è possibile usare una directory di cache temporanea da un altro file system (periferiche di memorizzazione <acronym>USB</acronym>, dischi fissi temporanei, file system già in uso, ecc.)
ja: 仮設の <filename>/var/cache/apt/archives</filename> を使用する。すなわち、別のファイルシステム (<acronym>USB</acronym> ストレージデバイス、一時的なハードディスク、既に使用されているファイルシステムなど) を仮設のキャッシュディレクトリとして拝借することができます。
ml: താത്കാലികമായി ഒരു <filename>/var/cache/apt/archives</filename> ഉപയോഗിയ്ക്കുക: താത്കാലികമായി സൂക്ഷിച്ചുവയ്ക്കുന്ന തട്ടു് മറ്റൊരു ഫയല്‍ സിസ്റ്റത്തില്‍ നിന്നും എടുക്കാം (<acronym>USB</acronym> സൂക്ഷിപ്പു് ഉപകരണം, താത്കാലിക ഹാര്‍ഡ് ഡിസ്ക്ക്, നേരത്തെ തന്നെ ഉപയോഗിയ്ക്കുന്ന ഫയല്‍ സിസ്റ്റം. ...)
pt: Use um <filename>/var/cache/apt/archives</filename> temporário: Você pode usar um directório de cache temporário de outro sistema de ficheiros (dispositivo de armazenamento <acronym>USB</acronym>, disco rijo temporário, sistema de ficheiros já em utilização, ...)
ro: Folosiți un <filename>/var/cache/apt/archives</filename> temporar: puteți folosi un director pentru depozitul temporar de pe alt sistem de fișiere (dispozitiv de stocare <acronym>USB</acronym>, harddisk de împrumut, un alt sistem de fișiere în utilizare, ...)
sv: Använd en temporär <filename>/var/cache/apt/archives</filename>: Du kan använda en temporär cachekatalog på ett annat filsystem (<acronym>USB</acronym>-diskenhet, temporär hårddisk, filsystem som redan används, ...).

source: Do not use an <acronym>NFS</acronym> mount as the network connection could be interrupted during the upgrade.
fr: N'utilisez pas de montage <acronym>NFS</acronym> car la connexion réseau pourrait être interrompue au cours de la mise à niveau.
it: Non si usi una partizione montata via <acronym>NFS</acronym>, in quanto la connessione di rete potrebbe essere interrotta durante l'aggiornamento.
ja: アップグレード中にネットワーク接続が途切れる可能性があるので、<acronym>NFS</acronym> マウントは使用しないでください。
ml: ശൃംഖലാ ബന്ധം നവീകരണത്തിനിടയില്‍ തടസ്സപ്പെടാനിടയുള്ളതിനാല്‍ <acronym>എന്‍എഫ്‌എസ്</acronym> വഴി ചേര്‍ത്തതുപയോഗിയ്ക്കരുതു്.
pt: Não use uma montagem <acronym>NFS</acronym> porque a ligação de rede pode ser interrompida durante a actualização.
ro: Nu folosiți o partiție <acronym>NFS</acronym> deoarece conexiunea de rețea ar putea fi întreruptă în timpul actualizării.
sv: Använd inte en <acronym>NFS</acronym>-montering eftersom nätverksanslutningen kan avbrytas under uppgraderingen.

source: For example, if you have a <acronym>USB</acronym> drive mounted on <filename>/media/usbkey</filename>:
fr: Par exemple, si une clé <acronym>USB</acronym> est montée sur <filename>/media/cleusb</filename> :
it: Per esempio, se si possiede un disco o una penna <acronym>USB</acronym> montato in <filename>/media/usbkey</filename>:
ja: 以下は、<filename>/media/usbkey</filename> にマウントされた <acronym>USB</acronym> ドライブがある場合を例とします。
ml: ഉദാഹരണത്തിനു്, നിങ്ങളുടെ കയ്യില്‍ <filename>/media/usbkey</filename> ചേര്‍ത്ത ഒരു <acronym>യുഎസ്ബി</acronym> ഡ്രൈവുണ്ടെങ്കില്‍:
pt: Por exemplo, se você tem um dispositivo <acronym>USB</acronym> montado em <filename>/media/usbkey</filename>:
ro: De exemplu, dacă aveți un dispozitiv <acronym>USB</acronym> montat la <filename>/media/usbkey</filename>:
sv: Till exempel, om du har en <acronym>USB</acronym>-diskenhet monterad på <filename>/media/usbkey</filename>:

source: remove the packages that have been previously downloaded for installation:
fr: supprimez les paquets téléchargés lors d'une précédente installation :
it: si rimuovano i pacchetti precedentemente scaricati per l'installazione:
ja: 今までに、インストールのためにダウンロードされたパッケージを削除します。
ml: ഇന്‍സ്റ്റോള്‍ ചെയ്യാനായി നേരത്തെ എടുത്തുവച്ച പൊതികള്‍ നീക്കം ചെയ്യുക:
pt: remove os pacotes que foram descarregados préviamente para instalação:
ro: ștergeți pachetele care au fost descărcate anterior spre instalare:
sv: ta bort paket som tidigare hämtats för installation:

source: copy the directory <filename>/var/cache/apt/archives</filename> to the <acronym>USB</acronym> drive:
fr: copiez le répertoire <filename>/var/cache/apt/archives</filename> sur le disque <acronym>USB</acronym> :
it: si copi la directory <filename>/var/cache/apt/archives</filename> nella periferica <acronym>USB</acronym>:
ja: ディレクトリ <filename>/var/cache/apt/archives</filename> を、<acronym>USB</acronym> ドライブにコピーします。
ml: <filename>/var/cache/apt/archives</filename> എന്ന തട്ടു് <acronym>യുഎസ്ബി</acronym> ഡ്രൈവിലേയ്ക്കു് പകര്‍ത്തുക:
pt: copia o directório <filename>/var/cache/apt/archives</filename> para o dispositivo <acronym>USB</acronym>:
ro: copiați directorul <filename>/var/cache/apt/archives</filename> pe dispozitivul <acronym>USB</acronym>:
sv: kopiera katalogen <filename>/var/cache/apt/archives</filename> till <acronym>USB</acronym>-diskenheten:

source: mount the temporary cache directory on the current one:
fr: montez le répertoire de cache temporaire à la place de l'actuel :
it: si monti la directory della cache temporanea su quella attuale:
ja: 現在のキャッシュディレクトリに、仮設のキャッシュディレクトリをマウントします。
ml: താത്കാലികമായി സൂക്ഷിയ്ക്കുന്ന തട്ടു് ഇപ്പോഴുള്ളതില്‍ ചേര്‍ക്കുക:
pt: monta o directório de cache temporário no que está presente:
ro: montați directorul pentru depozit temporar peste cel curent:
sv: montera den temporära cachekatalogen ovanpå den nuvarande:

source: after the upgrade, restore the original <filename>/var/cache/apt/archives</filename> directory:
fr: après la mise à niveau, rétablissez le répertoire <filename>/var/cache/apt/archives</filename> initial :
it: dopo l'aggiornamento, si ripristini la directory <filename>/var/cache/apt/archives</filename> originale:
ja: アップグレード後に、元々の <filename>/var/cache/apt/archives</filename> ディレクトリを復活させます。
ml: നവീകരണത്തിനു് ശേഷം നേരത്തെയുണ്ടായിരുന്ന <filename>/var/cache/apt/archives</filename> തിരിച്ചു് വയ്ക്കുക:
pt: após a actualização, restaura o directório <filename>/var/cache/apt/archives</filename> original:
ro: după actualizare restaurați directorul <filename>/var/cache/apt/archives</filename> original:
sv: efter uppgraderingen återställer du originalkatalogen <filename>/var/cache/apt/archives</filename>:

source: remove the remaining <filename>/media/usbkey/archives</filename>.
fr: supprimez le répertoire subsistant <filename>/media/cleusb/archives</filename>.
it: si rimuova il restante <filename>/media/usbkey/archives</filename>.
ja: 残っている <filename>/media/usbkey/archives</filename> を削除します。
ml: <filename>/media/usbkey/archives</filename> ല്‍ ബാക്കിയുള്ള നീക്കം ചെയ്യുക
pt: remove o restante <filename>/media/usbkey/archives</filename>.
ro: ștergeți <filename>/media/usbkey/archives</filename> rămas.
sv: radera det som lämnats kvar i <filename>/media/usbkey/archives</filename>.

source: You can create the temporary cache directory on whatever filesystem is mounted on your system.
fr: Vous pouvez créer le répertoire de cache temporaire dans n'importe quel système de fichiers monté sur le système.
it: È possibile creare la cache temporanea su qualsiasi file system montato sul proprio sistema.
ja: 仮設のキャッシュディレクトリは、システムにマウントされているファイルシステムであれば何にでも作成できます。
ml: നിങ്ങളുടെ സിസ്റ്റത്തില്‍ ചേര്‍ത്തിട്ടുള്ള ഏതു് തട്ടിലും താത്കാലികമായി സൂക്ഷിയ്ക്കാനുള്ള തട്ടു് സൃഷ്ടിയ്ക്കാം.
pt: Você pode criar o directório de cache temporário em qualquer sistema de ficheiros que esteja montado no seu sistema.
ro: puteți crea directorul pentru depozit temporar pe orice sistem de fișiere montat pe sistemul dumneavoastră.
sv: Du kan skapa den temporära cachekatalogen på vilket filsystem som helst som finns monterat på ditt system.

source: Do a minimal upgrade of the system (see <xref linkend="minimal-upgrade"/>) or partial upgrades of the system followed by a full upgrade. This will make it possible to upgrade the system partially, and allow you to clean the package cache before the full upgrade.
fr: Effectuez une mise à niveau minimale (consultez <xref linkend="minimal-upgrade"/>) ou partielle suivie par une mise à niveau complète. Ceci vous permettra de mettre à niveau partiellement le système, et de nettoyer le cache avant la mise à niveau complète.
it: Effettuare un aggiornamento minimo del sistema (vedere <xref linkend="minimal-upgrade"/>) oppure degli aggiornamenti parziali seguiti da un aggiornamento completo. Questo permette l'aggiornamento parziale del sistema e permette di pulire la cache dei pacchetti prima dell'aggiornamento completo.
ja: システムの最小アップグレードを行う (<xref linkend="minimal-upgrade"/> 参照)、あるいは完全アップグレードにしたがって、システムの部分的なアップグレードを行う。これによって、システムを部分的にアップグレードが可能になり、完全アップグレード前にパッケージキャッシュの削除ができます。
pt: Faça uma actualização mínima do sistema (veja <xref linkend="minimal-upgrade"/>) ou actualizações parciais do sistema seguido de uma actualização completa. Isto irá tornar possível actualizar o sistema parcialmente, e permitir-lhe limpar a cache de pacotes antes da actualização completa.
ro: Executați o actualizare minimală a sistemului (citiți <xref linkend="minimal-upgrade"/>) sau actualizări parțiale a sistemului urmată de o actualizare completă. Acest lucru va face posibil să actualizați sistemul parțial și vă va permite curățirea depozitului temporar de pachete înainte de actualizarea completă.
sv: Gör en minimal uppgradering av systemet (läs <xref linkend="minimal-upgrade"/>) eller partiell uppgradering av systemet följt av en komplett uppgradering. Detta kommer att göra det möjligt att uppgradera systemet partiellt och ger dig möjlighet att tömma paket-cache före den kompletta uppgraderingen.

source: Note that in order to safely remove packages, it is advisable to switch your <filename>sources.list</filename> back to &oldreleasename; as described in <xref linkend="old-sources"/>.
fr: Notez que pour supprimer des paquets sans dommage, il est conseillé de changer <filename>sources.list</filename> pour pointer vers &oldreleasename;, comme décrit en <xref linkend="old-sources"/>.
it: Si noti che per rimuovere pacchetti in modo sicuro è preferibile tornare a far puntare il proprio <filename>sources.list</filename> a &oldreleasename;, come descritto in <xref linkend="old-sources"/>.
ja: パッケージを安全に削除するための注意として、<xref linkend="old-sources"/>で説明するように、<filename>sources.list</filename> が &oldreleasename; を指し示すよう設定を戻しておくことが望ましいです。
ml: സുരക്ഷിതമായി പൊതികള്‍ നീക്കം ചെയ്യാന്‍ നിങ്ങളുടെ <filename>sources.list</filename> തിരിച്ചു് &oldreleasename; എന്നാക്കാനാണു്, <xref linkend="old-sources"/>ല്‍ വിവരിച്ച പോലെ, നിര്‍ദ്ദേശിയ്ക്കുന്നതു്.
pt: Note que, de modo para remover pacotes em segurança, é aconselhável mudar o seu <filename>sources.list</filename> de novo para &oldreleasename; conforme é explicado em <xref linkend="old-sources"/>.
ro: Țineți cont că pentru a putea șterge pachete în siguranță se recomandă să treceți <filename>sources.list</filename> înapoi la &oldreleasename; după cum este descris în <xref linkend="old-sources"/>.
sv: Observera att du för att ta bort paket på ett säkert sätt, rekommenderas växla tillbaka din <filename>sources.list</filename> till &oldreleasename; vilket förklaras i <xref linkend="old-sources"/>.

source: Minimal system upgrade
fr: Mise à niveau minimale du système
it: Aggiornamento minimo del sistema
ja: システムの最小アップグレード
ml: ചുരുങ്ങിയ സിസ്റ്റത്തിന്റെ നവീകരണം
pt: Actualização mínima do sistema
ro: Actualizare minimală de sistem
sv: Minimal systemuppgradering
zh_tw: 系統最低限度升級

source: In some cases, doing the full upgrade (as described below) directly might remove large numbers of packages that you will want to keep. We therefore recommend a two-part upgrade process, first a minimal upgrade to overcome these conflicts, then a full upgrade as described in <xref linkend="upgrading-full"/>.
fr: Il est possible que le lancement d'une mise à niveau complète (décrite ci-dessous) supprime un grand nombre de paquets que vous voudriez garder. Nous recommandons donc une action en deux temps, au début une mise à niveau minimale pour éviter ces conflits, puis une mise à niveau totale (consultez <xref linkend="upgrading-full"/>).
it: In alcuni casi, eseguire direttamente un aggiornamento completo (come descritto più avanti) potrebbe rimuovere un gran numero di pacchetti che si potrebbe voler mantenere. È quindi raccomandato un processo di aggiornamento in due parti: prima un aggiornamento minimo che risolva questi conflitti, poi un aggiornamento completo come descritto in <xref linkend="upgrading-full"/>.
ja: 完全アップグレード (以下に記述しています) を直接行った場合、残しておきたいパッケージが大量に削除されてしまうことが時折あります。そのため、まずはこれらの競合状態を打開するための最小アップグレードを行い、その上で <xref linkend="upgrading-full"/> にあるような完全な <literal>dist-upgrade</literal> を行う、という 2 段階のアップグレード過程を踏むことをお勧めします。
pt: Em alguns casos, fazer a actualização completa (como descrita em baixo) directamente pode remover grandes quantidades de pacotes que poderá querer manter. Portanto recomendamos um processo de actualização em duas partes, primeiro uma actualização mínima para ultrapassar estes conflitos, e depois uma actualização completa como descrita em <xref linkend="upgrading-full"/>.
ro: În unele cazuri, dacă faceți o actualizare completă (așa cum e descrisă mai jos) direct, puteți șterge un număr mare de pachete pe care ați dori să le păstrați. Așadar vă recomandăm o actualizare în doi pași, mai întâi o actualizare minimală pentru a depăși conflictele, apoi o actualizare completă așa cum este descrisă în <xref linkend="upgrading-full"/>.
sv: I vissa fall kan en komplett uppgradering (som beskrivs nedan) innebära att många paket som du vill behålla raderas. Vi rekommenderar därför en två-stegs-uppgradering. Först en minimal uppgradering för att bli av med konflikter och sedan en komplett uppgradering som beskrivs i <xref linkend="upgrading-full"/>.

source: To do this first, run:
fr: Pour ce faire, exécutez :
it: Per farlo eseguire:
ja: これをまず行うには、以下のコマンドを実行してください。
pt: Para fazer isto primeiro, corra:
ro: Pentru a face mai întâi asta, rulați:
sv: För att göra detta, kör först:

source: This has the effect of upgrading those packages which can be upgraded without requiring any other packages to be removed or installed.
fr: Cette commande met à niveau les paquets qui peuvent l'être sans entraîner l'installation ou la suppression d'autres paquets.
it: Questo consentirà l'aggiornamento di quei pacchetti che possono essere aggiornati senza richiedere l'installazione o la rimozione di altri pacchetti.
ja: このコマンドには、アップグレードしても他のパッケージをインストール・削除する必要がないパッケージだけをアップグレードする、という効果があります。
ml: മറ്റു് പൊതികള്‍ നീക്കം ചെയ്യുന്നതോ ഇന്‍സ്റ്റോള്‍ ചെയ്യുന്നതോ ആവശ്യമില്ലാതെ നവീകരിയ്ക്കാന്‍ കഴിയുന്ന പൊതികള്‍ നവീകരിയ്ക്കാന്‍ ഇതു് വഴി കഴിയും.
pt: Isto tem o efeito de actualizar os pacotes que podem ser actualizados sem que nenhum outro pacote seja removido ou instalado.
ro: Aceasta are ca efect actualizarea acelor pachete care pot fi actualizate fără ca alte pachete să fie șterse sau instalate.
sv: Det här innebär att endast de paket som kan uppgraderas utan att kräva att några andra paket tas bort eller installeras uppgraderas.
zh_tw: 這樣會將那些在升級過程中不需要移除或安裝到其它套件的套件進行升級。

source: The minimal system upgrade can also be useful when the system is tight on space and a full upgrade cannot be run due to space constrains.
fr: La mise à niveau minimale peut aussi être utilisée sur un système limité en taille, sur lequel une mise à niveau complète prendrait trop d'espace.
it: L'aggiornamento minimo può essere utile anche quando non è possibile effettuare un aggiornamento completo perché sul sistema c'è poco spazio libero.
ja: システムの容量が少なく、容量による制約のため完全アップグレードが実行できない場合にも、システムの最小アップグレードは有用です。
pt: A actualização mínima do sistema também pode ser útil quando o sistema está apertado em espaço e não se pode executar uma actualização completa devido a restrições de espaço.
ro: Actualizarea minimală a sistemului poate fi folositoare și atunci când sistemul nu dispune de spațiu suficient și nu se poate face o actualizare completă datorită constrângerilor de spațiu.
sv: Den minimala uppgraderingen kan också vara användbar när systemet har ont om utrymme och en komplett uppgradering inte kan utföras på grund av utrymmesskäl.
