Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: Also, review the contents of your <filename>/etc/kernel-img.conf</filename> and make sure that you have <literal>do_bootloader = Yes</literal> in it. That way the bootloader will always be rerun after a kernel upgrade.
fr: Vérifiez également le contenu du fichier <filename>/etc/kernel-img.conf</filename> et assurez-vous d'avoir <literal>do_bootloader = Yes</literal> dans celui-ci. Ainsi, le programme d'amorçage sera toujours réexécuté après une mise à niveau du noyau.
it: Si controlli inoltre il contenuto del file <filename>/etc/kernel-img.conf</filename> e ci si assicuri che contenga <literal>do_bootloader = Yes</literal>. In tal modo il bootloader sarà sempre rieseguito dopo un aggiornamento del kernel.
ja: また、<filename>/etc/kernel-img.conf</filename> の内容を調べ、<literal>do_bootloader = Yes</literal> と書かれていることを確認してください。この設定のとおり、カーネルをアップグレードした後には必ずブートローダが再実行されます。
ml: <filename>/etc/kernel-img.conf</filename> എന്ന ഫയലിന്റെ ഉള്ളടക്കം പരിശോധിച്ച് <literal>do_bootloader = Yes</literal> ഉണ്ടോ എന്നു പരിശോധിക്കുക. ഇങ്ങനെ ഓരോ കെര്‍ണല്‍ നവീകരണത്തിനു ശേഷം ബൂട്ട്ലോഡര്‍ വീണ്ടും പ്രവര്‍ത്തിപ്പിക്കുന്നതാണു്.
pt: Além disso, reveja o conteúdo do seu <filename>/etc/kernel-img.conf</filename> e assegure-se que tem nele <literal>do_bootloader = Yes</literal>. Dessa forma o gestor de arranque irá sempre ser corrido novamente após uma actualização do kernel.
ro: De asemenea, revizuiți conținutul fișierului <filename>/etc/kernel-img.conf</filename> și asigurați-vă că aveți opțiunea <literal>do_bootloader = Yes</literal> în el. Astfel, încărcătorul de sistem va fi rulat întotdeauna după o actualizare de nucleu.
sv: Kontrollera även innehållet i din <filename>/etc/kernel-img.conf</filename> och säkerställ att du har <literal>do_bootloader = Yes</literal> i den. På det viset kommer uppstartshanteraren alltid att köras efter en uppgradering av kärnan.

source: If you encounter any issues when running <command>lilo</command>, review the symbolic links in <filename>/</filename> or <filename>/boot</filename> to <filename>vmlinuz</filename> and <filename>initrd</filename> and the contents of your <filename>/etc/lilo.conf</filename> for discrepancies.
fr: Si vous rencontrez des problèmes lors de l'exécution de <command>lilo</command>, veuillez vérifier les liens symboliques dans <filename>/</filename> ou <filename>/boot</filename> vers <filename>vmlinuz</filename> et <filename>initrd</filename>, ainsi que le contenu du fichier <filename>/etc/lilo.conf</filename>.
it: Se si incontrano problemi durante l'esecuzione di <command>lilo</command>, si controllino i collegamenti simbolici in <filename>/</filename> o in <filename>/boot</filename> a <filename>vmlinuz</filename> e a <filename>initrd</filename>, nonché il contenuto del proprio <filename>/etc/lilo.conf</filename> per eventuali discrepanze.
ja: <command>lilo</command> を実行しているときに何らかの問題が発生した場合は、<filename>vmlinuz</filename> と <filename>initrd</filename> へのシンボリックリンクが <filename>/</filename> あるいは <filename>/boot</filename> 内に存在するか、また <filename>/etc/lilo.conf</filename> の内容に食い違いがないか、確認してください。
pt: Se você encontrar quaisquer problemas quando correr o <command>lilo</command>, reveja os links simbólicos em <filename>/</filename> ou <filename>/boot</filename> para <filename>vmlinuz</filename> e <filename>initrd</filename>, assim como o conteúdo do seu <filename>/etc/lilo.conf</filename> por discrepâncias.
ro: Dacă întâmpinați probleme în timpul rulării comenzii <command>lilo</command>, verificați dacă nu există discrepanțe între legăturile simbolice din <filename>/</filename> sau <filename>/boot</filename> către <filename>vmlinuz</filename> și <filename>initrd</filename>, și conținutul lui <filename>/etc/lilo.conf</filename>.
sv: Skulle några problem uppstå när du kör <command>lilo</command> kontrollera de symboliska länkarna i <filename>/</filename> eller <filename>/boot</filename> till <filename>vmlinuz</filename> och <filename>initrd</filename> samt att innehållet i <filename>/etc/lilo.conf</filename> inte avviker från detta.

source: If you forgot to rerun <command>lilo</command> before the reboot or the system is accidentally rebooted before you could do this manually, your system might fail to boot. Instead of the lilo prompt, you will only see <literal>LI</literal> when booting the system<footnote>
fr: Si vous avez oublié de réexécuter <command>lilo</command> avant le prochain redémarrage ou si le système est redémarré accidentellement avant que vous ne puissiez le faire manuellement, le système peut ne plus démarrer. Au lieu de l'invite lilo, vous ne verrez que <literal>LI</literal> lors de l'amorçage du système<footnote>
it: Se ci si dimentica di rieseguire <command>lilo</command> prima del riavvio, o se il sistema viene riavviato accidentalmente prima che lo si possa fare manualmente, il sistema potrebbe non riuscire ad avviarsi. Al posto del prompt di LILO, si vedrà soltanto <literal>LI</literal> all'avvio del sistema<footnote>
ja: 再起動する前に <command>lilo</command> を実行しなおすのを忘れたり、手動で実行しなおす前にシステムが偶発的に再起動してしまった場合、システムは起動できなくなるでしょう。その場合、システム起動時に lilo プロンプト全体は表示されず、最初の <literal>LI</literal> だけが表示されます<footnote>
ml: വീണ്ടും ബൂട്ട് ചെയ്യുന്നതിന് മുമ്പേ <command>lilo</command> ഓടിക്കാന്‍ മറക്കുകയോ അല്ലെങ്കില്‍ അതിന് മുമ്പേ വ്യവസ്ഥിതി തനിയേ വീണ്ടും ബൂട്ട് ചെയ്യപ്പെടുകയോ ആണെങ്കില്‍ നിങ്ങളുടെ വ്യ‌‌വസ്ഥിതിയുടെ ബൂട്ടിങ്ങ് പരാജയപ്പെടും. ലിലോ കണിശമായി കാണിക്കുന്നതിന് പകരം വ്യവസ്ഥിതി ബൂട്ട് ചെയ്യുന്ന സമയത്ത് <literal>LI</literal> മാത്രമേ കാണാന്‍ കഴിയൂ.<footnote>
pt: Se você se esqueceu de correr novamente o <command>lilo</command> antes de reiniciar ou se o sistema for acidentalmente reiniciado antes de você o poder fazer manualmente, o seu sistema pode falhar o arranque. Em vez da prompt do lilo, você apenas verá <literal>LI</literal> quando arrancar o sistema<footnote>
ro: Dacă ați uitat să rulați din nou comanda <command>lilo</command> înainte de repornire sau sistemul a fost repornit din întâmplare înainte ca să o rulați manual comanda, este posibil ca sistemul să nu pornească. În locul promptului lilo veți vedea doar <literal>LI</literal> la pornirea sistemului<footnote>
sv: Om du glömmer att köra <command>lilo</command> innan omstart av systemet eller om systemet startas om av misstag innan du gjort detta manuellt kan det innebära att systemet inte kan startas normalt. Istället för den vanliga lilo-bilden kommer endast <literal>LI</literal> visas när systemet ska startas<footnote>

source: For more information on <command>lilo</command>'s boot error codes please see <ulink url="http://tldp.org/HOWTO/Bootdisk-HOWTO/a1483.html">The Linux Bootdisk HOWTO</ulink>.
fr: Pour plus d'informations sur les codes d'erreurs de <command>lilo</command>, veuillez consulter <ulink url="http://tldp.org/HOWTO/Bootdisk-HOWTO/a1483.html">The Linux Bootdisk HOWTO</ulink>.
it: Per maggiori informazioni sui codici di errore dell'avvio di <command>lilo</command> si veda <ulink url="http://tldp.org/HOWTO/Bootdisk-HOWTO/a1483.html">The Linux Bootdisk HOWTO</ulink> (in lingua inglese. La versione in italiano si trova in <ulink url="http://www.pluto.it/ildp/howto/bootdisk.html"/>, ma attualmente la traduzione non è aggiornata).
ja: <command>lilo</command> の起動エラーコードについてさらに詳しく知りたい場合は、<ulink url="http://tldp.org/HOWTO/Bootdisk-HOWTO/a1483.html">The Linux Bootdisk HOWTO</ulink> (<ulink url="http://linuxjf.sourceforge.jp/JFdocs/Bootdisk-HOWTO-12.html">日本語訳</ulink>) を参照してください。
ml: <command>lilo</command>യുടെ ബൂട്ടിങ്ങ് പിശക് കോടുകളുടെ വിശദ വിവരങ്ങള്‍ക്ക് ദയവായി <ulink url="http://tldp.org/HOWTO/Bootdisk-HOWTO/a1483.html">The Linux Bootdisk HOWTO</ulink> കാണുക.
pt: Para mais informação sobre códigos de erro no arranque do <command>lilo</command> por favor veja <ulink url="http://tldp.org/HOWTO/Bootdisk-HOWTO/a1483.html">The Linux Bootdisk HOWTO</ulink>.
ro: Pentru mai multe informații despre codurile de eroare <command>lilo</command> a se vedea <ulink url="http://tldp.org/HOWTO/Bootdisk-HOWTO/a1483.html">The Linux Bootdisk HOWTO</ulink>.
sv: För mer information om <command>lilo</command>s felkoder i uppstarten se <ulink url="http://tldp.org/HOWTO/Bootdisk-HOWTO/a1483.html">The Linux Bootdisk HOWTO</ulink>.
zh_tw: 有關 <command>lilo</command> 的開機錯誤訊息之更詳盡資訊請參考 <ulink url="http://tldp.org/HOWTO/Bootdisk-HOWTO/a1483.html">The Linux 開機磁碟指南</ulink>。

source: </footnote>. See <xref linkend="recovery"/> for information on how to recover from this.
fr: </footnote>. Consultez <xref linkend="recovery"/> pour des informations sur les méthodes de secours à partir de ce point.
it: </footnote>. Per informazioni su come ripristinare da questa condizione, si veda <xref linkend="recovery"/>.
ja: </footnote>。この状態からシステムを復旧させる方法について知りたい場合は、<xref linkend="recovery"/> を参照してください。
ml: </footnote>. ഇതില്‍ നിന്നും കരകയറുന്നതു എങ്ങനെയെന്നറിയാന്‍ ഇവിടെ <xref linkend="recovery"/> നോക്കുക
pt: </footnote>. Veja <xref linkend="recovery"/> para informação em como recuperar de esta situação.
ro: </footnote>. A se vedea <xref linkend="recovery"/> pentru soluții de recuperare din această situație.
sv: </footnote>. Se även <xref linkend="recovery"/> för mer information om att återhämta sig från detta.
zh_tw: </footnote>。關於如何進行回復請參閱 <xref linkend="recovery"/> 以取得更多詳盡資訊。

source: Upgrading mdadm
fr: Mise à niveau de mdadm
it: Aggiornamento di mdadm
ja: mdadm のアップグレード
ml: mdadm നവീകരിക്കുന്നു
pt: Actualizar o mdadm
ro: Actualizarea mdadm
sv: Uppgradering av mdadm
zh_tw: 更新 mdadm

source: TODO: Remove for lenny?
it: TODO: rimuovere per lenny?
ja: TODO: lenny では削除する?
ml: TODO: ലെന്നിയില്‍ നിന്നും കളയണോ?
sv: TODO: Ta bort i och med lenny?

source: mdadm now needs a configuration file to assemble MD arrays (<acronym>RAID</acronym>) from the initial ramdisk and during the system initialisation sequence. Please make sure to read and act upon the instructions in <filename>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</filename> after the package has been upgraded <emphasis role="strong">and before you reboot</emphasis>. The latest version of this file is available at <ulink url="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file"></ulink>; please consult it in case of problems.
fr: mdadm a maintenant besoin d'un fichier de configuration pour assembler des tables MD (<acronym>RAID</acronym>) à partir du «&nbsp;ramdisk&nbsp;» initial. Veuillez vous assurer de lire et de suivre les instructions dans <filename>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</filename> après la mise à niveau du paquet <emphasis role="strong">et avant le redémarrage</emphasis>. La dernière version de ce fichier est disponible à <ulink url="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file"></ulink> ; veuillez la consulter en cas de problème.
it: mdadm necessita ora di un file di configurazione per assemblare gli array MD (<acronym>RAID</acronym>) dal disco ram iniziale e durante la sequenza d'inizializzazione del sistema. Ci si accerti di aver letto e applicato le istruzioni contenute in <filename>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</filename> dopo l'aggiornamento del pacchetto <emphasis role="strong">e prima di riavviare il sistema</emphasis>. L'ultima versione di questo file è disponibile in <ulink url="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file"></ulink>; lo si consulti in caso di problemi.
ja: mdadm は、initial ramdisk からの MD アレイ (<acronym>RAID</acronym>) の再構築やシステム初期化シーケンス中に再構築に設定ファイルを必要とするようになりました。パッケージのアップグレードを終えた後、<emphasis role="strong">再起動する前に</emphasis>必ず <filename>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</filename> に書かれている説明を読み、それに従ってください。このファイルの最新版は <ulink url="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file"></ulink> で閲覧可能です。問題が生じた場合は参考にしてください。
ml: വ്യവസ്ഥിതിയുടെ ആരംഭശ്രേണിയിലും ആദി റാംഡിസ്കിലും MDനിരകള്‍ (<acronym>RAID</acronym>) ഏകോപിപ്പിക്കുന്നതിന് mdadmന് ഇപ്പോള്‍ ഒരു ക്രമീകരണ ഫയല്‍ ആവശ്യ‌‌‌‌മാണ്. പൊതികള്‍ നവീകരിച്ച ശേഷവും <emphasis role="strong">വീണ്ടും ബൂട്ട് ചെയ്യുന്നതിനു മുമ്പും </emphasis> <filename>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</filename>ലെ ഉള്ളടക്ക നിര്ദ്ദേശങ്ങള്‍ വായിച്ച് നടപ്പാക്കുമെന്ന് ദയവായി ഉറപ്പാക്കുക. ഈ ഫയലിന്റെ ഏറ്റവും പുതിയ പതിപ്പ് <ulink url="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file"></ulink>;ല്‍ ലഭ്യ‌‌മാണ്. പ്രശ്നങ്ങളുണ്ടാവുമ്പോള്‍ അവ പരിശോധിക്കുമല്ലൊ.
pt: O mdadm precisa agora de um ficheiro de configuração para montar 'MD arrays' (<acronym>RAID</acronym>) a partir da ramdisk inicial e durante a sequência de inicialização do sistema. Por favor leia e siga as instruções em <filename>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</filename> depois de o pacote ter sido actualizado e <emphasis role="strong">antes de reiniciar</emphasis>. A última versão deste ficheiro está disponível em <ulink url="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file"></ulink>; por favor consulte-o em caso de problemas.
ro: Acum mdadm necesită un fișier de configurare pentru a putea asambla șirurile MD (<acronym>RAID</acronym>) din ramdiscul inițial în timpul secvenței de inițializare a sistemului. Este recomandat să cițiti și să urmăriți pașii din <filename>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</filename> după înnoirea pachetului și <emphasis role="strong">înainte de repornirea sistemului</emphasis>. Ultima versiune a fișierului este disponibilă la <ulink url="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file"></ulink>; este recomandată consultarea lui în caz de probleme.
sv: mdadm behöver nu en konfigurationsfil för att sätta samman MD-kedjor (<acronym>RAID</acronym>) från den initiala ramdisken och under systemets initieringssekvens. Se till att läsa och agera efter de instruktioner som finns i <filename>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</filename> efter att paketet har uppgraderats <emphasis role="strong">och innan du startar om</emphasis>. Den senaste versionen av den här filen finns tillgänglig på <ulink url="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file"></ulink>; läs den om du får problem.
zh_tw: mdadm 現在需要設定檔來在 initial ramdisk 及系統初始化過程中建構 MD 陣列 (<acronym>RAID</acronym>)。在該套件被更新後、<emphasis role="strong">在您重新啟動之前</emphasis>，請務必閱讀並依照 <filename>/usr/share/doc/mdadm/README.upgrading-2.5.3.gz</filename> 的內容進行。這個檔案的最新版可以在 <ulink url="http://svn.debian.org/wsvn/pkg-mdadm/mdadm/trunk/debian/README.upgrading-2.5.3?op=file"></ulink> 取得，若遭遇任何問題請不妨參閱。

source: System boot hangs on <literal>Waiting for root file system</literal>
fr: Le démarrage du système s'interrompt sur le message <literal>Waiting for root file system</literal>
it: L'avvio del sistema si blocca su <literal>Waiting for root file system</literal>
ja: システムの起動が <literal>Waiting for root file system</literal> とともにハングしてしまう
ml: <literal>Waiting for root file system</literal> എന്നു് പറഞ്ഞു് സിസ്റ്റം ബൂട്ട് സ്തംഭിയ്ക്കുന്നു
pt: O arranque do sistema pendura em <literal>Waiting for root file system</literal>
ro: Inițializarea sistemului se blochează la mesajul <literal>Waiting for root file system</literal>
sv: Systemets uppstart stannar vid <literal>Väntar på rotfilsystem</literal>
zh_tw: 系統開機時當在 <literal>Waiting for root file system</literal>

source: Procedure to recover from <filename>/dev/hda</filename> that became <filename>/dev/sda</filename>
fr: Procédure de secours en cas de changement de <filename>/dev/hda</filename> en <filename>/dev/sda</filename>
it: Procedura per il recupero da <filename>/dev/hda</filename> che è diventato <filename>/dev/sda</filename>
ja: <filename>/dev/sda</filename> となってしまった <filename>/dev/hda</filename> の復旧手順
ml: <filename>/dev/sda</filename> ആയിത്തീര്‍ന്ന <filename>/dev/hda</filename>ല്‍നിന്ന് വീണ്ടെടുക്കുന്നതിനുള്ള നടപടി
pt: Procedimento para recuperar de <filename>/dev/hda</filename> ter-se tornado <filename>/dev/sda</filename>
ro: Procedura de recuperare când <filename>/dev/hda</filename> devine <filename>/dev/sda</filename>
sv: Procedur för att återhämta sig från att <filename>/dev/hda</filename> blev <filename>/dev/sda</filename>

source: Some users have reported that an upgrade could cause the kernel not to find the system root partition after a system reboot.
fr: Des utilisateurs ont signalé que suite à une mise à niveau, le noyau pouvait ne plus trouver la partition racine lors du démarrage.
it: Taluni utenti hanno riferito che un aggiornamento potrebbe impedire al kernel di trovare la partizione radice del sistema dopo un riavvio.
ja: 一部のユーザからの報告によれば、アップグレードを実行すると、システム再起動後にカーネルがシステムのルートパーティションを見つけられなくなるようです。
ml: ഒരു നവീകരണത്തിനു ശേഷം വ്യ‌‌വസ്ഥിതി വീണ്ടും ബൂട്ട് ചെയ്യുമ്പോള്‍ അടിസ്ഥാന വിഭാജനം കണ്ടെത്താന്‍ കേര്‍ണലിനാവുന്നില്ലെന്ന് ചില ഉപയോക്താക്കള്‍ പരാതിപ്പെട്ടിട്ടുണ്ട്.
pt: Alguns utilizadores reportaram que uma actualização pode causar que o kernel não encontre a partição raiz do sistema após o reiniciar do sistema.
ro: O parte din utilizatori au raportat că o înnoire poate cauza ca nucleul să nu găsească partiția rădăcină de sistem după repornirea sistemului.
sv: Några användare har rapporterat att en uppgradering kan innebära att kärnan inte hittar systemets rotpartition efter att systemet startats om.

source: In such case, the system boot will hang on the following message:
fr: Dans ce cas, le démarrage du système s'interrompt sur le message suivant :
it: In tal caso, l'avvio del sistema si bloccherà sul messaggio seguente:
ja: このような場合、システムの起動は、以下のメッセージを最後にハングアップしてしまいます:
ml: അത്തരം സന്ദര്ഭങ്ങളില്‍, വ്യവസ്ഥാബൂട്ട് താഴെപ്പറയുന്ന സന്ദേശവുമായി തൂങ്ങിനില്‍ക്കും:
pt: Neste caso, o arranque do sistema irá pendurar na seguinte mensagem:
ro: Într-o asemenea situație sistemul se blochează la mesajul următor:
sv: I sådana fall kommer systemet att stanna med följande meddelande:
zh_tw: 此時，系統開機會當掉，並顯示如下資訊：

source: Waiting for root file system ...
ml: റൂട്ട് ഫയല്‍ സിസ്റ്റത്തിനായി കാത്തു നില്‍ക്കുന്നു ...
sv: Väntar på rotfilsystem... (engelska: Waiting for root file system ...)

source: and after a few seconds a bare busybox prompt will appear.
fr: puis quelques secondes après, une simple invite de commande busybox apparaît.
it: e dopo pochi secondi apparirà un semplice prompt di busybox.
ja: そして数秒後に、素の busybox プロンプトが表示されます。
ml: അല്പസമയത്തിന് ശേഷം ഒരു നഗ്നമായ ബുസിബോക്സ് പ്രോംപ്റ്റ് പ്രത്യ‌‌ക്ഷപ്പെടുകയും ചെയ്യും.
pt: e após alguns segundos é mostrado um aviso de ocupado.
ro: și după câteva secunde un simplu prompt de busybox este afișat.
sv: och efter några sekunder visas ett enkelt inmatningsställe för busybox.

source: This problem can occur when the upgrade of the kernel introduces the use of the new generation of <acronym>IDE</acronym> drivers. The <acronym>IDE</acronym> disk naming convention for the old drivers was <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal>. The new drivers will name the same disks respectively <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>.
fr: Ce problème peut se produire lorsque la nouvelle génération des pilotes <acronym>IDE</acronym> est utilisée suite à la mise à niveau du noyau. Les anciens pilotes nommaient les disques <acronym>IDE</acronym> <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal> et les nouveaux pilotes nomment les mêmes disques <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal> respectivement.
it: Questo problema si può verificare quando l'aggiornamento del kernel introduce l'uso della nuova generazione di driver <acronym>IDE</acronym>. La convenzione per la denominazione dei dischi <acronym>IDE</acronym> per i vecchi driver era <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal>. I nuovi driver denomineranno i medesimi dischi rispettivamente <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>.
ja: この問題は、カーネルのアップグレードによって新しい世代の <acronym>IDE</acronym> ドライバが導入される際に発生する可能性があります。古いドライバでは <acronym>IDE</acronym> ディスクの命名規則が <literal>hda</literal>、<literal>hdb</literal>、<literal>hdc</literal>、<literal>hdd</literal> となっていました。これに対して、新しいドライバは、同じディスクにそれぞれ <literal>sda</literal>、<literal>sdb</literal>、<literal>sdc</literal>、<literal>sdd</literal> という名前をつけます。
pt: Este problema pode acontecer quando a actualização do kernel introduz o uso da nova geração de drivers <acronym>IDE</acronym>. A nomeação convencional de discos <acronym>IDE</acronym> para as antigas drivers era <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal>, <literal>hdd</literal>. As novas drivers irão nomear os mesmos disco respectivamente <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal>, <literal>sdd</literal>.
ro: Această problemă poate apărea la înnoirea nucleului odată cu utilizarea a noii generații de drivere <acronym>IDE</acronym>. Convenția driverelor vechi pentru numirea discurilor <acronym>IDE</acronym> a fost <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal> și <literal>hdd</literal>. Driverele noi vor numi aceleași discuri cu <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal> și, respectiv, <literal>sdd</literal>.
sv: Detta problem kan uppstå när kärnan introducerar användandet av en ny typ <acronym>IDE</acronym>-drivrutiner. <acronym>IDE</acronym>-enheternas namnkonvention var tidigare <literal>hda</literal>, <literal>hdb</literal>, <literal>hdc</literal> och <literal>hdd</literal>. Det nya sättet kommer att ge samma diskar följande namn <literal>sda</literal>, <literal>sdb</literal>, <literal>sdc</literal> och <literal>sdd</literal>.
