Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: To recover the console where the upgrade was running you will have to use <keycombo action='simul'><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> to switch back to the virtual terminal 1 if in the graphical startup screen or use <keycombo action='simul'><keycap>Alt</keycap><keycap>F1</keycap></keycombo> if in the local text-mode console. Replace F1 with the function key with the same number of the virtual terminal the upgrade was running in. You can also use <keycombo action='simul'><keycap>Alt</keycap><keycap>Left Arrow</keycap></keycombo> or <keycombo action='simul'><keycap>Alt</keycap><keycap>Right Arrow</keycap></keycombo> to switch between the different text-mode terminals.
fr: Pour revenir à la console traitant le processus de mise à niveau, utilisez les touches <keycombo action='simul'><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> pour revenir au terminal virtuel 1 si vous avez une interface de connexion graphique ou <keycombo action='simul'><keycap>Alt</keycap><keycap>F1</keycap></keycombo> si vous avez une console texte locale. Remplacez F1 avec la touche Fx où x correspond au numéro du terminal sur lequel se déroule la mise à niveau. Vous pouvez aussi utiliser <keycombo action='simul'><keycap>Alt</keycap><keycap>flèche gauche</keycap></keycombo> ou <keycombo action='simul'><keycap>Alt</keycap><keycap>flèche droite</keycap></keycombo> pour passer d'un terminal en mode texte à un autre.
it: Per recuperare la console su cui era in corso l'aggiornamento, usare <keycombo action='simul'><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> in modo da ritornare sul terminale virtuale 1 se nella schermata di avvio grafico, oppure usare <keycombo action='simul'><keycap>Alt</keycap><keycap>F1</keycap></keycombo> se si usa se in una console testuale locale. Al posto di F1 usare il tasto funzione con lo stesso numero del terminale virtuale su cui era in corso l'aggiornamento. Per scorrere i diversi terminali in modalità testuale è possibile usare <keycombo action='simul'><keycap>Alt</keycap><keycap>Freccia Sinistra</keycap></keycombo> o <keycombo action='simul'><keycap>Alt</keycap><keycap>Freccia Destra</keycap></keycombo>.
ja: 仮想ターミナル 1 に戻るには <keycombo action='simul'><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo>、あるいはローカルのテキストモードコンソールの場合には <keycombo action='simul'><keycap>Alt</keycap><keycap>F1</keycap></keycombo> を使う必要があります。F1 は、アップグレードが実行されている仮想ターミナルの番号と同じ番号のファンクションキーと置き換えてください。異なったテキストモードのターミナル間で切り替えを行うには、<keycombo action='simul'><keycap>Alt</keycap><keycap>左矢印</keycap></keycombo> か <keycombo action='simul'><keycap>Alt</keycap><keycap>右矢印</keycap></keycombo> も使えます。
pt: Para recuperar a consola onde a actualização estava a correr você tem de usar <keycombo action='simul'><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> para mudar de volta para o terminal virtual 1 se estiver no ecrã de arranque gráfico ou usar <keycombo action='simul'><keycap>Alt</keycap><keycap>F1</keycap></keycombo> se estiver em consola local de modo de texto. Substitua F1 pela tecla de função com o mesmo número do terminal virtual onde a actualização estava a correr. Você também pode usar <keycombo action='simul'><keycap>Alt</keycap><keycap>Seta Esquerda</keycap></keycombo> ou <keycombo action='simul'><keycap>Alt</keycap><keycap>Seta Direita</keycap></keycombo> para mudar entre os diferentes terminais de modo de texto.
ro: Pentru a recupera consola cu procesul de actualizare în derulare va trebui să folosiți <keycombo action='simul'><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> pentru a trece înapoi la terminalul virtual 1 dacă sunteți în mediul grafic sau <keycombo action='simul'><keycap>Alt</keycap><keycap>F1</keycap></keycombo> dacă sunteți în modul text. Înlocuiți F1 cu tasta funcțională cu același număr ca terminalul virtual pe care se derulează procesul de actualizare. Puteți de asemenea să folosiți <keycombo action='simul'><keycap>Alt</keycap><keycap>Săgeată la stânga</keycap></keycombo> sau <keycombo action='simul'><keycap>Alt</keycap><keycap>Săgeată la dreapta</keycap></keycombo> pentru a schimba între diferitele terminale în mod text.
sv: För att återta konsollen där uppgraderingen körs behöver du använda <keycombo action='simul'><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> för att byta till den virtuella terminalen 1 om du är vid den grafiska startbilden eller använd <keycombo action='simul'><keycap>Alt</keycap><keycap>F1</keycap></keycombo> i lokala textlägeskonsollen. Ersätt F1 med den funktionstangent som har motsvarande nummer för den virtuella terminal som uppgraderingen körs i. Du kan också använda <keycombo action='simul'><keycap>Alt</keycap><keycap>Vänsterpil</keycap></keycombo> eller <keycombo action='simul'><keycap>Alt</keycap><keycap>Högerpil</keycap></keycombo> för att byta mellan de olika textlägeskonsollerna.

source: Special care for specific packages
fr: Attention spéciale à porter à certains paquets
it: Pacchetti che richiedono un'attenzione particolare
ja: 特定のパッケージに対する特別な注意
pt: Cuidado especial para pacotes específicos
ro: Atenție deosebită la anumite pachete
sv: Speciell hantering av specifika paket

source: In most cases, packages should upgrade smoothly between &oldreleasename; and &releasename;. There are a small number of cases where some intervention may be required, either before or during the upgrade; these are detailed below on a per-package basis.
fr: La plupart des paquets devrait passer docilement de &Oldreleasename; à &Releasename;. Il y a cependant un petit nombre de cas où une intervention manuelle peut être nécessaire, que ce soir avant ou pendant la mise à niveau. Ces interventions sont détaillées ci-dessus en fonction du paquet impliqué.
it: Nella maggior parte dei casi l'aggiornamento dei pacchetti da &oldreleasename; a &releasename; avviene tranquillamente. Ci sono pochi casi in cui potrebbe essere necessario un qualche tipo d'intervento, prima o durante l'aggiornamento; seguono i dettagli per ciascun pacchetto.
ja: ほとんどの場合、&oldreleasename; と &releasename; 間でパッケージのアップグレードは順調に行われるはずです。稀なケースとして、アップグレード前、あるいはアップグレード中に調整が必要なものがあります。以下にパッケージごとの詳細を記述します。
pt: Na maioria dos casos, os pacotes deverão actualizar suavemente entre &oldreleasename; e &releasename;. Existe um pequeno número de casos onde pode ser necessária alguma intervenção manual, seja antes ou durante a actualização; estes estão detalhados em baixo numa base de por-pacote.
ro: În cele mai multe cazuri actualizarea pachetelor de la &oldreleasename; la &releasename; ar trebui să se desfășoare fără probleme. Există un număr mic de cazuri când este necesar să interveniți, fie înainte, fie în procesul de actualizare. Acestea sunt detaliate mai jos în funcție de pachet.
sv: I de flesta fall kommer paket att uppgraderas utan besvär mellan &oldreleasename; och &releasename;. Det finns ett litet antal situationer där manuella ingrepp kan behövas, antingen före eller under uppgraderingen. Dessa beskrivs nedan paket-för-paket.

source: Evolution (the GNOME Desktop mail client) has been updated from version <literal>2.22</literal> to <literal>2.30</literal>. This changes the storage format used by the package for local data and there is a possibility of data loss if the upgrade is performed whilst <systemitem role="package">evolution</systemitem> is running. Exiting the application itself may not be sufficient, as various related components will continue to run in the background. To avoid any potential issues, it is recommended that you completely exit your desktop environment before beginning the upgrade to &releasename;.
fr: Evolution (client de courrier électronique du bureau Gnome) a été mis à jour de la version <literal>2.22</literal> à la version <literal>2.30</literal>. Il s'ensuit un changement dans le format utilisé pour stocker les données locales, et donc une possible perte de données si la mise à niveau est effectuée alors que <systemitem role="package">evolution</systemitem> est en cours de fonctionnement. Quitter l'application en tant que tel n'est pas toujours suffisant car de nombreux processus liés vont continuer à fonctionner en arrière-plan. Pour éviter de possibles problèmes, nous vous recommandons de quitter totalement l'environnement graphique avant d'effectuer la mise à niveau vers &Releasename;.
it: Evolution (il client email di GNOME) è stato aggiornato dalla versione <literal>2.22</literal> alla <literal>2.30</literal>. Questo comporta il cambiamento del formato usato dal pacchetto per i dati locali ed è possibile che si verifichino delle perdite di dati se l'aggiornamento è effettuato mentre <systemitem role="package">evolution</systemitem> è in esecuzione. La chiusura dell'applicazione potrebbe non essere sufficiente poiché alcuni componenti potrebbero comunque rimanere in esecuzione. Per evitare potenziali problemi si raccomanda di chiudere completamente l'ambiente desktop prima di iniziare l'aggiornamento a &releasename;.
ja: (GNOME デスクトップのメールクライアント) Evolution は、バージョン <literal>2.22</literal> から <literal>2.30</literal> へ更新されています。これにより、パッケージがローカルデータ用に利用している保存形式が変更されており、<systemitem role="package">evolution</systemitem> が動作中にアップグレードが実施されると、データを損失する可能性があります。様々な関連コンポーネントがバックグラウンドで動作しているので、アプリケーションの終了だけでは十分ではありません。様々な問題の可能性を避けるため、&releasename; へのアップグレード開始前に、デスクトップ環境を完全に終了しておくことをお勧めします。
pt: Evolution (o cliente de mail do ambiente GNOME) foi actualizado da versão <literal>2.22</literal> para <literal>2.30</literal>. Isto altera o formato de armazenamento usado pelo pacote para dados locais e existe a possibilidade de perda de dados se a actualização for executada enquanto o <systemitem role="package">evolution</systemitem> estiver em funcionamento. Terminar a própria aplicação pode não ser suficiente, pois vários componentes relacionados irão continuar a funcionar nos bastidores. Para evitar potenciais problemas, é recomendado que você termine completamente o seu ambiente de trabalho antes de iniciar a actualização para &releasename;.
ro: Evolution (Clientul de poștă electronică GNOME pentru birou) a fost actualizat de la versiunea <literal>2.22</literal> la <literal>2.30</literal>. Această versiune a adus modificarea formatului folosit de pachet pentru păstrarea datelor și există posibilitatea apariției pierderilor de date dacă actualizarea se face în timp ce <systemitem role="package">evolution</systemitem> rulează. Ieșirea din aplicație este posibil să nu fie suficientă, deoarece diferite componente vor rula în continuare în fundal. Pentru a evita orice potențiale probleme, este recomandat să părăsiți complet mediul de lucru de birou înainte de începerea procesului de actualizare &releasename;.
sv: Evolution (E-post-klienten för Skrivbordsmiljön Gnome) har uppdaterats från version <literal>2.22</literal> till <literal>2.30</literal>. Lagringsformatet som paketet använder för lokal data ändras och det finns risk för dataförlust om uppgraderingen utförs när <systemitem role="package">evolution</systemitem> körs. Då vissa externa komponenter kan fortsätta köra i bakgrunden är det inte nödvändigtvis så att det räcker att avsluta klienten som sådan. För att undvika eventuella problem är rekommendationen att helt lämna skrivbordssessionen innan uppgraderingen till &releasename; påbörjas.

source: As part of the upgrade process, <systemitem role="package">evolution</systemitem> will check whether any related processes are running and will recommend that they be closed. A secondary check for processes will then be performed; if necessary, a choice will be offered between allowing the remaining processes to be killed or aborting the upgrade in order to resolve the situation by hand.
fr: Pendant la mise à niveau, <systemitem role="package">evolution</systemitem> vérifiera qu'aucun processus impliqué dans la mise à niveau n'est lancé , et recommandera leur fermeture. Un second tour de vérification suivra, et, si nécessaire, l'utilisateur aura le choix entre tuer les processus restants ou arrêter la mise à niveau afin de résoudre la situation lui-même.
it: Durante il processo di aggiornamento <systemitem role="package">evolution</systemitem> controlla se sono in esecuzione dei processi a esso legato e raccomanda di chiuderli. Viene effettuato anche un secondo controllo e, se necessario, offre la possibilità di chiudere i processi rimasti o di annullare l'aggiornamento per risolvere il problema manualmente.
ja: アップグレード手順の一部として、<systemitem role="package">evolution</systemitem> は関連プロセスが動作しているかをチェックし、終了することを勧めます。それから二回目のプロセスチェックが行われます。そしてもし必要であれば、残っているプロセスを終了するか、手動で状況を解決するためにアップグレードを途中で終了するかの選択が提示されます。
pt: Como parte do processo de actualização, o <systemitem role="package">evolution</systemitem> irá verificar se se quaisquer processos relacionados estão em execução e irá recomenda que sejam terminados. Será então executada uma verificação secundária por processos; se necessário, será oferecida uma escolha entre permitir que os restantes processos sejam mortos ou abortar a actualização de modo a resolver a situação manualmente.
ro: Ca parte a procesului de actualizare, <systemitem role="package">evolution</systemitem> va verifica dacă rulează servicii proprii și va recomanda închiderea acestor procese. După aceasta va urma o nouă verificare a proceselor care rulează. Dacă este necesar va trebui să alegeți între terminarea forțată a proceselor care rulează sau abandonul procesului de actualizare pentru a rezolva situația manual.
sv: Som den del av uppgraderingsprocessen kommer <systemitem role="package">evolution</systemitem> att kontrollera om några relaterade processer körs och rekommendera att de stängs. En sekundär kontroll efter processer kommer sedan att göras och om nödvändigt så erbjuds möjligheten att döda de kvarstående processerna eller avbryta uppgraderingen för att kunna lösa situationen för hand.

source: Upgrading your kernel and related packages
fr: Mettre à niveau le noyau et les paquets liés
it: Aggiornare il kernel e i pacchetti collegati
ja: カーネルと関連パッケージのアップグレード
ml: കെര്‍ണലും ബന്ധപ്പെട്ട പൊതികളും നവീകരിക്കുന്നു
pt: Actualizar o seu kernel e pacotes relacionados
ro: Actualizarea nucleului și a pachetelor conexe
sv: Uppgradering av kärna och relaterade paket
zh_tw: 替您的 Kernel 及相關套件進行升級

source: This section explains how to upgrade your kernel and identifies potential issues related to this upgrade. You can either install one of the <systemitem role="package">linux-image-*</systemitem> packages provided by Debian, or compile a customized kernel from source.
fr: Cette section explique comment mettre à niveau le noyau et identifie les problèmes potentiels liés à cette mise à niveau. Vous pouvez soit installer l'un des paquets <systemitem role="package">linux-image-*</systemitem> fournis dans Debian ou compiler un noyau personnalisé à partir des sources.
it: Questa sezione spiega come aggiornare il kernel e identifica le relative potenziali problematiche. Si può o installare uno dei pacchetti <systemitem role="package">linux-image-*</systemitem> forniti da Debian, oppure compilare un kernel personalizzato dai sorgenti.
ja: このセクションでは、カーネルのアップグレード方法を説明し、このアップグレードに際して生じる可能性がある問題点を明確にします。Debian で提供されている <systemitem role="package">linux-image-*</systemitem> パッケージのいずれかをインストールしても、カスタマイズしたカーネルをソースからコンパイルしてもかまいません。
ml: ഈ വിഭാഗം കെര്‍ണല്‍ നവീകരിക്കുന്നതിനെ കുറിച്ചും അതുമായി ബന്ധപ്പെട്ട സുപ്രധാനമായ പ്രശ്നങ്ങളും വിവരിക്കുന്നു. ഡെബിയന്‍ നല്‍കുന്ന <systemitem role="package">linux-image-*</systemitem> പൊതികളില്‍ ഒരെണ്ണം സ്ഥാപിക്കുകയോ,അല്ലെങ്കില്‍ ഉറവിടത്തില്‍ നിന്നും കമ്പൈല്‍ ചെയ്തു സ്വന്തമായി ഒരു കെര്‍ണല്‍ ഉണ്ടാക്കുകയെ ചെയ്യാം.
pt: Esta secção explica como actualizar o seu kernel e identifica potenciais problemas relacionados com esta actualização. Tanto pode instalar um dos pacotes <systemitem role="package">linux-image-*</systemitem> fornecidos pela Debian, ou compilar um kernel personalizado a partir do código fonte.
ro: Această secțiune explică actualizarea nucleului și identifică potențialele probleme legate de aceasta. Puteți instala unul din pachetele <systemitem role="package">linux-image-*</systemitem> oferite de Debian sau să compilați un nucleul personalizat din surse.
sv: Det här avsnittet förklarar hur man uppgraderar sin kärna och identifierar tänkbara problem relaterade till den här uppgraderingen. Du kan antingen installera ett av paketen <systemitem role="package">linux-image-*</systemitem> som tillhandahålls av Debian, eller bygga en anpassad kärna från källkod.
zh_tw: 這一節中解釋了如何升級您的 kernel 及和升級有關的潛在問題。您可以安裝由 Debian 提供的某個 <systemitem role="package">linux-image-*</systemitem> 套件，或是由原始碼自行編譯一個自訂的 kernel。

source: Note that a lot of information in this section is based on the assumption that you will be using one of the modular Debian kernels, together with <systemitem role="package">initramfs-tools</systemitem> and <systemitem role="package">udev</systemitem>. If you choose to use a custom kernel that does not require an initrd or if you use a different initrd generator, some of the information may not be relevant for you.
fr: Veuillez noter que beaucoup d'informations dans cette section sont basées sur l'hypothèse que vous utilisez l'un des noyaux modulaires de Debian, avec les paquets <systemitem role="package">initramfs-tools</systemitem> et <systemitem role="package">udev</systemitem>. Si vous choisissez d'utiliser un noyau personnalisé qui ne nécessite pas d'initrd ou si vous utilisez un générateur d'initrd différent, certaines informations peuvent ne pas vous concerner.
it: Si noti che molte informazioni in questa sezione sono basate sull'assunzione che si utilizzerà uno dei kernel modulari di Debian, insieme con <systemitem role="package">initramfs-tools</systemitem> e <systemitem role="package">udev</systemitem>. Se si sceglie di utilizzare un kernel personalizzato che non richiede un initrd, o se si utilizza un generatore di initrd differente, alcune delle informazioni potrebbero non essere attinenti al proprio caso specifico.
ja: このセクションに書かれている多くの情報は、ユーザが Debian のモジュラーカーネルのいずれかを <systemitem role="package">initramfs-tools</systemitem> や <systemitem role="package">udev</systemitem> とともに使用しているのを前提にしている、ということに注意してください。initrd を必要としないカスタムカーネルを使用するのを選択した場合や、initrd 生成ユーティリティとして異なるものを使用している場合は、このセクションの情報の一部は適切ではないかもしれません。
ml: ഈ വകുപ്പിലെ ഒട്ടനവധി വിവരങ്ങളും ഉള്‍‌പ്പെടുത്തിയിട്ടുള്ളത് നിങ്ങള്‍ <systemitem role="package">initramfs-tools</systemitem> ന്റേയും <systemitem role="package">udev</systemitem>ന്റേയും കൂടെ വിഘടിത ഡെബിയന്‍ കേര്‍ണലാണ് ഉപയോഗിക്കുന്നത് എന്ന നിഗമനം അടിസ്ഥാനമാക്കിയാണ്. initrd ആവശ്യ‌‌മില്ലാത്ത നിങ്ങള്‍ക്കിഷ്ടപ്പെട്ട വേറൊരു കേര്‍ണലാണ് നിങ്ങള്‍ തെരഞ്ഞെടുക്കുന്നതെങ്കില്‍, വ്യ‌‌ത്യ‌‌സ്തമായൊരു initrd ഉത്പാദകമാണ് ഉപയോഗിക്കുന്നതെങ്കില്‍ ഇതിലെ ചില വിവരങ്ങള്‍ നിങ്ങള്ക്ക് സംഗതമായിരിക്കില്ല.
pt: Note que muita da informação nesta secção é baseada na premissa que irá utilizar um dos kernels modulares da Debian, juntamente com os pacotes <systemitem role="package">initramfs-tools</systemitem> e <systemitem role="package">udev</systemitem>. Se escolher utilizar um kernel personalizado que não precisa de uma initrd ou se utiliza um gerador de initrds diferente, alguma da informação pode não ser relevante para si.
ro: O mare parte din informația expusă în această secțiune se bazează pe presupunerea că veți folosi un nucleu modular din Debian împreună cu <systemitem role="package">initramfs-tools</systemitem> și <systemitem role="package">udev</systemitem>. Dacă veți alege să folosiți un nucleu ce nu necesită initrd sau este folosit un alt generator initrd, atunci o parte din informații ar putea să nu fie de interes.
sv: Observera att en hel del information i det här avsnittet är baserad på antagelsen att du kommer att använda en av de modulära Debiankärnorna tillsammans med i <systemitem role="package">initramfs-tools</systemitem> och <systemitem role="package">udev</systemitem>. Om du har valt att använda en anpassad kärna som inte kräver en initrd eller om du använder en annan initrd-generator kan delar av den här informationen vara irrelevant för dig.
zh_tw: 請注意到，在這一節中的許多資訊是假設了您使用著某個模組化、和 <systemitem role="package">initramfs-tools</systemitem> 及 <systemitem role="package">udev</systemitem> 搭配使用的 Kernel。如果您是使用不需 initrd 的自訂 kernel 或是您使用的是另一種 initrd 產生程式，這些資訊中有些是和您無關的。

source: Installing the kernel metapackage
fr: Installer un métapaquet du noyau
it: Installazione del metapacchetto del kernel
ja: カーネルメタパッケージのインストール
ml: കെര്‍ണല്‍ മെറ്റാപാക്കേജ് ഇന്‍സ്റ്റോള്‍ ചെയ്യുന്നതു്
pt: Instalar o meta-pacote do kernel
ro: Instalarea meta-pachetului de nucleu
sv: Installera metapaketet för kärnan
zh_tw: 安裝 Kernel 的虛擬套件

source: When you dist-upgrade from &oldreleasename; to &releasename;, it is strongly recommended that you install a new linux-image-2.6-* metapackage. This package may be installed automatically by the dist-upgrade process. You can verify this by running:
fr: Quand vous faites une mise à niveau de &Oldreleasename; vers &Releasename;, il est fortement recommandé d'installer un nouveau métapaquet linux-image-2.6-*. Ce paquet peut être installé automatiquement par le processus de mise à niveau. Vous pouvez vérifier cela en exécutant :
it: Quando si effettua il dist-upgrade da &oldreleasename; a &releasename; è fortemente raccomandata l'installazione di un nuovo metapacchetto linux-image-2.6-*, che potrebbe essere installato automaticamente dal processo di dist-upgrade. Lo si può verificare eseguendo:
ja: &oldreleasename; から &releasename; への dist-upgrade を実行する際には、新しい linux-image-2.6-* メタパッケージをインストールすることを強くお勧めします。このパッケージは、dist-upgrade の過程で自動的にインストールされるかもしれません。次のように実行すると、このパッケージがインストールされたか確認できます。
ml: &oldreleasename;ല്‍നിന്ന് &releasename;ലേക്ക് നവീകരണം നടത്തുമ്പോള്‍, ലീനക്സ്-ഇമേജ്-2.6-*മെറ്റാപാക്കേജ് പ്രതിഷ്ഠിക്കാന്‍ ശക്തമായി ശുപാര്ശ ചെയ്യുന്നു. പുതുക്കലിനിടെ ഈ പൊതി യാന്ത്രികമായിത്തന്നെ പ്രതിഷ്ഠിക്കപ്പെടും. ഇത് പ്രവര്ത്തിപ്പിച്ചുകൊണ്ട് നിങ്ങള്‍ക്കത് മനസ്സിലാക്കാവുന്നതാണ്.
pt: Quando executa uma actualização de versão (dist-upgrade) de &oldreleasename; para &releasename;, é fortemente recomendado que instale um novo meta-pacote linux-image-2.6-*. Este pacote pode ser instalado automaticamente pelo processo dist-upgrade. Pode verificar isto ao correr:
ro: Atunci când actualizați (folosind dist-upgrade) de la &oldreleasename; la &releasename;, este indicat să instalați meta-pachetul linux-image-2.6-*. Acest pachet poate fi instalat automat prin procesul de actualizare a distribuției. Puteți verifica acest lucru rulând comanda:
sv: När du kör dist-upgrade från &oldreleasename; till &releasename;, rekommenderas det starkt att du installerar ett nytt linux-image-2.6-*-metapaket. Det här paketet kan installeras automatiskt av dist-upgrade-processen. Du kan verifiera det genom att köra:
zh_tw: 當您由 &oldreleasename; 完整升級至 &releasename; 後，強烈建議您安裝某個 linux-image-2.6-* 虛擬套件。這個套件可能會在完整升級的過程中被自動安裝。若想確認，請執行：
