Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: For storage devices, you may be able to avoid this reordering by using <systemitem role="package">initramfs-tools</systemitem> and configuring it to load storage device driver modules in the same order they are currently loaded. However, in light of other changes to the storage subsystem of the Linux kernel as described at <xref linkend="ide-pata-transition"/>, this is usually not worth the effort and it is recommended instead to use device names that are guaranteed to be stable over time, such as the UUID aliases <footnote>
fr: Pour les périphériques de stockage, vous pouvez éviter cette réorganisation en utilisant <systemitem role="package">initramfs-tools</systemitem> et en le configurant pour charger les modules des pilotes dans le même ordre que celui dans lequel les périphériques ont été chargés. Cependant, au vu des autres changements apportés au sous-système d'enregistrement du noyau linux (consultez <xref linkend="ide-pata-transition"/>), c'est certainement beaucoup de travail pour rien, et il est préférable d'utiliser les noms de périphériques qui sont garantis stables, comme les alias UUID <footnote>
it: Per i dispositivi di archiviazione si potrebbe evitare questo riordino utilizzando <systemitem role="package">initramfs-tools</systemitem> e configurandolo affinché carichi i driver dei dispositivi di archiviazione nel medesimo ordine in cui sono attualmente caricati. Comunque, alla luce delle altre modifiche nel sottosistema di archiviazione del kernel Linux come descritto in <xref linkend="ide-pata-transition"/>, non vale la pena fare questa operazione e invece si raccomanda di usare dei nomi di device che sono garantiti per essere per sempre stabili, come gli alias UUID <footnote>
ja: ストレージデバイスについては、<systemitem role="package">initramfs-tools</systemitem> を使い、ストレージデバイスのドライバモジュールを現在読み込まれているのと同じ順番で読み込むように設定することで、この並び替えを回避することができるでしょう。しかし、<xref linkend="ide-pata-transition"/> で記述されている Linux カーネルのストレージサブシステムへの他の変更内容を考慮すると、これは大抵は労力に見合わないので、<filename>/dev/disk/by-uuid/</filename> ディレクトリ中の UUID のエイリアス<footnote>
pt: Para dispositivos de armazenamento, pode evitar esta reordenação ao utilizar o <systemitem role="package">initramfs-tools</systemitem> e configurá-lo de modo a carregar os módulos do driver do dispositivo de armazenamento na mesma ordem em que estão actualmente carregados. No entanto, à luz de outras alterações no subsistema de armazenamento do kernel Linux como descrito em <xref linkend="ide-pata-transition"/>, geralmente isto não merece o esforço e em vez disso é recomendado nomes de dispositivos que são garantidos como sendo estáveis com o tempo, como os nomes alternativos UUID<footnote>
ro: Pentru dispozitivele de stocare ați putea evita reordonarea prin utilizarea <systemitem role="package">initramfs-tools</systemitem> și configurarea acestuia astfel încât să încarce modulele cu drivere pentru dispozitive în aceeași ordine ca în configurația curentă. Totuși, în prisma altor modificări ale sub-sistemului de stocare din nucleul Linux descrise în <xref linkend="ide-pata-transition"/>, această operațiune este prea costisitoare și este recomandat să folosiți în schimb nume de dispozitive care sunt garantate să se păstreze în timp, ca aliasurile UUID<footnote>
sv: För lagringsenheter kan du undvika den här omsorteringen genom att använda <systemitem role="package">initramfs-tools</systemitem> och konfigurera det att läsa in drivrutinsmoduler för lagringsenheter i samma ordning som de för närvarande läses in i. Dock, med tanke på andra ändringar i lagringssystemen i Linuxkärnan som beskrivs i <xref linkend="ide-pata-transition"/> är detta vanligen inte värt jobbet och det är istället rekommenderat att använda enhetsnamn som garanterat är stabila över tid, exempelvis UUID-alias <footnote>

source: Some devices, such as those used by crypt, RAID or LVM have stable non-UUID identifiers. In these cases you should use the name of the devices, which are already unambiguous and stable.
fr: Certains périphériques, par exemple ceux utilisés par crypt, RAID ou LVM ont des identifiants non-UUID stables. Dans ce cas, vous devriez utiliser le nom de ces périphériques, qui sont déjà non ambigus et stables.
it: Alcuni dispositivi, come quelli usati da crypt, RAID o LVM, hanno identificatori stabili non-UUID. In questi casi si dovrebbe usare il nome del dispositivi dato che è già non ambiguo e stabile.
ja: crypt、RAID、LVM で使われるようなデバイスには、UUID ではない安定した識別子があります。この場合、既に明確で安定しているこれらのデバイス名を使う必要があります。
pt: Alguns dispositivos, como aqueles usados pelo crypt, RAID ou LVM têm identificadores não-UUID estáveis. Nestes casos você deverá usar o nome dos dispositivos, que já são inambíguos e estáveis.
ro: Unele dispozitive, cum ar fi cele folosite de crypt, RAID sau LVM au identificatori stabili care nu sunt bazați pe UUID. In cazul lor ar trebui să să folosiți numele dispozitivelor, care sunt deja clare și stabile.
sv: Några enheter, exempelvis de som används av crypt, RAID eller LVM har stabila icke-UUID-identifierare. I dessa fall ska du använda namnet på enheten eftersom de redan är otvetydiga och stabila.

source: </footnote> in the <filename>/dev/disk/by-uuid/</filename> directory or LVM device names in <filename>/dev/mapper/</filename>.
fr: </footnote> dans le dossier <filename>/dev/disk/by-uuid/</filename> ou les nom de périphériques LVM dans <filename>/dev/mapper/</filename>.
it: </footnote> nella directory <filename>/dev/disk/by-uuid/</filename> o i nomi dei device LVM in <filename>/dev/mapper/</filename>.
ja: </footnote> や <filename>/dev/mapper/</filename> 中の LVM デバイス名などの長きに渡って安定していることが保証されているデバイス名を代わりに使うことが推奨されています。
pt: </footnote> no directório <filename>/dev/disk/by-uuid/</filename> ou nomes de dispositivo LVM em <filename>/dev/mapper/</filename>.
ro: </footnote> în directorul <filename>/dev/disk/by-uuid/</filename> sau numele dispozitivelor LVM în <filename>/dev/mapper/</filename>.
sv: </footnote> i katalogen <filename>/dev/disk/by-uuid/</filename> eller LVM-enheter i <filename>/dev/mapper/</filename>.

source: Boot timing issues
fr: Problèmes de minutage lors de l'amorçage
it: Problemi di temporizzazione dell'avvio
ja: 起動タイミングの問題
ml: ബൂട്ട് സമയത്തിന്റെ പ്രശ്നങ്ങള്‍
pt: Problemas de timing no arranque
ro: Probleme de sincronizare la inițializare
sv: Tidsproblem vid uppstart
zh_tw: 開機時機問題

source: If an initrd created with <systemitem role="package">initramfs-tools</systemitem> is used to boot the system, in some cases the creation of device files by <systemitem role="package">udev</systemitem> can happen too late for the boot scripts to act on.
fr: Si un initrd créé avec <systemitem role="package">initramfs-tools</systemitem> est utilisé pour amorcer le système, dans certains cas, la création des fichiers de périphérique par <systemitem role="package">udev</systemitem> peut se produire trop tard pour que les scripts d'amorçage puissent en tenir compte.
it: Se per l'avvio del sistema viene utilizzato un initrd creato con <systemitem role="package">initramfs-tools</systemitem>, in alcuni casi la creazione dei file di device ad opera di <systemitem role="package">udev</systemitem> può accadere troppo tardi perché gli script di avvio possano agire su di essi.
ja: <systemitem role="package">initramfs-tools</systemitem> で生成した initrd を使用してシステムを起動する場合、時として、<systemitem role="package">udev</systemitem> によるデバイスファイルの作成が、起動スクリプトの動作に間に合わないことがあります。
ml: വ്യ‌‌വസ്ഥിതി ബൂട്ട് ചെയ്യാന്‍ <systemitem role="package">initramfs-tools</systemitem>കൊണ്ട് സൃഷ്ടിച്ച initrd ഉപയോഗിക്കുമ്പോള്‍, ചില സന്ദര്‍ഭങ്ങളില്‍ <systemitem role="package">udev</systemitem> കൊണ്ടുള്ള ഉപകരണ ഫയലുകളുടെ നിര്മ്മാണത്തിന് ബൂട്ടിന്റെ ചെറു ആജ്ഞ പ്രവര്ത്തനക്ഷമമാകുന്നത് അസാധാരണമായി നീണ്ടുപോയെന്നുവരാം. .
pt: Se é utilizada uma initrd criada com o <systemitem role="package">initramfs-tools</systemitem> para arrancar o sistema, em alguns casos a criação de ficheiros de dispositivo pelo <systemitem role="package">udev</systemitem> pode acontecer demasiado tarde para que os scripts de arranque actuem.
ro: Dacă un initrd creat cu <systemitem role="package">initramfs-tools</systemitem> este folosit pentru a inițializa sistemul, în unele cazuri crearea fișierelor-dispozitiv de către <systemitem role="package">udev</systemitem> poate avea loc prea târziu pentru ca scripturile de inițializare să le poată utiliza.
sv: Om en initrd som skapats med <systemitem role="package">initramfs-tools</systemitem> används för att starta upp systemet, kan i vissa fall skapandet av enhetsfiler av <systemitem role="package">udev</systemitem> ske för sent för uppstartsskripten att agera på.
zh_tw: 如果使用由 <systemitem role="package">initramfs-tools</systemitem> 產生的 initrd 來開機的話，在某些狀況下 <systemitem role="package">udev</systemitem> 建立裝置檔的時機比開機 scripts 的動作還慢。

source: The usual symptoms are that the boot will fail because the root file system cannot be mounted and you are dropped into a debug shell. But if you check afterwards, all devices that are needed are present in <filename>/dev</filename>. This has been observed in cases where the root file system is on a <acronym>USB</acronym> disk or on <acronym>RAID</acronym>, especially if <acronym>LILO</acronym><indexterm><primary>LILO</primary></indexterm> is used.
fr: Les symptômes habituels sont que l'amorçage échoue car le système de fichiers racine ne peut pas être monté et vous vous retrouvez dans un shell de débogage. Mais après vérifications, tous les périphériques nécessaires sont bien présents dans <filename>/dev</filename>. Cela a été observé dans des cas où le système de fichiers racine est sur un disque <acronym>USB</acronym> ou sur du <acronym>RAID</acronym>, en particulier si <acronym>LILO</acronym><indexterm><primary>LILO</primary></indexterm> est utilisé.
it: I sintomi consueti sono che l'avvio fallirà poiché il file system radice non può essere montato e si sarà rinviati ad una shell di debug, ma che quando in seguito si effettuerà una verifica tutti i device necessari saranno presenti in <filename>/dev</filename>. Ciò è stato osservato in casi in cui il file system radice è su un disco <acronym>USB</acronym> o in <acronym>RAID</acronym>, specialmente se viene utilizzato <acronym>LILO</acronym><indexterm><primary>LILO</primary></indexterm>.
ja: 通常の症状は、「ルートファイルシステムがマウントできず起動に失敗し、デバッグシェルに落ちる」というものです。しかし、後でチェックしても、必要なデバイスはすべて <filename>/dev</filename> に存在しています。この症状は、ルートファイルシステムが <acronym>USB</acronym> ディスクや <acronym>RAID</acronym> にある場合、特に <acronym>LILO</acronym><indexterm><primary>LILO</primary></indexterm> を使用している場合によく見られます。
ml: അടിസ്ഥാന ഫയലുകള്‍ കയറ്റാന്‍ കഴിയാതെ നിങ്ങളെ ഒരു ഡീബഗ്ഷെല്ലില്‍ വിട്ടേച്ച് പോകുന്ന കാരണം ബൂട്ടിംഗ് പരാജയമായിരിക്കും സാധാരണ ലക്ഷണം. പിന്നീടൊരിക്കല്‍ നിങ്ങളത് പരിശോധിച്ചാല്‍ <filename>/dev</filename>ല്‍ ആവശ്യ‌‌മുണ്ടായിരിക്കേണ്ട ഫയലുകള്‍ ഉള്ളതായികാണാം. അടിസ്ഥാന ഫയല്‍ വ്യ‌‌വസ്ഥ <acronym>USB</acronym> ഡിസ്കിലോ <acronym>RAID</acronym>ലോ ആയിരിക്കുമ്പോഴോ, അല്ലെങ്കില്‍ <acronym>LILO</acronym><indexterm><primary>LILO</primary></indexterm> ഉപയോഗിക്കുമ്പോഴോ ആണ് ഇങ്ങനെ കണ്ടെത്തിയിട്ടുള്ളത്.
pt: Os sintomas usuais são que o arranque falha devido ao sistema de ficheiros raiz não poder ser montado e você é deixado numa shell de depuração. Mas quando verifica depois, todos os dispositivos necessários estão presentes em <filename>/dev</filename>. Isto foi observado em casos em que o sistema de ficheiros raiz está num disco <acronym>USB</acronym> ou num <acronym>RAID</acronym>, especialmente se é utilizado o <acronym>LILO</acronym><indexterm><primary>LILO</primary></indexterm>.
ro: Comportamentul distinctiv este că inițializarea eșuează din cauza că sistemul de fișirere rădăcină nu poate fi montat și un interpretor de comenzi pentru depanare este lansat. Dar dacă verificați mai târziu veți găsi toate fișierele dispozitiv se află în <filename>/dev</filename>. Aceasta s-a observat în cazurile în care sistemul de fișiere rădăcină se află pe un disc <acronym>USB</acronym> sau <acronym>RAID</acronym>, mai ales dacă este folosit <acronym>LILO</acronym><indexterm><primary>LILO</primary></indexterm>.
sv: De vanligaste symptomen är att uppstarten misslyckas på grund av att rotfilsystemet inte kan monteras och du hamnar i ett felsökningsskal, men när du kontrollerar senare så finns alla nödvändiga enheter i <filename>/dev</filename>. Det har observerats i fall där rotfilsystemet finns på en <acronym>USB</acronym>-disk eller på <acronym>RAID</acronym>, speciellt om <acronym>LILO</acronym><indexterm><primary>LILO</primary></indexterm> används.

source: A workaround for this issue is to use the boot parameter <literal>rootdelay=<replaceable>9</replaceable></literal>. The value for the timeout (in seconds) may need to be adjusted.
fr: Un contournement de ce problème est d'utiliser le paramètre d'amorçage <literal>rootdelay=<replaceable>9</replaceable></literal>. Il se peut que vous deviez ajuster la valeur pour le délai (en seconde).
it: Un modo per aggirare questa problematica è l'utilizzo del parametro di avvio <literal>rootdelay=<replaceable>9</replaceable></literal>. Il valore per il timeout (in secondi) potrebbe necessitare di una correzione.
ja: この問題を回避するには、ブートパラメータに <literal>rootdelay=<replaceable>9</replaceable></literal> を指定してください。タイムアウトの値 (秒で指定します) は調整する必要があるかもしれません。
ml: <literal>rootdelay=<replaceable>9</replaceable></literal> എന്ന ബൂട്ട് പരാമീറ്റര്‍ ഉപയോഗിക്കുന്നതാണു ഈ പ്രശ്നത്തിന്റെ ഒരു പരിഹാരംഇടവേള സമയത്തിന്റെ (സെക്കന്‍ഡ്) വില മാറ്റേണ്ടി വരും
pt: Uma forma de contornar este problema é utilizar o parâmetro de arranque <literal>rootdelay=<replaceable>9</replaceable></literal>. O valor do tempo de espera (em segundos) pode precisar de ser ajustado.
ro: O soluție alternativă pentru această problemă este folosirea parametrului de inițializare <literal>rootdelay=<replaceable>9</replaceable></literal>. Valoarea pentru limita de timp (în secunde) poate necesita ajustări.
sv: Ett sätt att komma runt det här problemet på är att använda uppstartsparametern <literal>rootdelay=<replaceable>9</replaceable></literal>. Värdet för tidsgränsen (i sekunder) kan behöva justeras.
zh_tw: 要避開這個問題的方法是使用 <literal>rootdelay=<replaceable>9</replaceable></literal> 開機參數。其中的秒數可能得視情況再加以調整。

source: Things to do before rebooting
fr: Choses à faire avant le prochain redémarrage
it: Cose da fare prima di riavviare il sistema
ja: 再起動の前にすべきこと
ml: റീബൂട്ടിങിന് മുന്‍പ് ചെയ്യേണ്ട കാര്യങ്ങള്‍
pt: Coisas a fazer antes de reiniciar a máquina
ro: Lucruri de făcut înainte de repornire
sv: Saker att göra före omstart
zh_tw: 在重新開機前應該完成的工作

source: When <literal>apt-get dist-upgrade</literal> has finished, the <quote>formal</quote> upgrade is complete, but there are some other things that should be taken care of <emphasis>before</emphasis> the next reboot.
fr: Lorsque <literal>apt-get dist-upgrade</literal> est terminé, la mise à niveau <quote>formelle</quote> est terminée, mais il reste quelques petites choses dont vous devriez vous occuper <emphasis>avant</emphasis> le prochain redémarrage.
it: Quando <literal>apt-get dist-upgrade</literal> è giunto al termine, l'aggiornamento <quote>formale</quote> è concluso, ma vi sono alcune altre cose di cui ci si dovrebbe preoccupare <emphasis>prima</emphasis> del successivo riavvio.
ja: <literal>apt-get dist-upgrade</literal> が終了したら、<quote>形式的には</quote>アップグレードは完了したことになります。しかし、次に再起動する<emphasis>前に</emphasis>面倒を見てやらなければならないことがいくつかあります。
pt: Quando o <literal>apt-get dist-upgrade</literal> tiver terminado, a actualização <quote>formal</quote> estará completa, mas existem algumas coisas com as quais é preciso ter atenção <emphasis>antes</emphasis> do próximo reiniciar do sistema.
ro: După ce <literal>apt-get dist-upgrade</literal> a terminat, înseamnă că actualizarea <quote>formală</quote> s-a terminat, dar există alte lucruri care trebuie făcute <emphasis>înainte</emphasis> să reporniți sistemul.
sv: När <literal>apt-get dist-upgrade</literal> har kört färdigt är den <quote>formella</quote> uppgraderingen färdig, men det finns vissa andra saker som bör tas om hand <emphasis>före</emphasis> nästa omstart.

source: There is probably no need at all to run lilo manually on upgrade anymore, /etc/kernel/postinst.d/zz-lilo runs lilo unconditionally on kernel upgrade; but don't throw this all away until the lilo maintainers confirm this isn't required on upgrade for the second-stage bootloader.
fr: Il n'y a sûrement pas besoin de lancer lilo manuellement après une mise à niveau. Le script /etc/kernel/postinst.d/zz-lilo est toujours lancé après une mise à niveau du noyau. Mais ne prenez pas ceci pour argent comptant tant que les mainteneurs de lilo n'ont pas confirmé que ce n'était pas nécessaire lors de la mise à niveau du programme d'amorçage.
ja: おそらく、アップグレード時に lilo を手動で実行するのはもはや必要なく、 /etc/kernel/postinst.d/zz-lilo がカーネルのアップグレード時に lilo を無条件で実行します。 しかし、 second-stage のブートローダのためにこれがアップグレード時に必要ないことを lilo のメンテナが確認するまで消さないでください。
ro: Probabil nu mai este necesar să rulați lilo manual la actualizare, /etc/kernel/postinst.d/zz-lilo rulează lilo automat la actualizarea nucleului; dar nu vă bazați pe asta până ce responsabili pachetului lilo nu confirmă că acest lucru nu mai este necesar la actualizarea pasului doi a încărcătorului de sistem.
sv: Det finns förmodligen ingen anledning att köra lilo manuellt vid uppgradering längre, /etc/kernel/postinst.d/zz-lilo kör ovillkorligen lilo vid uppgradering av kärnan; men ta inte bort detta innan lilos pakethanterare meddelat att detta inte behövs för att uppgradera till andra-stegs-upstartshanterare.

source: Rerun lilo
fr: Réexécuter lilo
it: Rieseguire LILO
ja: lilo の再実行
ml: lilo വീണ്ടും പ്രവര്‍ത്തിപ്പിക്കുക
pt: Correr novamente o lilo
ro: Rulați din nou lilo
sv: Kör lilo igen
zh_tw: 重新執行 lilo

source: If you are using <systemitem role="package">lilo</systemitem> as your bootloader (it is the default bootloader for some installations of &oldreleasename;) it is strongly recommended that you rerun <command>lilo</command> after the upgrade. The <systemitem role="package">lilo</systemitem> package will offer to do this for you as part of the upgrade, but if you decline or don't see the prompt, you should run lilo by hand:
fr: Si vous utilisez <systemitem role="package">lilo</systemitem> comme programme d'amorçage (c'est le programme d'amorçage par défaut pour certaines installations de la version &Oldreleasename;), il est fortement recommandé de réexécuter <command>lilo</command> après la mise à niveau. Le paquet <systemitem role="package">lilo</systemitem> vous proposera de le faire pendant la mise à niveau, mais si vous refusez ou ne voyez pas l'invite, vous devriez lancer lilo vous-même&nbsp;:
it: Se si sta utilizzando <systemitem role="package">lilo</systemitem> come bootloader (è il bootloader predefinito per alcune installazioni di &oldreleasename;), si raccomanda vivamente di rieseguire <command>lilo</command> dopo l'aggiornamento. Il pacchetto offre questa opportunità durante l'aggiornamento, ma se si declina o non si vede la domanda, si dovrebbe eseguire lilo a mano:
ja: (&oldreleasename; をインストールしたときに場合によってはデフォルトのブートローダとなる) <systemitem role="package">lilo</systemitem> をブートローダとして使用している場合は、アップグレード後に <command>lilo</command> をもう一度実行しておくことを強くお勧めします。<systemitem role="package">lilo</systemitem> パッケージはアップグレード作業の一部としてこの動作を提示しますが、プロンプトを無視した、あるいは見なかった場合には、以下のように lilo を手動で実行する必要があります:
pt: Se está a utilizar o <systemitem role="package">lilo</systemitem> como o seu carregador de arranque (é o carregador de arranque predefinido para algumas instalações da &oldreleasename;) é fortemente recomendado que você corra novamente o <command>lilo</command> após a actualização. O pacote <systemitem role="package">lilo</systemitem> irá oferecer isto para si parte da actualização, mas se você rejeitar ou na ver o aviso, deverá correr o lilo manualmente:
ro: Dacă folosiți <systemitem role="package">lilo</systemitem> ca încărcător de sistem (este încărcătorul de sistem implicit pentru o parte din instalările de &oldreleasename;) este indicat să rulați comanda <command>lilo</command> după înnoire. Pachetul <systemitem role="package">lilo</systemitem> va oferi să facă această acțiune ca parte a procesului de actualizare, dar dacă refuzați sau nu vedeți întrebarea, rulați lilo manual:
sv: Om du använder <systemitem role="package">lilo</systemitem> som uppstartshanterare (det är standardvalet för uppstartshantering i vissa installationer av &oldreleasename;) rekommenderas det starkt att du åter kör <command>lilo</command> efter uppdateringarna. <systemitem role="package">lilo</systemitem>-paketet kommer att erbjuda sig att göra detta som en del av uppgraderingen men om du avböjer eller inte ser förfrågan ska du köra lilo för hand:

source: Notice this is needed even if you did not upgrade your system's kernel, as <command>lilo</command>'s second stage will change due to the package upgrade.
fr: Veuillez noter que cela est nécessaire même si vous n'avez pas mis à niveau le noyau du système car la seconde étape de <command>lilo</command> va changer à cause de la mise à niveau du paquet.
it: Si noti che questo è necessario anche se non si è aggiornato il kernel del sistema, dal momento che il secondo stadio di <command>lilo</command> cambierà a causa dell'aggiornamento del pacchetto.
ja: 注意しなくてはならないのは、システムのカーネルをアップグレードしていない場合でもこの操作が必要になるということです。それは、パッケージのアップグレードによって <command>lilo</command> の第 2 ステージが変更されているからです。
ml: വ്യ‌‌വസ്ഥിയുടെ കേര്‍ണല്‍ പരിഷ്കരിക്കപ്പെട്ടിട്ടില്ലെങ്കിലും ഇത് അത്യാ‌‌വശ്യ‌‌മാണെന്ന് ഓര്മ്മിക്കണം, കാരണം പൊതികളുടെ പുതുക്കല്‍ കാരണം <command>lilo</command>യുടെ രണ്ടാംഘട്ടം മാറിയിരിക്കും.
pt: Note que isto é necessário mesmo que você não tenha actualizado o kernel do seu sistema, já que a segunda etapa do <command>lilo</command> irá mudar devido à actualização do pacote.
ro: A se reține că acest lucru este necesar chiar dacă nu ați actualizat nucleul sistemului, deoarece a doua etapă a lui <command>lilo</command> se va schimba datorită actualizării pachetului.
sv: Observera att detta är ett nödvändigt steg även om du inte har uppdaterat din kärna i och med att andra steget av <command>lilo</command> har förändrats i och med uppdateringen av paket.
zh_tw: 請注意到，即使您並沒有升級您的系統的 kernel，這個動作還是必要的，因為 <command>lilo</command> 的第二階段可能會因為套件的升級而改變了。
