Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: You have to make sure before upgrading your system that you have sufficient hard disk space when you start the full system upgrade described in <xref linkend="upgrading-full"/>. First, any package needed for installation that is fetched from the network is stored in <filename>/var/cache/apt/archives</filename> (and the <filename>partial/</filename> subdirectory, during download), so you must make sure you have enough space on the file system partition that holds <filename>/var/</filename> to temporarily download the packages that will be installed in your system. After the download, you will probably need more space in other file system partitions in order to both install upgraded packages (which might contain bigger binaries or more data) and new packages that will be pulled in for the upgrade. If your system does not have sufficient space you might end up with an incomplete upgrade that might be difficult to recover from.
fr: Avant de faire la mise à niveau complète du système, telle qu'elle est décrite en <xref linkend="upgrading-full"/>, vous devez vous assurer d'avoir suffisamment d'espace disque. En effet, tous les paquets nécessaires à l'installation sont stockés dans <filename>/var/cache/apt/archives</filename> (et dans le sous-répertoire <filename>partial/</filename> pendant le téléchargement). Vous devez donc vous assurer d'avoir suffisamment de place sur la partition <filename>/var/</filename> du système de fichiers. Après le téléchargement, vous aurez probablement encore besoin de plus d'espace disque sur les autres partitions de système de fichiers pour pouvoir installer à la fois les paquets mis à niveau (qui peuvent contenir des binaires plus gros ou davantage de données) et les nouveaux paquets. Si l'espace disque vient à manquer, la mise à niveau sera incomplète, ce qui peut rendre le système difficile à récupérer.
it: Prima di aggiornare il proprio sistema ci si deve accertare di avere uno spazio disponibile sufficiente sul proprio disco fisso al momento di far partire l'aggiornamento completo del sistema, come descritto in <xref linkend="upgrading-full"/>. Per prima cosa, poiché ogni pacchetto necessario per l'installazione prelevato dalla rete è immagazzinato in <filename>/var/cache/apt/archives</filename> (e nella sottodirectory <filename>partial/</filename>, durante lo scaricamento), ci si dovrebbe assicurare di avere spazio a sufficienza nella partizione del file system che contiene <filename>/var</filename> per il temporaneo scaricamento dei pacchetti che saranno installati nel sistema. Dopo lo scaricamento sarà probabilmente necessario avere ulteriore spazio disponibile in altre partizioni del file system per poter installare sia i pacchetti aggiornati (che potrebbero contenere file binari più grossi o più dati), sia i nuovi pacchetti che saranno introdotti con l'aggiornamento. Se il sistema non ha spazio libero a sufficienza, si potrebbe finire con un aggiornamento incompleto dal quale potrebbe essere difficile effettuare un ripristino.
ja: システムアップグレードの前には、<xref linkend="upgrading-full"/> で説明するシステム全体のアップグレードを開始するときに、十分なハードディスク領域があるかどうかを確認してください。まず、ネットワーク経由で取得してインストールする必要があるパッケージは、すべて <filename>/var/cache/apt/archives</filename> (およびダウンロード中には <filename>partial/</filename> サブディレクトリ) に保存されます。したがって、システムにインストールされるパッケージをダウンロードして一時的に保存できるよう、<filename>/var/</filename> を保持しているファイルシステムパーティションに十分な空き領域があることを確認しなければなりません。ダウンロード後にはおそらく、アップグレードされるパッケージ (これらには、より大きなバイナリやより多くのデータが含まれている可能性があります) と、アップグレードに伴って依存関係に引きずられて新たにインストールされるパッケージの両方のインストールのために、他のファイルシステムパーティションにさらに領域が必要になるでしょう。システムに十分な空き領域がない場合、アップグレードが不完全な状態で終わり、復旧が困難になる可能性があります。
pt: Você terá de certificar antes de fazer a actualização do seu sistema, que possui espaço suficiente em disco quando iniciar a actualização completa do sistema descrita em <xref linkend="upgrading-full"/>. Primeiro, qualquer pacote necessário para a instalação que seja obtido a partir da rede é guardado em <filename>/var/cache/apt/archives</filename> (e no subdirectório <filename>partial/</filename> durante o download), por isso você tem de se assegurar que tem espaço suficiente no sistema de ficheiros da partição onde está o <filename>/var/</filename> para descarregar temporariamente os pacotes que serão instalados no seu sistema. Depois de os descarregar, provavelmente necessitará de mais espaço nos outros sistemas de ficheiros das partições de modo a instalar quer os pacotes actualizados (que podem conter binários maiores ou mais dados), quer os novos pacotes que serão juntados para a actualização. Se o seu sistema não possui espaço suficiente, você pode acabar com uma actualização incompleta que da qual pode ser difícil recuperar.
ro: Înainte de a începe actualizarea completă, așa cum este descrisă în <xref linkend="upgrading-full"/>, trebuie să vă asigurați că aveți suficient spațiu pe disc. În primul rând, orice pachet necesar pentru instalare, care este descărcat prin rețea este stocat în <filename>/var/cache/apt/archives</filename> (și subdirectorul <filename>partial/</filename> în timpul descărcării), deci trebuie să aveți suficient spațiu pe sistemul de fișiere pe care se află <filename>/var/</filename> pentru a descărca pachetele ce vor fi instalate pe sistemul dumneavoastră. După descărcare veți avea nevoie de mai mult spațiu pe alte partiții de sistem pentru a instala atât pachetele actualizate (care e posibil să conțină binare mai mari sau mai multe date) cât și pachetele noi care vor fi aduse pentru actualizare. Dacă sistemul dumneavoastră nu are suficient spațiu este posibil să rămâneți cu o actualizare incompletă. În această situație, recuperarea ar putea fi foarte dificilă.
sv: Du måste kontrollera att ditt system har tillräckligt mycket ledigt hårddiskutrymme innan du påbörjar en fullständig systemuppgradering, som beskrivs i <xref linkend="upgrading-full"/>. Alla paket som behöver hämtas för installation kommer att hämtas från nätverket och lagras i <filename>/var/cache/apt/archives</filename> (och underkatalogen <filename>partial/</filename> under hämtningen) så du måste se till att du har tillräckligt utrymme på filsystemspartitionen som innehåller <filename>/var/</filename> för temporär hämtning av paketen som ska installeras på ditt system. Efter hämtningen kommer du antagligen behöva mer utrymme på de andra filsystemspartitionerna för att både installera de uppgraderade paketen (som kan innehålla större binärfiler eller mer data) och de nya paketen som kommer att inkluderas i uppgraderingen. Om ditt system inte har tillräckligt med utrymme kan det resultera i en ofullständig uppgradering som kan vara svår att rätta till.

source: <command>apt-get</command> can show you detailed information of the disk space needed for the installation. Before executing the upgrade, you can see this estimate by running:
fr: Le programme <command>apt-get</command> peut afficher des informations détaillées sur l'espace disque nécessaire à l'installation. Vous pouvez obtenir cette estimation avant d'effectuer vraiment la mise à niveau avec la commande :
it: <command>apt-get</command> può mostrare informazioni dettagliate sullo spazio su disco necessario per l'installazione. È possibile visualizzare questa stima prima di eseguire effettivamente l'aggiornamento, eseguendo:
ja: <command>apt-get</command> で、インストールに必要なディスク領域の詳細な情報が表示できます。アップグレードを実行する前に、次のように実行して必要な領域の推定値を見ることができます。
pt: O <command>apt-get</command> pode mostrar-lhe informação detalhada sobre o espaço em disco necessário para a instalação. Antes de efectuar a actualização do sistema, pode ver esta estimativa, correndo:
ro: <command>apt-get</command> vă poate arăta informații detaliate despre spațiul necesar pentru instalare. Înainte să începeți actualizarea, puteți vedea această estimare folosind comanda:
sv: <command>apt-get</command> kan visa detaljerad information om det diskutrymme som behövs för installationen. Du kan se denna uppskattning innan den faktiska uppgraderingen påbörjas genom att köra:

source: # apt-get -o APT::Get::Trivial-Only=true dist-upgrade [ ... ] XXX upgraded, XXX newly installed, XXX to remove and XXX not upgraded. Need to get xx.xMB of archives. After this operation, AAAMB of additional disk space will be used.
fr: # apt-get -o APT::Get::Trivial-Only=true dist-upgrade [ ... ] XXX paquets mis à jour, XXX nouvellement installés, XXX à enlever et XXX non mis à jour. Il est nécessaire de télécharger xx,x Mo d'archives. Après dépaquetage, AAA Mo seront utilisés.
it: # apt-get -o APT::Get::Trivial-Only=true dist-upgrade [ ... ] XXX aggiornati, XXX installati, XXX da rimuovere e XXX non aggiornati. È necessario scaricare xx.xMB di archivi. Dopo quest'operazione, verranno occupati AAAMB di spazio su disco.
ja: # apt-get -o APT::Get::Trivial-Only=true dist-upgrade [ ... ] アップグレード: XXX 個、新規インストール: XXX 個、削除: XXX 個、保留: XXX 個。 xx.x MB のアーカイブを取得する必要があります。 この操作後に追加で AAA MB のディスク容量が消費されます。
ro: # apt-get -o APT::Get::Trivial-Only=true dist-upgrade [ ... ] XXX actualizate, XXX noi instalate, XXX de îndepărtat și XXX neactualizate. Trebuie descărcate xx.xMB de arhive. După această operațiune, AAAMB spațiu suplimentar va fi folosit.
sv: # apt-get -o APT::Get::Trivial-Only=true dist-upgrade [ ... ] XXX uppgraderade, XXX nyinstallerade, XXX att ta bort och XXX inte uppgraderade. Behöver hämta xx.xMB arkiv. Efter uppackning kommer AAAMB diskplats att användas.

source: Running this command at the beginning of the upgrade process may give an error, for the reasons described in the next sections. In that case you will need to wait until you've done the minimal system upgrade as in <xref linkend="minimal-upgrade"/> and upgraded your kernel before running this command to estimate the disk space.
fr: Exécuter cette commande au début du processus de mise à niveau peut provoquer une erreur pour les raisons décrites dans les sections suivantes. Dans ce cas, vous devez attendre d'avoir effectuer la mise à niveau minimale du système comme décrit en <xref linkend="minimal-upgrade"/> et d'avoir mis à niveau le noyau avant d'exécuter cette commande pour estimer l'espace disque nécessaire.
it: L'esecuzione di questo comando all'inizio del processo di aggiornamento potrebbe restituire un errore, per le ragioni descritte nelle sezioni seguenti. In tal caso sarà necessario attendere finché non sarà stato eseguito l'aggiornamento minimo del sistema come descritto in <xref linkend="minimal-upgrade"/> e sarà stato aggiornato il kernel prima di eseguire il comando per avere una stima dello spazio necessario su disco.
ja: アップグレード手順の初めにこのコマンドを実行すると、以降のセクションで説明するような理由でエラーが発生する可能性があります。その場合、このコマンドを実行してディスク領域の推定値を見る前に、まず<xref linkend="minimal-upgrade"/>で説明しているシステムの最小アップグレードを行い、さらにカーネルをアップグレードする必要があります。
ml: നവീകരണ പ്രക്രിയ തുടങ്ങുമ്പോള്‍ ഈ ആജ്ഞ പ്രവര്‍ത്തിപ്പിയ്ക്കുമ്പോള്‍, ഇനി വരുന്ന വിഭാഗങ്ങളില്‍ വിവരിച്ച കാരണങ്ങള്‍ കൊണ്ടു്, ചിലപ്പോള്‍ പിശകു് പറ്റാം. <xref linkend="minimal-upgrade"/> ല്‍ പറഞ്ഞ പോലെ ചുരുങ്ങിയ സിസ്റ്റത്തിന്റെ നവീകരണം പൂര്‍ത്തിയാകുന്നതു് വരെ നിങ്ങള്‍ക്കു് കാത്തിരിയ്ക്കാനും ഡിസ്ക്ക് ഉപയോഗം കണക്കുകൂട്ടാനുള്ള ഈ ആജ്ഞ പ്രവര്‍ത്തിപ്പിയ്ക്കുന്നതിനു് മുമ്പു് നിങ്ങളുടെ കെര്‍ണല്‍ നവീകരിയ്ക്കേണ്ടിയും വന്നേയ്ക്കാം.
pt: Correr este comando no inicio do processo de actualização pode dar um erro, pelas razões descritas nas secções seguintes. Nesse caso você vai precisar de esperar até que tenha feito a actualização mínima ao sistema como em <xref linkend="minimal-upgrade"/> e actualizado o seu kernel antes de correr este comando para estimar o espaço do disco.
ro: Rulând această comandă la începutul procedeului de actualizare ar putea genera o eroare, din motive descrise în următoarele secțiuni. În acest caz va trebui să așteptați până ați făcut o actualizare minimală conform <xref linkend="minimal-upgrade"/> și ați actualizat nucleul înainte de a rula această comandă pentru a estima spațiul pe disc.
sv: Körning av det här kommandot i början av uppgraderingsprocessen kan ge felaktigheter, anledningarna beskrivs i nästkommande avsnitt. I det fallet behöver du vänta tills du har gjort en minimal systemuppgradering enligt <xref linkend="minimal-upgrade"/> och uppgraderat din kärna innan du kör det här kommandot för att uppskatta diskutrymmet.

source: If you do not have enough space for the upgrade, <command>apt-get</command> will warn you with a message like this:
fr: Si vous n'avez pas assez d'espace disque pour la mise à niveau, <command>apt-get</command> vous enverra un message comme&nbsp;:
it: Se lo spazio disponibile è insufficiente per l'aggiornamento, <command>apt-get</command> avverte con un messaggio come questo:
ja: アップグレードをするのに十分な領域がない場合は、<command>apt-get</command> が以下のような警告メッセージを出します。
pt: Se não tiver espaço suficiente para a actualização, o <command>apt-get</command> irá alertá-lo com uma mensagem como esta:
ro: Dacă nu aveți spațiu suficient pentru actualizare, <command>apt-get</command> vă va avertiza cu un mesaj asemănător cu:
sv: Om du inte har tillräckligt med utrymme för uppgraderingen så kommer <command>apt-get</command> att varna dig på följande sätt:

source: E: You don't have enough free space in /var/cache/apt/archives/.
fr: E: Vous n'avez pas assez d'espace disponible dans /var/cache/apt/archives/.
it: E: Spazio libero in /var/cache/apt/archives/ insufficiente.
ja: エラー: /var/cache/apt/archives/ に充分な空きスペースがありません。
ro: E: Nu aveți spațiu suficient în /var/cache/apt/archives/.
sv: F: Du har inte tillräckligt mycket ledigt utrymme i /var/cache/apt/archives/.

source: In this situation, make sure you free up space beforehand. You can:
fr: Si vous n'avez pas assez d'espace disque pour la mise à niveau, assurez-vous d'en libérer. Vous pouvez :
it: In questo caso, accertarsi di liberare prima uno spazio sufficiente. È possibile:
ja: この場合、事前に領域を解放するのを忘れないようにしてください。以下のことを実行するとよいでしょう。
pt: Nesta situação, certifique-se que liberta espaço antes de continuar. Você pode:
ro: În această situație eliberați spațiu înainte de actualizare. Aveți mai multe opțiuni:
sv: Försök i så fallk frigöra utrymme innan uppgraderingen. Du kan:

source: Remove packages that have been previously downloaded for installation (at <filename>/var/cache/apt/archives</filename>). Cleaning up the package cache by running <command>apt-get clean</command> will remove all previously downloaded package files.
fr: supprimer les paquets qui ont été téléchargés auparavant (dans <filename>/var/cache/apt/archives</filename>). Nettoyer le cache des paquets avec <command>apt-get clean</command> supprimera tous les paquets téléchargés auparavant ;
it: Rimuovere i pacchetti che sono stati precedentemente scaricati per l'installazione (in <filename>/var/cache/apt/archives</filename>). Per pulire la cache dei pacchetti, eseguire <command>apt-get clean</command>, rimuoverà tutti i file dei pacchetti scaricati in precedenza.
ja: インストールのために、以前 (<filename>/var/cache/apt/archives</filename> に) ダウンロードしたパッケージを削除する。<command>apt-get clean</command> を実行してパッケージキャッシュを一掃すると、以前ダウンロードしたパッケージファイルをすべて削除できます。
pt: Remover pacotes que tenham sido previamente descarregados para instalação (em <filename>/var/cache/apt/archives</filename>). Limpar a 'cache' de pacotes ao correr <command>apt-get clean</command> irá remover todos os ficheiros de pacotes anteriormente descarregados.
ro: Ștergeți pachetele care au fost descărcate anterior pentru a fi instalate (în <filename>/var/cache/apt/archive</filename>). Curățarea depozitului temporar de pachete, cu comanda <command>apt-get clean</command> va șterge toate fișierele descărcate anterior.
sv: Ta bort paket som tidigare har hämtats ner för installation (i <filename>/var/cache/apt/archive</filename>). Rensa upp paketcachen genom att köra <command>apt-get clean</command> vilket kommer att ta bort alla tidigare hämtade paketfiler.

source: Remove forgotten packages. If you have <systemitem role="package">popularity-contest</systemitem> installed, you can use <command>popcon-largest-unused</command> to list the packages you do not use that occupy the most space. You can also use <command>deborphan</command> or <command>debfoster</command> to find obsolete packages (see <xref linkend="obsolete"/> ). Alternatively you can start <command>aptitude</command> in <quote>visual mode</quote> and find obsolete packages under <quote>Obsolete and Locally Created Packages</quote>.
fr: supprimer les paquets oubliés. Si vous avez installé <systemitem role="package">popularity-contest</systemitem>, vous pouvez utiliser <command>popcon-largest-unused</command> pour lister les paquets que vous n'utilisez plus et qui occupent le plus de place. Vous pouvez également utiliser <command>deborphan</command> ou <command>debfoster</command> pour trouver les paquets obsolètes (consultez <xref linkend="obsolete"/>). Sinon, vous pouvez lancer <command>aptitude</command> en <quote>mode interactif</quote> et trouver les paquets obsolètes dans la section <quote>Paquets obsolètes ou créés localement</quote> ;
it: Rimuovere i pacchetti dimenticati. Se si è installato <systemitem role="package">popularity-contest</systemitem>, è possibile usare <command>popcon-largest-unused</command> per elencare i pacchetti che non vengono usati e che occupano più spazio nel sistema. È anche possibile usare <command>deborphan</command> o <command>debfoster</command> per trovare pacchetti obsoleti (vedere <xref linkend="obsolete"/>). In alternativa si può eseguire <command>aptitude</command> in <quote>modalità grafica</quote> e trovare i pacchetti obsoleti in <quote>Pacchetti obsoleti e creati localmente</quote>.
ja: 忘れ去られたパッケージを削除する。<systemitem role="package">popularity-contest</systemitem> をインストールしていれば、<command>popcon-largest-unused</command> を使って、使用していないパッケージのうち最も大きな領域を占めているものをリストアップできます。<command>deborphan</command> や <command>debfoster</command> を使って時代遅れのパッケージを見つけることも可能です (<xref linkend="obsolete"/> を参照してください)。それらのツールを使う代わりに <command>aptitude</command> を <quote>ビジュアルモード</quote> で起動すれば、古いパッケージは、<quote>廃止された、またはローカルで作成されたパッケージ</quote> の下に見つかります。
ml: മറന്നു പോയ പൊതികള്‍ നീക്കം ചെയ്യുക. നിങ്ങള്‍ <systemitem role="package">popularity-contest</systemitem> ഇന്‍സ്റ്റോള്‍ ചെയ്തിട്ടുണ്ടെങ്കില്‍ <command>popcon-largest-unused</command> ഉപയോഗിച്ചു് ഏറ്റവും കൂടുതല്‍ ഡിസ്ക്കില്‍ സ്ഥലമെടുക്കുന്നതും നിങ്ങള്‍ ഉപയോഗിയ്ക്കാത്തതുമായ പൊതികളെ കാണാം.<command>deborphan</command> അല്ലെങ്കില്‍ <command>debfoster</command> ഉപയോഗിച്ചു് പഴയ പ്രാധാന്യം കഴിഞ്ഞുപോയ പൊതികളെക്കുറിച്ചറിയാം (<xref linkend="obsolete"/> കാണുക). അല്ലെങ്കില്‍ നിങ്ങള്‍ക്കു് <command>aptitude</command> <quote>visual mode</quote> ല്‍ തുറന്നു് <quote>Obsolete and Locally Created Packages</quote> എന്ന വിഭാഗത്തില്‍ പഴയ പ്രാധാന്യം കഴിഞ്ഞുപോയ പൊതികളെ കാണാം.
pt: Remover pacotes esquecidos. Se tiver instalado o <systemitem role="package">popularity-contest</systemitem>, você pode utilizar o <command>popcon-largest-unused</command> para listar os pacotes que não utiliza e que ocupam a maioria do espaço. Você pode também utilizar o <command>deborphan</command> ou o <command>debfoster</command> para procurar pacotes obsoletos (veja <xref linkend="obsolete"/> ). Em alternativa você pode iniciar o <command>aptitude</command> em <quote>modo visual</quote> e procurar pacotes obsoletos sob <quote>Pacotes Obsoletos e Criados Localmente</quote>.
ro: Ștergeți pachete uitate. Dacă aveți instalat <systemitem role="package">popularity-contest</systemitem> puteți folosi <command>popcon-largest-unused</command> pentru a afișa lista pachetelor din sistem neutilizate, care ocupă cel mai mult spațiu. Puteți folosi și <command>deborphan</command> sau <command>debfoster</command> pentru a căuta pachete depășite (consultați <xref linkend="obsolete"/>). Ca alternativă puteți porni <command>aptitude</command> în <quote>modul vizual</quote> și veți găsi pachetele învechite în <quote>Pachete învechite și pachete create local</quote> (sau <quote>Obsolete and Locally Created Packages</quote> dacă folosiți interfața în limba engleză).
sv: Ta bort gamla paket som du inte längre använder. Om du har paketet <systemitem role="package">popularity-contest</systemitem> installerat kan du använda <command>popcon-largest-unused</command> för att lista de paket som du inte använder i systemet och som tar upp mest utrymme. Du kan även använda <command>deborphan</command> eller <command>debfoster</command> för att hitta föråldrade paket (se <xref linkend="obsolete"/>). Alternativt kan du starta <command>aptitude</command> i <quote>visuellt läge</quote> och hitta föråldrade paket under <quote>Föråldrade och lokalt skapade paket</quote>.

source: Remove packages that take up too much space and are not currently needed (you can always reinstall them after the upgrade). You can list the packages that take up the most disk space with <command>dpigs</command> (available in the <systemitem role="package">debian-goodies</systemitem> package) or with <command>wajig</command> (running <literal>wajig size</literal>).
fr: supprimer les paquets qui prennent trop de place et qui ne sont pas actuellement nécessaires (vous pourrez toujours les réinstaller après la mise à niveau). Vous pouvez lister les paquets prenant le plus d'espace disque avec <command>dpigs</command> (disponible dans le paquet <systemitem role="package">debian-goodies</systemitem>) ou avec <command>wajig</command> (en exécutant <literal>wajig size</literal>).
it: Rimuovere i pacchetti che occupano troppo spazio e che non sono attualmente necessari (li si può sempre reinstallare dopo l'aggiornamento). È possibile ottenere un elenco dei pacchetti che occupano più spazio su disco eseguendo il comando <command>dpigs</command> (disponibile nel pacchetto <systemitem role="package">debian-goodies</systemitem>) o <command>wajig</command> (eseguendo <literal>wajig size</literal>).
ja: あまりにも大きな領域を占めており現在は必要ないパッケージを削除する (アップグレード後にいつでも再インストール可能なのですから)。<command>dpigs</command> (<systemitem role="package">debian-goodies</systemitem> パッケージに含まれています) や <command>wajig</command> (<literal>wajig size</literal> を実行してください) を用いると、最も大きなディスク領域を占めているパッケージをリストアップできます。
ml: കൂടുതല്‍ സ്ഥലമെടുക്കുന്നതു് നിങ്ങള്‍ക്കിപ്പോള്‍ ആവശ്യമില്ലാത്തതുമായ പൊതികള്‍ നീക്കം ചെയ്യുക (നവീകരണത്തിനു് ശേഷം നിങ്ങള്‍ക്കവ വീണ്ടും ഇന്‍സ്റ്റോള്‍ ചെയ്യാം). ഏറ്റവും കൂടുതല്‍ ഡിസ്ക്ക് സ്ഥലം ഉപയോഗിയ്ക്കുന്ന പൊതികളെ കാണാന്‍ നിങ്ങള്‍ക്കു് (<systemitem role="package">debian-goodies</systemitem> എന്ന പൊതിയിലുള്ള) <command>dpigs</command> അല്ലെങ്കില്‍ <command>wajig</command> ഉപയോഗിയ്ക്കാം (<literal>wajig size</literal> പ്രവര്‍ത്തിപ്പിച്ചു്).
pt: Remova pacotes que estejam a ocupar demasiado espaço e que não estejam a ser necessários (pode sempre reinstalá-los após a actualização). Pode listar os pacotes que ocupam o maior espaço em disco com <command>dpigs</command> (disponível no pacote <systemitem role="package">debian-goodies</systemitem>) ou com <command>wajig </command> (correndo <literal>wajig size</literal>).
ro: Ștergeți pachetele care ocupă prea mult loc și nu sunt necesare imediat (oricum le puteți reinstala după actualizare). Puteți afișa pachetele care ocupă cel mai mult loc pe disc cu <command>dpigs</command> (disponibil în pachetul <systemitem role="package">debian-goodies</systemitem>) sau cu <command>wajig</command> (rulând <literal>wajig size</literal>).
sv: Ta bort paket som tar upp för mycket utrymme och som du inte har ett omedelbart behov av (du kan alltid installera om dem efter uppgraderingen). Du kan lista paketen som tar upp mest utrymme genom att köra <command>dpigs</command> (tillgängligt i paketet <systemitem role="package">debian-goodies</systemitem>) eller med <command>wajig</command> (kör <literal>wajig size</literal>).
