Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: If that fails, you will need an alternative way to boot your system so you can access and repair it. One option is to use a special rescue image or a Linux live CD. After booting from that, you should be able to mount your root file system and <literal>chroot</literal> into it to investigate and fix the problem.
fr: Si cela échoue, vous aurez besoin d'une autre méthode pour amorcer le système et le réparer. Une option est d'utiliser une image de récupération spéciale ou un CD autonome Linux (« Live CD »). Après avoir démarré à partir de ce support, vous devriez pouvoir monter le système de fichiers racine et effectuer un <literal>chroot</literal> dans celui-ci pour analyser et corriger le problème.
it: Se questa operazione non riesce, sarà necessario trovare un modo alternativo per avviare il proprio sistema in modo da potervi accedere per ripararlo. Una possibilità è l'utilizzo di un'immagine di ripristino speciale o di un CD live di Linux. Dopo aver avviato in tal modo, si dovrebbe essere in grado di montare il proprio file system radice ed entrarvi con <literal>chroot</literal> per trovare e correggere il problema.
ja: 古いカーネルでの再起動に失敗するなら、システムを起動してアクセス・修復するための代替手段が必要となるでしょう。1 つのオプションとしては、特別な復旧イメージや Linux ライブ CD を使うことがあります。これらを使って起動した後は、ルートファイルシステムをマウントし、<literal>chroot</literal> でその中に入って問題点を調査・解決できるはずです。
ml: അതു പരാജയപ്പെടുകയാണെങ്കില്‍, നിങ്ങളുടെ സിസ്റ്റം ബൂട്ട് ചെയ്യാന്‍ മറ്റൊരു വഴി വേണ്ടതാണു്. പ്രത്യേകമായി തയ്യാറാക്കിയ ഒരു റെസ്ക്യു ഇമേജോ ലിനക്സ് ലൈവ് സിഡിയോ ഉപയോഗിക്കുകയാണു് ഒരു വഴി. ഇതു ഉപയോഗിച്ച് ബൂട്ട് ചെയ്തതിനുശേഷം, റൂട്ട് ഫയല്‍ സിസ്റ്റം മൌണ്ട് ചെയ്തു <literal>chroot</literal> ഉപയോഗിച്ച് പ്രശ്നം കണ്ടു പിടിച്ച് പരിഹരിക്കാവുന്നതാണു്.
pt: Se isso falhar, precisará de um modo alternativo de arrancar o seu sistema para que possa aceder-lhe e repará-lo. Uma opção é utilizar uma imagem especial de recuperação ou um live CD de Linux. Após arrancar com ele, deverá ser capaz de montar o seu sistema de ficheiros raiz e <literal>chroot</literal> nele para investigar e resolver o problema.
ro: Dacă aceasta nu reușește, va trebui să porniți sistemul printr-o metodă alternativă, astfel încât să-l puteți accesa și repara. O opțiune este să folosiți o imagine specială pentru recuperare sau un Linux care rulează de pe CD. După pornirea în acest fel ar trebui să puteți monta sistemul de fișiere rădăcină și să faceți <literal>chroot</literal> în el pentru a investiga și repara problema.
sv: Om det misslyckas behöver du ett alternativt sätt att starta upp ditt system på så att du kan komma åt och reparera det. Ett alternativ är att använda en speciell räddningsavbild eller en cd-skiva med ett körbart Linuxsystem på. Efter att du har startat upp från en sådan skiva bör du kunna montera ditt rotfilsystem och använda <literal>chroot</literal> in i det för att undersöka och rätta till problemet.
zh_tw: 如果這個方法失敗了，您必須另尋其它方式來啟動您的系統，讓您可以進行存取並修復它。方法之一是利用特定的救援影像檔或 Linux 的 live CD。利用它們開機之後，您應該可以掛載您的 root 檔案系統並 <literal>chroot</literal> 進去以檢查並修復問題。

source: Another option we'd like to recommend is to use the <emphasis>rescue mode</emphasis> of the &releasename; Debian Installer. The advantage of using the installer is that you can choose between its many installation methods for one that best suits your situation. For more information, please consult the section <quote>Recovering a Broken System</quote> in chapter 8 of the <ulink url="&url-install-manual;">Installation Guide</ulink> and the <ulink url="&url-wiki;DebianInstaller/FAQ">Debian Installer FAQ</ulink>.
fr: L'option que nous vous recommandons est d'utiliser le <emphasis>mode de secours</emphasis> (« rescue mode ») de l'installateur Debian de &Releasename;. L'avantage d'utiliser l'installateur est que vous pouvez choisir l'option qui convient le mieux à votre situation. Pour plus d'informations, veuillez consulter la section <quote>Récupérer un système cassé</quote> du chapitre 8 du <ulink url="&url-install-manual;">manuel d'installation</ulink> et la <ulink url="&url-wiki;DebianInstaller/FAQ">FAQ de l'installateur Debian</ulink>.
it: Un'altra possibilità che si raccomanda di usare è la <emphasis>modalità di ripristino</emphasis> dell'installatore di Debian &releasename;. Il vantaggio di questa opzione consiste nel fatto che è possibile scegliere, fra i suoi numerosi metodi di installazione, quello che meglio corrisponde alla propria situazione. Per maggiori informazioni si consulti la sezione <quote>Recupero di un sistema danneggiato</quote> nel capitolo 8 della <ulink url="&url-install-manual;">Guida all'installazione</ulink> e le <ulink url="&url-wiki;DebianInstaller/FAQ">FAQ dell'installatore di Debian</ulink>.
ja: お勧めしたい別のオプションとしては、&releasename; 用 Debian Installer の<emphasis>レスキューモード</emphasis>を使用する方法があります。同インストーラを使う利点は、多くのインストール手段の中からあなたの状況に最適なものを選べることです。より詳しい情報は、<ulink url="&url-install-manual;">インストールガイド</ulink>の第 8 章にある <quote>壊れたシステムの復旧</quote> セクションや、<ulink url="&url-wiki;DebianInstaller/FAQ">Debian Installer FAQ</ulink> を参照してください。
ml: ഞങ്ങള്‍ ശുപാര്‍ശ ചെയ്യുന്ന മറ്റൊരു വഴി &releasename; ഡെബിയന്‍ ഇന്‍സ്റ്റോളറിന്റെ <emphasis>rescue mode</emphasis> ഉപയോഗിയ്ക്കാനാണു്. ഇന്‍സ്റ്റോളര്‍ ഉപയോഗിയ്ക്കുന്നതു് കൊണ്ടുള്ള മെച്ചം നിങ്ങള്‍ക്കു് പല ഇന്‍സ്റ്റലേഷന്‍ രീതികളില്‍ നിന്നും നിങ്ങളുടെ അവസ്ഥയ്ക്കനുയോജ്യമായ രീതി തെരഞ്ഞെടുക്കാം എന്നതാണു്. കൂടുതല്‍ വിവരങ്ങള്‍ക്കു് <ulink url="&url-install-manual;">ഇന്‍സ്റ്റലേഷന്‍ വഴികാട്ടിയിലെ</ulink> 8 മത്തെ അദ്ധ്യായത്തിലെ <quote>Recovering a Broken System</quote> എന്ന ഭാഗവും <ulink url="&url-wiki;DebianInstaller/FAQ">ഡെബിയന്‍ ഇന്‍സ്റ്റോളറിനെക്കുറിച്ചുള്ള ചോദ്യോത്തരങ്ങളും</ulink> കാണുക.
pt: Outra opção que gostaríamos de recomendar é a utilização do <emphasis>modo de recuperação</emphasis> do instalador Debian &releasename;. A vantagem de utilizar o instalador é que pode escolher de entre os seus muitos modos de instalação o que melhor se adequa à sua situação. Para mais informação, por favor consulte a secção <quote>Recuperar um Sistema Estragado</quote> no capítulo 8 do <ulink url="&url-install-manual;">Guia de instalação</ulink> e as <ulink url="&url-wiki;DebianInstaller/FAQ">FAQ do instalador Debian</ulink>.
ro: O altă opțiune pe care o recomandăm este folosirea <emphasis>modului recuperare</emphasis> al Programului de instalare Debian &releasename;. Avantajul folosirii programului de instalare este că puteți alege dintre multiplele metode de instalare pe cea care se potrivește cel mai bine situației. Vă rugăm să consultați secțiunea <quote>Recovering a Broken System</quote> (n.tr. Recuperarea unui sistem stricat) din capitolul 8 al <ulink url="&url-install-manual;">Ghidului de instalare</ulink> și <ulink url="&url-wiki;DebianInstaller/FAQ">FAQ - Întrebări frecvente despre Programul de instalare</ulink>.
sv: Ett annat alternativ som vi rekommenderar är att använda <emphasis>räddningsläget</emphasis> i Debian-installeraren för &releasename;. Fördelen med att använda installeraren är att du kan välja bland dess många installationsmetoder för att hitta en som bäst passar din situation. För mer information, konsultera avsnittet <quote>Återställning av ett trasigt system</quote> i kapitel 8 av <ulink url="&url-install-manual;">Installationsguiden</ulink> och <ulink url="&url-wiki;DebianInstaller/FAQ">Debian Installer FAQ</ulink>.

source: Debug shell during boot using initrd
fr: Shell de débogage pendant l'amorçage utilisant un initrd
it: Shell di debug durante l'avvio con initrd
ja: initrd を使った起動中のデバッグシェル
ml: ഇനിറ്റാര്‍ഡിയുപയോഗിച്ചു് ബൂട്ട് സമയത്തെ പിഴവു് തിരുത്താനുള്ള ഷെല്‍
pt: Shell de depuração durante o arranque utilizando o initrd
ro: Consola de depanare în timpul inițializării folosind initrd
sv: Felsökningsskal under uppstart med hjälp av initrd
zh_tw: 在開機過程中使用 initrd 的除錯介面 (debug shell)

source: The <systemitem role="package">initramfs-tools</systemitem> includes a debug shell<footnote>
fr: Le paquet <systemitem role="package">initramfs-tools</systemitem> inclut un shell de débogage<footnote>
it: <systemitem role="package">initramfs-tools</systemitem> include una shell di debug<footnote>
ja: <systemitem role="package">initramfs-tools</systemitem> で生成される initrd には、デバッグシェル<footnote>
ml: <systemitem role="package">initramfs-tools</systemitem> ഒരു പിഴവു് തിരുത്താനുള്ള ഷെല്‍ ഉള്‍ക്കൊള്ളുന്നു<footnote>
pt: O <systemitem role="package">initramfs-tools</systemitem> inclui uma 'shell' de depuração<footnote>
ro: Pachetul <systemitem role="package">initramfs-tools</systemitem> include un interpretor de comenzi pentru depanare<footnote>
sv: Paketet <systemitem role="package">initramfs-tools</systemitem> inkluderar ett felsökningsskal<footnote>
zh_tw: <systemitem role="package">initramfs-tools</systemitem> 會在它所產生的 initrds 裡放入一個 debug shell<footnote>

source: This feature can be disabled by adding the parameter <literal>panic=0</literal> to your boot parameters.
fr: Cette fonctionnalité peut être désactivée en ajoutant le paramètre <literal>panic=0</literal> aux paramètres d'amorçage.
it: Questa funzionalità può essere disabilitata aggiungendo il parametro <literal>panic=0</literal> ai parametri di avvio del proprio sistema.
ja: この機能は、ブートパラメータに <literal>panic=0</literal> を付加することで無効にできます。
ml: നിങ്ങളുടെ ബൂട്ട് പരാമീറ്ററില്‍ <literal>panic=0</literal> എന്നു് ചേര്‍ത്തു് ഈ കഴിവു് പ്രവര്‍ത്തനരഹിതമാക്കാം.
pt: Esta função pode ser desactivada ao adicionar o parametro <literal>panic=0</literal> aos parametros de arranque.
ro: Această facilitate poate fi dezactivată prin adăugarea parametrului <literal>panic=0</literal> la parametrii de inițializare.
sv: Den här funktionen kan inaktiveras genom att lägga till parametern <literal>panic=0</literal> till dina uppstartparametrar.
zh_tw: 可以在開機參數上加上 <literal>panic=0</literal> 參數來關閉這個功能。

source: </footnote> in the initrds it generates. If for example the initrd is unable to mount your root file system, you will be dropped into this debug shell which has basic commands available to help trace the problem and possibly fix it.
fr: </footnote> dans les initrd qu'il génère. Si, par exemple, l'initrd ne peut pas monter le système de fichiers racine, vous vous retrouverez dans ce shell de débogage. Celui-ci possède des commandes de base qui permettent de « tracer » le problème et peut-être de le corriger.
it: </footnote> negli initrd che genera. Per esempio, se initrd non è in grado di montare il file system radice si verrà rimandati in questa shell di debug, la quale mette a disposizione i comandi di base per trovare il problema e, se possibile, risolverlo.
ja: </footnote>が含まれています。例えば、initrd がルートファイルシステムをマウントできなければ、デバッグシェル内に移るでしょう。このデバッグシェルは、問題の追跡、そしておそらくは修正の手助けとなる基本的なコマンドを備えています。
ml: </footnote> ഇതു് സൃഷ്ടിയ്ക്കുന്ന ഇനിറ്റാര്‍ഡികളില്‍. ഉദാഹരണത്തിനു് ഈ ഇനിറ്റാര്‍ഡി നിങ്ങളുടെ റൂട്ട് ഫയല്‍ സിസ്റ്റം ചേര്‍ക്കുന്നതില്‍ പരാജയപ്പെട്ടാല്‍, ഈ പ്രശ്നത്തിന്റെ കാരണം കണ്ടുപിടിയ്ക്കാനും ഒരു പക്ഷേ പരിഹാരം കാണാനും സഹായകമാകുന്ന അടിസ്ഥാന ആ‍ജ്ഞകള്‍ ലഭ്യമായ ഈ പിഴവു് തിരുത്താനുള്ള ഷെല്ലില്‍ നിങ്ങള്‍ എത്തിച്ചേരും.
pt: </footnote> nos initrds que gera. Se por exemplo o initrd é incapaz de montar o sistema de ficheiros raiz, você será deixado nesta shell de depuração que tem comandos básicos para ajudar a descobrir e talvez resolver o problema.
ro: </footnote> în imaginile initrd pe care le generează. Dacă, de exemplu, imaginea initrd nu poate să monteze sistemul de fișiere rădăcină, veți fi transferat la acest interpretor de comenzi, care dispune de comenzi de bază pentru a putea detecta și, în măsura posibilităților, de a rezolva problema.
sv: </footnote> i de initrd-filer som den genererar. Om, till exempel, initrd-filen inte kan montera ditt rotfilsystem, kommer du att bli förflyttad in i det här felsökningsskalet vilket har grundläggande kommandon tillgängliga för att hjälpa till att spåra problemet och möjligen rätta till det.
zh_tw: </footnote>。比如說，當您無法掛載您的 root 檔案系統時，您會進入這個提供了一些基本功能的 debug shell，以用來追蹤問題並試著修復它。

source: Basic things to check are: presence of correct device files in <filename>/dev</filename>; what modules are loaded (<literal>cat /proc/modules</literal>); output of <command>dmesg</command> for errors loading drivers. The output of <command>dmesg</command> will also show what device files have been assigned to which disks; you should check that against the output of <literal>echo $ROOT</literal> to make sure that the root file system is on the expected device.
fr: Les points de base à vérifier sont : la présence de fichiers de périphériques corrects dans <filename>/dev</filename> ; les modules chargés (<literal>cat /proc/modules</literal>) ; la sortie de <command>dmesg</command> pour des erreurs liées au chargement de pilotes. La sortie de <command>dmesg</command> affichera également les fichiers de périphériques qui ont été assignés aux disques ; vous devriez vérifier ces points et les comparer à l'affichage de <literal>echo $ROOT</literal> pour vous assurer que le système de fichiers racine est sur le périphérique attendu.
it: Le cose di base da controllare sono: la presenza dei file device corretti in <filename>/dev</filename>, quali moduli vengono caricati (<literal>cat /proc/modules</literal>) e l'output di <command>dmesg</command> per gli errori durante il caricamento dei driver. L'output di <command>dmesg</command> mostra inoltre quali file device sono stati assegnati a quali dischi; questi risultati andranno confrontati con l'output di <literal>echo $ROOT</literal>, per assicurarsi che il file system radice sia sul device atteso.
ja: チェックすべき基本的事項としては、次のようなものがあります。<filename>/dev</filename> 内に適切なデバイスファイルが存在するか、どのモジュールがロードされているか (<literal>cat /proc/modules</literal>)、<command>dmesg</command> の出力にドライバのロード失敗のエラーが出ていないか、など。<command>dmesg</command> の出力はまた、どのデバイスファイルがどのディスクに割り当てられているのかも示してくれます。ルートファイルシステムが期待通りのデバイス上にあるかを確認するために、<literal>echo $ROOT</literal> の出力もチェックすべきでしょう。
ml: പരിശോധിയ്ക്കേണ്ട അടിസ്ഥാന കാര്യങ്ങളിവയാണു്: <filename>/dev</filename> ല്‍ ശരിയായ ഉപകരണ ഫയലുകള്‍; ഏതൊക്കെ ഭാഗങ്ങളാണു് ചേര്‍ത്തിരിയ്ക്കുന്നതു് (<literal>cat /proc/modules</literal>); പ്രവര്‍ത്തകങ്ങള്‍ ചേര്‍ക്കുമ്പോഴുണ്ടായ പിശകുകള്‍ക്കു് <command>dmesg</command> ന്റെ ഫലം. <command>dmesg</command> ന്റെ ഫലം ഏതൊക്കെ ഉകരണ ഫയലുകള്‍ ഏതൊക്കെ ഡിസ്ക്കുകള്‍ക്കു് നല്‍കിയിരിയ്ക്കുന്നു എന്നതു് കാണിയ്ക്കും; <literal>echo $ROOT</literal> എന്നതിന്റെ ഫലവുമായി ഒത്തുനോക്കി പ്രതീക്ഷിച്ച ഉപകരണത്തില്‍ തന്നെയാണു് റൂട്ട് ഫയല്‍ സിസ്റ്റം എന്നു് നിങ്ങള്‍ പരിശോധിയ്ക്കണം.
pt: Coisas básicas a verificar são: a presença dos ficheiros de dispositivo correctos em <filename>/dev</filename>; que módulos estão carregados (<literal>cat /proc/modules</literal>); mensagens do <command>dmesg</command> que podem ter erros no carregamento de drivers. As mensagens do <command>dmesg </command> também irão mostrar que ficheiros de dispositivo estão associados a que discos; deve verificar isso com a mensagem de <literal>echo $ROOT</literal> para se certificar que o sistema de ficheiros raiz está no dispositivo esperado.
ro: Lucruri uzuale pe care ar trebui să le verificați: prezența fișierelor-dispozitiv corecte în <filename>/dev</filename>, care module sunt încărcate (<literal>cat /proc/modules</literal>), verificarea rezultatului comenzii <command>dmesg</command> pentru erori la încărcarea driverelor. Rezultatul comenzii <command>dmesg</command> va arăta și care fișiere-dispozitiv au fost alocate discurilor. Ar trebui să verificați rezultatul comenzii <literal>echo $ROOT</literal> pentru a vă asigura că sistemul de fișiere rădăcină este pe dispozitivul pe care vă așteptați să fie.
sv: Grundläggande saker att kontrollera är: närvaron av korrekta enhetsfiler i <filename>/dev</filename>; vilka moduler som läses in (<literal>cat /proc/modules</literal>); utdata för <command>dmesg</command> efter fel vid inläsning av drivrutiner. Utdata för <command>dmesg</command> kommer även att visa vilka enhetsfiler som har tilldelats till vilka diskar; du bör kontrollera det här mot utdata för <literal>echo $ROOT</literal> för att försäkra dig om att rotfilsystemet finns på den förväntade enheten.
zh_tw: 基本的檢查包括了：在 <filename>/dev</filename> 中是否有出現正確的裝置檔；已載入了哪些模組（<literal>cat /proc/modules</literal>）；在 <command>dmesg</command> 的輸出裡是否有驅動無法載入的資訊。在 <command>dmesg</command> 的輸出裡也會顯示了哪個裝置檔已被指定為使用哪個磁碟；您應該把它和 <literal>echo $ROOT</literal> 的輸出進行比較以確保 root 檔案系統是掛載在正確的裝置上。

source: If you do manage to fix the problem, typing <literal>exit</literal> will quit the debug shell and continue the boot process at the point it failed. Of course you will also need to fix the underlying problem and regenerate the initrd so the next boot won't fail again.
fr: Si vous parvenez à corriger le problème, entrez <literal>exit</literal> pour arrêter le shell de débogage et continuer le processus d'amorçage au point où il avait échoué. Bien sûr, vous devrez également corriger le problème sous-jacent et régénérer l'initrd afin d'éviter un nouvel échec au prochain amorçage.
it: Se si è riusciti a risolvere il problema, digitando <literal>exit</literal> si uscirà dalla shell di debug e si continuerà il processo di avvio a partire dal punto in cui il problema si è verificato. Naturalmente sarà anche necessario risolvere il problema sottostante e rigenerare initrd in modo che il prossimo avvio non fallisca nuovamente.
ja: 問題点を何とか解決できたなら、<literal>exit</literal> とタイプすることでデバッグシェルを終了させ、起動プロセスを失敗した時点から継続できます。もちろん次回の起動時に再び失敗することが無いよう、根本的な問題を修正して initrd を再生成する必要があるでしょう。
ml: നിങ്ങള്‍ പ്രശ്നം പരിഹരിയ്ക്കുന്നതില്‍ വിജയിച്ചാല്‍ <literal>exit</literal> എന്നടിച്ചാല്‍ അതു് നിങ്ങളെ പിഴവു് തിരുത്താനുള്ള ഷെല്ലില്‍‌ നിന്നും പുറത്തു് കൊണ്ടുവരുകയും പരാജയപ്പെട്ട സ്ഥാനത്തു് നിന്നും ബൂട്ട് പ്രക്രിയ തുടരുകയും ചെയ്യും. തീര്‍ച്ചയായും അടുത്ത ബൂട്ട് പരാജയമാവില്ലെന്നുറപ്പാക്കാന്‍ നിങ്ങള്‍ അടിസ്ഥാന പ്രശ്നം പരിഹരിച്ചു് ഇനിറ്റാര്‍ഡി വീണ്ടു് സൃഷ്ടിയ്ക്കണം.
pt: Se conseguir resolver o problema, escrever <literal>exit</literal> irá terminar a shell de depuração e continuar o processo de arranque no ponto onde falhou. Claro que também precisará de resolver o problema subjacente e gerar de novo a initrd para que o próximo arranque não falhe de novo.
ro: Dacă reușiți să corectați problema, puteți ieși din consola de depanare cu comanda <literal>exit</literal> și apoi se va continua procesul de inițializare de la punctul în care a eșuat. Desigur, va trebui să reparați problema reală și să regenerați imaginea initrd pentru ca următoarea inițializare a sistemului să nu eșueze la fel.
sv: Om du lyckas rätta till problemet, skriv <literal>exit</literal> för att avsluta felsökningsskalet och fortsätta uppstartsprocessen där felet inträffade. Självfallet behöver du även rätta till det underliggande problemet och generera om initrd-filen så att nästa uppstart inte misslyckas.
zh_tw: 如果您已採取行動解決問題，鍵入 <literal>exit</literal> 將會跳出除錯介面並會由開機失敗的地方繼續進行開機。當然了，您也必須由根本修復問題並重新產生 initrd，讓下次開機時不會又因而失敗。

source: Prepare a safe environment for the upgrade
fr: Préparer un environnement sain pour la mise à niveau
it: Preparazione di un ambiente sicuro per l'aggiornamento
ja: アップグレード用の安全な環境の準備
ml: നവീകരിക്കുന്നതിനു സുരക്ഷിതമായ ഒരു പരിതസ്ഥിതി തയ്യാറാക്കുക
pt: Preparar um ambiente seguro para a actualização
ro: Pregătiți un mediu sigur pentru actualizare
sv: Förbered en säker miljö för uppgraderingen
zh_tw: 準備一個安全無虞的環境以進行升級

source: The distribution upgrade should be done either locally from a textmode virtual console (or a directly connected serial terminal), or remotely via an <command>ssh</command> link.
fr: Vous devez faire la mise à niveau de la distribution soit localement, à partir d'une console texte virtuelle ou d'un terminal série directement connecté, soit à distance via une connexion <command>ssh</command>.
it: L'aggiornamento della distribuzione dovrebbe essere eseguito o da locale, da una console virtuale in modalità testo (o da un terminale seriale collegato direttamente), o da remoto, tramite una connessione <command>ssh</command>.
ja: ディストリビューションのアップグレードは、ローカルのテキストモード仮想コンソール (あるいは直接接続されたシリアル端末) から行うか、リモートなら <command>ssh</command> 接続経由で行いましょう。
ml: വിതരണത്തിന്റെ നവീകരണം പദാവലി ദശയിലെ മായാ കണ്‍സോളില്‍ (അല്ലെങ്കില്‍ നേരിട്ടു് കുത്തിയ സീരിയല്‍ ടെര്‍മിനലില്‍) നിന്നും പ്രാദേശികമായോ, അല്ലെങ്കില്‍ വിദൂരമായി ഒരു <command>ssh</command> ബന്ധം വഴിയോ ചെയ്യണം.
pt: A actualização da distribuição deve ser efectuada localmente a partir de uma consola virtual de texto (ou directamente ligada a um terminal série), ou remotamente através de uma ligação <command>ssh</command>.
ro: Actualizarea distribuției ar trebui făcută fie local dintr-o consolă virtuală în mod text (sau printr-o conexiune la un terminal serial), fie de la distanță printr-o conexiune <command>ssh</command>.
sv: Uppgradering av distributionen bör göras antingen lokalt från en virtuell textkonsoll (eller en direktansluten serieterminal), eller från ett fjärrsystem via en <command>ssh</command>-anslutning.
zh_tw: 您應該在本機透過文字模式的虛擬主控台（或直接連線的序列終端機）、或由遠端透過 <command>ssh</command> 連線來進行發行版間的升級。

source: If you are using some VPN services (such as <systemitem role="package">tinc</systemitem>) they might not be available throughout the upgrade process. Please see <xref linkend="services-downtime"/>.
fr: Si vous utilisez des services VPN (par exemple <systemitem role="package">tinc</systemitem>), ils ne seront peut-être pas disponibles en permanence pendant la mise à niveau. Veillez consultez <xref linkend="services-downtime"/>.
it: I servizi VPN (quali <systemitem role="package">tinc</systemitem>) potrebbero non essere disponibili durante l'aggiornamento. Consultare <xref linkend="services-downtime"/>.
ja: (<systemitem role="package">tinc</systemitem> のような) VPN サービスを使っている場合、アップグレード作業中に使えなくなるかもしれません。 <xref linkend="services-downtime"/> を参照してください。
pt: Se você está a usar alguns serviços VPN (como o <systemitem role="package">tinc</systemitem>) eles podem não estar disponíveis durante o processo de actualização. Por favor veja <xref linkend="services-downtime"/>.
ro: Dacă utilizați servicii VPN (ca <systemitem role="package">tinc</systemitem>) este posibil să nu fie disponibile pe parcursul procesului de înnoire. Mai multe informații la <xref linkend="services-downtime"/>.
sv: Om du använder någon form av VPN-tjänst (exempelvis <systemitem role="package">tinc</systemitem>) är det möjligt att de inte är tillgängliga under uppgraderingsprocessen. Läs mer i <xref linkend="services-downtime"/>.
