Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: <systemitem role="package">postgresql-8.3</systemitem>, successor is <systemitem role="package">postgresql-8.4</systemitem>.
fr: <systemitem role="package">postgresql-8.3</systemitem>, dont le successeur est <systemitem role="package">postgresql-8.4</systemitem> ;
it: <systemitem role="package">postgresql-8.3</systemitem>, il successore è <systemitem role="package">postgresql-8.4</systemitem>.
ja: <systemitem role="package">postgresql-8.3</systemitem>: 後継となるパッケージは <systemitem role="package">postgresql-8.4</systemitem>
pt: <systemitem role="package">postgresql-8.3</systemitem>, sucessor é o <systemitem role="package">postgresql-8.4</systemitem>
ro: <systemitem role="package">postgresql-8.3</systemitem>, succesorul fiind <systemitem role="package">postgresql-8.4</systemitem>.
sv: <systemitem role="package">postgresql-8.3</systemitem> ersätts av <systemitem role="package">postgresql-8.4</systemitem>.

source: <systemitem role="package">mysql-server-5.0</systemitem>, successor is <systemitem role="package">mysql-server-5.1</systemitem>.
fr: <systemitem role="package">postgresql-5.0</systemitem>, dont le successeur est <systemitem role="package">postgresql-5.1</systemitem> ;
it: <systemitem role="package">mysql-server-5.0</systemitem>, il successore è <systemitem role="package">mysql-server-5.1</systemitem>.
ja: <systemitem role="package">mysql-server-5.0</systemitem>: 後継となるパッケージは <systemitem role="package">mysql-server-5.1</systemitem>
pt: <systemitem role="package">mysql-server-5.0</systemitem>, sucessor é o <systemitem role="package">mysql-server-5.1</systemitem>.
ro: <systemitem role="package">mysql-server-5.0</systemitem>, succesorul fiind <systemitem role="package">mysql-server-5.1</systemitem>.
sv: <systemitem role="package">mysql-server-5.0</systemitem> ersätts av <systemitem role="package">mysql-server-5.1</systemitem>.

source: <systemitem role="package">python2.4</systemitem>, successor is <systemitem role="package">python2.6</systemitem>.
fr: <systemitem role="package">python2.4</systemitem>, dont le successeur est <systemitem role="package">python2.6</systemitem> ;
it: <systemitem role="package">python2.4</systemitem>, il successore è <systemitem role="package">python2.6</systemitem>.
ja: <systemitem role="package">python2.4</systemitem>: 後継となるパッケージは <systemitem role="package">python2.6</systemitem>
pt: <systemitem role="package">python2.4</systemitem>, sucessor é o <systemitem role="package">python2.6</systemitem>.
ro: <systemitem role="package">python2.4</systemitem>, succesorul fiind <systemitem role="package">python2.6</systemitem>.
sv: <systemitem role="package">python2.4</systemitem> ersätts av <systemitem role="package">python2.6</systemitem>.

source: Java 5 software including the packages <systemitem role="package">sun-java5-jre</systemitem> and <systemitem role="package">sun-java5-bin</systemitem>, successor is Java 6: <systemitem role="package">sun-java6-jre</systemitem> and associated packages.
fr: le logiciel Java 5, en particulier les paquets <systemitem role="package">sun-java5-jre</systemitem> et <systemitem role="package">sun-java5-bin</systemitem>, son successeur est Java 6&nbsp;: <systemitem role="package">sun-java6-jre</systemitem> et les paquets associés ;
it: Java 5 compresi i pacchetti <systemitem role="package">sun-java5-jre</systemitem> e <systemitem role="package">sun-java5-bin</systemitem>, il successore è Java 6: <systemitem role="package">sun-java6-jre</systemitem> e i pacchetti associati.
ja: <systemitem role="package">sun-java5-jre</systemitem> や <systemitem role="package">sun-java5-bin</systemitem> を含む Java 5 ソフトウェアは、Java 6 が後継となります: <systemitem role="package">sun-java6-jre</systemitem> とその関連パッケージです。
pt: O software Java 5 incluindo os pacotes <systemitem role="package">sun-java5-jre</systemitem> e <systemitem role="package">sun-java5-bin</systemitem>, o sucessor é o Java 6: <systemitem role="package">sun-java6-jre</systemitem> e pacotes associados.
ro: Aplicațiile Java 5 inclusiv pachetele <systemitem role="package">sun-java5-jre</systemitem> și <systemitem role="package">sun-java5-bin</systemitem>, succesor fiind Java 6: <systemitem role="package">sun-java6-jre</systemitem> și pachetele asociate.
sv: Java 5-mjukvara inklusive paketen <systemitem role="package">sun-java5-jre</systemitem> och <systemitem role="package">sun-java5-bin</systemitem> efterföljs av Java 6: <systemitem role="package">sun-java6-jre</systemitem> och andra paket.

source: <systemitem role="package">apt-proxy</systemitem> is no longer provided, alternatives to this tool include <systemitem role="package">apt-cacher-ng</systemitem>, <systemitem role="package">apt-cacher</systemitem> and <systemitem role="package">approx</systemitem>. Although no automatic upgrade path exists, user of <systemitem role="package">apt-proxy</systemitem> can switch to these alternatives by manually installing any of these packages.
fr: <systemitem role="package">apt-proxy</systemitem> n'est plus fourni, utilisez à la place <systemitem role="package">apt-cacher-ng</systemitem>, <systemitem role="package">apt-cacher</systemitem> ou <systemitem role="package">approx</systemitem>. Bien qu'il n'existe pas de gestion de mise à niveau, les utilisateurs d'<systemitem role="package">apt-proxy</systemitem> peuvent migrer vers une de ces alternatives en installant l'un de ces paquets ;
it: <systemitem role="package">apt-proxy</systemitem> non è più fornito, delle alternative a questo programma sono <systemitem role="package">apt-cacher-ng</systemitem>, <systemitem role="package">apt-cacher</systemitem> e <systemitem role="package">approx</systemitem>. Purtroppo non esiste un metodo d'aggiornamento automatico, gli utenti di <systemitem role="package">apt-proxy</systemitem> possono passare a una delle alternative installando manualmente un qualsiasi pacchetto tra questi.
ja: <systemitem role="package">apt-proxy</systemitem> が、今後提供されなくなったので、このツールの代替には <systemitem role="package">apt-cacher-ng</systemitem>、<systemitem role="package">apt-cacher</systemitem>、<systemitem role="package">approx</systemitem> があります。自動的にアップグレードする方法は存在していないので、<systemitem role="package">apt-proxy</systemitem> のユーザは、手作業でこれらのパッケージのどれかをインストールすることによって代替品に移行が可能になります。
pt: O <systemitem role="package">apt-proxy</systemitem> não é mais disponibilizado, as alternativas a esta ferramenta incluem <systemitem role="package">apt-cacher-ng</systemitem>, <systemitem role="package">apt-cacher</systemitem> e <systemitem role="package">approx</systemitem>. Apesar de não existir um caminho automático de actualização, os utilizadores do <systemitem role="package">apt-proxy</systemitem> podem mudar para estas alternativas ao instalar manualmente qualquer um destes pacotes.
ro: <systemitem role="package">apt-proxy</systemitem> nu mai este disponibil, alternative la această unealtă fiind <systemitem role="package">apt-cacher-ng</systemitem>, <systemitem role="package">apt-cacher</systemitem> și <systemitem role="package">approx</systemitem>. Deși nu există posibilitatea de actualizare automată, utilizatorii <systemitem role="package">apt-proxy</systemitem> pot trece la una din aceste alternative instalând manual unul din aceste pachete.
sv: <systemitem role="package">apt-proxy</systemitem> tillhandahålls inte längre, alternativ till detta verktyg finns i exempelvis <systemitem role="package">apt-cacher-ng</systemitem>, <systemitem role="package">apt-cacher</systemitem> och <systemitem role="package">approx</systemitem>. Det finns ingen automatisk uppgraderingsväg men användare som kör <systemitem role="package">apt-proxy</systemitem> kan byta till dessa genom att manuellt installera något eller några av dessa paket.

source: Some of Xorg's video drivers are no longer available in &releasename; and are obsolete. This includes <systemitem role="package">xserver-xorg-video-cyrix</systemitem>, <systemitem role="package">xserver-xorg-video-i810</systemitem>, <systemitem role="package">xserver-xorg-video-imstt</systemitem>, <systemitem role="package">xserver-xorg-video-nsc</systemitem>, <systemitem role="package">xserver-xorg-video-sunbw2</systemitem>, and <systemitem role="package">xserver-xorg-video-vga</systemitem>. They might be removed through the upgrade. Users should install <systemitem role="package">xserver-xorg-video-all</systemitem> instead.
fr: quelques pilotes graphiques ne sont plus fournis dans &Releasename; et sont obsolètes. On peut citer <systemitem role="package">xserver-xorg-video-cyrix</systemitem>, <systemitem role="package">xserver-xorg-video-i810</systemitem> <systemitem role="package">xserver-xorg-video-imstt</systemitem>, <systemitem role="package">xserver-xorg-video-nsc</systemitem>, <systemitem role="package">xserver-xorg-video-sunbw2</systemitem>, et <systemitem role="package">xserver-xorg-video-vga</systemitem>. Ils peuvent être supprimés pendant l'installation. Vous devriez utiliser <systemitem role="package">xserver-xorg-video-all</systemitem> à la place ;
it: Alcuni driver video obsoleti di Xorg non sono più disponibili in &releasename;. Questi driver includono <systemitem role="package">xserver-xorg-video-cyrix</systemitem>, <systemitem role="package">xserver-xorg-video-i810</systemitem>, <systemitem role="package">xserver-xorg-video-imstt</systemitem>, <systemitem role="package">xserver-xorg-video-nsc</systemitem>, <systemitem role="package">xserver-xorg-video-sunbw2</systemitem> e <systemitem role="package">xserver-xorg-video-vga</systemitem>. Questi potrebbero essere rimossi durante l'aggiornamento, gli utenti possono installare <systemitem role="package">xserver-xorg-video-all</systemitem> al loro posto.
ja: &releasename; では、いくつかの Xorg のビデオドライバが時代遅れ (obsolete) なため利用できなくなりました。これには以下が含まれます: <systemitem role="package">xserver-xorg-video-cyrix</systemitem>、<systemitem role="package">xserver-xorg-video-i810</systemitem>、 <systemitem role="package">xserver-xorg-video-imstt</systemitem>、<systemitem role="package">xserver-xorg-video-nsc</systemitem>、<systemitem role="package">xserver-xorg-video-sunbw2</systemitem>、<systemitem role="package">xserver-xorg-video-vga</systemitem>。これらはアップグレード中に削除されるでしょう。ユーザは、代わりに <systemitem role="package">xserver-xorg-video-all</systemitem> をインストールするべきです。
pt: Algumas das driver de vídeo do Xorg não estão mais disponíveis em &releasename; e são obsoletas. Isto inclui <systemitem role="package">xserver-xorg-video-cyrix</systemitem>, <systemitem role="package">xserver-xorg-video-i810</systemitem>, <systemitem role="package">xserver-xorg-video-imstt</systemitem>, <systemitem role="package">xserver-xorg-video-nsc</systemitem>, <systemitem role="package">xserver-xorg-video-sunbw2</systemitem> e <systemitem role="package">xserver-xorg-video-vga</systemitem>. Elas pode ser removidas através da actualização. Os utilizadores devem instalar <systemitem role="package">xserver-xorg-video-all</systemitem> em substituição.
ro: Unele din driverele video Xorg nu mai sunt disponibile în &releasename; și sunt învechite. Acestea includ <systemitem role="package">xserver-xorg-video-cyrix</systemitem>, <systemitem role="package">xserver-xorg-video-i810</systemitem>, <systemitem role="package">xserver-xorg-video-imstt</systemitem>, <systemitem role="package">xserver-xorg-video-nsc</systemitem>, <systemitem role="package">xserver-xorg-video-sunbw2</systemitem>, și <systemitem role="package">xserver-xorg-video-vga</systemitem>. Este posibil să fie șterse ca parte a procesului de actualizare. Utilizatorii ar trebui să instaleze în schimb <systemitem role="package">xserver-xorg-video-all</systemitem>.
sv: Några av Xorgs videodrivrutiner finns inte längre i &releasename; och är föråldrade. Detta innefattar <systemitem role="package">xserver-xorg-video-cyrix</systemitem>, <systemitem role="package">xserver-xorg-video-i810</systemitem>, <systemitem role="package">xserver-xorg-video-imstt</systemitem>, <systemitem role="package">xserver-xorg-video-nsc</systemitem>, <systemitem role="package">xserver-xorg-video-sunbw2</systemitem> och <systemitem role="package">xserver-xorg-video-vga</systemitem>. De kan komma att tas bort under uppgraderingen. Användare bör installera <systemitem role="package">xserver-xorg-video-all</systemitem> istället.

source: The utility used in &oldreleasename; to display a splash image at boot time, <systemitem role="package">usplash</systemitem>, is no longer available. It has been replaced by <systemitem role="package">plymouth</systemitem>.
fr: l'outil <systemitem role="package">usplash</systemitem> utilisé dans &Oldreleasename; pour afficher une image lors du démarrage de l'ordinateur n'est plus disponible. Il a été remplacé par <systemitem role="package">plymouth</systemitem>.
it: Il programma <systemitem role="package">usplash</systemitem> che in &oldreleasename; mostrava un'immagine durante l'avvio non è più disponibile. È stato sostituito con <systemitem role="package">plymouth</systemitem>.
ja: &oldreleasename; で起動時にスプラッシュ画面を表示するのに使われていたユーティリティ <systemitem role="package">usplash</systemitem> は利用できなくなっています。<systemitem role="package">plymouth</systemitem> に置き換えられています。
pt: O utilitário usado em &oldreleasename; para mostrar a imagem splash durante o arranque, <systemitem role="package">usplash</systemitem>, não está mais disponível. Foi substituído pelo <systemitem role="package">plymouth</systemitem>.
ro: Utilitarul folosit în &oldreleasename; pentru a afișa imaginea (splash) la inițializare, <systemitem role="package">usplash</systemitem>, nu mai este disponibil. A fost înlocuit de <systemitem role="package">plymouth</systemitem>.
sv: Hjälpprogrammet i &oldrelease; för att visa en bild vid uppstarten, <systemitem role="package">usplash</systemitem>, är inte längre tillgängligt. Det har ersatts av <systemitem role="package">plymouth</systemitem>.

source: Dummy packages
fr: Paquets factices
it: Pacchetti fittizi
ja: ダミーパッケージ
ml: വ്യാജ പൊതികള്‍
pt: Pacotes fictícios
ro: Pachetele marionetă
sv: Dummy-paket
zh_tw: 替代 (Dummy) 套件

source: Some packages from &oldreleasename; have been split into several packages in &releasename;, often to improve system maintainability. To ease the upgrade path in such cases, &releasename; often provides <quote>dummy</quote> packages: empty packages that have the same name as the old package in &oldreleasename; with dependencies that cause the new packages to be installed. These <quote>dummy</quote> packages are considered obsolete packages after the upgrade and can be safely removed.
fr: Certains paquets de la version &Oldreleasename; ont été divisés en plusieurs paquets dans &Releasename;, souvent pour améliorer la maintenabilité du système. Pour faciliter la mise à niveau dans de tels cas, &Releasename; fournit souvent des paquets <quote>factices</quote> (<quote>dummy packages</quote> en anglais) : des paquets vides qui ont le même nom que l'ancien paquet de la version &Oldreleasename; et dont les dépendances entraînent l'installation des nouveaux paquets. Ces paquets factices sont considérés comme des paquets obsolètes après la mise à niveau et peuvent être supprimés sans problème.
it: Taluni pacchetti per &oldreleasename; sono stati suddivisi in diversi pacchetti in &releasename;, spesso al fine di migliorare la manutenzione del sistema. Per facilitare il percorso di aggiornamento in tali casi, &releasename; spesso fornisce pacchetti <quote>fittizi</quote>, che sono pacchetti vuoti che hanno lo stesso nome del vecchio pacchetto in &oldreleasename; con dipendenze che causano l'installazione dei nuovi pacchetti. Questi pacchetti <quote>fittizi</quote> sono considerati obsoleti dopo l'aggiornamento e possono essere rimossi in tutta sicurezza.
ja: &oldreleasename; の一部のパッケージは &releasename; では複数のパッケージに分割されていますが、これは大半がシステムの保守性を改善するためです。このような場合のアップグレード手順を容易にするために、&releasename; はしばしば <quote>ダミーの</quote> パッケージ―― &oldreleasename; での古いパッケージと同じ名前で、新規パッケージが自動的にインストールされるような依存関係を備えた空のパッケージ――を提供しています。これらの <quote>ダミー</quote> パッケージはアップグレード後は Obsolete 扱いとされ、安全に削除することができます。
ml: വ്യവസ്ഥിയുടെ പരിപാലനധര്‍മ്മം മെച്ചപ്പെടുത്തുന്നതിന് &oldreleasename;ലെ ചില പൊതികള്‍ പിളര്ന്ന് &releasename;ല്‍ പ്രയോഗിച്ചിരിക്കും. അത്തരം സന്ദര്‍ഭങ്ങളില്‍ &releasename;ലേക്കുള്ള നവീകരണമാര്ഗ്ഗം എളുപ്പമാക്കാന്‍ പുതിയ പൊതികള്‍ പ്രതിഷ്ഠിക്കനാവശ്യ‌‌മായ ആശ്രിതത്വത്തോടുകൂടിയ <quote>dummy</quote> പൊതികള്‍ ചേര്‍ക്കാറുണ്ട്: &oldreleasename;ലെ പഴയ പൊതികളുടെ അതേ പേരുള്ള ഒഴിഞ്ഞ പൊതികള്‍: നവീകരണത്തിന് ശേഷം ഇത്തരം പൊതികള്‍ കാലഹരണപ്പെട്ടതായി കണക്കാക്കി സുരക്ഷിതമായി നീക്കം ചെയ്യാവുന്നതാണ്.
pt: Alguns pacotes da &oldreleasename; foram separados em vários pacotes na &releasename;, principalmente para melhorar a manutenção do sistema. Para facilitar a actualização em alguns casos, a &releasename; fornece pacotes <quote>fictícios</quote>: pacotes vazios que têm o mesmo nome que o pacote antigo na &oldreleasename; com dependências que provocam a instalação dos novos pacotes. Estes pacotes <quote>fictícios</quote> são considerados pacotes obsoletos depois da actualização e podem ser removidos em segurança.
ro: Anumite pachete din &oldreleasename; au fost împărțite în mai multe pachete în &releasename;, deseori pentru a îmbunătăți mentenabilitatea sistemului. Pentru a ușura actualizarea în aceste cazuri, &releasename; oferă pachete <quote>marionetă</quote>: pachete goale care au același nume ca versiunea din &oldreleasename; cu dependențe ce cauzează instalarea pachetelor noi. Aceste pachete <quote>marionetă</quote> sunt considerate depășite și, după actualizare, pot fi dezinstalate fără probleme.
sv: Vissa paket från &oldreleasename; har delats upp i flera paket i &releasename;, ofta för att förbättra systemunderhållet. För att göra uppgraderingssättet enklare i sådana fall, tillhandahåller &releasename; ofta så kallade <quote>dummy</quote>-paket: tomma paket som har samma namn som det gamla paketet i &oldreleasename; med beroenden som gör att de nya paketen blir installerade. Dessa <quote>dummy</quote>-paket anses som föråldrade paket efter uppgraderingen och kan med säkerhet tas bort.

source: Most (but not all) dummy packages' descriptions indicate their purpose. Package descriptions for dummy packages are not uniform, however, so you might also find <command>deborphan</command> with the <literal>--guess-<replaceable>*</replaceable></literal> options (e.g. <literal>--guess-dummy</literal>) useful to detect them in your system. Note that some dummy packages are not intended to be removed after an upgrade but are, instead, used to keep track of the current available version of a program over time.
fr: La plupart des descriptions des paquets factices signalent le but de ces paquets. Cependant, elles ne sont pas uniformes, et le programme <command>deborphan</command>, avec les options de type <literal>--guess-<replaceable>*</replaceable></literal>, peut être utile pour détecter ces paquets sur le système. Notez que certains paquets factices ne sont pas destinés à être supprimés après une mise à niveau, mais ils sont utilisés pour déterminer quelle est la version actuellement disponible d'un programme.
it: La descrizione della maggior parte dei pacchetti fittizi, ma non di tutti, indica il loro scopo. Purtroppo le descrizioni dei pacchetti fittizi non sono uniformi, per cui si potrebbe anche trovare utile lo strumento <command>deborphan</command> con le opzioni <literal>--guess-<replaceable>*</replaceable></literal> (per esempio <literal>--guess-dummy</literal>) per trovarli nel proprio sistema. Si noti che alcuni pacchetti fittizi non sono creati per essere rimossi dopo un aggiornamento ma, invece, servono per tener traccia nel tempo della versione attualmente disponibile di un programma.
ja: (すべてではないのですが) 大半のダミーパッケージの説明には、その目的が記されています。しかしダミーパッケージの説明文は統一されていないので、自分のシステム内のダミーパッケージを検出するには、<command>deborphan</command> を <literal>--guess<replaceable>*</replaceable></literal> オプションつきで使うのが便利でしょう (例: <literal>--guess-dummy</literal>)。一部のダミーパッケージは、アップグレード後に削除されることを意図したものではなく、プログラムのどのバージョンが現在利用可能な最新版かを長期にわたって追跡するのに使われる、ということに注意してください。
pt: A maior parte (mas nem todas) das descrições dos pacotes fictícios indicam o seu objectivo. As descrições dos pacotes para os pacotes fictícios não são uniformes, no entanto você pode achar o <command>deborphan</command> com a opção <literal>--guess-<replaceable>*</replaceable></literal> (ex. <literal>--guess-dummy</literal>) útil para detectá-los no seu sistema. Note que alguns pacotes fictícios não se destinam a serem removidos depois de uma actualização, e em vez disso, são utilizadas para seguir as actuais versões disponíveis de um programa ao longo do tempo.
ro: Cele mai multe (însă nu toate) descrieri ale pachetelor marionetă indică scopul lor. Descrierile pachetelor marionetă nu sunt uniforme, totuși puteți folosi <command>deborphan</command> cu opțiunile <literal>--guess-<replaceable>*</replaceable></literal> (de ex. <literal>--guess-dummy</literal>) pentru a le detecta în sistemul dumneavoastră. Notați faptul că anumite pachete marionetă nu sunt destinate dezinstalării după actualizare, ci sunt utilizate pentru a urmări în timp versiunea curentă a unui program.
sv: De flesta (men inte alla) dummy-paket har beskrivningar som indikerar deras syfte. Paketbeskrivningar för dummy-paket är inte enhetliga, dock kan <command>deborphan</command> med flaggan <literal>--guess-<replaceable>*</replaceable></literal> (ex. <literal>--guess-dummy</literal>) vara användbara för att identifiera dem på ditt system. Observera att vissa dummy-paket inte är tänkta att tas bort efter en uppgradering utan används istället för att hålla kontroll på den för närvarande tillgängliga versionen av ett program över tid.

source: # dpkg --get-selections "*" &gt; ~/curr-pkgs.txt
fr: # dpkg --get-selections "*" &gt; ~/paquets-actuels.txt
ro: # dpkg --get-selections "*" &gt; ~/pachete-curente.txt

source: # script -t 2&gt;~/upgrade-&releasename;<replaceable>step</replaceable>.time -a ~/upgrade-&releasename;<replaceable>step</replaceable>.script
ro: # script -t 2&gt;~/upgrade-&releasename;<replaceable>etapă</replaceable>.time -a ~/upgrade-&releasename;<replaceable>etapă</replaceable>.script

source: TODO: (jfs) Could mention the script I provided in #400725 which is useful if you have not dumped the timing file
fr: A FAIRE: (jfs) On pourrait mentionner le script ...
ja: TODO: (jfs) #400725 で私が提供したスクリプトについて言及したほうがいいかな? あのスクリプトは、タイミングファイルをダンプしなかった場合に便利だよ。
ro: TODO: (jfs) Ar putea să menționeze scriptul pe care l-am oferit în #400725 care este util dacă nu ați renunțat la fișierul de cronometrare

source: # scriptreplay ~/upgrade-&releasename;.time ~/upgrade-&releasename;.script
ro: # scriptreplay ~/actualizare-&releasename;.time ~/actualizare-&releasename;.script

source: The move of some firmware to separate packages in the non-free archive (see <xref linkend="nonfree-firmware"/>) means that it may be necessary to install additional firmware packages after upgrading to the new kernel. Look out for warning messages from the kernel install or initramfs generation scripts, and make sure the necessary firmware packages are installed.
it: Lo spostamento di parte dei pacchetti con il firmware nell'archivio non-free (si veda <xref linkend="nonfree-firmware"/>) potrebbe causare la necessità d'installare altri pacchetti con il firmware dopo l'aggiornamento del kernel. Controllare se durante l'installazione del kernel o durante l'uso degli script di generazione dell'initramfs si presentano dei messaggi d'avviso e assicurarsi che i necessari pacchetti con il firmware siano installati.
ro: Mutarea unor microcoduri în pachete separate în arhiva non-free (vedeți <xref linkend="nonfree-firmware"/>) înseamnă că ar putea fi necesar să instalați pachete suplimentare cu microcod după actualizarea la noul nucleu. Urmăriți mesajele de avertizare a scripturilor de instalarea nucleului sau care generează un initramfs și asigurați-vă că pachetele cu microcod necesare sunt instalate.
