Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: This is applicable when Grub shows you the menu interface for selecting the entry you want to boot from. If such a menu does not appear, try pressing the <keycap>Esc</keycap> key before the kernel boots in order to make it appear. If you can't get into this menu, try <xref linkend="solution2"/> or <xref linkend="solution3"/>.
fr: Cette solution est applicable lorsque le menu de Grub qui permet la sélection de l'entrée sur laquelle démarrer est affiché. Si le menu ne s'affiche pas, essayez de le faire apparaître en appuyant sur la touche <keycap>Esc</keycap> avant que le noyau ne démarre. Si vous n'arrivez pas à accéder au menu, essayez <xref linkend="solution2"/> ou <xref linkend="solution3"/>.
it: Questa soluzione è praticabile quando Grub mostra l'interfaccia del menù per selezionare la voce dalla quale si desidera avviare il proprio sistema. Se non compare, provare a premere <keycap>Esc</keycap> prima dell'avvio del kernel per farlo apparire. Se non si riesce ancora, si provi <xref linkend="solution2"/> o <xref linkend="solution3"/>.
ja: この方法が適用可能なのは、起動したいエントリを選ぶためのメニューインタフェースを Grub が表示してくれる場合のみです。そのようなメニューが現れない場合は、カーネルが起動する前に <keycap>Esc</keycap> キーを押して、メニューを表示させてみてください。このメニューに入れない場合は、<xref linkend="solution2"/>や<xref linkend="solution3"/>を試してみてください。
ml: നിങ്ങള്‍ക്ക് ബൂട്ട് ചെയ്യാനുള്ള ചേര്‍പ്പ് തെരഞ്ഞെടുക്കാന്‍ വിഭവങ്ങളുടെ വിനിമയ തലം ഗ്രബ് കാണിച്ചുതരുന്നു എങ്കില്‍ ഇത് പ്രാവര്‍ത്തികമാക്കാം. അങ്ങനെ ഒരു വിഭവപട്ടിക പ്രത്യ‌‌ക്ഷമാകുന്നില്ലെങ്കില്‍, കേര്‍ണല്‍ ബൂട്ട് ചെയ്യുന്നതിന് മുമ്പ് <keycap>Esc</keycap>കീ അമര്‍ത്തുന്നത് അത് പ്രത്യ‌‌ക്ഷമാകാന്‍ സഹായിക്കും. ആ വിഭവങ്ങളിലേക്ക് ഇറങ്ങിചെല്ലാന്‍ നിങ്ങള്‍ക്കാവുന്നില്ലെങ്കില്‍, <xref linkend="solution2"/> ഓ <xref linkend="solution3"/>ഓ പരീക്ഷിക്കാവുന്നതാണ്.
pt: Isto é aplicável quando o Grub mostra-lhe a interface menu para seleccionar a entrada por onde que arrancar. Se tal menu não aparecer, tente pressionar a tecla <keycap>Esc</keycap> antes que o kernel arranque de modo a fazê-lo aparecer. Se não consegue chegar a este menu, tente <xref linkend="solution2"/> ou <xref linkend="solution3"/>.
ro: Această metodă este potrivită dacă Grub vă afișează meniul pentru alegerea opțiunilor de pornire. Dacă meniul nu apare, încercați să apăsați tasta <keycap>Esc</keycap> înainte ca nucleul să pornească ca să puteți vedea meniul. Dacă nu puteți accesa meniul, încercați <xref linkend="solution2"/> sau <xref linkend="solution3"/>.
sv: Detta fungerar om Grub visar sin grafiska meny där du kan välja vilket alternativ som ska startas. Om denna meny inte visas försök trycka <keycap>Esc</keycap>-tangenten innan kärnan startar för att visa menyn. Om du inte kan visa menyn försök med <xref linkend="solution2"/> eller <xref linkend="solution3"/>.

source: In the Grub menu, highlight the entry you want to boot from. Press the <keycap>e</keycap> key to edit the options related to this entry. You will see something like:
fr: Dans le menu Grub, sélectionnez l'entrée sur laquelle vous voulez démarrer. Appuyez sur la touche <keycap>e</keycap> pour éditer l'entrée. Vous verrez alors quelque chose comme ceci :
it: Nel menù di Grub, evidenziare la voce dalla quale si desidera avviare il sistema e premere <keycap>e</keycap> per modificare le opzioni relative a questa voce. Apparirà qualcosa di simile a:
ja: Grub のメニューにおいて、起動したいエントリをハイライトします。その上で <keycap>e</keycap> キーを押し、このエントリに関するオプションを編集します。オプションはおそらく次のようになっているでしょう:
ml: ഗ്രബ് മെനുവില്‍ നിന്നും നിങ്ങള്‍ക്കു ബൂട്ട ചെയ്യേണ്ട വരി തെരഞ്ഞെടുക്കുക. ഈ വരിയുടെ ഐച്ഛികങ്ങള്‍ മാറ്റുന്നതിനായി കീബോര്‍ഡില്‍ നിന്നും <keycap>e</keycap> അമര്‍ത്തുക. ഇതു പോലെ ഒരെണ്ണം കാണാന്‍ കഴിയും:
pt: No menu do Grub, seleccione a entrada pela qual quer arrancar. Pressione a tecla <keycap>e</keycap> para editar as opções relativas a esta entrada. Irá ver algo como:
ro: În meniul din Grub alegeți opțiunea cu care doriți să porniți sistemul. Apăsați tasta <keycap>e</keycap> pentru a edita opțiunile alegerii curente. Va fi afișat un mesaj similar cu acesta:
sv: I Grub-menyn, markera alternativet du vill använda för att starta systemet. tryck <keycap>e</keycap>-tangenten för att redigera alternativet. Du kommer nu se något liknande detta:

source: Highlight the line
fr: Sélectionnez la ligne
it: Evidenziare la riga
ja: 次の行をハイライトします:
ml: ഈ വരി തെരഞ്ഞെടുക്കുക
pt: Seleccione a linha
ro: Selectați linia
sv: Markera raden
zh_tw: 選擇該項目

source: press the <keycap>e</keycap> key and replace <literal>hd<replaceable>X</replaceable></literal> with <literal>sd<replaceable>X</replaceable></literal> (<varname>X</varname> being the letter <literal>a</literal>, <literal>b</literal>, <literal>c</literal> or <literal>d</literal> depending of your system). In my example the line becomes:
fr: appuyez sur la touche <keycap>e</keycap> et remplacez <literal>hd<replaceable>X</replaceable></literal> par <literal>sd<replaceable>X</replaceable></literal> (<varname>X</varname> étant la lettre <literal>a</literal>, <literal>b</literal>, <literal>c</literal> ou <literal>d</literal> selon le système). Dans cet exemple la ligne devient :
it: premere <keycap>e</keycap> e sostituire <literal>hd<replaceable>X</replaceable></literal> con <literal>sd<replaceable>X</replaceable></literal> (dove <varname>X</varname> corrisponde alla lettera <literal>a</literal>, <literal>b</literal>, <literal>c</literal> o <literal>d</literal>, a seconda del proprio sistema). Nel presente esempio, la riga diventa:
ja: <keycap>e</keycap> キーを押して、<literal>hd<replaceable>X</replaceable></literal> を <literal>sd<replaceable>X</replaceable></literal> に置換します (<varname>X</varname> は、システムによって異なりますが、<literal>a</literal>、<literal>b</literal>、<literal>c</literal>、<literal>d</literal> のいずれかです)。上の例では、置換後の行はこうなります:
ml: <keycap>e</keycap>കീ അമര്‍ത്തുകയും <literal>hd<replaceable>X</replaceable></literal>നു പകരം (നിങ്ങളുടെ വ്യ‌‌വസ്ഥക്കനുസരിച്ച്) <literal>a</literal>, <literal>b</literal>, <literal>c</literal> or <literal>d</literal> അക്ഷരങ്ങളാകയാല്‍ <literal>a</literal>, <literal>b</literal>, <literal>c</literal> or <literal>d</literal>മാറ്റിവെയ്ക്കുക. എന്റെ ഉദാഹരണത്തില്‍ ആ വരി ഇങ്ങനെ വരും:
pt: pressione a tecla <keycap>e</keycap> e substitua <literal>hd<replaceable>X</replaceable></literal> por <literal>sd<replaceable>X</replaceable></literal> (<varname>X</varname> sendo a letra <literal>a</literal>, <literal>b</literal>, <literal>c</literal> or <literal>d</literal> dependente do seu sistema). No meu exemplo a linha fica:
ro: apăsați tasta <keycap>e</keycap> și înlocuiți <literal>hd<replaceable>X</replaceable></literal> cu <literal>sd<replaceable>X</replaceable></literal> (unde <varname>X</varname> este litera <literal>a</literal>, <literal>b</literal>, <literal>c</literal> sau <literal>d</literal> dependent de sistemul dumneavoastră). În exemplul dat rândul devine:
sv: tryck <keycap>e</keycap>-tangenten och ersätt <literal>hd<replaceable>X</replaceable></literal> med <literal>sd<replaceable>X</replaceable></literal> (där <varname>X</varname> är bokstäverna <literal>a</literal>, <literal>b</literal>, <literal>c</literal> eller <literal>d</literal> beroende på ditt system). I vårt exempel blir raden:

source: Then press <keycap>Enter</keycap> to save the modification. If other lines show <literal>hd<replaceable>X</replaceable></literal>, change these line too. Don't modify the entry similar to <literal>root (hd0,0)</literal>. Once all modifications are done, press the <keycap>b</keycap> key. And your system should now boot as usual.
fr: Puis appuyez sur <keycap>Enter</keycap> pour sauver la modification. Si d'autres lignes comportent <literal>hd<replaceable>X</replaceable></literal>, changez-les également. Ne modifiez pas les entrées similaires à <literal>root (hd0,0)</literal>. Une fois effectuées toutes ces modifications, appuyez sur la touche <keycap>b</keycap>. Le système devrait pouvoir démarrer normalement.
it: Poi si prema <keycap>Enter</keycap> per salvare la modifica. Se le altre righe mostrano <literal>hd<replaceable>X</replaceable></literal>, si modifichino anche queste righe. Non si modifichino voci simili a <literal>root (hd0,0)</literal>. Dopo che tutte le modifiche sono state effettuate, si prema <keycap>b</keycap> e il proprio sistema dovrebbe riprendere ad avviarsi come al solito.
ja: その上で、<keycap>Enter</keycap> を押して変更を保存します。もし他の行にも <literal>hd<replaceable>X</replaceable></literal> がある場合は、それらの行も同様に変更します。<literal>root (hd0,0)</literal> のようなエントリは変更しないでください。すべての変更が終わったら <keycap>b</keycap> キーを押してください。システムが通常どおり起動するはずです。
ml: കീബോര്‍ഡില്‍ <keycap>Enter</keycap> അമര്‍ത്തി വരുത്തിയ മാറ്റങ്ങള്‍ സംരക്ഷിക്കുക. മറ്റുള്ള വരികളില്‍ ഇങ്ങനെ <literal>hd<replaceable>X</replaceable></literal> കാണുന്നുവെങ്കില്‍,അതും മാറ്റുക. <literal>root (hd0,0)</literal> എന്ന വരി മാറ്റരുതു്. എല്ലാ മാറ്റങ്ങളും ചെയ്തു കഴിഞ്ഞാല്‍ <keycap>b</keycap> അമര്‍ത്തുക. താങ്കളുടെ സിസ്റ്റം സാധാരണപോലെ ബൂട്ട് ചെയ്യേണ്ടതാണു്.
pt: Depois pressione <keycap>Enter</keycap> para salvar a informação. Se outras linhas mostrarem <literal>hd<replaceable>X</replaceable></literal>, mude essa linha também. Não modifique a entrada semelhante a <literal>root (hd0,0)</literal>. Uma vez todas as modificações feitas, pressione a tecla <keycap>b</keycap>. E o seu sistema deverá agora arrancar como usualmente.
ro: Apoi apăsați <keycap>Enter</keycap> pentru a salva modificările. Dacă alte rânduri conțin <literal>hd<replaceable>X</replaceable></literal>, modificați acele rânduri deasemenea. Nu modificați rândurile similare cu <literal>root (hd0,0)</literal>. Odată ce ați terminat toate modificările, apăsați tasta <keycap>b</keycap>. Sistemul dumneavoastră ar trebui să porneasă ca de obicei.
sv: Tryck sedan <keycap>vagnretur</keycap> för att spara ändringen. Om andra rader visar <literal>hd<replaceable>X</replaceable></literal> uppdatera dessa också. Ändra inte delen som ser ut ungefär så här <literal>root (hd0,0)</literal>. När alla ändringar är klara tryck <keycap>b</keycap>-tangenten så bör systemet starta som vanligt.

source: Now that your system has booted, you need to fix this issue permanently. Jump to <xref linkend="avoid-problems-before-upgrading"/> and apply one of the two proposed procedures.
fr: Maintenant que le système a démarré, le problème doit être corrigé de manière permanente. Référez-vous à <xref linkend="avoid-problems-before-upgrading"/> et appliquez une des deux procédures proposées.
it: Ora che il proprio sistema si è avviato, sarà necessario risolvere questi problemi in modo definitivo. Si veda in <xref linkend="avoid-problems-before-upgrading"/> e si applichi una delle due procedure proposte.
ja: システムが起動したら、この問題を恒久的に解決する必要があります。<xref linkend="avoid-problems-before-upgrading"/>に飛んで、提示されている 2 つの手順のうちいずれかを実行してください。
ml: താങ്കളുടെ സിസ്റ്റം വിജയകരമായി ബൂട്ട് ചെയ്ത സ്ഥിതിക്ക് , ഈ പ്രശ്നം സ്ഥിരമായി പരിഹരിക്കേണ്ടതാണു. <xref linkend="avoid-problems-before-upgrading"/> എന്ന കണ്ണിയിലേക്കു പോയി, പറഞ്ഞിട്ടുള്ള രണ്ടു വഴികളില്‍ ഒരെണ്ണം അവലംബിക്കുക
pt: Agora que o seu sistema arrancou, você precisa de corrigir este problema de de modo permanente. Salte para <xref linkend="avoid-problems-before-upgrading"/> e aplique um dos dois procedimentos propostos.
ro: Acum, când sistemul este pornit, este necesar să rezolvați complet această problemă. Accesați <xref linkend="avoid-problems-before-upgrading"/> și aplicați una din cele două proceduri propuse.
sv: När ditt system har startat upp behöver detta problemet lösas permanent. Hoppa till <xref linkend="avoid-problems-before-upgrading"/> och använd en av metoderna.
zh_tw: 等到您的系統開完機，您必須手動修復這個問題。請參閱 <xref linkend="avoid-problems-before-upgrading"/> 並從 2 個解決方案之中選擇其中 1 個進行。

source: Solution 2
it: Soluzione 2
ja: 解決方法 2
ml: പരിഹാരം 2
pt: Solução 2
ro: Soluția 2
sv: Lösning 2
zh_tw: 方案 2

source: Boot from &debian; installation media (<acronym>CD</acronym>/<acronym>DVD</acronym>) and when prompted, pick <literal>rescue</literal> to launch rescue mode. Select your language, location, and keyboard mapping; then let it configure the network (no matter whether it succeeds or not). After a while, you should be asked to select the partition you want to use as root file system. The proposed choices will look something like:
fr: Démarrez depuis un support d'installation de &debian; (<acronym>CD</acronym>/<acronym>DVD</acronym>) puis lorsqu'une invite apparaît, choisissez <literal>rescue</literal> afin de lancer le mode de secours. Sélectionnez la langue, l'emplacement géographique, l'agencement du clavier, et laissez faire la configuration du réseau, qu'elle réussisse ou pas. Au bout d'un moment, il vous sera demandé la partition que vous voulez utiliser comme système de fichiers racine. Les choix proposés ressemblent à :
it: Si avvii il proprio sistema da un supporto d'installazione Debian (<acronym>CD</acronym>/<acronym>DVD</acronym>) e al prompt selezionare <literal>rescue</literal> per avviare la modalità di ripristino. Selezionare la lingua, la località, la mappatura della tastiera, si lasci che configuri la rete (anche se tale configurazione fallisce non è un problema). Dopo un attimo comparirà la richiesta della partizione che si desidera usare come file system radice. Le scelte proposte saranno simili a quanto segue:
ja: &debian; のインストールメディア (<acronym>CD</acronym>/<acronym>DVD</acronym>) から起動し、プロンプトが出たら <literal>rescue</literal> を選択して、レスキューモードを立ち上げます。言語と国、キーボードマップを選択し、その上で (成功するにせよ失敗するにせよ) ネットワークの設定を行います。暫くすると、ルートファイルシステムとして使用したいパーティションを選ぶよう言われます。選択肢として提示されるのは、次のようなものでしょう:
ml: ഡെബിയന്‍ പ്രതിഷ്ഠാപന മാദ്ധ്യ‌‌മം (<acronym>CD</acronym>/<acronym>DVD</acronym>) ഉപയോഗിച്ച് ബൂട്ട് ചെയ്ത് തയ്യാറാകുമ്പോള്‍ വീണ്ടെടുക്കല്‍ ഭാവം (Rescue mode) കയറ്റാന്‍ <literal>rescue</literal> സ്വീകരിക്കുക. നിങ്ങളുടെ ഭാഷ, സ്ഥാനം, കീബോര്ഡ് തരം എന്നിവ തെരഞ്ഞെടുത്ത ശേഷം ശൃംഖലാകര്മ്മം ക്രമീകരിക്കാന്‍ വിടുക (അത് വിജയിച്ചാലും ഇല്ലെങ്കിലും സാരമില്ല). അല്‍പ്പ സമയത്തിനുശേഷം നിങ്ങള്‍ക്ക് അടിസ്ഥാന ഫയല്‍വ്യ‌‌വസ്ഥയായി ഉപയോഗിക്കാനുള്ള വിഭാജനം ഏതെന്ന അന്വേഷണം ഉണ്ടാവും. അതിന്റെ നിര്‍ദ്ദിഷ്ട രൂപം ഏതാണ്ട് ഇങ്ങനെയിരിക്കും:
pt: Arranque com a média de instalação &debian; (<acronym>CD</acronym>/<acronym>DVD</acronym>) e quando questionado, escolha <literal>rescue</literal> para lançar o modo de recuperação. Seleccione a sua linguagem, localização, e mapeamento do teclado, depois deixe-o configurar a rede (não importando se o faz com sucesso ou não). Após uns momentos, deverá ser-lhe pedido a seleccionar uma partição que deseja usar como sistema de ficheiros raiz. As opções propostas irão parecer algo como:
ro: Porniți sistemul de pe un mediu de instalare &debian; (<acronym>CD</acronym>/<acronym>DVD</acronym>) și la cerere, tastați <literal>rescue</literal> pentru a porni în modul de recuperare. Alegeți limba, locația, aranjamentul tastaturii; lăsați să se configureze rețeaua (indiferent dacă reușește sau nu). În scurt timp va trebui să fiți întrebați pentru alegerea partiției pe care o doriți să folosiți ca sistem de fișierer rădăcină. Alegerile propuse vor arăta similar cu:
sv: Starta systemet på ett &debian;-installationsmedia (<acronym>cd</acronym>/<acronym>dvd</acronym>), ange <literal>rescue</literal> vid inmatningsstället för att starta återhämtningsläget. Välj språk, plats, tangentbordsupplägg och låt systemet försöka ställa in nätverket (det spelar ingen roll om det lyckas eller ej). Strax ska du ange vilken partition som ska användas som rotfilsystem. Alternativen bör se ut ungefär så här:

source: If you know which partition is your root file system, choose the appropriate one. If you don't, just try with the first. If it complains about an invalid root file system partition, try the next one, and so on. Trying one after the other shouldn't harm your partitions and if you have only one operating system installed on your disks, you should easily find the right root file system partition. If you have many operating systems installed on your disks, it would be better to know exactly which is the right partition.
fr: Si vous savez quelle partition contient le système de fichiers racine, choisissez-la. Si vous ne le savez pas, essayez la première. Si un message apparaît au sujet d'une partition de système de fichiers racine invalide, essayez la partition suivante, et ainsi de suite. Essayer les partitions les unes à la suite des autres ne devrait pas les affecter. D'autre part, si un seul système est installé sur les disques, vous devriez facilement retrouver la bonne partition racine. Si plusieurs systèmes sont installés, cela serait plus simple de connaître exactement quelle est la bonne partition.
it: Se si sa quale partizione corrisponde al proprio file system radice, la si scelga. In caso contrario, provare con la prima. Se compare un messaggio d'errore per partizione di file system radice non valida, provare la seguente e così via. Provare una dopo l'altra non dovrebbe causare problemi alle partizioni e se si ha un solo sistema sui propri dischi dovrebbe essere abbastanza facile trovare la partizione giusta. Se si hanno molti sistemi, sarebbe più opportuno sapere esattamente quale partizione è quella giusta.
ja: どのパーティションにルートファイルシステムが含まれているのか分かっている場合は、適切なものを選んでください。分からない場合は、とりあえず最初の選択肢を選んでみてください。ルートファイルシステムのパーティションとして不適切だというエラーメッセージが出た場合は次の選択肢を試し、それでもエラーメッセージが出た場合はさらに次の選択肢を試し……、というようにして探してください。順々にパーティションを試していっても、それらのパーティションが壊れることはないはずです。ディスクに 1 つのオペレーティングシステムだけがインストールされている場合は、適切なルートファイルシステムパーティションが容易に見つかるはずです。ディスクに複数のオペレーティングシステムがインストールされている場合は、どのパーティションが適切なパーティションか、予めきちんと知っておいたほうがよいでしょう。
ml: നിങ്ങളുടെ അടിസ്ഥാന ഫയല്‍ വ്യ‌‌വസ്ഥ ഏതു വിഭാജനത്തിലാണെന്ന് അറിയാമെങ്കില്‍ യോജിച്ചത് തെരഞ്ഞെടുക്കുക. അറിയില്ലെങ്കില്‍, ആദ്യ‌‌ത്തേത് പരിശോധിക്കുക. അസാധുവായ അടിസ്ഥാന ഫയല്‍ വ്യ‌‌വസ്ഥയാണെന്ന് ആക്ഷേപമുണ്ടായാല്‍, അടുത്തത് പരിശോധിക്കാം.അങ്ങനെ തുടരാം. ഒന്നിന് ശേഷം വേറൊന്ന് എന്ന പരിശോധനാരീതി നിങ്ങളുടെ വിഭാജനങ്ങളെ ബാധിക്കരുത്. നിങ്ങളുടെ ഡിസ്കില്‍ ഒരു പ്രവര്ത്തകവ്യ‌‌വസ്ഥ മാത്രമേ സ്ഥാപിച്ചിട്ടുള്ളൂ എങ്കില്‍ ശരിയായ അടിസ്ഥാന ഫയല്‍ വ്യ‌‌വസ്ഥാ വിഭാജനം കണ്ടെത്തുന്നത് എളുപ്പമാണ്. ഡിസ്കില്‍ കൂടുതല്‍ പ്രവര്ത്തക വ്യ‌‌വസ്ഥകള്‍ പ്രതിഷ്ഠിച്ചിട്ടുണ്ടെങ്കില്‍ അടിസ്ഥാന ഫയല്‍ വ്യ‌‌വസ്ഥാ വിഭാജനം ഏതെന്ന് കൃത്യ‌‌മായി അറിഞ്ഞിരിക്കുന്നതാണ് നന്നാവുക. താങ്കളുടെ റൂട്ട് ഫയല്‍ സിസ്റ്റം പാര്‍ട്ടീഷന്‍ ഏതെന്നു അറിയാമെങ്കില്‍ അനുയോജ്യമായതു തെരഞ്ഞെടുക്കുക. അല്ലെങ്കില്‍
pt: Se souber qual partição é o seu sistema de ficheiros raiz, escolha o correcto. Se não sabe, tente o primeiro. Se ele se queixar acerca de umapartição com sistema de ficheiros raiz inválida, tente o próximo, e seguintes. Tentar uma após a outra não deverá danificar as suas partições e se tiver apenas um sistema operativo instalado nos seus discos, deverá facilmente encontrar a partição com sistema de ficheiros raiz correcta. Se você vários sistemas operativos instalados nos seus discos, será melhor saber exactamente qual é a partição certa.
ro: Dacă știți care partiție conține sistemul de fișiere rădăcină, atunci faceți alegerea corespunzătoare. În caz că nu știți, alegeți prima partiție. Dacă apare un mesaj despre un sistem de fișiere rădăcină nevalid, atunci încercați cu următoare partiție, șamd. Încercând pe rând partițiile, n-ar trebui să le deterioreze și, dacă aveți doar un singur sistem de operare pe discurile dumneavoastră, ar trebui să găsiți ușor partiția cu sistemul de fișiere rădăcină. În caz că aveți mai multe sisteme de operare instalate pe discuri, este recomandat să știți exact care este partiția potrivită.
sv: Om du vet vilken partition som är ditt rotfilsystem väljer du detta. Om du inte vet välj den första, systemet kommer tala om att det är ett ickefungerande rotfilsystem om partitionen inte kan användas, fortsätt att prova med nästa och så vidare. Att prova sig fram så här ska inte vara någon fara, har du bara ett rotfilsystem installerat bör det vara ganska enkelt att hitta det. Har du flera system installerade på dina diskar är det bättre att veta exakt vilken partition som är rätt.

source: Once you have chosen a partition, you will be offered a range of options. Pick the option of executing a shell in the selected partition. If it complains that it cannot do that then try with another partition.
fr: Une fois la partition choisie, plusieurs actions vous seront proposées. Choisissez d'exécuter un shell dans la partition sélectionnée. Si cela ne fonctionne pas, essayez avec une autre partition.
it: Una volta scelta la partizione saranno proposte varie opzioni. Si scelga di eseguire una shell nella partizione selezionata; se compare un messaggio d'errore che dice che non è possibile, si provi con un'altra partizione.
ja: パーティションを選択したら、様々な選択肢が提示されます。選択したパーティションでシェルを実行するという選択肢を選んでください。選んだときにエラーメッセージが出たら、他のパーティションで同じ操作をしてみてください。
ml: ഒരിക്കല്‍ ഒരു വിഭാജനം തെരഞ്ഞെടുത്തു കഴിഞ്ഞാല്‍, ഐച്ഛികങ്ങളുടെ ഒരു നിരതന്നെ വിട്ടുതരും. തെരഞ്ഞെടുത്ത വിഭാജനത്തില്‍ (Partition) ഒരു തൊണ്ട്(ഷെല്‍) നിര്‍വ്വഹണ ഐച്ഛികം തെരഞ്ഞെടുക്കുക. അത് നടപ്പിലാക്കാന്‍ പറ്റില്ലെന്ന് ആക്ഷേപം ഉന്നയിക്കുകയാണെങ്കില്‍ വേറൊരു വിഭാജനം സ്വീകരിക്കുക.
pt: Uma vez escolhida a partição, ser-lhe-ão propostas um leque de opções. Tome a opção de executar uma 'shell' na partição seleccionada. Se ele se queixar que não o consegue fazer então tente com outra partição.
ro: Odată ce partiția a fost aleasă, o serie de opțiuni vor fi puse la dispoziție. Alegeți opțiunea de a executa un shell pe partiția aleasă. Dacă apare vreun mesaj de eroare, încercați cu o altă partiție.
sv: När du väl har valt rätt partition får du välja mellan ett antal alternativ. Välj alternativet att starta ett skal på den valda partitionen. Kan detta inte utföras, prova med en annan partition.
