Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: The default configuration is set up for installation from main Debian Internet servers, but you may wish to modify <filename>/etc/apt/sources.list</filename> to use other mirrors, preferably a mirror that is network-wise closest to you.
fr: La configuration par défaut est faite pour une installation depuis les principaux serveurs de Debian sur Internet, mais vous pouvez modifier <filename>/etc/apt/sources.list</filename> pour utiliser d'autres miroirs, de préférence plus proches de vous au sens réseau du terme.
it: La configurazione predefinita prevede l'installazione dai principali server internet di Debian, ma si potrebbe voler modificare il proprio <filename>/etc/apt/sources.list</filename> in modo che usi i mirror, preferibilmente uno più vicino dal punto di vista della rete.
ja: デフォルトの設定では、メインの Debian インターネットサーバを使ってインストールするようになっています。ですが、<filename>/etc/apt/sources.list</filename> を編集して、他のミラー (できればネットワーク的に最も近いミラー) を使うようにするほうがよいでしょう。
ml: സഹജമായ ക്രമീകരണത്തില്‍ ഡെബിയന്റെ പ്രധാന ഇന്റര്‍നെറ്റ് സെര്‍വറുകളില്‍ നിന്നും ഇന്‍സ്റ്റോള്‍ ചെയ്യാനാണു് സജ്ജീകരിച്ചിരിയ്ക്കുന്നതു്, പക്ഷേ <filename>/etc/apt/sources.list</filename> തിരുത്തി ശൃംഖലയില്‍ നിങ്ങളുടെ അടുത്തുള്ളൊരു മിറര്‍ ഉപയോഗിയ്ക്കാന്‍ നിങ്ങള്‍ ആഗ്രഹിച്ചേയേക്കാം.
pt: A configuração predefinida é definida para instalação a partir de um servidor principal de Debian na Internet, mas poderá desejar modificar o <filename>/etc/apt/sources.list</filename> para utilizar outros 'mirrors', de preferência um 'mirror' localizado mais perto de si.
ro: Configurația implicită este pregătită pentru instalarea de pe serverele Debian din Internet, însă poate veți dori să modificați <filename>/etc/apt/sources.list</filename> pentru a utiliza servere alternative, preferabil dintr-un loc apropiat de dumneavoastră, din punct de vedere a rețelei în care vă aflați.
sv: Standardkonfigurationen är inställd för installation från Debians huvudservrar på Internet, men du kanske önskar ändra <filename>/etc/apt/sources.list</filename> till att använda andra speglar, företrädesvis en spegel som är nätverksmässigt närmare dig.
zh_tw: 雖然系統的預設設定是使用 Debian 在網際網路上的主要伺服器來進行安裝，但您還是可能會希望修改 <filename>/etc/apt/sources.list</filename> 來改為使用在網路上離您最近的其它鏡像站。

source: Debian HTTP or FTP mirror addresses can be found at <ulink url="&url-debian-mirrors;"></ulink> (look at the <quote>list of Debian mirrors</quote> section). HTTP mirrors are generally speedier than FTP mirrors.
fr: Les adresses des miroirs Debian HTTP et FTP se trouvent à <ulink url="&url-debian-mirrors;"></ulink> (regardez dans la section <quote>liste complète des miroirs</quote>). Les miroirs HTTP sont en général plus rapides que les miroirs FTP.
it: Gli indirizzi dei mirror HTTP o FTP di Debian sono reperibili in <ulink url="&url-debian-mirrors;"></ulink> (si guardi la sezione <quote>Elenco dei mirror Debian</quote>. Generalmente i mirror HTTP sono più veloci di quelli FTP.
ja: Debian の HTTP/FTP ミラーのアドレスは、<ulink url="&url-debian-mirrors;"></ulink> にあります (<quote>Debian ミラーサイト一覧</quote> のセクションを参照してください)。一般には HTTP ミラーのほうが FTP ミラーよりも高速です。
ml: ഡെബിയനിലെ എച്ച്ടിടിപി അല്ലെങ്കില്‍ എഫ്‌ടിപി മിറര്‍ അഡ്രസ്സുകള്‍ <ulink url="&url-debian-mirrors;"></ulink> ല്‍ കാണാം (<quote>list of Debian mirrors</quote> എന്ന വിഭാഗത്തില്‍ നോക്കുക). എച്ച്ടിടിപി മിററുകള്‍ സാധാരണയായി എഫ്‌ടിപി മിററുകളേക്കാള്‍ വേഗത കൂടിയതാണു്.
pt: Endereços de 'mirrors' Debian HTTP ou FTP podem ser encontrados em <ulink url="&url-debian-mirrors;"></ulink> (veja na secção <quote>Lista de 'mirrors' Debian</quote>). OS 'mirrors' HTTP geralmente são mais rápidos do que os 'mirrors' FTP.
ro: Serverele Debian alternative HTTP sau FTP pot fi găsite la <ulink url="&url-debian-mirrors;"></ulink> (secțiunea <quote>Lista completă a siturilor-oglindă Debian</quote>). Locațiile alternative HTTP sunt în general mai rapide decât cele FTP.
sv: Adresserna till Debians HTTP- eller FTP-speglar kan hittas på <ulink url="&url-debian-mirrors;"></ulink> (se avsnittet <quote>Listan över Debianspeglingar</quote>). HTTP-speglar är vanligtvis snabbare än FTP-speglar.

source: For example, suppose your closest Debian mirror is <literal>&url-debian-mirror-eg;</literal>. When inspecting that mirror with a web browser or FTP program, you will notice that the main directories are organized like this:
fr: Par exemple, supposons que le miroir Debian le plus proche soit <literal>&url-debian-mirror-eg;</literal>. Si vous consultez ce miroir avec un navigateur web ou FTP, vous verrez que les répertoires principaux sont organisés comme ceci :
it: Per esempio, si supponga che il proprio mirror Debian più vicino sia <literal>&url-debian-mirror-eg;</literal>. Ispezionandolo con un browser web o un client FTP si noterà che le directory principali sono organizzate nel modo seguente:
ja: 例えば、一番近くにある Debian ミラーが <literal>&url-debian-mirror-eg;/</literal> だったとしましょう。このミラーをウェブブラウザや FTP プログラムで見てみると、主なディレクトリが以下のような構成になっていることがわかります。
ml: നിങ്ങളുടെ ഏറ്റവും അടുത്തുള്ള ഡെബിയന്‍ മിറര്‍ <literal>&url-debian-mirror-eg;</literal> ആണെന്നിരിയ്ക്കട്ടെ. ഒരു ബൌസറോ എഫ്‌ടിപി പ്രോഗ്രാമോ ഉപയോഗിച്ചു് ആ മിറര്‍ പരിശോധിയ്ക്കുമ്പോള്‍ പ്രധാന തട്ടുകള്‍ ഇങ്ങനെ ക്രമീകരിച്ചതായി നിങ്ങള്‍ക്കു് കാണാം:
pt: Por exemplo, suponha que o 'mirror' Debian mais perto de si é <literal>&url-debian-mirror-eg;/</literal>. Quando inspeccionar aquele 'mirror' com um navegador web ou um programa FTP, irá notar que os directórios principais estão organizados desta forma:
ro: De exemplu, să presupunem că cea mai apropiată locație alternativă Debian este <literal>&url-debian-mirror-eg;/</literal>. Când inspectați această locație cu un navigator de web sau un client de FTP, veți observa că directoarele principale sunt organizate astfel:
sv: Anta till exempel att din närmaste Debian-spegel är <literal>&url-debian-mirror-eg;</literal>. När den spegeln inspekteras med en webbläsare eller FTP-program, kommer du att märka att huvudkatalogerna är organiserade så här:
zh_tw: 舉例來說，假設離您最近的 Debian 鏡像站是 <literal>&url-debian-mirror-eg;</literal>。當您透過網頁瀏覽器或 FTP 程式來檢視這個網站時，您會發現其中的主要目錄架構會像是這個樣子：

source: To use this mirror with <systemitem role="package">apt</systemitem>, you add this line to your <filename>sources.list</filename> file:
fr: Pour utiliser ce miroir avec <systemitem role="package">apt</systemitem>, ajoutez cette ligne au fichier <filename>sources.list</filename> :
it: Per poter utilizzare questo mirror con <systemitem role="package">apt</systemitem>, si aggiungerà al proprio file <filename>sources.list</filename> la seguente riga:
ja: このミラーを <systemitem role="package">apt</systemitem> で使うには、次の行を <filename>sources.list</filename> ファイルに追加します。
ml: <systemitem role="package">apt</systemitem> നൊപ്പം ഈ മിറര്‍ ഉപയോഗിയ്ക്കാന്‍ ഈ വരി നിങ്ങളുടെ <filename>sources.list</filename> ഫയലില്‍ ചേര്‍ക്കുക:
pt: Para utilizar este 'mirror' com o <systemitem role="package">apt</systemitem>, adicione esta linha ao seu ficheiro <filename>sources.list</filename>:
ro: Pentru a utiliza această locație cu <systemitem role="package">apt</systemitem>, trebuie să adăugați această linie la fișierul dumneavoastră <filename>sources.list</filename>:
sv: Lägg till den här raden i din <filename>sources.list</filename> för att använda den här spegelservern med <systemitem role="package">apt</systemitem>:

source: Note that the `<literal>dists</literal>' is added implicitly, and the arguments after the release name are used to expand the path into multiple directories.
fr: Notez que « <literal>dists</literal> » est ajouté automatiquement, et les paramètres qui suivent le nom de version donnent accès à plusieurs répertoires.
it: Si noti che <quote><literal>dists</literal></quote> è aggiunto implicitamente e che gli argomenti che seguono il nome del rilascio sono utilizzati per espandere il percorso su directory multiple.
ja: `<literal>dists</literal>' を書かなくても、暗黙のうちに追加します。リリース名の後の各引数は、パスの末尾につけて、複数のディレクトリに展開するのに用います。
ml: `<literal>dists</literal>' എന്നതു് പറയാതെ തന്നെ ചേര്‍ക്കും എന്നും പതിപ്പിന്റെ പേരിനു് ശേഷമുള്ള ആര്‍ഗ്യുമെന്റുകള്‍ ഒന്നിലധികം തട്ടുകളിലേയ്ക്കു് വഴി വികസിപ്പിയ്ക്കാനാണുപയോഗിയ്ക്കുന്നതെന്നു് പ്രത്യേകം ഓര്‍ക്കുക.
pt: Note que o `<literal>dists</literal>' é implicitamente acrescentado, e que os argumentos que se seguem ao nome do lançamento são utilizados para expandir o caminho em múltiplos directórios.
ro: A se observa faptul că „<literal>dists</literal>” este adăugat implicit, iar argumentele de după numele versiunii sunt utilizate pentru a expanda calea în directoare multiple.
sv: Observera att <quote><literal>dists</literal></quote> läggs till automatiskt och att argumenten efter utgåvans namn används för att utöka sökvägen till flera kataloger.
zh_tw: 請注意，`<literal>dists</literal>' 將會被自動加到路徑中，而在發佈代號之後的參數則會被用來展開成多個不同目錄的路徑。

source: After adding your new sources, disable the previously existing <quote><literal>deb</literal></quote> lines in <filename>sources.list</filename> by placing a hash sign (<literal>#</literal>) in front of them.
fr: Après avoir ajouté les nouvelles sources, commentez les lignes <quote><literal>deb</literal></quote> existantes dans le fichier <filename>sources.list</filename> en plaçant des caractères <literal>#</literal> au début des lignes.
it: Dopo aver aggiunto le nuove fonti, si disabilitino le righe <quote><literal>deb</literal></quote> preesistenti in <filename>sources.list</filename>, ponendovi davanti un simbolo cancelletto (<literal>#</literal>).
ja: 新しいソースを追加した後、<filename>sources.list</filename> 内の既存の <quote><literal>deb</literal></quote> 行の先頭に、ハッシュ記号 (<literal>#</literal>) を追加して無効にしてください。
ml: പുതിയ ഉറവിടങ്ങള്‍ ചേര്‍ത്തിനു് ശേഷം നേരത്തെ ഉള്ള <filename>sources.list</filename> ലെ <quote><literal>deb</literal></quote> വരികള്‍ ഹാഷ് ചിഹ്നം (<literal>#</literal>) മുന്നില്‍ ചേര്‍ത്തു് പ്രവര്‍ത്തനരഹിതമാക്കുക.
pt: Depois de adicionar as suas novas fontes, desactive as linhas <quote><literal>deb</literal></quote> previamente existentes em <filename>sources.list</filename>, colocando um cardinal (<literal>#</literal>) à frente das mesmas.
ro: După ce adăugați noile surse, dezactivați liniile <quote><literal>deb</literal></quote> care existau înainte în <filename>sources.list</filename>, prin plasarea unui diez (<literal>#</literal>) la începutul lor.
sv: Efter att du har lagt till dina nya källor ska du inaktivera de tidigare befintliga <quote><literal>deb</literal></quote>-raderna i <filename>sources.list</filename> genom att placera ett hash-tecken (<literal>#</literal>) framför dem.

source: Adding APT sources for a local mirror
fr: Ajouter les sources d'un miroir local à apt
it: Aggiunta di fonti per APT da mirror locale
ja: APT のローカルミラーソースの追加
ml: പ്രദേശിക മിററിനായി ആപ്റ്റ് ഉറവിടം ചേര്‍ക്കുന്നതു്
pt: Acrescentar fontes APT para um 'mirror' local
ro: Adăugarea de surse APT pentru un sit-oglindă local
sv: Lägg till APT-källor för en lokal spegelserver
zh_tw: 增加 APT 的本機鏡像套件來源

source: Instead of using HTTP or FTP package mirrors, you may wish to modify <filename>/etc/apt/sources.list</filename> to use a mirror on a local disk (possibly mounted over <acronym>NFS</acronym>).
fr: Plutôt que d'utiliser des miroirs HTTP ou FTP, vous pouvez modifier <filename>/etc/apt/sources.list</filename> pour utiliser un miroir sur un disque local (éventuellement monté par NFS).
it: Anziché usare mirror HTTP o FTP dei pacchetti, si potrebbe voler modificare <filename>/etc/apt/sources.list</filename> in modo che usi un mirror su un disco locale (possibilmente montato su <acronym>NFS</acronym>).
ja: HTTP や FTP のパッケージミラーを使うのではなく、ローカルディスク (おそらくは <acronym>NFS</acronym> マウントされたもの) にあるミラーを使うよう、<filename>/etc/apt/sources.list</filename> を変更したいことがあるかもしれません。
ml: എച്ച്ടിടിപി അല്ലെങ്കില്‍ എഫ്‌ടിപി പൊതികളുടെ മിററുകള്‍ക്കു് പകരം ഒരു പ്രാദേശിക ഡിസ്കിലെ മിറര്‍ ഉപയോഗിയ്ക്കാനായി (ഒരു പക്ഷേ <acronym>എന്‍എഫ്എസ്</acronym> വഴി ചേര്‍ത്തതു്) <filename>/etc/apt/sources.list</filename> മാറ്റം വരുത്താന്‍ നിങ്ങളാഗ്രഹിയ്ക്കുന്നുണ്ടാവാം.
pt: Em vez de utilizar os 'mirrors' de pacotes HTTP ou FTP, pode desejar modificar o <filename>/etc/apt/sources.list</filename> de modo a utilizar um 'mirror' num disco local (possivelmente montado sobre <acronym>NFS</acronym>).
ro: În loc să folosiți situri-oglindă HTTP sau FTP, ați putea dori să modificați <filename>/etc/apt/sources.list</filename> pentru a folosi o sursă pe un disc local (poate montat cu <acronym>NFS</acronym>).
sv: Istället för att använda HTTP- eller FTP-paketspeglar, kanske du önskar ändra <filename>/etc/apt/sources.list</filename> till att använda en spegel på en lokal hårddisk (möjligen monterad över <acronym>NFS</acronym>).

source: For example, your package mirror may be under <filename>/var/ftp/debian/</filename>, and have main directories like this:
fr: Par exemple, le miroir de paquets peut être sous <filename>/var/ftp/debian/</filename>, et avoir des répertoires principaux tels que :
it: Per esempio, il proprio mirror dei pacchetti potrebbe essere in <filename>/var/ftp/debian/</filename> e avere le directory principali come segue:
ja: 例えばパッケージのミラーが <filename>/var/ftp/debian/</filename> にあり、主なディレクトリの配置が次のようになっているとします。
ml: ഉദാഹരണത്തിനു് നിങ്ങളുടെ പൊതികളുടെ മിറര്‍ <filename>/var/ftp/debian/</filename> നു് അടിയില്‍ താഴെ പറയുന്ന പ്രധാന തട്ടുകളോടെ ഉള്ളതാവാം:
pt: Por exemplo, o seu 'mirror' de pacotes poderá estar sob <filename>/var/ftp/debian/</filename>, e pode ter directórios principais como estes:
ro: De exemplu, locația dumneavoastră cu pachete poate fi în <filename>/var/ftp/debian/</filename>, având directoarele principale astfel:
sv: Din paketspegel kan exempelvis finnas under <filename>/var/ftp/debian/</filename> och innehålla huvudkataloger som dessa:

source: To use this with <systemitem role="package">apt</systemitem>, add this line to your <filename>sources.list</filename> file:
fr: Pour utiliser ce miroir avec <systemitem role="package">apt</systemitem>, ajoutez cette ligne au fichier <filename>sources.list</filename> :
it: Per poter utilizzare questo mirror con <systemitem role="package">apt</systemitem>, si aggiunga questa riga al proprio <filename>sources.list</filename>:
ja: これを <systemitem role="package">apt</systemitem> で使うには、次の行を <filename>sources.list</filename> ファイルに追加します。
ml: <systemitem role="package">apt</systemitem> നൊപ്പം ഇതുപയോഗിയ്ക്കാന്‍ നിങ്ങളുടെ <filename>sources.list</filename> ഫയലില്‍ ഈ വരി ചേര്‍ക്കുക:
pt: Para utilizar isto com o <systemitem role="package">apt</systemitem>, acrescente esta linha ao seu ficheiro <filename>sources.list</filename>:
ro: Pentru a utiliza această locație cu <systemitem role="package">apt</systemitem>, trebuie să adăugați această linie la fișierul dumneavoastră <filename>sources.list</filename>:
sv: Lägg till den här raden till din <filename>sources.list</filename> för att använda den här med <systemitem role="package">apt</systemitem>:

source: Adding APT source from CD-ROM or DVD
fr: Ajouter des sources sur CD et DVD à apt
it: Aggiunta di fonti per APT su CD-ROM o DVD
ja: APT の CD-ROM/DVD ソースの追加
ml: സിഡി-റോമില്‍ നിന്നോ ഡിവിഡിയില്‍ നിന്നോ ആപ്റ്റ് ഉറവിടങ്ങള്‍ ചേര്‍ക്കുന്നതു്
pt: Acrescentar uma fonte APT de CD-ROM ou DVD
ro: Adăugarea de surse APT de pe CD sau DVD
sv: Lägg till APT-källa från cd-rom eller dvd
zh_tw: 增加 APT 的 CD-ROM 或 DVD 的套件來源

source: If you want to use CDs <emphasis>only</emphasis>, comment out the existing <quote><literal>deb</literal></quote> lines in <filename>/etc/apt/sources.list</filename> by placing a hash sign (<literal>#</literal>) in front of them.
fr: Si vous ne voulez utiliser <emphasis>que</emphasis> les CD, commentez les lignes <quote><literal>deb</literal></quote> existantes dans le fichier <filename>sources.list</filename> en plaçant des <literal>#</literal> au début des lignes.
it: Se si vogliono utilizzare <emphasis>soltanto</emphasis> CD-ROM si disabilitino, commentandole, le righe <quote><literal>deb</literal></quote> preesistenti in <filename>/etc/apt/sources.list</filename>, ponendovi davanti un simbolo cancelletto (<literal>#</literal>).
ja: CD <emphasis>だけ</emphasis>でインストールをしたい場合は、<filename>/etc/apt/sources.list</filename> 内の <quote><literal>deb</literal></quote> 行の先頭にハッシュ記号 (<literal>#</literal>) を置き、それらを無効にしてください。
ml: നിങ്ങള്‍ സിഡികള്‍ <emphasis>മാത്രം</emphasis> ഉപയോഗിയ്ക്കാനാഗ്രഹിയ്ക്കുന്നെങ്കില്‍ <filename>/etc/apt/sources.list</filename> നിലവിലുള്ള <quote><literal>deb</literal></quote> വരികള്‍ ഒരു ഹാഷ് ചിഹ്നം (<literal>#</literal>) മുന്നില്‍ ചേര്‍ത്ത് അഭിപ്രായമാക്കുക.
pt: Se quiser utilizar <emphasis>apenas</emphasis> CDs, comente as linhas <quote><literal>deb</literal></quote>existentes em <filename>/etc/apt/sources.list</filename> colocando um cardinal (<literal>#</literal>) à frente das mesmas.
ro: Dacă doriți să folosiți <emphasis>doar</emphasis> CD-uri, dezactivați liniile <quote><literal>deb</literal></quote> care existau înainte în <filename>sources.list</filename>, prin plasarea unui diez (<literal>#</literal>) la începutul lor.
sv: Om du <emphasis>endast</emphasis> vill använda cd-skivor, kommentera ut de befintliga <quote><literal>deb</literal></quote>-raderna i <filename>/etc/apt/sources.list</filename> genom att placera ett hash-tecken (<literal>#</literal>) framför dem.

source: Make sure there is a line in <filename>/etc/fstab</filename> that enables mounting your CD-ROM drive at the <filename>/cdrom</filename> mount point (the exact <filename>/cdrom</filename> mount point is required for <command>apt-cdrom</command>). For example, if <filename>/dev/hdc</filename> is your CD-ROM drive, <filename>/etc/fstab</filename> should contain a line like:
fr: Assurez-vous de la présence d'une ligne dans <filename>/etc/fstab</filename> qui autorise le montage du CD au point de montage <filename>/cdrom</filename> (ce point de montage <filename>/cdrom</filename> est nécessaire pour utiliser <command>apt-cdrom</command>). Par exemple, si <filename>/dev/hdc</filename> est le lecteur de CD, le fichier <filename>/etc/fstab</filename> devrait contenir une ligne comme celle-ci :
it: Ci si accerti che in <filename>/etc/fstab</filename> ci sia una riga che abilita l'accesso al proprio drive CD-ROM su <filename>/cdrom</filename> (<command>apt-cdrom</command> richiede che il file system sia montato esattamente su <filename>/cdrom</filename>). Ad esempio, se il drive del CD-ROM è chiamato <filename>/dev/hdc</filename>, <filename>/etc/fstab</filename> dovrebbe contenere una riga come la seguente:
ja: CD-ROM ドライブをマウントポイント <filename>/cdrom</filename> にマウントできるようにしている行が <filename>/etc/fstab</filename> にあるかどうかを確認してください (<command>apt-cdrom</command> を使う場合は、マウントポイントを <filename>/cdrom</filename> 以外にはできません)。例えば <filename>/dev/hdc</filename> が CD-ROM ドライブなら、<filename>/etc/fstab</filename> には次のような行が必要です。
ml: <filename>/etc/fstab</filename> ല്‍ നിങ്ങളുടെ സിഡി-റോം ചേര്‍ക്കാനായി <filename>/cdrom</filename> എന്ന സ്ഥാനത്തിനുള്ള (<filename>/cdrom</filename> എന്നു് തന്നെ ആയിരിയ്ക്കണമെന്നു് <command>apt-cdrom</command> നു് നിര്‍ബന്ധമുണ്ടു്) ഒരു ചാര്‍ത്തുണ്ടെന്നു് ഉറപ്പാക്കുക. ഉദാഹരണത്തിനു് <filename>/dev/hdc</filename> യാണു് നിങ്ങളുടെ സിഡി-റോം ഡ്രൈവ് എങ്കില്‍ <filename>/etc/fstab</filename> ല്‍ താഴെ പറയും പോലൊരു വരി കാണണം:
pt: Certifique-se que existe uma linha em <filename>/etc/fstab</filename> que permita a montagem do seu leitor de CD-ROM no ponto de montagem <filename>/cdrom</filename> (o ponto exacto de montagem <filename>/cdrom</filename> é necessário para o <command>apt-cdrom</command>). Por exemplo, se <filename>/dev/hdc</filename> for o seu leitor de CD-ROM, o <filename>/etc/fstab</filename> deverá conter uma linha como esta:
ro: Asigurați-vă că există o linie în <filename>/etc/fstab</filename> ce permite montarea CD-ului la locația <filename>/cdrom</filename> (punctul de montare <filename>/cdrom</filename> este necesar pentru <command>apt-cdrom</command>). De exemplu, dacă<filename>/dev/hdc</filename> reprezintă CD-ROM-ul dumneavoastră, <filename>/etc/fstab</filename> ar trebui să conțină o linie de genul:
sv: Se till att det finns en rad i /etc/fstab som aktiverar montering av din cd-rom-enhet på monteringspunkten /cdrom (den exakta monteringspunkten /cdrom krävs för apt-cdrom). Till exempel, om /dev/hdc är din cd-rom-enhet, ska /etc/fstab innehålla en rad som denna:
zh_tw: 請確定在 <filename>/etc/fstab</filename> 中有著能讓您的光碟機掛載在 <filename>/cdrom</filename> 這個掛載點下的項目（<command>apt-cdrom</command> 限定掛載點必須是 <filename>/cdrom</filename>）。舉例來說，如果您的光碟機的裝置是 <filename>/dev/hdc</filename>，那麼 <filename>/etc/fstab</filename> 中就應該要有像這樣的一行：

source: Note that there must be <emphasis>no spaces</emphasis> between the words <literal>defaults,noauto,ro</literal> in the fourth field.
fr: Remarquez qu'il <emphasis>ne doit pas</emphasis> y avoir d'espace entre les mots <literal>defaults,noauto,ro</literal> dans la quatrième colonne.
it: Si noti che <emphasis>non ci devono essere spazi</emphasis> fra le parole <literal>defaults,noauto,ro</literal> nel quarto campo.
ja: 第 4 フィールドの <literal>defaults,noauto,ro</literal> の単語の間には、スペースを入れてはいけません。
ml: നാലാമത്തെ കളത്തില്‍ <literal>defaults,noauto,ro</literal> എന്നതിനിടയില്‍ <emphasis>സ്പേയ്സുകളൊന്നും</emphasis> കാണരുതെന്നു് പ്രത്യേകം ഓര്‍ക്കുക.
pt: Note que <emphasis>não podem existir espaços</emphasis> que entre as palavras <literal>defaults,noauto,ro</literal> encontradas no quarto campo.
ro: A se reține că nu trebuie să existe <emphasis>nici un spațiu</emphasis> între cuvintele <literal>defaults,noauto,ro</literal> din cel de-al patrulea câmp.
sv: Observera att det <emphasis>inte får finnas några blanksteg</emphasis> mellan orden <literal>defaults,noauto,ro</literal> i det fjärde fältet.
zh_tw: 請注意在第四欄的 <literal>defaults,noauto,ro</literal> 的字中間一定<emphasis>不能參雜空白字元</emphasis>。

source: To verify it works, insert a CD and try running
fr: Pour vérifier que cela fonctionne, insérez un CD et essayez d'exécuter :
it: Per verificare il funzionamento, inserire un CD-ROM e provare a eseguire
ja: これが正しく機能しているか調べるには、CD を挿入して以下を実行してみてください。
ml: ഇതു് പ്രവര്‍ത്തിയ്ക്കുന്നുണ്ടെന്നുറപ്പാക്കാന്‍ ഒരു സിഡി വച്ചു് താഴെ പറയും പോലെ പ്രവര്‍ത്തിപ്പിയ്ക്കുക
pt: Para verificar que tal funciona, insira um CD e tente correr
ro: Pentru a verifica funcționarea, introduceți un CD și încercați să rulați
sv: För att verifiera att det fungerar, mata in en cd och försök köra
zh_tw: 要確認您的設定是否正確，請放入一張光碟片，並試著執行

source: # mount /cdrom # this will mount the CD to the mount point # ls -alF /cdrom # this should show the CD's root directory # umount /cdrom # this will unmount the CD
fr: # mount /cdrom # montera le CD au point de montage /cdrom # ls -alF /cdrom # devrait afficher le contenu de la racine du CD # umount /cdrom # démontera le CD
it: # mount /cdrom # questo monterà il CD nel punto di montaggio # ls -alF /cdrom # dovrebbe mostrare il contenuto della radice del CD # umount /cdrom # questo smonterà il CD
ja: # mount /cdrom # マウントポイントに CD をマウントします # ls -alF /cdrom # CD のルートディレクトリを表示します # umount /cdrom # CD をアンマウントします
ml: # mount /cdrom # നിങ്ങള്‍ പറഞ്ഞ സ്ഥാനത്തിതു് സിഡിയെ ചേര്‍ക്കും # ls -alF /cdrom # ഇതു് സിഡിയുടെ അടിത്തട്ടിലുള്ളതു് കാണിയ്ക്കും # umount /cdrom #ഇതു് സിഡിയെ വേര്‍പ്പെടുത്തും
ro: # mount /cdrom # aceasta va monta CD-ul în punctul de montare # ls -alF /cdrom # aceasta va afișa directorul rădăcină din CD # umount /cdrom # aceasta va demonta CD-ul
sv: # mount /cdrom # det här monterar cd-skivan på monteringspunkten # ls -alF /cdrom # det här ska visa cd-skivans rotkatalog # umount /cdrom # det här kommer att avmontera cd-skivan
zh_tw: # mount /cdrom # 這樣將會將這張 CD 掛載在該掛載點上 # ls -alF /cdrom # 這樣將會列出 CD 的根目錄 # umount /cdrom # 這樣將會卸載這張 CD

source: Next, run:
fr: Puis, lancez :
it: Poi, si esegua:
ja: 問題がなければ
ml: അടുത്തതായി താഴെ പറയും പോലെ പ്രവര്‍ത്തിപ്പിച്ചു്:
pt: A seguir, corra:
ro: Apoi, rulați
sv: Kör sedan:
zh_tw: 接下來對每一張 Debian 的程式光碟執行
