Repository: lurdan/trans-ddp
Catalog: release-notes/*/upgrading.po
Languages: fr, it, ja, ml, pt, ro, sv, zh_tw

source: The problem appears when the upgrade does not generate a new <filename>/boot/grub/menu.lst</filename> file to take the new naming convention into account. During the boot, Grub will pass a system root partition to the kernel that the kernel doesn't find. It can also appear when mounting filesystems if the <filename>/etc/fstab</filename> has not been updated accordingly. Although the upgrade process to &releasename; should cover both situations automatically.
fr: Le problème apparaît quand la mise à niveau ne génère pas un nouveau fichier <filename>/boot/grub/menu.lst</filename> qui prend en compte la nouvelle convention de nommage. Pendant le démarrage, GRUB va donner au noyau une partition système racine que le noyau ne trouvera pas. Ceci peut aussi arriver si les systèmes de fichiers à monter de <filename>/etc/fstab</filename> n'ont pas été mis à jour correctement. Le processus de mise à niveau vers &Releasename; doit cependant gérer automatiquement les deux situations.
it: Il problema compare quando l'aggiornamento non genera un nuovo file <filename>/boot/grub/menu.lst</filename> per considerare la nuova convenzione di denominazione. Durante l'avvio, Grub passerà al kernel una partizione radice che il kernel non troverà. Il problema può comparire anche quando vengono montati i file system, se <filename>/etc/fstab</filename> non è stato aggiornato correttamente. A ogni modo, il processo di aggiornamento a &releasename; dovrebbe occuparsi automaticamente di entrambi gli aspetti.
ja: 問題は、アップグレードによって、新しい命名規則を考慮に入れた、新しい <filename>/boot/grub/menu.lst</filename> ファイルが生成されないときに生じます。起動時に Grub がカーネルに渡すシステムルートパーティションを、カーネルが検出できないのです。<filename>/etc/fstab</filename> が対応して更新されていなかった場合は、ファイルシステムのマウント中にも発生します。しかし、&releasename; へのアップグレード作業では、自動的に両方の状況がカバーされるはずです。
pt: O problema aparece quando a actualização não gera um novo ficheiro <filename>/boot/grub/menu.lst</filename> para tomar em conta a nova convenção de nomes. Durante o arranque, o Grub irá passar uma partição raiz do sistema para o kernel que o kernel não vai encontrar, e também pode aparecer quando se montar os sistemas de ficheiros se o <filename>/etc/fstab</filename> não tiver sido actualizado de acordo. Apesar do processo de actualização para &releasename; dever cobrir ambas as situações automaticamente.
ro: Problema apare atunci când procesul de actualizare nu generează un nou fișier <filename>/boot/grub/menu.lst</filename> care să țină cont de noile convenții de nume. În timpul procesului de inițializare, Grub va transmite o partiție rădăcină către nucleu, pe care acesta nu o poate găsi. Poate de asemena să apară când montați fișiere dacă <filename>/etc/fstab</filename> nu a fost actualizat corespunzător. Deși procesul de actualizare la &releasename; ar trebui să rezolve ambele situații în mod automat.
sv: Problemet uppstår när uppgraderingen inte skapar en ny <filename>/boot/grub/menu.lst</filename>-fil som tar de nya namnkonventionerna i beräkningarna. Under uppstarten kommer Grub att skicka rotpartitionen till kärnan och då kan inte kärnan hitta den. Det kan också visa sig vid montering av filsystem om <filename>/etc/fstab</filename> inte har uppdaterats korrekt. Även om uppgraderingsprocessen till &releasename; bör täcka in båda situationerna automatiskt.

source: If you have encountered this problem after upgrading, jump to <xref linkend="how-to-recover"/>. To avoid the problem before upgrading, read ahead.
fr: Si vous avez rencontré ce problème après avoir effectué la mise à niveau, reportez-vous en <xref linkend="how-to-recover"/>. Pour éviter ce problème avant de mettre à niveau, continuez la lecture.
it: Se dopo l'aggiornamento si è riscontrato questo problema, si consulti <xref linkend="how-to-recover"/>. Per evitare questo problema prima di aggiornare, si continui a leggere.
ja: アップグレード後にこの問題に遭遇した場合は、<xref linkend="how-to-recover"/>に飛んでください。アップグレード前にこの問題を防ぎたい場合は、このまま読み進めてください。
ml: നവീകരണത്തിനു ശേഷം ഇങ്ങനെ ഒരു പ്രശ്നം നേരിടേണ്ടി വന്നിട്ടുണ്ടെങ്കില്‍ <xref linkend="how-to-recover"/>ലേക്ക് കടക്കുക. നവീകരണത്തിന് മുമ്പ് ഇത് സംഭവിക്കാതിരിക്കന്‍ തുടര്‍ന്ന് വായിക്കുക.
pt: Se você deparar com este problema após actualização, salta para <xref linkend="how-to-recover"/>. Para evitar este problema antes de actualizar, leia mais à frente.
ro: Dacă v-ați lovit de această problemă, accesați <xref linkend="how-to-recover"/>. Pentru a evita această problemă înainte de înnoire citiți în continuare.
sv: Har du drabbats av detta problem efter uppgraderingen, läs i <xref linkend="how-to-recover"/>. För att undvika detta problem före uppgradering läs vidare nedan.
zh_tw: 如果您在升級後遇到了這個問題，請參閱 <xref linkend="how-to-recover"/>。而關於如何在升級之前避開這個問題，請繼續閱讀。

source: How to avoid the problem before upgrading
fr: Comment éviter le problème avant d'effectuer la mise à niveau
it: Come evitare questo problema prima dell'aggiornamento
ja: アップグレードの前に問題を防ぐには
ml: നവീകരിക്കുന്നതിനു മുന്‍പ് പ്രശ്നം എങ്ങനെ ഒഴിവാക്കാം
pt: Como evitar o problema antes da actualização
ro: Cum se poate evita problema înainte de înnoire
sv: Att undvika problemet före uppgradering
zh_tw: 如何在升級之前避開這個問題

source: One can avoid this problem entirely by using an identifier for the root filesystem that does not change from one boot to the next. There are two possible methods for doing this - labeling the filesystem, or using the filesystem's universally unique identifier (<acronym>UUID</acronym>). These methods are supported in Debian since the etch release.
fr: On peut complètement éviter le problème en utilisant un identifiant du système de fichier racine, invariable d'un démarrage à l'autre. Il existe deux méthodes possibles, soit en étiquetant le système de fichiers, soit en utilisant l'identifiant unique universel du système de fichier (<acronym>UUID</acronym>). Ces méthodes sont prises en charge depuis la version Etch.
it: È possibile evitare questo problema usando un identificatore per il file system radice che non cambia da un avvio all'altro. Ci sono due possibili metodi per ottenere questo risultato: dare un'etichetta al file system o usare l'identificatore unico universale (<acronym>UUID</acronym>) del file system. Questi metodi sono supportati in Debian a partire dalla versione etch.
ja: 起動のたびに変化しない識別子をルートファイルシステムに用いると、この問題を完全に防ぐことができます。識別子を用いる方法としては、2 つが考えられます。ファイルシステムにラベルをつける方法と、ファイルシステムの汎用一意識別子 (<acronym>UUID</acronym>) を用いる方法です。これらの方法は、Debian では etch のリリースからサポートされています。
pt: É possível evitar este problema inteiramente ao usar um identificador para o sistema de ficheiros raiz que não altere de um arranque para o próximo. Existem dois métodos possíveis de o fazer - etiquetar o sistema de ficheiros, ou usar o identificador único universal (<acronym>UUID</acronym>). Estes métodos são suportados em Debian desde o lançamento da 'etch'.
ro: Problema se poate evita complet prin intermediul unui identificator pentru sistemul de fișiere rădăcină ce nu se modifică de la o pornire la alta. Sunt două posibilități pentru a o face - etichetarea sistemului de fișiere sau folosirea identificatorului unic universal al sistemului de fișiere (<acronym>UUID</acronym>). Aceste metode sunt suportate în Debian începând cu versiunea etch.
sv: Problemet kan undvikas helt genom att använda en idetitet för rotfilsystemet som inte förändras mellan olika uppstarter. Det finns två möjliga metoder för att uppnå detta. Att sätta etiketter på filsystem eller genom att använda ett filsystems universella unika identitet (<acronym>UUID</acronym>). Dessa metoder har funnits i Debian sedan utgåvan etch.

source: The two approaches have advantages and disadvantages. The labeling approach is more readable, but there may be problems if another filesystem on your machine has the same label. The <acronym>UUID</acronym> approach is uglier, but having two clashing <acronym>UUID</acronym>s is highly unlikely.
fr: Ces deux approches ont des avantages et des inconvénients. L'approche par les étiquettes est plus lisible, mais il peut y avoir des problèmes si un autre système de fichiers de la machine possède la même étiquette. L'approche par <acronym>UUID</acronym> est plus laide, mais le risque d'avoir deux identifiants identiques est très peu probable.
it: Entrambi gli approcci hanno vantaggi e svantaggi. Quello di dare un'etichetta è più leggibile, ma ci potrebbero essere problemi se un altro file system sul proprio sistema ha la medesima etichetta. Quello UUID è meno carino, ma il caso di avere due UUID contrastanti è più unico che raro.
ja: 2 つの方法のどちらにも長所と短所があります。ラベルをつける方法は可読性が高いのですが、マシン上の別のファイルシステムに同じラベルがついている場合に、問題が発生する可能性があります。見た目はよくありませんが、<acronym>UUID</acronym> を用いる方法では、2 つの <acronym>UUID</acronym> が衝突することはまずありません。
ml: ഈ രണ്ടു രീതിക്കും ഗുണങ്ങളും ദോഷങ്ങളുമുണ്ട്. ലേബല്‍ ഇടുന്ന രീതി കൂടുതല്‍ വായിക്കത്തക്കതാണ്, എന്നാല്‍ നിങ്ങളുടെ യന്ത്രത്തിലെ വേറൊരു ഫയല്‍ വ്യവസ്ഥിതിയില്‍ ഇതെ ലേബലുണ്ടെങ്കില്‍ പ്രശ്നങ്ങള്‍ sഷ്ടിക്കും. <acronym>UUID</acronym>സമീപനം വളരെ വിരൂപമാണ്, എങ്കിലും രണ്ട് <acronym>UUID</acronym>കള്‍ ഏറ്റുമുട്ടുന്നത് അസംഭാവ്യ‌‌മാണ്.
pt: A duas aproximações têm vantagens e desvantagens. A aproximação por rotulagem é mais legível, mas pode haver problemas se outro sistema de ficheiros na sua máquina tiver o mesmo rótulo (label). A aproximação <acronym>UUID</acronym> é mais feia, mas ter dois <acronym>UUID</acronym>s em colisão é altamente improvável.
ro: Ambele metode au avantaje și dezavantaje. Etichetarea este mai lizibilă dar poate fi o sursă de probleme dacă un alt sistem de fișiere are aceeași etichetă. Metoda cu <acronym>UUID</acronym> nu este la fel de lizibilă dar este mult mai puțin probabilă coliziunea identificatorilor <acronym>UUID</acronym>.
sv: Metoderna har fördelar och nackdelar. Etikett-metoden är mer läsbar men det kan finnas problem med den om ett annat filsystem på din maskin har samma etikett. <acronym>UUID</acronym>-metoden är fulare men att det skulle skapas två filsystem med samma <acronym>UUID</acronym> är mycket osannolikt.

source: For the examples below we assume the root filesystem is on <filename>/dev/hda6</filename>. We also assume your system has a working udev installation and ext2 or ext3 filesystems.
fr: Dans les exemples ci-dessous, nous supposons que le système de fichiers racine est sur <filename>/dev/hda6</filename>, et que le système dispose d'une installation fonctionnelle de udev et des systèmes de fichiers ext2 ou ext3.
it: Poniamo ad esempio che il file system radice risieda in <filename>/dev/hda6</filename> e supponiamo che il proprio sistema abbia un'installazione udev funzionante con file system ext2 o ext3.
ja: 以下の例では、ルートファイルシステムが <filename>/dev/hda6</filename> 上にあるものと仮定します。また、システムには動作する udev がインストールされており、ファイルシステムは ext2 または ext3 であると仮定しています。
ml: താഴെകൊടുത്ത ഉദാഹരണത്തിന് അടിസ്ഥാന ഫയല്‍വ്യവസ്ഥ <filename>/dev/hda6</filename>ലാണെന്ന് സങ്കല്‍പ്പിക്കുക. നിങ്ങളുടെ വ്യ‌‌വസ്ഥയില്‍ udevസ്ഥാപിച്ചിട്ടുണ്ടെന്നും ext2 അല്ലെങ്കില്‍ ext3 ഫയല്‍ വ്യ‌വസ്ഥയണെന്നും കൂടി സങ്കല്‍പ്പിക്കുക.
pt: Para os exemplos abaixo nós assumimos que o sistema de ficheiros raiz está em <filename>/dev/hda6</filename>. Também assumimos que o seu sistema tem uma instalação udev funcional e sistemas de ficheiros ext2 ou ext3.
ro: În exemplele de mai jos vom presupune că sistemul de fișiere rădăcină este pe <filename>/dev/hda6</filename>. De asemenea, vom presupune că udev funcționează corect pe sistemul dumneavoastră.
sv: I exemplet nedan antas att rotfilsystemet finns på <filename>/dev/hda6</filename>. Vi antar dessutom att systemet har en fungerande udev-installation och ett ext2- eller ext3-filsystem.
zh_tw: 在以下的範例中，我們假設 root 檔案系統是位於 <filename>/dev/hda6</filename>。我們也同時假設了您的系統安裝並使用了 udev，同時使用的是 ext2 或 ext3 檔案系統。

source: To implement the labeling approach:
fr: Pour mettre en œuvre l'approche par étiquette :
it: Per implementare l'approccio di etichettatura:
ja: ラベルをつける方法は、次のようにして実行します:
ml: ലേബലിംഗ് സമീപനം നടപ്പിലാക്കാന്‍:
pt: Para implementar a aproximação de 'rótulos' (labelling):
ro: Pentru implementarea soluției cu etichetă:
sv: För att använda etikettmetoden:

source: Label the filesystem (the name must be &lt; 16 characters) by running the command: <command>e2label /dev/hda6 rootfilesys</command>
fr: Étiquetez le système de fichier (le nom doit comporter moins de 16 caractères) en exécutant : <command>e2label /dev/hda6 systemeracine</command>
it: Attribuire l'etichetta al file system (il nome deve avere al massimo 16 caratteri), eseguendo il comando: <command>e2label /dev/hda6 rootfilesys</command>
ja: 次のコマンドを実行して、ファイルシステムにラベルをつけます (名前は 16 文字未満でなければなりません): <command>e2label /dev/hda6 rootfilesys</command>
ml: <command>e2label /dev/hda6 rootfilesys</command>: ആജ്ഞ നടത്തിക്കൊണ്ട് ഫയല്‍ വ്യ‌‌വസ്ഥ ലേബല്‍ ചെയ്യുക (പേരിന് &lt;16 അക്ഷരങ്ങള്‍ വേണം)
pt: Dê um rótulo (label) (o nome tem que ser &lt; 16 caracteres) ao sistema de ficheiros correndo o comando: <command>e2label /dev/hda6 rootfilesys</command>
ro: Dați o valoare etichetei sistemului de fișiere (numele trebuie să conțină &lt; 16 caractere) prin rularea comenzii: <command>e2label /dev/hda6 rootfilesys</command>
sv: Sätt etikett på filsystemet (namnet måste vara &lt; 16 tecken) genom att köra följande kommando: <command>e2label /dev/hda6 rootfilesys</command>

source: Edit <filename>/boot/grub/menu.lst</filename> and change the line:
fr: Éditez <filename>/boot/grub/menu.lst</filename> et modifiez la ligne :
it: Modificare <filename>/boot/grub/menu.lst</filename> cambiando la riga:
ja: <filename>/boot/grub/menu.lst</filename> を編集して、次のような行を:
ml: <filename>/boot/grub/menu.lst</filename> തുറന്നു ഈ വരി :
pt: Edite o <filename>/boot/grub/menu.lst</filename> e altere a linha:
ro: Editați <filename>/boot/grub/menu.lst</filename> și modificați rândul:
sv: Redigera <filename>/boot/grub/menu.lst</filename> och ändra följande rad:
zh_tw: 然後，編輯 <filename>/boot/grub/menu.lst</filename> 並將以下這一行：

source: to
fr: en
it: in
ja: 次のように変更します:
ml: ഇങ്ങനെ മാറ്റുക
pt: para
ro: în
sv: till
zh_tw: 修改為

source: Do not remove the <literal>#</literal> at the start of the line, it needs to be there.
fr: N'enlevez pas le <literal>#</literal> au début de la ligne, il est nécessaire.
it: Non si rimuova il carattere <literal>#</literal> all'inizio della riga, deve necessariamente essere lì.
ja: 行頭の <literal>#</literal> を削除しないでください。この文字は行頭にある必要があります。
ml: വരിയുടെ തുടക്കത്തിലുള്ള ഈ <literal>#</literal> അടയാളം മാറ്റരുതു. ഇതു അങ്ങനെ തന്നെ വേണം
pt: Não remova o <literal>#</literal> no inicio da linha, ele precisa estar lá.
ro: A nu se ștege <literal>#</literal> de la începutul rândului, este necesar să rămână acolo.
sv: Ta inte bort <literal>#</literal> i början på raden, den måste vara där.
zh_tw: 請不要刪掉最開頭的 <literal>#</literal>。它是必要的。

source: Update the <literal>kernel</literal> lines in <filename>menu.lst</filename> by running the command <command>update-grub</command>.
fr: Mettez à jour les lignes <literal>kernel</literal> dans <filename>menu.lst</filename> en exécutant la commande <command>update-grub</command>.
it: Si aggiornino le righe del <literal>kernel</literal> nel file <filename>menu.lst</filename>, eseguendo il comando <command>update-grub</command>.
ja: <command>update-grub</command> コマンドを実行して、<filename>menu.lst</filename> 内の <literal>kernel</literal> 行を更新します。
ml: <filename>menu.lst</filename> എന്ന ഫയലിലെ <literal>kernel</literal> വരികള്‍ <command>update-grub</command> ഉപയോഗിച്ച് പുതുക്കുക
pt: Actualize as linhas <literal>kernel</literal> em <filename>menu.lst</filename> correndo o comando <command>update-grub</command>.
ro: Actualizați rândurile cu <literal>kernel</literal> în <filename>menu.lst</filename> rulând comanda <command>update-grub</command>.
sv: Uppdatera <literal>kernel</literal>-raderna i <filename>menu.lst</filename> genom att köra kommandot <command>update-grub</command>.
zh_tw: 執行 <command>update-grub</command> 指令，讓它更新 <filename>menu.lst</filename> 裡的 <literal>kernel</literal> 設定。

source: Edit <filename>/etc/fstab</filename> and change the line that mounts the <filename>/</filename> partition, e.g.:
fr: Modifiez <filename>/etc/fstab</filename> et changez la ligne qui monte la partition <filename>/</filename>, par exemple :
it: Si modifichi, in <filename>/etc/fstab</filename>, la riga che monta la partizione <filename>/</filename>, per esempio:
ja: <filename>/etc/fstab</filename> を編集し、<filename>/</filename> パーティションをマウントするための、例えば次のような行を:
ml: <filename>/etc/fstab</filename> തുറന്നു <filename>/</filename> പാര്‍ട്ടീഷന്‍ മൌണ്ട് ചെയ്യുന്ന വരി മാറ്റുക, ഉദാ:
pt: Edite o <filename>/etc/fstab</filename> e modifique a linha que monta a partição <filename>/</filename>, ex.:
ro: Editați <filename>/etc/fstab</filename> și modificați rândul ce se referă la montarea partiției <filename>/</filename>, de exemplu:
sv: Redigera <filename>/etc/fstab</filename> och ändra raden som monterar <filename>/</filename>-partition, ex:

source: The change that matters here is the first column, you don't need to modify the other columns of this line.
fr: Le changement concerne la première colonne, vous n'avez pas à modifier les autres colonnes de cette ligne.
it: La modifica più importante in questo caso è la prima colonna, non è necessario modificare le altre colonne di questa riga.
ja: ここで問題となる変更は最初のカラムです。この行の残りのカラムは変更する必要はありません。
ml: ഇതില്‍ ആദ്യത്തെ കളം മാത്രം മാറ്റിയാല്‍ മതി. മറ്റുള്ളവ മാറ്റേണ്ട കാര്യമില്ല
pt: A alteração que aqui interessa é a primeira coluna, você não precisa alterar as outras colunas desta linha.
ro: Modificarea semnificativă aici este în prima coloană, nu este nevoie să se modifice restul coloanelor din acel rând.
sv: Den förändring som är av betydelse här finns i första kolumnen. Du behöver inte ändra de övriga kolumnerna på denna rad.
zh_tw: 在此主要是修改第一個欄位，您不需要修改該行中的其它欄位。

source: To implement the <acronym>UUID</acronym> approach:
fr: Pour mettre en œuvre l'approche <acronym>UUID</acronym> :
it: Per implementare l'approccio <acronym>UUID</acronym>:
ja: <acronym>UUID</acronym> を用いる方法は、次のようにして実行します:
ml: <acronym>UUID</acronym> സമീപനം നടപ്പിലാക്കാന്‍:
pt: Para implementar a aproximação <acronym>UUID</acronym>:
ro: Pentru implementarea soluției cu <acronym>UUID</acronym>:
sv: För att använda <acronym>UUID</acronym>-metoden:

source: Find out the universally unique identifier of your filesystem by issuing: <command>ls -l /dev/disk/by-uuid | grep hda6</command>. You can also use <command>blkid /dev/hda6</command>.
fr: Récupérez l'identifiant universel unique du système de fichiers avec la commande : <command>ls -l /dev/disk/by-uuid | grep hda6</command>. Vous pouvez aussi utiliser <command>blkid /dev/hda6</command>.
it: Si trovi l'UUID del proprio file system eseguendo: <command>ls -l /dev/disk/by-uuid | grep hda6</command>. È anche possibile usare <command>blkid /dev/hda6</command>.
ja: 次のコマンドを実行して、ファイルシステムの汎用一意識別子 (UUID) を調べます: <command>ls -l /dev/disk/by-uuid | grep hda6</command> 。あるいは <command>blkid /dev/hda6</command> としても構いません。
pt: Encontre o identificador único universal do seu sistema de ficheiros emitindo: <command>ls -l /dev/disk/by-uuid | grep hda6</command>. Você também pode usar <command>blkid /dev/hda6</command>.
ro: Aflați identificatorul unic universal pentru sistemul dumneavoastră de fișiere prin rularea comenzii:<command>ls -l /dev/disk/by-uuid | grep hda6</command>. Puteți folosi de asemena <command>blkid /dev/hda6</command>.
sv: Ta reda på den universellt unika identiten på ditt filsystem genom: <command>ls -l /dev/disk/by-uuid | grep hda6</command>. Du kan också använda <command>blkid /dev/hda6</command>.

source: If you list the contents in <filename>/dev/disk/by-uuid</filename>, you should get a line similar to this one:
fr: Si vous affichez la liste du contenu de <filename>/dev/disk/by-uuid</filename>, vous devriez avoir une ligne ressemblant à&nbsp;:
it: Facendo l'elenco del contenuto di <filename>/dev/disk/by-uuid</filename>, si ottiene una riga simile alla seguente:
ja: <filename>/dev/disk/by-uuid</filename> ディレクトリの中身の一覧を表示すると、以下によく似た行が得られるでしょう:
pt: Se listar o conteúdo de <filename>/dev/disk/by-uuid</filename>, você deverá obter uma linha semelhante a esta:
ro: Dacă afișați conținutul din <filename>/dev/disk/by-uuid</filename>, ar trebui să obțineți ceva asemănător cu:
sv: Om du visar innehållet i <filename>/dev/disk/by-uuid</filename> bör du hitta en rad som liknar den här:

source: lrwxrwxrwx 1 root root 24 2008-09-25 08:16 d0dfcc8a-417a-41e3-ad2e-9736317f2d8a -> ../../hda6
sv: lrwxrwxrwx 1 root root 24 2009-01-30 08:16 d0dfcc8a-417a-41e3-ad2e-9736317f2d8a -> ../../hda6

source: If you use <command>blkid</command>, you should get an output similar to this one:
fr: Si vous utilisez <command>blkid</command>, vous devriez avoir une sortie ressemblant à&nbsp;:
it: Usando <command>blkid</command>, si ottiene qualcosa di simile a questo:
ja: <command>blkid</command> を使った場合は、以下に似た出力が得られます:
pt: Se usar o <command>blkid</command>, você deverá obter um resultado semelhante a este:
ro: Dacă folosiți <command>blkid</command>, ar trebui să obțineți un rezultat similar cu:
sv: Om du använder <command>blkid</command> bör du få utdata som liknar följande:

source: The <acronym>UUID</acronym> is the name of the symbolic link pointing to <filename>/dev/hda6</filename> i.e.: <literal>d0dfcc8a-417a-41e3-ad2e-9736317f2d8a</literal>.
fr: L'<acronym>UUID</acronym> est le nom du lien symbolique pointant vers <filename>/dev/hda6</filename> c.-à-d. : <literal>d0dfcc8a-417a-41e3-ad2e-9736317f2d8a</literal>.
it: L'<acronym>UUID</acronym> è il nome del collegamento simbolico che punta a <filename>/dev/hda6</filename>, e cioè <literal>d0dfcc8a-417a-41e3-ad2e-9736317f2d8a</literal>.
ja: <acronym>UUID</acronym> は、<filename>/dev/hda6</filename> を指しているシンボリックリンクの名前、すなわちこの場合は <literal>d0dfcc8a-417a-41e3-ad2e-9736317f2d8a</literal> です。
ml: <filename>/dev/hda6</filename> യുടെ സാങ്കല്പിക കണ്ണിയുടെ പേരാണു് <acronym>UUID</acronym>, അതായതു <literal>d0dfcc8a-417a-41e3-ad2e-9736317f2d8a</literal>
pt: O <acronym>UUID</acronym> é o nome do link simbólico que aponta para <filename>/dev/hda6</filename> ex.: <literal>d0dfcc8a-417a-41e3-ad2e-9736317f2d8a</literal>.
ro: <acronym>UUID</acronym> este numele pentru legătura simbolică ce indică spre <filename>/dev/hda6</filename>, adică: <literal>d0dfcc8a-417a-41e3-ad2e-9736317f2d8a</literal>.
sv: <acronym>UUID</acronym> är namnet på den symboliska länk som pekar på <filename>/dev/hda6</filename> exempelvis: <literal>d0dfcc8a-417a-41e3-ad2e-9736317f2d8a</literal>.

source: Your filesystem <acronym>UUID</acronym> will be a different string.
fr: L'<acronym>UUID</acronym> du système de fichiers sera différent.
it: L'<acronym>UUID</acronym> del proprio file system sarà una stringa differente.
ja: あなたのファイルシステムの <acronym>UUID</acronym> は別の文字列でしょう。
ml: താങ്കളുടെ ഫയല്‍ സിസ്റ്റം <acronym>UUID</acronym> വ്യത്യസ്ഥമായിരിക്കും
pt: O <acronym>UUID</acronym> do seu sistema de ficheiros será uma sequência diferente.
ro: UUID-ul sistemului dumneavoastră de fișiere va fi unul diferit de acesta.
sv: Ditt filsystem kommer ha en annan <acronym>UUID</acronym> som sträng.
zh_tw: 您的檔案系統的 <acronym>UUID</acronym> 應該會是一個完全不同的字串。

source: to use UUID instead:
fr: afin d'utilisez l'UUID à la place&nbsp;:
it: invece per usare UUID:
ja: UUID を代わりに使います:
pt: para usar antes o UUID:
ro: pentru a folosi în schimb UUID:
sv: att använda UUID istället:

source: How to recover from the problem after the upgrade
fr: Comment corriger le problème après la mise à niveau
it: Come risolvere il problema dopo l'aggiornamento
ja: アップグレードの後で問題を解決するには
ml: നവീകരിച്ചതിനുശേഷമുള്ള പ്രശ്നത്തില്‍ നിന്നും എങ്ങനെ രക്ഷപ്പെടാം
pt: Como recuperar do problema após a actualização
ro: Cum să se recupereze sistemul în caz de problemă după înnoire
sv: För att återhämta sig från problemet efter uppgraderingen
zh_tw: 如何在升級後再修復這個問題

source: Solution 1
it: Soluzione 1
ja: 解決方法 1
ml: പരിഹാരം 1
pt: Solução 1
ro: Soluția 1
sv: Lösning 1
zh_tw: 方案 1
