Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: <package>patch</package> - this very useful utility will take a file containing a difference listing (produced by the <prgn>diff</prgn> program) and apply it to the original file, producing a patched version. (see <manref section="1" name="patch">)
ca: <package>patch</package> - és una utilitat molt útil. Permet aplicar un arxiu amb una llista de diferències (produït pel programa <prgn>diff</prgn>) en el fitxer original, i obtenir una versió ﻿apedaçada del fitxer original (vegeu <manref section="1" name="patch">).
es: <package>patch</package> - esta utilidad es muy práctica para modificar el original de un archivo a partir de un archivo de diferencias (elaborado por el programa <prgn>diff</prgn>) produciendo un archivo parcheado (véase <manref section="1" name="patch">).
fr: <package>patch</package> &mdash; ce programme très utile prend un fichier contenant une liste de différences (produite par le programme <prgn>diff</prgn>) et l'applique au fichier original, produisant une version modifiée (voir <manref section="1" name="patch">) ;
it: <package>patch</package> - questo utile programma usa un file contenente una serie di differenze (prodotta dal programma diff) e le applica al file originale, per produrre una versione modificata. (vedere <manref section="1" name="patch">)
ja: <package>patch</package> - このとても有用なユーティリティは、(<prgn>diff</prgn> プログラムによって生成された) オリジナルとの差分が列挙されたファイルを読み込んでオリジナルのファイルに適用し、パッチが当てられたバージョンを作成します。 (詳しくは <manref section="1" name="patch"> を参照)。
zh_cn: <package>patch</package> - 这是一个非常有用的工具，它可以把 <prgn>diff</prgn> 程序生成的差异清单文件应用到原先的文件上，从而生成一个补丁版本。(参看 <manref section="1" name="patch">)
zh_tw: <package>patch</package> - 這是一個非常有用的工具，它可以把 <prgn>diff</prgn> 程式生成的差異清單檔案應用到原先的檔案上，從而生成一個補丁版本。(參考 <manref section="1" name="patch">)

source: <package>perl</package> - Perl is one of the most used interpreted scripting languages on today's Unix-like systems, often referred to as "Unix's Swiss Army Chainsaw". (see <manref section="1" name="perl">)
ca: <package>perl</package> - Perl és un dels llenguatges interpretats usats amb més freqüència per als guions (o «scripts») en els sistemes Un*x. Tant es així que es fa servir l'expressió «navalla suïssa d'Unix» per fer referència en aquest llenguatge (llegeix <manref section="1" name="perl">).
es: <package>perl</package> - Perl es uno de los lenguajes interpretados para hacer guiones (o «scripts») más usados en los sistemas Un*x de hoy en día, comúnmente se refiere a él como la «navaja suiza de Unix» (véase <manref section="1" name="perl">).
fr: <package>perl</package> &mdash; Perl est un des langages de script les plus utilisés sur les systèmes modernes similaires à Unix, souvent qualifié de « tronçonneuse suisse d'Unix » (voir <manref section="1" name="perl">) ;
it: <package>perl</package> - Perl è uno dei linguaggi di scripting più utilizzati sui moderni sistemi Unix e derivati, spesso definito come "il coltellino svizzero di Unix". (vedere <manref section="1" name="perl">)
ja: <package>perl</package> - Perl は今日の UNIX 系システムにおいてもっとも使われているインタープリタ型スクリプト言語のひとつで、その強力さはしばしば「Unix のスイス軍用チェーンソー」と形容されるほどです (詳しくは <manref section="1" name="perl"> を参照)。
zh_cn: <package>perl</package> - Perl 是当今的类 Unix 系统中最常用的解释型脚本语言之一，常被誉为 <em>Unix 的瑞士军刀</em>。(参看 <manref section="1" name="perl">)
zh_tw: <package>perl</package> - Perl 是當今的類 Unix 系統中最常用的解譯型腳本語言之一，常被譽爲 <em>Unix 的瑞士軍刀</em>。(參考 <manref section="1" name="perl">)

source: <package>python</package> - Python is another of the most used interpreted scripting languages on the Debian system that combines remarkable power with very clear syntax. (see <manref section="1" name="python">)
ca: <package>python</package> - Python és una altre llenguatge interpretat per a fer guions a Debian degut a la combinació de funcionalitat i clara sintaxi (consulta <manref section="1" name="python">).
es: <package>python</package> - Python es otro de los lenguajes interpretados para hacer guiones (o «scripts») en Debian debido a la combinación de su poder y sintaxis clara (véase <manref section="1" name="python">).
fr: <package>python</package> &mdash; Python est un autre des langages de script les plus utilisés sur le système Debian qui combine une remarquable puissance et une syntaxe très claire (voir <manref section="1" name="python">) ;
it: <package>python</package> - Python è un altro linguaggio di scripting molto utilizzato sui sistemi Debian, combina una notevole potenza con una sintassi molto chiara. (vedere <manref section="1" name="python">)
ja: <package>python</package> - Python は Debian システムにおいてもっとも使われているもう一つの インタープリタ型スクリプト言語で、並外れたパワーと非常に明快な書式を 兼ねそなえています。 (詳しくは <manref section="1" name="python"> を参照)。
zh_cn: <package>python</package> - Python 是 Debian 系统中另一个最常用的解释型脚本语言，它拥有着可圈可点的强大功能和十分清晰的语法。(参看 <manref section="1" name="python">)
zh_tw: <package>python</package> - Python 是 Debian 系統中另一個最常用的解譯型腳本語言，它擁有着可圈可點的強大功能和十分清晰的語法。(參考 <manref section="1" name="python">)

source: <package>autoconf</package>, <package>automake</package> and <package>autotools-dev</package> - many newer programs use configure scripts and <file>Makefile</file> files preprocessed with help of programs like these. (see "<tt>info autoconf</tt>", "<tt>info automake</tt>"). The <package>autotools-dev</package> keeps up-to-date versions of certain auto files and has documentation about the best way to use those files.
ca: <package>autoconf</package> , <package>automake</package> i <package>autotools-dev</package> - molts programes fan servir fitxers de configuració i fitxers <file>Makefile</file> que es gestionen amb aquests programes (llegeix "<tt>info autoconf</tt>", "<tt>info automake</tt>"). El paquet <package>autotools-dev</package> permet mantenir versions actualitzades dels fitxers «autoconf» i «automake» i conté documentació per aprendre a fer servir amb eficàcia aquest tipus de fitxers.
es: <package>autoconf</package> , <package>automake</package> y <package>autotools-dev</package> - muchos programas nuevos usan ficheros de configuración y ficheros <file>Makefile</file> que se procesan con la ayuda de programas como éstos (véase "<tt>info autoconf</tt>", "<tt>info automake</tt>"). El paquete <package>autotools-dev</package> permite mantener versiones actualizadas de los archivos autoconf y automake y tiene documentación para usar eficientemente ese tipo de archivos.
fr: <package>autoconf</package>, <package>automake</package> et <package>autotools-dev</package> &mdash; beaucoup de nouveaux programmes utilisent des scripts de configuration et des fichiers <file>Makefile</file> prétraités à l'aide de programmes comme ceux-ci (voir « <tt>info autoconf</tt> », « <tt>info automake</tt> »). <package>autotools-dev</package> conserve les versions à jour de certains de ses fichiers automatiques et fournit une documentation sur la meilleure façon d'utiliser ces fichiers ;
it: <package>autoconf</package>, <package>automake</package> e <package>autotools-dev</package> - diversi programmi recenti usano script di configurazione e <file>Makefile</file> preprocessati con l'aiuto di programmi come questi. (vedere "<tt>info autoconf</tt>", "<tt>info automake</tt>") <package>autotools-dev</package> tiene aggiornate le versioni di alcuni file di automazione e contiene la documentazione che spiega il modo migliore per utilizzare questi file.
ja: <package>autoconf</package> と <package>automake</package> と <package>autotools-dev</package> - 多くの新しいプログラムが、これらのプログラムを使って前処理される設定スクリプトや <file>Makefile</file> を利用しています。 (詳しくは "<tt>info autoconf</tt>", "<tt>info automake</tt>" を参照)。 <package>autotools-dev</package> には、特定の auto ファイルの最新版と、 そういったファイルを使う最善の方法についてのドキュメントが含まれています。
zh_cn: <package>autoconf</package>、<package>automake</package> 和 <package>autotools-dev</package> - 很多新程序使用 configure 脚本和 <file>Makefile</file> 文件来帮助预处理程序。(参看 "<tt>info autoconf</tt>"、"<tt>info automake</tt>")。 <package>autotools-dev</package> 则用于保持指定的自动配置文件为最新，并带有关于使用那些文件的最佳方法的文档。
zh_tw: <package>autoconf</package>、<package>automake</package> 和 <package>autotools-dev</package> - 很多新程式使用 configure 腳本和 <file>Makefile</file> 檔案來幫助預處理程式。(參考 "<tt>info autoconf</tt>"、"<tt>info automake</tt>")。 <package>autotools-dev</package> 則用於保持指定的自動設定檔案爲最新，並帶有關於使用那些檔案的最佳方法的文件。

source: <package>dh-make</package> and <package>debhelper</package> - <package>dh-make</package> is necessary to create the skeleton of our example package, and it will use some of the <package>debhelper</package> tools for creating packages. They are not essential for creation of packages, but are <em>highly</em> recommended for new maintainers. It makes the whole process very much easier to start, and control afterwards. (see <manref section="1" name="dh_make">, <manref section="1" name="debhelper">, <file>/usr/share/doc/debhelper/README</file>) <footnote><p>There are few similar but specialized packages such as <package>dh-make-perl</package>, <package>dh-make-php</package>, etc. </p></footnote>
ca: <package>dh-make</package> i <package>debhelper</package> - <package>dh-make</package> es fa servir en la construcció de l'esquelet dels paquets, i es faran servir algunes eines de <package>debhelper</package> per construir alguns paquets. Tot i que no són imprescindibles per a la construcció de paquets és del <em>tot</em> recomanable per als nous desenvolupadors. Faciliten molt el procés de construcció inicial així com el manteniment posterior (llegiu <manref section="1" name="dh_make">, <manref section="1" name="debhelper">, <file>/usr/share/doc/debhelper/README</file>) <footnote><p>Hi ha d'altres paquets semblants pel que fa a la seva funcionalitat però més específics, com és ara <package>dh-make-perl</package>, <package>dh-make-php</package>, etc. </p></footnote>.
es: <package>dh-make</package> y <package>debhelper</package> - <package>dh-make</package> es necesario para construir el esqueleto de nuestro paquete ejemplo, y se usarán algunas de las herramientas de <package>debhelper</package> para construir los paquetes. Aunque no son imprescindibles para la construcción de paquetes se recomiendan <em>encarecidamente</em> para nuevos desarrolladores. Hacen el proceso mucho más fácil al principio, y más fácil de controlar en el futuro (véase <manref section="1" name="dh_make">, <manref section="1" name="debhelper">, <file>/usr/share/doc/debhelper/README</file>)<footnote><p>Hay varios paquetes similares pero más específicos como <package>dh-make-perl</package>, <package>dh-make-php</package>, etc. </p></footnote>.
fr: <package>dh-make</package> et <package>debhelper</package> &mdash; <package>dh-make</package> est nécessaire pour créer le squelette de notre exemple de paquet et il utilise certains outils de <package>debhelper</package> pour créer les paquets. Ils ne sont pas indispensables pour la création des paquets, mais ils sont <em>fortement</em> recommandés pour les nouveaux responsables. Ils rendent le processus complet bien plus facile à démarrer et à contrôler par la suite (voir <manref section="1" name="dh_make">, <manref section="1" name="debhelper"> et <file>/usr/share/doc/debhelper/README</file>) <footnote><p>Il y a d'autres paquets similaires mais spécialisés comme <package>dh-make-perl</package>, <package>dh-make-php</package>, etc.</p></footnote> ;
ja: <package>dh-make</package> と <package>debhelper</package> - <package>dh-make</package> はパッケージのひな型を用意するのに必要となります。またこのひな型ではパッケージを生成するために <package>debhelper</package> ツールをいくつか使います。これらを使わなくてもパッケージ作成は可能ですが、初めてパッケージを作る方には利用を<em>強く</em>お勧めします。パッケージを作るのも、以後パッケージを管理するのもずっと簡単になるからです。 (詳しくは <manref section="1" name="dh_make">、<manref section="1" name="debhelper">、<file>/usr/share/doc/debhelper/README</file> を参照) <footnote><p><package>dh-make-perl</package>、<package>dh-make-php</package>などのように、同様ではありますが、特定目的に特化したパッケージもわずかにあります。</p></footnote>
zh_cn: <package>dh-make</package> 和 <package>debhelper</package> - <package>dh-make</package> 是用于创建我们示例软件包骨架所必须的，它会使用 <package>debhelper</package> 中的一些工具来创建软件包。他们不是创建软件包所必须的，但对新维护人员而言，我们 <em>强烈推荐</em> 使用。它使得整个过程极为简化，并易于在将来维护。(参看 <manref section="1" name="dh_make">、<manref section="1" name="debhelper">、<file>/usr/share/doc/debhelper/README</file>) <footnote><p>还有几个类似但更针对某一类软件的软件包，如 <package>dh-make-perl</package>、<package>dh-make-php</package> 等。 </p></footnote>
zh_tw: <package>dh-make</package> 和 <package>debhelper</package> - <package>dh-make</package> 是用於創建我們範例套件骨架所必須的，它會使用 <package>debhelper</package> 中的一些工具來創建套件。他們不是創建套件所必須的，但對新維護人員而言，我們 <em>強烈推薦</em> 使用。它使得整個過程極爲簡化，並易於在將來維護。(參考 <manref section="1" name="dh_make">、<manref section="1" name="debhelper">、<file>/usr/share/doc/debhelper/README</file>) <footnote><p>還有幾個類似但更針對某一類軟體的套件，如 <package>dh-make-perl</package>、<package>dh-make-php</package> 等。 </p></footnote>

source: <package>devscripts</package> - this package contains some nice and useful scripts that can be helpful to the maintainers, but they are also not necessary for building packages. Packages recommended and suggested by this package are worth looking into. (see <file>/usr/share/doc/devscripts/README.gz</file>)
ca: <package>devscripts</package> - aquest paquet conté alguns guions útils per als desenvolupadors, però no són necessaris en la construcció de paquets. ﻿Val la pena mirar els paquets recomanats i suggerits per aquest paquet (llegeix <file>/usr/share/doc/devscripts/README.gz</file>).
es: <package>devscripts</package> - este paquete contiene algunos guiones útiles para los desarrolladores, pero no son necesarios para construir paquetes. Vale la pena mirar los paquetes recomendados y sugeridos por este paquete (véase <file>/usr/share/doc/devscripts/README.gz</file>).
fr: <package>devscripts</package> &mdash; ce paquet contient de jolis scripts utiles pouvant aider les responsables, mais ils ne sont pas indispensables pour la création de paquets. Les paquets recommandés et suggérés par celui-ci valent le coup d'&oelig;il (voir <file>/usr/share/doc/devscripts/README.gz</file>) ;
it: <package>devscripts</package> - questo pacchetto contiene alcuni pratici script che possono essere utili ai maintainer, anche se non sono strettamente necessari per la creazione dei pacchetti. I pacchetti consigliati o suggeriti da questo pacchetto andrebbero presi in considerazione. (vedere <file>/usr/share/doc/devscripts/README.gz</file>)
ja: <package>devscripts</package> - このパッケージはメンテナにとって便利であると思われる有用で優れたスクリプトを含んでいますが、だからといってパッケージを作成するために必須というわけではありません。このパッケージが推奨 (Recommends)、あるいは提案 (Suggests) しているパッケージは、一見の価値があります。(詳しくは <file>/usr/share/doc/devscripts/README.gz</file> を参照)
zh_cn: <package>devscripts</package> - 此软件包提供了一些非常好非常有用的脚本帮助维护者，但他们并非构建软件包所必须。此软件包所推荐或建议的软件包都值得一看。(参看 <file>/usr/share/doc/devscripts/README.gz</file>)
zh_tw: <package>devscripts</package> - 此套件提供了一些非常好非常有用的腳本幫助維護者，但他們並非構建套件所必須。此套件所推薦或建議的套件都值得一看。(參考 <file>/usr/share/doc/devscripts/README.gz</file>)

source: <package>fakeroot</package> - this utility lets you emulate being root which is necessary for some parts of the build process. (see <manref section="1" name="fakeroot">)
ca: <package>fakeroot</package> - aquesta utilitat permet simular l'usuari administrador (usuari «root»), la qual cosa és necessària per a algunes etapes del procés de construcció de paquets (llegeix <manref section="1" name="fakeroot">).
es: <package>fakeroot</package> - esta utilidad te permite emular al usuario administrador (o «root», N. del T.), lo cual es necesario para ciertas partes del proceso de construcción (véase <manref section="1" name="fakeroot">).
fr: <package>fakeroot</package> &mdash; cet utilitaire vous laisse prétendre être le superutilisateur, ce qui est nécessaire pour certaines parties du processus de construction (voir <manref section="1" name="fakeroot">) ;
it: <package>fakeroot</package> - questo programma permette di fingere di essere root, dato che è necessario per l'esecuzione di alcune parti del processo di creazione del pacchetto. (vedere <manref section="1" name="fakeroot">)
ja: <package>fakeroot</package> - このユーティリティを使うと、ビルドの過程で何度か必要となる root 権限をエミュレートすることができます。(詳しくは <manref section="1" name="fakeroot"> を参照)
zh_cn: <package>fakeroot</package> - 这个工具集使你可以在编译过程中必要的时候用普通用户模拟 root 用户环境。(参看 <manref section="1" name="fakeroot">)
zh_tw: <package>fakeroot</package> - 這個工具集使你可以在編譯過程中必要的時候用普通用戶模擬 root 用戶環境。(參考 <manref section="1" name="fakeroot">)

source: <package>gnupg</package> - a tool that enables you to digitally <em>sign</em> packages. This is especially important if you want to distribute it to other people, and you will certainly be doing that when your work gets included in the Debian distribution. (see <manref section="1" name="gpg">)
ca: <package>gnupg</package> - eina que es fa servir per a la <em>signatura digital</em> dels paquets. Cal signar els paquets per tal de distribuir-los i és imprescindible per ﻿incloure'ls en el repositori Debian (llegeix <manref section="1" name="gpg">).
es: <package>gnupg</package> - herramienta que te permite <em>firmar</em> digitalmente los paquetes. Esto es especialmente importante si quieres distribuir tu paquete a otras personas, y ciertamente, tendrás que hacerlo cuando tu trabajo vaya a incluirse en la distribución de Debian (véase <manref section="1" name="gpg">).
fr: <package>gnupg</package> &mdash; un outil qui vous permet de <em>signer</em> numériquement les paquets. Ceci est spécialement important si vous comptez les distribuer à d'autres personnes, et c'est certainement ce que vous ferez quand votre travail sera inclus dans la distribution Debian (voir <manref section="1" name="gpg">) ;
it: <package>gnupg</package> - questo programma consente di <em>firmare</em> elettronicamente i pacchetti. Questo è importante soprattutto se si vuole distribuirli ad altre persone, e verrà sicuramente fatto quando un pacchetto sarà pronto per essere incluso nella distribuzione Debian. (vedere <manref section="1" name="gpg">)
ja: <package>gnupg</package> - このツールを使うと、パッケージに「デジタル <em>署名</em>」を付けることができます。もしあなたが自分の作成したパッケージを他の人々に配布したいのなら、これは特に重要です。また、Debian ディストリビューションにあなたの作成したパッケージが含まれるようになった時には、確実にこのデジタル署名をすることになります。(詳しくは <manref section="1" name="gpg"> 参照)
zh_cn: <package>gnupg</package> - 使你可以使用 <em>数字签名</em> 签署你的软件包。这在当你想把它分发给其他人时特别重要。如果你要把你的工作加入到 Debian 发行版中，这是必须的步骤。(参看 <manref section="1" name="gpg">)
zh_tw: <package>gnupg</package> - 使你可以使用 <em>數位簽章</em> 簽署你的套件。這在當你想把它散佈給其他人時特別重要。如果你要把你的工作加入到 Debian 發行版中，這是必須的步驟。(參考 <manref section="1" name="gpg">)

source: <package>gfortran</package> - the GNU Fortran 95 compiler, necessary if your program is written in Fortran. (see <manref section="1" name="gfortran">)
ca: <package>gfortran</package> - el compilador GNU per a Fortran 95, necessari si el programa està escrit en Fortran (llegeix <manref section="1" name="gfortran">).
es: <package>gfortran</package> - el compilador GNU de Fortran 95, necesario si el programa está escrito en Fortran (véase <manref section="1" name="gfortran">).
fr: <package>gfortran</package> &mdash; le compilateur Fortran 95 de GNU, nécessaire si votre programme est écrit en Fortran (voir <manref section="1" name="gfortran">) ;
it: <package>gfortran</package> - il compilatore GNU Fortran 95, necessario se il programma è scritto in Fortran. (vedere <manref section="1" name="gfortran">)
ja: <package>gfortran</package> - GNU Fortran 95 コンパイラ。あなたのプログラムが Fortran 言語で書かれている場合に必要です。(詳しくは <manref section="1" name="gfortran"> 参照)
zh_cn: <package>gfortran</package> - GNU Fortran 95 编译器，如果你的程序是用 Fortran 编写的则必须此软件包完成编译。(参看 <manref section="1" name="gfortran">)
zh_tw: <package>gfortran</package> - GNU Fortran 95 編譯器，如果你的程式是用 Fortran 編寫的則必須此套件完成編譯。(參考 <manref section="1" name="gfortran">)

source: <package>gpc</package> - the GNU Pascal compiler, necessary if your program is written in Pascal. Worthy of note here is <package>fp-compiler</package>, the Free Pascal Compiler, which is also good at this task. (see <manref section="1" name="gpc">, <manref section="1" name="ppc386">)
ca: <package>gpc</package> - el compilador GNU de Pascal, necessari si el programa fa servir aquest llenguatge. També hi ha el compilador <package>fp-compiler</package>, de codi lliure per a Pascal (llegeix <manref section="1" name="gpc"> i <manref section="1" name="ppc386">).
es: <package>gpc</package> - el compilador GNU de Pascal, necesario si el programa está escrito en Pascal. Merece la pena mencionar aquí <package>fp-compiler</package>, un compilador libre de Pascal, que también es bueno en esta tarea (véase <manref section="1" name="gpc">, <manref section="1" name="ppc386">).
fr: <package>gpc</package> &mdash; le compilateur Pascal de GNU, nécessaire si votre programme est écrit en Pascal. Mérite d'être mentionné ici, <package>fp-compiler</package>, le compilateur pascal libre, convient également (voir <manref section="1" name="gpc">, <manref section="1" name="ppc386">) ;
it: <package>gpc</package> - il compilatore GNU Pascal, necessario se il programma è scritto in Pascal. Un sostituto degno di nota è <package>fp-compiler</package>, il Compilatore Free Pascal. (vedere <manref section="1" name="gpc">, <manref section="1" name="ppc386">)
ja: <package>gpc</package> - GNU Pascal コンパイラ。あなたのプログラムが Pascal 言語で書かれている場合に必要です。ここで注目に値するのは <package>fp-compiler</package> Free Pascal コンパイラで、こちらもまたこの作業に適しています。(詳しくは <manref section="1" name="gpc">、 <manref section="1" name="ppc386"> 参照)
zh_cn: <package>gpc</package> - GNU Pascal 编译器。如果你的程序是用 Pascal 写的则需要此软件包。值得一提的是 <package>fp-compiler</package>，Free Pascal 编译器(FPC)，也能够很好地胜任。(参看 <manref section="1" name="gpc">、<manref section="1" name="ppc386">)
zh_tw: <package>gpc</package> - GNU Pascal 編譯器。如果你的程式是用 Pascal 寫的則需要此套件。值得一提的是 <package>fp-compiler</package>，Free Pascal 編譯器(FPC)，也能夠很好地勝任。(參考 <manref section="1" name="gpc">、<manref section="1" name="ppc386">)

source: <package>xutils-dev</package> - some programs, usually those made for X11, also use these programs to generate <file>Makefile</file> files from sets of macro functions. (see <manref section="1" name="imake">, <manref section="1" name="xmkmf">)
ca: <package>xutils-dev</package> - alguns programes, si més no els escrits per a X11, fan servir aquest paquet per generar fitxers <file>Makefile</file> executant conjunts de funcions macro (llegeix <manref section="1" name="imake"> i <manref section="1" name="xmkmf">).
es: <package>xutils-dev</package> - algunos programas, normalmente aquellos hechos para X11, también usan programas para generar <file>Makefile</file> ejecutando un conjunto de funciones de macro (véase <manref section="1" name="imake">, <manref section="1" name="xmkmf">).
fr: <package>xutils-dev</package> &mdash; certains programmes, d'ordinaire ceux conçus pour X11, utilisent aussi ces programmes pour générer les fichiers <file>Makefile</file> à partir d'un ensemble de fonctions macros (voir <manref section="1" name="imake">, <manref section="1" name="xmkmf">) ;
it: <package>xutils-dev</package> - alcuni programmi, generalmente quelli fatti per X11, usano questi strumenti per generare i <file>Makefile</file> da una serie di funzioni macro. (vedere <manref section="1" name="imake">, <manref section="1" name="xmkmf">)
ja: <package>xutils-dev</package> - ある種のプログラム (通常 X11のために開発されたもの) は、これらのプログラムを利用して、マクロ関数の組み合わせから <file>Makefile</file> 群を生成します。(詳しくは <manref section="1" name="imake">、 <manref section="1" name="xmkmf"> 参照)
zh_cn: <package>xutils-dev</package> - 一些通常用于 X11 的程序，用于使用其宏功能生成 <file>Makefile</file> 文件。(参看 <manref section="1" name="imake">、<manref section="1" name="xmkmf">)
zh_tw: <package>xutils-dev</package> - 一些通常用於 X11 的程式，用於使用其宏功能生成 <file>Makefile</file> 檔案。(參考 <manref section="1" name="imake">、<manref section="1" name="xmkmf">)
