Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: In the <file>debian/source/format</file> file, there should be a single line indicating the desired format for the source package (check <manref section="1" name="dpkg-source"> for an exhaustive list). After <tt>squeeze</tt>, it should say either:
ca: El fitxer <file>debian/source/format</file>, només conté una línia que indica el format de construcció del paquet (consulta <manref section="1" name="dpkg-source"> on hi ha la llista completa). Després de <tt>squeeze</tt> hauria de ser:
es: El archivo <file>debian/source/format</file>, solo contendrá una línea indicando el formato deseado para el paquete (véase <manref section="1" name="dpkg-source"> para consultar la lista completa). Después de <tt>squeeze</tt> debería ser:
fr: Dans le fichier <file>debian/source/format</file>, il devrait y avoir une seule ligne indiquant le format voulu du paquet source (vérifier en <manref section="1" name="dpkg-source"> pour une liste exhaustive). Après <tt>Squeeze</tt>, il devrait contenir selon les cas :
it: Nel file <file>debian/source/format</file>, ci dovrebbe essere una unica riga che indichi il formato desiderato per il pacchetto sorgente (controllare <manref section="1" name="dpkg-source"> per una lista completa). Dopo <tt>squeeze</tt>, dovrebbe scrivere:
ja: <file>debian/source/format</file>ファイルでは、ソースパッケージのための理想の書式を示すための行があります。 (完全なリストは、<manref section="1" name="dpkg-source">を参照してください。)<tt>squeeze</tt>以降は、以下のどちらかになっているべきです。
zh_cn: 在 <file>debian/source/format</file> 中只包含一行，写明了此源代码包的格式(查看 <manref section="1" name="dpkg-source"> 获得完整列表)。在 <tt>squeeze</tt> 后，它应该是以下二者之一：
zh_tw: 在 <file>debian/source/format</file> 中只包含一行，寫明瞭此原始碼包的格式(查看 <manref section="1" name="dpkg-source"> 獲得完整列表)。在 <tt>squeeze</tt> 後，它應該是以下二者之一：

source: <tt>3.0 (native)</tt> for Debian native packages or
ca: <tt>3.0 (native)</tt> per a paquets nadius de Debian o
es: <tt>3.0 (native)</tt> para paquetes nativos de Debian
fr: <tt>3.0 (native)</tt> pour les paquets Debian natifs ;
ja: <tt>3.0 (native)</tt>： Debianネイティブなパッケージ
zh_cn: <tt>3.0 (native)</tt> - Debian native 软件
zh_tw: <tt>3.0 (native)</tt> - Debian native 軟體

source: <tt>3.0 (quilt)</tt> for everything else.
ca: <tt>3.0 (quilt)</tt> per als altres paquets.
es: <tt>3.0 (quilt)</tt> para el resto de paquetes.
fr: <tt>3.0 (quilt)</tt> pour tout le reste.
ja: <tt>3.0 (quilt)</tt>： それ以外の全て。
zh_cn: <tt>3.0 (quilt)</tt> - 其他所有软件
zh_tw: <tt>3.0 (quilt)</tt> - 其他所有軟體

source: The newer <tt>3.0 (quilt)</tt> source format records modifications in a <prgn>quilt</prgn> patch series within <file>debian/patches</file>. Those changes are then automatically applied during extraction of the source package. <footnote><p>See <url id="http://wiki.debian.org/Projects/DebSrc3.0" name="DebSrc3.0"> for the summary information concerning the switch to the new <tt>3.0 (quilt)</tt> and <tt>3.0 (native)</tt> source formats.</p></footnote> The Debian modifications are simply stored in a <file>debian.tar.gz</file> archive containing all files under the <file>debian</file> directory. This new format supports inclusion of binary files such as PNG icons by the package maintainer without requiring tricks. <footnote><p>Actually, this new format also supports multiple upstream tarballs and more compression methods. These are beyond the scope of this document.</p></footnote>
ca: El nou format <tt>3.0 (quilt)</tt> registre els canvis realitzats en el paquet en fitxers de pegats <prgn>quilt</prgn> en el directori <file>debian/patches</file>. Aquests canvis s'aplique automàticament en l'extracció dels fitxers originals del paquet <footnote><p>Consulta <url id="http://wiki.debian.org/Projects/DebSrc3.0" name="DebSrc3.0"> on es resumeix la informació sobre els formats <tt>3.0 (quilt)</tt> i <tt>3.0 (native)</tt>. </p></footnote>. Les modificacions es desen en el fitxer <file>debian.tar.gz</file> que conté tots els fitxers del directori <file>debian</file> utilitzat en la construcció del paquet. El nou format permet la inclusió d'arxius com els icones PNG sense necessitat de trucs <footnote><p>Actualment, el nou format també permet treballar amb més d'un arxiu «tar» amb les fonts originals i altres sistemes de compressió. Aquestes funcions no s'expliquen en aquest document. </p></footnote>.
es: El nuevo formato <tt>3.0 (quilt)</tt> registra los cambios en series de archivos de parches <prgn>quilt</prgn> en el directorio <file>debian/patches</file>. Estos cambios se aplican automáticamente en la extracción de las fuentes del paquete <footnote><p>Véase <url id="http://wiki.debian.org/Projects/DebSrc3.0" name="DebSrc3.0"> para un resumen informativo sobre los formatos <tt>3.0 (quilt)</tt> y <tt>3.0 (native)</tt>. </p></footnote>. Las modificaciones se guardan en el archivo <file>debian.tar.gz</file> que contiene todos los archivos del directorio <file>debian</file> utilizado en la construcción del paquete. El nuevo formato permite la inclusión de archivos como los iconos PNG sin necesidad de trucos <footnote><p>Actualmente, este nuevo formato también permite trabajar con múltiples archivos «tar» fuente y otros sistemas de compresión. Estas funciones están fuera del objetivo de este documento.</p></footnote>.
fr: Le récent format source <tt>3.0 (quilt)</tt> enregistre les modifications dans un ensemble de correctifs <prgn>quilt</prgn> dans <file>debian/patches</file>. Ces changements sont alors appliqués automatiquement lors de l'extraction du paquet source. <footnote><p>Consulter <url id="http://wiki.debian.org/Projects/DebSrc3.0" name="DebSrc3.0"> pour un condensé d'informations sur la conversion des sources au formats source <tt>3.0 (quilt)</tt> et <tt>3.0 (native)</tt>.</p></footnote> Les modifications Debian sont simplement conservées dans une archive <file>debian.tar.gz</file> contenant tous les fichiers du répertoire <file>debian</file>. Ce nouveau format permet d'inclure des fichiers binaires comme des icônes PNG sans bidouillage. <footnote><p>En fait, ce nouveau format permet de gérer des archives amont multiples et plusieurs méthodes de compression. Ces considérations sortent du cadre de ce document.</p></footnote>
it: Il nuovo formato sorgente <tt>3.0 (quilt)</tt> registra le modifiche in una serie di patch <prgn>quilt</prgn> all'interno di <file>debian/patches</file>. Questi cambiamenti vengono poi automaticamente applicati durante l'estrazione del pacchetto sorgente. <footnote><p>Si veda <url id="http://wiki.debian.org/Projects/DebSrc3.0" name="DebSrc3.0"> per una serie di informazioni generali riguardanti il passaggio al nuovo formato <tt>3.0 (quilt)</tt> ed ai formati sorgente <tt>3.0 (native)</tt>.</p></footnote> Le modifiche di Debian sono semplicemente mantenute in un archivio <file>debian.tar.gz</file> contenente tutti i file sotto la directory <file>debian</file>. Questo nuovo formato supporta l'inclusione di file binari come per esempio le icone PNG del manutentore del pacchetto senza richiedere trucchi.<footnote><p>Al momento questo nuovo formato supporta anche molteplici archivi e più metodi di compressione. Questi però esulano dall'obiettivo di questo documento.</p></footnote>
ja: 新しい<tt>3.0 (quilt)</tt>の書式は<prgn>quilt</prgn>パッチによる変更を <file>debian/patches</file>に記録します。そして、その変更は自動的にソースパッケージを展開するときに適用されます。<footnote><p>ソースの書式を<tt>3.0 (quilt)</tt> and <tt>3.0 (native)</tt>に移行する際の注意点などは、<url id="http://wiki.debian.org/Projects/DebSrc3.0" name="DebSrc3.0"> にまとまっています。</p></footnote>Debianの変更は、<file>debian</file>ディレクトリ以下のファイル全てを含め、<file>debian.tar.gz</file>アーカイブに保存されています。この新しい書式は、特殊な方法を用いることなく、PGNアイコンなどのパッケージメンテナによるバイナリファイルを含めることが可能です。<footnote><p>この新しいフォーマットは、複数の上流のtar玉などもっと多くの圧縮方法をサポートしています。詳細は本稿の範疇を超えるため割愛します。</p></footnote>
zh_cn: 全新的 <tt>3.0 (quilt)</tt> 源代码格式将所有修改使用 <prgn>quilt</prgn> 补丁系列记录到 <file>debian/patches</file>。这些修改会在解压源代码包时自动应用。<footnote><p>参看 <url id="http://wiki.debian.org/Projects/DebSrc3.0" name="DebSrc3.0"> 了解转换到新的 <tt>3.0 (quilt)</tt> 和 <tt>3.0 (native)</tt> 源代码格式时的总结考虑。</p></footnote> Debian 修改保存于 <file>debian.tar.gz</file> 归档文件，其中包含了整个 <file>debian</file> 目录。这个新格式支持直接添加例如 PNG 图标等的二进制文件。<footnote><p>实际上新格式还支持多个上游 tarball 和更多的压缩方法，但这已超出本文档讲述的范围。</p></footnote>
zh_tw: 全新的 <tt>3.0 (quilt)</tt> 原始碼格式將所有修改使用 <prgn>quilt</prgn> 補丁系列記錄到 <file>debian/patches</file>。這些修改會在解壓原始碼包時自動應用。<footnote><p>參考 <url id="http://wiki.debian.org/Projects/DebSrc3.0" name="DebSrc3.0"> 瞭解轉換到新的 <tt>3.0 (quilt)</tt> 和 <tt>3.0 (native)</tt> 原始碼格式時的總結考慮。</p></footnote> Debian 修改保存於 <file>debian.tar.gz</file> 壓縮檔，其中包含了整個 <file>debian</file> 目錄。這個新格式支持直接添加例如 PNG 圖示等的二進位檔案。<footnote><p>實際上新格式還支持多個上游 tarball 和更多的壓縮方法，但這已超出本文件講述的範圍。</p></footnote>

source: When <prgn>dpkg-source</prgn> extracts a source package in <tt>3.0 (quilt)</tt> source format, it automatically applies all patches listed in <file>debian/patches/series</file>. You can avoid applying patches at the end of the extraction with the <tt>--skip-patches</tt> option.
ca: Quan <prgn>dpkg-source</prgn> extreu un paquet amb les fonts amb el format <tt>3.0 (quilt)</tt>, automàticament s'apliquen tots els pegats llistats en l'arxiu <file>debian/patches/series</file>. Això ho pots evitar amb l'opció <tt>--skip-patches</tt>.
es: Cuando <prgn>dpkg-source</prgn> extrae un paquete fuente con el formato <tt>3.0 (quilt)</tt>, automáticamente aplica todos los parches listados en el archivo <file>debian/patches/series</file>. Puedes evitar la ejecución de los parches al final de la extracción con la opción <tt>--skip-patches</tt>.
fr: Quand <prgn>dpkg-source</prgn> extrait un paquet source au format <tt>3.0 (quilt)</tt>, il applique automatiquement tous les correctifs énumérés dans <file>debian/patches/series</file>. Vous pouvez éviter que les correctifs soient appliqués à la fin de l'extraction avec l'option <tt>--skip-patches</tt>.
it: Quando <prgn>dpkg-source</prgn> estrae un pacchetto sorgente nel formato <tt>3.0 (quilt)</tt>, applica automaticamente tutte le patch elencate nel file <file>debian/patches/series</file>. Si può evitare di applicare le patch alla fine dell'estrazione con l'opzione <tt>--skip-patches</tt>.
ja: <prgn>dpkg-source</prgn>が<tt>3.0 (quilt)</tt>の書式でソースパッケージを展開する際、<file>debian/patches/series</file>に列挙されたパッチを自動的に適用します。<tt>--skip-patches</tt>オプションで、展開時にパッチを適用しないようにできます。
zh_cn: <prgn>dpkg-source</prgn> 解压 <tt>3.0 (quilt)</tt> 格式的源码包时会自动应用所有列于 <file>debian/patches/series</file> 的补丁。你可以使用 <tt>--skip-patches</tt> 选项避免在解压后自动应用补丁。
zh_tw: <prgn>dpkg-source</prgn> 解壓 <tt>3.0 (quilt)</tt> 格式的源碼包時會自動應用所有列於 <file>debian/patches/series</file> 的補丁。你可以使用 <tt>--skip-patches</tt> 選項避免在解壓後自動應用補丁。

source: <file>source/local-options</file> file
ca: Fitxer <file>source/local-options</file>.
es: Archivo <file>source/local-options</file>
ja: <file>source/local-options</file> ファイル
zh_cn: <file>source/local-options</file> 文件

source: When you want to manage Debian packaging activities under a VCS, you typically create one branch (e.g. <tt>upstream</tt>) tracking the upstream source and another branch (e.g. typically <tt>master</tt> for Git) tracking the Debian package. For the latter, you usually want to have unpatched upstream source with your <file>debian/*</file> files for the Debian packaging to ease merging of the new upstream source.
ca: Si has de gestionar els treballs d'empaquetament a un entorn VCS, segurament tindràs una branca (p. ex. <tt>upstream</tt>) per a les fonts originals i una altra (p. ex. normalment <tt>master</tt> en Git) per al paquet Debian. Si és així, tindràs les fonts originals sense modificar (sense aplicar els pegats) amb els fitxers <file>debian/*</file> per l'empaquetament Debian per fusionar-les amb les noves versions de les fonts.
es: Si deseas gestionar los trabajos de empaquetado en un entorno VCS, seguramente tendrás una rama (p.ej. <tt>upstream</tt>) que sigue las fuentes originales y otra rama (p.ej. normalmente <tt>master</tt> en Git) para el paquete Debian. Para este último caso, generalmente tendrás las fuentes originales sin modificar (sin aplicarles los parches) con los archivos <file>debian/*</file> para el empaquetamiento Debian para facilitar la fusión con las nuevas versiones de las fuentes.
ja: Debianをパッケージングする活動をVCSで管理したい場合、上流のソースをトラックするためのブランチ(例 <tt>upstream</tt>)とDebianパッケージをトラックするための別のブランチ(例 Gitのための<tt>master</tt>)を作成します。後者の場合、新しい上流のソースとマージするのを簡単にするために、通常パッチの当てていない上流のソースを<file>debian/*</file>ファイルと一緒に持っておきます。
zh_cn: 如果你希望使用版本控制系统(VCS)时，你可以创建一个分支(例如叫做 <tt>upstream</tt>) 来跟踪上游代码(对于 Git 而言典型的是 <tt>master</tt> 分支)，和另一个分支来跟踪你的 Debian 软件包。对于后者，通常会将未应用补丁的上游代码和你的 <file>debian/*</file> 文件放在一起以便容易合并上游的新代码。

source: After you build a package, the source is normally left patched. You need to unpatch it manually by running "<tt>quilt pop -a</tt>" before committing to the <tt>master</tt> branch. You can automate this by adding the optional <file>debian/source/local-options</file> file containing "<tt>unapply-patches</tt>". This file is not included in the generated source package and changes the local build behavior only. This file may contain "<tt>abort-on-upstream-changes</tt>", too (see <manref section="1" name="dpkg-source">).
ca: Un cop compilat el paquet, els pegats s'hauran aplicat a les fonts. Hauràs de desfer els pegats executant <tt>quilt pop -a</tt> abans de sincronitzar-les amb la branca <tt>master</tt>. Pots automatitzar aquesta tasca afegint l'arxiu opcional <file>debian/source/local-options</file> el contingut del qual serà <tt>unapply-patches</tt>. Aquest arxiu no s'inclou en el paquet font generat i únicament canvia l'entorn local de construcció. Aquest fitxer també pot contenir la línia <tt>abort-on-upstream-changes</tt> (consulta <manref section="1" name="dpkg-source">).
es: Una vez compilado el paquete, las fuentes estarán parcheadas. Deberás deshacer los parches manualmente ejecutando <tt>quilt pop -a</tt> antes de sincronizar con la rama <tt>master</tt>. Puedes automatizar esto añadiendo el archivo opcional <file>debian/source/local-options</file> cuyo contenido será «<tt>unapply-patches</tt>». Este archivo no se incluye en el paquete fuente generado y sólo cambia el entorno local de compilación. Este archivo también puede contener la línea «<tt>abort-on-upstream-changes</tt>» (véase <manref section="1" name="dpkg-source">).
ja: パッケージをビルドした後は、ソースのパッチは当てたままにされます。なので、<tt>master</tt>ブランチにコミットする前に"<tt>quilt pop -a</tt>"でパッチを外さなければなりません。<file>debian/source/local-options</file>ファイルに"<tt>unapply-patches</tt>"を書いておけば、自動的にパッチを外せます。このファイルは生成されたソースパッケージには含まれず、ローカルビルドでの挙動のみを変更します。このファイルは"<tt>abort-on-upstream-changes</tt>"も含むかもしれません。(参照 <manref section="1" name="dpkg-source">).
zh_cn: 在编译软件包之后，源代码通常会被保持在应用补丁后的状态。你需要手工执行 <tt>quilt pop -a</tt> 来解除这些补丁，然后再提交到 <tt>master</tt> 分支。你可以向 <file>debian/source/local-options</file> 文件里添加一行 <tt>unapply-patches</tt> 来自动实现此目的。这个文件不会被加入到生成的源代码包，它只影响本地的编译构建行为。这个文件里还可以包含 <tt>abort-on-upstream-changes</tt> (参看 <manref section="1" name="dpkg-source">)。

source: <file>patches/*</file> files
ca: Fitxers <file>patches/*</file>.
es: Archivos <file>patches/*</file>
fr: Fichiers <file>patches/*</file>
it: I file <file>patches/*</file>
ja: <file>patches/*</file> ファイル群
zh_cn: <file>patches/*</file> 文件
zh_tw: <file>patches/*</file> 檔案

source: The old <tt>1.0</tt> source format created a single large <file>diff.gz</file> file which contains package maintenance files in <file>debian</file> and patch files to the source. Such a package is a bit cumbersome to inspect and understand for each source tree modification later. This is not so nice.
ca: L'antic format <tt>1.0</tt> construïa un arxiu <file>diff.gz</file> amb el contingut dels fitxers de construcció del paquet del directori <file>debian</file> i els canvis a realitzar en les fonts. Aquest format per conservar els canvis era una mica enutjós quan es tractava d'inspeccionar i entendre cada modificació de les fonts. Ja no és eficaç.
es: El antiguo formato <tt>1.0</tt> construía un archivo <file>diff.gz</file> cuyo contenido era el de los archivos de construcción del paquete del directorio <file>debian</file> así como los cambios a realizar en las fuentes. Este formato para conservar los cambios resultaba engorroso cuando se trataba de inspeccionar y entender cada modificación de las fuentes. Ya no resulta eficaz.
fr: L'ancien format source <tt>1.0</tt> créait un unique et gros fichier <file>diff.gz</file> avec les fichiers de maintenance de paquet dans <file>debian/</file> et les correctifs. Un tel paquet est un peu délicat à inspecter et à comprendre pour chaque modification de l'arbre source par la suite. Ce n'est pas conseillé.
it: Il vecchio formato sorgente <tt>1.0</tt> creava un singolo, grosso file <file>diff.gz</file> file che conteneva tutti i file di manutenzione del pacchetto che stavano in <file>debian</file> ed i file di patch del sorgente. Un pacchetto così è un poco ingombrante da ispezionare per capire successivamente la sequenza delle modifiche. Per questo tale formato non è considerato soddisfacente.
ja: 古い<tt>1.0</tt>のソースフォーマットは、<file>debian</file>内にパッケージメンテナンスファイルと、パッチファイルを含む単一の大きな<file>diff.gz</file>ファイルを作っていました。そのようなファイルは、ソースツリーの変更を後から調べたり、理解するのが非常に厄介でした。これはあまりいただけません。
zh_cn: 旧的 <tt>1.0</tt> 源代码包格式使用单一的大 <file>diff.gz</file> 文件保存 <file>debian</file> 文件夹和补丁。这样的软件包比较难于在事后检查和分析。这不是很好。
zh_tw: 舊的 <tt>1.0</tt> 原始碼包格式使用單一的大 <file>diff.gz</file> 檔案保存 <file>debian</file> 檔案夾和補丁。這樣的套件比較難於在事後檢查和分析。這不是很好。

source: The newer <tt>3.0 (quilt)</tt> source format stores patches in <file>debian/patches/*</file> files using the <prgn>quilt</prgn> command. These patches and other package data which are all constrained under the <file>debian</file> directory are packaged as the <file>debian.tar.gz</file> file. Since the <prgn>dpkg-source</prgn> command can handle <prgn>quilt</prgn> formatted patch data in the <tt>3.0 (quilt)</tt> source without the <package>quilt</package> package, it does not need to <tt>Build-Depends</tt> on the <package>quilt</package> package. <footnote><p>Several methods for the patch set maintenance have been proposed and are in use with Debian packages. The <prgn>quilt</prgn> system is the preferred maintenance system in use. Other ones are <prgn>dpatch</prgn>, <prgn>dbs</prgn>, <prgn>cdbs</prgn>, etc. Many of these keep such patches as <file>debian/patches/*</file> files.</p></footnote>
ca: El nou format <tt>3.0 (quilt)</tt> de les fonts, desa les modificacions (els pegats) a fer als fitxers en el directori <file>debian/patches/*</file> fent servir l'ordre <prgn>quilt</prgn>. Aquests pegats i altres dades del paquet ubicats en el directori <file>debian</file> es conserven en el fitxer <file>debian.tar.gz</file>. Des que l'ordre <prgn>dpkg-source</prgn> pot aplicar els pegats a les fonts amb el nou format <tt>3.0 (quilt)</tt> sense el paquet <package>quilt</package>, no és necessari afegir el paquet <package>quilt</package> en el camp <tt>Build-Depends</tt> del fitxer <file>control</file> <footnote><p>Es fan servir altres mètodes d'aplicació de pegats a Debian. El sistema <prgn>quilt</prgn> és el recomanat. Altres sistemes són <prgn>dpatch</prgn>, <prgn>dbs</prgn>, <prgn>cdbs</prgn>, etc. La majoria d'ells conserven els pegats en fitxers en el directori <file>debian/patches</file>. </p></footnote>.
es: El nuevo formato <tt>3.0 (quilt)</tt> de las fuentes, guarda las modificaciones (los parches) en archivos en el directorio <file>debian/patches/*</file> utilizando la orden <prgn>quilt</prgn>. Estos parches y otros datos del paquete que están en el directorio <file>debian</file> se conservan en el archivo <file>debian.tar.gz</file>. Desde que la orden <prgn>dpkg-source</prgn> puede aplicar los parches en las fuentes con el nuevo formato tipo <tt>3.0 (quilt)</tt> sin el paquete <package>quilt</package>, no es necesario añadir el paquete <package>quilt</package> en el campo <tt>Build-Depends</tt> del fichero <file>control</file> <footnote><p>Se han propuesto y se están utilizando otros métodos de aplicación de los parches en Debian. El sistema <prgn>quilt</prgn> es el preferido. Otros sistemas son <prgn>dpatch</prgn>, <prgn>dbs</prgn>, <prgn>cdbs</prgn>, etc. La mayoría de ellos conservan los parches en archivos en el directorio <file>debian/patches</file>. </p></footnote>.
fr: Le nouveau format source <tt>3.0 (quilt)</tt> conserve les correctifs dans les fichiers <file>debian/patches/*</file> en utilisant la commande <prgn>quilt</prgn>. Ces correctifs et les autres données de paquet qui sont toutes contenues dans le répertoire <file>debian</file> sont empaquetées dans le fichier <file>debian.tar.gz</file>. Puisque la commande <prgn>dpkg-source</prgn> peut gérer les correctifs des sources <tt>3.0 (quilt)</tt> sans le paquet <package>quilt</package>, il n'est pas nécessaire d'ajouter <package>quilt</package> en <tt>Build-Depends</tt>. <footnote><p>Plusieurs méthodes de maintenance des ensembles de correctifs ont été proposés et sont utilisés dans les paquets Debian. Le système <prgn>quilt</prgn> est le système de maintenance conseillé. Les autres sont <prgn>dpatch</prgn>, <prgn>dbs</prgn>, <prgn>cdbs</prgn>, etc. La plupart d'entre-eux conservent aussi les correctifs dans des fichiers <file>debian/patches/*</file>.</p></footnote>
ja: 新しい<tt>3.0 (quilt)</tt>は、<prgn>quilt</prgn>コマンドを使って、パッチを<file>debian/patches/*</file>に置きます。<file>debian</file>ディレクトリ異化に拘束されているパッチや、その他のパッケージデータは、<file>debian.tar.gz</file>ファイルとしてパッケージングされます。<prgn>dpkg-source</prgn>コマンドは、<prgn>quilt</prgn>形式のパッチデータを<package>quilt</package>パッケージなしで<tt>3.0 (quilt)</tt>として扱えるので、<tt>Build-Depends</tt>には<package>quilt</package>パッケージは必要ありません。<footnote><p>パッチセットをメンテナンスするためのいくつかの方法が提案され、Debianパッケージで使われていますが、<prgn>quilt</prgn>が推奨されています。他には、<prgn>dpatch</prgn>、<prgn>dbs</prgn>、<prgn>cdbs</prgn>、などがあります。これらの方法は、大抵<file>debian/patches/*</file>ファイルでパッチを管理しています。</p></footnote>
zh_cn: 新的 <tt>3.0 (quilt)</tt> 源代码包格式使用 <prgn>quilt</prgn> 管理 <file>debian/patches/*</file> 文件。这些补丁和其他 <file>debian</file> 目录下的文件被归档为 <file>debian.tar.gz</file> 文件。因为 <prgn>dpkg-source</prgn> 不调用 <prgn>quilt</prgn> 就可以处理 <tt>3.0 (quilt)</tt> 源码包格式的补丁，故不需要 <tt>Build-Depends</tt> 于 <package>quilt</package> 软件包。<footnote><p>有多种不同的补丁维护方式被用于 Debian 软件包中，而 <prgn>quilt</prgn> 系统则是其中的首选。其他系统还包括 <prgn>dpatch</prgn>、<prgn>dbs</prgn>、<prgn>cdbs</prgn> 等。这些中的很多也将补丁保存于 <file>debian/patches/*</file> 文件中。</p></footnote>
zh_tw: 新的 <tt>3.0 (quilt)</tt> 原始碼包格式使用 <prgn>quilt</prgn> 管理 <file>debian/patches/*</file> 檔案。這些補丁和其他 <file>debian</file> 目錄下的檔案被歸檔爲 <file>debian.tar.gz</file> 檔案。因爲 <prgn>dpkg-source</prgn> 不調用 <prgn>quilt</prgn> 就可以處理 <tt>3.0 (quilt)</tt> 源碼包格式的補丁，故不需要 <tt>Build-Depends</tt> 於 <package>quilt</package> 套件。<footnote><p>有多種不同的補丁維護方式被用於 Debian 套件中，而 <prgn>quilt</prgn> 系統則是其中的首選。其他系統還包括 <prgn>dpatch</prgn>、<prgn>dbs</prgn>、<prgn>cdbs</prgn> 等。這些中的很多也將補丁保存於 <file>debian/patches/*</file> 檔案中。</p></footnote>
