Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: Lines 12 and 13 are where all the work is done. The percent sign means any targets which then call a single program, <prgn>dh</prgn> with the target name. <footnote><p>This uses the new <package>debhelper</package> V7 features. Its design concepts are explained in <url id="http://joey.kitenet.net/talks/debhelper/debhelper-slides.pdf" name="Not Your Grandpa's Debhelper"> presented at Debconf9 by the <package>debhelper</package> upstream. Under <tt>lenny</tt>, <prgn>dh_make</prgn> created a much more complicated <file>rules</file> file with many <prgn>dh_*</prgn> scripts listed for each required explicit targets and frozen them to the state when it was initially packaged. This new <prgn>dh</prgn> command is simpler and frees us from this constrain. You still have full power to customize this with <tt>override_dh_*</tt> targets. See <ref id="customrules">. It is based only on the <package>debhelper</package> package and does not obfuscate the package building process like the <package>cdbs</package> package.</p></footnote> The <prgn>dh</prgn> command is a wrapper script which runs appropriate sequences of <prgn>dh_*</prgn> programs depending on its argument. <footnote><p>You can verify actual sequences of <prgn>dh_*</prgn> programs invoked for a given <tt><var>target</var></tt> as "<tt>dh --no-act <var>target</var></tt>" or "<tt>debian/rules -- '--no-act <var>target</var>'</tt>" without really running them.</p></footnote>
ca: Tota la feina del fitxer la fan les línies 12 i 13. El símbol de percentatge substitueix qualsevol objectiu per a continuació executar únicament <prgn>dh</prgn> amb el nom de l'objectiu (com a opció) <footnote><p>Aquí es fan servir les noves funcions de la versió 7 de <package>debhelper</package> que s'explique a <url id="http://joey.kitenet.net/talks/debhelper/debhelper-slides.pdf" name="«Not Your Grandpa's Debhelper»"> presentades a la DebConf9 per l'autor de <package>debhelper</package>. En <tt>lenny</tt>, <prgn>dh_make</prgn> construïa un arxiu <file>rules</file> més ﻿complex amb el llistat de cada ordre <prgn>dh_*</prgn> necessària per a cada objectiu i els mantenia en l'estat del empaquetament inicial. La nova ordre <prgn>dh</prgn> és més simple i ens allibera d'aquesta restricció. Tot i així, és possible personalitzar el fitxer amb objectius <tt>override_dh_*</tt>. Consulta <ref id="customrules">. Es basa únicament en el paquet <package>debhelper</package> i cal no confondre's amb la construcció de paquets feta amb <package>cdbs</package>. </p></footnote>. L'ordre <prgn>dh</prgn> és un guió que executa les ﻿seqüències necessàries d'ordres <prgn>dh_*</prgn> segons els seus paràmetres com es descriu a continuació <footnote><p>Per saber les seqüències d'ordres <prgn>dh_*</prgn> executades per a cada <tt><var>objectiu</var></tt> executa <tt>dh --no-act <var>objectiu</var></tt> o bé <tt>debian/rules -- '--no-act <var>objectiu</var>'</tt> sense que s'executin realment. </p></footnote>:
es: Todo el trabajo del archivo se reduce a las líneas 12 y 13. El símbolo de porcentaje substituye a cualquier objetivo para a continuación ejecutar únicamente <prgn>dh</prgn> con el nombre del objetivo (como opción) <footnote><p>Aquí se utilizan las nuevas funciones de la versión 7 de <package>debhelper</package> que se explican en <url id="http://joey.kitenet.net/talks/debhelper/debhelper-slides.pdf" name="«Not Your Grandpa's Debhelper»"> presentadas en la Debconf9 por el autor de <package>debhelper</package>. En <tt>lenny</tt>, <prgn>dh_make</prgn> construía un archivo <file>rules</file> más complejo con el listado de todas las órdenes <prgn>dh_*</prgn> necesarias para cada objetivo y los mantenía en el estado del empaquetado inicial. La nueva orden <prgn>dh</prgn> es simple y nos libera de esta restricción. Aún así, es posible personalizar el archivo con objetivos <tt>override_dh_*</tt>. Véase <ref id="customrules">. Se basa únicamente en el paquete <package>debhelper</package> y no complica el proceso de construcción de paquetes como el paquete <package>cdbs</package>. </p></footnote>. La orden <prgn>dh</prgn> es un guión que ejecuta las secuencias necesarias de órdenes <prgn>dh_*</prgn> según sus parámetros, como se describe a continuación <footnote><p>Puedes comprobar las secuencias de órdenes <prgn>dh_*</prgn> invocadas por cada <tt><var>objetivo</var></tt> ejecutando <tt>dh --no-act <var>objetivo</var></tt> o bien <tt>debian/rules -- '--no-act <var>objetivo</var>'</tt> sin que se ejecuten realmente. </p></footnote>:
fr: Tout le travail est réalisé aux lignes 13 et 14. Le caractère pourcent (« % ») représente toutes les cibles qui appellent alors un seul programme, <prgn>dh</prgn> avec le nom de la cible. <footnote><p>Ceci utilise les fonctionnalités du nouveau <package>debhelper</package> V7. Ses concepts fondateurs sont expliqués dans la présentation <url id="http://joey.kitenet.net/talks/debhelper/debhelper-slides.pdf" name="« Pas le debhelper de papy »"> réalisé lors de la dixième conférence Debian par l'auteur de <package>debhelper</package>. Sous <tt>Lenny</tt>, <prgn>dh_make</prgn> crée un fichier <file>rules</file> beaucoup plus compliqué avec de nombreux scripts <prgn>dh_*</prgn> énumérés pour chaque cible obligatoire explicitement et les gèle dans l'état de l'empaquetage initial. Cette nouvelle commande <prgn>dh</prgn> plus simple libère le responsable de cette contrainte. Vous gardez les pleins pouvoirs de personnalisation avec les cibles <tt>override_dh_*</tt>. Voir <ref id="customrules">. Il se base uniquement sur le paquet <package>debhelper</package> et ne rend pas obscur le processus de construction comme le paquet <package>cdbs</package>.</p></footnote> La commande <prgn>dh</prgn> est un script d'emballage qui exécute les séquences opportunes de programmes <prgn>dh_*</prgn> dépendant de ses paramètres : <footnote><p>Vous pouvez vérifier les réelles séquences de programmes <prgn>dh_*</prgn> pour une <tt><var>cible</var></tt> donnée avec « <tt>dh --no-act <var>cible</var></tt> » ou « <tt>debian/rules -- '--no-act <var>cible</var>'</tt> » sans vraiment les exécuter.</p></footnote>
ja: 12行目から13行目が処理の仕上げ段階です。％サインはターゲットを意味し、ターゲットの名前と一緒に<prgn>dh</prgn>プログラムを呼び出します。<footnote><p>これは新しい<package>debhelper</package> V7の機能です。このデザインコンセプトは<url id="http://joey.kitenet.net/talks/debhelper/debhelper-slides.pdf" name="Not Your Grandpa's Debhelper">Debconf9で<package>debhelper</package>上流によって提示されました。<tt>lenny</tt>では、必須となる明示されたターゲットごとに、もっと複雑な<file>rules</file>ファイルと<prgn>dh_*</prgn>スクリプトを量産し、最初にパッケージ化する際に、各状態に凍結していました。新しい<prgn>dh</prgn>コマンドは、もっとシンプルで、旧来の制約に縛られません。その上、<tt>override_dh_*</tt>ターゲットでカスタマイズする利便性は失われていません。詳しくは<ref id="customrules">を参照してください。これは、<package>debhelper</package>パッケージがもとになっており、<package>cdbs</package>のようにパッケージをビルドするプロセスを複雑化することはありません。</p></footnote><prgn>dh</prgn>コマンドは、引数によって、適切なシーケンスで<prgn>dh_*</prgn>プログラムを走らせるラッパースクリプトです。<footnote><p><tt><var>target</var></tt>変数で呼び出され、<prgn>dh_*</prgn>プログラムが実際に実行するシーケンスは、プログラムを走らせなくても"<tt>dh --no-act <var>target</var></tt>" や、"<tt>debian/rules -- '--no-act <var>target</var>'</tt>"コマンドで確認することができます。</p></footnote>
zh_cn: 第 12 和 13 行是整个文件的全部内容。百分号意味着每个 target 都只是调用 <prgn>dh</prgn> + target 名称的命令。<footnote><p>这使用了新的 <package>debhelper</package> V7 特性。它的设计理念在 <url id="http://joey.kitenet.net/talks/debhelper/debhelper-slides.pdf" name="Not Your Grandpa's Debhelper"> 中有详细解释。这个幻灯片被 <package>debhelper</package> 上游作者于 DebConf9 时展示。在 <tt>lenny</tt> 中，<prgn>dh_make</prgn> 会创建一个复杂很多的 <file>rules</file> 文件，其中带有一系列 <prgn>dh_*</prgn> 脚本命令来完成所需要的各个 target。这个新的 <prgn>dh</prgn> 命令更加简单灵活。你仍然可以通过 <tt>override_dh_*</tt> target 来对任意 target 进行定义。参看 <ref id="customrules">。它仅是基于 <package>debhelper</package> 软件包而不像 <package>cdbs</package> 那样使编译过程模糊不清。</p></footnote> <prgn>dh</prgn> 命令是一个包装脚本并按照参数执行相应的 <prgn>dh_*</prgn>。<footnote><p>你可以通过 <tt>dh --no-act <var>target</var></tt> 或 <tt>debian/rules -- '--no-act <var>target</var>'</tt> 来模拟编译过程并查看实际要执行的 <prgn>dh_*</prgn> 程序。</footnote>
zh_tw: 第 12 和 13 行是整個檔案的全部內容。百分號意味着每個 target 都只是調用 <prgn>dh</prgn> + target 名稱的命令。<footnote><p>這使用了新的 <package>debhelper</package> V7 特性。它的設計理念在 <url id="http://joey.kitenet.net/talks/debhelper/debhelper-slides.pdf" name="Not Your Grandpa's Debhelper"> 中有詳細解釋。這個幻燈片被 <package>debhelper</package> 上游作者於 DebConf9 時展示。在 <tt>lenny</tt> 中，<prgn>dh_make</prgn> 會創建一個複雜很多的 <file>rules</file> 檔案，其中帶有一系列 <prgn>dh_*</prgn> 腳本命令來完成所需要的各個 target。這個新的 <prgn>dh</prgn> 命令更加簡單靈活。你仍然可以通過 <tt>override_dh_*</tt> target 來對任意 target 進行定義。參考 <ref id="customrules">。它僅是基於 <package>debhelper</package> 套件而不像 <package>cdbs</package> 那樣使編譯過程模糊不清。</p></footnote> <prgn>dh</prgn> 命令是一個包裝腳本並按照參數執行相應的 <prgn>dh_*</prgn>。<footnote><p>你可以通過 <tt>dh --no-act <var>target</var></tt> 或 <tt>debian/rules -- '--no-act <var>target</var>'</tt> 來模擬編譯過程並查看實際要執行的 <prgn>dh_*</prgn> 程式。</footnote>

source: "<tt>debian/rules clean</tt>" runs "<tt>dh clean</tt>"; which in turn runs the following:
ca: <tt>debian/rules clean</tt> executa <tt>dh clean</tt>, ﻿que al seu torn executa el següent:
es: <tt>debian/rules clean</tt> ejecuta <tt>dh clean</tt>, que a su vez ejecuta lo siguiente:
fr: « <tt>debian/rules clean</tt> » exécute « <tt>dh clean</tt> », qui exécute à son tour :
it: "<tt>debian/rules clean</tt>" esegue "<tt>dh clean</tt>"; che a sua volta esegue i seguenti:
ja: "<tt>debian/rules clean</tt>" は "<tt>dh clean</tt>"を実行します。実行する順番は以下の通りです。
zh_cn: <tt>debian/rules clean</tt> 运行了 <tt>dh clean</tt>，实际执行的命令为：
zh_tw: <tt>debian/rules clean</tt> 運行了 <tt>dh clean</tt>，實際執行的命令爲：

source: "<tt>debian/rules build</tt>" runs "<tt>dh build</tt>"; which in turn runs the following:
ca: <tt>debian/rules build</tt> executa <tt>dh build</tt>, ﻿que al seu torn executa el següent:
es: <tt>debian/rules build</tt> ejecuta <tt>dh build</tt>, que a su vez ejecuta lo siguiente:
fr: « <tt>debian/rules build</tt> » exécute « <tt>dh build</tt> », qui exécute à son tour :
it: "<tt>debian/rules build</tt>" esegue "<tt>dh build</tt>"; che a sua volta esegue i seguenti:
ja: "<tt>debian/rules build</tt>" は "<tt>dh build</tt>" を実行します。実行する順番は以下の通りです。
zh_cn: <tt>debian/rules build</tt> 运行了 <tt>dh build</tt>，实际执行的命令为：
zh_tw: <tt>debian/rules build</tt> 運行了 <tt>dh build</tt>，實際執行的命令爲：

source: "<tt>fakeroot debian/rules binary</tt>" runs "<tt>fakeroot dh binary</tt>"; which in turn runs the following<footnote><p>This assumes that the <package>python-support</package> package is installed on the system.</p></footnote>:
ca: <tt>fakeroot debian/rules binary</tt> executa <tt>fakeroot dh binary</tt>, ﻿que al seu torn executa el següent <footnote><p>Suposat que el paquet <package>python-support</package> està instal·lat en el sistema. </p></footnote>:
es: <tt>fakeroot debian/rules binary</tt> ejecuta <tt>fakeroot dh binary</tt>, que a su vez ejecuta lo siguiente <footnote><p>Se asume que el paquete <package>python-support</package> está instalado en el sistema.</p></footnote>:
fr: « <tt>fakeroot debian/rules binary</tt> » exécute « <tt>fakeroot dh binary</tt> », qui exécute à son tour : <footnote><p>En assumant que le paquet <package>python-support</package> soit installé sur le système.</p></footnote>
ja: "<tt>fakeroot debian/rules binary</tt>" は "<tt>fakeroot dh binary</tt>"を実行します。さらにそれは以下を実行します<footnote><p><package>python-support</package> パッケージがシステムにインストールされているというのがこの前提です。</p></footnote>:
zh_cn: <tt>fakeroot debian/rules binary</tt> 执行了 <tt>fakeroot dh binary</tt>; 实际执行的命令为<footnote><p>此处默认 <package>python-support</package> 软件包已经安装在系统中。</p></footnote>：
zh_tw: <tt>fakeroot debian/rules binary</tt> 執行了 <tt>fakeroot dh binary</tt>; 實際執行的命令爲<footnote><p>此處默認 <package>python-support</package> 套件已經安裝在系統中。</p></footnote>：

source: "<tt>fakeroot debian/rules binary-arch</tt>" runs "<tt>fakeroot dh binary-arch</tt>"; which in turn runs the same sequence as "<tt>fakeroot dh binary</tt>" but with the "<tt>-a</tt>" option appended for each command.
ca: <tt>fakeroot debian/rules binary-arch</tt> executa <tt>fakeroot dh binary-arch</tt>; ﻿que al seu torn executa la mateixa seqüència que <tt>fakeroot dh binary</tt> però amb l'opció <tt>-a</tt> per a cada ordre.
es: <tt>fakeroot debian/rules binary-arch</tt> ejecuta <tt>fakeroot dh binary-arch</tt>; que a su vez ejecuta la misma secuencia que <tt>fakeroot dh binary</tt> pero con la opción <tt>-a</tt> para cada orden.
fr: « <tt>fakeroot debian/rules binary-arch</tt> » exécute « <tt>fakeroot dh binary-arch</tt> », qui exécute à son tour la même séquence que « <tt>fakeroot dh binary</tt> » mais avec l'option « <tt>-a</tt> » ajoutée à chaque commande ;
it: "<tt>fakeroot debian/rules binary-arch</tt>" esegue "<tt>fakeroot dh binary-arch</tt>"; che a sua volta esegue la stessa sequenza di "<tt>fakeroot dh binary</tt>" ma con l'opzione "<tt>-a</tt>" aggiunta ad ogni comando.
ja: "<tt>fakeroot debian/rules binary-arch</tt>" は "<tt>fakeroot dh binary-arch</tt>" を実行します。"<tt>fakeroot dh binary</tt>" の全てのコマンドに "<tt>-a</tt>" オプションをつけた場合と同じことを行います。
zh_cn: <tt>fakeroot debian/rules binary-arch</tt> 执行了 <tt>fakeroot dh binary-arch</tt>，其效果等同于 <tt>fakeroot dh binary</tt> 并附加 <tt>-a</tt> 参数于每个命令。
zh_tw: <tt>fakeroot debian/rules binary-arch</tt> 執行了 <tt>fakeroot dh binary-arch</tt>，其效果等同於 <tt>fakeroot dh binary</tt> 並附加 <tt>-a</tt> 參數於每個命令。

source: "<tt>fakeroot debian/rules binary-indep</tt>" runs "<tt>fakeroot dh binary-indep</tt>"; which in turn runs almost the same sequence as "<tt>fakeroot dh binary</tt>" but excluding <prgn>dh_strip</prgn>, <prgn>dh_makeshlibs</prgn>, and <prgn>dh_shlibdeps</prgn> with the "<tt>-i</tt>" option appended for each remaining command.
ca: <tt>fakeroot debian/rules binary-indep</tt> executa <tt>fakeroot dh binary-indep</tt>, que al seu torn executa la mateixa seqüència que <tt>fakeroot dh binary</tt> excloent l'execució de <prgn>dh_strip</prgn>, <prgn>dh_makeshlibs</prgn> i <prgn>dh_shlibdeps</prgn> a la vegada que executa les demés ordres amb l'opció <tt>-i</tt>.
es: <tt>fakeroot debian/rules binary-indep</tt> ejecuta <tt>fakeroot dh binary-indep</tt>; que a su vez ejecuta casi la misma secuencia que <tt>fakeroot dh binary</tt> puesto que excluye la ejecución de <prgn>dh_strip</prgn>, <prgn>dh_makeshlibs</prgn> y <prgn>dh_shlibdeps</prgn> a la vez que ejecuta el resto de órdenes añadiendo la opción <tt>-i</tt>.
fr: « <tt>fakeroot debian/rules binary-indep</tt> » exécute « <tt>fakeroot dh binary-indep</tt> », qui exécute à son tour à peu près la même séquence que « <tt>fakeroot dh binary</tt> » à l'exception de <prgn>dh_strip</prgn>, <prgn>dh_makeshlibs</prgn> et <prgn>dh_shlibdeps</prgn>, et avec l'option « <tt>-i</tt> » ajoutée à chaque commande restante.
it: "<tt>fakeroot debian/rules binary-indep</tt>" esegue "<tt>fakeroot dh binary-indep</tt>"; che a sua volta esegue la stessa sequenza di "<tt>fakeroot dh binary</tt>" ma escludendo <prgn>dh_strip</prgn>, <prgn>dh_makeshlibs</prgn>, e <prgn>dh_shlibdeps</prgn> con l'opzione "<tt>-i</tt>" aggiunta ad ogni comando rimanente.
ja: "<tt>fakeroot debian/rules binary-indep</tt>" は "<tt>fakeroot dh binary-indep</tt>" を実行します。同様のコマンドは"<tt>fakeroot dh binary</tt>"ですが、<prgn>dh_strip</prgn>、<prgn>dh_makeshlibs</prgn>、<prgn>dh_shlibdeps</prgn> は実行せず、残りのコマンドには"<tt>-i</tt>" オプションを付加して実行します。
zh_cn: <tt>fakeroot debian/rules binary-indep</tt> 执行了 <tt>fakeroot dh binary-indep</tt>，这会运行几乎和 "<tt>fakeroot dh binary</tt> 一样的命令，但 <prgn>dh_strip</prgn>、<prgn>dh_makeshlibs</prgn> 和 <prgn>dh_shlibdeps</prgn> 除外，其他命令则均附加<tt>-i</tt> 选项。
zh_tw: <tt>fakeroot debian/rules binary-indep</tt> 執行了 <tt>fakeroot dh binary-indep</tt>，這會運行幾乎和 "<tt>fakeroot dh binary</tt> 一樣的命令，但 <prgn>dh_strip</prgn>、<prgn>dh_makeshlibs</prgn> 和 <prgn>dh_shlibdeps</prgn> 除外，其他命令則均附加<tt>-i</tt> 選項。

source: The function of <prgn>dh_*</prgn> commands are almost self-evident from their names. <footnote><p>For complete information on what do all these <prgn>dh_*</prgn> scripts exactly do, and what their other options are, please read their respective manual pages and the <package>debhelper</package> documentation.</p></footnote> There are few notable ones worth making (over)simplified explanation here assuming typical build environment based on <file>Makefile</file>. <footnote><p>These commands support other build environments such as <file>setup.py</file>, which can be listed by executing "<tt>dh_auto_build --list</tt>" in a package source directory.</p></footnote>
ca: La funció de les ordres <prgn>dh_*</prgn> pot deduir-se del seu nom <footnote><p>Per a una descripció més completa de la funció de cada <prgn>dh_*</prgn> i les seves opcions, consulta els manuals respectius així com la documentació de <package>debhelper</package>. </p></footnote>. A continuació es resumeix la funció de les ordres més importants per al cas de compilació basada en un arxiu <file>Makefile</file> <footnote><p>L'ordre també funciona amb altres sistemes de compilació com <file>setup.py</file>. L'execució de <tt>dh_auto_build --list</tt> en el directori de les fonts fa un llistat de les possibilitats admeses. </p></footnote>.

source: <prgn>dh_auto_clean</prgn> usually executes the following if <file>Makefile</file> exists with the <tt>distclean</tt> target. <footnote><p>It actually looks for the first available target of <tt>distclean</tt>, <tt>realclean</tt> or <tt>clean</tt> in <file>Makefile</file> and execute it.</p></footnote>
ca: <prgn>dh_auto_clean</prgn> executa el seguent si hi ha un arxiu <file>Makefile</file> amb l'objectiu <tt>distclean</tt> <footnote><p>Mira el primer objectiu disponible entre <tt>distclean</tt>, <tt>realclean</tt> o <tt>clean</tt> a l'arxiu <file>Makefile</file> i l'executa. </p></footnote>.
es: <prgn>dh_auto_clean</prgn> normalmente ejecuta lo siguiente, siempre que exista un fichero <file>Makefile</file> con el objetivo <tt>distclean</tt><footnote><p>En realidad busca el primer objetivo <tt>distclean</tt>, <tt>realclean</tt> o <tt>clean</tt> disponible en el <file>Makefile</file> y lo ejecuta.</p></footnote>.
fr: <prgn>dh_auto_clean</prgn> exécute normalement ce qui suit si <file>Makefile</file> fournit la cible <tt>distclean</tt> : <footnote><p>En fait il recherche la première cible disponible parmi <tt>distclean</tt>, <tt>realclean</tt> et <tt>clean</tt> dans <file>Makefile</file> et l'exécute.</p></footnote>
ja: <prgn>dh_auto_clean</prgn>は、<file>Makefile</file>に<tt>distclean</tt>ターゲットがあれば以下のコマンドを実行します。実際には、<footnote><file>Makefile</file>中の<p><tt>distclean</tt>、<tt>realclean</tt>、 <tt>clean</tt>のうち、最初に利用可能なものを実行します。</p></footnote>
zh_cn: <prgn>dh_auto_clean</prgn> 在 <file>Makefile</file> 中有 <tt>distclean</tt> target 时执行以下命令。<footnote><p>实际上是依次考虑 <tt>distclean</tt>、<tt>realclean</tt> 或 <tt>clean</tt> 之一并执行。</p></footnote>
zh_tw: <prgn>dh_auto_clean</prgn> 在 <file>Makefile</file> 中有 <tt>distclean</tt> target 時執行以下命令。<footnote><p>實際上是依次考慮 <tt>distclean</tt>、<tt>realclean</tt> 或 <tt>clean</tt> 之一併執行。</p></footnote>

source: <prgn>dh_auto_configure</prgn> usually executes the following if <file>./configure</file> exists (arguments abbreviated for readability).
ca: <prgn>dh_auto_configure</prgn> executa el següent si es fa servir el fitxer <file>./configure</file> (els arguments s'ha abreviat per facilitar la lectura):
es: <prgn>dh_auto_configure</prgn> ejecuta lo siguiente si existe el archivo <file>./configure</file> (se han abreviado los argumentos para facilitar la lectura).
fr: <prgn>dh_auto_configure</prgn> exécute normalement ce qui suit si <file>./configure</file> existe (les paramètres sont abrégés pour la lisibilité) :
it: <prgn>dh_auto_configure</prgn> normalmente esegue i seguenti comandi se esiste il file <file>./configure</file> (argomenti abbreviati for una maggiore leggibilità).
ja: <prgn>dh_auto_configure</prgn>は、<file>./configure</file>があれば以下のコマンドを実行します。 (読みやすくするために引数は省略しました)
zh_cn: <prgn>dh_auto_configure</prgn> 在 <file>./configure</file> 存在时通常执行以下命令(省略了部分参数以方便此处阅读)。
zh_tw: <prgn>dh_auto_configure</prgn> 在 <file>./configure</file> 存在時通常執行以下命令(省略了部分參數以方便此處閱讀)。

source: <prgn>dh_auto_build</prgn> usually executes the following to execute the first target of <file>Makefile</file> if it exists.
ca: <prgn>dh_auto_build</prgn> executa el següent per executar el primer objectiu del fitxer <file>Makefile</file> (si es fa servir aquest arxiu).
es: <prgn>dh_auto_build</prgn> ejecuta lo siguiente para ejecutar el primer objetivo del archivo <file>Makefile</file> (supuesto que este existe).
fr: <prgn>dh_auto_build</prgn> exécute normalement ce qui suit pour exécuter la première cible de <file>Makefile</file> si elle existe :
it: <prgn>dh_auto_build</prgn> normalmente lancia il seguente comando per eseguire, se esiste, il primo obiettivo del <file>Makefile</file>.
ja: <prgn>dh_auto_build</prgn>は、 <file>Makefile</file>があれば、その最初のターゲットをビルドするために、以下のコマンドを実行します。
zh_cn: <prgn>dh_auto_build</prgn> 通常使用以下命令执行 <file>Makefile</file> 中的第一个 target。
zh_tw: <prgn>dh_auto_build</prgn> 通常使用以下命令執行 <file>Makefile</file> 中的第一個 target。

source: <prgn>dh_auto_test</prgn> usually executes the following if <file>Makefile</file> exists with the <tt>test</tt> target. <footnote><p>It actually looks for the first available target of <tt>test</tt> or <tt>check</tt> in <file>Makefile</file> and execute it.</p></footnote>
ca: <prgn>dh_auto_test</prgn> executa el següent si existeix l'objectiu <tt>test</tt> en el fitxer <file>Makefile</file> <footnote><p>En realitat executa el primer dels objectius <tt>test</tt> o <tt>check</tt> del fitxer <file>Makefile</file>.</p></footnote>.
es: <prgn>dh_auto_test</prgn> ejecuta lo siguiente si existe el objetivo <tt>test</tt> en el archivo <file>Makefile</file> <footnote><p>En realidad busca el primero de los objetivos <tt>test</tt> o <tt>check</tt> en el archivo <file>Makefile</file> y lo ejecuta.</p></footnote>.
fr: <prgn>dh_auto_test</prgn> exécute normalement ce qui suit si <file>Makefile</file> fournit la cible <tt>test</tt> : <footnote><p>En fait il recherche la première cible disponible parmi <tt>test</tt> et <tt>check</tt> dans <file>Makefile</file> et l'exécute.</p></footnote>
ja: <prgn>dh_auto_test</prgn>は、<file>Makefile</file>中に<tt>test</tt> ターゲットがあれば、以下を実行します。<footnote><p>実際には、<file>Makefile</file>中の<tt>test</tt>か<tt>check</tt>のうち、最初に利用可能なものを実行します。</p></footnote>
zh_cn: <prgn>dh_auto_test</prgn> 通常在 <file>Makefile</file> 存在且有 <tt>test</tt> target 时执行以下命令。<footnote><p> 实际上是依次考虑 <tt>test</tt> 或 <tt>check</tt> 并执行。</p></footnote>
zh_tw: <prgn>dh_auto_test</prgn> 通常在 <file>Makefile</file> 存在且有 <tt>test</tt> target 時執行以下命令。<footnote><p> 實際上是依次考慮 <tt>test</tt> 或 <tt>check</tt> 並執行。</p></footnote>

source: <prgn>dh_auto_install</prgn> usually executes the following if <file>Makefile</file> exists with the <tt>install</tt> target (line folded for readability).
ca: <prgn>dh_auto_install</prgn> executa el següent si existeix l'objectiu <tt>install</tt> en el fitxer <file>Makefile</file> (s'ha truncat la línia per facilitar la lectura):
es: <prgn>dh_auto_install</prgn> ejecuta lo siguiente si en el archivo <file>Makefile</file> existe el objetivo <tt>install</tt> (se ha truncado la linea para permitir su lectura).
fr: <prgn>dh_auto_install</prgn> exécute normalement ce qui suit si <file>Makefile</file> fournit la cible <tt>install</tt> (la ligne est coupée pour la lisibilité) :
it: <prgn>dh_auto_install</prgn> normalmente esegue il seguente comando con l'obiettivo <tt>install</tt> se esiste il file <file>Makefile</file> (riga spezzata per aumentare la leggibilità).
ja: <prgn>dh_auto_install</prgn>は、<file>Makefile</file>に<tt>install</tt>ターゲットがあれば、以下のコマンドを実行します。 (読みやすくするために畳み込みました)。
zh_cn: <prgn>dh_auto_install</prgn> 通常在 <file>Makefile</file> 存在且有 <tt>install</tt> target 时执行以下命令(进行了换行以便阅读)。
zh_tw: <prgn>dh_auto_install</prgn> 通常在 <file>Makefile</file> 存在且有 <tt>install</tt> target 時執行以下命令(進行了換行以便閱讀)。
