Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: The package management tools usually behave the same way when dealing with these relations; if not, it will be explained. (see <manref section="8" name="dpkg">, <manref section="8" name="dselect">, <manref section="8" name="apt">, <manref section="1" name="aptitude"> etc.)
ca: Les eines de gestió de paquets tracten de la mateixa manera les relacions entre els paquets; els casos en què no és així s'explicaran en el seu moment (consulta <manref section="8" name="dpkg">, <manref section="8" name="dselect">, <manref section="8" name="apt">, <manref section="1" name="aptitude">, etc.).
es: Las herramientas de gestión de paquetes se comportan habitualmente de la misma forma cuando tratan con esas relaciones entre paquetes; si no es así, se explicará en cada caso. (véase <manref section="8" name="dpkg">, <manref section="8" name="dselect">, <manref section="8" name="apt">, <manref section="1" name="aptitude">, etc.)
fr: Les outils de gestion de paquets se comportent d'ordinaire de la même manière quand ils gèrent ces relations ; sinon, ce sera précisé (voir <manref section="8" name="dpkg">, <manref section="8" name="dselect">, <manref section="8" name="apt">, <manref section="1" name="aptitude">, etc.)
it: Gli strumenti di gestione dei pacchetti solitamente si comportano allo stesso modo quando si occupano di tali relazioni; in caso contrario, il comportamento verrà spiegato. (si legga <manref section="8" name="dpkg">, <manref section="8" name="dselect">, <manref section="8" name="apt">, <manref section="1" name="aptitude"> ecc.)
ja: 異なるパッケージ管理ツールであっても、通常この関係処理に同じ動作をします。そうでない場合については、後から説明します。(<manref section="8" name="dpkg">、<manref section="8" name="dselect">、<manref section="8" name="apt">、<manref section="1" name="aptitude">などを参照してください。)
zh_cn: 软件包管理工具通常对这些关系采取相同的操作，如果不是，我将会详细解释。(参看 <manref section="8" name="dpkg">、<manref section="8" name="dselect">、<manref section="8" name="apt">、<manref section="1" name="aptitude"> 等。)
zh_tw: 套件管理工具通常對這些關係採取相同的操作，如果不是，我將會詳細解釋。(參考 <manref section="8" name="dpkg">、<manref section="8" name="dselect">、<manref section="8" name="apt">、<manref section="1" name="aptitude"> 等。)

source: This is what the dependencies mean:
ca: A continuació s'explica detalladament el significat de cada tipus de dependència:
es: A continuación se detalla el significado de las dependencias:
fr: Voici la signification des dépendances :
it: Questo è il significato delle relazioni:
ja: 以下にこれらの依存関係が持つ意味を説明します。
zh_cn: 以下是各种依赖关系的含义：
zh_tw: 以下是各種依賴關係的含義：

source: The package will not be installed unless the packages it depends on are installed. Use this if your program absolutely will not run (or will cause severe breakage) unless a particular package is present.
ca: El programa no s'instal·larà fins què s'instal·lin els paquets dels quals depèn. Fes servir aquesta opció si el teu programa no funciona (o es trenca fàcilment) sense un paquet determinat.
es: No se instalará el programa a menos que los paquetes de los que depende estén ya instalados. Usa esto si tu programa no funcionará de ninguna forma (o se romperá fácilmente) a no ser que se haya instalado un paquete determinado.
fr: le paquet ne sera pas installé sans que les paquets dont il dépend ne soient installés. Utilisez-le si le programme ne s'exécute absolument pas (ou cause des dégâts sérieux) si un paquet particulier n'est pas présent ;
it: Il pacchetto non verrà installato a meno che tutti i pacchetti da cui dipende vengono installati. Si usi questa relazione se il programma non funzionerà assolutamente (o sarà praticamente inutilizzabile) a meno della presenza di particolari pacchetti.
ja: 依存しているパッケージがインストールされない限り、パッケージはインストールされません。あなたのプログラムが特定のパッケージなしでは動かない(または深刻な破損の原因になる恐れがある)場合はこれを使います。
zh_cn: 此软件包仅当它依赖的软件包均已安装后才可以安装。此处写明你的程序所必须的软件包。
zh_tw: 此套件僅當它依賴的套件均已安裝後纔可以安裝。此處寫明你的程式所必須的套件。

source: Use this for packages that are not strictly necessary but are typically used with your program. When a user installs your program, all frontends will likely prompt them to install the recommended packages. <prgn>aptitude</prgn> and <prgn>apt-get</prgn> install recommended packages along with your package (but the user can disable this default behaviour). <prgn>dpkg</prgn> will ignore this field.
ca: Aquesta opció és per a paquets que no són imprescindibles per al funcionament del programa però que es fan servir juntament amb ell. Quan els usuaris instal·lin el teu paquet, totes les interfícies d'instal·lació aconsellaran la instal·lació dels paquets recomanats. <prgn>aptitude</prgn> i <prgn>apt-get</prgn> instal·len els paquets recomanats (però l'usuari pot decidir no fer-ho). <prgn>dpkg</prgn> ignora el contingut d'aquest camp.
es: Esta opción es para paquetes cuya instalación no es estrictamente necesaria para el funcionamiento de tu programa pero que suelen utilizarse junto con tu programa. Cuando los usuarios instalen tu paquete, todas las interfaces de instalación aconsejaran la instalación de los paquetes recomendados. <prgn>aptitude</prgn> y <prgn>apt-get</prgn> instalan los paquetes recomendados (pero el usuario puede decidir no hacerlo). <prgn>dpkg</prgn> ignora el contenido de este campo.
fr: à utiliser pour les paquets qui ne sont pas vraiment indispensables mais qui sont typiquement utilisés avec le programme. Lorsqu'un utilisateur installe le paquet, toutes les interfaces devraient proposer d'installer les paquets recommandés. <prgn>aptitude</prgn> et <prgn>apt-get</prgn> installent les paquets recommandés avec le paquet (mais l'utilisateur peut désactiver ce comportement par défaut). <prgn>dpkg</prgn> ignorent ce champ ;
it: Si usi questa relazione per pacchetti che non sono strettamente necessari ma sono solitamente utilizzati dal programma. Quando un utente installa il programma, tutte le interfacce probabilmente chiederanno l'installazione dei pacchetti raccomandati. <prgn>aptitude</prgn> e <prgn>apt-get</prgn> installano i pacchetti raccomandati insieme al pacchetto principale (ma l'utente può disabilitare questo comportamento predefinito). <prgn>dpkg</prgn> ignorerà questo campo.
ja: 厳密には必須ではないけれど通常一緒に使われるようなパッケージを指定します。あなたのプログラムをユーザーがインストールする時、フロントエンドが推奨しているパッケージも一緒にインストールするか確認します。<prgn>aptitude</prgn>や<prgn>apt-get</prgn>の場合は、推奨パッケージも一緒にインストールします。(ユーザーはこの機能を無効化できます。)<prgn>dpkg</prgn>は推奨されるパッケージを無視します。
zh_cn: 这项中的软件包不是严格意义上必须安装才可以保证程序运行。当用户安装软件包时，所有前端工具都会询问是否要安装这些推荐的软件包。<prgn>aptitude</prgn> 和 <prgn>apt-get</prgn> 会在安装你的软件包的时候自动安装推荐的软件包(用户可以禁用这个默认行为)。<prgn>dpkg</prgn> 则会忽略此项。
zh_tw: 這項中的套件不是嚴格意義上必須安裝纔可以保證程式運行。當用戶安裝套件時，所有前端工具都會詢問是否要安裝這些推薦的套件。<prgn>aptitude</prgn> 和 <prgn>apt-get</prgn> 會在安裝你的套件的時候自動安裝推薦的套件(用戶可以禁用這個默認行爲)。<prgn>dpkg</prgn> 則會忽略此項。

source: Use this for packages which will work nicely with your program but are not at all necessary. When a user installs your program, all frontends will likely prompt them to install the suggested packages. <prgn>aptitude</prgn> can be configured to install suggested packages along with your package but this is not its default. <prgn>dpkg</prgn> and <prgn>apt-get</prgn> will ignore this field.
ca: En instal·lar el paquet, tots els programes informaran a l'usuari que pot instal·lar els paquets suggerits. És possible configurar <prgn>aptitude</prgn> per a què instal·li els paquets suggerits (no és l'opció per defecte). <prgn>dpkg</prgn> i <prgn>apt-get</prgn> ignoren aquestes dependències. Fes servir aquesta opció per a paquets que funcionaran bé amb el teu programa però que no són amb absolut necessaris.
es: Cuando un usuario instale el paquete, todos los programas le informarán de que puede instalar los paquetes sugeridos. Es posible configurar <prgn>aptitude</prgn> para que instale los paquetes sugeridos, aunque no es la opción predeterminada. <prgn>dpkg</prgn> y <prgn>apt-get</prgn>, que ignorarán estas dependencias. Utiliza esto para paquetes que funcionarán bien con tu programa pero que no son necesarios en absoluto.
fr: à utiliser pour les paquets qui fonctionnent bien avec le programme mais qui ne sont pas du tout indispensables. Lorsqu'un utilisateur installe le programme, toutes les interfaces devraient proposer d'installer les paquets suggérés. <prgn>aptitude</prgn> peut être configuré pour installer les paquets suggérés avec le paquet mais ce n'est pas le comportement par défaut. <prgn>dpkg</prgn> et <prgn>apt-get</prgn> ignore ce champ ;
it: Si usi questa relazione per pacchetti che funzionano bene con il programma ma non sono per niente necessari. Quando un utente installa il programma, tutte le interfacce probabilmente chiederanno l'installazione dei pacchetti consigliati. <prgn>aptitude</prgn> può essere configurato per installare i pacchetti consigliati insieme al pacchetto principale ma questo non è il comportamento predefinito. <prgn>dpkg</prgn> ed <prgn>apt-get</prgn> ignoreranno questo campo.
ja: 必要ではないものの、一緒に使用すると便利なパッケージを指定します。あなたのプログラムをユーザーがインストールする時、フロントエンドが提案しているパッケージも一緒にインストールするか確認します。<prgn>aptitude</prgn>は提案パッケージを一緒にインストールするように変更することが可能ですが、デフォルトではありません。<prgn>dpkg</prgn>と<prgn>apt-get</prgn>は提案されるパッケージを無視します。
zh_cn: 此项中的软件包可以使你的程序更好地工作，但不是一定需要的。当用户安装程序时，所有的前端程序将询问是否安装建议的软件包。<prgn>aptitude</prgn> 可以被配置为安装软件时自动安装建议的软件包。<prgn>dpkg</prgn> 和 <prgn>apt-get</prgn> 将忽略此项。
zh_tw: 此項中的套件可以使你的程式更好地工作，但不是一定需要的。當用戶安裝程式時，所有的前端程式將詢問是否安裝建議的套件。<prgn>aptitude</prgn> 可以被設定爲安裝軟體時自動安裝建議的套件。<prgn>dpkg</prgn> 和 <prgn>apt-get</prgn> 將忽略此項。

source: This is stronger than <tt>Depends</tt>. The package will not be installed unless the packages it pre-depends on are installed and <em>correctly configured</em>. Use this <em>very</em> sparingly and only after discussing it on the <url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org"> mailing list. Read: don't use it at all. :-)
ca: Aquesta opció és més radical que <tt>Depends</tt>. El paquet no s'instal·larà fins que els paquets dels quals pre-depèn estiguin instal·lats i <em>correctament configurats</em>. Fes servir aquesta opció <em>poques vegades</em> i només després d'haver-ho discutit a la llista de distribució <url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org">. Més clarament: no facis servir aquesta opció :-).
es: Esto es más fuerte que <tt>Depends</tt>. El paquete no se instalará a menos que los paquetes de los que pre-dependa estén instalados y <em>correctamente configurados</em>. Utiliza esto <em>muy</em> poco y sólo después de haberlo discutido en la lista de distribución (<url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org">). En resumidas cuentas: no lo utilices en absoluto :-)
fr: ceci est plus fort que <tt>Depends</tt>. Le paquet ne sera pas installé tant que les paquets dont il pré-dépend ne soient installés et <em>correctement configurés</em>. Utilisez-le <strong>très</strong> rarement et seulement après en avoir discuté sur la liste de discussion <url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org">. Comprendre : ne l'utilisez pas du tout ; :-)
ja: これは<tt>Depends</tt>よりも強い関係を示します。パッケージは先行依存のパッケージがあらかじめインストールされ、かつ適切に設定されていない限りインストールされません。これは、メーリングリスト<url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org">で議論を尽くした上で、<em>とても</em>慎重に扱うべきです。つまり、使わないでください。:-)
zh_cn: 此项中的依赖强于 <tt>Depends</tt> 项。软件包仅在预依赖的软件包已经安装后才可以正常安装并且 <em>正确配置</em> 后才可以正常安装。在使用此项时应 <em>非常慎重</em>，仅当在 <url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org"> 邮件列表讨论后才能使用。记住：根本就不要用这项。 :-)
zh_tw: 此項中的依賴強於 <tt>Depends</tt> 項。套件僅在預依賴的套件已經安裝後纔可以正常安裝並且 <em>正確設定</em> 後纔可以正常安裝。在使用此項時應 <em>非常慎重</em>，僅當在 <url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org"> 郵件列表討論後才能使用。記住：根本就不要用這項。 :-)

source: The package will not be installed until all the packages it conflicts with have been removed. Use this if your program absolutely will not run or will cause severe problems if a particular package is present.
ca: El paquet no s'instal·larà fins què tots el paquets amb els quals entre en conflicte siguin eliminats. Fes servir aquesta opció si el teu programa no funcionarà amb absolut (o fallarà fàcilment) si un paquet en concret no està instal·lat.
es: El paquete no se instalará hasta que todos los paquetes con los que entra en conflicto hayan sido eliminados. Utiliza esto si tu programa no funcionará en absoluto (o fallará fácilmente) si un paquete en concreto está instalado.
fr: le paquet ne sera pas installé tant que les paquets avec lesquels il est en conflit n'aient été retirés. À utiliser si le programme ne peut absolument pas fonctionner ou s'il cause d'énormes problèmes quand un paquet particulier est présent ;
it: Il pacchetto non verrà installato a meno che tutti i pacchetti con i quali va in conflitto siano rimossi. Si usi questa relazione se il programma non funzionerà o causerà gravi problemi se un certo pacchetto è presente.
ja: 競合しているパッケージが削除されない限り、パッケージはインストールされません。あなたのプログラムが特定のパッケージと一緒だと動かない（または深刻な破損の原因になる恐れがある）場合はこれを使います。
zh_cn: 仅当所有冲突的软件包都已经删除后此软件包才可以安装。当程序在某些特定软件包存在时根本无法运行或存在严重问题时使用此项。
zh_tw: 僅當所有衝突的套件都已經刪除後此套件纔可以安裝。當程式在某些特定套件存在時根本無法運行或存在嚴重問題時使用此項。

source: The package will be installed while all the listed packages will be broken. Normally a <tt>Breaks</tt> entry has an "earlier than" version clause. The resolution is generally to upgrade the listed packages by the higher-level package management tools.
ca: Si el paquet s'instal·la, tots els paquets de la llista es trencaran. Normalment, els paquets inclosos en la llista <tt>Breaks</tt> "tenen" una clàusula de versió anterior. La solució és actualitzar els paquets de la llista a la versió més actual.
es: Si el paquete se instala, todos los paquetes de la lista se romperán. Normalmente, los paquetes incluidos en la lista <tt>Breaks</tt> tienen una cláusula de "versión anterior". La solución es actualizar los paquetes de la lista a la versión más actual.
fr: le paquet sera installé pendant que les paquets énumérés seront cassés. Normalement les paquets du champ <tt>Breaks</tt> ont une relation « version antérieure à ». La résolution de conflits conduit généralement à mettre à niveau les paquets énumérés par les outils de gestion de paquets de haut niveau.
ja: パッケージがインストールされると、あるパッケージが壊れる場合に指定します。通常、<tt>Breaks</tt>の項目は旧バージョンに対する制約になっています。パッケージマネジメントツールは、記載されたパッケージのバージョンを上げることで解決する場合がほとんどです。
zh_cn: 此软件包安装后列出的软件包将会受到损坏。通常 <tt>Breaks</tt> 要附带一个“版本号小于多少”的说明。这样，软件包管理工具将会选择升级被损坏的特定版本的软件包。
zh_tw: 此套件安裝後列出的套件將會受到損壞。通常 <tt>Breaks</tt> 要附帶一個“版本號小於多少”的說明。這樣，套件管理工具將會選擇升級被損壞的特定版本的套件。

source: For some types of packages where there are multiple alternatives virtual names have been defined. You can get the full list in the <file>/usr/share/doc/debian-policy/virtual-package-names-list.txt.gz</file> file. Use this if your program provides a function of an existing virtual package.
ca: Hi ha definits noms virtuals per a alguns tipus determinats de paquets que ofereixen múltiples alternatives per a la mateixa funció. Pots obtenir una llista completa a <file>/usr/share/doc/debian-policy/virtual-package-names-list.text.gz</file>. Fes servir aquesta opció si el teu programa ofereix les funcions d'un paquet virtual que ja existeixi.
es: Se han definido nombres virtuales para algunos tipos determinados de paquetes que ofrecen múltiples alternativas para la misma función. Puedes obtener la lista completa en el fichero <file>/usr/share/doc/debian-policy/virtual-package-names-list.text.gz</file>. Usa esto si tu programa ofrece las funciones de un paquete virtual que ya exista.
fr: quand il y a plusieurs alternatives pour certains types de paquets, des noms virtuels ont été définis. La liste complète est disponible dans le fichier <file>/usr/share/doc/debian-policy/virtual-package-name-list.text.gz</file>. À utiliser si le programme fournit une fonction d'un paquet virtuel existant ;
it: Per alcuni tipi di pacchetto in cui vi sono molteplici alternative sono stati definiti dei nomi virtuali. Si può trovare la lista completa nel file <file>/usr/share/doc/debian-policy/virtual-package-names-list.txt.gz</file>. Si usi questa relazione se il programma fornisce la funzione di un pacchetto virtuale esistente.
ja: パッケージによっては、選択の予知があるために仮想パッケージ名が定義されています。仮想パッケージ名の一覧仮想パッケージ名の一覧は<file>/usr/share/doc/debian-policy/virtual-package-names-list.txt.gz</file>にあります。あなたのプログラムが既存の仮想パッケージに相当する機能を提供する場合には、これを使います。
zh_cn: 某些类型的软件包会定义有多个可选的虚拟名称。你可以在 <file>/usr/share/doc/debian-policy/virtual-package-names-list.txt.gz</file> 文件中找到完整的列表。如果你的程序提供了某个已存在的虚拟软件包的功能则使用此项。
zh_tw: 某些類型的套件會定義有多個可選的虛擬名稱。你可以在 <file>/usr/share/doc/debian-policy/virtual-package-names-list.txt.gz</file> 檔案中找到完整的列表。如果你的程式提供了某個已存在的虛擬套件的功能則使用此項。

source: Use this when your program replaces files from another package, or completely replaces another package (used in conjunction with <tt>Conflicts</tt>). Files from the named packages will be overwritten with the files from your package.
ca: Fes servir aquesta opció només si el teu programa substitueix fitxers d'un altra paquet o el paquet complet (generalment es fa servir aquesta opció conjuntament amb <tt>Conflicts</tt>). S'eliminaran els fitxers dels paquets indicats abans d'instal·lar el teu.
es: Usa esto si tu programa reemplaza ficheros de otro paquete o reemplaza totalmente otro paquete (generalmente se usa conjuntamente con <tt>Conflicts</tt>). Se sobrescribirán los ficheros de los paquetes indicados con los ficheros de tu paquete.
fr: à utiliser quand le programme remplace des fichiers d'un autre paquet, ou remplace complètement un autre paquet (utilisé en conjonction avec <tt>Conflicts</tt>). Les fichiers du paquet nommé seront écrasés par les fichiers de votre paquet.
ja: あなたのプログラムが別パッケージのファイルを上書きしたり、パッケージ全体を完全に置き換えてしまう場合（この場合は<tt>Conflicts</tt>も一緒に指定してください）この指定を使います。ここで指定されたパッケージに含まれるファイルはあなたのパッケージのファイルによって上書きされます。
zh_cn: 当你的程序要替换其他软件包的某些文件，或是完整地替换另一个软件包(与 <tt>Conflicts</tt> 一起使用)。列出的软件包中的某些文件会被你的软件包所覆盖。
zh_tw: 當你的程式要替換其他套件的某些檔案，或是完整地替換另一個套件(與 <tt>Conflicts</tt> 一起使用)。列出的套件中的某些檔案會被你的套件所覆蓋。

source: All these fields have uniform syntax. They are a list of package names separated by commas. These package names may also be lists of alternative package names, separated by vertical bar symbols "<tt>|</tt>" (pipe symbols).
ca: Tots aquests camps tenen una sintaxi uniforme: es tracta d'una llista de noms de paquets separats per comes. Aquests noms de paquets també poder ésser llistes de paquets alternatius, separats amb una barra vertical «<tt>|</tt>» (símbol de tub).
es: Todos estos campos tienen una sintaxis uniforme: se trata de una lista de nombres de paquetes separados por comas. Estos nombres de paquetes también puede ser listas de paquetes alternativos, separados por los símbolos de barra vertical «<tt>|</tt>» (símbolos tubería).
fr: Tous ces champs ont une syntaxe uniforme. Il s'agit d'une liste de paquets séparés par des virgules. Ces noms de paquets peuvent aussi être une liste d'alternatives, séparés par des barres verticales « <tt>|</tt> » (symbole tube ou « pipe »).
it: Tutti i campi qui descritti hanno una sintassi uniforme. Sono costituiti da una lista contenente i nomi dei pacchetti separati da virgole. Questi possono essere anche costituiti da liste di nomi di pacchetto alternativi, separati da barre verticali "<tt>|</tt>" (simboli pipe).
ja: これらのフィールドは胸痛の書式で記述します。指定したいパッケージ名をコンマで区切って並べます。もし選択肢があれば、それらのパッケージ名を縦棒"<tt>|</tt>" (パイプ記号)で区切って並べます。
zh_cn: 所有的这些项都使用相同的语法。它们是一个软件包列表，软件包名称间使用半角逗号分隔。也可以写出有多个可选的软件包名称，这些软件包使用 <tt>|</tt> 符号分隔。
zh_tw: 所有的這些項都使用相同的語法。它們是一個套件列表，套件名稱間使用半角逗號分隔。也可以寫出有多個可選的套件名稱，這些套件使用 <tt>|</tt> 符號分隔。

source: The fields may restrict their applicability to particular versions of each named package. These versions are listed in parentheses after each individual package name, and they should contain a relation from the list below followed by the version number. The relations allowed are: <tt>&lt;&lt;</tt>, <tt>&lt;=</tt>, <tt>=</tt>, <tt>&gt;=</tt> and <tt>&gt;&gt;</tt> for strictly lower, lower or equal, exactly equal, greater or equal and strictly greater, respectively. For example,
ca: Els camps poden restringir la seva aplicació a versions determinades del paquet llistat. Això es fa afegint a cada nom de paquet la versió entre parèntesi precedida pels símbols <tt>&lt;&lt;</tt>, <tt>&lt;=</tt>, <tt>=</tt>, <tt>&gt;=</tt> i <tt>&gt;&gt;</tt> per a estrictament anterior, anterior o igual, exactament igual, posterior o igual i estrictament posterior, respectivament. Per exemple:
es: Los campos pueden restringir su aplicación a versiones determinadas de cada paquete nombrado. Esto se hace listando después de cada nombre de paquete individual las versiones entre paréntesis, e indicando antes del número de versión una relación de la siguiente lista. Las relaciones permitidas son: <tt>&lt;&lt;</tt>, <tt>&lt;=</tt>, <tt>=</tt>, <tt>&gt;=</tt> y <tt>&gt;&gt;</tt> para estrictamente anterior, anterior o igual, exactamente igual, posterior o igual o estrictamente posterior, respectivamente. Por ejemplo:
fr: Le domaine d'application des champs peut être restreint à des versions particulières de chaque paquet nommé. Ces versions sont précisées entre parenthèses après chaque nom de paquet individuel, et doivent contenir une relation de la liste suivante suivie par un numéro de version. Les relations autorisées sont <tt>&lt;&lt;</tt>, <tt>&lt;=</tt>, <tt>=</tt>, <tt>&gt;=</tt> et <tt>&gt;&gt;</tt> (respectivement : strictement plus petit, plus petit ou égal, exactement égal, plus grand ou égal et strictement plus grand). Par exemple :
it: I campi possono limitare la loro applicabilità a particolari versioni di ogni pacchetto indicato. Queste versioni sono elencate tra parentesi dopo ogni singolo nome di pacchetto, e dovrebbero contenere una relazione presa dalla lista qui sotto seguita dal numero di versione. Le relazioni permesse sono: <tt>&lt;&lt;</tt>, <tt>&lt;=</tt>, <tt>=</tt>, <tt>&gt;=</tt> e <tt>&gt;&gt;</tt> per strettamente inferiore, inferiore o uguale, esattamente uguale, superiore o uguale e strettamente superiore, rispettivamente. Per esempio,
ja: また、適用されるパッケージのバージョン番号で制限をすることも可能です。これを指定したい場合にはそれぞれのパッケージ名の後で 丸カッコ (パーレン) を開き、以下の関係式に続けて バージョン番号を指定してください。使用できる関係式は、<tt>&lt;&lt;</tt>, <tt>&lt;=</tt>, <tt>=</tt>, <tt>&gt;=</tt> and <tt>&gt;&gt;</tt> で、それぞれ 「指定されたものより古いバージョンのみ」、 「指定されたバージョン以前」(指定のバージョンも当然含まれます)、 「指定のバージョンのみ」 「指定されたバージョン以降」(指定のバージョンも当然含まれます)、 「指定されたものより新しいバージョンのみ」を意味します。今まで説明してきた依存関係を使うことで、例えば以下のような 指定も可能です。
zh_cn: 这些项内还可以指定某些软件包的版本号之间的关系。版本号在括号内，紧随软件包名称之后，并在以下逻辑符号后写清具体版本：<tt>&lt;&lt;</tt>、<tt>&lt;=</tt>、<tt>=</tt>、<tt>&gt;=</tt> 和 <tt>&gt;&gt;</tt>，分别代表严格小于、小于或等于、严格等于、大于或等于以及严格大于。例如：
zh_tw: 這些項內還可以指定某些套件的版本號之間的關係。版本號在括號內，緊隨套件名稱之後，並在以下邏輯符號後寫清具體版本：<tt>&lt;&lt;</tt>、<tt>&lt;=</tt>、<tt>=</tt>、<tt>&gt;=</tt> 和 <tt>&gt;&gt;</tt>，分別代表嚴格小於、小於或等於、嚴格等於、大於或等於以及嚴格大於。例如：

source: Depends: foo (&gt;= 1.2), libbar1 (= 1.3.4) Conflicts: baz Recommends: libbaz4 (&gt;&gt; 4.0.7) Suggests: quux Replaces: quux (&lt;&lt; 5), quux-foo (&lt;= 7.6)
ca: Depends: foo (>= 1.2), libbar1 (= 1.3.4) Conflicts: baz Recommends: libbaz4 (>> 4.0.7) Suggests: quux Replaces: quux (<< 5), quux-foo (<= 7.6)
es: Depends: foo (>= 1.2), libbar1 (= 1.3.4) Conflicts: baz Recommends: libbaz4 (>> 4.0.7) Suggests: quux Replaces: quux (<< 5), quux-foo (<= 7.6)
fr: Depends: toto (&gt;= 1.2), libbidule1 (= 1.3.4) Conflicts: machin Recommends: libmachin4 (&gt;&gt; 4.0.7) Suggests: truc Replaces: truc (&lt;&lt; 5), truc-toto (&lt;= 7.6)
