Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: <package>svn-buildpackage</package>: helper programs to maintain Debian packages with Subversion.
ca: <package>svn-buildpackage</package>: programes d'ajuda per al manteniment de paquets Debian amb «Subversion».
es: <package>svn-buildpackage</package>: programas de ayuda para el mantenimiento de paquetes Debian con «Subversion».
fr: <package>svn-buildpackage</package> : assistants pour la maintenance de paquets Debian en dépôt Subversion ;
it: <package>svn-buildpackage</package>: programmi di supporto per mantenere i pacchetti Debian con Subversion.
ja: <package>svn-buildpackage</package>:DebianパッケージSubversionで管理するための支援プログラムです。
zh_cn: <package>svn-buildpackage</package>：帮助维护 Subversion 仓库中软件包的程序。
zh_tw: <package>svn-buildpackage</package>：幫助維護 Subversion 倉庫中套件的程式。

source: <package>cvs-buildpackage</package>: A set of Debian package scripts for CVS source trees.
ca: <package>cvs-buildpackage</package>: conjunt de paquets de guions Debian per a estructures de directoris CVS.
es: <package>cvs-buildpackage</package>: conjunto de paquete de guiones Debian para estructuras de directorios CVS.
fr: <package>cvs-buildpackage</package> : scripts pour paquets Debian en dépôt CVS.
it: <package>cvs-buildpackage</package>: una serie di script per i pacchetti Debian per gli alberi di sorgenti sotto CVS.
ja: <package>cvs-buildpackage</package>: CVSソースツリーのためのスクリプト群をDebianパッケージにしたものです。
zh_cn: <package>cvs-buildpackage</package>：为 CVS 源代码树设计的 Debian 软件包脚本集。
zh_tw: <package>cvs-buildpackage</package>：爲 CVS 原始碼樹設計的 Debian 套件腳本集。

source: These packages offer more elegant working environment than manual use of the <prgn>quilt</prgn> commands for advanced audiences to <em>automate</em> building of packages. I will not explain them in this tutorial. <footnote><p>Here are few web resources available for advanced audiences. <list><item><p>"Building Debian Packages with git-buildpackage" at <file>/usr/share/doc/git-buildpackage/manual-html/gbp.html</file></p></item><item><p>"<url id="https://honk.sigxcpu.org/piki/development/debian_packages_in_git/" name="debian packages in git">"</p></item><item><p>"<url id="http://www.eyrie.org/~eagle/notes/debian/git.html" name="Using Git for Debian Packaging">"</p></item><item><p>"<url id="http://git.debian.org/?p=collab-maint/topgit.git;a=blob_plain;f=debian/HOWTO-tg2quilt;hb=HEAD" name="Using TopGit to generate quilt series for Debian packaging">"</p></item><item><p>"<url id="http://git-dpm.alioth.debian.org/" name="git-dpm: Debian packages in Git manager">"</p></item></list></p></footnote>
ca: Aquests paquets ofereixen un entorn més còmode de treball que la utilització «manual» d'ordres <prgn>quilt</prgn> per a usuaris experimentats, amb l'objectiu d'<em>automatitzar</em> la construcció de paquets. No s'explica l'ús d'aquestes eines en aquest tutorial <footnote><p>Aquí tens alguns recursos disponibles a la xarxa, dirigits a usuaris experts: <list><item><p><p>"Construcció de paquets Debian amb <package>git-buildpackage</package>" a <file>/usr/share/doc/git-buildpackage/manual-html/gbp.html</file>. </p></item><item><p>"<url id="https://honk.sigxcpu.org/piki/development/debian_packages_in_git/" name="«Paquets Debian amb Git»">" </p></item><item><p>"<url id="http://www.eyrie.org/~eagle/notes/debian/git.html/" name="«Fent servir Git per a empaquetar en Debian»">"</p></item><item><p>"<url id="http://git.debian.org/?p=collab-maint/topgit.git;a=blob_plain;f=debian/HOWTO-tg2quilt;hb=HEAD" name="«Fent servir TpGit per a generar sèries de pegats quilt en l'empaquetat Debian»"> "</p></item><item><p>"<url id="http://git-dpm.alioth.debian.org/" name="«git-dpm: paquets Debian en el gestor Git»">"</p></item></list> N.de t.: els títols s'han traduït però els documents són en anglès. </p></footnote>.
es: Estos paquetes ofrecen un entorno más cómodo de trabajo que la utilización «manual» de órdenes <prgn>quilt</prgn> para usuarios experimentados, con el objetivo de <em>automatizar</em> la construcción de paquetes. No se explica el uso de estas herramientas en este tutorial <footnote><p>Aquí tienes algunos recursos disponibles en la red, dirigidos a usuarios expertos: <list><item><p>"Construcción de paquetes Debian con git-buildpackage en <file>/usr/share/doc/git-buildpackage/manual-html/gbp.html</file>. </p></item><item><p>"<url id="https://honk.sigxcpu.org/piki/development/debian_packages_in_git/" name="«Paquetes Debian en Git»">" </p></item><item><p>"<url id="http://www.eyrie.org/~eagle/notes/debian/git.html" name="«Usando Git para empaquetar en Debian»">" </p></item><item><p>"<url id="http://git.debian.org/?p=collab-maint/topgit.git;a=blob_plain;f=debian/HOWTO-tg2quilt;hb=HEAD" name="«Usando TpGit para generar series de parches quilt en el empaquetado Debian»">" </p></item><item><p>"<url id="http://git-dpm.alioth.debian.org/" name="«git-dpm: paquetes Debian en el gestor Git»">"</p></item></list> N.de t.:los títulos están traducidos pero los documentos están en inglés. </p></footnote>.
fr: Ces paquets permettent la mise en place d'un environnement de développement plus agréable que l'utilisation manuelle des commandes <prgn>quilt</prgn> pour les utilisateurs avancés afin d'<em>automatiser</em> la construction de paquets. Ils ne seront pas détaillés dans ce tutoriel. <footnote><p>Voici quelques ressources disponibles sur la toile pour les utilisateurs avancés : <list><item><p>« Construction de paquets Debian avec git-buildpackage » en <file>/usr/share/doc/git-buildpackage/manual-html/gbp.html</file> ;</p></item><item><p>« <url id="https://honk.sigxcpu.org/piki/development/debian_packages_in_git/" name="paquets Debian avec Git"> » ;</p></item><item><p>« <url id="http://www.eyrie.org/~eagle/notes/debian/git.html" name="Utilisation de Git pour l'empaquetage Debian"> » ;</p></item><item><p>« <url id="http://git.debian.org/?p=collab-maint/topgit.git;a=blob_plain;f=debian/HOWTO-tg2quilt;hb=HEAD" name="Utilisation de TopGit pour créer un ensemble quilt pour l'empaquetage Debian"> » ;</p></item><item><p>« <url id="http://git-dpm.alioth.debian.org/" name="git-dpm : paquets Debian en gestionnaire Git"> »</p></item></list></p></footnote>
ja: これらのパッケージはパッケージのビルドを<em>自動化</em>したい上級者に<prgn>quilt</prgn>コマンドを使うよりも洗練された作業環境を提供します。このチュートリアルでは細かい説明はしません。<footnote><p>上級者のみなさんのためになるウェブ上で閲覧できる資料です。<list><item><p>"Building Debian Packages with git-buildpackage" at <file>/usr/share/doc/git-buildpackage/manual-html/gbp.html</file></p></item><item><p>"<url id="https://honk.sigxcpu.org/piki/development/debian_packages_in_git/" name="debian packages in git">"</p></item><item><p>"<url id="http://www.eyrie.org/~eagle/notes/debian/git.html" name="Using Git for Debian Packaging">"</p></item><item><p>"<url id="http://git.debian.org/?p=collab-maint/topgit.git;a=blob_plain;f=debian/HOWTO-tg2quilt;hb=HEAD" name="Using TopGit to generate quilt series for Debian packaging">"</p></item><item><p>"<url id="http://git-dpm.alioth.debian.org/" name="git-dpm: Debian packages in Git manager">"</p></item></list></p></footnote>
zh_cn: 这些软件包为需要 <em>自动化</em> 编译软件包的资深打包人员提供了相比于手工使用 <prgn>quilt</prgn> 命令更加整洁的工作环境，本文档里不会对此进行更多叙述。<footnote><p>对于资深打包人员，有以下几个可用的资源：<list><item><p>位于 <file>/usr/share/doc/git-buildpackage/manual-html/gbp.html</file> 的 Building Debian Packages with git-buildpackage</p></item><item><p>"<url id="https://honk.sigxcpu.org/piki/development/debian_packages_in_git/" name="debian packages in git">"</p></item><item><p>"<url id="http://www.eyrie.org/~eagle/notes/debian/git.html" name="Using Git for Debian Packaging">"</p></item><item><p>"<url id="http://git.debian.org/?p=collab-maint/topgit.git;a=blob_plain;f=debian/HOWTO-tg2quilt;hb=HEAD" name="Using TopGit to generate quilt series for Debian packaging">"</p></item><item><p>"<url id="http://git-dpm.alioth.debian.org/" name="git-dpm: Debian packages in Git manager">"</p></item></list></p></footnote>
zh_tw: 這些套件爲需要 <em>自動化</em> 編譯套件的資深打包人員提供了相比於手工使用 <prgn>quilt</prgn> 命令更加整潔的工作環境，本文件裏不會對此進行更多敘述。<footnote><p>對於資深打包人員，有以下幾個可用的資源：<list><item><p>位於 <file>/usr/share/doc/git-buildpackage/manual-html/gbp.html</file> 的 Building Debian Packages with git-buildpackage</p></item><item><p>"<url id="https://honk.sigxcpu.org/piki/development/debian_packages_in_git/" name="debian packages in git">"</p></item><item><p>"<url id="http://www.eyrie.org/~eagle/notes/debian/git.html" name="Using Git for Debian Packaging">"</p></item><item><p>"<url id="http://git.debian.org/?p=collab-maint/topgit.git;a=blob_plain;f=debian/HOWTO-tg2quilt;hb=HEAD" name="Using TopGit to generate quilt series for Debian packaging">"</p></item><item><p>"<url id="http://git-dpm.alioth.debian.org/" name="git-dpm: Debian packages in Git manager">"</p></item></list></p></footnote>

source: Quick rebuild
ca: Reconstrucció ràpida.
es: Reconstrucción rápida
fr: Reconstruction rapide
it: Ricostruzione veloce
ja: 部分的な再構築
zh_cn: 快速重构建
zh_tw: 快速重構建

source: With a large package, you may not want to rebuild from scratch every time while you tune details in <file>debian/rules</file>. For testing purposes, you can make a <file>.deb</file> file without rebuilding the upstream sources like this <footnote><p>Environment variables which are normally configured to proper values are not set by this method. Never create real packages to be uploaded using this <strong>quick</strong> method.</p></footnote>:
ca: Amb un paquet gran, pot ésser que no vulguis re-compilar des de l'inici cada vegada que fas algun canvi en el fitxer <file>debian/rules</file>. Per fer proves, pots construir un arxiu <file>.deb</file> sense re-compilar les fonts executant <footnote><p>Lles variables d'entorn que normalment estan configurades amb els valors propis no es generen amb aquest mètode. No generis mai paquets reals per a enviar a l'arxiu Debian amb aquest mètode ràpid.</p></footnote>:
es: Con un paquete grande, puede que no quieras recompilar desde cero cada vez que tocas un detalle en el fichero <file>debian/rules</file>. Para propósitos de prueba, puedes hacer un fichero <file>.deb</file> sin necesidad de recompilar las fuentes originales de esta forma<footnote><p>Las variables de entorno que normalmente están configuradas con los valores adecuados, no se configuran con este método. Nunca cree paquetes reales para enviarlos utilizando este método <strong>rápido</strong>.</p></footnote>:
fr: Avec un paquet imposant, vous ne voudrez sans doute pas reconstruire depuis le début chaque fois que vous faites une petite modification à <file>debian/rules</file>. Pour tester, vous pouvez faire un fichier <file>.deb</file> sans reconstruire les sources amont comme ceci <footnote><p>Les variables d'environnement qui devraient normalement être configurées correctement à cette étape ne sont pas configurées par cette méthode. Ne créez jamais de vrai paquets pour l'envoi avec cette méthode <strong>rapide</strong>.</p></footnote> :
it: Con un pacchetto di grandi dimensioni, si potrebbe non voler ricostruire tutto da zero, ogni volte che si modifica un dettaglio in <file>debian/rules</file>. Per effettuare delle prove, si può creare un file <file>.deb</file>, senza ricompilare i sorgenti originali, come segue: <footnote><p>Le variabili d'ambiente, che sono normalmente impostate con dei valori corretti, non sono utilizzati in questa modalità. Mai creare dei pacchetti, che poi andranno caricati, utilizzando il metodo <strong>veloce</strong>.</p></footnote>:
ja: 大規模なパッケージの場合には、<file>debian/rules</file>をちょっといじるたびに、毎回最初からパッケージの再構築をやりなおすのは手間です。テスト目的であれば、以下の方法で上流（upstream）ソースを再構築をせずに<file>.deb</file> ファイルを生成することができます。 <footnote><p>その場合は、通常だと正しく設定される環境変数は設定されません。アップロード用のパッケージはこの<strong>簡易</strong>メソッドで生成しないでください。</p></footnote>:
zh_cn: 对于很大的软件包，在调试 <file>debian/rules</file> 的过程中你可能不想对整个软件包进行重构建。仅用于测试目的，你可以不重新构建源代码包而使用以下的方法创建 <file>.deb</file> 文件<footnote><p>常规情形下被配置好的环境变量在此时不会被自动设置。永远不要将使用这个 <strong>快速</strong> 方法构建的软件包上传到任何地方。</p></footnote>：
zh_tw: 對於很大的套件，在調試 <file>debian/rules</file> 的過程中你可能不想對整個套件進行重構建。僅用於測試目的，你可以不重新構建原始碼包而使用以下的方法創建 <file>.deb</file> 檔案<footnote><p>常規情形下被設定好的環境變量在此時不會被自動設置。永遠不要將使用這個 <strong>快速</strong> 方法構建的套件上傳到任何地方。</p></footnote>：

source: Or, simply as following to see if it build or not.
ca: O simplement pots comprovar si el paquet se compila amb:
es: O simplemente puedes comprobar si el paquete se compila con:
fr: Ou, simplement comme ceci pour voir s'il y a construction ou non :
it: Oppure, semplicemente controllando se costruirlo o no. Come:
ja: また、以下の方法を使えば生成可能かどうかをチェックすることができます。
zh_cn: 或者可以仅查看它是否能通过编译：
zh_tw: 或者可以僅查看它是否能通過編譯：

source: Once you are finished with your tuning, remember to rebuild following the proper procedure. You may not be able to upload correctly if you try to upload <file>.deb</file> files built this way.
ca: Un cop has acabat la posada a punt, caldrà reconstruir el paquet amb el procediment explicat anteriorment. No podràs enviar al repositori els fitxers <file>.deb</file> construïts d'aquesta manera.
es: Una vez que has terminado la puesta a punto, recuerda reconstruir el paquete siguiendo el procedimiento adecuado que está arriba. Puede que no seas capaz de enviar correctamente el paquete si intentas enviar los archivos <file>.deb</file> construidos de esta forma.
fr: Une fois terminés vos ajustements, souvenez-vous de reconstruire en suivant la procédure correcte ci-dessus. Vous pouvez être incapable d'envoyer proprement si vous essayez d'envoyer des fichiers <file>.deb</file> construits de cette façon.
it: Una volta completati i vari aggiustamenti, bisogna ricordarsi di ricostruire il pacchetto usando la giusta procedura. Si potrebbe non essere in grado di caricare il pacchetto correttamente se si prova con dei file <file>.deb</file> creati in questo modo.
ja: 最終的にきちんとテストが完了したら、正しい手順に従ってパッケージを最初から再構築することを忘れないでください。おそらく、きちんとアップロードできないでしょう。
zh_cn: 一旦完成了调试，记住要按照前面所将的正常过程重构建你的软件包。你可能无法正常上传用此种方法构建的 <file>.deb</file> 文件。
zh_tw: 一旦完成了調試，記住要按照前面所將的正常過程重構建你的套件。你可能無法正常上傳用此種方法構建的 <file>.deb</file> 檔案。

source: Checking the package for errors
ca: Com comprovar el teu paquet per trobar errors.
es: Comprobando el paquete en busca de fallos
fr: Contrôle des erreurs du paquet
it: Controllare il pacchetto per errori
ja: パッケージの誤りチェック
zh_cn: 检查软件包中的错误
zh_tw: 檢查套件中的錯誤

source: There are few chores you should know to check the package for errors by yourself before uploading packages to public archives.
ca: Cal que coneguis els procediments per comprovar el paquet i localitzar les errades abans d'enviar-lo als repositoris públics.
es: Debes conocer varios métodos para comprobar el paquete y localizar errores antes de transferirlo a repositorios públicos.
fr: Quelques routines sont à connaître pour chercher vous-même des erreurs sur le paquet avant de l'envoyer sur des archives publiques.
it: Ci sono un paio di questioni da tenere in conto per controllare autonomamente che il pacchetto creato sia privo di errori prima di procedere a caricarlo negli archivi pubblici.
ja: パッケージを公共のアーカイブにアップロードする前にパッケージに間違いが無いかを自分自身で確認するために知っておくべきいくつかの雑用があります。
zh_cn: 在上传软件包到公共仓库前，你还需要自己做一些检查软件包错误的例行工作。
zh_tw: 在上傳套件到公共倉庫前，你還需要自己做一些檢查套件錯誤的例行工作。

source: Testing on machine other than your own is also good idea. You must watch closely for any warnings or errors for all the test described here.
ca: Provar el paquet en una màquina distinta de la que has fet servir en la construcció és una magnífica idea. Cal que posis atenció en tots els errors detectats en les proves que s'expliquen a continuació.
es: Probar el paquete en una máquina distinta a la usada en su construcción es una magnífica idea. Debes poner atención en todos los avisos y errores que se produzcan en las pruebas explicadas a continuación.
fr: Essayer sur une machine différente de la vôtre est aussi une bonne idée. Vous devez observer de près chaque alerte ou erreur pour tous les tests décrits ici.
it: Effettuare dei test su altre macchine oltre a quella con cui si è sviluppato è una buona idea. Si deve inoltre fare attenzione a tutti gli avvisi ed agli errori per tutti i test che verranno qui descritti.
ja: 自分自身のマシン以外でテストするのが賢明です。ここに書かれたすべてのテストでの警告やエラーに関して細心の注意を払わなければいけません。
zh_cn: 不仅在自己的机器上测试总是一个好主意。你必须谨慎地对待以下叙述的测试中显示的任何一个警告或错误信息。
zh_tw: 不僅在自己的機器上測試總是一個好主意。你必須謹慎地對待以下敘述的測試中顯示的任何一個警告或錯誤訊息。

source: Verifying package for install
ca: Comprovació de la instal·lació del paquet
es: Comprobando la instalación del paquete
fr: Vérification de l'installation du paquet
it: Verifica del pacchetto per l'installazione
ja: パッケージインストールの検証
zh_cn: 检验软件包安装过程
zh_tw: 檢驗套件安裝過程

source: You must test your package if it installs without problem. The <manref section="1" name="debi"> command helps you to test to install all the generated binary packages.
ca: Prova d'instal·lar el paquet, per exemple, fent servir l'ordre <manref section="1" name="debi"> com a usuari «root». Intenta instal·lar-lo i executar-lo en altres màquines (diferents a la que has fet servir per a la construcció del paquet) i posa atenció per detectar errors o avisos en la instal·lació i en l'execució del programa.
es: Instala el paquete para probarlo tú mismo, por ejemplo, usando la orden <manref section="1" name="debi"> como superusuario. Intenta instalarlo y ejecutarlo en otras máquinas distintas de la tuya, y presta atención para detectar errores o avisos tanto en la instalación como en la ejecución del programa.
fr: Vous devez essayer votre paquet pour vérifier qu'il s'installe sans problème. La commande <manref section="1" name="debi"> vous permet d'essayer l'installation de tout paquet binaire créé.
it: Bisogna verificare che il pacchetto si installi senza problemi. Il comando <manref section="1" name="debi"> aiuta a testare l'installazione di tutti i pacchetti binari generati.
ja: 問題なくインストール出きるかどうかテストするべきです。<manref section="1" name="debi"> コマンドはすべての生成されたバイナリパッケージをインストールするテストをするのに有効です。
zh_cn: 你必须测试你的软件包看是否存在安装问题。<manref section="1" name="debi"> 命令可以帮助你测试生成的二进制软件包。
zh_tw: 你必須測試你的套件看是否存在安裝問題。<manref section="1" name="debi"> 命令可以幫助你測試生成的二進位套件。

source: You have to make sure that there are no overlapped files with other existing packages using the <file>Contents-<var>i386</var></file> file downloaded from the Debian archive to prevent installation problem on different systems. The <prgn>apt-file</prgn> command may be handy for this task. If there are overlapped files, please take actions to avoid the real problem using the alternatives mechanism (see <manref section="1" name="update-alternatives">) by coordinating with other affected packages or by setting the "<tt>Conflicts</tt>" entry in the <file>debian/control</file> file.
ca: Has d'assegurar-te que no hi hagi fitxers en conflicte amb altres paquets fent servir el fitxer <file>Contents-<var>i386</var></file>, (disponible al repositori Debian) per prevenir problemes d'instal·lació en distints sistemes. L'ordre <prgn>apt-file</prgn> serà útil per fer aquesta comprovació. Si hi ha fitxers en conflicte, hauràs de fer el que sigui necessari per evitar-los fent servir el mecanisme d'alternatives (consulta <manref section="1" name="update-alternatives">) en coordinació amb els responsables dels altres paquets o bé establint correctament el camp <tt>Conflicts</tt> del fitxer <file>debian/control</file>.
es: Debes asegurarte que no haya archivos en conflicto con otros paquetes utilizando el archivo <file>Contents-<var>i386</var></file>, (descargándolo del repositorio Debian) para prevenir problemas de instalación en distintos sistemas. La orden <prgn>apt-file</prgn> será útil para realizar esta tarea. Si hay archivos en conflicto, deberás hacer lo necesario para evitar problemas utilizando el mecanismo de alternativas (véase <manref section="1" name="update-alternatives">) coordinándote con los responsables de los otros paquetes o bien estableciendo correctamente el campo <tt>Conflicts</tt> del archivo <file>debian/control</file>.
fr: Vous devez vérifier qu'il n'y a pas de fichier en conflit avec ceux existants dans d'autres paquets à l'aide du fichier <file>Contents-<var>i386</var></file> téléchargé depuis l'archive Debian pour éviter les problèmes d'installation sur différents systèmes. La commande <prgn>apt-file</prgn> peut être pratique pour cela. S'il existe des fichiers en conflit, veuillez prendre les mesures nécessaires pour éviter les vrais problèmes avec le mécanisme d'alternatives (cf. <manref section="1" name="update-alternatives">) en vous coordonnant avec les responsables de l'autre paquet concerné ou en configurant le champs « <tt>Conflicts</tt> » du fichier <file>debian/control</file>.
ja: 他システム上でのインストール問題を未然に防ぐために Debian アーカイブからダウンロードした <file>Contents-<var>i386</var></file> ファイルを使って他の現存パッケージとオーバーラップしたファイルが無いことを確認しなければいけません。<prgn>apt-file</prgn> コマンドはこの作業をするのに便利かもしれません。オーバーラップするファイルがある際には 他の影響を受けるパッケージと共同して alternatives (代用)メカニズム(<manref section="1" name="update-alternatives">参照)を使って実際問題が発生しないようにしたり、 "<tt>Conflicts</tt>" 項目を <file>debian/control</file> ファイル中に設定に設定したり問題回避しましょう。
zh_cn: 你必须使用从 Debian 仓库下载的 <file>Contents-<var>i386</var></file> 文件校验是否在不同系统上存在文件覆盖的问题。<prgn>apt-file</prgn> 命令正适合完成这个任务。如果存在问题，请通过与受影响的软件包合作使用 alternatives 机制来避免实际问题(参看 <manref section="1" name="update-alternatives">)或在 <file>debian/control</file> 文件中设置 <tt>Conflicts</tt> 条目。
zh_tw: 你必須使用從 Debian 倉庫下載的 <file>Contents-<var>i386</var></file> 檔案校驗是否在不同系統上存在檔案覆蓋的問題。<prgn>apt-file</prgn> 命令正適合完成這個任務。如果存在問題，請通過與受影響的套件合作使用 alternatives 機制來避免實際問題(參考 <manref section="1" name="update-alternatives">)或在 <file>debian/control</file> 檔案中設置 <tt>Conflicts</tt> 條目。

source: Verifying package for <em>maintainer scripts</em>
ca: Comprovar els <em>guions del desenvolupador</em> («maintainer scripts»).
es: Comprobando los <em>guiones del desarrollador</em> («maintainer scripts»)
fr: Vérification des <em>scripts du responsable</em> du paquet
it: Verifica del pacchetto per gli <em>script del manutentore</em>
ja: パッケージの<em>メンテナスクリプト</em>に関する確認
zh_cn: 检验 <em>maintainer scripts</em>
zh_tw: 檢驗 <em>maintainer scripts</em>
