Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: If you prefer XML over SGML, you can use the <tt>manpage.xml.ex</tt> template. If you do this, you have to:
ca: I si prefereixes treballar en format XML en lloc de SGML, pots fer servir la plantilla <tt>manpage.xml.ex</tt>. En aquest cas hauràs de fer el següent:
es: Si prefieres el formato XML en lugar de SGML, puedes utilizar la plantilla <tt>manpage.xml.ex</tt>. En este caso debes:
fr: Si vous préférez XML à SGML, vous pouvez utiliser le modèle <tt>manpage.xml.ex</tt>. Si vous le faites, vous devez :
ja: SGMLよりもXMLが好みであれば、<tt>manpage.xml.ex</tt>をひな形として使うこともできます。こちらの場合には、以下の手順が必要です。
zh_cn: 如果你希望使用XML 而非 SGML，可以使用 <tt>manpage.xml.ex</tt> 模板。如果你要这样，需要进行以下步骤：
zh_tw: 如果你希望使用XML 而非 SGML，可以使用 <tt>manpage.xml.ex</tt> 模板。如果你要這樣，需要進行以下步驟：

source: rename the source file to something like <tt>gentoo.1.xml</tt>
ca: reanomenar el fitxer a <tt>gentoo.1.xml</tt>
es: renombrar el archivo a <tt>gentoo.1.xml</tt>
fr: renommer le fichier en quelque chose comme <tt>gentoo.xml</tt> ;
it: rinominare il file in qualcosa del tipo <tt>gentoo.1.xml</tt>
ja: ソースファイルの名前を、<tt>gentoo.1.xml</tt>のような名前に変更します。
zh_cn: 重命名源文件为类似 <tt>gentoo.1.xml</tt> 的名称。
zh_tw: 重命名源檔案爲類似 <tt>gentoo.1.xml</tt> 的名稱。

source: install the <package>docbook-xsl</package> package and an XSLT processor like <package>xsltproc</package> (recommended)
ca: instal·lar el paquet <package>docbook-xsl</package> i un processador XSLT com <package>xsltproc</package> (﻿recomanat)
es: instalar el paquete <package>docbook-xsl</package> y un procesador XSLT como <package>xsltproc</package> (recomendado)
fr: installer le paquet <package>docbook-xsl</package> et un processeur XSLT comme <package>xsltproc</package> (recommandé) ;
it: installare il pacchetto <package>docbook-xsl</package> e l'elaboratore XSLT come <package>xsltproc</package> (recommended)
ja: <package>docbook-xsl</package> パッケージと <package>xsltproc</package> のような XSLT プロセッサのインストール (推奨)
zh_cn: 安装 <package>docbook-xsl</package> 软件包和一个 XSLT 处理器，例如 <package>xsltproc</package> (推荐)。
zh_tw: 安裝 <package>docbook-xsl</package> 套件和一個 XSLT 處理器，例如 <package>xsltproc</package> (推薦)。

source: add the <tt>docbook-xsl</tt>, <tt>docbook-xml</tt> and <tt>xsltproc</tt> packages to the <tt>Build-Depends</tt> line in the <tt>control</tt> file
ca: afegir els paquets <tt>docbook-xsl</tt>, <tt>docbook-xml</tt> i <tt>xsltproc</tt> a la línia de <tt>Build-Depends</tt> en el fitxer <tt>control</tt>
es: añadir los paquetes <tt>docbook-xsl</tt>, <tt>docbook-xml</tt> y <tt>xsltproc</tt> a la línea de <tt>Build-Depends</tt> en el fichero de <tt>control</tt>
fr: ajouter <tt>docbook-xsl</tt>, <tt>docbook-xml</tt> et <tt>xsltproc</tt> à la ligne <tt>Build-Depends</tt> dans le fichier <tt>control</tt> ;
it: aggiungere i pacchetti <tt>docbook-xsl</tt>, <tt>docbook-xml</tt> e <tt>xsltproc</tt> alla linea <tt>Build-Depends</tt> nel file <tt>control</tt>
ja: <tt>control</tt> ファイルの <tt>Build-Depends</tt> 行へ、<tt>docbook-xsl</tt>、<tt>docbook-xml</tt>、<tt>xsltproc</tt>の各パッケージを追加
zh_cn: 在 <file>control</file> 文件的 <tt>Build-Depends</tt> 中添加 <package>docbook-xsl</package>、<package>docbook-xml</package> 和 <package>xsltproc</package> 软件包。
zh_tw: 在 <file>control</file> 檔案的 <tt>Build-Depends</tt> 中添加 <package>docbook-xsl</package>、<package>docbook-xml</package> 和 <package>xsltproc</package> 套件。

source: <file><var>package</var>.manpages</file> file
ca: Fitxer <file><var>nom_paquet</var>.manpages</file>
es: Archivo <file><var>nombre_del_paquete</var>.manpages</file>
fr: Fichier <file><var>paquet</var>.manpages</file>
ja: <file><var>package</var>.manpages</file> ファイル
zh_cn: <file><var>package</var>.manpages</file> 文件
zh_tw: <file><var>package</var>.manpages</file> 檔案

source: If your package has manual pages, you should install them using <manref section="1" name="dh_installman"> by listing them in the <file><var>package</var>.manpages</file> files.
ca: Si el teu paquet té pàgines de manual, les instal·laràs amb <manref section="1" name="dh_installman"> llistant els fitxers corresponents en el fitxer <file><var>nom_paquet</var>.manpages</file>.
es: Si tu paquete tiene páginas de manual, deberías instalarlas con <manref section="1" name="dh_installman"> listando los archivos correspondientes en el archivo <file><var>nombre_del_paquete</var>.manpages</file>.
fr: Si le paquet possède des pages de manuel, vous devriez les installer avec <manref section="1" name="dh_installman"> en les énumérant dans les fichiers <file><var>paquet</var>.manpages</file>.
it: Se il pacchetto creato presenta delle pagine del manuale, queste andrebbero installate utilizzando il comando <manref section="1" name="dh_installman"> ed elencandole nei file <file><var>pacchetto</var>.manpages</file> .
ja: パッケージにマニュアルページがある場合、<file><var>package</var>.manpages</file>にそれらを挙げて、<manref section="1" name="dh_installman">を使用してインストールします。
zh_cn: 如果你的软件包有 man 手册页，你应该将它们列在 <file><var>package</var>.manpages</file> 文件中以便 <manref section="1" name="dh_installman"> 安装。
zh_tw: 如果你的套件有 man 手冊頁，你應該將它們列在 <file><var>package</var>.manpages</file> 檔案中以便 <manref section="1" name="dh_installman"> 安裝。

source: To install <file>doc/gentoo.1</file> for the <package>gentoo</package> package as its manpage, you create a <file>gentoo.manpages</file> file as:
ca: Per instal·lar el fitxer <file>doc/gentoo.1</file> del paquet <package>gentoo</package> com el seu manual, escriu en el fitxer <file>gentoo.manpages</file> el següent:
es: Para instalar el archivo <file>doc/gentoo.1</file> del paquete <package>gentoo</package> como su manual, construirás el archivo <file>gentoo.manpages</file> con el contenido:
fr: Pour installer <file>doc/gentoo.1</file> dans le paquet <package>gentoo</package> en tant que page de manuel, créez le fichier <file>gentoo.manpages</file> contenant :
ja: <package>gentoo</package>パッケージのmanページとして、<file>doc/gentoo.1</file>をインストールするには、<file>gentoo.manpages</file>ファイルを以下のように作成します。
zh_cn: 要将 <file>doc/gentoo.1</file> 安装为 <package>gentoo</package> 的 man 手册页，创建一个 <file>gentoo.manpages</file>，内容如下：
zh_tw: 要將 <file>doc/gentoo.1</file> 安裝爲 <package>gentoo</package> 的 man 手冊頁，創建一個 <file>gentoo.manpages</file>，內容如下：

source: <file>menu</file> file
ca: Fitxer <file>menu.ex</file>.
es: Archivo <file>menu.ex</file>
fr: Fichier <file>menu</file>
it: Il file <file>menu</file>
ja: <file>menu</file> ファイル
zh_cn: <file>menu</file> 文件
zh_tw: <file>menu</file> 檔案

source: X Window System users usually have a window manager with a menu that can be customized to launch programs. If they have installed the Debian <package>menu</package> package, a set of menus for every program on the system will be created for them.
ca: Els usuaris de X Windows fan servir un gestor de finestres amb menús que poden adaptar-se per llançar programes. Si tenen instal·lat el paquet <package>menu</package> de Debian, es construirà un conjunt de menús per a cada programa del sistema.
es: Los usuarios de X Windows suelen tener un gestor de ventanas con menús que pueden adaptarse para lanzar programas. Si tienen instalado el paquete <package>menu</package> de Debian, se generará un conjunto de menús para cada programa del sistema para ellos.
fr: Les utilisateurs de X Window ont un gestionnaire de fenêtres avec un menu qui peut être configuré pour lancer des programmes. S'ils ont installé le paquet <package>menu</package> de Debian, un ensemble de menus pour chaque programme sur le système sera créé pour eux.
it: Gli utenti dell'X Window System solitamente hanno un gestore di finestre che può essere personalizzato per lanciare programmi. Se hanno installato il pacchetto <package>menu</package> , verrà creato un set di menu per ogni programma del sistema.
ja: X Window System のユーザーは、大抵ウィンドウマネージャを使っており、好きなプログラムを起動できるようにメニュー機能をカスタマイズしています。<package>menu</package> パッケージをインストールしていれば、システムにある全プログラムのメニュー項目が作成され、menu に対応したウィンドウマネージャから利用できます。
zh_cn: X Windows 系统用户通常有窗口管理器，并且带有可定制的菜单用于启动程序。如果他们安装了 Debian 的 <package>menu</package> 软件包，整个系统中所有已安装软件的一系列菜单将会被自动创建。
zh_tw: X Windows 系統用戶通常有窗口管理器，並且帶有可定製的菜單用於啓動程式。如果他們安裝了 Debian 的 <package>menu</package> 套件，整個系統中所有已安裝軟體的一系列菜單將會被自動創建。

source: Here's the default <file>menu.ex</file> file that <prgn>dh_make</prgn> created:
ca: Aquest és el contingut del fitxer <file>menu.ex</file> que <prgn>dh_make</prgn> construeix com a exemple:
es: Éste es el fichero <file>menu.ex</file> que <prgn>dh_make</prgn> construye por omisión:
fr: Voici le fichier <tt>menu.ex</tt> créé par défaut par <prgn>dh_make</prgn> :
it: Questo è il modello del file <file>menu.ex</file> che il comando <prgn>dh_make</prgn> crea:
ja: 以下が dh_make によって生成されたデフォルトの <tt>menu.ex</tt> ファイルです。
zh_cn: 以下是 <prgn>dh_make</prgn> 创建的默认的 <file>menu.ex</file> 文件：
zh_tw: 以下是 <prgn>dh_make</prgn> 創建的默認的 <file>menu.ex</file> 檔案：

source: ?package(gentoo):needs="X11|text|vc|wm" \ section="Applications/see-menu-manual"\ title="gentoo" command="/usr/bin/gentoo"
ca: ?package(gentoo):needs="X11|text|vc|wm" section="Apps/llegeix-manual-menu"\ title="gentoo" command="/usr/bin/gentoo"
es: ?package(gentoo):needs="X11|text|vc|wm" section="Apps/lea-manual-menu"\ title="gentoo" command="/usr/bin/gentoo"

source: The first field after the colon character is <tt>needs</tt>, and it specifies what kind of interface the program needs. Change this to one of the listed alternatives, e.g. <tt>text</tt> or <tt>X11</tt>.
ca: El primer camp després de la coma (<tt>needs</tt>) són els requisits del programa i especifica el tipus d'interfície gràfica feta servir pel programa. Canvia a una de les alternatives llistades, p.ex. <tt>text</tt> o <tt>X11</tt>.
es: El primer campo tras la coma es <tt>needs</tt> (necesidades) y especifica qué tipo de interfaz necesita el programa. Cambia ésta a una de las alternativas que se listan, como por ejemplo <tt>text</tt> o <tt>X11</tt>..
fr: Le premier champ après les deux points est « <tt>needs</tt> », il indique le genre d'interface dont a besoin le programme. Changez ceci en une des alternatives énumérées, par exemple « <tt>text</tt> » ou « <tt>X11</tt> ».
it: Il primo campo dopo i due punti è <tt>needs</tt>, e specifica il tipo di interfaccia di cui ha bisogno il programma. Questo valore può essere cambiato con una delle alternative elencate, ad esempio <tt>text</tt> o <tt>X11</tt>.
ja: コロン (:) の後の最初のフィールドは<tt>needs</tt>です。このフィールドは、プログラムがどんなどんなインターフェースが必要かを規定します。デフォルトとして挙げられたもの（例：<tt>text</tt> や <tt>X11</tt>など）に変更してください。
zh_cn: 冒号后的第一个域是 <tt>needs</tt>，它指定了程序需要何种界面。修改此处为列出的选项之一，例如 <tt>text</tt> 或 <tt>X11</tt>。
zh_tw: 冒號後的第一個域是 <tt>needs</tt>，它指定了程式需要何種界面。修改此處爲列出的選項之一，例如 <tt>text</tt> 或 <tt>X11</tt>。

source: The next is <tt>section</tt>, where the menu and submenu the entry should appear in. The current list of sections <footnote><p>There were a major reorganization of menu structure for <tt>squeeze</tt>.</p></footnote> is at: <file>/usr/share/doc/debian-policy/menu-policy.html/ch2.html#s2.1</file>
ca: La <tt>section</tt> és la secció (menú i sub-menú) on hauria d'aparèixer l'entrada de menú del programa. La llista actual de seccions <footnote><p>S'ha fet una reorganització important a <tt>squeeze</tt></p></footnote> està a <file>/usr/share/doc/debian-policy/menu-policy.html/ch2.html#s2.1</file>.
es: El siguiente <tt>section</tt>, es la sección donde deberían aparecer la entrada del menú y del submenú. La lista actual de secciones <footnote><p>Hubo una importante reorganización de la estructura del menú para <tt>squeeze</tt>.</p></footnote> está en: <file>/usr/share/doc/debian-policy/menu-policy.html/ch2.html#s2.1</file>
fr: Le suivant est <tt>section</tt>, avec le menu et le sous-menu dans lesquels l'entrée devrait apparaître. La liste actuelle des sections <footnote><p>Il y a eu une réorganisation majeure de la structure du menu pour <tt>Squeeze</tt>.</p></footnote> est dans : <file>/usr/share/doc/debian-policy/menu-policy.html/ch2.html#s2.1</file>.
it: Il campo successivo è <tt>section</tt>, in cui dovrebbero apparire le voci del menu e del sottomenu. L'attuale lista delle sezioni <footnote><p>Si noti che è avvenuta una grossa riorganizzazione della struttura dei menu.</p></footnote> si trova in: <file>/usr/share/doc/debian-policy/menu-policy.html/ch2.html#s2.1</file>
ja: 次は<tt>section</tt>、プログラムのエントリーが表示されるメニューやサブメニューの指定です。現在のセクションの一覧は<footnote><p><tt>squeeze</tt>向けに、大規模なメニュー構造の見直しが行われました。</p></footnote><file>/usr/share/doc/debian-policy/menu-policy.html/ch2.html#s2.1</file>に記載されています。
zh_cn: 接下来是 <tt>section</tt>，包含菜单和子菜单项。当前可用的章节列表<footnote><p><tt>squeeze</tt> 的列表和以前的有了较大的调整。</p></footnote>位于：<file>/usr/share/doc/debian-policy/menu-policy.html/ch2.html#s2.1</file>
zh_tw: 接下來是 <tt>section</tt>，包含菜單和子菜單項。當前可用的章節列表<footnote><p><tt>squeeze</tt> 的列表和以前的有了較大的調整。</p></footnote>位於：<file>/usr/share/doc/debian-policy/menu-policy.html/ch2.html#s2.1</file>

source: The <tt>title</tt> field is the name of the program. You can start this one in uppercase if you like. Just keep it short.
ca: El camp <tt>title</tt> és el nom del programa (o millor el text que apareixerà en el menú). Pots començar el nom en majúscules si vols, però és convenient fer-ho curt.
es: El campo <tt>title</tt> es el nombre del programa. Puedes comenzar éste en mayúsculas si así lo prefieres, pero hazlo lo más corto que puedas.
fr: Le champ <tt>title</tt> est le nom du programme. Vous pouvez le commencer par une majuscule si vous le souhaitez. Mais gardez-le court.
it: Il campo <tt>title</tt> indica il nome del programma. Se si vuole si può scrivere in maiuscolo. Basta che si mantenga corto.
ja: <tt>title</tt>フィールドはプログラムの名称です。そうしたければ、大文字ではじめても大丈夫です。ただ、短くするようにしましょう。
zh_cn: <tt>title</tt> 域是程序的名称，它可以用大写字母开头，只需保证它不要很长。
zh_tw: <tt>title</tt> 域是程式的名稱，它可以用大寫字母開頭，只需保證它不要很長。

source: Finally, the <tt>command</tt> field is the command that runs the program.
ca: El camp <tt>command</tt> és l'ordre que executa el programa.
es: Finalmente, el campo <tt>command</tt> es la orden que ejecuta el programa.
fr: Enfin, le champ <tt>command</tt> est la commande qui exécute le programme.
it: Infine, il campo <tt>command</tt> indica il comando che manda in esecuzione il programma.
ja: 最後の <tt>command</tt> フィールドは、実際にプログラムを実行するコマンドです。
zh_cn: 最后的 <tt>command</tt> 域是运行此程序时使用的命令。
zh_tw: 最後的 <tt>command</tt> 域是運行此程式時使用的命令。

source: Let's change the file name to <file>menu</file> and change the menu entry to this:
ca: En el cas de <package>gentoo</package>, el fitxer quedarà així:
es: Vamos a cambiar el nombre del archivo a <file>menu</file> y la entrada del menú por ésta:
fr: Une fois le fichier renommé en <file>menu</file>, l'entrée de menu peut être modifiée comme ceci :
it: Si può quindi cambiare il file <file>menu</file> e la voce del menu nel modo seguente:
ja: それでは、ファイル名を<file>menu</file>に変更し、メニューのエントリーを以下のように変更しましょう。
zh_cn: 我们把文件名修改为 <file>menu</file>，并修改其内容为：
zh_tw: 我們把檔案名修改爲 <file>menu</file>，並修改其內容爲：

source: You can also add other fields like <tt>longtitle</tt>, <tt>icon</tt>, <tt>hints</tt> etc. See <manref section="1" name="dh_installmenu">, <manref section="5" name="menufile">, <manref section="1" name="update-menus"> and <file>/usr/share/doc/debian-policy/menu-policy.html/</file> for more information.
ca: També pots afegir altres camps com <tt>longtitle</tt> (títol llarg), <tt>icon</tt> (icona), <tt>hints</tt> (pistes), etc. Consulta <manref section="1" name="dh_installmenu">, <manref section="5" name="menufile">, <manref section="1" name="update-menus"> i <file>/usr/share/doc/debian-policy/menu-policy.html/</file>.
es: También puedes añadir otros campos como son <tt>longtitle</tt> (título largo), <tt>icon</tt> (icono), <tt>hints</tt> (pistas), etc. Para más información consulta <manref section="1" name="dh_installmenu">, <manref section="5" name="menufile">, <manref section="1" name="update-menus"> y <file>/usr/share/doc/debian-policy/menu-policy.html/</file>.
fr: Vous pouvez aussi ajouter d'autres champs comme <tt>longtitle</tt>, <tt>icon</tt>, <tt>hints</tt>, etc. Voir <manref section="1" name="dh_installmenu">, <manref section="5" name="menufile">, <manref section="1" name="update-menus"> et <file>/usr/share/doc/debian-policy/menu-policy.html/</file> pour plus d'informations.
it: Si possono anche aggiungere altri campi come <tt>longtitle</tt>, <tt>icon</tt>, <tt>hints</tt> ecc. Si veda <manref section="1" name="dh_installmenu">, <manref section="5" name="menufile">, <manref section="1" name="update-menus"> e <file>/usr/share/doc/debian-policy/menu-policy.html/</file> per maggiori informazioni.
ja: 他にも、<tt>longtitle</tt>、<tt>icon</tt>、<tt>hints</tt>などのフィールドを追加できます。詳しくは <manref section="1" name="dh_installmenu">、 <manref section="5" name="menufile">、 <manref section="1" name="update-menus">、<file>/usr/share/doc/debian-policy/menu-policy.html/</file>を参照してください。
zh_cn: 你还可以添加诸如 <tt>longtitle</tt>、<tt>icon</tt>、<tt>hints</tt> 等域。参看 <manref section="1" name="dh_installmenu">、<manref section="5" name="menufile">、<manref section="1" name="update-menus"> 和 <file>/usr/share/doc/debian-policy/menu-policy.html/</file> 了解更多信息。
zh_tw: 你還可以添加諸如 <tt>longtitle</tt>、<tt>icon</tt>、<tt>hints</tt> 等域。參考 <manref section="1" name="dh_installmenu">、<manref section="5" name="menufile">、<manref section="1" name="update-menus"> 和 <file>/usr/share/doc/debian-policy/menu-policy.html/</file> 瞭解更多訊息。

source: <file>NEWS</file> file
ca: Fitxer <file>NEWS</file>.
es: Archivo <file>NEWS</file>
fr: Fichier <file>NEWS</file>
it: Il file <file>NEWS</file>
ja: <file>NEWS</file> ファイル
zh_cn: <file>NEWS</file> 文件
zh_tw: <file>NEWS</file> 檔案

source: The <manref section="1" name="dh_installchangelogs"> command installs this.
ca: L'ordre <manref section="1" name="dh_installchangelogs"> instal·la aquest arxiu.
es: La orden <manref section="1" name="dh_installchangelogs"> instala este archivo.
fr: La commande <manref section="1" name="dh_installchangelogs"> l'installe.
it: Il comando <manref section="1" name="dh_installchangelogs"> installa questo file.
ja: <manref section="1" name="dh_installchangelogs">コマンドでインストールします。
zh_cn: <manref section="1" name="dh_installchangelogs"> 命令会安装这个文件。
zh_tw: <manref section="1" name="dh_installchangelogs"> 命令會安裝這個檔案。

source: <file>{post|pre}{inst|rm}</file> files
ca: Fitxers <file>{post|pre}{inst|rm}</file>
es: Archivos <file>{post|pre}{inst|rm}</file>
fr: Fichier <file>{post|pre}{inst|rm}</file>
it: I file <file>{post|pre}{inst|rm}</file>
ja: <file>{post|pre}{inst|rm}</file> ファイル
zh_cn: <file>{post|pre}{inst|rm}</file> 文件
zh_tw: <file>{post|pre}{inst|rm}</file> 檔案

source: These <file>postinst</file>, <file>preinst</file>, <file>postrm</file>, and <file>prerm</file> files <footnote><p>Although I used Bash short hand expression to indicate these files as "<file>{post|pre}{inst|rm}</file>" here, I recommend you to use pure POSIX (non-Bash) shell for these <em>maintainer scripts</em> as much as possible for the better compatibility.</p></footnote> are called <em>maintainer scripts</em>. They are scripts which are put in the control area of the package and run by <prgn>dpkg</prgn> when your package is installed, upgraded or removed.
ca: Els fitxers <file>postinst</file>, <file>preinst</file>, <file>postrm</file>, i <file>prerm</file> <footnote><p>Encara que aquí he utilitzat l'expressió «Bash» abreujada "<file>{post|pre}{inst|rm}</file>" dels noms dels fitxers, et recomano que facis servir la forma POSIX («non-Bash») pura per a aquests <em>guions dels desenvolupadors</em> de manera que conservin el major grau de compatibilitat. </p></footnote> s'anomenen <em>guions del desenvolupador</em> («maintainer scripts»), i són guions que es col·loquen en l'àrea de control del paquet i són executats pel paquet <package>dpkg</package> quan el teu paquet s'instal·la, s'actualitza o és eliminat.
es: Los ficheros <file>postinst</file>, <file>preinst</file>, <file>postrm</file>, y <file>prerm</file> <footnote><p>Aunque aquí he utilizado la expresión «Bash» abreviada "<file>{post|pre}{inst|rm}</file>" para referirme a estos archivos, te recomiendo que uses la forma POSIX («non-Bash») pura para estos <em>guiones del desarrollador</em> de forma que conserven el mayor grado de compatibilidad.</p></footnote> se llaman <em>guiones del desarrollador</em> («maintainer scripts»), y son guiones que se colocan en el área de control del paquete y que <package>dpkg</package> ejecuta cuando tu paquete se instala, se actualiza o se elimina.
fr: Ces fichiers <file>postinst</file>, <file>preinst</file>, <file>postrm</file>, et <file>prerm</file> <footnote><p>Même s'ils ont été présentés par un raccourci Bash « <file>{post|pre}{inst|rm}</file> », il est préférable d'utiliser un shell pur POSIX (non Bash) pour ces <em>scripts du responsable</em> pour des raisons de compatibilité.</p></footnote> sont nommés <em>scripts du responsable</em>. Ces scripts sont placés dans la zone de contrôle du paquet et sont exécutés par <prgn>dpkg</prgn> lorsque le paquet est installé, mis à jour ou supprimé.
it: I files <file>postinst</file>, <file>preinst</file>, <file>postrm</file> e <file>prerm</file> <footnote><p>Anche se è stata utilizzata una corta espressione Bash per indicare questi file come "<file>{post|pre}{inst|rm}</file>" , si raccomanda di utilizzare una shell POSIX (non Bash) per questi <em>script del manutentore</em> il più possibile per massimizzare la compatibilità.</p></footnote> vengono chiamati <em>script del manutentore</em>. Questi sono script che vengono messi nell'area di controllo del pacchetto e vengono lanciati dal comando <prgn>dpkg</prgn> quando il pacchetto viene installato, aggiornato o rimosso.
ja: <file>postinst</file>、<file>preinst</file>、<file>postrm</file>、そして <file>prerm</file>ファイルは <footnote><p>ここでは簡略化するために"<file>{postpre}{instrm}</file>"にBashを使っていますが、<em>maintainer scripts</em>には、互換性の観点から、可能な限りPOSIX（Bashではない）シェルを使うべきでしょう。</p></footnote><em>maintainer scripts</em>と呼ばれています。これらのスクリプトは、パッケージを管理するアリアに置かれ、インストール、アップグレード、削除される際に<prgn>dpkg</prgn>によって実行されます。
zh_cn: <file>postinst</file>、<file>preinst</file>、<file>postrm</file> 和 <file>prerm</file> 文件 <footnote><p>尽管我使用了 Bash 短表达式在此处指出这些文件是 <file>{post|pre}{inst|rm}</file>，但仍然建议你在这些 <em>maintainer scripts</em> 中尽可能地使用纯粹的 POSIX (非 Bash)脚本来提供最佳的兼容性。</p></footnote> 被称为 <em>maintainer scripts</em>。它们是放置于软件包控制信息区域，并由 <prgn>dpkg</prgn> 在软件包安装、升级或卸载时执行的脚本。
zh_tw: <file>postinst</file>、<file>preinst</file>、<file>postrm</file> 和 <file>prerm</file> 檔案 <footnote><p>儘管我使用了 Bash 短表達式在此處指出這些檔案是 <file>{post|pre}{inst|rm}</file>，但仍然建議你在這些 <em>maintainer scripts</em> 中儘可能地使用純粹的 POSIX (非 Bash)腳本來提供最佳的兼容性。</p></footnote> 被稱爲 <em>maintainer scripts</em>。它們是放置於套件控制訊息區域，並由 <prgn>dpkg</prgn> 在套件安裝、升級或反安裝時執行的腳本。
