Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: If you encounter an upload problem at <url id="&ftp-uploadqueue;">, you can fix this by manually uploading GPG signed <file>*.commands</file> file to there with <prgn>ftp</prgn>. <footnote><p>See <url id="&ftp-command;">. Alternatively, you may use <prgn>dcut</prgn> command from the <package>dput</package> package. </p></footnote> For example, use <file>hello.commands</file>:
ca: Si trobes algun problema amb la pujada del paquet a <url id="&ftp-uploadqueue;">, pots solucionar-ho pujant manualment a <url id="&ftp-uploadqueue;"> amb <prgn>ftp</prgn> un arxiu <file>*.commands</file> signat amb GPG <footnote><p>Consulta <url id="&ftp-command;">. Com alternativa, pots fer servir l'ordre <prgn>dcut</prgn> del paquet <package>dput</package>. </p></footnote>. Com exemple, aquest arxiu <file>hola.commands</file>:
es: Si encuentras algún problema con la subida del paquete a <url id="&ftp-uploadqueue;">, puedes arreglarlo subiendo manualmente a <url id="&ftp-uploadqueue;"> mediante <prgn>ftp</prgn> un fichero «<file>*.commands</file>» firmado con gnupg <footnote><p>Véase <url id="&ftp-command;">. Como alternativa, puedes usar la orden <prgn>dcut</prgn> del paquete <package>dput</package>. </p></footnote>. Por ejemplo, usando «<file>hello.commands</file>»:
fr: Si vous rencontrez un problème d'envoi à <url id="&ftp-uploadqueue;">, vous pouvez le résoudre manuellement en envoyant un fichier <file>*.commands</file> signé avec GPG à <url id="&ftp-uploadqueue;"> avec <prgn>ftp</prgn>. <footnote><p>Voyez <url id="&ftp-command;">. Vous pouvez aussi utiliser la commande <prgn>dcut</prgn> du paquet <package>dput</package>. </p></footnote> Par exemple, utilisez <file>hello.commands</file> :
it: Se si incontrano problemi nel caricamento su <url id="&ftp-uploadqueue;">, si può porre rimedio caricando automaticamente il file <file>*.commands</file> firmato con GPG via <prgn>ftp</prgn>. <footnote><p>Si veda <url id="&ftp-command;">. Alternativamente, si può utilizzare il comando <prgn>dcut</prgn> del pacchetto <package>dput</package>. </p></footnote> Per esempio, si prenda il file <file>hello.commands</file>:
zh_cn: 如果你在 <url id="&ftp-uploadqueue;"> 遇到了上传问题，你可以通过 ftp 手工上传一个用 GPG 签署的 <file>*.commands</file> 文件到那里。<footnote><p>参看 <url id="&ftp-command;">。另外你也可以使用来自 <package>dput</package> 的 <prgn>dcut</prgn> 命令。</p></footnote>例如使用 <file>hello.commands</file>：
zh_tw: 如果你在 <url id="&ftp-uploadqueue;"> 遇到了上傳問題，你可以通過 ftp 手工上傳一個用 GPG 簽署的 <file>*.commands</file> 檔案到那裏。<footnote><p>參考 <url id="&ftp-command;">。另外你也可以使用來自 <package>dput</package> 的 <prgn>dcut</prgn> 命令。</p></footnote>例如使用 <file>hello.commands</file>：

source: -----BEGIN PGP SIGNED MESSAGE----- Uploader: Foo Bar &lt;Foo.Bar@example.org&gt; Commands: rm hello_1.0-1_i386.deb mv hello_1.0-1.dsx hello_1.0-1.dsc -----BEGIN PGP SIGNATURE----- Version: 2.6.3ia iQCVAwUBNFiQSXVhJ0HiWnvJAQG58AP+IDJVeSWmDvzMUphScg1EK0mvChgnuD7h BRiVQubXkB2DphLJW5UUSRnjw1iuFcYwH/lFpNpl7XP95LkLX3iFza9qItw4k2/q tvylZkmIA9jxCyv/YB6zZCbHmbvUnL473eLRoxlnYZd3JFaCZMJ86B0Ph4GFNPAf Z4jxNrgh7Bc= =pH94 -----END PGP SIGNATURE-----
ca: -----BEGIN PGP SIGNED MESSAGE----- Uploader: el_teu_nom_i_llinatge &lt; la_teva_adreça_electrònica; Commands: rm hello_1.0-1_i386.deb mv hello_1.0-1.dsx hello_1.0-1.dsc -----BEGIN PGP SIGNATURE----- Version: 2.6.3ia iQCVAwUBNFiQSXVhJ0HiWnvJAQG58AP+IDJVeSWmDvzMUphScg1EK0mvChgnuD7h BRiVQubXkB2DphLJW5UUSRnjw1iuFcYwH/lFpNpl7XP95LkLX3iFza9qItw4k2/q tvylZkmIA9jxCyv/YB6zZCbHmbvUnL473eLRoxlnYZd3JFaCZMJ86B0Ph4GFNPAf Z4jxNrgh7Bc= =pH94 -----END PGP SIGNATURE-----
es: -----BEGIN PGP SIGNED MESSAGE----- Uploader: tu_nombre_y_apellido &lt; tu_dirección_electrónica; Commands: rm hello_1.0-1_i386.deb mv hello_1.0-1.dsx hello_1.0-1.dsc -----BEGIN PGP SIGNATURE----- Version: 2.6.3ia iQCVAwUBNFiQSXVhJ0HiWnvJAQG58AP+IDJVeSWmDvzMUphScg1EK0mvChgnuD7h BRiVQubXkB2DphLJW5UUSRnjw1iuFcYwH/lFpNpl7XP95LkLX3iFza9qItw4k2/q tvylZkmIA9jxCyv/YB6zZCbHmbvUnL473eLRoxlnYZd3JFaCZMJ86B0Ph4GFNPAf Z4jxNrgh7Bc= =pH94 -----END PGP SIGNATURE-----
fr: -----BEGIN PGP SIGNED MESSAGE----- Uploader: Prénom Nom &lt;votre.adresse.mail@example.org&gt; Commands: rm hello_1.0-1_i386.deb mv hello_1.0-1.dsx hello_1.0-1.dsc -----BEGIN PGP SIGNATURE----- Version: 2.6.3ia iQCVAwUBNFiQSXVhJ0HiWnvJAQG58AP+IDJVeSWmDvzMUphScg1EK0mvChgnuD7h BRiVQubXkB2DphLJW5UUSRnjw1iuFcYwH/lFpNpl7XP95LkLX3iFza9qItw4k2/q tvylZkmIA9jxCyv/YB6zZCbHmbvUnL473eLRoxlnYZd3JFaCZMJ86B0Ph4GFNPAf Z4jxNrgh7Bc= =pH94 -----END PGP SIGNATURE-----

source: See <url id="http://mentors.debian.net/cgi-bin/welcome" name="mentors.debian.net"> for publically accessible upload area for non-DD.
ca: Consulta <url id="http://mentors.debian.net/cgi-bin/welcome" name="mentors.debian.net"> per conèixer el procediment en el cas que no siguis desenvolupador Debian.
es: Lee <url id="http://mentors.debian.net/cgi-bin/welcome" name="mentors.debian.net"> para saber cómo enviar tu paquete en el caso que no seas Desarrollador de Debian (DD).
fr: Voyez <url id="http://mentors.debian.net/cgi-bin/welcome" name="mentors.debian.net"> pour un espace d'envoi accessible publiquement aux non-DD (développeurs Debian).
it: Si veda <url id="http://mentors.debian.net/cgi-bin/welcome" name="mentors.debian.net"> per l'area pubblica di caricamento per gli sviluppatori non Debian.
zh_cn: 查看 <url id="http://mentors.debian.net/cgi-bin/welcome" name="mentors.debian.net"> 来了解对于非 Debian Developer 可用的公共上传位置。
zh_tw: 查看 <url id="http://mentors.debian.net/cgi-bin/welcome" name="mentors.debian.net"> 來瞭解對於非 Debian Developer 可用的公共上傳位置。

source: See <url id="http://www.debian.org/doc/manuals/debian-reference/ch02.en.html#_small_public_package_archive" name="Debian Reference, 2.7.12. 'Small public package archive'"> for an example for creating a small public package archive compatible with the modern secure APT system.
ca: Consulta <url id="http://www.debian.org/doc/manuals/debian-reference/ch02.en.html#_small_public_package_archive" name="«Debian Reference», 2.7.12. 'Petit repositori públic de paquets'"> per saber com construir un repositori personal públic compatible amb el moder i segur sistema APT.
es: Lee <url id="http://www.debian.org/doc/manuals/debian-reference/ch02.en.html#_small_public_package_archive" name="Debian Reference, 2.7.12. 'Pequeño repositorio público de paquetes'"> para saber cómo construir un repositorio personal público compatible con el moderno y seguro sistema APT.
fr: Voyez la <url id="http://www.debian.org/doc/manuals/debian-reference/ch02.fr.html#_small_public_package_archive" name="référence Debian, 2.7.12 « Petite archive publique de paquets »"> pour un exemple de création de petite archive publique de paquets compatible avec le système APT moderne et sécurisé.
it: Si veda <url id="http://www.debian.org/doc/manuals/debian-reference/ch02.en.html#_small_public_package_archive" name="Debian Reference, 2.7.12. 'Small public package archive'"> per avere un esempio di creazione di un piccolo archivio pubblico di pacchetti che sia compatibile con il moderno e sicuro sistema APT.
zh_cn: 访问 <url id="http://www.debian.org/doc/manuals/debian-reference/ch02.en.html#_small_public_package_archive" name="Debian Reference, 2.7.12. 'Small public package archive'"> 来查看一个创建与现代的安全 APT 系统兼容的公共软件包仓库的例子。
zh_tw: 訪問 <url id="http://www.debian.org/doc/manuals/debian-reference/ch02.en.html#_small_public_package_archive" name="Debian Reference, 2.7.12. 'Small public package archive'"> 來查看一個創建與現代的安全 APT 系統兼容的公共套件倉庫的例子。

source: Skipped uploads
ca: Enviaments discontinuats.
es: Envíos discontinuados
fr: Versions non envoyées
zh_cn: 跳过的上传
zh_tw: 跳過的上傳

source: If you created multiple entries in <file>debian/changelog</file> by skipping uploads, you must create a proper <file>*_.changes</file> file which includes all changes from the last upload.
ca: Si en el fitxer <file>debian/changelog</file> hi ha diverses entrades corresponents a diferents versions del paquet, però alguna d'elles no s'ha enviat al repositori, hauràs de generar correctament un arxiu <file>*_.changes</file> que inclogui totes les modificacions des de la darrera versió present en el repositori.
es: Si en el archivo <file>debian/changelog</file> hay diversas entradas correspondientes a diferentes versiones del paquete, pero alguna de ellas no se ha enviado al repositorio, deberás generar correctamente un archivo <file>*_.changes</file> que incluya todas las modificaciones desde la última versión presente en el repositorio.
fr: Si plusieurs éléments (relatifs à plusieurs révisions) sont ajoutés à <file>debian/changelog</file>, mais que des envois sont sautés, il faut créer un fichier <file>*_.changes</file> correct incluant toutes les modifications depuis le dernier envoi.
zh_cn: 如果你在 <file>debian/changelog</file> 创建了多个条目并跳过了上传，你必须创建一个对应的 <file>*_.changes</file> 文件，其中包含自上次上传以来的全部变更记录。
zh_tw: 如果你在 <file>debian/changelog</file> 創建了多個條目並跳過了上傳，你必須創建一個對應的 <file>*_.changes</file> 檔案，其中包含自上次上傳以來的全部變更記錄。

source: This can be done by specifying <tt>-v</tt> option to the package building programs such as <prgn>dpkg-buildpackage</prgn>, <prgn>debuild</prgn>, <prgn>pdebuild</prgn>, etc.
ca: Pots fer això afegint l'opció <tt>-v</tt> en l'execució de les ordres <prgn>dpkg-buildpackage</prgn>, <prgn>debuild</prgn>, <prgn>pdebuild</prgn>, etc en la construcció del paquet.
es: Puedes hacer esto añadiendo la opción <tt>-v</tt> en la ejecución de las órdenes <prgn>dpkg-buildpackage</prgn>, <prgn>debuild</prgn>, <prgn>pdebuild</prgn>, etc en la construcción del paquete.
fr: Ce peut être réalisé en précisant l'option <tt>-v</tt> lors de la construction du paquet avec <prgn>dpkg-buildpackage</prgn>, <prgn>debuild</prgn>, <prgn>pdebuild</prgn>, etc.
zh_cn: 这可以通过传递 <tt>-v</tt> 选项给例如 <prgn>dpkg-buildpackage</prgn>、<prgn>debuild</prgn>、<prgn>pdebuild</prgn> 等软件构建程序来完成。
zh_tw: 這可以通過傳遞 <tt>-v</tt> 選項給例如 <prgn>dpkg-buildpackage</prgn>、<prgn>debuild</prgn>、<prgn>pdebuild</prgn> 等軟體構建程式來完成。

source: Updating the package
ca: Actualitzar el paquet.
es: Actualizar el paquete
fr: Mise à jour de paquet
it: Aggiornamento del pacchetto
ja: パッケージの更新
zh_cn: 更新软件包
zh_tw: 更新套件

source: Once you release a package, you need to update it soon.
ca: Després del llançament del paquet, és possible que hagis d'actualitzar-ho aviat.
es: Después del lanzamiento del paquete, es posible que debas actualizarlo pronto.
fr: Une fois un paquet publié, il sera nécessaire de le mettre à jour assez vite.
it: Una volta rilasciato un pacchetto, ci sarà presto bisogno di aggiornarlo.
zh_cn: 一旦你发布了一个软件包，在之后的某个时间里就需要对它进行更新。
zh_tw: 一旦你發佈了一個套件，在之後的某個時間裏就需要對它進行更新。

source: New Debian revision
ca: Nova revisió Debian del paquet.
es: Nueva revisión Debian del paquete
fr: Nouvelle révision Debian
it: Nuova revisione Debian
ja: Debian リビジョンの更新
zh_cn: 新的 Debian 版本
zh_tw: 新的 Debian 版本

source: Let's say that a bug report was filed against your package as <tt>#54321</tt>, and it describes a problem that you can solve. To create a new Debian revision of the package, you need to:
ca: Suposem que s'ha creat un informe d'error del teu paquet amb el número <tt>#54321</tt>, i que descriu un problema que pots solucionar. Per construir una nova revisió del paquet, necessites:
es: Supongamos que se ha creado un informe de fallo en tu paquete con el número <tt>#54321</tt>, y que describe un problema que puedes solucionar. Para construir una nueva revisión del paquete, necesitas:
fr: Soit un rapport de bogue numéroté <tt>#54321</tt>, concernant votre paquet et décrivant un problème que vous pouvez résoudre. Pour créer une nouvelle révision du paquet, vous devez :
it: Si supponga che sia stato compilato il bug report <tt>#54321</tt> per il pacchetto creato, e che questo descriva un problema che si può risolvere. Per creare una nuova revisione del pacchetto Debian, si proceda come qui di seguito descritto:
ja: 例えば仮に、<tt>#54321</tt> という番号のバグレポートがあなたのパッケージ に対してファイルされ、解決可能な問題が記述されていたとしましょう。 パッケージの新しい Debian リビジョンを作成するには、以下を実行する 必要があります。
zh_cn: 假设针对你的软件包报告的 Bug 号为 <tt>#54321</tt>，它描述了一个你可以解决的问题。要创建软件包的一个新 Debian 版本，你需要：
zh_tw: 假設針對你的套件報告的 Bug 號爲 <tt>#54321</tt>，它描述了一個你可以解決的問題。要創建套件的一個新 Debian 版本，你需要：

source: If this is to be recorded as a new patch, do the following.
ca: Si cal aplicar una nova modificació, executa:
es: Si debes aplicar una modificación nueva, ejecuta:
fr: pour un nouveau correctif :
it: Se la modifica deve essere registrata come una nuova patch, si seguano queste istruzioni.
zh_cn: 如果要将它记录于新的补丁中，这样做：
zh_tw: 如果要將它記錄於新的補丁中，這樣做：

source: "<tt>quilt new <var>bugname.patch</var></tt>" to set patch name;
ca: <tt>quilt new <var>nom_modificació.patch</var></tt> per establir el nom de la modificació.
es: <tt>quilt new <var>nombre_modificación.patch</var></tt> para establecer el nombre de la modificación;
fr: configurer le nom du correctif : « <tt>quilt new <var>nomdubogue.patch</var></tt> » ;
zh_cn: <tt>quilt new <var>bugname.patch</var></tt> 设置补丁名称；
zh_tw: <tt>quilt new <var>bugname.patch</var></tt> 設置補丁名稱；

source: "<tt>quilt add <var>buggy-file</var></tt>" to declare file to be modified;
ca: <tt>quilt add <var>arxiu_a_modificar</var></tt> per establir el fitxer al qual s'aplicarà la modificació.
es: <tt>quilt add <var>archivo_a_modificar</var></tt> para establecer el fichero al cual se aplicará la modificación.
fr: déclarer le fichier à modifier : « <tt>quilt add <var>fichier-bogué</var></tt> » ;
zh_cn: <tt>quilt add <var>buggy-file</var></tt> 声明文件将被更改；
zh_tw: <tt>quilt add <var>buggy-file</var></tt> 聲明檔案將被更改；

source: Correct the problem in the package source for the upstream bug;
ca: Corregir el problema en el paquet de fonts degut a un error de l'autor.
es: Corregir el problema en el archivo original.
fr: corriger le problème dans le paquet source pour le bogue amont ;
ja: アップストリームバグに関してパッケージソース中の問題を修正します。
zh_cn: 修正软件包代码中的上游 Bug；
zh_tw: 修正套件程式碼中的上游 Bug；

source: "<tt>quilt refresh</tt>" to record to <file><var>bugname.patch</var></file>;
ca: <tt>quilt refresh</tt> per desar els canvis realitzats en el fitxer del pegat <file><var>nom_modificació.patch</var></file>.
es: <tt>quilt refresh</tt> para guardar los cambios realizados en el archivo del parche <file><var>nombre_modificación.patch</var></file>.
fr: l'enregistrer en <file><var>nomdubogue.patch</var></file> : « <tt>quilt refresh</tt> » ;
zh_cn: <tt>quilt refresh</tt> 将修改记录到 <file><var>bugname.patch</var></file>；
zh_tw: <tt>quilt refresh</tt> 將修改記錄到 <file><var>bugname.patch</var></file>；

source: "<tt>quilt header -e</tt>" to add its description;
ca: "<tt>quilt header -e</tt>" per afegir la descripció;
es: "<tt>quilt header -e</tt>" para añadir la descripción (breve) del cambio realizado;
fr: ajouter sa description : « <tt>quilt header -e</tt> » ;
zh_cn: <tt>quilt header -e</tt> 添加对它的描述；
zh_tw: <tt>quilt header -e</tt> 添加對它的描述；

source: If this is to update an existing patch, do the following.
ca: Si cal actualitzar una modificació ja existent, executa:
es: Si debes actualizar una modificación ya existente, ejecuta:
fr: pour la mise à jour d'un correctif :
it: Se la modifica è un aggiornamento ad una patch esistente, si seguano queste istruzioni.
zh_cn: 如果是更新一个已存在的补丁，这样做：
zh_tw: 如果是更新一個已存在的補丁，這樣做：

source: "<tt>quilt pop <var>foo.patch</var></tt>" to recall existing <file><var>foo.patch</var></file>;
ca: "<tt>quilt pop <var>nom_modificacio.patch</var></tt>" per tornar a cridar l'arxiu <file><var>nom_modificacio.patch</var></file>;
es: "<tt>quilt pop <var>nombre_modificación.patch</var></tt>" para deshacer el parche <file><var>nombre_modificación.patch</var></file> que debes actualizar (puesto que se habrá ejecutado y se supone que es necesario modificarlo).
fr: rappeler le correctif <file><var>toto.patch</var></file> existant : « <tt>quilt pop <var>toto.patch</var></tt> » ;
zh_cn: <tt>quilt pop <var>foo.patch</var></tt> 重现已存在的 <file><var>foo.patch</var></file>；
zh_tw: <tt>quilt pop <var>foo.patch</var></tt> 重現已存在的 <file><var>foo.patch</var></file>；

source: Correct the problem in the old <file><var>foo.patch</var></file>;
ca: Corregir el problema existent en la versió incorrecta del fitxer del pegat <file><var>nom_modificació.patch</var></file>.
es: Corregir el problema existente en la versión incorrecta del archivo de parche <file><var>nombre_modificación.patch</var></file>.
fr: corriger le problème dans l'ancien <file><var>toto.patch</var></file> ;
zh_cn: 修正旧的 <file><var>foo.patch</var></file> 中的问题；
zh_tw: 修正舊的 <file><var>foo.patch</var></file> 中的問題；

source: "<tt>quilt refresh</tt>" to update <file><var>foo.patch</var></file>;
ca: <tt>quilt refresh</tt> per actualitzar <file><var>nom_modificació.patch</var></file>.
es: <tt>quilt refresh</tt> para actualizar <file><var>nombre_modificación.patch</var></file>.
fr: mettre à jour <file><var>toto.patch</var></file> : « <tt>quilt refresh</tt> » ;
zh_cn: <tt>quilt refresh</tt> 更新 <file><var>foo.patch</var></file>；
zh_tw: <tt>quilt refresh</tt> 更新 <file><var>foo.patch</var></file>；

source: "<tt>quilt header -e</tt>" to update its description;
ca: <tt>quilt header -e</tt> per actualitzar la descripció a la capçalera de l'arxiu del pegat.
es: <tt>quilt header -e</tt> para actualizar la descripción en la cabecera del archivo del parche.
fr: mettre à jour sa description : « <tt>quilt header -e</tt> » ;
zh_cn: <tt>quilt header -e</tt> 更新对它的描述；
zh_tw: <tt>quilt header -e</tt> 更新對它的描述；

source: "<tt>while quilt push; do quilt refresh; done</tt>" to apply all patches while removing <em>fuzz</em>;
ca: "<tt>while quilt push; do quilt refresh; done</tt>" per aplicar tots els pegats eliminant <em>les coses innecessàries</em>;
es: "<tt>while quilt push; do quilt refresh; done</tt>" para aplicar todos los parches eliminando <em>cosas innecesarias</em>;
fr: appliquer tous les correctifs en enlevant les approximations (« <em>fuzz</em> ») : « <tt>while quilt push; do quilt refresh; done</tt> » ;
zh_cn: <tt>while quilt push; do quilt refresh; done</tt> 应用所有补丁以确保它们 <em>边界清晰</em>；
zh_tw: <tt>while quilt push; do quilt refresh; done</tt> 應用所有補丁以確保它們 <em>邊界清晰</em>；

source: Add a new revision at the top of the Debian <file>changelog</file> file, for example with "<tt>dch -i</tt>", or explicitly with "<tt>dch -v <var>version</var>-<var>revision</var></tt>" and then insert the comments using your preferred editor. <footnote><p>To get the date in the required format, use "<tt>LANG=C date -R</tt>".</p></footnote>
ca: Afegir la informació de la revisió a l'inici del fitxer <file>changelog</file> (del directori «Debian»), p. ex. executant "<tt>dch -i</tt>" o explícitament indicant el número de versió i revisió executant "<tt>dch -v <var>versió</var>-<var>revisió</var></tt>", i a continuació detallar els canvis realitzats amb un editor <footnote><p>Per escriure la data i hora en el format correcte, cal fer servir "<tt>LANG=C date -R</tt>". </p></footnote>.
es: Añadir la información de la revisión en el inicio del archivo <file>changelog</file> (del directorio «Debian»), por ejemplo ejecutando "<tt>dch -i</tt>" o explícitamente indicando el número de versión y revisión ejecutando "<tt>dch -v <var>versión</var>-<var>revisión</var></tt>", y a continuación detallar los cambios realizados utilizando un editor <footnote><p>Para escribir la fecha y hora en el formato requerido, debes utilizar "<tt>LANG=C date -R</tt>". </p></footnote>.
fr: ajouter une nouvelle révision au début du fichier <file>changelog</file> Debian, par exemple avec « <tt>dch -i</tt> », ou explicitement avec « <tt>dch -v <var>version</var>-<var>revision</var></tt> », et ajoutez ensuite les commentaires en utilisant votre éditeur favori ;<footnote><p>Pour obtenir la date au format voulu, utilisez « <tt>LANG=C date -R</tt> ».</p></footnote>
it: Aggiungere una nuova revisione in cima al file di <file>changelog</file> Debian, per esempio con "<tt>dch -i</tt>", o esplicitamente con "<tt>dch -v <var>version</var>-<var>revision</var></tt>" e poi inserire i commenti utilizzando l'editor preferito. <footnote><p>Per impostare la data nel formato corretto, si usi "<tt>LANG=C date -R</tt>".</p></footnote>
ja: 次に Debian <file>changelog</file> ファイルの先頭に新しいリビジョンを 追加します。例えば「<tt>dch -i</tt>」を実行するか、またはバージョンを 明示したい場合なら「<tt>dch -v &lt;version&gt;-&lt;revision&gt;</tt>」 を実行してあなたの好きなエディタで説明を記入すると楽にできます。
zh_cn: 在 Debian <file>changelog</file> 文件的顶部添加一个条目。例如可以使用 <tt>dch -i</tt> 或用 <tt>dch -v <var>version</var>-<var>revision</var></tt> 来指定版本，然后用你喜欢的编辑器插入信息。<footnote><p>要获得需要的日期格式，使用 <tt>LANG=C date -R</tt>。</p></footnote>
zh_tw: 在 Debian <file>changelog</file> 檔案的頂部添加一個條目。例如可以使用 <tt>dch -i</tt> 或用 <tt>dch -v <var>version</var>-<var>revision</var></tt> 來指定版本，然後用你喜歡的編輯器插入訊息。<footnote><p>要獲得需要的日期格式，使用 <tt>LANG=C date -R</tt>。</p></footnote>

source: Include a short description of the bug and the solution in the changelog entry, followed by "<tt>Closes: #54321</tt>". That way, the bug report will be <em>automagically</em> closed by the archive maintenance software the moment your package gets accepted in the Debian archive.
ca: Incloure la descripció (breu) de l'error i la solució, seguida de la referència de la notificació de l'error amb <tt>(Closes: #54321)</tt>. D'aquesta manera, l'informe d'error es «tancarà» <em>automàticament</em> pel sistema de manteniment del repositori de Debian quan el paquet sigui acceptat en el repositori.
es: Incluye la descripción (breve) del error y la solución, seguida de la referencia de la notificación del error con <tt>(Closes: #54321)</tt>. De esta manera, el informe de error sera «cerrado» <em>automáticamente</em> por el sistema de mantenimiento del repositorio Debian cuando el paquete sea aceptado en el repositorio.
fr: ajoutez une courte description du bogue et de la solution dans l'entrée du changelog, suivie par « <tt>Closes: #54321</tt> ». De cette manière, le rapport de bogue sera automatiquement fermé par le logiciel de maintenance des archives une fois le paquet accepté dans l'archive Debian ;
it: Includere nella nuova voce del changelog una breve descrizione del problema e della relativa soluzione, seguita da "<tt>Closes: #54321</tt>". In questo modo, il report del problema verrà <em>automaticamente</em> chiuso dal programma di manutenzione dell'archivio Debian nel momento stesso in cui il pacchetto viene accettato.
ja: changelog の説明行に、このリビジョンで解決されたバグと、 その解決方法についての簡単な説明を記載し、 「<tt>Closes: #54321</tt>」と続けておきます。 これによってあなたのパッケージが Debian アーカイブ中に受け入れられた時、 アーカイブ管理ソフトウェアによって該当するバグレポート (今回の場合は #54321) が<em>自動的</em>に閉じられます。
zh_cn: 在 changlog 条目中简要描述 Bug 和相应的解决办法，并在后面添加 <tt>Closes: #54321</tt>。这样 Bug 报告会在你的软件包被 Debian 仓库接受的同时被仓库管理软件 <em>自动关闭</em>。
zh_tw: 在 changlog 條目中簡要描述 Bug 和相應的解決辦法，並在後面添加 <tt>Closes: #54321</tt>。這樣 Bug 報告會在你的套件被 Debian 倉庫接受的同時被倉庫管理軟體 <em>自動關閉</em>。

source: Repeat what you did in the above to fix more bugs while updating the Debian <file>changelog</file> file with "<tt>dch</tt>" as needed.
ca: Repeteix els passos anteriors per a cada una de les modificacions realitzades actualitzant l'arxiu Debian <file>changelog</file> amb "<tt>dch</tt>" si és necessari.
es: Deberás repetir los pasos anteriores para cada una de las modificaciones realizadas en la actualización del paquete, a la par que actualizas el fichero <file>changelog</file> de Debian mediante "<tt>dch</tt>".
fr: répéter les opérations précédentes pour corriger plus de bogues tout en mettant à jour le fichier <file>changelog</file> avec « <tt>dch</tt> » selon votre besoin ;
it: Si ripetano questi passaggi per risolvere ulteriori problemi e si ricordi nel frattempo di aggiornare il file Debian di <file>changelog</file> con "<tt>dch</tt>" a seconda della necessità.
zh_cn: 重复上述操作来修复更多的 Bug，并在需要的时候使用 <tt>dch</tt> 更新 Debian <file>changelog</file> 文件。
zh_tw: 重覆上述操作來修復更多的 Bug，並在需要的時候使用 <tt>dch</tt> 更新 Debian <file>changelog</file> 檔案。
