Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: As an example, I'll use a program called <prgn>gentoo</prgn>, an X GTK+ file manager.<footnote><p>This program is already packaged. Current version 0.15.3 has changed substantially from the version 0.9.12 in the following examples.</p></footnote>
ca: Com exemple, faré servir el programa <prgn>gentoo</prgn>, un gestor de fitxers de X11 fet amb GTK+ <footnote><p>Aquest programa ya està empaquetat. La versió actual 0.19.8 ha canviat molt respecte a la versió 0.9.12 feta servir en els exemples.</p></footnote>.
es: Como ejemplo, usaré el programa conocido como <prgn>gentoo</prgn>, un gestor de ficheros de X11 en GTK+<footnote><p>Ten en cuenta que el programa ya ha sido empaquetado previamente. La versión actual 0.19.8 ha cambiado sustancialmente de la versión 0.9.12 que se utiliza en los ejemplos mostrados a continuación.</p></footnote>.
fr: Comme exemple, le programme nommé <prgn>gentoo</prgn> (un gestionnaire de fichiers pour X utilisant GTK+) sera utilisé. <footnote><p>Ce programme est déjà empaqueté. La version actuelle 0.15.3 a changé substantiellement depuis la version 0.9.12 des exemples suivants.</p></footnote>
it: A titolo di esempio, verrà utilizzato il programma <prgn>gentoo</prgn>, un gestore file per X basato su GTK+.<footnote><p>Osserva che il programma in questione è già stato pacchettizzato, e la versione corrente 0.15.3 ha subito sostanziali modifiche dalla versione 0.9.12 menzionata nei seguenti esempi.</p></footnote>
ja: さて本稿では、<prgn>gentoo</prgn> という X GTK+ ファイルマネージャを例に説明します<footnote><p>このプログラムはすでにパッケージ化されています。現在のバージョンは 0.15.3 で、以下の例にあるバージョン 0.9.12 とは大幅に変更されています。</p></footnote>
zh_cn: 作为示例，我将使用一个名为 <prgn>gentoo</prgn> 的程序，它是一个 X GTK+ 文件管理器。<footnote><p>需要注意的是，这个程序已经被打包好了，并且从写这篇文档之初到现在它已经发生了很大的变化。</p></footnote>
zh_tw: 作爲範例，我將使用一個名爲 <prgn>gentoo</prgn> 的程式，它是一個 X GTK+ 檔案管理器。<footnote><p>需要注意的是，這個程式已經被打包好了，並且從寫這篇文件之初到現在它已經發生了很大的變化。</p></footnote>

source: Create a subdirectory under your home directory named <file>debian</file> or <file>deb</file> or anything you find appropriate (e.g. just <file>~/gentoo</file> would do fine in this case). Place the downloaded archive in it, and extract it (with "<tt>tar xzf gentoo-0.9.12.tar.gz</tt>"). Make sure there are no errors, even some <em>irrelevant</em> ones, because there will most probably be problems unpacking on other people's systems, whose unpacking tools may or may not ignore those anomalies. On your console screen, you should see the following.
ca: Fes un nou directori al teu directori d'usuari amb el nom <file>debian</file> o <file>deb</file> o el que trobis més adequat (p.e. <file>~/gentoo/</file> és molt adequat). Copia en aquest nou directori el fitxer del codi font i extreu el seu contingut executant "<tt>tar xzf gentoo-0.9.12.tar.gz</tt>". Comprova que no hi ha hagut errors, fins i tot els més <em>irrellevants</em>, degut a què és possible que hi hagi errors en desempaquetar-ho en sistemes d'altres persones que no ignorin aquestes errades. En el terminal hauràs fet el següent:
es: Crea un subdirectorio bajo tu directorio personal llamado <file>debian</file> o <file>deb</file> o lo que creas apropiado (por ejemplo <file>~/gentoo/</file> estaría bien en este caso). Mueve a él el archivo que has descargado, y descomprímelo de la siguiente forma: "<tt>tar xzf gentoo-0.9.12.tar.gz</tt>". Asegúrate de que no hay errores, incluso errores <em>irrelevantes</em>, porque es muy probable que haya problemas al desempaquetarlo en sistemas de otras personas, cuyas herramientas de desempaquetado puede que no ignoren estas anomalías. En el terminal de órdenes, debería ver el mensaje mostrado a continuación.
fr: Créez un sous-répertoire dans votre répertoire personnel nommé <file>debian</file> ou <file>deb</file> ou quoi que ce soit d'adéquat (par exemple le nom du programme, <file>~/gentoo</file>, ferait l'affaire dans ce cas). Placez l'archive téléchargée dedans, et décompressez-la avec « <tt>tar xzf gentoo-0.9.12.tar.gz</tt> ». Assurez-vous qu'aucune erreur ne se produit, même <em>sans importance</em>, sinon des problèmes surviendront sans doute lors de la décompression sur les systèmes d'autres personnes, dont les outils pourraient ne pas gérer ces erreurs. Sur la console, vous devriez voir ce qui suit :
ja: 自分のホームディレクトリ以下に <file>debian</file> や <file>deb</file>、または何か適当な名前のサブディレクトリを作りましょう (今回の場合には <file>~/gentoo/</file> としても良いでしょう)。ダウンロードしたアーカイブをここにコピーし、"<tt>tar xzf gentoo-0.9.12.tar.gz</tt>" を実行して展開してください。この時、一見<em>無関係</em>に思えるようなものも含めて、エラーは一切発生しないことを確認してください。もしエラーが起きたら、それは他の人々のシステム上で展開する際にも、おそらくエラーが起きるということです。そしてそこで使われている展開用のツールは、こういった異常を無視するかも知れませんし、無視しないかもしれません。あなたのコンソール画面では、以下のように見えているでしょうか。
zh_cn: 在你的用户主目录下创建一个子目录，命名为 <file>debian</file> 或 <file>deb</file> 或任意你觉得合适的其他名字(本例中使用 <file>~/gentoo</file>)。把下载好的归档文件放在其中并解包(使用 <tt>tar xzf gentoo-0.9.12.tar.gz</tt> 命令)。要确定解包过程中没有发生错误，即便是有一点 <em>不恰当</em> 也不行，因为在别人的系统上解包这些文件时，如果他们的工具并不忽略这些反常的现象就会出现问题。在你的终端屏幕上，应该看到如下的情形。
zh_tw: 在你的用戶主目錄下創建一個子目錄，命名爲 <file>debian</file> 或 <file>deb</file> 或任意你覺得合適的其他名字(本例中使用 <file>~/gentoo</file>)。把下載好的壓縮檔放在其中並解壓縮(使用 <tt>tar xzf gentoo-0.9.12.tar.gz</tt> 命令)。要確定解壓縮過程中沒有發生錯誤，即便是有一點 <em>不恰當</em> 也不行，因爲在別人的系統上解壓縮這些檔案時，如果他們的工具並不忽略這些反常的現象就會出現問題。在你的終端螢幕上，應該看到如下的情形。

source: Now you have another subdirectory, called <file>gentoo-0.9.12</file>. Change to that directory and <em>thoroughly</em> read the provided documentation. Usually there are files named <file>README*</file>, <file>INSTALL*</file>, <file>*.lsm</file> or <file>*.html</file>. You must find instructions on how to correctly compile and install the program (most probably they'll assume you want to install to <file>/usr/local/bin</file> directory; you won't be doing that, but more on that later in <ref id="destdir">).
ca: Ara tens un nou directori amb el nom <file>gentoo-0.9.12</file>. Accedeix en aquest directori i llegeix <em>atentament</em> la documentació del programa, normalment en fitxers amb el nom <file>README*</file>, <file>INSTALL*</file>, <file>*.lsm</file> o <file>*.html</file>. Hi haurà instruccions per a la compilació i instal·lació del programa (probablement la instal·lació es farà a <file>/usr/local/bin</file>, però veurem a <ref id="destdir"> que no és la destinació correcta).
es: Ahora tienes otro subdirectorio, llamado <file>gentoo-0.9.12</file>. Muévete a ese directorio y lee <strong>en profundidad</strong> la documentación que encuentres. Generalmente se encuentra en ficheros que se llaman <file>README*</file>, <file>INSTALL*</file>, <file>*.lsm</file> o <file>*.html</file>. Allí encontrarás instrucciones de cómo compilar e instalar el programa (muy probablemente asumirán que lo quieres instalar en el directorio <file>/usr/local/bin</file>, no harás esto, pero eso lo veremos más adelante en <ref id="destdir">).
fr: Maintenant vous avez un autre sous-répertoire, nommé <file>gentoo-0.9.12</file>. Allez dans ce répertoire et lisez <em>attentivement</em> la documentation fournie. Il s'agit généralement de fichiers nommés <file>README*</file>, <file>INSTALL*</file>, <file>*.lsm</file> ou <file>*.html</file>. Vous devez trouver les instructions pour compiler et installer correctement le programme (elles supposent très probablement que vous voulez l'installer dans le répertoire<file>/usr/local/bin</file> ; ce n'est pas le cas, mais ce point sera traité plus tard en <ref id="destdir">).
it: A questo punto si avrà un'altra sottodirectory, dal nome <file>gentoo-0.9.12</file>. Spostarsi in questa directory e leggere <em>attentamente</em> la documentazione fornita. Di solito si avranno dei file come <file>README*</file>, <file>INSTALL*</file>, <file>*.lsm</file> o <file>*.html</file>. È necessario trovare istruzioni su come compilare e installare correttamente il programma (si potrebbe supporre di installare il programma nella directory <file>/usr/local/bin</file>, ma questo non è il comportamento corretto, tratteremo l'argomento più avanti <ref id="destdir">).
ja: さて、<file>gentoo-0.9.12</file> という別のサブディレクトリができました。展開したディレクトリに移動して、提供されているドキュメントを<em>徹底的に</em>読みましょう。通常は <file>README*</file>, <file>INSTALL*</file>, <file>*.lsm</file>, <file>*.html</file> といった名前のファイルです。それらの文書の中に、どうやったら正しくコンパイルできるのか、どうインストールすればよいのかといった情報が見つかるはずです (おそらく <file>/usr/local/bin</file> にインストールするものとして説明されていますが、そうしてはいけません。これについては <ref id="destdir"> を参照してください)。
zh_cn: 现在又有了一个新的子目录，名为 <file>gentoo-0.9.12</file>。进入该目录并 <em>彻底</em> 读完其中的文档。通常情况下这些文档被命名为 <file>README*</file>、<file>INSTALL*</file>、<file>*.lsm</file> 或 <file>*.html</file>。你必须找到关于如何正确编译和安装程序的指导(最可能的是他们会默认你希望把程序安装到 <file>/usr/local/bin</file> 目录，但事实上你不能那样做，详细的内容稍后将在 <ref id="destdir"> 中说明)。
zh_tw: 現在又有了一個新的子目錄，名爲 <file>gentoo-0.9.12</file>。進入該目錄並 <em>徹底</em> 讀完其中的文件。通常情況下這些文件被命名爲 <file>README*</file>、<file>INSTALL*</file>、<file>*.lsm</file> 或 <file>*.html</file>。你必須找到關於如何正確編譯和安裝程式的指導(最可能的是他們會默認你希望把程式安裝到 <file>/usr/local/bin</file> 目錄，但事實上你不能那樣做，詳細的內容稍後將在 <ref id="destdir"> 中說明)。

source: Simple programs come with a <file>Makefile</file> file in them and can be compiled simply with "<tt>make</tt>". Some of them support "<tt>make check</tt>", which runs included self-checks. Installation to the destination directories is usually done with "<tt>make install</tt>".
ca: Generalment, els programes tenen un arxiu <file>Makefile</file> i és possible compilar-los simplement executant "<tt>make</tt>". Molts d'ells permeten executar "<tt>make check</tt>", per fer compravacions. La instal·lació en el directori de destí es fa executant "<tt>make install</tt>".
es: Los programa sencillos incluyen un fichero <file>Makefile</file> y pueden generalmente compilarse con «"<tt>make</tt>". Algunos de ellos soportan "<tt>make check</tt>", esta orden ejecuta las comprobaciones automáticas que estén definidas. Generalmente se instalarán en sus directorios de destino ejecutando "<tt>make install</tt>".
fr: Des programmes simples sont fournis avec un fichier <file>Makefile</file> et peuvent être compilés simplement avec « <tt>make</tt> ». Certains d'entre eux gèrent « <tt>make check</tt> », qui exécute des vérifications internes. L'installation dans les répertoires de destination se fait normalement avec « <tt>make install</tt> ».
ja: シンプルなプログラムには <file>Makefile</file> ファイルが付属していて、単純に "<tt>make</tt>" でコンパイルできます。"<tt>make check</tt>" をサポートしていて、含まれているセルフテストを実行できるものもあります。目的のディレクトリへのインストールは一般に "<tt>make install</tt>"によって実行されます。
zh_cn: 带有 <file>Makefile</file> 文件的简单程序可以很容易地使用 <tt>make</tt> 来编译。其中的一些还支持 <tt>make check</tt>，可以完成一系列自检。编译好后可以使用 <tt>make install</tt> 来将程序安装到目标目录。
zh_tw: 帶有 <file>Makefile</file> 檔案的簡單程式可以很容易地使用 <tt>make</tt> 來編譯。其中的一些還支持 <tt>make check</tt>，可以完成一系列自身測試。編譯好後可以使用 <tt>make install</tt> 來將程式安裝到目標目錄。

source: Now try to compile and run your program, to make sure it works properly and doesn't break something else while it's installing or running.
ca: Una vegada s'ha compilat el programa, prova'l i comprova que tot funciona correctament i que no es genera cap errada en el sistema en l'execució i/o instal·lació.
es: Ahora intenta compilar, y ejecutar el programa, para asegurarte que funciona bien y de que no genera ningún error en el sistema mientras está instalándose o ejecutándose.
fr: Maintenant, essayez de compiler et d'exécuter le programme, pour vous assurer qu'il fonctionne correctement et ne casse rien d'autre quand il est installé ou utilisé.
it: Adesso si provi a compilare ed eseguire il programma, assicurandosi che funzioni correttamente e niente sia andato male durante l'installazione o l'esecuzione.
ja: さあ、試しにプログラムをコンパイルし、実行してみましょう。 インストールや実行の際にちゃんと動作するかどうか、そして他の何かを壊してしまっていないかを確認してください。
zh_cn: 现在尝试编译和运行你的程序，确保它工作正常，且在安装和运行时不会导致其他问题。
zh_tw: 現在嘗試編譯和運行你的程式，確保它工作正常，且在安裝和運行時不會導致其他問題。

source: Also, you can usually run "<tt>make clean</tt>" (or better "<tt>make distclean</tt>") to clean up the build directory. Sometimes there's even a "<tt>make uninstall</tt>" which can be used to remove all the installed files.
ca: L'execució de l'ordre "<tt>make clean</tt>" (o "<tt>make distclean</tt>") eliminarà del directori els fitxers generats per a la compilació i que són innecessaris. Habitualment, serà possible desinstal·lar el programa amb l'ordre "<tt>make uninstall</tt>".
es: También, generalmente, puedes ejecutar "<tt>make clean</tt>" (o mejor "<tt>make distclean</tt>") para limpiar el directorio donde se compila el programa. A veces hay incluso un "<tt>make uninstall</tt>" que se puede utilizar para borrar todos los archivos instalados.
fr: Sachez aussi que vous pouvez généralement utiliser « <tt>make clean</tt> » (ou mieux, « <tt>make distclean</tt> ») pour nettoyer le répertoire de compilation. Parfois, « <tt>make uninstall</tt> » peut être utilisé pour retirer tous les fichiers installés.
it: Di solito, per ripulire la directory di compilazione, si usa il comando "<tt>make clean</tt>" (o meglio ancora "<tt>make distclean</tt>"). Talvolta c'è anche il comando "<tt>make uninstall</tt>" che serve a rimuovere tutti i file installati.
ja: それから、たいていの場合は "<tt>make clean</tt>" ( "<tt>make distclean</tt>" を使えるならそのほうが良いです) を実行すると、ビルド用のディレクトリをきれいにしてくれます。さらに "<tt>make uninstall</tt>" を実行すると、インストールされたファイルをすべて削除できることさえもあります。
zh_cn: 你还可以运行 <tt>make clean</tt> (或更好的 <tt>make distclean</tt>)来清理编译目录。有时还会带有 <tt>make uninstall</tt> 用以卸载已经安装了的文件。
zh_tw: 你還可以運行 <tt>make clean</tt> (或更好的 <tt>make distclean</tt>)來清理編譯目錄。有時還會帶有 <tt>make uninstall</tt> 用以反安裝已經安裝了的檔案。

source: Free portable programs
ca: Programari lliure portable.
es: Programas libres portables
fr: Programmes libres portables
ja: 自由に移植できるプログラム
zh_cn: 自由的可移植程序
zh_tw: 自由的可移植程式

source: A lot of Free programs are written in the <url id="http://en.wikipedia.org/wiki/C_(programming_language)" name="C"> and <url id="http://en.wikipedia.org/wiki/C++" name="C++"> languages. Many of these use Autotools or CMake to make them portable across different platforms. These tools are used to generate <file>Makefile</file> and other required source files. Then, such programs are built with usual "<tt>make; make install</tt>".
ca: La majoria de programes lliures estan escrits en llenguatge <url id="http://ca.wikipedia.org/wiki/Llenguatge_C" name="C"> i <url id="http://ca.wikipedia.org/wiki/C%2B%2B" name="C++">. Molts fan servir les «Autotools» i «CMake» per compilar en diferents arquitectures. Aquestes eines generen un arxiu <file>Makefile</file> i d'altres fitxers necessaris per a la compilació. Així, molts programes es compilen i instal·len amb l'execució de <tt>make; make install</tt>.
es: Buena parte de los programas libres están escritos en lenguaje <url id="http://es.wikipedia.org/wiki/C_%28lenguaje_de_programaci%C3%B3n%29" name="C"> y <url id="http://es.wikipedia.org/wiki/C%2B%2B" name="C++">. Muchos utilizan las «Autotools» y «CMake» para compilar en diferentes plataformas. Estas herramientas se utilizan para generar un archivo <file>Makefile</file> y otros archivos necesarios para la compilación. Así, muchos programas se compilan ejecutando «<tt>make; make install</tt>».
fr: De nombreux programmes libres sont écrits en <url id="http://fr.wikipedia.org/wiki/C_(langage)" name="C"> et <url id="http://fr.wikipedia.org/wiki/C++" name="C++">. Beaucoup d'entre-eux utilisent les Autotools ou CMake pour les rendre portables sur différentes architectures. Ces outils sont utilisés pour créer <file>Makefile</file> et d'autres fichiers sources nécessaires. Ensuite, de tels programmes sont construits avec l'habituel « <tt>make; make install</tt> ».
ja: 多数の自由なプログラムが、<url id="http://en.wikipedia.org/wiki/C_(programming_language)" name="C"> と <url id="http://en.wikipedia.org/wiki/C++" name="C++"> 言語で書かれています。これらの多くは、異なるプラットフォーム間で移植を可能とするために Autotools や CMake を使っています。こういったツールは、<file>Makefile</file> やその他必要なソースファイルを生成するのに使われます。その後、そういったプログラムは通常の "<tt>make; make install</tt>" でビルドされます。
zh_cn: 非常多的自由软件是使用 <url id="http://en.wikipedia.org/wiki/C_(programming_language)" name="C"> 和 <url id="http://en.wikipedia.org/wiki/C++" name="C++"> 语言编写的。其中的有很多使用 Autotools 或 CMake 来使其可以在不同平台上移植。这些工具被用于生成 <file>Makefile</file> 和其他必须的源文件，然后这些程序可以使用正常的 <tt>make; make install</tt> 来编译和安装。
zh_tw: 非常多的自由軟體是使用 <url id="http://en.wikipedia.org/wiki/C_(programming_language)" name="C"> 和 <url id="http://en.wikipedia.org/wiki/C++" name="C++"> 語言編寫的。其中的有很多使用 Autotools 或 CMake 來使其可以在不同平臺上移植。這些工具被用於生成 <file>Makefile</file> 和其他必須的源檔案，然後這些程式可以使用正常的 <tt>make; make install</tt> 來編譯和安裝。

source: <url id="http://en.wikipedia.org/wiki/GNU_build_system" name="Autotools"> are the GNU build system comprising <url id="http://en.wikipedia.org/wiki/Autoconf" name="Autoconf">, <url id="http://en.wikipedia.org/wiki/Automake" name="Automake">, <url id="http://en.wikipedia.org/wiki/GNU_Libtool" name="Libtool">, and <url id="http://en.wikipedia.org/wiki/GNU_gettext" name="gettext">. You can notice such sources by the <file>configure.ac</file>, <file>Makefile.am</file>, and <file>Makefile.in</file> files. <footnote><p>See <url id="http://www.lrde.epita.fr/~adl/autotools.html" name="Autotools Tutorial"> and <file>&autotools-dev;</file>. </p></footnote>
ca: <url id="http://es.wikipedia.org/wiki/Autotools" name="Les «Autotools»"> (en el moment de fer aquesta traducció, aquesta entrada no existeix a la Viquipèdia en català) són el sistema de compilació GNU i inclouen <url id="http://ca.wikipedia.org/wiki/GNU_Autoconf" name="Autoconf">, <url id="http://es.wikipedia.org/wiki/GNU_Automake" name="Automake">,<url id="http://es.wikipedia.org/wiki/GNU_Libtool" name="Libtool"> i <url id="http://ca.wikipedia.org/wiki/Gettext" name="gettext">. Confirmaràs que el teu programa fa servir les «autotools» per la presència, a les fonts, dels fitxers <file>configure.ac</file>, <file>Makefile.am</file>, i <file>Makefile.in</file> <footnote><p>Consulta <url id="http://www.lrde.epita.fr/~adl/autotools.html" name="«Autotools Tutorial»"> i <file>&autotools-dev;</file>. </p></footnote>.
es: <url id="http://es.wikipedia.org/wiki/Autotools" name="Las Autotools"> son el sistema de compilación GNU e incluyen <url id="http://es.wikipedia.org/wiki/Autoconf" name="Autoconf">, <url id="http://es.wikipedia.org/wiki/Automake" name="Automake">, <url id="http://es.wikipedia.org/wiki/GNU_Libtool" name="Libtool"> y <url id="http://es.wikipedia.org/wiki/Gettext" name="gettext">. Confirmarás que el programa utiliza las autoools por la presencia de los archivos <file>configure.ac</file>, <file>Makefile.am</file>, y <file>Makefile.in</file> <footnote><p>Véase <url id="http://www.lrde.epita.fr/~adl/autotools.html" name="Autotools Tutorial"> y <file>&autotools-dev;</file>. </p></footnote>.
fr: Les <url id="http://fr.wikipedia.org/wiki/Autotools" name="Autotools"> sont les outils de construction GNU, et comprennent <url id="http://fr.wikipedia.org/wiki/Autoconf" name="Autoconf">, <url id="http://fr.wikipedia.org/wiki/Automake" name="Automake">, <url id="http://fr.wikipedia.org/wiki/Libtool" name="Libtool"> et <url id="http://fr.wikipedia.org/wiki/GNU_gettext" name="gettext">. Vous pouvez remarquer de telles sources à l'aide des fichiers <file>configure.ac</file>, <file>Makefile.am</file> et <file>Makefile.in</file>. <footnote><p>Voir le <url id="http://www.lrde.epita.fr/~adl/autotools.html" name="tutoriel des Autotools"> et <file>&autotools-dev;</file>.</p></footnote>
ja: <url id="http://en.wikipedia.org/wiki/GNU_build_system" name="Autotools"> は <url id="http://en.wikipedia.org/wiki/Autoconf" name="Autoconf">、<url id="http://en.wikipedia.org/wiki/Automake" name="Automake">、<url id="http://en.wikipedia.org/wiki/GNU_Libtool" name="Libtool"> と <url id="http://en.wikipedia.org/wiki/GNU_gettext" name="gettext"> から成る GNU のビルドシステムです。<file>configure.ac</file>、<file>Makefile.am</file> や <file>Makefile.in</file> ファイルがあれば、そういうソースであることがわかります。<footnote><p><url id="http://www.lrde.epita.fr/~adl/autotools.html" name="Autotools Tutorial"> と <file>&autotools-dev;</file> を参照してください。</p></footnote>
zh_cn: <url id="http://en.wikipedia.org/wiki/GNU_build_system" name="Autotools"> 是 GNU 编译系统工具，包括 <url id="http://en.wikipedia.org/wiki/Autoconf" name="Autoconf">、<url id="http://en.wikipedia.org/wiki/Automake" name="Automake">、<url id="http://en.wikipedia.org/wiki/GNU_Libtool" name="Libtool"> 和 <url id="http://en.wikipedia.org/wiki/GNU_gettext" name="gettext">。你可以通过 <file>configure.ac</file>、<file>Makefile.am</file> 和 <file>Makefile.in</file> 等文件来识别这种类型的源代码。<footnote><p>参看 <url id="http://www.lrde.epita.fr/~adl/autotools.html" name="Autotools Tutorial"> 和 <file>&autotools-dev;</file>。</p></footnote>
zh_tw: <url id="http://en.wikipedia.org/wiki/GNU_build_system" name="Autotools"> 是 GNU 編譯系統工具，包括 <url id="http://en.wikipedia.org/wiki/Autoconf" name="Autoconf">、<url id="http://en.wikipedia.org/wiki/Automake" name="Automake">、<url id="http://en.wikipedia.org/wiki/GNU_Libtool" name="Libtool"> 和 <url id="http://en.wikipedia.org/wiki/GNU_gettext" name="gettext">。你可以通過 <file>configure.ac</file>、<file>Makefile.am</file> 和 <file>Makefile.in</file> 等檔案來識別這種類型的原始碼。<footnote><p>參考 <url id="http://www.lrde.epita.fr/~adl/autotools.html" name="Autotools Tutorial"> 和 <file>&autotools-dev;</file>。</p></footnote>

source: The first step of Autotools work flow is usually that the upstream runs "<tt>autoreconf -i -f</tt>" in the source and distributes this source with generated files.
ca: La primera etapa en l'ús de les «Autotools» és l'execució de l'ordre (per l'autor del codi font) "<tt>autoreconf -i -f</tt>" amb la qual es generen, fent servir el fitxers font (a l'esquerra del diagrama) els fitxers (a la dreta del diagrama) que després farà servir l'ordre «configure» .
es: El primer paso en el uso de «Autotools» es la ejecución por parte del autor de la orden "<tt>autoreconf -i -f</tt>" la cual genera, a partir de los archivos fuente (a la izquierda del gráfico) los archivos que utilizará la orden «configure» (a la derecha del gráfico).
fr: La première étape du travail des Autotools est généralement que les auteurs amont exécutent « <tt>autoreconf -i -f</tt> » dans les sources avant de les distribuer avec les fichiers générés.
ja: Autotools を使ったワークフローの最初の一歩は、上流の作者がソースディレクトリで "<tt>autoreconf -i -f</tt>" を実行し、生成されたファイルと一緒にこのソースを配布することです。
zh_cn: 使用 Autotools 的第一步是上游作者在代码中运行 <tt>autoreconf -i -f</tt> 并把生成的文件同源代码一起分发。
zh_tw: 使用 Autotools 的第一步是上游作者在程式碼中運行 <tt>autoreconf -i -f</tt> 並把生成的檔案同原始碼一起散佈。

source: Editing <file>configure.ac</file> and <file>Makefile.am</file> files requires some knowledge of <prgn>autoconf</prgn> and <prgn>automake</prgn>. See "<tt>info autoconf</tt>" and "<tt>info automake</tt>".
ca: Per a l'edició dels fitxers <file>configure.ac</file> i <file>Makefile.am</file> cal conèixer el funcionament de <prgn>autoconf</prgn> i <prgn>automake</prgn>. Consulta <tt>info autoconf</tt> i <tt>info automake</tt> (executant les ordres en el terminal).
es: La edición de los archivos <file>configure.ac</file> y <file>Makefile.am</file> requiere conocer el funcionamiento de <prgn>autoconf</prgn> y <prgn>automake</prgn>. Véase «<tt>info autoconf</tt>» y «<tt>info automake</tt>» (ejecutando las órdenes en el terminal).
fr: Modifier les fichiers <file>configure.ac</file> et <file>Makefile.am</file> nécessite un peu de connaissance de <prgn>autoconf</prgn> et <prgn>automake</prgn>. Voir « <tt>info autoconf</tt> » et « <tt>info automake</tt> ».
ja: <file>configure.ac</file> や <file>Makefile.am</file> ファイルを編集するには、<prgn>autoconf</prgn> と <prgn>automake</prgn> についての知識が少々必要になります。"<tt>info autoconf</tt>" と "<tt>info automake</tt>" を参照してください。
zh_cn: 编辑 <file>configure.ac</file> 和 <file>Makefile.am</file> 等文件需要一些关于 <prgn>autoconf</prgn> 和 <prgn>automake</prgn> 的知识。参看 <tt>info autoconf</tt> 和 <tt>info automake</tt>。
zh_tw: 編輯 <file>configure.ac</file> 和 <file>Makefile.am</file> 等檔案需要一些關於 <prgn>autoconf</prgn> 和 <prgn>automake</prgn> 的知識。參考 <tt>info autoconf</tt> 和 <tt>info automake</tt>。
