Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: In short, here's how <package>gentoo</package>'s <file>copyright</file> file should look like:
ca: Resumint, el fitxer <file>copyright</file> del paquet <package>gentoo</package> hauria de ser més o menys com el següent exemple:
es: En resumen, el archivo <file>copyright</file> del paquete <package>gentoo</package> debería ser similar a esto:
fr: En bref, voici ce à quoi le fichier <file>copyright</file> de <package>gentoo</package> devrait ressembler :
it: Brevemente, ecco come il file di <file>copyright</file> del pacchetto <package>gentoo</package> dovrebbe apparire:
ja: <package>gentoo</package>パッケージの<file>copyright</file>ファイルは以下のようになります。
zh_cn: 简言之，<package>gentoo</package> 的 <file>copyright</file> 文件如下所示：
zh_tw: 簡言之，<package>gentoo</package> 的 <file>copyright</file> 檔案如下所示：

source: Please follow the HOWTO provided by ftpmasters and sent to debian-devel-announce: <url id="&copyright-howto;">.
ca: Consulta el text «COM» redactat pel «ftpmasters» i enviat a «debian-devel-announce»: <url id="&copyright-howto;">.
es: Por favor, sigue el COMO redactado por «ftpmasters» y enviado a «debian-devel-announce»: <url id="&copyright-howto;">.
fr: Veuillez suivre les indications fournies par les responsables de l'archive et envoyées sur la liste debian-devel-announce : <url id="&copyright-howto;">.
ja: debian-devel-announce: <url id="&copyright-howto;">に投稿された手順を追ってみてください。
zh_cn: 另外还可以参看 ftpmasters 发送到 debian-devel-announce 的 HOWTO： <url id="&copyright-howto;">
zh_tw: 另外還可以參考 ftpmasters 發送到 debian-devel-announce 的 HOWTO： <url id="&copyright-howto;">

source: <file>changelog</file> file
ca: El fitxer <file>changelog</file>.
es: El archivo <file>changelog</file>
fr: Fichier <file>changelog</file>
it: Il file <file>changelog</file>
ja: <file>changelog</file>ファイル
zh_cn: <file>changelog</file> 文件
zh_tw: <file>changelog</file> 檔案

source: This is a required file, which has a special format described in the <url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-dpkgchangelog" name="Debian Policy Manual, 4.4 'debian/changelog'">. This format is used by <prgn>dpkg</prgn> and other programs to obtain the version number, revision, distribution and urgency of your package.
ca: Aquest és un arxiu imprescindible amb un format especial descrit a les normes Debian, <url name="«Debian Policy Manual, 4.4 'debian/changelog»'" id="http://www.debian.org/doc/debian-policy/ch-source.html#s-dpkgchangelog">. El seu especial format és degut a què <package>dpkg</package> i d'altres programes el fan servir per ﻿obtenir informació de la versió, revisió, distribució i urgència del paquet.
es: Este es un fichero requerido, que tiene un formato especial descrito en las normas Debian, <url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-dpkgchangelog" name="«Debian Policy Manual, 4.4 'debian/changelog'»">. Este es el formato que usan dpkg y otros programas para obtener el número de versión, revisión, distribución y urgencia de tu paquete.
fr: C'est un fichier obligatoire, avec un format spécifique décrit dans la <url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-dpkgchangelog" name="Charte Debian, 4.4 « debian/changelog »">. Ce format est utilisé par <prgn>dpkg</prgn> et d'autres programmes pour obtenir le numéro de version, de révision, de distribution et l'urgence de votre paquet.
it: Questo è un file obbligatorio, che ha un formato speciale descritto nel <url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-dpkgchangelog" name="Manuale delle policy di Debian, 4.4 'debian/changelog'">. Questo formato è utilizzato da <prgn>dpkg</prgn> ed altri programmi per ottenere il numero di versione, revisione, distribuzione ed urgenza del pacchetto.
ja: 必須のファイルです。このファイルの特別な書式は<url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-dpkgchangelog" name="Debian Policy Manual, 4.4 'debian/changelog'">で既定されています。この書式は、<prgn>dpkg</prgn>やその他のプログラムによってパッケージの バージョン番号、レビジョン、ディストリビューション、それに緊急度 (urgency) を識別するために利用されます。
zh_cn: 这是一个必须的文件，它的格式在 <url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-dpkgchangelog" name="Debian Policy Manual, 4.4 'debian/changelog'"> 中有详细的描述。这种格式被 <prgn>dpkg</prgn> 和其他程序用以获得版本号信息、适应的发行版和紧急程度。
zh_tw: 這是一個必須的檔案，它的格式在 <url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-dpkgchangelog" name="Debian Policy Manual, 4.4 'debian/changelog'"> 中有詳細的描述。這種格式被 <prgn>dpkg</prgn> 和其他程式用以獲得版本號訊息、適應的發行版和緊急程度。

source: For you, it is also important, since it is good to have documented all changes you have done. It will help people downloading your package to see whether there are issues with the package that they should know about. It will be saved as <file>/usr/share/doc/gentoo/changelog.Debian.gz</file> in the binary package.
ca: També és important aquest arxiu: facilita la documentació dels canvis fets en la construcció del paquet. El fitxer informarà als usuaris que descarreguin el paquet sobre els problemes que pugui tenir el paquet i que ells hagin de saber. El fitxer es conserva com <file>/usr/share/doc/gentoo/changelog.Debian.gz</file> en el paquet.
es: Para ti es también importante, ya que es bueno tener documentados todos los cambios que hayas hecho. Esto ayudará a las personas que se descarguen tu paquete para ver si hay temas pendientes en el paquete que deberían conocer de forma inmediata. Se guardará como <file>/usr/share/doc/gentoo/changelog.Debian.gz</file> en el paquete binario.
fr: Pour vous, il est également important, puisqu'il est bon de documenter toutes les modifications effectuées. Cela permettra aux personnes qui téléchargent le paquet de voir s'il y a des problèmes à connaître. Il sera conservé en <file>/usr/share/doc/gentoo/changelog.Debian.gz</file> dans le paquet binaire.
it: Tale file è anche utile allo scopo di aver documentato tutti i cambiamenti che sono stati fatti. Sarà inoltre d'aiuto agli utenti che scaricano il pacchetto per vedere se ci sono problemi di cui dovrebbero essere al corrente. Il file verrà salvato come <file>/usr/share/doc/gentoo/changelog.Debian.gz</file> nel pacchetto binario.
ja: あなたが行なったすべての変更をきちんと記載しておくことは良いことであり、その意味でこのファイルはまた、パッケージメンテナであるあなたにとっても重要なものです。パッケージをダウンロードした人は、 このファイルを見ることで、このパッケージに関する未解決の問題があるかどうかを知ることができます。このファイルはバイナリパッケージ中に<file>/usr/share/doc/gentoo/changelog.Debian.gz</file>として保存されます。
zh_cn: 对于你而言，详细描述你所做出的更改也是很好且很重要的。它将帮助下载你的软件包的人了解这个软件包中是否有他们需要知道的事情。它会被作为 <file>/usr/share/doc/gentoo/changelog.Debian.gz</file> 保存在二进制包中。
zh_tw: 對於你而言，詳細描述你所做出的更改也是很好且很重要的。它將幫助下載你的套件的人瞭解這個套件中是否有他們需要知道的事情。它會被作爲 <file>/usr/share/doc/gentoo/changelog.Debian.gz</file> 保存在二進位套件中。

source: <prgn>dh_make</prgn> created a default one, and this is how it looks like:
ca: <prgn>dh_make</prgn> construeix un arxiu predeterminat amb el següent text:
es: <prgn>dh_make</prgn> genera uno predeterminado, el cual es como sigue:
fr: <prgn>dh_make</prgn> en crée un par défaut, et il ressemble à ceci :
it: <prgn>dh_make</prgn> ne crea uno predefinito, ecco come appare:
ja: <prgn>dh_make</prgn>がデフォルトとして生成するchangelogはこんな感じです。
zh_cn: <prgn>dh_make</prgn> 创建了一个默认的文件，这是它的样子：
zh_tw: <prgn>dh_make</prgn> 創建了一個默認的檔案，這是它的樣子：

source: Line 1 is the package name, version, distribution, and urgency. The name must match the source package name, distribution should be either <tt>unstable</tt> (or even <tt>experimental</tt>) <footnote><p>Some people use invalid distribution values such as <tt>UNRELEASED</tt> to prevent a package to be accidentally uploaded when updating a package in a shared VCS.</p></footnote>, and urgency shouldn't be changed to anything higher than <tt>low</tt>. :-)
ca: A la línia 1 hi ha el nom del paquet, versió, distribució i urgència. El nom serà el del paquet amb les fonts, la distribució hauria de ser, per ara, <tt>unstable</tt> (o fins i tot <tt>experimental</tt>) <footnote><p>De vegades es fa servir un nom de distribució incorrecte com és ara <tt>UNRELEASED</tt> per evitar que el paquet sigui transferit al repositori accidentalment en fer una actualització quan es fa servir un sistema VCS compartit. </p></footnote>. i la urgència no hauria de ser major a <tt>low</tt>. :-)
es: La línea 1 es el nombre del paquete, versión, distribución y urgencia. El nombre debe coincidir con el nombre del paquete fuente, la distribución debería ser, por ahora, <tt>unstable</tt> (o incluso <tt>experimental</tt>) <footnote><p>Muchas personas utilizan un nombre de distribución erróneo como <tt>UNRELEASED</tt> para prevenir que el paquete sea transferido al repositorio accidentalmente al actualizar un sistema VCS compartido.</p></footnote> y la urgencia no debería cambiarse a algo mayor que <tt>low</tt>. :-)
fr: La ligne 1 contient le nom du paquet, la version, la distribution et l'urgence. Le nom doit correspondre au nom du paquet source, la distribution devrait être <tt>unstable</tt> (ou même <tt>experimental</tt>) <footnote><p>Certaines personnes utilisent des valeurs de distribution non valables comme <tt>UNRELEASED</tt> pour éviter d'envoyer un paquet accidentellement lors de la mise à jour d'un paquet dans un système de gestion de version partagé.</p></footnote>, et l'urgence ne devrait pas être changée en quoique ce soit de supérieur à « low ». :-)
it: La riga 1 indica il nome del pacchetto, la versione, la distribuzione e l'urgenza. Il nome deve corrispondere al nome del pacchetto sorgente, mentre la distribuzione dovrebbe essere <tt>unstable</tt> (o anche <tt>experimental</tt>) <footnote><p>Alcune persone utilizzano dei valori di distribuzione non validi come <tt>UNRELEASED</tt> per evitare che un pacchetto venga accidentalmente caricato in una VCS condivisa. </p></footnote> , e l'urgenza non dovrebbe essere cambiata in qualcosa di più alto di <tt>low</tt>. :-)
ja: 1 行目はパッケージ名、バージョン、ディストリビューション、 そして緊急度 (urgency) です。ここに書くパッケージ名はソースパッケージの名前と一致していなければ なりません。 またディストリビューションは<tt>unstable</tt> (または<tt>experimental</tt>)にすべきです。 <footnote><p>共有VSCを更新する時に、間違ってパッケージがアップロードされないように、<tt>UNRELEASED</tt>などの無効なディストリビューションの値を設定する人もいます。</p></footnote>また、緊急度は<tt>low</tt>より高くしてはいけません。:-)
zh_cn: 第 1 行是软件包名、版本号、发行版和紧急程度。软件包名必须与实际的源代码包名相同，发行版可以是 <tt>unstable</tt>(甚至 <tt>experimental</tt>)<footnote><p>有些人使用无效的发行版名称，如 <tt>UNRELEASED</tt> 以防止某些软件包在共享的 VCS 中修改时被意外上传。</p></footnote>，紧急程度则不要使用任何高于 <tt>low</tt> 的内容。 :-)
zh_tw: 第 1 行是套件名、版本號、發行版和緊急程度。套件名必須與實際的原始碼包名相同，發行版可以是 <tt>unstable</tt>(甚至 <tt>experimental</tt>)<footnote><p>有些人使用無效的發行版名稱，如 <tt>UNRELEASED</tt> 以防止某些套件在共享的 VCS 中修改時被意外上傳。</p></footnote>，緊急程度則不要使用任何高於 <tt>low</tt> 的內容。 :-)

source: Lines 3-5 are a log entry, where you document changes made in this package revision (not the upstream changes - there is special file for that purpose, created by the upstream authors, which you will later install as <file>/usr/share/doc/gentoo/changelog.gz</file>). Let's assume your ITP (Intent To Package) bug report number was "<tt>12345</tt>". New lines must be inserted just before the uppermost line that begins with "<tt>*</tt>" (asterisk). You can do it with <manref section="1" name="dch">, or manually with a text editor.
ca: Les línies 3-5 són entrades de registre, on es documenta els canvis fets en la versió/revisió actual del paquet (no els canvis fets en les fonts originals: per això els autors de les fonts fan servir un altre arxiu que s'instal·larà com <file>/usr/share/doc/gentoo/changelog.gz</file>). A l'exemple se suposa que el codi de l'informe d'error ITP («Intent To Package», intent d'empaquetament) és "<tt>12345</tt>". Les noves línies s'afegiran a continuació de la primera començant sempre amb un "<tt>*</tt>" (asterisc) . Pots fer servir <manref section="1" name="dch"> per afegir nova informació o un editor de text.
es: Las líneas 3 a 5 son una entrada de registro, donde se documentan los cambios hechos en esta revisión del paquete (no los cambios en las fuentes originales - hay un fichero especial para este propósito, creado por los autores originales y que instalarás luego como <file>/usr/share/doc/gentoo/changelog.gz</file>). En el ejemplo se supone que el código del informe de error ITP («Intent To Package», intento de empaquetar) es "<tt>12345</tt>". Las nuevas líneas deben insertarse justo antes de la línea que hay más arriba que comienza por un asterisco ("<tt>*</tt>"). Puede hacerlo con <manref section="1" name="dch">, o manualmente con cualquier editor de texto.
fr: Les lignes 3 à 5 composent l'entrée de journal, où vous documentez les modifications effectuées dans la révision du paquet (pas les modifications amont &mdash; il y a un fichier spécial pour cela, créé par les auteurs amont, que vous installerez comme <file>/usr/share/doc/gentoo/changelog.gz</file>). Supposons que votre rapport de bogue ITP (« Intent To Package » ou intention d'empaqueter) avait pour numéro « <tt>12345</tt> ». Les nouvelles lignes doivent être insérées au niveau de la première ligne qui commence avec une astérisque (« * »). Vous pouvez utiliser <manref section="1" name="dch"> pour le modifier.
it: Le righe 3-5 sono una voce del registro, in cui vengono documentati i cambiamenti fatti nella revisione del pacchetto (non dei cambiamenti del pacchetto originario - c'è un file apposta per questo scopo, creato dagli autori originali, che verrà installato successivamente <file>/usr/share/doc/gentoo/changelog.gz</file>). Supponiamo che il numero di servizio del ticket ITP fosse "<tt>12345</tt>". Nuove righe devono essere aggiunte appena prima della riga più in alto che comincia con "<tt>*</tt>" (asterisco). Ciò si può fare con <manref section="1" name="dch">, o manualmente con un editor testuale.
ja: 3-5 行目はログエントリで、ここにリビジョンのパッケージで 行われた変更を記述します (上流プログラムそのものの変更点では ありません - その目的のためには、上流作者によって作成され、 <file>/usr/share/doc/gentoo/changelog.gz</file>としてインストールされる 専用のファイルが存在しています)。ITP (Intent To Package)バグレポート番号を"<tt>12345</tt>"と仮定しましょう。新しい行は"<tt>*</tt>" (アスタリスク)で始まる最初の行の直前に挿入します。この操作は<manref section="1" name="dch">を使うと便利ですが、 テキストエディタを使って実行してももちろん構いません。
zh_cn: 第 3-5 行是一个很长的条目，记录了你在这个 Debian 版本中做出的修改(不是上游)修改——上游修改由上游作者创建另外一个文件并维护，它们应被安装为 <file>/usr/share/doc/gentoo/changelog.gz</file>)。假设你的 ITP (Intent To Package，计划打包)的 Bug 号为 <tt>12345</tt>。新行必须插入在上一个以星号 <tt>*</tt> 开头的行的正下方。你可以使用 <manref section="1" name="dch"> 完成这个工作，也可以使用普通的文本编辑器手工完成。
zh_tw: 第 3-5 行是一個很長的條目，記錄了你在這個 Debian 版本中做出的修改(不是上游)修改——上游修改由上游作者創建另外一個檔案並維護，它們應被安裝爲 <file>/usr/share/doc/gentoo/changelog.gz</file>)。假設你的 ITP (Intent To Package，計劃打包)的 Bug 號爲 <tt>12345</tt>。新行必須插入在上一個以星號 <tt>*</tt> 開頭的行的正下方。你可以使用 <manref section="1" name="dch"> 完成這個工作，也可以使用普通的文本編輯器手工完成。

source: You will end up with something like this:
ca: Aquest serà el contingut del fitxer:
es: Terminarás con algo así:
fr: Vous obtiendrez quelque chose comme :
it: Alla fine si avrà qualcosa del genere:
ja: 最終的にこんなふうになります。
zh_cn: 最后它会成为以下的样子：
zh_tw: 最後它會成爲以下的樣子：

source: You can read more about updating the <file>changelog</file> file later in <ref id="update">.
ca: A la secció <ref id="update"> s'explicaran alguns aspectes més de l'actualització del fitxer <file>changelog</file>.
es: Puedes leer más sobre cómo actualizar el fichero changelog más adelante en <ref id="update">.
fr: Vous pouvez en apprendre plus sur la mise à jour du fichier <file>changelog</file> plus loin en <ref id="update">.
ja: <file>changelog</file>の更新については、<ref id="update">で詳しく説明します。
zh_cn: 你可以在关于更新的 <ref id="update"> 中了解更多关于 <file>changelog</file> 的内容。
zh_tw: 你可以在關於更新的 <ref id="update"> 中瞭解更多關於 <file>changelog</file> 的內容。

source: <file>rules</file> file
ca: El fitxer <file>rules</file>.
es: El archivo <file>rules</file>
fr: Fichier <file>rules</file>
it: Il file <file>rules</file>
ja: <file>rules</file>ファイル
zh_cn: <file>rules</file> 文件
zh_tw: <file>rules</file> 檔案

source: Now we need to take a look at the exact rules which <manref section="1" name="dpkg-buildpackage"> will use to actually create the package. This file is actually another <file>Makefile</file>, but different from the one(s) in the upstream source. Unlike other files in <file>debian</file>, this one is marked as executable.
ca: Ara mirarem quines són les regles que farà servir <manref section="1" name="dpkg-buildpackage"> per a la construcció del paquet. Aquest arxiu és un tipus de <file>Makefile</file>, però diferent dels que hi ha al codi font. En contra dels altres arxius del directori <file>debian</file> és un guió executable i cal que tengui aquesta propietat.
es: Ahora necesitamos mirar las reglas exactas que <manref section="1" name="dpkg-buildpackage"> utilizará para construir el paquete. Este fichero es en realidad otro <file>Makefile</file>, pero diferente al que viene en las fuentes originales. A diferencia de otros ficheros en <file>debian</file>, éste debe ser un fichero ejecutable.
fr: Il faut maintenant examiner les règles utilisées par <manref section="1" name="dpkg-buildpackage"> pour créer vraiment le paquet. Ce fichier est en fait un autre <file>Makefile</file>, mais différent de ceux des sources amont. Contrairement aux autres fichiers de <file>debian</file>, celui-ci est marqué comme exécutable.
it: Ora si darà uno sguardo alle regole esatte che <manref section="1" name="dpkg-buildpackage"> userà per creare il pacchetto. In realtà questo file non è che un altro <file>Makefile</file>, ma diverso da quelli della sorgente originale. Differentemente dagli altri file sotto <file>debian</file>, questo qui è marcato come eseguibile.
ja: さて、今度は <manref section="1" name="dpkg-buildpackage">が実際にパッケージを作成するために使うルールについて見ていきましょう。このファイルは、もうひとつの<file>Makefile</file>といった感じのものですが、上流ソースに含まれる Makefile とは違います。debian/ ディレクトリに含まれる他のファイルとは異なり、 このファイルには実行属性が付けられています。
zh_cn: 现在我们需要看看 <manref section="1" name="dpkg-buildpackage"> 用于实际创建软件包的 rules 文件。这个文件是一个 <file>Makefile</file>，但不同于上游源代码中的那个。和 <file>debian</file> 目录中的其他文件不同，这个文件被标记为可执行。
zh_tw: 現在我們需要看看 <manref section="1" name="dpkg-buildpackage"> 用於實際創建套件的 rules 檔案。這個檔案是一個 <file>Makefile</file>，但不同於上游原始碼中的那個。和 <file>debian</file> 目錄中的其他檔案不同，這個檔案被標記爲可執行。

source: Targets of <file>rules</file> file
ca: Objectius del fitxer <file>rules</file>.
es: Objetivos del archivo <file>rules</file>
fr: Cibles du fichier <file>rules</file>
it: Obiettivi del file <file>rules</file>
ja: <file>rules</file>ファイルのターゲット
zh_cn: <file>rules</file> 文件中的 target
zh_tw: <file>rules</file> 檔案中的 target

source: Every <file>rules</file> file, as any other <file>Makefile</file>, consists of several targets and their rules specifying how to handle the source. <url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-debianrules" name="Debian Policy Manual, 4.9 'Main building script: debian/rules'"> explains its details.
ca: Cada arxiu <file>rules</file> (﻿de regles), com altres arxius <file>Makefile</file>, es compon de vàries regles que especifiquen què cal fer amb les fonts. <url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-debianrules" name="«Debian Policy Manual, 4.9 'Main building script: debian/rules»'"> explica detalladament la seva funció.
es: Cada fichero <file>rules</file> (de reglas), como muchos otros <file>Makefile</file>, se compone de varias reglas que especifican cómo tratar las fuentes.<url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-debianrules" name="«Debian Policy Manual, 4.9 'Main building script: debian/rules'»"> explica detalladamente su función.
fr: Tout fichier <file>rules</file>, comme tout autre <file>Makefile</file>, consiste en plusieurs cibles et leurs règles précisant comment gérer le code source. La <url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-debianrules" name="Charte Debian, 4.9 « Script de construction principal : debian/rules »"> l'explique en détail.
it: Ogni file <file>rules</file>, come qualsiasi altro <file>Makefile</file>, consiste di diversi obiettivi e regole che specificano come gestire il sorgente. <url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-debianrules" name="Manuale delle policy di Debian, 4.9 'Script principale per la creazione: debian/rules'"> ne spiega i dettagli.
ja: <file>rules</file>ファイルは<file>Makefile</file>と同様に、ターゲットとルールで構成され、ソースファイルをどう扱うかを定めています。詳細は<url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-debianrules" name="Debian Policy Manual, 4.9 'Main building script: debian/rules'">を参照してください。
zh_cn: 每个 <file>rules</file> 文件都和其他的 <file>Makefile</file> 一样包含多个 target 和其中指定如何处理源代码的规则。<url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-debianrules" name="Debian Policy Manual, 4.9 'Main building script: debian/rules'"> 中对此做出了详细解释。
zh_tw: 每個 <file>rules</file> 檔案都和其他的 <file>Makefile</file> 一樣包含多個 target 和其中指定如何處理原始碼的規則。<url id="http://www.debian.org/doc/debian-policy/ch-source.html#s-debianrules" name="Debian Policy Manual, 4.9 'Main building script: debian/rules'"> 中對此做出了詳細解釋。

source: The simplified explanation of targets are the following.
ca: A continuació tens una explicació simplificada dels obejctius:
es: A continuación se proporciona una explicación simplificada de los distintos objetivos.
fr: Voici une explication simplifiée des cibles :
it: La spiegazione breve degli obiettivi è la seguente.
ja: ターゲットについて簡単に説明します。
zh_cn: 以下是对各 target 的简单解释：
zh_tw: 以下是對各 target 的簡單解釋：

source: <tt>clean</tt> target: to clean all compiled, generated, and useless files in the build-tree. (required)
ca: <tt>clean</tt> (obligatori): elimina tots els fitxers generats, compilats o innecessaris de l'estructura de directoris de les fonts.
es: <tt>clean</tt> (obligatorio): elimina todos los archivos generados, compilados o innecesarios del árbol de directorios de las fuentes.
fr: <tt>clean</tt> (obligatoire) : pour nettoyer tout les fichiers compilés, créés, et inutiles de l'arborescence de construction ;
it: obiettivo <tt>clean</tt>: ripulire tutti i file compilati, generati ed inutili nella struttura di cartelle del pacchetto. (richiesto)
ja: <tt>clean</tt>ターゲット: ビルドツリー内に生成、コンパイルされた役に立たないファイルを掃除します。(必須)
zh_cn: <tt>clean</tt>：清理所有编译的、生成的或编译树中无用的文件。(必须)
zh_tw: <tt>clean</tt>：清理所有編譯的、生成的或編譯樹中無用的檔案。(必須)

source: <tt>build</tt> target: to build the source into compiled programs and formatted documents in the build-tree. (required)
ca: <tt>build</tt> (obligatori): construeix els fitxers executables o els documents amb format a partir dels fitxers de les fonts.
es: <tt>build</tt> (obligatorio): para la construcción de archivos compilados a partir de los archivos fuente o la construcción de documentos formateados.
fr: <tt>build</tt> (obligatoire) : pour construire les programmes compilés et les documents formatés à partir des sources dans l'arborescence de construction ;
it: obiettivo <tt>build</tt>: costruire tutti i sorgenti per ottenere programmi compilati e documenti formattati nell'albero delle cartelle del pacchetto. (richiesto)
ja: <tt>build</tt> ターゲット: ソースをビルドして、ビルドツリー内にコンパイルしたプログラムとドキュメントを生成します。(必須)
zh_cn: <tt>build</tt>：在编译树中将代码编译为程序并生成格式化的文档。(必须)
zh_tw: <tt>build</tt>：在編譯樹中將程式碼編譯爲程式並生成格式化的文件。(必須)
