Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: $ apt-get source <var>foo</var> ... dpkg-source: info: extracting <var>foo</var> in <var>foo</var>-<var>oldversion</var> dpkg-source: info: unpacking <var>foo</var>_<var>oldversion</var>.orig.tar.gz dpkg-source: info: applying <var>foo</var>_<var>oldversion</var>-1.debian.tar.gz $ ls -F <var>foo</var>-<var>oldversion</var>/ <var>foo</var>_<var>oldversion</var>-1.debian.tar.gz <var>foo</var>_<var>oldversion</var>-1.dsc <var>foo</var>_<var>oldversion</var>.orig.tar.gz $ wget http://example.org/<var>foo</var>/<var>foo</var>-<var>newversion</var>.tar.gz $ cd <var>foo</var>-<var>oldversion</var> $ uupdate -v <var>newversion</var> ../<var>foo</var>-<var>newversion</var>.tar.gz $ cd ../<var>foo</var>-<var>newversion</var> $ while quilt push; do quilt refresh; done $ dch ... document changes made
ca: $ apt-get source <var>nom_paquet</var> ... dpkg-source: info: extracting <var>nom_paquet</var> in <var>nom_paquet</var>-<var>número_versió_anterior</var> dpkg-source: info: unpacking <var>nom_paquet</var>_<var>número_versió_anterior</var>.orig.tar.gz dpkg-source: info: applying <var>nom_paquet</var>_<var>número_versió_anterior</var>-1.debian.tar.gz $ ls -F <var>nom_paquet</var>-<var>número_versió_anterior</var>/ <var>nom_paquet</var>_<var>número_versió_anterior</var>-1.debian.tar.gz <var>nom_paquet</var>_<var>número_versió_anterior</var>-1.dsc <var>nom_paquet</var>_<var>número_versió_anterior</var>.orig.tar.gz $ wget http://example.org/<var>nom_paquet</var>/<var>nom_paquet</var>-<var>número_versió_actual</var>.tar.gz $ cd <var>nom_paquet</var>-<var>número_versió_anterior</var> $ uupdate -v <var>número_versió_actual</var> ../<var>nom_paquet</var>-<var>número_versió_actual</var>.tar.gz $ cd ../<var>nom_paquet</var>-<var>número_versió_actual</var> $ while quilt push; do quilt refresh; done $ dch ... documenta les modificacions realitzades
es: $ apt-get source <var>nombre_del_paquete</var> ... dpkg-source: info: extracting <var>nombre_del_paquete</var> in <var>nombre_del_paquete</var>-<var>versión_anterior</var> dpkg-source: info: unpacking <var>nombre_del_paquete</var>_<var>versión_anterior</var>.orig.tar.gz dpkg-source: info: applying <var>nombre_del_paquete</var>_<var>versión_anterior</var>-1.debian.tar.gz $ ls -F <var>nombre_del_paquete</var>-<var>versión_anterior</var>/ <var>nombre_del_paquete</var>_<var>versión_anterior</var>-1.debian.tar.gz <var>nombre_del_paquete</var>_<var>versión_anterior</var>-1.dsc <var>nombre_del_paquete</var>_<var>versión_anterior</var>.orig.tar.gz $ wget http://ejemplo.org/<var>nombre_del_paquete</var>/<var>nombre_del_paquete</var>-<var>nueva_versión</var>.tar.gz $ cd <var>nombre_del_paquete</var>-<var>versión_anterior</var> $ uupdate -v <var>nueva_versión</var> ../<var>nombre_del_paquete</var>-<var>nueva_versión</var>.tar.gz $ cd ../<var>nombre_del_paquete</var>-<var>nueva_versión</var> $ while quilt push; do quilt refresh; done $ dch ... documenta las modificaciones realizadas
fr: $ apt-get source <var>foo</var> ... dpkg-source: info: extraction de <var>toto</var> dans <var>toto</var>-<var>ancienneversion</var> dpkg-source: info: extraction de <var>toto</var>_<var>ancienneversion</var>.orig.tar.gz dpkg-source: info: extraction de <var>toto</var>_<var>ancienneversion</var>-1.debian.tar.gz $ ls -F <var>toto</var>-<var>ancienneversion</var>/ <var>toto</var>_<var>ancienneversion</var>-1.debian.tar.gz <var>toto</var>_<var>ancienneversion</var>-1.dsc <var>toto</var>_<var>ancienneversion</var>.orig.tar.gz $ wget http://example.org/<var>toto</var>/<var>toto</var>-<var>nouvelleversion</var>.tar.gz $ cd <var>toto</var>-<var>ancienneversion</var> $ uupdate -v <var>nouvelleversion</var> ../<var>toto</var>-<var>nouvelleversion</var>.tar.gz $ cd ../<var>toto</var>-<var>nouvelleversion</var> $ while quilt push; do quilt refresh; done $ dch ... documentation des modifications réalisées

source: If you set up a <file>debian/watch</file> file as described in <ref id="watch">, you can skip the <prgn>wget</prgn> command. You simply run <manref section="1" name="uscan"> in the <file><var>foo</var>-<var>oldversion</var></file> directory instead of the <prgn>uupdate</prgn> command. This will <em>automagically</em> look for the updated source, download it, and run the <prgn>uupdate</prgn> command. <footnote><p>If the <prgn>uscan</prgn> command downloads the updated source but it does not run the <prgn>uupdate</prgn> command, you should correct the <file>debian/watch</file> file to have "<tt>debian uupdate</tt>" at the end of the URL. </p></footnote>
ca: Si has configurat el fitxer <file>debian/watch</file> com s'ha explicat a <ref id="watch">, no és necessari que executis l'ordre <prgn>wget</prgn>. Simplement, executa <manref section="1" name="uscan"> en el directori <file><var>nom_paquet</var>-<var>número_versió_anterior</var></file> en lloc de l'ordre <prgn>uupdate</prgn>. Així, es buscarà <em>automàticament</em> el fitxer de les fonts, se descarregarà en el teu ordinador i s'executarà l'ordre <prgn>uupdate</prgn> <footnote><p>Si l'ordre <prgn>uscan</prgn> descarrega les fonts però no executa l'ordre <prgn>uupdate</prgn>, cal modificar l'arxiu <file>debian/watch</file> afegint "<tt>debian uupdate</tt>" al final de l'URL del fitxer. </p></footnote>.
es: Si has configurado el archivo «<file>debian/watch</file>» como se ha descrito en <ref id="watch">, puedes saltarte la orden <prgn>wget</prgn>. Simplemente, ejecuta <manref section="1" name="uscan"> en el directorio <file><var>nombre_del_paquete</var>-<var>antigua_versión</var></file> en lugar de la orden <prgn>uupdate</prgn>. Así, se buscará <em>automáticamente</em> el archivo de las fuentes, se descargará en tu ordenador y se ejecutará la orden <prgn>uupdate</prgn> <footnote><p>Si la orden <prgn>uscan</prgn> descargar las fuentes pero no ejecuta la orden <prgn>uupdate</prgn>, debes corregir el archivo <file>debian/watch</file> añadiendo "<tt>debian uupdate</tt>" al final de la URL del archivo. </p></footnote>.
fr: Si le fichier <file>debian/watch</file> est configuré comme décrit en <ref id="watch">, la commande <prgn>wget</prgn> est inutile. Exécutez simplement <manref section="1" name="uscan"> dans le répertoire <file><var>toto</var>-<var>ancienneversion</var></file> à la place de la commande <prgn>uupdate</prgn> suffit. Les sources mises à jour seront automatiquement recherchées, téléchargées, et la commande <prgn>uupdate</prgn> sera exécutée. <footnote><p>Si la commande <prgn>uscan</prgn> télécharge les sources mises à jour mais n'exécute pas la commande <prgn>uupdate</prgn>, vous devriez corriger le fichier <file>debian/watch</file> pour avoir « <tt>debian uupdate</tt> » après l'URL. </p></footnote>
zh_cn: 如果你按照 <ref id="watch"> 的叙述设置了 <file>debian/watch</file> 文件，你可以跳过这个 <prgn>wget</prgn> 命令，转而在 <file><var>foo</var>-<var>oldversion</var></file> 目录中运行 <manref section="1" name="uscan">，且无需再执行 <prgn>uupdate</prgn> 命令。它会 <em>自动</em> 查找新的源代码、下载并运行 <prgn>uupdate</prgn> 命令。<footnote><p>如果 <prgn>uscan</prgn> 命令下载并更新了源代码，但没有运行 <prgn>uupdate</prgn> 命令，你应该修正 <file>debian/watch</file> 文件，使 URL 末尾后带有 <tt>debian uupdate</tt>。</p></footnote>
zh_tw: 如果你按照 <ref id="watch"> 的敘述設置了 <file>debian/watch</file> 檔案，你可以跳過這個 <prgn>wget</prgn> 命令，轉而在 <file><var>foo</var>-<var>oldversion</var></file> 目錄中運行 <manref section="1" name="uscan">，且無需再執行 <prgn>uupdate</prgn> 命令。它會 <em>自動</em> 查找新的原始碼、下載並運行 <prgn>uupdate</prgn> 命令。<footnote><p>如果 <prgn>uscan</prgn> 命令下載並更新了原始碼，但沒有運行 <prgn>uupdate</prgn> 命令，你應該修正 <file>debian/watch</file> 檔案，使 URL 末尾後帶有 <tt>debian uupdate</tt>。</p></footnote>

source: You can release this updated source by repeating what you did in <ref id="completebuild">, <ref id="checkit">, and <ref id="upload">.
ca: Pots fer el llançament de l'actualització del paquet repetint el que s'ha explicat en <ref id="completebuild">, <ref id="checkit"> <ref id="upload">.
es: Puedes liberar la nueva versión del paquete repitiendo lo expuesto en <ref id="completebuild">, <ref id="checkit"> y <ref id="upload">.
fr: Vous pouvez publier ces sources mises à jour en recommençant ce qui a été fait en <ref id="completebuild">, <ref id="checkit"> et <ref id="upload">.
it: Si possono rilasciare questi sorgenti aggiornati ripetendo ciò che si è fatto in <ref id="completebuild">, <ref id="checkit">, ed <ref id="upload">.
ja: 今まで <ref id="completebuild">、 <ref id="checkit">、<ref id="upload"> の中で実行してきたことを繰り返し、更新したソースをリリースできます。
zh_cn: 重复 <ref id="completebuild">、<ref id="checkit"> 和 <ref id="upload"> 中的操作，即可发布此更新的软件包。
zh_tw: 重複 <ref id="completebuild">、<ref id="checkit"> 和 <ref id="upload"> 中的操作，即可發佈此更新的套件。

source: Updating the packaging style
ca: Actualitzar el format del paquet.
es: Actualizar el formato del paquete
fr: Mise à jour du style d'empaquetage
it: Aggiornare lo stile di pacchettizzazione
ja: パッケージ化スタイルの更新
zh_cn: 更新打包风格
zh_tw: 更新打包風格

source: Updating the package style is not a required activity for the update of a package. But, you can use the full capability of the modern <package>debhelper</package> system and the <tt>3.0</tt> source format by doing this. <footnote><p>If your sponsor or other maintainers object to updating the existing packaging style, it is not worth bothering nor arguing. There are more important things to do.</p></footnote>
ca: Per actualitzar un paquet no és necessari actualitzar el format de construcció del paquet. Encara així, pots aprofitar tota la funcionalitat de <package>debhelper</package> i del format <tt>3.0</tt> fent el següent <footnote><p>Si la persona que patrocina el teu paquet o altres desenvolupadors fan objeccions a l'actualització del format del paquet, no val la pena entossudir-se a argumentar a favor. Hi ha altres coses més importants que atendre. </p></footnote>:
es: Para actualizar un paquete no es necesario actualizar el formato del paquete. Aún así, puedes aprovechar completamente la funcionalidad de <package>debhelper</package> y del formato <tt>3.0</tt> haciendo lo siguiente <footnote><p>Si quien patrocina tu paquete u otros desarrolladores hacen objeciones a la actualización del formato del paquete, no vale la pena empeñarse en argumentar a favor. Hay otras cosas más importantes que atender. </p></footnote>:
fr: La mise à jour du style d'empaquetage n'est pas nécessaire lors de la mise à jour d'un paquet. Néanmoins, vous pouvez profiter de tout le potentiel du système <package>debhelper</package> moderne et du format source <tt>3.0</tt> en même temps : <footnote><p>Si votre parrain ou d'autres responsables s'opposent à la mise à jour du style d'empaquetage existant, ça ne vaut pas la peine de s'embêter à argumenter. Il y a des choses plus importantes à faire.</p></footnote>
it: L'aggiornamento dello stile del pacchetto non è una attività obbligatoria nel processo di aggiornamento di quest'ultimo. Tuttavia facendo ciò si può sfruttare appieno la capacità del moderno sistema <package>debhelper</package> ed il formato sorgente <tt>3.0</tt>. <footnote><p>Se il proprio sponsor o altri manutentori non ritengono sia necessario aggiornare lo stile del pacchetto, allora non vale la pena impegnarcisi. Ci sono cose più importanti da fare.</p></footnote>
zh_cn: 更新打包风格不是更新软件包的必须步骤，但是这样可以使你的软件包得到对现代的 <package>debhelper</package> 系统和 <tt>3.0</tt> 源代码包格式完整的兼容性。<footnote><p>如果你的 sponsor 或其他维护者一定反对更新已有的打包风格，则不值得去为此烦恼或争论，总是有更重要的事要做。</p></footnote>
zh_tw: 更新打包風格不是更新套件的必須步驟，但是這樣可以使你的套件得到對現代的 <package>debhelper</package> 系統和 <tt>3.0</tt> 原始碼包格式完整的兼容性。<footnote><p>如果你的 sponsor 或其他維護者一定反對更新已有的打包風格，則不值得去爲此煩惱或爭論，總是有更重要的事要做。</p></footnote>

source: If you need to add erased template files for any reason, you may run <prgn>dh_make</prgn> again in the same Debian package source tree with <tt>--addmissing</tt> option. Then edit them properly.
ca: Si necessites novament algun dels fitxers de plantilla eliminats, pots regenerar-los executant <prgn>dh_make</prgn> amb l'opció <tt>--addmissing</tt> des del directori de les fonts. A continuació, fes les modificacions ja explicades.
es: Si necesitas de nuevo algunos de los archivos de plantilla eliminados, puedes regenerarlos ejecutando otra vez <prgn>dh_make</prgn> con la opción <tt>--addmissing</tt> en el directorio de las fuentes. A continuación modifícalos correctamente.
fr: si vous devez, pour quelque raison que ce soit, ajouter des fichiers modèles qui avaient été effacés, pour pouvez exécuter <prgn>dh_make</prgn> à nouveau depuis le répertoire des sources Debian, avec l'option <tt>--addmissing</tt>. Puis modifier les correctement ;
zh_cn: 如果你需要重新添加已删除的模板文件，可以在同一个 Debian 软件包源代码树中运行 <prgn>dh_make</prgn>，并添加 <tt>--addmissing</tt> 选项。然后对模板进行相应的编辑。
zh_tw: 如果你需要重新添加已刪除的模板檔案，可以在同一個 Debian 套件原始碼樹中運行 <prgn>dh_make</prgn>，並添加 <tt>--addmissing</tt> 選項。然後對模板進行相應的編輯。

source: If the package has not updated to use the <package>debhelper</package> V7 <prgn>dh</prgn> syntax for the <file>debian/rules</file> file, update it to use <prgn>dh</prgn>. Update the <file>debian/control</file> file accordingly.
ca: Si el paquet no està actualitzat per fer servir la nova sintaxi <prgn>dh</prgn> de la versió 7 de <package>debhelper</package> en el fitxer <file>debian/rules</file>, fes-ne l'actualització per fer servir <prgn>dh</prgn>. També hauràs d'actualitzar <file>debian/control</file>.
es: Si el paquete no está actualizado para utilizar la nueva sintaxis de la versión 7 de <package>debhelper</package> en el archivo <file>debian/rules</file>, actualízalo para usar <prgn>dh</prgn>. También deberás actualizar <file>debian/control</file>.
fr: si le paquet n'a pas été mis à jour pour utiliser la syntaxe <prgn>dh</prgn> de <package>debhelper</package> V7 dans le fichier <file>debian/rules</file>, mettez-le à jour pour utiliser <prgn>dh</prgn>. Mettez à jour le fichier <file>debian/control</file> en conséquence ;
it: Se il pacchetto non è stato aggiornato per utilizzare la sintassi V7 di <prgn>dh</prgn> del pacchetto <package>debhelper</package> per il file <file>debian/rules</file>, si deve effettuare una aggiornamento per poter usare <prgn>dh</prgn>. Si aggiorni di conseguenza anche il file <file>debian/control</file>.
zh_cn: 如果软件包的 <file>debian/rules</file> 文件没有更新为使用 <package>debhelper</package> V7 的 <prgn>dh</prgn> 语法，则更新它使用 <prgn>dh</prgn>。在需要的时候更新 <file>debian/control</file> 文件。
zh_tw: 如果套件的 <file>debian/rules</file> 檔案沒有更新爲使用 <package>debhelper</package> V7 的 <prgn>dh</prgn> 語法，則更新它使用 <prgn>dh</prgn>。在需要的時候更新 <file>debian/control</file> 檔案。

source: If you want to update the <file>rules</file> file created with the <file>Makefile</file> inclusion mechanism of the Common Debian Build System (<package>cdbs</package>) to the <prgn>dh</prgn> syntax, see <file>/usr/share/doc/cdbs/cdbs-doc.html</file> and understand its <tt>DEB_*</tt> configuration variables. <footnote><p>In the <package>cdbs</package> (0.4.74) package, there are some negative descriptions of the <file>rules</file> file created by the <prgn>dh_make</prgn> command for the non-<package>cdbs</package> choices. Do not worry about it. It applies only for <tt>lenny</tt> which created explicit targets with long list of <prgn>dh_*</prgn> commands.</p></footnote>
ca: Si actualitzes el fitxer <file>rules</file> construït pel mecanisme d'inclusió <file>Makefile</file> del sistema de compilació Debian (<package>cdbs</package>) a la nova sintaxi <prgn>dh</prgn>, llegeix <file>/usr/share/doc/cdbs/cdbs-doc.html</file> i aprèn les variables de configuració <tt>DEB_*</tt> <footnote><p>En el paquet <package>cdbs</package> (versió 0.4.74), hi ha alguns comentaris negatius sobre el fitxer <file>rules</file> construït amb l'ordre <prgn>dh_make</prgn> en fer servir sistemes distints a <package>cdbs</package>. No en facis cas, només afecten a la versió <tt>lenny</tt>: llavors es generaven objectius amb una llarga llista d'ordres <prgn>dh_*</prgn>. </p></footnote>.
es: Si vas ha actualizar el archivo <file>rules</file> construido por el mecanismo de inclusión <file>Makefile</file> del sistema de compilación Debian (<package>cdbs</package>) a la nueva sintaxis <prgn>dh</prgn>, lee <file>/usr/share/doc/cdbs/cdbs-doc.html</file> y aprende las variables de configuración <tt>DEB_*</tt> <footnote><p>En el paquete <package>cdbs</package> (versión 0.4.74), hay algunos comentarios negativos sobre el archivo <file>rules</file> construido por la orden <prgn>dh_make</prgn> al utilizar sistemas distintos a <package>cdbs</package>. No te preocupes. Esto solo afecta a la versión en <tt>lenny</tt>: entonces se generaban objetivos con una larga lista de órdenes <prgn>dh_*</prgn>. </p></footnote>.
fr: si vous voulez mettre à jour le fichier <file>rules</file> créé avec le mécanisme d'héritage <file>Makefile</file> du système de compilation usuel Debian (<package>cdbs</package>) vers la syntaxe <prgn>dh</prgn>, voyez <file>/usr/share/doc/cdbs/cdbs-doc.html</file> et comprenez ses variables de configuration <tt>DEB_*</tt> ; <footnote><p>Dans le paquet <package>cdbs</package> (0.4.74), vous trouverez certaines descriptions négatives du fichier <file>rules</file> créé par la commande <prgn>dh_make</prgn> pour les choix non <package>cdbs</package>. Ne vous en inquiétez pas. C'est uniquement relatif à la version de <tt>Lenny</tt> qui créait des cibles explicites et une longue liste de commandes <prgn>dh_*</prgn>.</p></footnote>
zh_cn: 如果你希望将使用 <package>cdbs</package> 的 <file>Makefile</file> 语法创建的 <file>rules</file> 文件更新为 <prgn>dh</prgn> 语法，参看 <file>/usr/share/doc/cdbs/cdbs-doc.html</file> 并理解各 <tt>DEB_*</tt> 配置变量。<footnote><p>在 <package>cdbs</package> (0.4.74)软件包中有一些对于 <prgn>dh_make</prgn> 创建的非 <package>cdbs</package> 的 <file>rules</file> 文件的消极描述。不要担心它们，它们仅是针对于 <tt>lenny</tt> 中需要列出大串的 <prgn>dh_*</prgn> 命令而言的。</p></footnote>
zh_tw: 如果你希望將使用 <package>cdbs</package> 的 <file>Makefile</file> 語法創建的 <file>rules</file> 檔案更新爲 <prgn>dh</prgn> 語法，參考 <file>/usr/share/doc/cdbs/cdbs-doc.html</file> 並理解各 <tt>DEB_*</tt> 設定變量。<footnote><p>在 <package>cdbs</package> (0.4.74)套件中有一些對於 <prgn>dh_make</prgn> 創建的非 <package>cdbs</package> 的 <file>rules</file> 檔案的消極描述。不要擔心它們，它們僅是針對於 <tt>lenny</tt> 中需要列出大串的 <prgn>dh_*</prgn> 命令而言的。</p></footnote>

source: If you have a <tt>1.0</tt> source package without the <file><var>foo</var>.diff.gz</file> file, you can update it to the newer <tt>3.0 (native)</tt> source format by creating <file>debian/source/format</file> with "<tt>3.0 (native)</tt>". The rest of <file>debian/*</file> files can be just copied.
ca: Si treballes amb un paquet construït amb el format <tt>1.0</tt> sense l'arxiu <file><var>nom_paquet</var>.diff.gz</file>, pots actualitzar-lo a la nova versió <tt>3.0 (native)</tt> afegint el fitxer <file>debian/source/format</file> amb la línia <tt>3.0 (native)</tt>. Copia els altres fitxers del directori <file>debian/*</file>.
es: Si estás trabajando con un paquete construido con el formato <tt>1.0</tt> sin el archivo <file><var>nombre_del_paquete</var>.diff.gz</file>, puedes actualizarlo a la nueva versión <tt>3.0 (native)</tt> añadiendo el archivo <file>debian/source/format</file> con la linea <tt>3.0 (native)</tt>. Copia los otros archivos del directorio <file>debian/*</file>.
fr: si vous avez un paquet source <tt>1.0</tt> sans fichier <file><var>toto</var>.diff.gz</file>, vous pouvez le mettre à jour au récent format source <tt>3.0 (native)</tt> en créant <file>debian/source/format</file> contenant « <tt>3.0 (native)</tt> ». Le reste des fichiers <file>debian/*</file> peut être simplement copié ;
it: Se si ha un pacchetto sorgente nella versione <tt>1.0</tt> senza il file <file><var>foo</var>.diff.gz</file>, si può aggiornare al nuovo formato sorgente <tt>3.0 (native)</tt> creando il file <file>debian/source/format</file> con "<tt>3.0 (native)</tt>". Gli altri file <file>debian/*</file> possono essere semplicemente copiati.
zh_cn: 如果你有一个不带有 <file><var>foo</var>.diff.gz</file> 文件的 <tt>1.0</tt> 格式的源代码包，你可以通过创建 <file>debian/source/format</file> 文件并在其中添加 <tt>3.0 (native)</tt> 来将其更新为新的 <tt>3.0 (native)</tt> 源代码包格式。<file>debian</file> 目录中的其他文件可以直接复制过来。
zh_tw: 如果你有一個不帶有 <file><var>foo</var>.diff.gz</file> 檔案的 <tt>1.0</tt> 格式的原始碼包，你可以通過創建 <file>debian/source/format</file> 檔案並在其中添加 <tt>3.0 (native)</tt> 來將其更新爲新的 <tt>3.0 (native)</tt> 原始碼包格式。<file>debian</file> 目錄中的其他檔案可以直接複製過來。

source: If you have a <tt>1.0</tt> source package with the <file><var>foo</var>.diff.gz</file> file, you can update it to the newer <tt>3.0 (quilt)</tt> source format by creating <file>debian/source/format</file> with "<tt>3.0 (quilt)</tt>". The rest of <file>debian/*</file> files can be just copied. Import the <file>big.diff</file> file generated by the "<tt>filterdiff -z -x '*/debian/*' <var>foo</var>.diff.gz &gt; big.diff</tt>" command to your <prgn>quilt</prgn> system, if needed. <footnote><p>You may split <file>big.diff</file> into many small incremental patches using the <prgn>splitdiff</prgn> command.</p></footnote>
ca: Si treballes amb un paquet construït amb el format <tt>1.0</tt> amb el fitxer <file><var>nom_paquet</var>.diff.gz</file>, pots actualitzar-lo al nou format <tt>3.0 (native)</tt> afegint el fitxer <file>debian/source/format</file> amb la línia <tt>3.0 (native)</tt>. Copia els altres fitxers del directori <file>debian/*</file>. Importa el fitxer <file>nom_paquet.diff</file> generat amb l'ordre <tt>filterdiff -z -x '*/debian/*' <var>nom_paquet</var>.diff.gz &gt; nom_paquet.diff</tt> al sistema <prgn>quilt</prgn> <footnote><p>Pots fragmentar el fitxer <file>nom_paquet.diff</file> en diversos fitxers de pegats fent servir l'ordre <prgn>splitdiff</prgn>. </p></footnote>.
es: Si estás trabajando con un paquete construido con el formato <tt>1.0</tt> con el archivo <file><var>nombre_del_paquete</var>.diff.gz</file>, puedes actualizarlo a la nueva versión <tt>3.0 (native)</tt> añadiendo el archivo <file>debian/source/format</file> con la linea <tt>3.0 (native)</tt>. Copia los otros archivos del directorio <file>debian/*</file>. Importa el archivo <file>nombre_del_paquete.diff</file> generado por la orden <tt>filterdiff -z -x '*/debian/*' <var>nombre_del_paquete</var>.diff.gz &gt; nombre_del_paquete.diff</tt> al sistema <prgn>quilt</prgn> <footnote><p>Puedes fragmentar el archivo <file>nombre_del_paquete.diff</file> en varios archivos de parches utilizando la orden <prgn>splitdiff</prgn>. </p></footnote>.
fr: si vous avez un paquet source <tt>1.0</tt> avec fichier <file><var>toto</var>.diff.gz</file>, vous pouvez le mettre à jour au récent format source <tt>3.0 (quilt)</tt> en créant <file>debian/source/format</file> contenant « <tt>3.0 (quilt)</tt> ». Le reste des fichiers <file>debian/*</file> peut être simplement copié. Importez le fichier <file>gros.diff</file> généré par la commande « <tt>filterdiff -z -x '*/debian/*' <var>toto</var>.diff.gz &gt; gros.diff</tt> » dans votre système <prgn>quilt</prgn>, au besoin ; <footnote><p>vous pouvez découper <file>gros.diff</file> en plusieurs petits correctifs incrémentaux avec la commande <prgn>splitdiff</prgn>.</p></footnote>
zh_cn: 如果你有一个带有 <file><var>foo</var>.diff.gz</file> 文件的 <tt>1.0</tt> 格式的源代码包，你可以通过创建 <file>debian/source/format</file> 文件并在其中添加 <tt>3.0 (quilt)</tt> 来将其更新为新的 <tt>3.0 (quilt)</tt> 源代码包格式。<file>debian</file> 目录中的其他文件可以直接复制过来。如果需要，把 <tt>filterdiff -z -x '*/debian/*' <var>foo</var>.diff.gz &gt; big.diff</tt> 生成的 <file>big.diff</file> 文件导入到 <prgn>quilt</prgn> 系统。<footnote><p>你可能使用 <prgn>splitdiff</prgn> 命令将 <file>big.diff</file> 分割为多个有各自作用的补丁。</p></footnote>
zh_tw: 如果你有一個帶有 <file><var>foo</var>.diff.gz</file> 檔案的 <tt>1.0</tt> 格式的原始碼包，你可以通過創建 <file>debian/source/format</file> 檔案並在其中添加 <tt>3.0 (quilt)</tt> 來將其更新爲新的 <tt>3.0 (quilt)</tt> 原始碼包格式。<file>debian</file> 目錄中的其他檔案可以直接複製過來。如果需要，把 <tt>filterdiff -z -x '*/debian/*' <var>foo</var>.diff.gz &gt; big.diff</tt> 生成的 <file>big.diff</file> 檔案導入到 <prgn>quilt</prgn> 系統。<footnote><p>你可能使用 <prgn>splitdiff</prgn> 命令將 <file>big.diff</file> 分割爲多個有各自作用的補丁。</p></footnote>
