Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: <tt>install</tt> target: to install files into a file tree for each binary package under the <file>debian</file> directory. If defined, <tt>binary*</tt> targets effectively depend on this target. (optional)
ca: <tt>install</tt> (opcional): fa la instal·lació en l'estructura de directoris temporal en el directori <file>debian</file> dels fitxers que constitueixen els paquets binaris. Si hi ha un objectiu <tt>binary*</tt>, dependrà d'aquest.
es: <tt>install</tt> (opcional): para la instalación en la estructura de directorios temporal bajo el directorio <file>debian</file> de los archivos para cada uno de los paquetes binarios. Si existe el objetivo <tt>binary*</tt>, dependerá de este.
fr: <tt>install</tt> (optionnelle) : pour installer les fichiers dans l'arborescence de chaque paquet binaire dans le répertoire <file>debian</file>. Si elles existent, les cibles <tt>binary*</tt> dépendent en réalité de cette cible.
it: obiettivo <tt>install</tt>: installare i file in una struttura ad albero per ogni pacchetto binario nella directory <file>debian</file>. Se definito, tutti gli obiettivi <tt>binary*</tt> dipenderanno effettivamente da quest'ultimo. (opzionale)
ja: <tt>install</tt> ターゲット: <file>debian</file>ディレクトリ以下にある各バイナリパッケージのファイルツリーにファイルをインストールします。定義されている場合は、<tt>binary*</tt>ターゲットが効率的にこのターゲットに依存します。(任意)
zh_cn: <tt>install</tt>：把文件安装到 <file>debian</file> 目录内为各个二进制包构建的文件树。如果有定义，<tt>binary*</tt> target 则会依赖于此 target。(可选)
zh_tw: <tt>install</tt>：把檔案安裝到 <file>debian</file> 目錄內爲各個二進位套件構建的檔案樹。如果有定義，<tt>binary*</tt> target 則會依賴於此 target。(可選)

source: <tt>binary</tt> target: to create all binary packages (effectively combination of <tt>binary-arch</tt> and <tt>binary-indep</tt> targets). (required)<footnote><p>This target is used by "<tt>dpkg-buildpackage</tt>" as in <ref id="completebuild">.</p></footnote>
ca: <tt>binary</tt> (obligatori): per a la construcció de cada un dels paquets binaris (combinat amb els objectius <tt>binary-arch</tt> i <tt>binary-indep</tt>) <footnote><p>Aquest objectiu és utilitzat per <tt>dpkg-buildpackage</tt> com en <ref id="completebuild">. </p></footnote>.
es: <tt>binary</tt> (obligatorio): para la construcción de cada uno de los paquetes binarios (combinado con los objetivos <tt>binary-arch</tt> y <tt>binary-indep</tt>) <footnote><p>Este objetivo es utilizado por <tt>dpkg-buildpackage</tt> como en <ref id="completebuild">.</p></footnote>.
fr: <tt>binary</tt> (obligatoire) : pour créer tous les paquets binaires (en réalité, combinaison des cibles <tt>binary-arch</tt> et <tt>binary-indep</tt>) ; <footnote><p>Cette cible est utilisée par « <tt>dpkg-buildpackage</tt> » comme en <ref id="completebuild">.</p></footnote>
it: obiettivo <tt>binary</tt>: creare tutta una serie di pacchetti binari (combinando gli obiettivi <tt>binary-arch</tt> e <tt>binary-indep</tt>). (richiesto)<footnote><p>Questo obiettivo è utilizzato da "<tt>dpkg-buildpackage</tt>" come in <ref id="completebuild">.</p></footnote>
ja: <tt>binary</tt> ターゲット: 全てのバイナリパッケージを作ります。(<tt>binary-arch</tt>と<tt>binary-indep</tt>の組み合わせ)(必須)<footnote><p>このターゲットは例えば、<ref id="completebuild">などで、"<tt>dpkg-buildpackage</tt>"が使用します。</p></footnote>
zh_cn: <tt>binary</tt>：创建所有二进制包(是 <tt>binary-arch</tt> 和 <tt>binary-indep</tt> 的合并)。(必须)<footnote><p>此 target 被 <tt>dpkg-buildpackage</tt> 用于 <ref id="completebuild"> 描述的过程中。</p></footnote>
zh_tw: <tt>binary</tt>：創建所有二進位套件(是 <tt>binary-arch</tt> 和 <tt>binary-indep</tt> 的合併)。(必須)<footnote><p>此 target 被 <tt>dpkg-buildpackage</tt> 用於 <ref id="completebuild"> 描述的過程中。</p></footnote>

source: <tt>binary-arch</tt> target: to create arch-dependent (<tt>Architecture: any</tt>) binary packages in the parent directory. (required)<footnote><p>This target is used by "<tt>dpkg-buildpackage -B</tt>" as in <ref id="autobuilder">.</p></footnote>
ca: <tt>binary-arch</tt> (obligatori): per a la construcció de paquets dependents de l'arquitectura (els que tenen el camp <tt>Architecture: any</tt> en el fitxer «control») <footnote><p>Aquest objectiu és utilitzat per "<tt>dpkg-buildpackage -B</tt>" com en <ref id="autobuilder">. </p></footnote>.
es: <tt>binary-arch</tt> (obligatorio): para la construcción de paquetes dependientes de la arquitectura (<tt>Architecture: any</tt>) <footnote><p>Este objetivo es utilizado por "<tt>dpkg-buildpackage -B</tt>" como en <ref id="autobuilder">.</p></footnote>.
fr: <tt>binary-arch</tt> (obligatoire) : pour créer tous les paquets binaires dépendants de l'architecture (<tt>Architecture: any</tt>) dans le répertoire parent ;<footnote><p>Cette cible est utilisée par « <tt>dpkg-buildpackage -B</tt> » comme en <ref id="autobuilder">.</p></footnote>
it: obiettivo <tt>binary-arch</tt>: creare una serie di pacchetti binari dipendenti dall'architettura (<tt>Architecture: any</tt>) nella directory padre. (richiesto)<footnote><p>Questo obiettivo è utilizzato da "<tt>dpkg-buildpackage -B</tt>" come in "ref id="porterbuild"".</p></footnote>
ja: <tt>binary-arch</tt> ターゲット: 親ディレクトリにアーキテクチャに依存したバイナリパッケージ (<tt>Architecture: any</tt>)を作ります。(必須)<footnote><p>このターゲットは例えば、<ref id="autobuilder">などで、"<tt>dpkg-buildpackage -B</tt>"が使用します。</p></footnote>
zh_cn: <tt>binary-arch</tt>：在父目录中创建平台依赖(<tt>Architecture: any</tt>)的二进制包。(必须)<footnote><p>此 target 被 <tt>dpkg-buildpackage -B</tt>" 用于<ref id="autobuilder"> 描述的过程中。</p></footnote>
zh_tw: <tt>binary-arch</tt>：在父目錄中創建平臺依賴(<tt>Architecture: any</tt>)的二進位套件。(必須)<footnote><p>此 target 被 <tt>dpkg-buildpackage -B</tt>" 用於<ref id="autobuilder"> 描述的過程中。</p></footnote>

source: <tt>binary-indep</tt> target: to create arch-independent (<tt>Architecture: all</tt>) binary packages in the parent directory. (required)<footnote><p>This target is used by "<tt>dpkg-buildpackage -A</tt>".</p></footnote>
ca: <tt>binary-indep</tt> (obligatori): per a la construcció de paquets independents de l'arquitectura (<tt>Architecture: all</tt> en el fitxer «control») <footnote><p>Aquest objectiu és utilitzat per "<tt>dpkg-buildpackage -A</tt>". </p></footnote>.
es: <tt>binary-indep</tt> (obligatorio): para la construcción de paquetes independientes de la arquitectura (<tt>Architecture: all</tt>) <footnote><p>Este objetivo es utilizado por "<tt>dpkg-buildpackage -A</tt>".</p></footnote>.
fr: <tt>binary-indep</tt> (obligatoire) : pour créer tous les paquets binaires indépendants de l'architecture (<tt>Architecture: all</tt>) dans le répertoire parent ;<footnote><p>Cette cible est utilisée par « <tt>dpkg-buildpackage -A</tt> ».</p></footnote>
it: obiettivo <tt>binary-indep</tt>: creare una serie di pacchetti binari indipendenti dall'architettura (<tt>Architecture: all</tt>) nella directory padre. (richiesto)<footnote><p>Questo obiettivo è utilizzato da "<tt>dpkg-buildpackage -A</tt>".</p></footnote>
ja: <tt>binary-indep</tt> ターゲット: 親ディレクトリにアーキテクチャに依存しないパッケージ (<tt>Architecture: all</tt>) を作ります。(必須)<footnote><p>このターゲットは、 "<tt>dpkg-buildpackage -A</tt>"が使用します。</p></footnote>
zh_cn: <tt>binary-indep</tt>：在父目录中创建平台独立(<tt>Architecture: all</tt>)的二进制包。(必须)<footnote><p>此 target 被 <tt>dpkg-buildpackage -A</tt> 使用。</p></footnote>
zh_tw: <tt>binary-indep</tt>：在父目錄中創建平臺獨立(<tt>Architecture: all</tt>)的二進位套件。(必須)<footnote><p>此 target 被 <tt>dpkg-buildpackage -A</tt> 使用。</p></footnote>

source: <tt>get-orig-source</tt> target: to obtain the most recent version of the original source package from upstream archive site. (optional)
ca: <tt>get-orig-source</tt> (opcional): per determinar la versió més recent de les fonts originals des del magatzem de l'autor.
es: <tt>get-orig-source</tt> (opcional): para obtener la versión más reciente de las fuentes originales desde el lugar de almacenaje del autor.
fr: <tt>get-orig-source</tt> (optionnelle) : pour obtenir la dernière version du paquet source d'origine à partir du site de l'archive amont.
it: obiettivo <tt>get-orig-source</tt>: ottenere la versione più recente del pacchetto sorgente originale dal relativo sito. (optional)
ja: <tt>get-orig-source</tt> ターゲット: 上流アーカイブのサイトから最新のバージョンのソースパッケージを持ってきます。(任意)
zh_cn: <tt>get-orig-source</tt>：从上游站点获得最新的原始源代码包。(可选)
zh_tw: <tt>get-orig-source</tt>：從上游站點獲得最新的原始原始碼包。(可選)

source: Rules that you want to execute are invoked as command line arguments (for example, "<tt>./debian/rules build</tt>" or "<tt>fakeroot make -f debian/rules binary</tt>"). After the target name, you can name the dependency, program or file that the rule depends on. After that, there can be any number of commands, indented with <tt><var>TAB</var></tt>. A new rule begins with the target declaration in the first column. Empty lines and lines beginning with "<tt>#</tt>" (hash) are treated as comments and ignored.
ca: Les regles que vulguis executar haurien d'executar-se com a arguments en el terminal (per ex. «<tt>./debian/rules build</tt>» o «<tt>fakeroot make -f debian/rules binary</tt>»). ﻿Després del nom de l'objectiu, pots afegir les dependències, programa o fitxers dels quals depèn la regla. A continuació, hi haurà un nombre qualsevol d'instruccions (començant amb <tt><var>TAB</var></tt>), acabades amb una línia en blanc. I a continuació la pròxima regla. Las línies múltiples en blanc i les línies que ﻿comencen amb "<tt>#</tt>" es tracten com comentaris i s'ignoren.
es: Cada regla se compone de objetivos, ficheros o nombres de acciones que se deben llevar a cabo (por ejemplo, «build:» o «install:»). Las reglas que quieras ejecutar deberían llamarse como argumentos de la línea de órdenes (por ejemplo, "<tt>./debian/rules build</tt>" o "<tt>fakeroot make -f debian/rules binary</tt>"). Después del nombre del objetivo, puedes nombrar las dependencias, programas o ficheros de los que la regla dependa. Después de esto, hay un número cualquiera de instrucciones (¡indentado con <tt><var>TAB</var></tt>), hasta que se llega a una línea en blanco. Ahí empieza otra regla. Las líneas múltiples en blanco, y las líneas que empiezan por almohadillas ("<tt>#</tt>") se tratan como comentarios y se ignoran.
fr: Les règles à exécuter sont en paramètres de ligne de commande (par exemple, « <tt>./debian/rules build</tt> » ou « <tt>fakeroot make -f debian/rules binary</tt> »). Après le nom de la cible, vous pouvez nommer la dépendance, programme ou fichier dont la cible dépend. Ensuite, il peut y avoir un certain nombre de commandes, indentées par <tt><var>tab</var></tt>. Une nouvelle règle commence par la déclaration de cible dès la première colonne. Les lignes vides ainsi que celles qui commencent par un « <tt>#</tt> » (dièse) sont considérées comme des commentaires et sont ignorées.
it: Le regole che si vogliono applicare vengono applicate come parametri da linea di comando (per esempio, "<tt>./debian/rules build</tt>" o "<tt>fakeroot make -f debian/rules binary</tt>"). Dopo il nome dell'obiettivo si può scrivere il nome della dipendenza, programma o file da cui dipende la regola. Dopo aver fatto questo ci può essere un qualsiasi numero di comandi, separati da <tt><var>TAB</var></tt>. Una nuova regola comincia con la dichiarazione dell'obiettivo nella prima colonna. Le righe vuote e le righe che cominciano con "<tt>#</tt>" (cancelletto) vengono trattate come commenti e rimosse.
ja: 適用したいルールはコマンドライン引数として指定します。（例えば、"<tt>./debian/rules build</tt>"や"<tt>fakeroot make -f debian/rules binary</tt>"など)。ターゲット名の後には、依存するプログラムやファイル名などを指定できます。その次の行からはコマンド行になります。<tt><var>TAB</var></tt>でインデントし、コマンドを何行でも書くことができます。新しいルールを始めるには、行の先頭からターゲット名の宣言を書きます。空行や"<tt>#</tt>" (ハッシュ)で始まる行はコメントとして扱われ、無視されます。
zh_cn: 你希望执行的 target 规则可以通过命令行参数的方式触发(例如 <tt>./debian/rules build</tt> 或 <tt>fakeroot make -f debian/rules binary</tt>")。target 名称后你可以添加其依赖的 target 或文件。此后是以 <tt><var>TAB</var></tt> 开头的任意数量的名录，每行一个。一个新的 target 则在行首顶格开始。空行和以 <tt>#</tt> 开头的行将被视为注释而忽略。
zh_tw: 你希望執行的 target 規則可以通過命令行參數的方式觸發(例如 <tt>./debian/rules build</tt> 或 <tt>fakeroot make -f debian/rules binary</tt>")。target 名稱後你可以添加其依賴的 target 或檔案。此後是以 <tt><var>TAB</var></tt> 開頭的任意數量的名錄，每行一個。一個新的 target 則在行首頂格開始。空行和以 <tt>#</tt> 開頭的行將被視爲註釋而忽略。

source: You are probably confused now, but it will all be clear upon examination of the <file>rules</file> file that <prgn>dh_make</prgn> gives us as a default. You should also read "<tt>info make</tt>" for more information.
ca: Probablement l'exposició no és gens clara, però tot quedarà més clar després de veure el fitxer <file>rules</file> que <prgn>dh_make</prgn> construeix com a plantilla . Consulta l'entrada de "<tt>info make</tt>" en info.
es: Probablemente ya te hayas perdido, pero todo quedará más claro después de ver el fichero <file>rules</file> que <prgn>dh_make</prgn> pone por omisión. Deberías leer también la entrada de "<tt>info make</tt>" para más información.
fr: Tout ceci vous semble probablement confus pour l'instant, mais cela va devenir clair à l'examen du fichier <file>rules</file> que <prgn>dh_make</prgn> donne par défaut. Vous pouvez aussi lire « <tt>info make</tt> » pour plus d'informations.
it: È probabile che adesso ci sia un po' di confusione, ma sarà tutto più chiaro una volta esaminato il file <file>rules</file> che <prgn>dh_make</prgn> fornisce in modo predefinito. Inoltre si consiglia di leggere "<tt>info make</tt>" per maggiori informazioni.
ja: 今はまだよくわからないかもしれませんが、<prgn>dh_make</prgn>がデフォルトとして作成する<file>rules</file>ファイルを調べるうちに、きっと理解できるようになります。さらに詳細な説明は"<tt>info make</tt>"を参照してください。
zh_cn: 可能你现在感到有些迷惑，在接下来讲解 <prgn>dh_make</prgn> 给出的默认的 <file>rules</file> 文件时会进行详细的讲解。你还应该阅读 <tt>info make</tt> 来了解更多信息。
zh_tw: 可能你現在感到有些迷惑，在接下來講解 <prgn>dh_make</prgn> 給出的默認的 <file>rules</file> 檔案時會進行詳細的講解。你還應該閱讀 <tt>info make</tt> 來瞭解更多訊息。

source: Default <file>rules</file> file
ca: Fitxer <file>rules</file> predeterminat.
es: Archivo <file>rules</file> predeterminado
fr: Fichier <file>rules</file> par défaut
it: Il file <file>rules</file> predefinito
ja: デフォルトの<file>rules</file>ファイル
zh_cn: 默认的 <file>rules</file> 文件
zh_tw: 默認的 <file>rules</file> 檔案

source: Newer <prgn>dh_make</prgn> generates a very simple but powerful default <file>rules</file> file using the <prgn>dh</prgn> command:
ca: La nova versió de <prgn>dh_make</prgn> genera un arxiu <file>rules</file> molt simple però poderós que fa servir l'ordre <prgn>dh</prgn>:
es: La nueva versión de <prgn>dh_make</prgn> genera un archivo <file>rules</file> muy simple pero poderoso utilizando la orden <prgn>dh</prgn>:
fr: Les versions récentes de <prgn>dh_make</prgn> créent un fichier <file>rules</file> par défaut très simple mais aussi très puissant en utilisant la commande <prgn>dh</prgn> :
it: Le nuove versioni di <prgn>dh_make</prgn> generano un file <file>rules</file> molto semplice ma potente utilizzando il comando <prgn>dh</prgn>:
ja: 最新の<prgn>dh_make</prgn>は<prgn>dh</prgn> コマンドでシンプルかつパワフルな<file>rules</file>ファイルを作ってくれます。
zh_cn: 新版本的 <prgn>dh_make</prgn> 会生成一个使用 <prgn>dh</prgn> 命令的非常简单但非常强大的默认的 <file>rules</file> 文件：
zh_tw: 新版本的 <prgn>dh_make</prgn> 會生成一個使用 <prgn>dh</prgn> 命令的非常簡單但非常強大的默認的 <file>rules</file> 檔案：

source: (I've added the line numbers. In the actual <file>rules</file> file, the leading white spaces are TAB codes.)
ca: (S'han afegit els números de les línies. En el fitxer <file>debian/rules</file> els espais inicials de les línies són tabulacions).
es: (He añadido los números de línea. En el fichero <file>debian/rules</file> los espacios iniciales de las líneas son tabulaciones)
fr: (Les numéros de ligne ont été ajoutés. Dans le vrai fichier <file>rules</file>, le grand espace est une tabulation.)
it: (Sono stati aggiunti i numeri di riga. Nel vero file <file>rules</file>, gli spazi vengono sostituiti da TAB.)
ja: (行番号は筆者による。実際の<file>rules</file>ファイルは行頭が空白のTABコード)
zh_cn: (注：我添加了行号。实际的 <file>rules</file> 文件里开头的空格是 TAB 填充的。)
zh_tw: (注：我添加了行號。實際的 <file>rules</file> 檔案裏開頭的空格是 TAB 填充的。)

source: You are probably familiar with lines like line 1 from shell and Perl scripts. It tells the operating system that this file is to be processed with <file>/usr/bin/make</file>.
ca: Probablement estàs familiaritzat amb línies com la primera per a guions escrits en shell o Perl. Aquesta línia indica que el fitxer s'executa amb <file>/usr/bin/make</file>.
es: Probablemente estés familiarizado con líneas como la primera de guiones escritos en shell o Perl. Esta línea indica que el fichero debe ejecutarse con<file>/usr/bin/make</file>.
fr: Vous avez probablement l'habitude de la ligne 1 avec les scripts shell et Perl. Cela signifie que ce fichier doit être exécuté par <file>/usr/bin/make</file>.
it: Probabilmente si sarà già familiari con le righe tipo la prima che ricordano gli script shell e Perl. In pratica indica al sistema operativo che il file andrà elaborato con <file>/usr/bin/make</file>.
ja: 1行目はシェルやパールスクリプトでお馴染みの表現です。オペレーティングシステムに<file>/usr/bin/make</file>で処理するように指示しています。
zh_cn: 可能在 shell 或 Perl 脚本中你已经对第一行的形式很熟悉了，它告诉操作系统这个文件应使用 <file>/usr/bin/make</file> 处理。
zh_tw: 可能在 shell 或 Perl 腳本中你已經對第一行的形式很熟悉了，它告訴作業系統這個檔案應使用 <file>/usr/bin/make</file> 處理。

source: Line 10 can be uncommented to set <tt>DH_VERBOSE</tt> variable to 1. Then, the <prgn>dh</prgn> command will output which <prgn>dh_*</prgn> commands are executed by the <prgn>dh</prgn> command. You can also add "<tt>export DH_OPTIONS=-v</tt>" line here. Then each <prgn>dh_*</prgn> command will output which commands are executed by each <prgn>dh_*</prgn> command. This helps you to understand what exactly is going on behind this simple <file>rules</file> file and to debug its problems. This new <prgn>dh</prgn> is a core part of the <package>debhelper</package> tools and does not hide anything from you.
ca: Cal eliminar la marca de comentari a la línia 10 per assignar el valor 1 a la variable <tt>DH_VERBOSE</tt>. En aquest cas, l'ordre <prgn>dh</prgn> escriurà les ordres <prgn>dh_*</prgn> en el terminal així com siguin executades per <prgn>dh</prgn>. Pots ﻿afegir la línia "<tt>export DH_OPTIONS=-v</tt>" aquí. Aixó farà que cada ordre <prgn>dh_*</prgn> escrigui la sortida de cada ordre <prgn>dh_*</prgn> i solucionar els problemes que es produeixin. Això t'ajudarà a entendre com funciona el fitxer <file>rules</file> i a solucionar errades. La nova ordre <prgn>dh</prgn> és part fonamental de les eines <package>debhelper</package> i no t'amaguen res.
es: La linea 10 debe descomentarse para asignar el valor 1 a la variable <tt>DH_VERBOSE</tt>. Entonces, la orden <prgn>dh</prgn> mostrará (en el terminal) las órdenes <prgn>dh_*</prgn> ejecutadas por <prgn>dh</prgn>. Puedes añadir la linea "<tt>export DH_OPTIONS=-v</tt>" aquí. Así podrás ver la salida de la ejecución de cada orden <prgn>dh_*</prgn> y solucionar los problemas que se produzcan. Esto te ayudará a entender como funciona el archivo <file>rules</file> y a solucionar problemas. Esta nueva orden <prgn>dh</prgn> es parte fundamental de la herramientas <package>debhelper</package> y no te esconde nada.
fr: La ligne 11 peut être décommentée pour configurer la variable <tt>DH_VERBOSE</tt> à 1. Dans ce cas, la commande <prgn>dh</prgn> indiquera quelles commandes <prgn>dh_*</prgn> elle exécute. Vous pouvez également ajouter ici une ligne« <tt>export DH_OPTIONS=-v</tt> ». Dans ce cas, chaque commande <prgn>dh_*</prgn> indiquera quelles commandes elle exécute. Ceci permet de comprendre ce qui se passe exactement derrière ce simple fichier <file>rules</file>, et de déboguer ses problèmes. Ce nouveau <prgn>dh</prgn> est un élément essentiel des outils <package>debhelper</package> et ne vous cache rien.
it: La riga 10 può essere decommentata per impostare la variabile <tt>DH_VERBOSE</tt> ad 1. In tal caso, lo strumento <package>debhelper</package> fornirà più informazioni come risultato. Questo aiuta a capire cosa stia succedendo dietro questo semplice file <file>rules</file> ed ad analizzarne i problemi. Questo nuovo comando <prgn>dh</prgn> è una parte cruciale dello strumento <package>debhelper</package> e non nasconde nulla all'utente.
ja: <tt>DH_VERBOSE</tt>変数を1に設定するためには、10行目のコメントを外します。そうすることによって、<prgn>dh</prgn>コマンドが、<prgn>dh</prgn>コマンドによって実行された<prgn>dh_*</prgn>コマンドを出力します。必要であればここに、"<tt>export DH_OPTIONS=-v</tt>"という行を追加できます。そうすることによって、<prgn>dh_*</prgn>コマンドが、<prgn>dh_*</prgn>によって実行されたコマンドを出力します。この単純な<file>rules</file>ファイルが何をしているのかを理解する手助けとなり、デバッグの際のヒントになるでしょう。この新しい<prgn>dh</prgn>が<package>debhelper</package>ツールの中核となる部分です。
zh_cn: 第 10 行可以去掉注释并将 <tt>DH_VERBOSE</tt> 变量设置为 1。此后，<prgn>dh</prgn> 命令会输出哪些 <prgn>dh_*</prgn> 命令被执行了。你还可以在这里添加一行 <tt>export DH_OPTIONS=-v</tt>。此后每个 <prgn>dh_*</prgn> 命令会输出它所执行的具体命令。这可以帮助你了解这个简单的 <file>rules</file> 文件所执行的内容并帮助调试问题。这个新的 <prgn>dh</prgn> 是 <package>debhelper</package> 工具的关键部分，其所有操作都可以让你看到。
zh_tw: 第 10 行可以去掉註釋並將 <tt>DH_VERBOSE</tt> 變量設置爲 1。此後，<prgn>dh</prgn> 命令會輸出哪些 <prgn>dh_*</prgn> 命令被執行了。你還可以在這裏添加一行 <tt>export DH_OPTIONS=-v</tt>。此後每個 <prgn>dh_*</prgn> 命令會輸出它所執行的具體命令。這可以幫助你瞭解這個簡單的 <file>rules</file> 檔案所執行的內容並幫助調試問題。這個新的 <prgn>dh</prgn> 是 <package>debhelper</package> 工具的關鍵部分，其所有操作都可以讓你看到。
