Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: Repeat what you did in <ref id="completebuild">, <ref id="checkit">, and <ref id="upload">. The difference is that this time, the original source archive won't be included, as it hasn't been changed and it already exists in the Debian archive.
ca: Finalment, reconstrueix el paquet amb les modificacions seguint l'explicació de <ref id="completebuild">, <ref id="checkit">, i <ref id="upload">. La diferència amb el procediment anterior és que el fitxer de les fonts originals no s'inclourà (degut a que no les ha modificat l'autor original) en carregar el paquet al repositori.
es: Ahora debes reconstruir el paquete con las modificaciones según se ha descrito en <ref id="completebuild">, <ref id="checkit">, y <ref id="upload">. La diferencia con el procedimiento anterior es que el archivo de las fuentes originales no se incluirá (puesto que no se ha sido modificadas por el autor) en el envío al repositorio.
fr: recommencer ce que vous aviez fait dans <ref id="completebuild">, <ref id="checkit">, et <ref id="upload">. La différence est que cette fois, l'archive des sources originales ne sera pas incluse, car elle n'a pas été changée et est déjà dans l'archive Debian.
it: Si ripetano i passi fatti in <ref id="completebuild">, <ref id="checkit">, e <ref id="upload">. La differenza è che questa volta, l'archivio sorgente originale non sarà incluso, dal momento che non è stato modificato ed esiste già nell'archivio Debian.
ja: これまで <ref id="completebuild">、<ref id="checkit">、 <ref id="upload"> の中で実行してきたことを再度繰り返します。 今までと違うのは、今回の場合オリジナルソースアーカイブには 変更が無く、同じものが既に Debian アーカイブ中に存在しているため、 upload するファイルにはこのファイルが含まれないという点だけです。
zh_cn: 重复在 <ref id="completebuild">、<ref id="checkit"> 和 <ref id="upload"> 中进行的操作。惟一的区别是这次不需要再包含原始代码文件，因为它们没有变化且已经存在于 Debian 仓库中。
zh_tw: 重覆在 <ref id="completebuild">、<ref id="checkit"> 和 <ref id="upload"> 中進行的操作。惟一的區別是這次不需要再包含原始程式碼檔案，因爲它們沒有變化且已經存在於 Debian 倉庫中。

source: Inspection of the new upstream release
ca: Inspecció d'una nova versió de l'autor.
es: Inspección de una nueva versión del autor
fr: Examen d'une nouvelle version amont
it: Controllo della nuova distribuzione
zh_cn: 检查新上游版本
zh_tw: 檢查新上游版本

source: When preparing packages of the new upstream release for the Debian archive, you must check the new upstream release, first.
ca: Quan l'autor original allibera una nova versió de les fonts, cal que comencis per revisar la nova versió original.
es: Para la actualización de un paquete cuando el autor original libera una nueva versión de las fuentes, debes empezar por revisar la nueva versión original.
fr: Lors de la préparation de paquets d'une nouvelle version amont pour l'archive Debian, vous devez commencer par vérifier la nouvelle version amont.
it: Quando si stanno preparando i pacchetti della nuova distribuzione per l'archivio Debian, bisogna innanzitutto effettuare dei controlli.
ja: Debian アーカイブ用の新しい上流リリースパッケージの準備ができたら、まず、上流リリースをチェックしなければなりません。
zh_cn: 在为 Debian 仓库准备新上游版本的软件包前，你必须首先检查它。
zh_tw: 在爲 Debian 倉庫準備新上游版本的套件前，你必須首先檢查它。

source: You start this by reading the upstream <file>changelog</file>, <file>NEWS</file>, and whatever other documentations they may have released with the new version.
ca: Comença per llegir els fitxers <file>changelog</file>, <file>NEWS</file> i qualsevol altre documentació on l'autor original expliqui els canvis realitzats en la nova versió.
es: Empieza por leer los archivos <file>changelog</file>, <file>NEWS</file> y cualquier otra documentación donde el autor original describa los cambios de la nueva versión.
fr: Commencez par lire les <file>changelog</file> et <file>NEWS</file> amonts, ainsi que toute autre documentation distribuée avec la nouvelle version.
it: Si comincia leggendo i file originali <file>changelog</file>, <file>NEWS</file>, e qualsiasi altra documentazione che possa essere stata rilasciata con la nuova versione.
ja: 上流の <file>changelog</file> や <file>NEWS</file>、その他新しいバージョンでリリースされたドキュメントを読むことから始めてください
zh_cn: 检查工作应从阅读 <file>changelog</file>、<file>NEWS</file> 以及所有随新版本一同发布的文档。
zh_tw: 檢查工作應從閱讀 <file>changelog</file>、<file>NEWS</file> 以及所有隨新版本一同發佈的文件。

source: You then inspect changes between the old and new upstream sources as follow to watch out for anything suspicious.
ca: Pots comprovar els canvis entre les fonts originals de la nova versió i de l'anterior per detectar qualsevol canvi sospitós de produir errors executant:
es: Puedes comprobar los cambios entre las fuentes originales de la nueva versión y de la anterior para detectar cualquier cambio sospechoso de producir errores ejecutando:
fr: Examinez ensuite les modifications entre les anciennes et nouvelles sources amont, pour guetter tout changement suspect :
it: Successivamente si controllano i cambiamenti tra i sorgenti originali e quelli nuovi, come mostrato in seguito, alla ricerca di qualsiasi modifica sospetta.
zh_cn: 然后应按照以下步骤检查新旧版本之间的差别，看是否存在可疑的内容：
zh_tw: 然後應按照以下步驟檢查新舊版本之間的差別，看是否存在可疑的內容：

source: $ diff -urN <var>foo</var>-<var>oldversion</var> <var>foo</var>-<var>newversion</var>
ca: $ diff -urN <var>nom_arxiu</var>-<var>versió_anterior</var> <var>nom_arxiu</var>-<var>nova_versió</var>
es: $ diff -urN <var>nombre_archivo</var>-<var>versión_anterior</var> <var>nombre_archivo</var>-<var>nueva_versión</var>
fr: $ diff -urN <var>toto</var>-<var>ancienneversion</var> <var>toto</var>-<var>nouvelleversion</var>

source: Changes to some auto-generated files by Autotools such as <file>missing</file>, <file>aclocal.m4</file>, <file>config.guess</file>, <file>config.h.in</file>, <file>config.sub</file>, <file>configure</file>, <file>depcomp</file>, <file>install-sh</file>, <file>ltmain.sh</file>, and <file>Makefile.in</file> may be ignored. You may erase them before running <prgn>diff</prgn> to the source for inspection.
ca: Les modificacions realitzades en els fitxers generats per «Autotools» (<file>missing</file>, <file>aclocal.m4</file>, <file>config.guess</file>, <file>config.h.in</file>, <file>config.sub</file>, <file>configure</file>, <file>depcomp</file>, <file>install-sh</file>, <file>ltmain.sh</file> i <file>Makefile.in</file>) pots ignorar-les. Fins i tot pots eliminar-los abans d'executar <prgn>diff</prgn> en les fonts per inspeccionar-les.
es: Las modificaciones realizadas en los archivos generados por «Autotools» (<file>missing</file>, <file>aclocal.m4</file>, <file>config.guess</file>, <file>config.h.in</file>, <file>config.sub</file>, <file>configure</file>, <file>depcomp</file>, <file>install-sh</file>, <file>ltmain.sh</file> y <file>Makefile.in</file>) puedes ignorarlas. Puedes eliminarlos antes de ejecutar <prgn>diff</prgn> en las fuentes para inspeccionarlas.
fr: Les modifications de certains fichiers automatiquement créés par Autotools comme <file>missing</file>, <file>aclocal.m4</file>, <file>config.guess</file>, <file>config.h.in</file>, <file>config.sub</file>, <file>configure</file>, <file>depcomp</file>, <file>install-sh</file>, <file>ltmain.sh</file> et <file>Makefile.in</file> peuvent être ignorées. Vous pouvez les effacer avant d'exécuter <prgn>diff</prgn> pour examiner les sources.
zh_cn: 对于 Autotools 自动生成的文件，例如 <file>missing</file>、<file>aclocal.m4</file>、<file>config.guess</file>、<file>config.h.in</file>、<file>config.sub</file>、<file>configure</file>、<file>depcomp</file>、<file>install-sh</file>、<file>ltmain.sh</file> 和 <file>Makefile.in</file> 是可以忽略的。你可以在运行 <prgn>diff</prgn> 进行代码检查前删除它们。
zh_tw: 對於 Autotools 自動生成的檔案，例如 <file>missing</file>、<file>aclocal.m4</file>、<file>config.guess</file>、<file>config.h.in</file>、<file>config.sub</file>、<file>configure</file>、<file>depcomp</file>、<file>install-sh</file>、<file>ltmain.sh</file> 和 <file>Makefile.in</file> 是可以忽略的。你可以在運行 <prgn>diff</prgn> 進行程式碼檢查前刪除它們。

source: New upstream release
ca: Nova versió del programa font.
es: Nueva versión del programa fuente
fr: Nouvelle version amont
it: Nuova distribuzione
ja: 上流ソフトウェアの新版更新
zh_cn: 新上游版本
zh_tw: 新上游版本

source: If a package <package><var>foo</var></package> is properly packaged in the newer <tt>3.0 (native)</tt> or <tt>3.0 (quilt)</tt> formats, packaging a new upstream version is essentially moving the old <file>debian</file> directory to the new source. This can be done by running "<tt>tar xvzf /<var>path</var>/<var>to</var>/<var>foo</var>_<var>oldversion</var>.debian.tar.gz</tt>" in the new extracted source. <footnote><p>If a package <package><var>foo</var></package> is packaged in the old <tt>1.0</tt> format, this can be done by running "<tt>zcat /<var>path</var>/<var>to</var>/<var>foo</var>_<var>oldversion</var>.diff.gz|patch -p1</tt>" in the new extracted source, instead. </p></footnote> Of course, you need to do few obvious chores.
ca: Si el paquet <package><var>nom_paquet</var></package> que examines està correctament empaquetat fent servir els nous formats <tt>3.0 (native)</tt> o <tt>3.0 (quilt)</tt>, per empaquetar una nova versió de l'autor hauria d'ésser suficient copiar el directori <file>debian</file> de la versió anterior a la nova, i a continuació realitzar les adaptacions necessàries. Pots copiar el directori <file>debian</file> de la versió anterior a la nova versió executant "<tt>tar xvzf /<var>ruta</var>/<var>a</var>/<var>nom_paquet</var>_<var>versió_anterior</var>.debian.tar.gz</tt>" des del directori de les fonts de la nova versió <footnote><p>Si la versió anterior del paquet està empaquetada amb l'antic format <tt>1.0</tt>, pots fer el mateix executant "<tt>zcat /<var>ruta</var>/<var>a</var>/<var>nom_paquet</var>_<var>versió_anterior</var>.diff.gz|patch -p1</tt>" des del directori de les fonts de la nova versió. </p></footnote>. A continuació hauràs de realitzar alguns canvis obvis:
es: Si el paquete <package><var>nombre_del_paquete</var></package> que examinas está correctamente empaquetado utilizando los nuevos formatos <tt>3.0 (native)</tt> o <tt>3.0 (quilt)</tt> para empaquetar una nueva versión del autor debería ser suficiente copiar el directorio <file>debian</file> de la versión anterior a la nueva, para a continuación, realizar las adaptaciones necesarias. Puedes copiar el directorio <file>debian</file> de la versión anterior a la nueva versión ejecutando "<tt>tar xvzf /<var>ruta</var>/<var>a</var>/<var>nombre_del_paquete</var>_<var>versión_anterior</var>.debian.tar.gz</tt>" desde el directorio de las fuentes de la nueva versión <footnote><p>Si la versión anterior del paquete <package><var>nombre_del_paquete</var></package> está empaquetado en el antiguo formato <tt>1.0</tt>, puedes hacer lo mismo ejecutando "<tt>zcat /<var>ruta</var>/<var>a</var>/<var>nombre_del_paquete</var>_<var>versión_anterior</var>.diff.gz|patch -p1</tt>" desde el directorio de las fuentes de la nueva versión. </p></footnote>. A continuación deberás realizar algunos tareas obvias.
fr: Si un paquet <package><var>toto</var></package> est correctement empaqueté au nouveau format <tt>3.0 (native)</tt> ou <tt>3.0 (quilt)</tt>, empaqueter une nouvelle version amont consiste essentiellement à déplacer l'ancien répertoire <file>debian</file> dans les nouvelles sources. Ce peut être réalisé en exécutant « <tt>tar xvzf /<var>chemin</var>/<var>vers</var>/<var>toto</var>_<var>ancienneversion</var>.debian.tar.gz</tt> » depuis la nouvelle arborescence source décompressée. <footnote><p>Si un paquet <package><var>toto</var></package> est empaqueté avec l'ancien format <tt>1.0</tt>, ce peut plutôt être réalisé en exécutant « <tt>zcat /<var>chemin</var>/<var>vers</var>/<var>toto</var>_<var>ancienneversion</var>.diff.gz|patch -p1</tt> » depuis la nouvelle arborescence source décompressée.</p></footnote> Bien sûr, vous devez vous occuper de quelques routines évidentes :
zh_cn: 如果软件包 <package><var>foo</var></package> 是使用新的 <tt>3.0 (native)</tt> 或 <tt>3.0 (quilt)</tt> 格式打包的，制作新的上游版本时需要先把旧的 <file>debian</file> 目录移至新的源代码内。这可以通过在新解压的源代码目录里运行 <tt>tar xvzf /<var>path</var>/<var>to</var>/<var>foo</var>_<var>oldversion</var>.debian.tar.gz</tt> 完成。<footnote><p>如果软件包 <package><var>foo</var></package> 是使用旧的 <tt>1.0</tt> 格式的，可以在新解压的源代码目录里运行 <tt>zcat /<var>path</var>/<var>to</var>/<var>foo</var>_<var>oldversion</var>.diff.gz|patch -p1</tt> 来完成。</p></footnote>当然，你需要做几个很显然的杂事。
zh_tw: 如果套件 <package><var>foo</var></package> 是使用新的 <tt>3.0 (native)</tt> 或 <tt>3.0 (quilt)</tt> 格式打包的，製作新的上游版本時需要先把舊的 <file>debian</file> 目錄移至新的原始碼內。這可以通過在新解壓的原始碼目錄裏運行 <tt>tar xvzf /<var>path</var>/<var>to</var>/<var>foo</var>_<var>oldversion</var>.debian.tar.gz</tt> 完成。<footnote><p>如果套件 <package><var>foo</var></package> 是使用舊的 <tt>1.0</tt> 格式的，可以在新解壓的原始碼目錄裏運行 <tt>zcat /<var>path</var>/<var>to</var>/<var>foo</var>_<var>oldversion</var>.diff.gz|patch -p1</tt> 來完成。</p></footnote>當然，你需要做幾個很顯然的雜事。

source: Create a copy of upstream source as the <file>foo_<var>newversion</var>.tar.gz</file> file.
ca: Comprimir les fonts originals en el fitxer <file>nom_paquet_<var>número_nova_versió</var>.tar.gz</file>.
es: Comprimir las fuentes originales en el archivo <file>nombre_del_paquete_<var>nueva_versión</var>.tar.gz</file>.
fr: création d'une copie des sources amont dans un fichier <file>toto_<var>nouvelleversion</var>.tar.gz</file> ;
it: Creare una copia della sorgente originale nel file <file>foo_<var>newversion</var>.tar.gz</file>.
zh_cn: 创建一份上游源代码的副本，命名为 <file>foo_<var>newversion</var>.tar.gz</file>
zh_tw: 創建一份上游原始碼的副本，命名爲 <file>foo_<var>newversion</var>.tar.gz</file>

source: Update the Debian <file>changelog</file> file with "<tt>dch -v <var>newversion</var>-<var>1</var></tt>".
ca: Actualitzar el fitxer <file>changelog</file> del directori «debian» executant "<tt>dch -v <var>número_nova_versió</var>-<var>1</var></tt>".
es: Actualizar el archivo <file>changelog</file> Debian ejecutando "<tt>dch -v <var>nueva_versión</var>-<var>1</var></tt> ".
fr: mise à jour du ficher <file>changelog</file> Debian avec « <tt>dch -v <var>nouvelleversion</var>-<var>1</var></tt> » :
it: Aggiornare il file di <file>changelog</file> Debian con "<tt>dch -v <var>newversion</var>-<var>1</var></tt>".
zh_cn: 使用 <tt>dch -v <var>newversion</var>-<var>1</var></tt> 更新 Debian <file>changelog</file> 文件。
zh_tw: 使用 <tt>dch -v <var>newversion</var>-<var>1</var></tt> 更新 Debian <file>changelog</file> 檔案。

source: Add an entry with "New upstream release".
ca: Afegeix una nova línia amb el text «New upstream release» per indicar que es tracta d'una nova versió de les fonts originals.
es: Añade una nueva linea con el texto «New upstream release» para indicar que se trata de una nueva versión de las fuentes originales.
fr: ajout d'une entrée avec « New upstream release. » (nouvelle version amont) ;
it: Aggiungere una voce che dica "New upstream release".
zh_cn: 添加一个条目，内容为 New upstream release。
zh_tw: 添加一個條目，內容爲 New upstream release。

source: Describe concisely the changes <em>in the new upstream release</em> that fix reported bugs and close those bugs.
ca: Descriu abreujadament els canvis realitzats <em>en les fonts originals per l'autor</em> que solucionen errors informats i tanca els informes d'aquests errors
es: Describe sucintamente los cambios realizados <em>en las fuentes originales por el autor</em> que solucionan errores informados y cerrar los informes .
fr: description succincte des modifications <em>dans la nouvelle version amont</em> qui règlent des bogues et ferment les rapports associés ;
it: Descrivere brevemente i cambiamenti <em>nella nuova distribuzione</em> che correggono i bug riportati e ne chiudono altri.
zh_cn: 简明地介绍 <em>在新上游版本中</em> 上游修复和关闭的 Bug。
zh_tw: 簡明地介紹 <em>在新上游版本中</em> 上游修復和關閉的 Bug。

source: Describe concisely the changes <em>to the new upstream release</em> by the maintainer that fix reported bugs and close those bugs.
ca: Descriu abreujadament els canvis realitzats <em>a les fonts originals</em> pel desenvolupador (tu mateix en aquest cas) per solucionar els errors informats i tanca els informes.
es: Describe sucintamente los cambios de la <em>nueva versión</em> del desarrollador que solucionan errores previamente reportados y cierra dichos errores.
fr: description succincte des modifications <em>à la nouvelle version amont</em> par le responsable qui règlent des bogues et ferment les rapports associés ;
it: Descrivere brevemente i cambiamenti <em>nella nuova distribuzione</em>, effettuati dal manutentore, che correggono i bug riportati e li chiudono.
zh_cn: 简明地介绍维护者 <em>对此新上游版本</em> 做出的修改，修复和关闭的 Bug。
zh_tw: 簡明地介紹維護者 <em>對此新上游版本</em> 做出的修改，修復和關閉的 Bug。

source: "<tt>while quilt push; do quilt refresh; done</tt>" to apply all patches while removing <em>fuzz</em>.
ca: Executa "<tt>while quilt push; do quilt refresh; done</tt>" per aplicar els pegats eliminat <em>les coses innecessàries</em>.
es: Ejecuta <tt>while quilt push; do quilt refresh; done</tt> para aplicar los parches eliminando todo lo innecesario..
fr: application de tous les correctifs en enlevant les approximations (« <em>fuzz</em> ») : « <tt>while quilt push; do quilt refresh; done</tt> ».
it: "<tt>while quilt push; do quilt refresh; done</tt>" per applicare tutte le patch mentre si sta rimouvendo il "<em>fuzz</em>".
zh_cn: 运行 <tt>while quilt push; do quilt refresh; done</tt> 以应用全部补丁并使它们 <em>边界清晰</em>。
zh_tw: 運行 <tt>while quilt push; do quilt refresh; done</tt> 以應用全部補丁並使它們 <em>邊界清晰</em>。

source: If the patch/merge did not apply cleanly, inspect the situation (clues are left in <file>.rej</file> files).
ca: Si les modificacions no s'executen correctament, inspecciona la situació (mira la informació dels fitxers <file>.rej</file>) com segueix:
es: Si las modificaciones no se ejecutan correctamente, inspecciona la situación (mira la información de los archivos <file>.rej</file>) como se muestra a continuación.
fr: Si la fusion des correctifs ne s'applique pas proprement, examinez la situation (des indices sont laissés dans les fichiers <file>.rej</file>) :
it: Se la patch/merge non è stata applicata in maniera corretta, si controlli la situazione (gli indizi vengono lasciati nei file <file>.rej</file>).
zh_cn: 如果补丁没有干净地被应用，检查原因(线索在 <file>.rej</file> 文件里)。
zh_tw: 如果補丁沒有乾淨地被應用，檢查原因(綫索在 <file>.rej</file> 檔案裏)。

source: If a patch you applied to the source was integrated to the upstream source,
ca: Si un dels pegats aplicats està integrat en les fonts originals:
es: Si uno de los parches aplicados está integrado en las fuentes originales,
fr: si un correctif appliqué aux sources a été intégré aux sources amont :
it: Se una patch applicata alla sorgente è stata integrata nei sorgenti originali,
zh_cn: 如果你的补丁已经被上游接受：
zh_tw: 如果你的補丁已經被上游接受：

source: "<tt>quilt delete</tt>" to remove it.
ca: executa <tt>quilt delete</tt> per eliminar-lo.
es: ejecuta <tt>quilt delete</tt> para eliminarlo.
fr: « <tt>quilt delete</tt> » pour l'enlever ;
it: si rimuova con "<tt>quilt delete</tt>".
zh_cn: 使用 <tt>quilt delete</tt> 删除它。
zh_tw: 使用 <tt>quilt delete</tt> 刪除它。

source: If a patch you applied to the source conflicted with new changes in the upstream source,
ca: Si un dels pegats entra en conflicte amb els canvis realitzats per l'autor en les fonts originals:
es: Si uno de los parches entra en conflicto con los cambios realizados por el autor en las fuentes originales,
fr: si un correctif appliqué aux sources entre en confit avec les nouvelles modifications des sources amont :
it: Se una patch applicata alla sorgente è andata in conflitto con i nuovi cambiamenti nei sorgenti originali,
zh_cn: 如果你的补丁与上游代码中的变更有冲突：
zh_tw: 如果你的補丁與上游程式碼中的變更有衝突：

source: "<tt>quilt push -f</tt>" to apply old patches while forcing rejects as <file><var>baz</var>.rej</file>.
ca: executa <tt>quilt push -f</tt> per aplicar els pegats de la versió anterior per forçar els rebuigs (tendràs la informació dels rebuigs en els fitxers <file><var>truc</var>.rej</file>).
es: ejecuta <tt>quilt push -f</tt> para aplicar los parches de la versión anterior para forzar los rechazos (tendrás la información de los rechazos en los archivos <file><var>rechazo</var>.rej</file>).
fr: « quilt push -f » pour appliquer les anciens correctifs tout en forçant les rejets comme <file><var>truc</var>.rej</file> ;
it: si esegua "<tt>quilt push -f</tt>" per applicare le vecchie patch forzando gli scarti nel file <file><var>baz</var>.rej</file>.
zh_cn: 使用 <tt>quilt push -f</tt> 应用旧补丁，未应用的部分会被保存为 <file><var>baz</var>.rej</file>。
zh_tw: 使用 <tt>quilt push -f</tt> 應用舊補丁，未應用的部分會被保存爲 <file><var>baz</var>.rej</file>。

source: Edit the <file><var>baz</var></file> file manually to realize intended effect of <file><var>baz</var>.rej</file>.
ca: Edita els fitxers <file><var>truc</var>.rej</file> manualment per saber l'efecte que es pretén amb <file><var>truc</var>.rej</file>.
es: Edita los archivos <file><var>rechazo</var>.rej</file> manualmente para saber el efecto que se pretende con <file><var>rechazo</var>.rej</file>.
fr: édition manuelle du fichier <file><var>truc</var></file> pour obtenir le résultat attendu de <file><var>truc</var>.rej</file> ;
it: Modificare manualmente il file <file><var>baz</var></file> per applicare gli effetti desiderati presenti nel file <file><var>baz</var>.rej</file>.
zh_cn: 手工编辑 <file><var>baz</var></file> 来在新的代码中实现 <file><var>baz</var>.rej</file> 中应有的效果。
zh_tw: 手工編輯 <file><var>baz</var></file> 來在新的程式碼中實現 <file><var>baz</var>.rej</file> 中應有的效果。

source: "<tt>quilt refresh</tt>" to update the patch.
ca: Executa <tt>quilt refresh</tt> per actualitzar el pegat.
es: Ejecuta <tt>quilt refresh</tt> para actualizar el parche.
fr: « <tt>quilt refresh</tt> » pour mettre à jour le correctif ;
it: "<tt>quilt refresh</tt>" per aggiornare la patch.
zh_cn: 使用 <tt>quilt refresh</tt> 更新补丁。
zh_tw: 使用 <tt>quilt refresh</tt> 更新補丁。

source: Continue back to "<tt>while quilt push; do quilt refresh; done</tt>".
ca: Continua fins a l'execució de "<tt>while quilt push; do quilt refresh; done</tt>".
es: Continua hasta la ejecución de <tt>while quilt push; do quilt refresh; done</tt>.
fr: continuer jusqu'à « <tt>while quilt push; do quilt refresh; done</tt> ».
it: Ritornare alla procedura "<tt>while quilt push; do quilt refresh; done</tt>".
zh_cn: 再次运行 <tt>while quilt push; do quilt refresh; done</tt>。
zh_tw: 再次運行 <tt>while quilt push; do quilt refresh; done</tt>。

source: This process can be automated using the <manref section="1" name="uupdate"> command as follows:
ca: Pots automatitzar aquest procés fent servir l'ordre <manref section="1" name="uupdate"> como segueix:
es: Puedes automatizar este proceso utilizando la orden <manref section="1" name="uupdate"> como sigue:
fr: Cette méthode peut être automatisé avec <manref section="1" name="uupdate"> :
it: Questo processo può essere automatizzato utilizzando il comando <manref section="1" name="uupdate"> come segue:
zh_cn: 这个过程可以通过使用 <manref section="1" name="uupdate"> 来更自动化地完成：
zh_tw: 這個過程可以通過使用 <manref section="1" name="uupdate"> 來更自動化地完成：
