Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: The second step of Autotools work flow is usually that the user obtains this distributed source and runs "<tt>./configure &amp;&amp; make</tt>" in the source to compile program into a <prgn><var>binary</var></prgn>.
ca: La segona etapa és l'execució de <tt>./configure &amp;&amp; make</tt> en el directori del codi font per compilar el programa generant el fitxer <prgn><var>binari</var></prgn>.
es: El segundo paso en el uso de «Autotools« es la ejecución de «<tt>./configure &amp;&amp; make</tt>» en el directorio del código fuente para compilar el programa generando un archivo <prgn><var>binary</var></prgn>.
fr: La deuxième étape du travail des Autotools est habituellement que les utilisateurs se procurent ces sources et exécutent « <tt>./configure &amp;&amp; make</tt> » dans les sources pour compiler le programme en un <prgn><var>binaire</var></prgn>.
ja: Autotools のワークフローの次のステップでは、通常はこの配布されているソースをユーザが入手して、ソースディレクトリで "<tt>./configure &amp;&amp; make</tt>" を実行することで、プログラムを <prgn><var>binary</var></prgn> にコンパイルします。
zh_cn: 使用 Autotools 的流程第二部是用户获得分发的源代码后在源代码中运行 <tt>./configure &amp;&amp; make</tt> 并将其编译成为 <prgn><var>binary</var></prgn> (二进制程序)。
zh_tw: 使用 Autotools 的流程第二部是用戶獲得散佈的原始碼後在原始碼中運行 <tt>./configure &amp;&amp; make</tt> 並將其編譯成爲 <prgn><var>binary</var></prgn> (二進位程式)。

source: Makefile.in -----+ +-> Makefile -----+-> make -> <var>binary</var> src/Makefile.in -+-> ./configure -+-> src/Makefile -+ config.h.in -----+ +-> config.h -----+ | config.status -+ config.guess --+
ca: Makefile.in -----+ +-> Makefile -----+-> make -> <var>binari</var> src/Makefile.in -+-> ./configure -+-> src/Makefile -+ config.h.in -----+ +-> config.h -----+ | config.status -+ config.guess --+
fr: Makefile.in -----+ +-> Makefile -----+-> make -> <var>binaire</var> src/Makefile.in -+-> ./configure -+-> src/Makefile -+ config.h.in -----+ +-> config.h -----+ | config.status -+ config.guess --+

source: You can change many things in the <file>Makefile</file> file such as the default file install location using the command option, e.g. "<prgn>./configure --prefix=/usr</prgn>".
ca: Pots fer canvis en el fitxer <file>Makefile</file> com és el directori d'instal·lació predeterminat fent servir les opcions de <tt>configure</tt>, p.e.: <prgn>./configure --prefix=/usr</prgn>.
es: Puedes hacer cambios en el archivo <file>Makefile</file> como el directorio de instalación predeterminado usando las opciones de la orden, p.ej: "<prgn>./configure --prefix=/usr</prgn>".
fr: Vous pouvez modifier plein de choses dans le fichier <file>Makefile</file> comme le répertoire d'installation par défaut en utilisant une option de commande, par exemple « <prgn>./configure --prefix=/usr</prgn> ».
ja: デフォルトでファイルがインストールされる場所など、<file>Makefile</file> ファイルにある内容の多くは、コマンドオプションを使って変更することができます。例えば "<prgn>./configure --prefix=/usr</prgn>" のように。
zh_cn: 你可以通过命令选项来改变 <file>Makefile</file> 文件中的很多设置，比如默认的文件安装位置(使用 <prgn>./configure --prefix=/usr</prgn>)。
zh_tw: 你可以通過命令選項來改變 <file>Makefile</file> 檔案中的很多設置，比如默認的檔案安裝位置(使用 <prgn>./configure --prefix=/usr</prgn>)。

source: Although it is not required, updating the <file>configure</file> and other files with "<tt>autoreconf -i -f</tt>" as the user may improve the compatibility of the source.
ca: Tot i què no és necessari, l'actualització del fitxer <file>configure</file> i dels altres fitxers amb l'ordre <tt>autoreconf -i -f</tt> és la forma més adient per comprovar la compatibilitat del codi font.
es: Aunque no es necesario, la actualización del archivo <file>configure</file> y de otros archivos con la orden <tt>autoreconf -i -f</tt> es la mejor manera para mejorar la compatibilidad del código fuente.
fr: Bien que ce ne soit pas nécessaire, mettre à jour <file>configure</file> et les autres fichiers avec « <tt>autoreconf -i -f</tt> » en tant qu'utilisateur peut améliorer la compatibilité des sources.
ja: 必要ではないとしても、"<tt>autoreconf -i -f</tt>" をユーザとして実行して、<file>configure</file> や他のファイルを更新すると、ソースの互換性が改善される場合があります。
zh_cn: 尽管不是必须的，还可以使用 <tt>autoreconf -i -f</tt> 更新 <file>configure</file> 和其他相关文件，这样做可能提高源代码的兼容性。
zh_tw: 儘管不是必須的，還可以使用 <tt>autoreconf -i -f</tt> 更新 <file>configure</file> 和其他相關檔案，這樣做可能提高原始碼的兼容性。

source: <url id="http://en.wikipedia.org/wiki/CMake" name="CMake"> is an alternative build system. You can notice such sources by the <file>CMakeLists.txt</file> file.
ca: <url name="CMake" id="http://es.wikipedia.org/wiki/Cmake"> (en el moment de fer aquesta traducció, aquesta entrada no existeix a la Viquipèdia en català) és un sistema de compilació alternatiu. Els programes que fan servir aquest sistema de compilació tenen un arxiu <file>CMakeLists.txt</file> en el codi font.
es: <url id="http://es.wikipedia.org/wiki/Cmake" name="CMake"> es un sistema de compilación alternativo. La presencia del archivo <file>CMakeLists.txt</file> te indicará que se utiliza esta opción para compilar el programa.
fr: <url id="http://fr.wikipedia.org/wiki/CMake" name="CMake"> est un système de construction alternatif. De telles sources peuvent être remarquées avec le fichier <file>CMakeLists.txt</file>.
ja: <url id="http://en.wikipedia.org/wiki/CMake" name="CMake"> はまた別のビルドシステムです。<file>CMakeLists.txt</file> ファイルがあれば、そういうソースだとわかります。
zh_cn: <url id="http://en.wikipedia.org/wiki/CMake" name="CMake"> 是另一个可选的编译系统，可以通过 <file>CMakeLists.txt</file> 文件来识别它。
zh_tw: <url id="http://en.wikipedia.org/wiki/CMake" name="CMake"> 是另一個可選的編譯系統，可以通過 <file>CMakeLists.txt</file> 檔案來識別它。

source: Package name and version
ca: Nom del paquet i versió.
es: Nombre del paquete y versión
fr: Nom et version de paquet
it: Nome e versione del pacchetto
ja: パッケージ名とバージョン
zh_cn: 软件包名称和版本
zh_tw: 套件名稱和版本

source: You should start packaging with a completely clean (pristine) source directory, or simply with freshly unpacked sources.
ca: Per començar la construcció del paquet, cal fer-ho amb el directori del codi font «net», o simplement només amb els fitxers de l'arxiu comprimit del codi font.
es: Deberías empezar a construir tu paquete en un directorio de fuentes completamente limpio, o simplemente con las fuentes recién desempaquetadas.
fr: Vous devriez commencer la création du paquet avec un répertoire source complètement propre (originel), ou simplement avec les sources fraîchement décompressées.
it: Si dovrebbe iniziare la fase di pacchettizzazione con la directory dei sorgenti completamente ripulita, o semplicemente partendo da una nuova estrazione dall'archivio dei sorgenti.
ja: パッケージ化の作業は完全にクリーンな (オリジナルのままの) ソースディレクトリ、簡単に言えば新しく展開したソースから始めるべきです。
zh_cn: 开始打包时源代码目录应当是绝对干净(原始)的，或者直接使用刚刚解包得到的源代码。
zh_tw: 開始打包時原始碼目錄應當是絕對乾淨(原始)的，或者直接使用剛剛解壓縮得到的原始碼。

source: For the package to be built correctly, you must make the program's original name lowercase (if it isn't already), and you should move the source directory to <file><var>packagename</var>-<var>version</var></file>.
ca: Cal començar per canviar el nom original del programa fent servir lletres minúscules i el nom del directori amb el codi font com <file><var>nom_del_paquet</var>-<var>versió</var></file>.
es: Para construir correctamente el paquete, debes cambiar el nombre original del programa a letras minúsculas (si no lo está ya), y deberías renombrar el directorio de fuentes a <file><var>nombre_de_paquete</var>-<var>versión</var></file>.
fr: Pour que le paquet soit correctement construit, vous devez changer le nom du programme en minuscule (si ce n'est déjà fait), et vous devriez changer le répertoire source en <file><var>nomdepaquet</var>-<var>version</var></file>.
it: Per costruire correttamente il pacchetto, si deve convertire in minuscolo il nome del programma originale (se non lo fosse), e rinominare la directory dei sorgenti in <file><var>pacchetto</var>-<var>versione</var></file>.
ja: パッケージをきちんと作るためには、プログラム名がすべて小文字になるよう、(まだそうなっていなければ) オリジナルの名前から変更しておかなければいけません。またソースディレクトリ名を <file><var>パッケージ名</var>-<var>バージョン</var></file> に変更しておきましょう。
zh_cn: 为了让软件包可以正确地编译和构建，如果程序原有的名字不是完全小写的则必须将其改成小写，并且应当把源代码以 <file><var>packagename</var>-<var>version</var></file> 的形式命名。
zh_tw: 爲了讓套件可以正確地編譯和構建，如果程式原有的名字不是完全小寫的則必須將其改成小寫，並且應當把原始碼以 <file><var>packagename</var>-<var>version</var></file> 的形式命名。

source: If the program name consists of more than one word, contract them to one word, or make an abbreviation. For example, program "John's little editor for X" package would be named <package>johnledx</package>, or <package>jle4x</package>, or whatever you decide, as long as it's under some reasonable limit, e.g. 20 characters.
ca: Si el nom del programa està composat de més d'una paraula, fes-ne una contracció o abrevia'l. Per exemple, si el fitxer amb el programa té el nom «l'editor per a X de l'Aina» pots canviar-ho a <file>ainaedx</file> o <file>aedx4</file> per tal de deixar el nom més curt (fins a 20 caràcters).
es: Si el nombre del programa está formado por varias palabras, contráelas a una palabra o haz una abreviatura. Por ejemplo, el paquete del programa «el editor para X de Juan» se podría llamar <file>juandx</file> o <file>jle4x</file>, o lo que decidas, siempre y cuando no se exceda de unos límites razonables, como 20 caracteres.
fr: Si le nom du programme est constitué de plusieurs mots, réduisez-le à un mot, ou faites une abréviation. Par exemple, le paquet du programme « John's little editor for X » pourrait s'appeler <package>johnledx</package>, ou <package>jle4x</package>, ou ce que vous préférez, tant qu'il reste sous une limite raisonnable, comme vingt caractères.
it: Se il nome del programma è formato da più di una parola, si deve contrarlo in una sola parola, o abbreviarlo. Per esempio, il pacchetto del programma "John's little editor for X" potrebbe essere chiamato <package>johnledx</package>, o <package>jle4x</package>, o qualsiasi altra cosa attinente, che riesca a stare sotto un numero ragionevole di caratteri, ad esempio 20.
ja: もしプログラムの名前が二語以上で構成されていたら、一つの語につなげるか省略形にしましょう。 例えば、"John's little editor for X" というソフトウェアならば <package>johnledx</package> とか <package>jle4x</package> というようにしましょう。あまり長すぎない程度、 せいぜい 20 文字くらいまでの長さで、適当に決めていただければ結構です。
zh_cn: 如果程序的名称超过一个单词，把它改成一个单词或缩写成合适的形式。例如，程序“John's little editor for X”可以命名为 <package>johnledx</package> 或 <package>jle4x</package>，或者随便你认为合适的其他名字。它需要符合一定的限制，比如长度不要超过 20 和字符。
zh_tw: 如果程式的名稱超過一個單詞，把它改成一個單詞或縮寫成合適的形式。例如，程式“John's little editor for X”可以命名爲 <package>johnledx</package> 或 <package>jle4x</package>，或者隨便你認爲合適的其他名字。它需要符合一定的限制，比如長度不要超過 20 和字符。

source: Also check for the exact version of the program (to be included in the package version). If that piece of software is not numbered with versions like <tt>X.Y.Z</tt>, but with some kind of date, feel free to use that date as the version number, as long as newer version numbers will look larger. While it is best to use the same version number as what upstream uses, if it is in the format of <tt>09Oct23</tt> you may need to convert it to <tt>YYYYMMDD</tt> format, which would be <tt>20091023</tt>, to ensure proper order for upgrade with the <prgn>dpkg</prgn> program.<footnote><p>Version string can be compared by "<tt>dpkg --compare-versions <var>ver1</var> <var>op</var> <var>ver2</var></tt>". See <manref section="1" name="dpkg"> manpage.</p></footnote>
ca: Comprova la versió del programa (amb la qual es construirà el paquet). Si el programa no està numerat, amb número de versió de l'estil <tt>X.Y.Z</tt>, però si amb una data, ets lliure de fer servir la data com a número de versió, precedida per «0.0» (per tal de preveure que els autors alliberin una nova versió del tipus 1.0). Si la data del codi original és <tt>09Oct23</tt>, pots convertirla al format <tt>YYYYMMDD</tt> i fer servir la cadena <tt>20091023</tt> (amb el format de data ISO 8601) com a número de versió. D'aquesta manera es garanteix el bon funcionament de les actualitzacions amb el programa <prgn>dpkg</prgn> <footnote><p>Pots comparar la versió del programa executant en el terminal "<tt>dpkg --compare-versions <var>versió-1</var> <var>op</var> <var>versió-2</var></tt>". Consulta <manref section="1" name="dpkg"> manpage. </p></footnote>.
es: Comprueba también la versión exacta del programa (la que se incluye en la versión del paquete). Si el programa no está numerado con versiones del estilo de X.Y.Z, pero sí con fecha de publicación, eres libre de utilizar la fecha como número de versión (siempre que los números de versiones nuevas sean mayores) precedida por «0.0» (sólo por si los desarrolladores originales deciden sacar una versión nueva como 1.0). Así, si la fecha de las fuentes es <tt>09Oct23</tt>, puedes utilizar la cadena <tt>20091023</tt> (que utiliza el formato de fecha ISO 8601 <tt>AAAAMMDD</tt>) como número de versión. Esto garantizará el buen funcionamiento de la actualización con el programa <prgn>dpkg</prgn> <footnote><p>La versión del programa puede compararse ejecutando en el terminal "<tt>dpkg --compare-versions <var>ver1</var> <var>op</var> <var>ver2</var></tt>". Véase <manref section="1" name="dpkg"> manpage.</p></footnote>.
fr: Vérifiez aussi la version exacte du programme (à inclure dans la version du paquet). Si ce logiciel n'est pas numéroté avec un numéro de version comme <tt>X.Y.Z</tt>, mais avec une date de distribution, vous pouvez utiliser cette date comme numéro de version, tant que les numéros de version futurs apparaîtront plus grand. Bien qu'il soit préférable d'utiliser le même numéro de version qu'en amont, si la version ressemble à <tt>09Oct23</tt>, vous pourriez avoir besoin de la convertir au format <tt>AAAAMMJJ</tt>, pour la transformer en <tt>20091023</tt>, afin de garantir un ordre approprié pour les mises à jour avec le programme <prgn>dpkg</prgn>. <footnote><p>Les versions peuvent être comparée avec « <tt>dpkg --compare-versions <var>ver1</var> <var>op</var> <var>ver2</var></tt> ». Voir <manref section="1" name="dpkg">.</p></footnote>
it: Bisogna controllare inoltre l'esatta versione del programma (che deve essere inclusa nella versione del pacchetto). Se il programma non usa una numerazione delle versioni tipo <tt>X.Y.Z</tt>, ma qualche tipo di data, si può utilizzare tale data come numero di versione, a condizione che la numerazione vada ad aumentare. Anche se è meglio utilizzare lo stesso numero di versione usato dal programma, se il formato è <tt>09Oct23</tt> potrebbe essere necessario convertirlo nel formato <tt>YYYYMMDD</tt>, la data di prima quindi diventerebbe <tt>20091023</tt>, questo è utile per garantire il corretto ordine di aggiornamento con il programma <prgn>dpkg</prgn>. <footnote><p>La stringa della versione può essere confrontata con "<tt>dpkg --compare-versions <var>ver1</var> <var>op</var> <var>ver2</var></tt>". Vedere <manref section="1" name="dpkg"> manpage.</p></footnote>
ja: プログラムの正確なバージョンもチェックしましょう (パッケージのバージョンに含めるために)。もしそのソフトウェアが「バージョン X.Y.Z」という形式で番号付けされておらず、ある種の日付で区別されている場合には、新しいバージョン番号が大きくなっているようなら、その日付をバージョン番号として自由に使ってください。開発元が使っているのと同じバージョン番号を使うのがベストではありますが、それが<tt>09Oct23</tt> といった形式の場合は、それを <tt>20091023</tt> といった <tt>YYYYMMDD</tt> 形式に変換して、<prgn>dpkg</prgn> プログラムでのアップグレードが適切な順番でできるようにする必要があるかもしれません。<footnote><p>バージョン文字列は、"<tt>dpkg --compare-versions <var>ver1</var> <var>op</var> <var>ver2</var></tt>" として比較できます。<manref section="1" name="dpkg"> のマニュアルページを参照してください。</p></footnote>
zh_cn: 还要检查程序的版本号，它将被包含到软件包版本内。如果手中的软件版本号不是 <tt>X.Y.Z</tt> 的形式，而是使用日期等形式。那么可以继续使用日期来作为版本号，只要新版本程序的版本号能变得比老板本大即可。最好能与上游使用相同的版本号，如果上游使用了诸如 <tt>09Oct23</tt> 的格式，那么最好将其转换为 <tt>YYYYMMDD</tt> 的格式，此例中为 <tt>20091023</tt>，以便保证 <prgn>dpkg</prgn> 程序在更新软件时能正确处理新旧版本。<footnote><p>Version 字符串可以用 <tt>dpkg --compare-versions <var>ver1</var> <var>op</var> <var>ver2</var></tt> 命令比较。参看 <manref section="1" name="dpkg"> man 手册页。</p></footnote>
zh_tw: 還要檢查程式的版本號，它將被包含到套件版本內。如果手中的軟體版本號不是 <tt>X.Y.Z</tt> 的形式，而是使用日期等形式。那麼可以繼續使用日期來作爲版本號，只要新版本程式的版本號能變得比舊版本大即可。最好能與上游使用相同的版本號，如果上游使用了諸如 <tt>09Oct23</tt> 的格式，那麼最好將其轉換爲 <tt>YYYYMMDD</tt> 的格式，此例中爲 <tt>20091023</tt>，以便保證 <prgn>dpkg</prgn> 程式在更新軟體時能正確處理新舊版本。<footnote><p>Version 字符串可以用 <tt>dpkg --compare-versions <var>ver1</var> <var>op</var> <var>ver2</var></tt> 命令比較。參考 <manref section="1" name="dpkg"> man 手冊頁。</p></footnote>

source: Some programs won't be numbered at all, in which case you should contact the upstream maintainer to see if they've got some other revision-tracking method.
ca: Tot i així, alguns programes no fan servir cap tipus de codificació per diferenciar les versions: en aquest cas caldrà contactar amb l'autor original per saber si fa servir algun altre sistema de control de versions.
es: Aún así habrá algunos programas que ni siquiera estén numerados, en cuyo caso deberás contactar con el autor original para ver si tiene algún otro sistema de seguimiento de revisiones.
fr: Certains programmes ne seront pas numérotés du tout, auquel cas vous devriez contacter le responsable amont pour voir s'il a une autre méthode de suivi des révisions.
it: Alcuni programmi non usano alcun tipo di numerazione, in questo caso si dovrebbe contattare l'autore del programma, per controllare se viene usato qualche altro metodo di revisione.
ja: およそバージョン番号に使えそうな情報がまったくないと言う場合、上流メンテナに連絡をとって彼らが何か他のリビジョン管理手段を使っているかどうか聞いてみましょう。
zh_cn: 还有一些程序根本就没有版本号，这是你应该联系上游维护者，看他们是否使用了其他的版本跟踪方法。
zh_tw: 還有一些程式根本就沒有版本號，這是你應該聯繫上游維護者，看他們是否使用了其他的版本跟蹤方法。

source: Initial Debian package
ca: Paquet Debian inicial.
es: «Debianización» inicial
fr: Paquet Debian initial
ja: 最初の Debian パッケージ
zh_cn: 初始化 Debian 软件包
zh_tw: 初始化 Debian 套件

source: Let's set up the shell environment variable <tt>$DEBEMAIL</tt> and <tt>$DEBFULLNAME</tt> so many Debian maintenance tools recognize your name and email address to use for packages as follows.<footnote><p>The following text assumes you are using Bash as your login shell. If you use other login shells such as Z shell, use their pertinent configuration files instead of <file>~/.bashrc</file>.</p></footnote>.
ca: Comença per configurar les variables d'entorn del shell Bash <tt>$DEBEMAIL</tt> i <tt>$DEBFULLNAME</tt> que faran servir les eines de manteniment de Debian per tal d'obtenir el teu nom i adreça electrònica com s'indica a continuació<footnote><p>El text mostrat a continuaci dona per suposat que fas servir Bash com a intérpret d'ordres. Si fas sevir altres interprets, com és ara Z shell, hauràs de fer servir els seus arxius de configuració en lloc de <file>~/.bashrc</file>.</p></footnote>.
es: Primero debes configurar las variables de entorno Bash shell <tt>$DEBEMAIL</tt> y <tt>$DEBFULLNAME</tt> que son utilizadas por varias herramientas de mantenimiento de Debian para obtener tu nombre y correo electrónico como se indica a continuación<footnote><p>El texto mostrado a continuación da por supuesto que estás ejecutando Bash como tu intérprete de línea de órdenes. Si utilizas otros intérpretes, como Z shell, deberás utilizar sus correspondientes ficheros de configuración en lugar de <file>~/.bashrc</file>.</p></footnote>.
zh_cn: 首先我们设置两个 环境变量，<tt>$DEBEMAIL</tt> 和 <tt>$DEBFULLNAME</tt>，使多数 Debian 维护工具能够正确识别你用于维护软件包的姓名和电子邮件地址。<footnote><p>以下默认以 Bash 作为登陆 shell。如果你使用其他的 shell，例如 Z shell，使用它们的配置文件代替这里提到的 <file>~/.bashrc</file>。</p></footnote>

source: $ cat &gt;&gt;~/.bashrc &lt;&lt;EOF DEBEMAIL=your.email.address@example.org DEBFULLNAME="Firstname Lastname" export DEBEMAIL DEBFULLNAME EOF
ca: $ cat &gt;&gt;~/.bashrc &lt;&lt;EOF DEBEMAIL=la.teva.adreça.electrònica@exemple.org DEBFULLNAME="el teu nom i llinatge" export DEBEMAIL DEBFULLNAME EOF
es: $ cat &gt;&gt;~/.bashrc &lt;&lt;EOF DEBEMAIL=tu.dirección@ejemplo.org DEBFULLNAME="tu nombre y apellido" export DEBEMAIL DEBFULLNAME EOF
fr: $ cat &gt;&gt;~/.bashrc &lt;&lt;EOF DEBEMAIL=votre.adresse.mail@example.org DEBFULLNAME="Prénom Nom" export DEBEMAIL DEBFULLNAME EOF
it: $ cat &gt;&gt;~/.bashrc &lt;&lt;EOF DEBEMAIL=il.vostro.indirizzo.email@example.org DEBFULLNAME="Nome Cognome" export DEBEMAIL DEBFULLNAME EOF

source: Let's make an initial Debian package by issuing the <prgn>dh_make</prgn> command as follows.
ca: Ara ja pots començar la construcció del paquet Debian executant l'ordre <prgn>dh_make</prgn>:
es: Ahora puedes iniciar la construcción del paquete Debian ejecutando la orden <prgn>dh_make</prgn> como se describe a continuación.
fr: Préparez le paquet Debian initial en invoquant la commande <prgn>dh_make</prgn> comme suit :
ja: 次のように <prgn>dh_make</prgn> コマンドを実行して、最初の Debian パッケージを作ってみましょう。
zh_cn: 让我们按照以下方法使用 <prgn>dh_make</prgn> 来初始化 Debian 软件包。
zh_tw: 讓我們按照以下方法使用 <prgn>dh_make</prgn> 來初始化 Debian 套件。
