Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: Although packages listed in the <tt>Build-Depends-indep</tt> field are required to be installed for the normal packaging by us (see <ref id="completebuild">), they are not required to be installed for the autobuilder system since it build only architecture dependent binary packages. <footnote><p>Unlike under the <package>pbuilder</package> package, the <prgn>chroot</prgn> environment under the <package>sbuild</package> package used by the autobuilder system does not force the minimal system and may leave many packages installed.</p></footnote> This difference between normal packaging and autobuilder situation dictates whether you record such required packages in the <tt>Build-Depends</tt> or <tt>Build-Depends-indep</tt> fields of the <file>debian/control</file> file (see <ref id="control">).
ca: Encara que és necessari instal·lar els paquets llistats en el camp <tt>Build-Depends-indep</tt> per a la construcció de paquets normal (consulta <ref id="completebuild">), el sistema automàtic de construcció no ho requereix degut a què només construeix paquets binaris dependents de l'arquitectura <footnote><p>A diferència a com funciona el paquet <package>pbuilder</package> (que s'explicarà més endavant), l'entorn <prgn>chroot</prgn> del paquet <package>sbuild</package> fet servir pel sistema automàtic no té una instal·lació mínima de paquets del sistema i pot deixar molts de paquets instal·lats. </p></footnote>. Aquestes diferències entre l'empaquetament normal i l'automàtic determinen si els paquets requerits per a la compilació s'han de llistar en el camp <tt>Build-Depends</tt> o en el camp <tt>Build-Depends-indep</tt> del fitxer <file>debian/control</file> (consulta <ref id="control">).
es: Aunque es necesario instalar los paquetes listados en el campo <tt>Build-Depends-indep</tt> para el empaquetamiento normal (véase <ref id="completebuild">), el sistema automático de construcción no lo requiere puesto que solo construye paquetes binarios dependientes de la arquitectura <footnote><p>Contrariamente a modo de funcionamiento del paquete <package>pbuilder</package> (que se tratará más adelante), el entorno <prgn>chroot</prgn> del paquete <package>sbuild</package> utilizado por el sistema automático no tiene una instalación mínima de paquetes del sistema y puede dejar muchos paquetes instalados. </p></footnote>. Estas diferencias entre el empaquetamiento normal y el automático determinan si los paquetes requeridos para la compilación se deben listar en el campo <tt>Build-Depends</tt> o bien en el campo <tt>Build-Depends-indep</tt> del archivo <file>debian/control</file> (véase <ref id="control">).
fr: Bien qu'il soit nécessaire d'installer les paquets énumérés dans le champ <tt>Build-Depends-indep</tt> pour l'empaquetage normal (cf. <ref id="completebuild">), il n'est pas nécessaire de les installer sur le serveur d'empaquetage automatique puisqu'il ne construit que les paquets binaires dépendants de l'architecture. <footnote><p>contrairement à celui du paquet <package>pbuilder</package>, l'environnement <prgn>chroot</prgn> du paquet <package>sbuild</package> utilisé par les serveurs d'empaquetage automatique n'est pas forcément minimal et plusieurs paquets peuvent rester installés.</p></footnote> Cette différence entre l'empaquetage normal et celui des serveurs d'empaquetage automatique permet de déterminer si les paquets doivent être énumérés dans le champ <tt>Build-Depends</tt> ou <tt>Build-Depends-indep</tt> du fichier <file>debian/control</file>, cf. <ref id="control">.
ja: <tt>Build-Depends-indep</tt>フィールドのパッケージは、通常のパッケージの場合はインストールを要求されますが(参照 <ref id="completebuild">)、autobuilderシステムは、アーキテクチャ依存のパッケージのみをビルドするので、インストールは必須ではありません。<footnote><p><package>pbuilder</package>パッケージとは違い、オートビルダーによって使用される<package>sbuild</package>パッケージ下での<prgn>chroot</prgn>環境では、最小構成を強制しないので、多くのパッケージがインストールされたままになるかもしれません。</p></footnote> オートビルダーを使用した場合と普通のパッケージングとのこの違いは、要求パッケージを <file>debian/control</file>ファイルの<tt>Build-Depends</tt> や <tt>Build-Depends-indep</tt>に記録するかどうかで決定されます。(参照 <ref id="control">)
zh_cn: 尽管通常的打包工作中 <tt>Build-Depends-indep</tt> 域中列出的软件包都需要安装(参看 <ref id="completebuild">)，但是在编译平台依赖二进制包时它们无需在自动编译系统上安装。<footnote><p>和在 <package>pbuilder</package> 中不同，自动编译系统使用的 <package>sbuild</package> 所维护的 <prgn>chroot</prgn> 不强制要求最小化的编译系统，并可能保持很多软件包始终安装在其中。</p></footnote>通常打包和自动编译系统的这种不同为你指出如何考虑必须的软件包应如何放在 <file>debian/control</file> 文件的 <tt>Build-Depends</tt> 或 <tt>Build-Depends-indep</tt> 域中(参看 <ref id="control">)。
zh_tw: 儘管通常的打包工作中 <tt>Build-Depends-indep</tt> 域中列出的套件都需要安裝(參考 <ref id="completebuild">)，但是在編譯平臺依賴二進位套件時它們無需在自動編譯系統上安裝。<footnote><p>和在 <package>pbuilder</package> 中不同，自動編譯系統使用的 <package>sbuild</package> 所維護的 <prgn>chroot</prgn> 不強制要求最小化的編譯系統，並可能保持很多套件始終安裝在其中。</p></footnote>通常打包和自動編譯系統的這種不同爲你指出如何考慮必須的套件應如何放在 <file>debian/control</file> 檔案的 <tt>Build-Depends</tt> 或 <tt>Build-Depends-indep</tt> 域中(參考 <ref id="control">)。

source: Including <file>orig.tar.gz</file> for upload
ca: Incloure el fitxer <file>orig.tar.gz</file> per a la transferència del paquet al repositori.
es: Incluir <file>orig.tar.gz</file> para la transferencia del paquete al repositorio.
fr: Inclusion de <file>orig.tar.gz</file> pour l'envoi
it: Includere <file>orig.tar.gz</file> per il caricamento.
ja: アップロード用<file>orig.tar.gz</file>の内容
zh_cn: 在上传时包含 <file>orig.tar.gz</file> 文件
zh_tw: 在上傳時包含 <file>orig.tar.gz</file> 檔案

source: When you first upload the package to the archive, you need to include the original <file>orig.tar.gz</file> source. If the last changelog entry is not the first one for the given upstream version, you must provide <prgn>dpkg-buildpackage</prgn> command with the "<tt>-sa</tt>" option. On the other hand, the "<tt>-sd</tt>" option will force to exclude the original <file>orig.tar.gz</file> source.
ca: A l'hora d'enviar per primera vegada el paquet al repositori, cal incloure l'arxiu <file>orig.tar.gz</file> amb les fonts originals. Si la darrera entrada del darrer arxiu de canvis (<file>changelog</file>) no és la primera de la versió de l'autor original, hauràs d'executar l'ordre <prgn>dpkg-buildpackage</prgn> amb l'opció <tt>-sa</tt> per forçar la inclusió de l'arxiu <file>orig.tar.gz</file>.
es: Cuando se envía por primera vez al archivo, se debe incluir el archivo <file>orig.tar.gz</file> con las fuentes originales. Si la última entrada del último archivo de cambios no es la primera de la versión del autor original, deberás ejecutar la orden <prgn>dpkg-buildpackage</prgn> con el la opción "<tt>-sa</tt>". Por otra parte, es posible excluir la inclusión del archivo con la opción <tt>-sd</tt>.
fr: Lors du premier envoi d'un paquet vers l'archive, il faut inclure les sources <file>orig.tar.gz</file> d'origine. Si la dernière entrée du journal de modification n'est pas la première pour cette version amont, vous devez passer l'option « <tt>-sa</tt> » à la commande <prgn>dpkg-buildpackage</prgn>. D'un autre côté, l'option « <tt>-sd</tt> » forcera l'exclusion des sources <file>orig.tar.gz</file> originales.
it: Quando si carica per la prima volta il pacchetto nell'archivio, si deve includere il file dei sorgenti originali <file>orig.tar.gz</file>. Se l'ultima voce del changelog non è la prima della versione originale, si deve eseguire il comando <prgn>dpkg-buildpackage</prgn> con l'attributo "<tt>-sa</tt>". Al contrario, l'opzione "<tt>-sd</tt>" forzerà l'esclusione del sorgente originale <file>orig.tar.gz</file>.
ja: はじめてパッケージをアーカイブにアップロードする際は、オリジナルの<file>orig.tar.gz</file>ソースファイルを含めなければなりません。最新のchangelogエントリーが、最初に上流から投げられたものと違う場合は、<prgn>dpkg-buildpackage</prgn>に"<tt>-sa</tt>"オプションを付けて提供しなければなりません。逆に、"<tt>-sd</tt>"オプションを付けると、オリジナルの<file>orig.tar.gz</file> ソースファイルを強制的に除外します。
zh_cn: 第一次向仓库上传软件包时要包含 <file>orig.tar.gz</file> 源代码归档。如果 changelog 中的最后一个条目是这个上游版本的第一次上传，那么应为 <prgn>dpkg-buildpackage</prgn> 命令传递 <tt>-sa</tt> 选项。相反，<tt>-sd</tt> 选项会强制将原始的 <file>orig.tar.gz</file> 源代码归档排除在外。
zh_tw: 第一次向倉庫上傳套件時要包含 <file>orig.tar.gz</file> 原始碼歸檔。如果 changelog 中的最後一個條目是這個上游版本的第一次上傳，那麼應爲 <prgn>dpkg-buildpackage</prgn> 命令傳遞 <tt>-sa</tt> 選項。相反，<tt>-sd</tt> 選項會強制將原始的 <file>orig.tar.gz</file> 原始碼歸檔排除在外。

source: <prgn>debuild</prgn> command
ca: L'ordre <prgn>debuild</prgn>.
es: La orden <prgn>debuild</prgn>
fr: Commande debuild
it: Il comando <prgn>debuild</prgn>
ja: <prgn>debuild</prgn>コマンド
zh_cn: <prgn>debuild</prgn> 命令
zh_tw: <prgn>debuild</prgn> 命令

source: You can automate package build process of the <prgn>dpkg-buildpackage</prgn> command further with the <prgn>debuild</prgn> command. See <manref section="1" name="debuild">.
ca: Pots automatitzar encara més el procés de construcció de paquets de <prgn>dpkg-buildpackage</prgn> amb l'ordre <prgn>debuild</prgn>. Consulta <manref section="1" name="debuild">.
es: Puedes automatizar aún más el proceso de construcción de paquetes de la orden <prgn>dpkg-buildpackage</prgn> con la orden <prgn>debuild</prgn>. Veáse <manref section="1" name="debuild">.
fr: Vous pouvez automatiser encore plus le processus de construction de la commande <prgn>dpkg-buildpackage</prgn> avec la commande <prgn>debuild</prgn>, cf. <manref section="1" name="debuild">.
it: È possibile automatizzare ulteriormente il processo di creazione del pacchetto, eseguito con il comando <prgn>dpkg-buildpackage</prgn>, utilizzando il comando <prgn>debuild</prgn>. Vedere <manref section="1" name="debuild">.
ja: <prgn>dpkg-buildpackage</prgn>による自動構築プロセスは、<prgn>debuild</prgn>によりさらに進めることができます。詳しくは<manref section="1" name="debuild">を参照してください。
zh_cn: 你可以使用 <prgn>debuild</prgn> 命令来进一步自动化 <prgn>dpkg-buildpackage</prgn> 的构建过程。参看 <manref section="1" name="debuild">
zh_tw: 你可以使用 <prgn>debuild</prgn> 命令來進一步自動化 <prgn>dpkg-buildpackage</prgn> 的構建過程。參考 <manref section="1" name="debuild">

source: Customization of the <prgn>debuild</prgn> command can be done through <file>/etc/devscripts.conf</file> or <file>~/.devscripts</file>. I would suggest at least following items:
ca: La personalització de l'ordre <prgn>debuild</prgn> pot fer-se mitjançant els fitxers <file>/etc/devscripts.conf</file> o <file>~/.devscripts</file>. Et suggereixo almenys els següents valors:
es: La personalización de la orden debuild puede hacerse a través de <file>/etc/devscripts.conf</file> o <file>~/.devscripts</file>. Te sugiero al menos los siguientes valores:
fr: La configuration de la commande <prgn>debuild</prgn> peut être faite via <file>/etc/devscript.conf</file> ou <file>~/.devscript</file>. Les entrées suivantes sont suggérées :
it: La configurazione del comando <prgn>debuild</prgn> può essere fatta usando <file>/etc/devscripts.conf</file> o <file>~/.devscripts</file>. Ecco alcune impostazioni consigliate:
ja: <prgn>debuild</prgn>コマンドのカスタマイズは<file>/etc/devscripts.conf</file>や<file>~/.devscripts</file>を用いて行います。少なくとも以下の設定をすると良いでしょう。
zh_cn: 对 <prgn>debuild</prgn> 命令的自定义可以通过 <file>/etc/devscripts.conf</file> 或 <file>~/.devscripts</file> 实现。我建议至少添加以下几项：
zh_tw: 對 <prgn>debuild</prgn> 命令的自定義可以通過 <file>/etc/devscripts.conf</file> 或 <file>~/.devscripts</file> 實現。我建議至少添加以下幾項：

source: DEBSIGN_KEYID="Your_GPG_keyID" DEBUILD_LINTIAN=yes DEBUILD_LINTIAN_OPTS="-i -I --show-overrides"
ca: DEBSIGN_KEYID="La_teva_ID_de_la_clau_GPG" DEBUILD_LINTIAN=yes DEBUILD_LINTIAN_OPTS="-i -I --show-overrides"
es: DEBSIGN_KEYID="Tu_ID_clave_GPG" DEBUILD_LINTIAN=yes DEBUILD_LINTIAN_OPTS="-i -I --show-overrides"
fr: DEBSIGN_KEYID="Votre_ID_cle_GPG" DEBUILD_LINTIAN=yes DEBUILD_LINTIAN_OPTS="-i -I --show-overrides"
it: DEBSIGN_KEYID="ID_della_vostra_chiave_GPG" DEBUILD_LINTIAN=yes DEBUILD_LINTIAN_OPTS="-i -I --show-overrides"

source: With these, packages are signed by your specified GPG key ID (good for sponsoring packages) and checked by the <prgn>lintian</prgn> command in details.
ca: Amb aquesta configuració pots construir paquets sempre amb la teva clau GPG, evitant incloure components no desitjats (i facilitant el patrocini del paquet) i la inspecció del paquet amb l'ordre <prgn>lintian</prgn> en el mode detallat.
es: Con estos valores, puedes construir paquetes siempre con tu clave GPG, evitando incluir componentes no deseados (facilitará que te patrocinen el paquete), e inspeccionar el paquete con la orden <prgn>lintian</prgn> en el modo detallado.
fr: Ainsi, les paquets seront signés avec votre identifiant de clé GPG (bon pour les paquets parrainés) et vérifiés avec la commande <prgn>lintian</prgn> en détail.
it: Con queste impostazioni, i pacchetti saranno firmati usando la chiave GPG con l'ID specificato (questo è utile per le sponsorizzazioni) e controllati con il programma <prgn>lintian</prgn> in modo dettagliato.
ja: これによって、パッケージは常にあなたのGPG鍵でサインされ、<prgn>lintian</prgn>コマンドで詳細にチェックされます。（これはスポンサーの作業にも適しています。）
zh_cn: 这样软件包会使用指定的 ID 的 GPG 私钥签署(对于 sponsor 软件包有好处)，并使用 <prgn>lintian</prgn> 命令对软件包做最大程度的检查。
zh_tw: 這樣套件會使用指定的 ID 的 GPG 私鑰簽署(對於 sponsor 套件有好處)，並使用 <prgn>lintian</prgn> 命令對套件做最大程度的檢查。

source: Cleaning source and rebuilding package from a user account is as simple as:
ca: Per exemple, netejar el codi i reconstruir el paquet des d'un compte d'usuari és tan simple com:
es: Por ejemplo, limpiar el código y reconstruir el paquete desde una cuenta de usuario es tan simple como:
fr: Le nettoyage des sources et la reconstruction du paquet avec un compte utilisateur est aussi simple que :
it: Per esempio, si può ripulire i sorgenti e ricreare il pacchetto da un account utente, con:
ja: 以下のように一般ユーザアカウントから、簡単にソースを除去しパッケージを再ビルドできます。
zh_cn: 在普通用户帐号中可以使用以下这样简单的命令清理源代码并重构建软件包：
zh_tw: 在普通用戶帳號中可以使用以下這樣簡單的命令清理原始碼並重構建套件：

source: $ debuild
ca: debuild clean debuild

source: Please note that the <prgn>dpkg-buildpackage</prgn> option "<tt>-sa</tt>" to include the original <file>orig.tar.gz</file> source can be specified as:
ca: Per incloure el fitxer de les fonts originals (per a què s'executi <prgn>dpkg-buildpackage</prgn> amb l'opció <tt>-sa</tt>) <file>orig.tar.gz</file> hauràs d'executar el següent:
es: Tenga en cuenta que puede especificar la opción «<tt>-sa</tt>» de <prgn>dpkg-buildpackage</prgn> para incluir el fichero original <file>orig.tar.gz</file> como sigue:
fr: Remarquez que le paramètre « <tt>-sa</tt> » de <prgn>dpkg-buildpackage</prgn> pour intégrer les sources d'origine <file>orig.tar.gz</file> peut être précisé :
it: Si noti che il programma <prgn>dpkg-buildpackage</prgn> eseguito con l'opzione "<tt>-sa</tt>", può includere il sorgente originale <file>orig.tar.gz</file>, eccone un esempio:
ja: <prgn>dpkg-buildpackage</prgn>に"<tt>-sa</tt>"オプションを付けてオリジナルの<file>orig.tar.gz</file>ソースファイルを含める方法も覚えておきましょう。
zh_cn: 请注意用于包含 <file>orig.tar.gz</file> 源代码归档的 <prgn>dpkg-buildpackage</prgn> 参数 <tt>-sa</tt> 可以这样传递：
zh_tw: 請注意用於包含 <file>orig.tar.gz</file> 原始碼歸檔的 <prgn>dpkg-buildpackage</prgn> 參數 <tt>-sa</tt> 可以這樣傳遞：

source: You can clean source tree as simple as:
ca: Pots eliminar els fitxers generats en la compilació executant:
es: Puedes eliminar los archivos generados en la compilación ejecutando:
fr: Le nettoyage de l'arborescence des sources est aussi simple que :
it: È possibile ripulire l'albero dei sorgenti con:
ja: ソースツリーの掃除も簡単です。
zh_cn: 还可以简单地清理源代码树：
zh_tw: 還可以簡單地清理原始碼樹：

source: <package>pbuilder</package> package
ca: El paquet <package>pbuilder</package>.
es: El paquete <package>pbuilder</package>
fr: Paquet pbuilder
it: Il pacchetto <package>pbuilder</package>
ja: <package>pbuilder</package>パッケージ
zh_cn: <package>pbuilder</package> 软件包
zh_tw: <package>pbuilder</package> 套件

source: For a clean room (<prgn>chroot</prgn>) build environment to verify the build dependencies, the <package>pbuilder</package> package is very useful. <footnote><p>Since the <package>pbuilder</package> package is still evolving, you have to check the actual configuration situation by consulting the latest official documentation.</p></footnote> This ensures a clean build from the source under the <tt>sid</tt> auto-builder for different architectures and avoids the severity serious FTBFS (Fails To Build From Source) bug which is always in the RC (release critical) category. See <url id="&buildd-home;"> for more on the Debian package auto-builder.
ca: El paquet <package>pbuilder</package> és molt útil per aconseguir un entorn net (<package>chroot</package>) on comprovar les dependències <footnote><p>Com que el paquet <package>pbuilder</package> està en evolució, comprova la configuració actual consultant la documentació.</p></footnote>. Això assegura una construcció neta des del codi per a la construcció automàtica en la distribució <package>sid</package> per a diferents arquitectures i evita errades serioses del tipus FTBFS (Petada en la construcció des de les fonts o «Fail to Build From Source»), que són sempre de tipus RC (errades criques per a la publicació o «release critical»). Per a més informació del paquet Debian auto-builder consulta <url id="&buildd-home;">.
es: El paquete <package>pbuilder</package> es muy útil para conseguir un entorno de compilación limpio (<prgn>chroot</prgn>) donde verificar las dependencias de compilación <footnote><p>Dado que el paquete <package>pbuilder</package> está evolucionando, deberías comprobar la situación de la configuración consultando la última documentación oficial disponible.</p></footnote>. Esto asegura una construcción limpia desde el código en los auto-compiladores de <tt>sid</tt> para las distintas arquitecturas y evita fallos de nivel de severidad serios del tipo FTBFS («Fail to Build From Source», o «fallo al construir desde la fuente »), que son siempre de categoría RC (fallos críticos o «release critical»). Para más información del paquete Debian «auto-builder» consulte <url id="&buildd-home;">.
fr: Pour un environnement de construction propre (<prgn>chroot</prgn>) permettant de vérifier les dépendances de construction, <package>pbuilder</package> est très utile. <footnote><p>Comme le paquet <package>pbuilder</package> est en constante évolution, vous devez vérifier les possibilités réelles de la configuration en consultant la dernière documentation officielle.</p></footnote> Cela garantit une construction propre des sources en construction automatique sous <tt>sid</tt> pour différentes architectures et évite l'erreur de gravité sérieuse FTBFS (« Fails To Build From Source » pour les échecs de construction à partir du paquet source), qui est toujours en catégorie RC (« Release Critical », bloquant la publication). Voir <url id="&buildd-home;"> pour plus d'informations sur le constructeur automatique de paquet Debian.
it: Il pacchetto <package>pbuilder</package> è molto utile per verificare le dipendenze di creazione del pacchetto da un ambiente (<prgn>chroot</prgn>) di compilazione sano e minimale. <footnote><p><package>pbuilder</package> è ancora in evoluzione, si dovrebbe controllare l'attuale configurazione consultando la documentazione ufficiale più recente.</p></footnote> Questo assicura di compilare i sorgenti in maniera pulita, usando la distribuzione <tt>sid</tt> un compilatore automatico (auto-builder) per differenti architetture ed evita i bug FTBS (Fails To Build from Source) di severità seria, che sono sempre di categoria RC (Critici per il Rilascio). Vedi <url id="&buildd-home;"> per maggiori informazioni sul compilatore automatico di pacchetti Debian.
ja: ビルド依存を確認するための無菌室 (<prgn>chroot</prgn>)なビルド環境では<package>pbuilder</package>パッケージが非常に便利です。<footnote><p><package>pbuilder</package>パッケージはまだ進化の過程なので、実際の構成は、公式ドキュメントで確認して下さい。</p></footnote> これにより、異なるアーキテクチャ向けのオートビルダーの下において、<tt>sid</tt>環境での、ソースからのクリーンなビルドが保証されます。また、深刻なFTBFS(Fails To Build From Source)バグを防ぎます。FTBFS バグは常に RC (release critical) に分類されます。Debianパッケージのオートビルダーについてもっと知りたい場合は<url id="&buildd-home;">を参照してください。
zh_cn: 对于使用净室(<prgn>chroot</prgn>)编译环境来验证编译依赖而言，<package>pbuilder</package> 软件包是非常有用的。<footnote><p><package>pbuilder</package> 软件包仍然在改进中，你可以查看最新的官方文档来检查实际的配置状况。</p></footnote>它确保了软件包在不同构架上的 <tt>sid</tt> 发行版环境中的自动编译器中能成功编译，避免了总是被归类于 RC (Release Critical，影响发布)的严重 FTBFS (Fails To Build From Source，从源代码编译失败) Bug。参看 <url id="&buildd-home;"> 以更多了解 Debian 软件包自动编译系统。
zh_tw: 對於使用淨室(<prgn>chroot</prgn>)編譯環境來驗證編譯依賴而言，<package>pbuilder</package> 套件是非常有用的。<footnote><p><package>pbuilder</package> 套件仍然在改進中，你可以查看最新的官方文件來檢查實際的設定狀況。</p></footnote>它確保了套件在不同構架上的 <tt>sid</tt> 發行版環境中的自動編譯器中能成功編譯，避免了總是被歸類於 RC (Release Critical，影響發佈)的嚴重 FTBFS (Fails To Build From Source，從原始碼編譯失敗) Bug。參考 <url id="&buildd-home;"> 以更多瞭解 Debian 套件自動編譯系統。

source: Let's customize the <package>pbuilder</package> package by the following.
ca: És possible personalitzar el funcionament del paquet <package>pbuilder</package> en els següents aspectes:
es: Para personalizar el funcionamiento del paquete <package>pbuilder</package> haz lo siguiente:
fr: Le paquet <package>pbuilder</package> est personnalisable de la manière suivante :
it: Si configuri il pacchetto <package>pbuilder</package> come segue.
ja: それでは、<package>pbuilder</package>をカスタマイズしてみましょう。
zh_cn: 我们通过以下操作来定制 <package>pbuilder</package> 软件包。
zh_tw: 我們通過以下操作來定製 <package>pbuilder</package> 套件。

source: setting <file>/var/cache/pbuilder/result</file> directory writable by the user.
ca: permet que el teu usuari tengui permís d'escriptura en el directori <file>/var/cache/pbuilder/result</file>.
es: permite que tu usuario del sistema tenga permiso de escritura en el directorio <file>/var/cache/pbuilder/result</file>.
fr: configuration du répertoire <file>/var/cache/pbuilder/result</file> accessible en écriture pour l'utilisateur ;
it: impostare il permesso di scrittura per l'utente alla directory <file>/var/cache/pbuilder/result</file>.
ja: <file>/var/cache/pbuilder/result</file>ディレクトリを、ユーザーから書き込めるように設定してください。
zh_cn: 设置 <file>/var/cache/pbuilder/result</file> 对用户可写。
zh_tw: 設置 <file>/var/cache/pbuilder/result</file> 對用戶可寫。

source: creating a directory, e.g. <file><var>/var/cache/pbuilder/hooks</var></file>, writable by the user to place hook scripts.
ca: genera un directori, p. ex. <file><var>/var/cache/pbuilder/hooks</var></file>, amb permís d'escriptura per al teu usuari. En aquest directori posaràs els guions «hook».
es: crea un directorio, p.e. <file><var>/var/cache/pbuilder/hooks</var></file>, con permiso de escritura para tu usuario. En este directorio pondrás los guiones «hook»
fr: création d'un répertoire, par exemple <file><var>/var/cache/pbuilder/hooks</var></file>, accessible en écriture pour l'utilisateur pour y placer ses scripts hook ;
it: creare una directory, ad es. <file><var>/var/cache/pbuilder/hooks</var></file>, con i permessi di scrittura per l'utente per potergli inserire degli script di hook.
ja: フックスクリプトを置くために、ユーザーからの書き込みが可能なディレクトリを作成してください。例） <file><var>/var/cache/pbuilder/hooks</var></file>
zh_cn: 创建一个对用户可写的目录保存钩子脚本，例如 <file><var>/var/cache/pbuilder/hooks</var></file>
zh_tw: 創建一個對用戶可寫的目錄保存鉤子腳本，例如 <file><var>/var/cache/pbuilder/hooks</var></file>

source: setting <file>~/.pbuilderrc</file> or <file>/etc/pbuilderrc</file> to include as follows.
ca: Estableix els fitxers <file>~/.pbuilderrc</file> o <file>/etc/pbuilderrc</file> amb el següent contingut:
es: establece los archivos <file>~/.pbuilderrc</file> o <file>/etc/pbuilderrc</file> con el siguiente contenido:
fr: configuration de <file>~/.pbuilderrc</file> or <file>/etc/pbuilderrc</file> pour intégrer :
it: configurare il file <file>~/.pbuilderrc</file> o <file>/etc/pbuilderrc</file> in modo che includa le seguenti righe.
ja: <file>~/.pbuilderrc</file> か <file>/etc/pbuilderrc</file> に以下のように設定します。
zh_cn: 在 <file>~/.pbuilderrc</file> 或 <file>/etc/pbuilderrc</file> 中添加以下内容：
zh_tw: 在 <file>~/.pbuilderrc</file> 或 <file>/etc/pbuilderrc</file> 中添加以下內容：
