Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: Updating an existing package may get complicated since it may be using older techniques. Please stick with fresh packaging cases for now to learn basics. I will come back to explain it later in <ref id="update">.
ca: L'actualització d'un paquet ja construït és un procés més complex: es probable que s'hagi construït amb procediments distints als que es fan servir actualment. Es millor treballar amb paquets actualitzats per aprendre els procediments bàsics de la construcció de paquets. Per empaquetar una revisió o una nova versió del teu paquet en el futur, faràs servir un procediment distint. Tot això s'explicarà a la secció <ref id="update">.
es: La actualización de un paquete ya creado es un proceso más complejo: es probable que se haya construido con procedimientos distintos al actual. Es mejor trabajar con paquetes actualizados para aprender lo básico del empaquetado. Esto también significa que usarás un método distinto para generar una nueva revisión o una nueva versión de tu paquete en el futuro. Lee más sobre esto más adelante, en <ref id="update">.
fr: La mise à jour d'un paquet existant peut devenir compliqué puisqu'il pourrait utiliser d'anciennes techniques. Veuillez vous en tenir aux cas d'empaquetage récent pour l'instant afin d'apprendre les bases. Des explications arriveront plus loin en <ref id="update">.
it: L'aggiornamento di un pacchetto già esistente può diventare complicato, perché è possibile che si siano usate vecchie tecniche di pacchettizzazione. Per adesso, è consigliabile, concentrarsi sulla creazione di nuovi pacchetti per imparare le basi. Si tornerà ad approfondire l'argomento più avanti su <ref id="update">.
ja: 既存のパッケージの更新は、古いテクニックが使われていたりして、やっかいな場合があります。基本を学習するために、今のところは新規パッケージの作成を続けてください。後ほど、<ref id="update"> で取り上げて説明します。
zh_cn: 更新一个已存在的软件包可能比较复杂，因为它可能使用旧的技术。请继续在这里学习最新的打包技术以便掌握必要的基本功。我们会在稍后的 <ref id="update"> 中回头讲解如何处理这种情况。
zh_tw: 更新一個已存在的套件可能比較複雜，因爲它可能使用舊的技術。請繼續在這裏學習最新的打包技術以便掌握必要的基本功。我們會在稍後的 <ref id="update"> 中回頭講解如何處理這種情況。

source: Modifying the source
ca: Modificar les fonts originals.
es: Modificar las fuentes
fr: Modification du code source
it: Modificare i sorgenti
ja: ソースコードの変更
zh_cn: 修改源代码
zh_tw: 修改原始碼

source: Please note that there isn't space here to go into <em>all</em> the details of fixing upstream sources, but here are some basic steps and problems people often run across.
ca: No hi ha espai en aquest document per explicar <em>tots</em> els detalls de les modificacions que poden haver de fer-se a les fonts originals. Tot i així, a continuació s'expliquen els problemes més freqüents.
es: Ten en cuenta que no hay espacio aquí para entrar en <em>todos</em> los detalles respecto a los cambios que deben hacerse en las fuentes originales. Sin embargo, a continuación se detallan algunos de los problemas más frecuentes.
fr: La place manque pour entrer dans <em>tous</em> les détails de modification des sources amont, mais voici quelques étapes fondamentales et problèmes qui reviennent souvent.
it: Non c'è spazio qui per approfondire <em>tutti</em> i dettagli su come modificare i sorgenti originali, ma verranno trattati alcuni passaggi fondamentali e le problematiche più comuni.
ja: 開発元のソースを修正する具体的なやり方について、<em>何から何まで</em>説明するにはとても紙面が足りませんが、よくあるパターンとしては大体以下のようなものでしょう。
zh_cn: 请注意这里没有足够的篇幅来描述修改上游源代码的 <em>全部</em> 细节，但是这里介绍了基本的步骤和常见的问题。
zh_tw: 請注意這裏沒有足夠的篇幅來描述修改上游原始碼的 <em>全部</em> 細節，但是這裏介紹了基本的步驟和常見的問題。

source: Set up <prgn>quilt</prgn>
ca: Fent servir <prgn>quilt</prgn>.
es: Configurar <prgn>quilt</prgn>
fr: Configuration de quilt
it: Configurare <prgn>quilt</prgn>
ja: <prgn>quilt</prgn> のセットアップ
zh_cn: 设置 <prgn>quilt</prgn>
zh_tw: 設置 <prgn>quilt</prgn>

source: The <prgn>quilt</prgn> program offers the basic method to record modification to the source for the Debian packaging. Since slightly different default is desirable for Debian packaging, let's set up <file>~/.quiltrc</file> as follows. <footnote><p>You can disable this configuration by starting the <prgn>quilt</prgn> command as "<tt>quilt --quiltrc /dev/null ...</tt>". </p></footnote>
ca: El programa <prgn>quilt</prgn> proporciona un mètode bàsic per aplicar i conservar les modificacions del codi font en la construcció de paquets Debian. Per empaquetar, és millor realitzar alguns canvis en la configuració predeterminada del programa <prgn>quilt</prgn>. Afegirem el següent a l'arxiu de configuració <file>~/.quiltrc</file> <footnote><p>Per executar el programa <prgn>quilt</prgn> deshabilitant la configuració cal afegir l'opció "<tt>quilt --quiltrc /dev/null ...</tt>". </p></footnote>.
es: El programa <prgn>quilt</prgn> ofrece un método básico para realizar y conservar las modificaciones del código fuente para construir paquetes Debian. Para empaquetar, es preferible realizar algunos cambios a la configuración predeterminada del programa, vamos a escribir lo siguiente en el archivo <file>~/.quiltrc</file><footnote><p>Para deshabilitar la configuración ejecute el programa <prgn>quilt</prgn> con la opción "<tt>quilt --quiltrc /dev/null ...</tt>". </p></footnote>.
fr: Le programme <prgn>quilt</prgn> fournit la méthode fondamentale pour enregistrer les modifications du code source pour l'empaquetage Debian. Puisque de légères modifications au paramétrage par défaut sont souhaitables pour l'empaquetage Debian, configurez <file>~/.quiltrc</file> comme suit : <footnote><p>Cette configuration peut-être désactivée en démarrant la commande <prgn>quilt</prgn> comme ceci : « <tt>quilt --quiltrc /dev/null ...</tt> ». </p></footnote>
ja: <prgn>quilt</prgn> プログラムはソースに対する Debian パッケージ向けの修正を記録する、基本的な方法です。Debian パッケージで使うには、多少デフォルトと違うのが望ましいので、以下のように <file>~/.quiltrc</file> を設定してください。<footnote><p>この設定を無効にするには、<prgn>quilt</prgn>コマンドを "<tt>quilt --quiltrc /dev/null ...</tt>" として実行すれば良いです。</p></footnote>
zh_cn: <prgn>quilt</prgn> 程序为 Debian 工作提供了对源码修改的基本记录方法。由于我们的需求与默认配置相当的不同，我们把 <file>~/.quiltrc</file> 设置成如下的样子。<footnote><p>你可以通过 <tt>quilt --quiltrc /dev/null ...</tt> 来运行 <prgn>quilt</prgn> 来禁用此配置文件。</p></footnote>
zh_tw: <prgn>quilt</prgn> 程式爲 Debian 工作提供了對源碼修改的基本記錄方法。由於我們的需求與默認設定相噹的不同，我們把 <file>~/.quiltrc</file> 設置成如下的樣子。<footnote><p>你可以通過 <tt>quilt --quiltrc /dev/null ...</tt> 來運行 <prgn>quilt</prgn> 來禁用此設定檔案。</p></footnote>

source: See <manref section="1" name="quilt"> and <file>/usr/share/doc/quilt/quilt.html</file> for how to use <prgn>quilt</prgn>.
ca: Consulta <manref section="1" name="quilt"> i <file>/usr/share/doc/quilt/quilt.html</file> per a fer servir <prgn>quilt</prgn>.
es: Véase <manref section="1" name="quilt"> y <file>/usr/share/doc/quilt/quilt.html</file> para utilizar <prgn>quilt</prgn>.
fr: Voir <manref section="1" name="quilt"> et <file>/usr/share/doc/quilt/quilt.html</file> pour apprendre à utiliser <prgn>quilt</prgn>.
it: Per l'utilizzo di <prgn>quilt</prgn> vedere <manref section="1" name="quilt"> e <file>/usr/share/doc/quilt/quilt.html</file>.
ja: <prgn>quilt</prgn> の使い方については、<manref section="1" name="quilt"> と <file>/usr/share/doc/quilt/quilt.html</file>を参照してください。
zh_cn: 参看 <manref section="1" name="quilt"> 和 <file>/usr/share/doc/quilt/quilt.html</file> 来了解如何使用 <prgn>quilt</prgn>。
zh_tw: 參考 <manref section="1" name="quilt"> 和 <file>/usr/share/doc/quilt/quilt.html</file> 來瞭解如何使用 <prgn>quilt</prgn>。

source: Fixing upstream bug
ca: Apedaçant el codi font.
es: Corregir un error en el código fuente
fr: Correction de bogue amont
it: Correggere i bug nel sorgente originale
ja: 開発元のバグを修正する
zh_cn: 修复上游 Bug
zh_tw: 修復上游 Bug

source: Let's assume you find an error in the upstream <file>Makefile</file> file as follows where "<tt>install: gentoo</tt>" should have been "<tt>install: gentoo-target</tt>".
ca: Suposem que has detectant la següent errada en el fitxer <file>Makefile</file> original: on posa «<tt>install: gentoo</tt>» hauria de posar «<tt>install: gentoo-target</tt>».
es: Vamos a suponer que has encontrado el siguiente error en el archivo <file>Makefile</file> original: donde pone «<tt>install: gentoo</tt>» debería poner «<tt>install: gentoo-target</tt>».
fr: Si vous trouvez une erreur dans le fichier <file>Makefile</file> amont comme suit, où « <tt>install: gentoo</tt> » aurait dû être « <tt>install: gentoo-target</tt> » :
it: Si supponga di trovare un errore, nel file <file>Makefile</file> distribuito con il programma originale, ad esempio la stringa "<tt>install: gentoo</tt>" avrebbe dovuto essere "<tt>install: gentoo-target</tt>".
ja: 開発元の <file>Makefile</file> にエラーを見つけて、"<tt>install: gentoo</tt>" の部分が "<tt>install: gentoo-target</tt>" となっているべきだったとします。
zh_cn: 让我们假设你在上游的 <file>Makefile</file> 文件中找到了一个错误，其中的 <tt>install: gentoo</tt> 应该是 <tt>install: gentoo-target</tt> 才正确。
zh_tw: 讓我們假設你在上游的 <file>Makefile</file> 檔案中找到了一個錯誤，其中的 <tt>install: gentoo</tt> 應該是 <tt>install: gentoo-target</tt> 才正確。

source: Let's fix this and record this with the <prgn>quilt</prgn> command as <file>fix-gentoo-target.patch</file>. <footnote><p>The <file>debian/patches</file> directory should exist now if you run <prgn>dh_make</prgn> as described before. This example operation creates it just in case you are updating the existing package.</p></footnote>
ca: Anem a adobar l'errada amb l'ordre <prgn>quilt</prgn> desant les modificacions a realitzar en el fitxer <file>fix-gentoo-target.patch</file> <footnote><p>L'anterior execució de <prgn>dh_make</prgn> hauria d'haver generat el directori <file>debian/patches</file>. En cas contrari o bé si estàs treballant en l'actualització d'un paquet, caldrà executar la primera ordre «mkdir debian/patches». </p></footnote>.
es: Vamos a arreglar este error con la orden <prgn>quilt</prgn> y conservar las modificaciones a realizar en el archivo <file>fix-gentoo-target.patch</file> <footnote><p>El directorio <file>debian/patches</file> debería haberse creado en la anterior ejecución de <prgn>dh_make</prgn>. Sólo debes generarlo si no existe o bien si estas actualizando un paquete.</p></footnote>.
fr: Corrigez l'erreur et enregistrez la modification avec la commande <prgn>quilt</prgn> sous <file>fix-gentoo-target.patch</file> : <footnote><p>Le répertoire <file>debian/patches</file> devrait maintenant exister si vous exécutez <prgn>dh_make</prgn> comme décrit auparavant. Cet exemple de manipulation le créé seulement si vous mettez à jour le paquet existant.</p></footnote>
it: Si può correggere questo errore e registrarlo, con il comando <prgn>quilt</prgn> utilizzando come file <file>fix-gentoo-target.patch</file>. <footnote><p>La directory <file>debian/patches</file> dovrebbe essere creata se si esegue <prgn>dh_make</prgn>, come descritto prima. Questo esempio crea la directory nel caso in cui si stia aggiornando un pacchetto esistente.</p></footnote>
ja: これを修正して、<prgn>quilt</prgn> コマンドを使って <file>fix-gentoo-target.patch</file> として登録しましょう。<footnote><p>前に説明したように <prgn>dh_make</prgn> を実行していれば、<file>debian/patches</file>ディレクトリはもう存在しているはずです。この操作例では、既存のパッケージを更新している場合に合わせて作成しています。</p></footnote>
zh_cn: 让我们使用 <prgn>quilt</prgn> 修复它，并把它命名为 <file>fix-gentoo-target.patch</file>。<footnote><p><file>debian/patches</file> 应当在你按照前面所述的步骤运行 <prgn>dh_make</prgn> 时生成的。这个例子中我们新创建它，因为假设的是在更新一个已存在的软件包。</p></footnote>
zh_tw: 讓我們使用 <prgn>quilt</prgn> 修復它，並把它命名爲 <file>fix-gentoo-target.patch</file>。<footnote><p><file>debian/patches</file> 應當在你按照前面所述的步驟運行 <prgn>dh_make</prgn> 時生成的。這個例子中我們新創建它，因爲假設的是在更新一個已存在的套件。</p></footnote>

source: You change the <file>Makefile</file> file as follows.
ca: Ara fes els canvis necessaris en el fitxer <file>Makefile</file> (amb un editor) original i deixa'l així:
es: Ahora cambia el archivo <file>Makefile</file> (con un editor) original como se muestra a continuación.
fr: Modifiez le fichier <file>Makefile</file> comme suit :
it: Si modifichi il file <file>Makefile</file> come segue.
ja: <file>Makefile</file> ファイルを次のように変更します。
zh_cn: 现在将 <file>Makefile</file> 修改为如下的样子。
zh_tw: 現在將 <file>Makefile</file> 修改爲如下的樣子。

source: Ask <prgn>quilt</prgn> to refresh the patch to create <file>debian/patches/fix-gentoo-target.patch</file> and add its description.
ca: A continuació executa <prgn>quilt</prgn> (com s'indica a l'exemple següent) per actualitzar el pedaç generant el fitxer <file>debian/patches/fix-gentoo-target.patch</file> i afegeix la descripció de la modificació realitzada.
es: A continuación ejecuta <prgn>quilt</prgn> para que actualice el parche creando el archivo <file>debian/patches/fix-gentoo-target.patch</file> y añade la descripción del parche.
fr: Demandez à <prgn>quilt</prgn> de créer <file>debian/patches/fix-gentoo-target.patch</file> et ajoutez sa description :
ja: パッチを更新して <file>debian/patches/fix-gentoo-target.patch</file> を作成するように <prgn>quilt</prgn> に要求し、それから説明を追記します。
zh_cn: 使用 <prgn>quilt</prgn> 刷新补丁以创建 <file>debian/patches/fix-gentoo-targe.patch</file> 并添加描述。
zh_tw: 使用 <prgn>quilt</prgn> 更新補丁以創建 <file>debian/patches/fix-gentoo-targe.patch</file> 並添加描述。

source: $ quilt refresh $ quilt header -e ... describe patch
ca: $ quilt refresh $ quilt header -e ... descriu la modificació<footnote>N. de t.: si es posa en marxa l'editor GNU «nano», recorda desar els canvis amb «Ctrl+O». Per tancar el programa, fes servir «Ctrl+X».</footnote>
es: $ quilt refresh $ quilt header -e ... describe el parche
fr: $ quilt refresh $ quilt header -e ... description du correctif
ja: $ quilt refresh $ quilt header -e ... パッチの詳細
zh_cn: $ quilt refresh $ quilt header -e ... 描述补丁
zh_tw: $ quilt refresh $ quilt header -e ... 描述補丁

source: Installation of files to the destination
ca: Instal·lació del programa.
es: Instalación del programa
fr: Installation des fichiers à leur emplacement
it: Installazione in una sotto-directory
ja: 指定した場所へファイルをインストールする
zh_cn: 把文件安装到目的位置
zh_tw: 把檔案安裝到目的位置

source: Normally, programs install themselves in the <file>/usr/local</file> subdirectory. Since it is reserved for system administrator's (or user's) private use, Debian packages must not use that directory but should use system directories such as the <file>/usr/bin</file> subdirectory following the Filesystem Hierarchy Standard (<url id="http://www.debian.org/doc/packaging-manuals/fhs/fhs-2.3.html" name="FHS">, <file>/usr/share/doc/debian-policy/fhs/fhs-2.3.html</file>).
ca: En general, els programes s'instal·len en el directori <file>/usr/local</file>. Però els paquets Debian no poden fer servir aquest directori d'ús privat de l'usuari administrador: les instal·lacions es fan en els directoris del sistema com és ara <file>/usr/bin</file> com estableix la normativa de jerarquia del sistema de fitxers («Filesystem Hierarchy Standard» <url id="http://www.debian.org/doc/packaging-manuals/fhs/fhs-2.3.html" name="FHS"> i <file>/usr/share/doc/debian-policy/fhs/fhs-2.3.html</file>).
es: Por lo general, los programas se instalan a sí mismos en el subdirectorio <file>/usr/local</file>. Pero los paquetes Debian no pueden utilizar este directorio ya que está reservado para el uso privado del administrador (o de los usuarios) sino que deben utilizar los directorios del sistema como <file>/usr/bin</file> según lo establecido por la normativa de jerarquía del sistema de archivos («Filesystem Hierarchy Standard» <url id="http://www.debian.org/doc/packaging-manuals/fhs/fhs-2.3.html" name="FHS">, <file>/usr/share/doc/debian-policy/fhs/fhs-2.3.html</file>).
fr: Normalement, les programmes s'installent d'eux-mêmes dans le sous-répertoire <file>/usr/local</file>. Puisqu'il est réservé à l'usage privé de l'administrateur système (ou de l'utilisateur), les paquets Debian ne doivent pas utiliser ce répertoire, mais devraient utiliser le sous-répertoire <file>/usr/bin</file> conformément à la norme de hiérarchie des fichiers (<url id="http://www.debian.org/doc/packaging-manuals/fhs/fhs-2.3.html" name="FHS">, <file>/usr/share/doc/debian-policy/fhs/fhs-2.3.html</file>).
it: Normalmente, i programmi si auto-installano in sottodirectory di <file>/usr/local</file>. I pacchetti Debian invece non devono usare quella directory, dal momento che è riservata agli amministratori (o utenti) del sistema per uso privato, ma dovrebbero usare le directory di sistema come la sottodirectory <file>/usr/bin</file>, conformi allo Standard di Gerarchia dei Filesystem (<url id="http://www.debian.org/doc/packaging-manuals/fhs/fhs-2.3.html" name="FHS">, <file>/usr/share/doc/debian-policy/fhs/fhs-2.3.html</file>).
ja: 通常、プログラムは自分自身を <file>/usr/local</file> サブディレクトリにインストールします。システム管理者 (もしくはユーザ) の個人用に予約されているため、Debian パッケージではそのディレクトリを使わず、Filesystem Hierarchy Standard (<url id="http://www.debian.org/doc/packaging-manuals/fhs/fhs-2.3.html" name="FHS">、<file>/usr/share/doc/debian-policy/fhs/fhs-2.3.html</file>) に従って <file>/usr/bin/</file> サブディレクトリのようなシステムディレクトリを使わなくてはなりません。
zh_cn: 正常情况下，程序将其本身安装在 <file>/usr/local</file>。因为它是保留给系统管理员(或用户)的私有位置，Debian 软件包不可以使用该目录，而是按照文件系统层级标准(<url id="http://www.debian.org/doc/packaging-manuals/fhs/fhs-2.3.html" name="FHS">，<file>/usr/share/doc/debian-policy/fhs/fhs-2.3.html</file>)使用如 <file>/usr/bin</file> 等目录。
zh_tw: 正常情況下，程式將其本身安裝在 <file>/usr/local</file>。因爲它是保留給系統管理員(或用戶)的私有位置，Debian 套件不可以使用該目錄，而是按照檔案系統層級標準(<url id="http://www.debian.org/doc/packaging-manuals/fhs/fhs-2.3.html" name="FHS">，<file>/usr/share/doc/debian-policy/fhs/fhs-2.3.html</file>)使用如 <file>/usr/bin</file> 等目錄。

source: Normally, <manref section="1" name="make"> is used to automate building the program and the execution of "<tt>make install</tt>" installs programs directly to the desired destination by the <tt>install</tt> target of the <file>Makefile</file> file. In order for Debian to provide binary packages, the build system installs programs to the file tree image created under a temporary directory instead to the actual destination.
ca: És freqüent fer servir l'ordre <manref section="1" name="make"> per a la construcció (compilació) automatitzada del programa i l'execució de l'ordre <tt>make install</tt> instal·la directament el programa en el directori desitjat executant la secció <tt>install</tt> del fitxer <file>Makefile</file>. En la construcció dels paquets binaris de Debian, el sistema de construcció simula la instal·lació del programa en una reconstrucció de l'estructura de directoris del programa en un directori temporal en lloc de fer-ho en la destinació real.
es: Es frecuente la utilización de <manref section="1" name="make"> para la construcción automatizada del programa y la ejecución de la orden "<tt>make install</tt>" instala directamente el programa en la ubicación deseada ejecutando la sección <tt>install</tt> del archivo <file>Makefile</file>. En la construcción de los paquetes binarios de Debian, el sistema de construcción instala los programas en una reconstrucción de la estructura de directorios del programa en un directorio temporal en lugar de hacerlo en su destino real.
fr: Habituellement, <manref section="1" name="make"> est utilisé pour automatiser la construction du programme et l'exécution de « <tt>make install</tt> » installe les programmes directement à l'endroit voulu par la cible <tt>install</tt> du fichier <file>Makefile</file>. Pour permettre à Debian de fournir des paquets binaires, le système de construction installe les programmes dans l'image de l'arborescence de fichiers créé dans un répertoire temporaire plutôt que dans la destination réelle.
it: Normalmente, <manref section="1" name="make"> è usato per costruire automaticamente il programma, invece l'esecuzione di "<tt>make install</tt>" installa il programma direttamente nella destinazione prestabilita. Questa è configurata nella sezione <tt>install</tt> del file <file>Makefile</file>. Per far in modo che Debian fornisca dei pacchetti binari, il sistema di compilazione installa i programmi in un'immagine dell'albero dei file, creata dentro una directory temporanea, anziché nella destinazione prestabilita.
ja: プログラムのビルドを自動化するには、通常 <manref section="1" name="make"> が使われており、<tt>make install</tt> を実行すると、<file>Makefile</file> の<tt>install</tt> ターゲットによって希望する場所へ直接インストールされます。Debian でバイナリパッケージを提供するために、ビルドシステムは実際のインストール先のかわりに、一時ディレクトリの下に作成されたファイルツリーのイメージへプログラムをインストールします。
zh_cn: 通常在自动编译程序时使用 <manref section="1" name="make"> 程序，执行 <tt>make install</tt> 就把程序直接按照 <file>Makefile</file> 文件中的 <tt>install</tt> target 安装到指定的位置。为了使 Debian 能够提供二进制软件包，编译系统将文件安装到一个临时目录中创建的文件系统树的镜像中，而非直接安装到实际的目标位置。
zh_tw: 通常在自動編譯程式時使用 <manref section="1" name="make"> 程式，執行 <tt>make install</tt> 就把程式直接按照 <file>Makefile</file> 檔案中的 <tt>install</tt> target 安裝到指定的位置。爲了使 Debian 能夠提供二進位套件，編譯系統將檔案安裝到一個臨時目錄中創建的檔案系統樹的鏡像中，而非直接安裝到實際的目標位置。

source: These 2 differences between (1) the normal program installation and (2) the Debian packaging can be transparently addressed by the <package>debhelper</package> package through the <prgn>dh_auto_configure</prgn> and <prgn>dh_auto_install</prgn> commands if the following conditions are met.
ca: Aquestes diferències entre (1) la instal·lació del programa i (2) la «simulació» d'instal·lació en el procés d'empaquetament Debian, és gestionada de manera transparent pel paquet <package>debhelper</package> amb les ordres <prgn>dh_auto_configure</prgn> i <prgn>dh_auto_install</prgn> si es compleixen els següents requisits:
es: Estas dos diferencias entre (1) la instalación del programa y (2) la «simulación» de instalación en el empaquetamiento Debian las maneja de forma transparente el paquete <package>debhelper</package> con las órdenes <prgn>dh_auto_configure</prgn> y <prgn>dh_auto_install</prgn> siempre que se cumplan los requisitos indicados a continuación.
fr: Ces deux différences entre (1) l'installation normale du programme et (2) l'empaquetage Debian peuvent être abordées de façon transparente par le paquet <package>debhelper</package> à l'aide des commandes <prgn>dh_auto_configure</prgn> et <prgn>dh_auto_install</prgn> si les conditions suivantes sont vérifiées :
it: Le 2 differenze tra (1) la normale installazione di un programma e (2) l'installazione tramite il sistema di pacchettizzazione Debian può essere affrontato in modo trasparente dal pacchetto <package>debhelper</package>, attraverso i comandi <prgn>dh_auto_configure</prgn> e <prgn>dh_auto_install</prgn>, se le seguenti condizioni sono soddisfatte.
ja: (1) 普通のプログラムインストールと、(2) Debian パッケージ作成のこれら二つの違いは、次の条件を満たす場合には、<package>debhelper</package> パッケージが <prgn>dh_auto_configure</prgn> と <prgn>dh_auto_install</prgn> のコマンドを使ってあまり意識せずに対応することができます。
zh_cn: 普通程序安装过程和 Debian 打包安装过程的区别可以由 <package>debhelper</package> 软件包中的 <prgn>dh_auto_configure</prgn> 和 <prgn>dh_auto_install</prgn> 透明地处理。但程序必须满足以下条件：
zh_tw: 普通程式安裝過程和 Debian 打包安裝過程的區別可以由 <package>debhelper</package> 套件中的 <prgn>dh_auto_configure</prgn> 和 <prgn>dh_auto_install</prgn> 透明地處理。但程式必須滿足以下條件：
