Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: <package>gnu-standards</package> - this package contains two pieces of documentation from the GNU project: <url id="http://www.gnu.org/prep/standards/html_node/index.html" name="GNU Coding Standards">, and <url id="http://www.gnu.org/prep/maintain/html_node/index.html" name="Information for Maintainers of GNU Software">. Although Debian does not require these to be followed, these are still helpful as guidelines and common sense. (see <file>/usr/share/doc/gnu-standards/standards.html</file> and <file>/usr/share/doc/gnu-standards/maintain.html</file>).
ca: <package>gnu-standards</package> - aquest paquet proporciona dos documentes del projecte GNU: <url id="http://www.gnu.org/prep/standards/html_node/index.html" name="«GNU Coding Standards»">, i <url id="http://www.gnu.org/prep/maintain/html_node/index.html" name="«Information for Maintainers of GNU Software»">. Encara que no són d'aplicació obligada a Debian, són útils com a orientació (llegeix <file>/usr/share/doc/gnu-standards/standards.html</file> i <file>/usr/share/doc/gnu-standards/maintain.html</file>).
es: <package>gnu-standards</package> - este paquete contiene dos documentos del proyecto GNU: <url id="http://www.gnu.org/prep/standards/html_node/index.html" name="«GNU Coding Standards»">, y <url id="http://www.gnu.org/prep/maintain/html_node/index.html" name="«Information for Maintainers of GNU Software»">. Aunque no se exige su cumplimiento en Debian, son útiles como orientación y sentido común (véase <file>/usr/share/doc/gnu-standards/standards.html</file> y <file>/usr/share/doc/gnu-standards/maintain.html</file>).
fr: <package>gnu-standards</package> &mdash; ce paquet contient deux documentations issues du projet GNU : les <url id="http://www.gnu.org/prep/standards/html_node/index.html" name="normes GNU de codage">, et les <url id="http://www.gnu.org/prep/maintain/html_node/index.html" name="informations pour les responsables de programme GNU">. Bien que Debian n'exige pas que ces recommandations soient suivies, elles sont néanmoins utiles en tant que lignes directrices et bon sens. (voir <file>/usr/share/doc/gnu-standards/standards.html</file> et <file>/usr/share/doc/gnu-standards/maintain.html</file>).
it: <package>gnu-standards</package> - questo pacchetto contiene due documenti provenienti dal progetto GNU: <url id="http://www.gnu.org/prep/standards/html_node/index.html" name="GNU Coding Standards">, and <url id="http://www.gnu.org/prep/maintain/html_node/index.html" name="Information for Maintainers of GNU Software">. Nonostante Debian non necessiti del loro utilizzo, sono comunque utili come linee guida e buona prassi. (vedere <file>/usr/share/doc/gnu-standards/standards.html</file> e <file>/usr/share/doc/gnu-standards/maintain.html</file>).
ja: <package>gnu-standards</package> - このパッケージには、GNU プロジェクトからの文書が 2 つ含まれています。<url id="http://www.gnu.org/prep/standards/html_node/index.html" name="GNU コーディング標準">と、<url id="http://www.gnu.org/prep/maintain/html_node/index.html" name="GNU ソフトウェアのメンテナ向け情報">です。Debian ではこれらに従うことは求められませんが、ガイドラインまたは常識としても有用です。(詳しくは <file>/usr/share/doc/gnu-standards/standards.html</file> と <file>/usr/share/doc/gnu-standards/maintain.html</file>参照)
zh_cn: <package>gnu-standards</package> - 此软件包包含了 GNU 项目中的两篇文档： <url id="http://www.gnu.org/prep/standards/html_node/index.html" name="GNU Coding Standards"> 和 <url id="http://www.gnu.org/prep/maintain/html_node/index.html" name="Information for Maintainers of GNU Software">。尽管 Debian 不要求遵守这些规范，它们仍然很有帮助。(参看 <file>/usr/share/doc/gnu-standards/standards.html</file> 和 <file>/usr/share/doc/gnu-standards/maintain.html</file>)
zh_tw: <package>gnu-standards</package> - 此套件包含了 GNU 項目中的兩篇文件： <url id="http://www.gnu.org/prep/standards/html_node/index.html" name="GNU Coding Standards"> 和 <url id="http://www.gnu.org/prep/maintain/html_node/index.html" name="Information for Maintainers of GNU Software">。儘管 Debian 不要求遵守這些規範，它們仍然很有幫助。(參考 <file>/usr/share/doc/gnu-standards/standards.html</file> 和 <file>/usr/share/doc/gnu-standards/maintain.html</file>)

source: If this document contradicts with what the Debian Policy Manual and Debian Developer's Reference describes, they are correct. Please file a bug report on the <package>maint-guide</package> package.
ca: Si aquest document és contradictori amb algun aspecte del «Debian Policy Manual» o «Debian Developer's Reference», serà d'aplicació l'establert per aquest darrers. En aquest cas, si us plau comunica l'error del paquet <package>maint-guide</package>.
es: Si este documento contradice en algún aspecto al «Debian Policy Manual» o al «Debian Developer's Reference», prevalecen estos últimos. Por favor, envíe un informe de error del paquete <package>maint-guide</package>.
fr: Si ce document entre en contradiction avec ce qui est décrit dans la Charte Debian ou la référence du développeur, elles sont prioritaires. Veuillez signaler un bogue sur le paquet <package>maint-guide</package>.
it: Se questo documento contraddice quanto scritto nel manuale delle policy Debian e nella guida di riferimento per gli sviluppatori Debian, si considerino corrette quest'ultime. Si prega di inviare una segnalazione di bug relativa al pacchetto <package>maint-guide</package>.
ja: この文書が、Debian ポリシーマニュアルや Debian 開発者リファレンスの記述と矛盾している場合は、そちらが正解です。<package>maint-guide</package> パッケージにバグレポートをしてください。
zh_cn: 若本文档所叙述的内容与 Debian Policy Manual 或 Debian Developer's Reference 有不符，则按照后两者的要求进行，并向 <package>maint-guide</package> 软件包提交 Bug 报告。
zh_tw: 若本文件所敘述的內容與 Debian Policy Manual 或 Debian Developer's Reference 有不符，則按照後兩者的要求進行，並向 <package>maint-guide</package> 套件提交 Bug 報告。

source: The short descriptions that are given above only serve to introduce you to what each package does. Before continuing please thoroughly read the documentation of each program, at least, for the standard usage. It may seem like heavy going now, but later on you'll be <em>very</em> glad you read it.
ca: Les descripcions anteriors només són un resum de la funcionalitat de cada paquet. Abans de continuar, si us plau, llegeix la documentació de cada programa, al menys pel que fa a la seva funcionalitat bàsica. Pot semblar una mica pesat, però et farà <em>molt profit</em> aquesta lectura.
es: Las breves descripciones dadas anteriormente sólo sirven para introducirte a lo que hace cada paquete. Antes de continuar, por favor, lee la documentación de cada programa, al menos para su uso normal. Puede parecerte algo duro ahora, pero más adelante estarás <em>muy</em> contento de haberla leído.
fr: Les courtes descriptions données ci-dessus ne servent que d'introduction à ce que fait chaque paquet. Avant de continuer, veuillez lire attentivement la documentation de chaque programme, au moins l'utilisation standard. Cela peut vous sembler fastidieux maintenant, mais plus tard vous serez <em>très</em> content de l'avoir fait.
it: Le brevi note elencate qui sopra servono solo ad accennare lo scopo di ogni pacchetto. Prima di continuare, è opportuno leggere in modo approfondito la documentazione di ogni programma, almeno per un utilizzo di base. Può sembrare molto pesante farlo adesso, ma in seguito ci si renderà conto che sarà stato <em>utilissimo</em>.
ja: 上記の簡単な説明は、それぞれのパッケージが何をするのか紹介するだけのものです。先に進む前にどうかそれぞれのプログラムに付属の文書を徹底的に熟読し、標準的な使い方だけでも理解しておいてください。きついと思われるかも知れませんが、あとになればきっと <em>読んでてよかったなあ</em> と思うことでしょう。
zh_cn: 以上给出的简短描述仅仅是为了使你对这些软件包有一个基本的印象。在继续前请详细阅读每个程序的文档，至少了解其一般的用途和用法。现在看来这是一项耗时巨大的任务，但在接下来的工作中你将为你阅读了它们而感觉到 <em>非常</em> 愉快。
zh_tw: 以上給出的簡短描述僅僅是爲了使你對這些套件有一個基本的印象。在繼續前請詳細閱讀每個程式的文件，至少瞭解其一般的用途和用法。現在看來這是一項耗時巨大的任務，但在接下來的工作中你將爲你閱讀了它們而感覺到 <em>非常</em> 愉快。

source: Basic terminology
ca: Terminologia bàsica.
es: Terminología básica
fr: Terminologie fondamentale
it: Terminologia di base
ja: 基本的な用語
zh_cn: 基本术语
zh_tw: 基本術語

source: There are two types of packages.
ca: Hi ha dos tipus de paquets.
es: Hay dos tipos de paquetes.
fr: Deux sortes de paquets existent :
it: Ci sono due tipi di pacchetti.
ja: パッケージには 2 種類あります。
zh_cn: 一共有两种类型的软件包。
zh_tw: 一共有兩種類型的套件。

source: <strong>source package</strong>: A source package is a set of files which contain code and data which you can compile and process into execution programs and formatted documents. It usually comes as a combination of <file>*.orig.tar.gz</file>, <file>*.debian.tar.gz</file> (or <file>*.diff.gz</file>), and <file>*.dsc</file>. Some other archive and compression methods may be used, too.
ca: <strong>paquet de codi original</strong>: un paquet de codi original («source package») proporciona els fitxers de codi original i dades que es poden compilar i processar per construir programes executables o documentes amb format. En general, un paquet és un conjunt de fitxers amb extensió <file>*.orig.tar.gz</file>, <file>*.debian.tar.gz</file> (o <file>*.diff.gz</file>) i <file>*.dsc</file>. També hi pot haver altres formats d'arxiu i/o formats de compressió.
es: <strong>paquete fuente</strong>: un paquete de fuentes es un conjunto de archivos de código y datos que se pueden compilar y procesar obteniéndose programas ejecutables o documentos formateados. El paquete está formado por archivos con extensión <file>*.orig.tar.gz</file>, <file>*.debian.tar.gz</file> (o <file>*.diff.gz</file>), y <file>*.dsc</file>. También pueden estar formados por otros tipos de archivos y/o formatos de compresión.
fr: <strong>paquet source</strong> : un paquet source est un ensemble de fichiers contenant le code et les données à compiler et transformer en programmes exécutables et documents formatés. Il est généralement distribué sous forme d'une association des fichiers <file>*.orig.tar.gz</file>, <file>*.debian.tar.gz</file> (ou <file>*.diff.gz</file>), et <file>*.dsc</file>. D'autres archives et formats de compression peuvent également être utilisés ;
it: <strong>pacchetto sorgente</strong>: Un pacchetto sorgente è composto da una serie di file che contengono codice sorgente e dati, che possono essere compilati ed elaborati per diventare programmi e documenti formattati. Di solito viene distribuito in una combinazione di <file>*.orig.tar.gz</file>, <file>*.debian.tar.gz</file> (oppure <file>*.diff.gz</file>), e <file>*.dsc</file>. Possono essere utilizzati anche altri tipi di archivio e metodi di compressione.
ja: <strong>ソースパッケージ</strong>: ソースパッケージはいくつかのファイルからなっていて、コンパイルすることで実行プログラムや整形した文書に処理できるコードとデータを含んでいます。通常は、<file>*.orig.tar.gz</file> と、<file>*.debian.tar.gz</file> (あるいは <file>*.diff.gz</file>)、それから <file>*.dsc</file>の組み合わせです。他のアーカイブ方法や圧縮方法が使われる場合もあります。
zh_cn: <strong>源代码包</strong>：源代码包包含了代码和数据，可以编译成为可执行的程序和格式化的文档。它通常是以 <file>*.orig.tar.gz</file>、<file>*.debian.tar.gz</file> (或 <file>*.diff.gz</file>) 和 <file>*.dsc</file> 的组合形式出现的。也可能使用一些其他的格式和压缩方法。
zh_tw: <strong>原始碼包</strong>：原始碼包包含了程式碼和數據，可以編譯成爲可執行的程式和格式化的文件。它通常是以 <file>*.orig.tar.gz</file>、<file>*.debian.tar.gz</file> (或 <file>*.diff.gz</file>) 和 <file>*.dsc</file> 的組合形式出現的。也可能使用一些其他的格式和壓縮方法。

source: <strong>binary package</strong>: A binary package contains execution programs and formatted documents. It usually comes as <file>*.deb</file> for the normal Debian system and as <file>*.udeb</file> for the Debian Installer.
ca: <strong>paquets binaris</strong>: un paquet binari proporciona directament fitxers executables (ja compilats) i documents amb format. Generalment són fitxers d'extensió <file>*.deb</file> per fer servir en sistemes Debian i fitxers <file>*.udeb</file> per fer servir en el programa instal·lador de Debian.
es: <strong>paquetes binarios</strong>: un paquete binario contiene archivos ejecutables (ya compilados) y documentos formateados. Generalmente están formados por archivos con extensión <file>*.deb</file> de uso en instalaciones de Debian y archivos <file>*.udeb</file> para el instalador de Debian.
fr: <strong>paquet binaire</strong> : un paquet binaire contient les programmes exécutables et documents formatés. Il est généralement distribué sous la forme d'un fichier <file>*.deb</file> pour le système Debian normal et <file>*.udeb</file> pour l'installateur Debian.
it: <strong>pacchetto binario</strong>: Un pacchetto binario contiene il programma già compilato e la documentazione formattata. Di solito viene distribuito come <file>*.deb</file> per i normali pacchetti Debian, e come <file>*.udeb</file> per quelli del Debian Installer.
ja: <strong>バイナリパッケージ</strong>: バイナリパッケージには、実行プログラムと整形された文書が含まれています。通常は、一般的な Debian システム用には <file>*.deb</file>、Debian インストーラ向けには <file>*.udeb</file> という形になっています。
zh_cn: <strong>二进制包</strong>：二进制包包含了可执行的程序和格式化的文档。它通常是以 <file>*.deb</file> 文件的形式提供给普通 Debian 系统，以及 <file>*.udeb</file> 文件形式提供给 Debian 安装程序。
zh_tw: <strong>二進位套件</strong>：二進位套件包含了可執行的程式和格式化的文件。它通常是以 <file>*.deb</file> 檔案的形式提供給普通 Debian 系統，以及 <file>*.udeb</file> 檔案形式提供給 Debian 安裝程式。

source: Don't mix terms like source of the program and the source package of the program!
ca: Cal no confondre les expressions «codi original d'un programa» i «paquet original d'un programa».
es: ¡No confundas los términos «fuentes de un programa» y «paquete fuente de un programa»!
fr: Ne mélangez pas les termes comme source du programme et paquet source du programme !
it: Attenzione a non confondere termini come: sorgente di un programma e pacchetto sorgente del programma!
ja: プログラムのソースとプログラムのソースパッケージ、のような用語を混同しないようにしてください！
zh_cn: 不要混淆程序源代码和程序的源代码包这样相似但有区别的概念！
zh_tw: 不要混淆程式原始碼和程式的原始碼包這樣相似但有區別的概念！

source: There are several role names used around Debian.
ca: En el desenvolupament i manteniment de Debian, es fan servir les següents expressions per ﻿referir-se a les persones implicades en la construcció i manteniment dels programes i paquets:
es: Se utilizan distintos nombres para referirse a los roles dentro de Debian.
fr: Plusieurs noms de rôle sont utilisés au sein de Debian :
it: Nel mondo Debian sono previsti diversi ruoli.
ja: Debian 界隈で使われる役割名がいくつかあります。
zh_cn: 在 Debian 社区中有几个常见的角色。
zh_tw: 在 Debian 社群中有幾個常見的角色。

source: <strong>upstream author</strong>: The person who made the original program.
ca: <strong>autor original</strong> («upstream author»): és la persona que ha escrit el codi original del programa (o l'original del document en el cas de paquets de documentació).
es: <strong>autor original</strong> («upstream author»): para referirse a la persona que ha escrito el código original del programa (o la documentación original en el caso de paquetes de documentación).
fr: <strong>auteur amont</strong> : la personne qui a créé le programme à l'origine ;
it: <strong>autore originale (upstream author)</strong>: La persona che ha iniziato lo sviluppo del programma.
ja: <strong>upstream author (開発元の作者)</strong>: 元のプログラムを作った人です。
zh_cn: <strong>上游作者(upstream author)</strong>：程序的最原始作者。
zh_tw: <strong>上游作者(upstream author)</strong>：程式的最原始作者。

source: <strong>upstream maintainer</strong>: The person who currently maintains the program.
ca: <strong>desenvolupador original</strong> («upstream maintainer»): la persona actualment responsable del manteniment del codi original.
es: <strong>desarrollador original</strong> («upstream maintainer»): la persona que se encarga de mantener el programa (el código fuente) en la actualidad.
fr: <strong>responsable amont</strong> : la personne qui maintient actuellement le programme ;
it: <strong>responsabile del programma (upstream maintainer)</strong>: La persona che attualmente sviluppa il programma.
ja: <strong>upstream maintainer (開発元のメンテナ)</strong>: 現在プログラムをメンテナンスしている人です。
zh_cn: <strong>上游维护者(upstream maintainer)</strong>：目前在上游维护程序代码的人。
zh_tw: <strong>上游維護者(upstream maintainer)</strong>：目前在上游維護程式程式碼的人。

source: <strong>maintainer</strong>: The person who makes Debian package of the program.
ca: <strong>empaquetador (desenvolupador) </strong> («maintainer»): la persona encarregada de la construcció i actualització dels paquets per a Debian.
es: <strong>empaquetador (desarrollador)</strong> («maintainer»): la persona que se encarga de construir y mantener actualizados paquetes para Debian <footnote>N. del t.: hay una cierta ambigüedad en la traducción de «maintainer» por desarrollador puesto que se puede confundir con la traducción de «Debian Developer», desarrollador que pertenece al proyecto, y de «upstream maintainer», desarrollador del programa original</footnote>.
fr: <strong>responsable</strong> : la personne qui maintient le paquet Debian du programme ;
it: <strong>responsabile del pacchetto (maintainer)</strong>: La persona che ha creato il pacchetto Debian del programma.
ja: <strong>maintainer (メンテナ)</strong>: プログラムの Debian パッケージを作成している人です。
zh_cn: <strong>维护者(maintainer)</strong>：制作该程序的 Debian 软件包的人。
zh_tw: <strong>維護者(maintainer)</strong>：製作該程式的 Debian 套件的人。

source: <strong>sponsor</strong>: The person who helps maintainers to upload packages to the official Debian Package Archive after checking their contents.
ca: <strong>patrocinador</strong> («sponsor»): la persona (cal que sigui un DD o DM) que transfereix els paquets construïts pels desenvolupadors al repositori de Debian després de comprovar que el paquet s'ajusta a las normes de Debian.
es: <strong>patrocinador</strong> («sponsor»): la persona (que debe ser un DD o DM, véase más adelante) que transfiere los paquetes elaborados por el desarrollador al archivo de paquetes de Debian (al repositorio de Debian) después de comprobar que el paquete cumple los requisitos exigidos.
fr: <strong>parrain</strong> : la personne qui aide les responsables à envoyer des paquets dans l'archive officielle de paquets Debian après en avoir vérifié le contenu ;
it: <strong>sponsor</strong>: La persona che aiuta i responsabili dei pacchetti a verificarne la correttezza dei contenuti e a depositarli nell'archivio Debian ufficiale.
ja: <strong>sponsor (スポンサー)</strong>: メンテナのパッケージを、内容をチェックした後で公式 Debian パッケージアーカイブにアップロードするのを手伝う人です。
zh_cn: <strong>保证人(sponsor)</strong>：检查内容后帮助维护者上传软件包到 Debian 官方仓库的人。
zh_tw: <strong>保證人(sponsor)</strong>：檢查內容後幫助維護者上傳套件到 Debian 官方倉庫的人。

source: <strong>mentor</strong>: The person who helps novice maintainers on packaging etc.
ca: <strong>mentor</strong>: la persona que ajuda als desenvolupadors principiants a iniciar-se en la construcció i manteniment del paquet.
es: <strong>mentor</strong>: la persona que ayuda a los desarrolladores principiantes a iniciarse en la construcción y mantenimiento de paquetes.
fr: <strong>mentor</strong> : la personne qui aide les responsables débutants pour l'empaquetage, etc.
it: <strong>mentore</strong>: La persona che aiuta i responsabili dei pacchetti alle prime armi nelle operazioni di creazione del pacchetto, ecc.
ja: <strong>mentor (指導役)</strong>: 新米メンテナがパッケージを作成したりするのを手助けする人です。
zh_cn: <strong>指导者(mentor)</strong>：帮助维护者熟悉和深入打包的人。
zh_tw: <strong>指導者(mentor)</strong>：幫助維護者熟悉和深入打包的人。

source: <strong>Debian Developer</strong> (DD): The person who is a member of Debian. He has full upload right to the official Debian Package Archive.
ca: <strong>desenvolupador de Debian (DD)</strong> («Debian Developer»): la persona que es membre de Debian. Té autorització (sense limitacions) per transferir paquets al repositori oficial de Debian.
es: <strong>desarrollador de Debian (DD)</strong> («Debian Developer»): la persona que es miembro de Debian. Tiene permiso total para transferir paquetes al repositorio oficial de Debian.
fr: <strong>développeur Debian</strong> (DD) : la personne qui est membre de Debian. Elle a tout les droits d'envoi vers l'archive officielle de paquets Debian ;
it: <strong>sviluppatore Debian (Debian Developer)</strong> (DD): membro del progetto Debian. Questa persona ha la possibilità di depositare i pacchetti all'interno dell'archivio Debian ufficiale.
ja: <strong>Debian Developer (Debian 開発者)</strong> (DD): Debian のメンバーです。公式 Debian パッケージアーカイブへのアップロード権限を全てもっています。
zh_cn: <strong>Debian Developer</strong> (DD)：Debian 社区的官方成员。DD 拥有向 Debian 官方仓库上传的全部权限。
zh_tw: <strong>Debian Developer</strong> (DD)：Debian 社群的官方成員。DD 擁有向 Debian 官方倉庫上傳的全部權限。

source: <strong>Debian Maintainer</strong> (DM): The person who has limited upload right to the official Debian Package Archive.
ca: <strong>empaquetador/responsable de Debian (DM)</strong>(«Debian Maintainer»): la persona amb autorització limitada per transferir paquets al repositori oficial de Debian.
es: <strong>Empaquetador de Debian (DM)</strong>(«Debian Maintainer»): la persona que tiene permiso limitado para transferir paquetes al repositorio oficial de Debian.
fr: <strong>responsable Debian</strong> (DM) : la personne qui a des droits d'envoi limités vers l'archive officielle de paquets Debian.
it: <strong>responsabile Debian (Debian Maintainer)</strong> (DM): Questa persona con diritti limitati di accesso all'archivio ufficiale dei pacchetti di Debian.
ja: <strong>Debian Maintainer (Debian メンテナ)</strong> (DM): 公式 Debian パッケージアーカイブへのアップロード権限を限定的にもっている人です。
zh_cn: <strong>Debian Maintainer</strong> (DM)：拥有对 Debian 官方仓库部分上传权限的人。
zh_tw: <strong>Debian Maintainer</strong> (DM)：擁有對 Debian 官方倉庫部分上傳權限的人。

source: There are several version names used around Debian.
ca: Per fer referència a les versions del codi original i dels paquets, es fan servir les següents expressions a Debian:
es: Dentro de Debian se utiliza la siguiente terminología para referirse a las distintas versiones:
fr: Plusieurs noms de version sont utilisés dans Debian :
it: Ci sono molti nomi di versione utilizzati in Debian.
ja: Debian 界隈では、いくつかのバージョン名が使われます。
zh_cn: Debian 中使用了几种不同的版本号。
zh_tw: Debian 中使用了幾種不同的版本號。

source: <strong>upstream source version</strong>: The upstream source version is referred as <tt><var>version</var></tt>.
ca: <strong>versió del codi original</strong> («upstream source version»): es fa servir l'expressió <tt><var>versió</var></tt>.
es: <strong>versión de las fuentes originales</strong> («upstream source version»): se utiliza el término <tt><var>versión</var></tt>.
fr: <strong>version source amont</strong> : soit la version source amont <tt><var>version</var></tt> ;
it: <strong>versione originale del sorgente (upstream source version)</strong>: La versione originale del sorgente è indicata con <tt><var>version</var></tt>.
ja: <strong>上流ソースのバージョン</strong>: 上流ソースのバージョンは、<tt><var>version</var></tt> と呼ばれます。
zh_cn: <strong>上游源代码版本</strong>：上游源代码版本被指代为 <tt><var>version</var></tt>。
zh_tw: <strong>上游原始碼版本</strong>：上游原始碼版本被指代爲 <tt><var>version</var></tt>。

source: <strong>Debian revision</strong>: The revision by Debian on package is referred as <tt><var>revision</var></tt>.
ca: <strong>revisió Debian</strong> («Debian revision»): es fa servir l'expressió <tt><var>revisió</var></tt>.
es: <strong>revisión Debian</strong> («Debian revision»): para la revisión del paquete Debian se utiliza el término <tt><var>revisión</var></tt>.
fr: <strong>révision Debian</strong> : soit la révision par Debian d'un paquet <tt><var>revision</var></tt> ;
it: <strong>Revisione Debian (Debian revision)</strong>: La revisione di Debian del pacchetto è indicata con <tt><var>revision</var></tt>.
ja: <strong>Debian リビジョン</strong>: Debian がつけるパッケージのリビジョンは、<tt><var>revision</var></tt>と呼ばれます。
zh_cn: <strong>Debian 版本</strong>：Debian 软件包的版本被指代为 <tt><var>revision</var></tt>。
zh_tw: <strong>Debian 版本</strong>：Debian 套件的版本被指代爲 <tt><var>revision</var></tt>。
