Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: For source packages which have some binary packages with "<tt>Architecture: any</tt>", they are rebuild by the autobuilder. Since this autobuilder procedure runs "<tt>debian/rules build</tt>" in it while installing only packages listed in the <tt>Build-Depends</tt> field (see <ref id="autobuilder">), the <tt>Build-Depends</tt> field needs to list practically all the required packages and the <tt>Build-Depends-indep</tt> is rarely used.
ca: Els paquets de fonts amb més d'un binari amb el camp "<tt>Architecture: any</tt>" fan servir «autobuilder». Des de que el procediment «autobuilder» executa l'objectiu "<tt>debian/rules build</tt>", que s'encarrega d'instal·lar els paquets llistats en el camp <tt>Build-Depends</tt> (consulta <ref id="autobuilder">), el camp <tt>Build-Depends</tt> normalment llista tots els paquets necessaris i per això, el camp <tt>Build-Depends-indep</tt> es fa servir poc.
es: Los paquetes de fuentes que incluyen varios paquetes binarios con el campo "<tt>Architecture: any</tt>" se construyen con «autobuilder». Desde el procedimiento «autobuilder» se ejecuta el objetivo "<tt>debian/rules build</tt>" el cual, a su vez, instala los paquetes listados en el campo <tt>Build-Depends</tt> (véase <ref id="autobuilder">), que habitualmente son todos los necesarios de forma que el campo <tt>Build-Depends-indep</tt> se usa raramente.
fr: les paquets sources de certains paquets binaires avec « <tt>Architecture: any</tt> » sont reconstruits par les empaqueteurs automatiques (« autobuilder »). Puisque la procédure des serveurs d'empaquetage automatique exécute « <tt>debian/rules build</tt> » en installant seulement les paquets indiqués dans le champ <tt>Build-Depends</tt> (voir <ref id="autobuilder">), ce champ <tt>Build-Depends</tt> doit indiquer pratiquement tous les paquets nécessaires et <tt>Build-Depends-indep</tt> est rarement utilisé ;
it: I sorgenti dei pacchetti che hanno qualche pacchetto binario con il campo "<tt>Architecture: any</tt>", devono essere ricompilati dal sistema di auto-costruzione.
ja: "<tt>Architecture: any</tt>"のバイナリパッケージを含むソースパッケージはautobuilderによってリビルトされます。autobuilderは"<tt>debian/rules build</tt>"を実行します。その際に、<tt>Build-Depends</tt>フィールド (<ref id="autobuilder">を参照)に列挙されたパッケージしかインストールしないので、<tt>Build-Depends</tt>フィールドには事実上必要なパッケージ全てを列挙しなければなりません。 <tt>Build-Depends-indep</tt>はあまり使われません。
zh_cn: 对于生成一些标有 <tt>Architecture: any</tt> 的软件包，它们将被 autobuilder 编译。因为 autobuilder 仅安装 <tt>Build-Depends</tt> 后便执行 <tt>debian/rules build</tt> 中的内容(参看 <ref id="autobuilder">)，<tt>Build-Depends</tt> 需要列出所有必须的编译依赖，而 <tt>Build-Depends-indep</tt> 则很少使用。
zh_tw: 對於生成一些標有 <tt>Architecture: any</tt> 的套件，它們將被 autobuilder 編譯。因爲 autobuilder 僅安裝 <tt>Build-Depends</tt> 後便執行 <tt>debian/rules build</tt> 中的內容(參考 <ref id="autobuilder">)，<tt>Build-Depends</tt> 需要列出所有必須的編譯依賴，而 <tt>Build-Depends-indep</tt> 則很少使用。

source: For source packages which have binary packages only with "<tt>Architecture: all</tt>", the <tt>Build-Depends-Indep</tt> field may list all the required packages unless they are already listed in the <tt>Build-Depends</tt> field to satisfy the Debian Policy requirement for the <tt>clean</tt> target.
ca: Els paquets de fonts amb binaris del tipus <tt>Architecture: all</tt>, el camp <tt>Build-Depends-Indep</tt> inclourà tots els paquets necessaris amb excepció dels llistats en el camp <tt>Build-Depends</tt> per tal de seguir els requeriments de les normes Debian respecte a l'objectiu <tt>clean</tt>.
es: En el caso de los paquetes de fuentes que incluyen paquetes binarios únicamente del tipo <tt>Architecture: all</tt>, el campo <tt>Build-Depends-Indep</tt> debe listar todos los paquetes excepto los listados en el campo <tt>Build-Depends</tt> para satisfacer los requerimientos de las normas de Debian respecto al objetivo <tt>clean</tt>.
fr: pour les paquets sources des seuls paquets binaires avec « <tt>Architecture: all</tt> », le champ <tt>Build-Depends-Indep</tt> peut indiquer tous les paquets nécessaires à moins qu'ils soient déjà indiqués dans le champ <tt>Build-Depends</tt> pour être conforme à la Charte Debian au sujet de la cible <tt>clean</tt>.
ja: "<tt>Architecture: all</tt>"のバイナリパッケージのみのソースパッケージは、<tt>clean</tt>ターゲットに関するDebianポリシーを満たすために、<tt>Build-Depends</tt>フィールドに記載されていない要求パッケージを<tt>Build-Depends-Indep</tt>フィールドに記載することもできます。
zh_cn: 对于仅有 <tt>Architecture: all</tt> 的软件包，<tt>Build-Depends-Indep</tt> 中应列出 <tt>Build-Depends</tt> 中未列出的所有需要的软件包，以便满足 Debian Policy 中对 <tt>clean</tt> target 的要求。
zh_tw: 對於僅有 <tt>Architecture: all</tt> 的套件，<tt>Build-Depends-Indep</tt> 中應列出 <tt>Build-Depends</tt> 中未列出的所有需要的套件，以便滿足 Debian Policy 中對 <tt>clean</tt> target 的要求。

source: If you are not sure which one should be used, use the <tt>Build-Depends</tt> field to be on the safe side. <footnote><p>This somewhat strange situation is a feature well documented in the <url id="http://www.debian.org/doc/debian-policy/footnotes.html#f48" name="Debian Policy Manual, Footnotes 48">. This is not due to the use of the <prgn>dh</prgn> command in the <file>debian/rules</file> file but due to how the <prgn>dpkg-buildpackage</prgn> works. The same situation applies to the <url id="https://bugs.launchpad.net/launchpad-buildd/+bug/238141" name="auto build system for Ubuntu">. </p></footnote>
ca: Si tens dubtes, fes servir el camp <tt>Build-Depends</tt> <footnote><p>Consulta <url id="http://www.debian.org/doc/debian-policy/footnotes.html#f48" name="«Debian Policy Manual, Footnotes 48»">. En tot cas, això és degut al funcionament de <prgn>dpkg-buildpackage</prgn>, no pel fet de fer servir l'ordre <prgn>dh</prgn> en el fitxer <file>debian/rules</file>. Tot això també s'explica a <url id="https://bugs.launchpad.net/launchpad-buildd/+bug/238141" name="«auto build system for Ubuntu»">. </p></footnote>.
es: En caso de duda, utiliza el campo <tt>Build-Depends</tt> <footnote><p>Este caso esta documentado en <url id="http://www.debian.org/doc/debian-policy/footnotes.html#f48" name="Debian Policy Manual, Footnotes 48">. Esto se debe al funcionamiento de <prgn>dpkg-buildpackage</prgn>, no al uso de la orden <prgn>dh</prgn> en el archivo <file>debian/rules</file>. Esto también se aplica al <url id="https://bugs.launchpad.net/launchpad-buildd/+bug/238141" name="«auto build system for Ubuntu»">. </p></footnote>.
fr: En cas de doute, utilisez le champ <tt>Build-Depends</tt> pour être sûr. <footnote><p>Cette situation quelque peu étrange est une fonctionnalité bien expliquée dans la <url id="http://www.debian.org/doc/debian-policy/footnotes.html#f48" name="Charte Debian, note de bas de page 48">. Ce n'est pas lié à l'utilisation de la commande <prgn>dh</prgn> dans le fichier <file>debian/rules</file> mais au fonctionnement de <prgn>dpkg-buildpackage</prgn>. La même situation s'applique au <url id="https://bugs.launchpad.net/launchpad-buildd/+bug/238141" name="système de construction automatique pour Ubuntu">. </p></footnote>
ja: どちらのフィールドを使えうべきかわからなければ、<tt>Build-Depends</tt>にしておきましょう。<footnote><p>この、少し変わった状況は<url id="http://www.debian.org/doc/debian-policy/footnotes.html#f48" name="Debian Policy Manual, Footnotes 48">で詳しく説明されている機能です。これは、 <file>debian/rules</file>ファイル内の<prgn>dh</prgn>コマンドではなく、<prgn>dpkg-buildpackage</prgn>に起因します。同様の状況は<url id="https://bugs.launchpad.net/launchpad-buildd/+bug/238141" name="auto build system for Ubuntu">にも当てはまります。</p></footnote>
zh_cn: 如果你不知道应该使用哪一个，则使用 <tt>Build-Depends</tt> 以保证安全。<footnote><p>这种奇怪的情况是 <url id="http://www.debian.org/doc/debian-policy/footnotes.html#f48" name="Debian Policy Manual, Footnotes 48"> 中详细描述的一种特性。这不是由于在 <file>debian/rules</file> 中使用 <prgn>dh</prgn> 命令所致的，真正的原因是 <prgn>dpkg-buildpackage</prgn> 如何运行。相同的情形也适用于 <url id="https://bugs.launchpad.net/launchpad-buildd/+bug/238141" name="Ubuntu 的自动编译系统">。</p></footnote>
zh_tw: 如果你不知道應該使用哪一個，則使用 <tt>Build-Depends</tt> 以保證安全。<footnote><p>這種奇怪的情況是 <url id="http://www.debian.org/doc/debian-policy/footnotes.html#f48" name="Debian Policy Manual, Footnotes 48"> 中詳細描述的一種特性。這不是由於在 <file>debian/rules</file> 中使用 <prgn>dh</prgn> 命令所致的，真正的原因是 <prgn>dpkg-buildpackage</prgn> 如何運行。相同的情形也適用於 <url id="https://bugs.launchpad.net/launchpad-buildd/+bug/238141" name="Ubuntu 的自動編譯系統">。</p></footnote>

source: To find out what packages your package needs to be built run the command:
ca: Si vols saber quins paquets són necessaris per compilar el teu programa, executa l'ordre (si el programa fa servir «configure» per compilar-se):
es: Para saber qué paquetes son necesarios para compilar el tuyo ejecuta esta orden:
fr: Pour déterminer les paquets nécessaires à la construction, exécutez la commande :
it: Per scoprire di quali pacchetti si ha bisogno per la compilazione si può eseguire il comando:
ja: 以下のコマンドを使えば、新規のパッケージをビルドするためにどのパッケージが必要かを調べることができます。
zh_cn: 要找出编译你的软件所需的软件包可以使用这个命令：
zh_tw: 要找出編譯你的軟體所需的套件可以使用這個命令：

source: To manually find exact build dependency for <prgn><var>/usr/bin/foo</var></prgn>, you execute
ca: Si vols saber les dependències de compilació d'un paquet <prgn><var>/usr/bin/nom_paquet</var></prgn>, executa:
es: Para buscar manualmente las dependencias de compilación para el paquete <prgn><var>/usr/bin/nombre_del_paquete</var></prgn>, deberías ejecutar:
fr: Pour déterminer manuellement les dépendances de construction exactes pour <prgn><var>/usr/bin/toto</var></prgn>, exécutez :
it: Per scoprire manualmente le esatte dipendenze per <prgn><var>/usr/bin/foo</var></prgn>, si esegue
ja: <prgn><var>/usr/bin/foo</var></prgn>の依存パッケージを手動でみつけるには、
zh_cn: 要手工地找到 <prgn><var>/usr/bin/foo</var></prgn> 的编译依赖，可以执行：
zh_tw: 要手工地找到 <prgn><var>/usr/bin/foo</var></prgn> 的編譯依賴，可以執行：

source: $ objdump -p <var>/usr/bin/foo</var> | grep NEEDED
ca: $ objdump -p <var>/usr/bin/nom_del_paquet</var> | grep NEEDED
es: $ objdump -p <var>/usr/bin/nombre_del_paquete</var> | grep NEEDED
fr: $ objdump -p <var>/usr/bin/toto</var> | grep NEEDED

source: and for each library listed, e.g., <prgn>libfoo.so.6</prgn>, execute
ca: i per a cada una de les biblioteques llistades per l'ordre anterior (a l'exemple es fa amb <prgn>libfoo.so.6</prgn>) executa:
es: y para cada biblioteca listada por la orden anterior (en el ejemplo se hace para <prgn>libfoo.so.6</prgn>) ejecuta
fr: et pour chaque bibliothèque affichée, par exemple <prgn>libtoto.so.6</prgn>, exécutez
it: e per ogni libreria elencata, ad esempio, <prgn>libfoo.so.6</prgn>, si esegue
ja: を実行し、表示された各ライブラリ（例えば<prgn>libfoo.so.6</prgn>の場合）について、
zh_cn: 对于列出的每个库，例如 <prgn>libfoo.so.6</prgn>，运行：
zh_tw: 對於列出的每個庫，例如 <prgn>libfoo.so.6</prgn>，運行：

source: Then you just take <tt>-dev</tt> version of every package as <tt>Build-Depends</tt> entry. If you use <prgn>ldd</prgn> for this purpose, it will report indirect lib dependencies as well, resulting in the problem of excessive build dependencies.
ca: Cal fer servir la versió <tt>-dev</tt> de cada un dels paquets llistats en el camp <tt>Build-Depends</tt>. Si fas servir el programa <prgn>ldd</prgn> per saber les dependències, també t'informarà de les dependències de les biblioteques indirectes, la qual cosa pot fer que la llista sigui massa llarga.
es: Debes utilizar la versión «-dev» de cada uno de los paquetes dentro de la entrada <tt>Build-Depends</tt>. Si usas <prgn>ldd</prgn> para este propósito, también te informará de las dependencias de bibliotecas indirectas, lo que puede llevar a que se introduzcan demasiadas dependencias de construcción.
fr: Ajoutez ensuite simplement la version <tt>-dev</tt> de chaque paquet dans le champ <tt>Build-Depends</tt>. Si vous utilisez <prgn>ldd</prgn> à cet effet, des dépendances de bibliothèque indirectes seront indiquées, introduisant un problème de dépendances de construction excessives.
it: A questo punto si indica la versione <tt>-dev</tt> di ogni pacchetto come voce <tt>Build-Depends</tt>. Se si usa <prgn>ldd</prgn> per questo scopo, verranno considerate anche le dipendenze indirette, il che potrà portare ad avere un numero eccessivo di dipendenze.
ja: とします。<tt>Build-Depends</tt>に、各ライブラリの<tt>-dev</tt>バージョンを採用します。<prgn>ldd</prgn>を使用して依存パッケージを見つけようとすると、間接的な依存も報告してきます。そのため、過度のビルド依存になってしまいます。
zh_cn: 接下来直接将相应的 <tt>-dev</tt> 软件包的名称放到 <tt>Build-Depends</tt> 项内。如果你使用 <prgn>ldd</prgn>，它也会报告出间接的库依赖关系，这可能造成填写了某些不必要的依赖。
zh_tw: 接下來直接將相應的 <tt>-dev</tt> 套件的名稱放到 <tt>Build-Depends</tt> 項內。如果你使用 <prgn>ldd</prgn>，它也會報告出間接的庫依賴關係，這可能造成填寫了某些不必要的依賴。

source: <package>gentoo</package> also happens to require <package>xlibs-dev</package>, <package>libgtk1.2-dev</package> and <package>libglib1.2-dev</package> to build, so we'll add them here next to <package>debhelper</package>.
ca: <package>gentoo</package> fa servir <package>xlibs-dev</package>, <package>libgtk1.2-dev</package> i <package>libglib1.2-dev</package> en la compilació, així que caldrà afegir-ho tot a continuació de <package>debhelper</package>.
es: <package>gentoo</package> también depende de <package>xlibs-dev</package>, <package>libgtk1.2-dev</package> y <package>libglib1.2-dev</package> para su construcción, así que lo añadiremos junto a <package>debhelper</package>.
fr: <package>gentoo</package> a aussi besoin de <package>xlibs-dev</package>, <package>libgtk1.2-dev</package> et <package>libgl1.2-dev</package> pour être construit, ils doivent donc être ajoutés à côté de <package>debhelper</package>.
it: Il pacchetto <package>gentoo</package> richiede anche <package>xlibs-dev</package>, <package>libgtk1.2-dev</package> e <package>libglib1.2-dev</package> per poter essere costruito, quindi tali dipendenze si aggiungeranno subito dopo <package>debhelper</package>.
ja: <package>gentoo</package>パッケージをビルドするには<package>xlibs-dev</package>、<package>libgtk1.2-dev</package>、 <package>libglib1.2-dev</package>が必要なので、<package>debhelper</package>の後に記述しましょう。
zh_cn: <package>gentoo</package> 需要 <package>xlibs-dev</package>、<package>libgtk1.2-dev</package> 和 <package>libglib1.2-dev</package> 才能编译，所以我们将这些软件包加在 <package>debhelper</package> 之后。
zh_tw: <package>gentoo</package> 需要 <package>xlibs-dev</package>、<package>libgtk1.2-dev</package> 和 <package>libglib1.2-dev</package> 才能編譯，所以我們將這些套件加在 <package>debhelper</package> 之後。

source: Line 6 is the version of the <url id="http://www.debian.org/doc/devel-manuals#policy" name="Debian Policy Manual"> standards this package follows, the one you read while making your package.
ca: La línia 6 és la versió dels ﻿estàndards definits en les normes Debian i que s'han seguit en la construcció del paquet, és a dir, la versió del manual de normes que has seguit per empaquetar (consulta <url id="http://www.debian.org/doc/devel-manuals#policy" name="«Debian Policy Manual»">).
es: La línea 6 es la versión de los estándares definidos en las normas de Debian que sigue este paquete, es decir, la versión del manual de normas que has leído mientras haces tu paquete (véase <url id="http://www.debian.org/doc/devel-manuals#policy" name="«Debian Policy Manual»">.
fr: La ligne 6 est la version de la <url id="http://www.debian.org/doc/devel-manuals#policy" name="Charte Debian"> que ce paquet respecte, celle que vous lisez quand vous créez le paquet.
ja: 6行目は、パッケージが準拠する<url id="http://www.debian.org/doc/devel-manuals#policy" name="Debian Policy Manual"> のバージョンです。これは、あなたがパッケージ作成の際に参照したポリシーマニュアルのバージョンです。
zh_cn: 第 6 行是此软件包所依据的 <url id="http://www.debian.org/doc/devel-manuals#policy" name="Debian Policy Manual"> 标准版本号。
zh_tw: 第 6 行是此套件所依據的 <url id="http://www.debian.org/doc/devel-manuals#policy" name="Debian Policy Manual"> 標準版本號。

source: On line 7 you can put the URL of the homepage for the upstream program.
ca: A la ﻿línia 7 està l'adreça URL del programa.
es: En la línea 7 está la dirección URL de la página web del programa (donde has obtenido las fuentes).
fr: En ligne 7 vous pouvez indiquer l'URL de la page d'accueil du programme amont.
ja: 7行目には上流プログラムのホームページアドレスを記載できます。
zh_cn: 在第 7 行你可以放置上游项目的首页地址。
zh_tw: 在第 7 行你可以放置上游項目的首頁地址。

source: Line 9 is the name of the binary package. This is usually the same as the name of the source package, but it doesn't necessarily have to be that way.
ca: La línia 9 és el nom del paquet binari. Normalment és el mateix que el paquet del codi original, tot i què no és imprescindible que sigui així.
es: La línea 9 es el nombre del paquete binario. Este suele ser el mismo que el del paquete fuente, aunque no es necesario que sea así siempre.
fr: La ligne 9 est le nom du paquet binaire. C'est d'ordinaire le même que le nom du paquet source, mais ce n'est pas nécessairement le cas.
it: La riga 9 indica il nome del pacchetto binario. Questo è normalmente lo stesso nome del pacchetto sorgente, ma non deve essere necessariamente così.
ja: 9行目はバイナリパッケージの名前です。ソースパッケージと同名にするのが通例ですが、そうでなくてもかまいません。
zh_cn: 第 9 行是二进制软件包的名称。通常情况下与源代码包相同，但不是必须的。
zh_tw: 第 9 行是二進位套件的名稱。通常情況下與原始碼包相同，但不是必須的。

source: Line 10 describes the CPU architecture the binary package can be compiled for. We'll leave this as "<tt>any</tt>" because <manref section="1" name="dpkg-gencontrol"> will fill in the appropriate value for any machine this package gets compiled on.
ca: La línia 10 descriu l'arquitectura de CPU amb què el paquet pot ésser compilat. Deixarem "<tt>any</tt>" (qualsevol), perquè <manref section="1" name="dpkg-gencontrol"> emplenarà aquest camp amb el valor corresponent a l'arquitectura quan el paquet es compili.
es: La línea 10 describe la arquitectura de CPU para la que el paquete binario puede ser compilado. Dejaremos puesto "<tt>any</tt>" (cualquiera), porque <manref section="1" name="dpkg-gencontrol"> la rellenará con el valor apropiado cuando se compile este paquete en cualquier arquitectura para la cual pueda ser compilado.
fr: La ligne 10 décrit l'architecture du CPU pour laquelle le paquet binaire peut être compilé. « any » est laissé car <manref section="1" name="dpkg-gencontrol"> trouvera la valeur appropriée pour chaque machine sur laquelle ce paquet sera compilé.
it: Alla riga 10 viene descritta l'architettura CPU per cui può essere compilato il pacchetto binario. Si lascerà "<tt>any</tt>" perché <manref section="1" name="dpkg-gencontrol"> riempa questo campo con un valore adeguato per ciascuna macchina in cui il pacchetto viene compilato.
ja: 10行目はバイナリパッケージをコンパイル可能なCPUアーキテクチャです。ここを"<tt>any</tt>"のままにしておくと、<manref section="1" name="dpkg-gencontrol">がパッケージをコンパイルしたマシンに合わせて適当に埋めてくれます。
zh_cn: 第 10 行描述了这个软件包可以在哪些 CPU 构架上编译。我们将保持它为 <tt>any</tt>，因为 <manref section="1" name="dpkg-gencontrol"> 将在这个软件包可以编译的平台上为此处填写合适的信息。
zh_tw: 第 10 行描述了這個套件可以在哪些 CPU 構架上編譯。我們將保持它爲 <tt>any</tt>，因爲 <manref section="1" name="dpkg-gencontrol"> 將在這個套件可以編譯的平臺上爲此處填寫合適的訊息。

source: If your package is architecture independent (for example, a shell or Perl script, or a document), change this to "<tt>all</tt>", and read later in <ref id="rules"> about using the <tt>binary-indep</tt> rule instead of <tt>binary-arch</tt> for building the package.
ca: Si el teu paquet és independent de l'arquitectura (serà el cas d'un document o d'un guió escrit en Perl), canvia el valor a "<tt>all</tt>" i consulta més endavant <ref id="rules"> per saber com fer servir la regla <tt>binary-indep</tt> en lloc de <tt>binary-arch</tt> per a la construcció del paquet.
es: Si tu paquete es independiente de la arquitectura (por ejemplo, un documento, un guión escrito en Perl o para el intérprete de órdenes), cambia esto a "<tt>all</tt>", y consulta más adelante <ref id="rules"> sobre cómo usar la regla <tt>binary-indep</tt> en lugar de <tt>binary-arch</tt> para construir el paquete.
fr: Si le paquet est indépendant d'une architecture (par exemple, un script shell ou Perl, ou un document), changez ce paramètre en « <tt>all</tt> », et lisez plus loin en <ref id="rules"> comment utiliser la règle <tt>binary-indep</tt> au lieu de <tt>binary-arch</tt> pour construire le paquet.
it: Se il pacchetto è indipendente dall'architettura (per esempio, uno script shell o Perl, o un documento), si cambi questo valore in "<tt>all</tt>", e si legga in seguito in <ref id="rules"> riguardo l'utilizzo della regola <tt>binary-indep</tt> al posto di <tt>binary-arch</tt> per costruire il pacchetto.
ja: 特定のアーキテクチャに依存しないパッケージであれば、(例えば、シェルやPerlスクリプト、文書パッケージの場合)、"<tt>all</tt>"に変更します。パッケージをビルドするには、<tt>binary-arch</tt>ではなく、<tt>binary-indep</tt>の使い方を読んでください。
zh_cn: 如果你的软件包是平台独立的(例如一个 shell 或 Perl 脚本，或一些文档)，将这项改变为 <tt>all</tt>，然后继续阅读 <ref id="rules"> 中关于使用 <tt>binary-indep</tt> 指令替代 <tt>binary-arch</tt> 来编译软件包的内容。
zh_tw: 如果你的套件是平臺獨立的(例如一個 shell 或 Perl 腳本，或一些文件)，將這項改變爲 <tt>all</tt>，然後繼續閱讀 <ref id="rules"> 中關於使用 <tt>binary-indep</tt> 指令替代 <tt>binary-arch</tt> 來編譯套件的內容。

source: Line 11 shows one of the most powerful features of the Debian packaging system. Packages can relate to each other in various ways. Apart from <tt>Depends</tt>, other relationship fields are <tt>Recommends</tt>, <tt>Suggests</tt>, <tt>Pre-Depends</tt>, <tt>Breaks</tt>, <tt>Conflicts</tt>, <tt>Provides</tt>, and <tt>Replaces</tt>.
ca: La línia 11 mostra una de les més poderoses possibilitats del sistema de paquets de Debian. És possible relacionar els paquets entre ells. A més de <tt>Depends</tt> (depèn de) altres camps de relació són <tt>Recommends</tt> (recomana), <tt>Suggests</tt> (suggereix), <tt>Pre-Depends</tt> (predepèn de), <tt>Breaks</tt> (﻿trenca a), <tt>Conflicts</tt> (entre en conflicte amb), <tt>Provides</tt> (proveeix), <tt>Replaces</tt> (﻿reemplaça a) <footnote><p>N. de t.: consulta les <url id="http://www.debian.org/doc/FAQ/ch-pkg_basics.en.html#s-depends" name="preguntes més frequents de Debian"> si vols una explicació més detallada de cada possibilitat. </p></footnote>.
es: La línea 11 muestra una de las más poderosas posibilidades del sistema de paquetes de Debian. Los paquetes se pueden relacionar unos con otros de diversas formas. Aparte de <tt>Depends</tt> (depende de) otros campos de relación son <tt>Recommends</tt> (recomienda), <tt>Suggests</tt> (sugiere), <tt>Pre-Depends</tt> (predepende de), <tt>Breaks</tt> (rompe a), <tt>Conflicts</tt> (entra en conflicto con), <tt>Provides</tt> (provee), <tt>Replaces</tt> (reemplaza a).
fr: La ligne 11 montre une des caractéristiques les plus puissantes du système de paquet Debian. Les paquets peuvent être liés entre eux de plusieurs façons. Hormis <tt>Depends</tt>, les autres champs décrivant ces relations sont <tt>Recommends</tt>, <tt>Suggests</tt>, <tt>Pre-Depends</tt>, <tt>Breaks</tt>, <tt>Conflicts</tt>, <tt>Provides</tt> et <tt>Replaces</tt>.
ja: 11行目からはDebianのパッケージシステムが強力なことがわかります。パッケージは様々な形で相互に関係することができます。<tt>Depends</tt>の他には、<tt>Recommends</tt>、 <tt>Suggests</tt>、<tt>Pre-Depends</tt>、<tt>Breaks</tt>、 <tt>Conflicts</tt>、<tt>Provides</tt>、<tt>Replaces</tt>などがあります。
zh_cn: 第 11 行显示了 Debian 软件包系统中最强大的特性之一。每个软件包都可以和其他软件包有各种不同的关系。除 <tt>Depends</tt> 外，还有 <tt>Recommends</tt>、<tt>Suggests</tt>、<tt>Pre-Depends</tt>、<tt>Breaks</tt>、<tt>Conflicts</tt>、<tt>Provides</tt> 和 <tt>Replaces</tt>。
zh_tw: 第 11 行顯示了 Debian 套件系統中最強大的特性之一。每個套件都可以和其他套件有各種不同的關係。除 <tt>Depends</tt> 外，還有 <tt>Recommends</tt>、<tt>Suggests</tt>、<tt>Pre-Depends</tt>、<tt>Breaks</tt>、<tt>Conflicts</tt>、<tt>Provides</tt> 和 <tt>Replaces</tt>。
