Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: But why in that directory, and not some other? Because Debian packages never install files beneath <file>/usr/local</file> -- that tree is reserved for the system administrator's use. Such files on Debian systems go under <file>/usr</file> instead.
ca: Quin és el motiu de posar aquest directori? Els paquets de Debian no s'instal·len mai a <file>/usr/local</file>, directori reservat al administrador del sistema. Cal instal·lar els fitxers en el directori <file>/usr</file>.
es: Pero ¿por qué en este directorio y no en otro? Porque los paquetes de Debian nunca se instalan bajo <file>/usr/local</file>, este árbol de directorio, está reservado para el uso del administrador del sistema. Así que estos ficheros deben instalarse en <file>/usr</file>.
fr: Mais pourquoi dans ce répertoire, et pas dans un autre ? Parce que Debian n'installe jamais de fichiers sous <file>/usr/local</file> &mdash; cet arbre est réservé à l'usage de l'administrateur système. Sur un système Debian, de tels fichiers doivent plutôt aller sous <file>/usr</file>.
it: Ma perché in questa directory e non altrove? Perché i pacchetti Debian non installano mai dei file nella directory <file>/usr/local</file> -- questo percorso è riservato all'amministratore di sistema. Questi file, invece, nei sistemi Debian vanno posizionati in <file>/usr</file>.
ja: しかしなぜこのディレクトリなんでしょう。他の所じゃだめでしょうか？ だめです。なぜなら Debian パッケージの場合、<file>/usr/local</file> 以下へファイルをインストールすることは絶対に無いと決まっているからです。このディレクトリ以下は個別のシステムの管理者が使うために予約されています。 Debian システム上でパッケージからインストールされるファイルは その代わりに <file>/usr</file> へインストールされます。
zh_cn: 为什么要放在那个目录，而非其他的呢？因为 Debian 软件包从不在 <file>/usr/local</file> 下安装文件——那是保留给系统管理员使用的。在 Debian 中这些文件被直接放入 <file>/usr</file>。
zh_tw: 爲什麼要放在那個目錄，而非其他的呢？因爲 Debian 套件從不在 <file>/usr/local</file> 下安裝檔案——那是保留給系統管理員使用的。在 Debian 中這些檔案被直接放入 <file>/usr</file>。

source: The more exact locations for binaries, icons, documentation etc. are specified in the Filesystem Hierarchy Standard (see <file>/usr/share/doc/debian-policy/fhs/</file>). I recommend you browse it and read the sections that might concern your package.
ca: El destí correcte dels fitxers binaris, icones, documentació, etc, s'explica en el document «Estàndard de la jerarquia del sistema de fitxers» (consulta <file>/usr/share/doc/debian-policy/fhs</file>). Cal que llegeixis les seccions que poden ésser d'aplicació al teu paquet.
es: La ubicación correcta de los binarios, iconos, documentación, etc, está especificada en el «Estándar de la jerarquía del sistema de ficheros» (véase <file>/usr/share/doc/debian-policy/fhs</file>). Te recomiendo que leas las secciones que podrían aplicarse a tu paquete.
fr: Les emplacements exacts des exécutables, icônes, documentation, etc., sont spécifiées dans la norme de hiérarchie des fichiers (voir <file>/usr/share/doc/debian-policy/fhs/</file>). Vous devriez la consulter et lire les sections relatives à votre paquet.
it: L'esatta posizione dei binari, delle icone, della documentazione, ecc. è specificata nella Gerarchia dei Filesystem (vedere <file>/usr/share/doc/debian-policy/fhs/</file>). Si consiglia di sfogliarlo e leggere le sezioni riguardanti il pacchetto interessato.
ja: バイナリ、アイコン、文書など、それぞれのファイルを保存すべきもっと正確な場所については、「Filesystem Hierarchy Standard」 (<file>/usr/share/doc/debian-policy/fhs/</file> を参照) の中で規定されています。ざっと目を通して、あなたのパッケージに関係しそうな箇所を、きちんと読んでおくことをお勧めします。
zh_cn: 二进制文件、图标和文档等的更详细位置均在文件层级标准(FHS，参看 <file>/usr/share/doc/debian-policy/fhs/</file>)中作出了详尽描述。我建议阅读相关章节以了解可能影响你软件包的内容。
zh_tw: 二進位檔案、圖示和文件等的更詳細位置均在檔案層級標準(FHS，參考 <file>/usr/share/doc/debian-policy/fhs/</file>)中作出了詳盡描述。我建議閱讀相關章節以瞭解可能影響你套件的內容。

source: So, we should install the binary in <file>/usr/bin</file> instead of <file>/usr/local/bin</file>, the manual page in <file>/usr/share/man/man1</file> instead of <file>/usr/local/man/man1</file> etc. Notice how there's no manual page mentioned in <package>gentoo</package>'s <file>Makefile</file>, but since the Debian Policy requires that every program has one, we'll make one later and install it in <file>/usr/share/man/man1</file>.
ca: Així doncs, hauríem d'instal·lar el fitxer binari en el directori <file>/usr/bin</file> en lloc de <file>/usr/local/bin</file> i la pàgina de manual a <file>/usr/share/man/man1</file> en lloc de <file>/usr/local/man/man1</file>. No hi ha cap referència a la pàgina de manual en el fitxer <file>Makefile</file> de <package>gentoo</package> , però en Debian cal que cada programa tengui la seva pàgina de manual, així que més endavant en farem una i la instal·larem a <file>/usr/share/man/man1</file>.
es: Así pues, deberíamos instalar el binario en <file>/usr/bin</file> en lugar de <file>/usr/local/bin</file> y la página de manual en <file>/usr/share/man/man1</file> en lugar de <file>/usr/local/man/man1</file>. No hemos mencionado ninguna página de manual en el Makefile de <package>gentoo</package>, pero en Debian se requiere que cada programa debe tener una, así que haremos una más tarde y la instalaremos en <file>/usr/share/man/man1</file>.
fr: Dès lors, l'exécutable devrait être installé sous <file>/usr/bin</file> plutôt que sous <file>/usr/local/bin</file>, la page de manuel sous <file>/usr/share/man/man1</file> plutôt que sous <file>/usr/local/man/man1</file>, etc. Remarquez qu'il n'y a pas de page de manuel mentionnée dans le fichier <file>Makefile</file> de <package>gentoo</package>, mais comme la Charte Debian demande que chaque programme en ait une, il faudra en créer une plus tard et l'installer dans <file>/usr/share/man/man1</file>.
it: Si dovrà installare, quindi, il binario in <file>/usr/bin</file> anziché in <file>/usr/local/bin</file>, la pagina di manuale in <file>/usr/share/man/man1</file> anziché <file>/usr/local/man/man1</file>, ecc. Da notare che nel <file>Makefile</file> del pacchetto <package>gentoo</package> non è presente una pagina di manuale, ma dal momento che la policy di Debian prevede che ogni programma ne abbia una, ne verrà creata una e sarà installata in <file>/usr/share/man/man1</file>.
ja: そういうわけで、バイナリは <file>/usr/local/bin</file> ではなく <file>/usr/bin</file> へインストールしなければなりませんし、マニュアルページは <file>/usr/local/man/man1</file> の代わりに <file>/usr/share/man/man1</file> へインストールする必要があります。ここで <package>gentoo</package> の <file>Makefile</file> には、マニュアルページに関する記述がまったく無いことに注意してください。Debian ポリシーでは、すべてのプログラムがそれぞれマニュアルを用意しなければならないと定めていますから、後で gentoo のマニュアルを作成して、それを <file>/usr/share/man/man1</file> 以下へインストールすることにします。
zh_cn: 因此，我们应当把二进制文件安装到 <file>/usr/bin</file> 而非 <file>/usr/local/bin</file>，man 手册页则应放在 <file>/usr/share/man/man1</file> 而非 <file>/usr/local/man/man1</file> 等。注意到 <package>gentoo</package>的 <file>Makefile</file> 里没有提及手册页，而按照 Debian Policy 的要求，每个程序都应当有一个手册页，我们将在稍后制作一个并安装到 <file>/usr/share/man/man1</file>
zh_tw: 因此，我們應當把二進位檔案安裝到 <file>/usr/bin</file> 而非 <file>/usr/local/bin</file>，man 手冊頁則應放在 <file>/usr/share/man/man1</file> 而非 <file>/usr/local/man/man1</file> 等。注意到 <package>gentoo</package>的 <file>Makefile</file> 裏沒有提及手冊頁，而按照 Debian Policy 的要求，每個程式都應當有一個手冊頁，我們將在稍後製作一個並安裝到 <file>/usr/share/man/man1</file>

source: Some programs don't use <file>Makefile</file> variables to define paths such as these. This means you might have to edit some real C sources in order to fix them to use the right locations. But where to search, and exactly what for? You can find this out by issuing:
ca: Alguns programes no fan servir variables en el fitxer <file>makefile</file> per definir les ubicacions dels fitxers. Això significa que hauràs d'editar alguns dels fitxers de codi C per solucionar això per tal de que es facin servir els directoris correctes. Però, on cal buscar?, i exactament, què? Prova d'executar el següent:
es: Algunos programas no usan variables en el <file>makefile</file> para definir rutas como éstas. Esto significa que tendrás que editar algunos de los ficheros de código C para arreglarlos y que usen las rutas correctas. Pero, ¿dónde buscar?, y exactamente, ¿el qué? Puedes probar a encontrarlos usando:
fr: Certains programmes n'utilisent pas les variables des fichiers <file>Makefile</file> pour définir des chemins comme ceux-ci. Cela signifie que vous risquez de devoir modifier de vrais fichiers sources C pour qu'ils utilisent les emplacements corrects. Mais où, et que chercher exactement ? Vous pouvez le découvrir avec :
it: Alcuni programmi non usano le variabili nel <file>Makefile</file> per definire dei percorsi come questi. Questo indica che potrebbe essere necessario modificare qualche sorgente in C, per fargli usare il percorso giusto. Ma dove cercarlo, e per farci cosa? Lo si può scoprire eseguendo questo:
ja: プログラムの中には、このようなパスを定義するための <file>Makefile</file> 変数を使っていないものもあります。このような場合、C のソースそのものをいじって、指定された場所を使うように修正しなければなりません。でもどこを探し、何を確認すればよいのでしょうか? 以下のコマンドを実行すれば該当箇所を見つけることができます。
zh_cn: 有些程序不使用 <file>Makefile</file> 变量定义路径，这意味着你可能需要去编辑 C 程序源代码来使他们使用正确的路径。但是到哪里去搜索，哪些才是呢？你可以通过以下的方法找到它们：
zh_tw: 有些程式不使用 <file>Makefile</file> 變量定義路徑，這意味着你可能需要去編輯 C 程式原始碼來使他們使用正確的路徑。但是到哪裏去搜索，哪些纔是呢？你可以通過以下的方法找到它們：

source: <prgn>grep</prgn> will run recursively through the source tree and tell you the filename and the line number for all matches.
ca: <prgn>grep</prgn> buscarà recursivament en l'estructura de directoris i indicarà el nom del fitxer i la línia on hi hagi alguna concordança.
es: <prgn>grep</prgn> buscará recursivamente en los subdirectorios y te indicará el nombre del fichero y la línea cuando encuentre una concordancia con la cadena.
fr: <prgn>grep</prgn> va parcourir récursivement l'arbre des sources et donner le nom des fichiers et le numéro des lignes où il trouve une occurrence.
it: <prgn>grep</prgn> cercherà tutte le corrispondenze in maniera ricorsiva attraverso tutto l'albero dei sorgenti, indicando il nome del file e il numero della riga.
ja: <prgn>grep</prgn> がソースツリーを再帰的に検索し、該当箇所を見つけたらそのファイルの名前と検索対象の文字列が含まれる行番号とを表示します。
zh_cn: <prgn>grep</prgn> 会递归搜索整个源代码树并告诉你所有匹配项的文件名和行号。
zh_tw: <prgn>grep</prgn> 會遞歸搜索整個原始碼樹並告訴你所有匹配項的檔案名和行號。

source: Edit those files and in those lines replace <tt>usr/local/lib</tt> with <tt>usr/lib</tt>.
ca: Ara edita els fitxers i canvia la cadena <tt>usr/local/lib</tt> per <tt>usr/lib</tt>. La següent ordre hauria de fer-ho automàticament:
es: Ahora edita esos ficheros y cambia en esas líneas <tt>usr/local/lib</tt> por <tt>usr/lib</tt>.
fr: Modifiez ces fichiers et à ces lignes, remplacez <tt>usr/local/lib</tt> par <tt>usr/lib</tt> :
ja: それらのファイルを編集し、該当行の <tt>usr/local/lib</tt> を <tt>usr/lib</tt> に置き換えてください。
zh_cn: 编辑那些文件，用 <tt>usr/lib</tt> 替换 <tt>usr/local/lib</tt>。
zh_tw: 編輯那些檔案，用 <tt>usr/lib</tt> 替換 <tt>usr/local/lib</tt>。

source: Be careful that you don't mess up the rest of the code! :-)
ca: ¡Posa molta atenció en fer canvis inadvertits en el codi! :-)
es: ¡Mucha atención en hacer otros cambios inadvertidos en el código! :-)
fr: Soyez attentif à ne pas casser le reste du code ! :-)
it: Si faccia attenzione a non pasticciare il resto dei sorgenti! :-)
ja: 他のコードを汚さないよう、注意してくださいね！ :-)
zh_cn: 小心不要弄乱其他部分的代码！ :-)
zh_tw: 小心不要弄亂其他部分的程式碼！ :-)

source: After that you should find the install target (search for line that starts with <tt>install:</tt>, that will usually work) and rename all references to directories other than ones defined at the top of the <file>Makefile</file>.
ca: Fet això hauries de trobar (en el fitxer <file>Makefile</file>) l'objectiu «install» (busca una línia que comenci per «install:») i canviar el nom de totes les referències a directoris distints dels definits a l'inici de l'arxiu <file>Makefile</file>.
es: Después de esto deberías encontrar (en el archivo <file>Makefile</file>) el objetivo «install» (busca una línea que comience por «install:») y renombra todas las referencias a directorios distintos de los definidos al comienzo del Makefile.
fr: Ensuite, vous devriez trouver la cible d'installation (cherchez une ligne qui commence par <tt>install:</tt>, d'ordinaire cela fonctionne) et renommez toutes les références aux répertoires autres que ceux définis au début du <file>Makefile</file>.
it: A questo punto si dovrebbe trovare il percorso di destinazione per l'installazione (si cerchi la riga che inizia con <tt>install:</tt>, di solito è quella corretta) e modificare tutti i riferimenti alle directory diverse da quelle definite nel <file>Makefile</file>.
ja: 修正が終ったら、インストールターゲットを探しましょう(「<tt>install:</tt>」 で始まる行を探してください。この方法でたいていうまくいきます)。<file>Makefile</file> の先頭で直接定義されているものを除いて、ディレクトリへの参照をすべて変更してください。
zh_cn: 此后你应该找到 install target (通常搜索以 <tt>install:</tt> 开头的行即可)，并把所有的相关目录以及在 <file>Makefile</file> 顶部定义变量均做修改。
zh_tw: 此後你應該找到 install target (通常搜索以 <tt>install:</tt> 開頭的行即可)，並把所有的相關目錄以及在 <file>Makefile</file> 頂部定義變量均做修改。

source: After your upstream bug fix, <package>gentoo</package>'s install target said:
ca: Abans de corregir l'error en el codi original, l'objectiu «install» de <package>gentoo</package> posava:
es: Antes de corregir el error en el código original, el objetivo «install» de <package>gentoo</package> declaraba:
fr: Après la correction du bogue amont, la cible « install » de <package>gentoo</package> est sous la forme :
it: Dopo aver corretto il bug, il percorso di destinazione per l'installazione del pacchetto <package>gentoo</package> riporterà:
ja: 開発元のバグ修正をした後、<package>gentoo</package> の install ターゲットはこうなっています：
zh_cn: 在你修复了上游的 Bug 后，<package>gentoo</package> 的 install target 应是这样：
zh_tw: 在你修復了上游的 Bug 後，<package>gentoo</package> 的 install target 應是這樣：

source: Let's fix this and record this with the <prgn>quilt</prgn> command as <file>debian/patches/install.patch</file>.
ca: Per corregir l'error i conservar les modificacions en el fitxer <file>debian/patches/install.patch</file> amb l'ordre <prgn>quilt</prgn> executa
es: Ahora corregiremos el error, conservando las modificaciones en el archivo <file>debian/patches/install.patch</file> con la orden <prgn>quilt</prgn>.
fr: Corrigez l'erreur et enregistrez la modification avec la commande <prgn>quilt</prgn> sous <file>debian/patches/install.patch</file> :
it: Si può correggere e registrare la modifica con il comando <prgn>quilt</prgn> salvandola come <file>debian/patches/install.patch</file>.
ja: <prgn>quilt</prgn> コマンドを使って、<file>debian/patches/install.patch</file> としてこれを修正して記録しましょう。
zh_cn: 让我们把这些修改使用 <prgn>quilt</prgn> 记录到<file>debian/patches/install.patch</file>。
zh_tw: 讓我們把這些修改使用 <prgn>quilt</prgn> 記錄到<file>debian/patches/install.patch</file>。

source: Let's change this for Debian package as following using the editor:
ca: Anem a canviar això per al paquet Debian amb l'editor:
es: Y ahora escribe los cambios con el editor:
fr: Pour le paquet Debian, il faut modifier comme suit avec l'éditeur :
it: Per il pacchetto debian si modifichi come segue, utilizzando un editor:
ja: Debian パッケージ用に、これをエディタで次のように変更します：
zh_cn: 我们使用编辑器按照以下内容为 Debian 软件包做修改：
zh_tw: 我們使用編輯器按照以下內容爲 Debian 套件做修改：

source: You've surely noticed that there's now a "<tt>install -d</tt>" command before the other commands in the rule. The original <file>Makefile</file> didn't have it because usually the <tt>/usr/local/bin</tt> and other directories already exist on the system where one runs "<tt>make install</tt>". However, since we will install into our own empty (or even nonexistent) directory, we will have to create each and every one of those directories.
ca: Fixa't que hi ha la primera línia que és nova ("<tt>install -d</tt>") abans de les altres. El fitxer <file>Makefile</file> original no estava aquesta ordre degut a què els directoris <tt>/usr/local/bin</tt> ja existeixen en el sistema quan s'executa "<tt>make install</tt>" . Per això, com farem la instal·lació en un directori buit (o inexistent), caldrà assegurar-se que els directoris necessaris ja existeixen.
es: Seguramente has notado que ahora hay una orden "<tt>install -d</tt>" antes de las demás órdenes de la regla. El <file>Makefile</file> original no la tenía porque normalmente <tt>/usr/local/bin</tt> y otros directorios ya existen en el sistema donde se ejecuta "<tt>make install</tt>". Sin embargo, dado que lo instalaremos en un directorio vacío (o incluso inexistente), tendremos que generar cada uno de estos directorios.
fr: Vous aurez sûrement remarqué qu'il y a maintenant une commande « <tt>install -d</tt> » avant les autres dans la règle. Elle n'existait pas dans Le fichier <file>Makefile</file> originel parce qu'habituellement <tt>/usr/local/bin</tt> et les autres répertoires existent déjà sur le système dans lequel « <tt>make install </tt>» est exécuté. Cependant, puisque dans notre cas les répertoires d'installation sont vides (ou même inexistants), chacun de ces répertoires doit être créé.
it: Si sarà sicuramente notato che c'è adesso un comando "<tt>install -d</tt>" prima degli altri, nella regola. Il <file>Makefile</file> originale non ce l'ha perché generalmente usa <tt>/usr/local/bin</tt> e altre directory che già esistono nel sistema su cui si esegue "<tt>make install</tt>". Tuttavia, dal momento che verrà installato nella nostra directory vuota (o anche inesistente), si dovrà creare ogni singola directory.
ja: お気づきになったでしょうが、変更後はこのルールの他のコマンドより前に 「<tt>install -d</tt>」 コマンドが追加されています。普通 「<tt>make install</tt>」 を実行するようなシステムなら <tt>/usr/local/bin</tt> や その他のディレクトリは既に存在しているでしょうから、 もともとの <file>Makefile</file> ではこのコマンドは使われていませんでした。しかし、私たちは独自に空っぽの（あるいはまだ存在さえしていない）ディレクトリにインストールするわけですから、これらの各ディレクトリを毎回作成する必要があります。
zh_cn: 你一定会注意到在其他命令前有了一个 <tt>install -d</tt> 命令。原始的 <file>Makefile</file> 文件中没有它，因为通常情况下 <tt>/usr/local/bin</tt> 和用到的其他目录早已存在于系统，使用 <tt>make install</tt> 时不用对此处理。然而因为我们要向空目录或尚不存在的目录中安装，我们必须创建每一个目录。
zh_tw: 你一定會注意到在其他命令前有了一個 <tt>install -d</tt> 命令。原始的 <file>Makefile</file> 檔案中沒有它，因爲通常情況下 <tt>/usr/local/bin</tt> 和用到的其他目錄早已存在於系統，使用 <tt>make install</tt> 時不用對此處理。然而因爲我們要向空目錄或尚不存在的目錄中安裝，我們必須創建每一個目錄。

source: We can also add in other things at the end of the rule, like the installation of additional documentation that the upstream authors sometimes omit:
ca: També podem afegir altres coses al final de la regla, com la instal·lació de la documentació ﻿addicional que de vegades els autors originals poden haver descuidat:
es: También podemos añadir otras cosas al final de la regla, como la instalación de documentación adicional que los desarrolladores originales a veces omiten:
fr: D'autres choses peuvent être ajoutés à la fin de la règle, comme l'installation de la documentation additionnelle que l'auteur amont oublie parfois :
it: È possibile anche aggiungere altre cose alla fine della regola, come l'installazione di documentazione aggiuntiva che gli autori originali talvolta omettono:
ja: ルールの最後には、開発元の作者が省略することの多い付加的な資料のインストールなど、他の作業を追加することもできます。
zh_cn: 我们还可以在末尾添加上其他的内容，比如上游作者有时会省略的附加文档：
zh_tw: 我們還可以在末尾添加上其他的內容，比如上游作者有時會省略的附加文件：

source: After careful check, if everything is fine, ask <prgn>quilt</prgn> to refresh the patch to create <file>debian/patches/install.patch</file> and add its description.
ca: Després de comprovar que tot sigui correcte, fes que <prgn>quilt</prgn> actualitzi la modificació en el fitxer <file>debian/patches/install.patch</file> i afegeix la descripció en la capçalera del fitxer:
es: Después de comprobar que sea todo correcto, ejecuta <prgn>quilt</prgn> para actualizar la modificación en el archivo <file>debian/patches/install.patch</file> y añade la descripción en la cabecera del archivo.
fr: Après avoir soigneusement vérifié que tout est bon, demandez à <prgn>quilt</prgn> de rafraîchir le correctif pour créer <file>debian/patches/install.patch</file> et ajoutez sa description.
ja: しっかりチェックをして、何も問題がないようであれば、<prgn>quilt</prgn> でパッチを更新して <file>debian/patches/install.patch</file> を作成し、パッチの説明を追記してください。
zh_cn: 仔细检查后如果没有问题，使用 <prgn>quilt</prgn> 刷新补丁以创建 <file>debian/patches/install.patch</file> 文件并添加对它的描述。
zh_tw: 仔細檢查後如果沒有問題，使用 <prgn>quilt</prgn> 更新補丁以創建 <file>debian/patches/install.patch</file> 檔案並添加對它的描述。

source: Now you have a series of patches.
ca: Ja tens un parell de pegats del paquet:
es: Ahora ya tienes un par de parches en el paquete.
fr: Vous avez maintenant un ensemble de correctifs.
it: Adesso si avranno una serie di patch.
ja: これで、一連のパッチができました。
zh_cn: 现在你有了一格系列的补丁。
zh_tw: 現在你有了一格系列的補丁。

source: Upstream bug fix: <file>debian/patches/fix-gentoo-target.patch</file>
ca: Correcció d'un error en el codi font: <file>debian/patches/fix-gentoo-target.patch</file>
es: Corrección de un error en el código fuente: <file>debian/patches/fix-gentoo-target.patch</file>
fr: correction d'un bogue amont : <file>debian/patches/fix-gentoo-target.patch</file> ;
it: Correzione del bug riguardante il sorgente originale: <file>debian/patches/fix-gentoo-target.patch</file>
ja: 上流のバグ修正： <file>debian/patches/fix-gentoo-target.patch</file>
zh_cn: 修复上游 Bug：<file>debian/patches/fix-gentoo-target.patch</file>
zh_tw: 修復上游 Bug：<file>debian/patches/fix-gentoo-target.patch</file>

source: Debian specific packaging modification: <file>debian/patches/install.patch</file>
ca: Una modificació específica de l'empaquetat Debian: <file>debian/patches/install.patch</file>
es: Una modificación específica del empaquetado Debian: <file>debian/patches/install.patch</file>
fr: modification spécifique à l'empaquetage Debian : <file>debian/patches/install.patch</file> ;
it: Modifica specifica per il sistema di pacchettizzazione Debian: <file>debian/patches/install.patch</file>
ja: Debian 固有のパッケージ上の変更： <file>debian/patches/install.patch</file>
zh_cn: Debian 特有的打包修改：<file>debian/patches/install.patch</file>
zh_tw: Debian 特有的打包修改：<file>debian/patches/install.patch</file>
