Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: The <file>Makefile</file> file follows the GNU conventions to support <tt>$(DESTDIR)</tt> variable (<file>/usr/share/doc/gnu-standards/standards.html#Makefile-Conventions</file>).
ca: Cal que el fitxer <file>Makefile</file> segueixi les convencions GNU i accepti la variable <tt>$(DESTDIR)</tt> (consulta <file>/usr/share/doc/gnu-standards/standards.html#Makefile-Conventions</file>).
es: El archivo <file>Makefile</file> debe seguir las convenciones GNU de forma que admita la variable <tt>$(DESTDIR)</tt>. (véase <file>/usr/share/doc/gnu-standards/standards.html#Makefile-Conventions</file>).
fr: le fichier <file>Makefile</file> suit les conventions GNU pour gérer la variable <tt>$(DESTDIR)</tt> (<file>/usr/share/doc/gnu-standards/standards.html#Makefile-Conventions</file>) ;
it: Il file <file>Makefile</file> è conforme alle convenzioni GNU supportando la variabile <tt>$(DESTDIR)</tt> (<file>/usr/share/doc/gnu-standards/standards.html#Makefile-Conventions</file>).
ja: <file>Makefile</file> ファイルが GNU の規約に従って <tt>$(DESTDIR)</tt> 変数 (<file>/usr/share/doc/gnu-standards/standards.html#Makefile-Conventions</file>) をサポートしていること。
zh_cn: <file>Makefile</file> 文件遵循 GNU 的规定支持 <tt>$(DESTDIR)</tt> 变量(<file>/usr/share/doc/gnu-standards/standards.html#Makefile-Conventions</file>)。
zh_tw: <file>Makefile</file> 檔案遵循 GNU 的規定支持 <tt>$(DESTDIR)</tt> 變量(<file>/usr/share/doc/gnu-standards/standards.html#Makefile-Conventions</file>)。

source: The source follows the Filesystem Hierarchy Standard (FHS).
ca: Cal que el codi font segueixi l'estàndard de la jerarquia del sistema de fitxers («Filesystem Hierarchy Standard» o FHS).
es: El código fuente sigue el estándar de la jerarquía del sistema de ficheros. («Filesystem Hierarchy Standard» o FHS).
fr: les sources suivent la norme de hiérarchie des fichiers (« Filesystem Hierarchy Standard » ou FHS).
it: Il sorgente è conforme allo Standard di Gerarchia dei Filesystem (FHS)
ja: そのソースが Filesystem Hierarchy Standard (FHS) に準拠していること。
zh_cn: 源代码遵循文件系统层级标准(FHS)。
zh_tw: 原始碼遵循檔案系統層級標準(FHS)。

source: Programs that use GNU <prgn>autoconf</prgn> <em>automatically</em> follow the GNU conventions and their packaging is almost <em>automatic</em>. With this and other heuristics, the <package>debhelper</package> package estimates that it works for about 90% of packages without making any intrusive changes to their build system. So the packaging is not as complicated as it may seem.
ca: Els programes que fan servir <prgn>autoconf</prgn> de GNU ﻿compleixen <em>automàticamente</em> amb les convencions GNU i el seu empaquetament es quasi <em>automàtic</em>. Amb aquests requisits i ﻿l'heurística emprada pel paquet <package>debhelper</package>, és possible empaquetar sense fer canvis en el sistema de compilació. L'empaquetament no es tan complicat com pot semblar.
es: Los programas que usan <prgn>autoconf</prgn> de GNU cumplen <em>automáticamente</em> con las convenciones GNU y su empaquetamiento es casi <em>automático</em>. Con estos requisitos y la heurística que aplica el paquete <package>debhelper</package>, se estima que funciona sobre el 90% de paquetes sin tener que realizar ningún cambio intrusivo en su sistema de construcción. El empaquetado no es tan complicado como puede parecer.
fr: Les programmes qui utilisent GNU <prgn>autoconf</prgn> suivent <em>automatiquement</em> la norme GNU et leur empaquetage est presque <em>automatique</em>. Avec ceci et d'autres paramètres, le paquet <package>debhelper</package> est estimé fonctionner pour 90 % des paquets sans modification intrusive à leur système de construction. L'empaquetage n'est donc pas aussi compliqué qu'il y parait.
it: I programmi che usano GNU <prgn>autoconf</prgn> sono <em>automaticamente</em> conformi alle convenzioni GNU e la loro pacchettizzazione è quasi <em>automatica</em>. Con questi ed altri accorgimenti, si stima che il pacchetto <package>debhelper</package> funzioni sul quasi il 90% dei pacchetti senza apportare pesanti modifiche al loro sistema di compilazione. La pacchettizzazione non è così complicata come potrebbe sembrare.
ja: GNU <prgn>autoconf</prgn> を使っているプログラムは、<em>自動的に</em> GNU 規約に準拠するので、そのパッケージ作成はほとんど <em>自動化</em>されます。こうしたことや他の経験からすると、<package>debhelperl</package> パッケージはビルドシステムに煩わしい変更を加えることなく、約 90% のパッケージで使えると推定されます。そのため、パッケージ作成は見かけほど複雑ではありません。
zh_cn: 使用 GNU <prgn>autoconf</prgn> 的程序 <em>自动</em> 遵守了 GNU 的规定，这些程序的打包也就 <em>几乎是自动的</em>。通过这项特点和其他启发式处理，<package>debhelper</package> 软件包可以直接打包约 90% 的软件包而不需对编译系统做出大的改变。所以打包也不是它看起来那样复杂。
zh_tw: 使用 GNU <prgn>autoconf</prgn> 的程式 <em>自動</em> 遵守了 GNU 的規定，這些程式的打包也就 <em>幾乎是自動的</em>。通過這項特點和其他啓發式處理，<package>debhelper</package> 套件可以直接打包約 90% 的套件而不需對編譯系統做出大的改變。所以打包也不是它看起來那樣複雜。

source: If you need to make changes in the <file>Makefile</file> file, you should make sure to support these <tt>$(DESTDIR)</tt> variable. The <tt>$(DESTDIR)</tt> variable is unset in it and is prepended to each file path used for the program installation. The packaging script will set <tt>$(DESTDIR)</tt> to the temporary directory.
ca: Per fer canvis en el fitxer <file>Makefile</file>, assegura't que permet fer servir la variable <tt>$(DESTDIR)</tt>. La variable <tt>$(DESTDIR)</tt> no es defineix a l'arxiu i s'afegirà a totes les adreces de directoris que es facin servir en la instal·lació del programa. El guió d'empaquetament estableix el valor de la variable <tt>$(DESTDIR)</tt> al valor del directori temporal d'instal·lació del programa en el procés de construcció del paquet.
es: Si debes hacer cambios en el archivo <file>Makefile</file>, debes asegurarte que admite la variable <tt>$(DESTDIR)</tt>. La variable <tt>$(DESTDIR)</tt> no está definida en el archivo y se añadirá en todas las rutas de directorios usadas en la instalación del programa. El guión de empaquetamiento establece el valor de la variable <tt>$(DESTDIR)</tt> al valor del directorio temporal de instalación del programa en el proceso de construcción del paquete.
fr: Si vous devez modifier le fichier <file>Makefile</file>, vous devriez vous assurer qu'il gère la variable <tt>$(DESTDIR)</tt>. La variable <tt>$(DESTDIR)</tt> n'y est pas configurée et précède chaque chemin de fichier utilisé par le programme d'installation. Le script d'empaquetage configurera <tt>$(DESTDIR)</tt> en tant que répertoire temporaire.
it: Se è necessario apportare modifiche al file <file>Makefile</file>, ci si dovrebbe assicurare che supporti la variabile <tt>$(DESTDIR)</tt>. La variabile <tt>$(DESTDIR)</tt> non è impostata nel <file>Makefile</file>, è anteposta ad ogni percorso del file, utilizzato per l'installazione del programma. Lo script di pacchettizzazione imposta la variabile <tt>$(DESTDIR)</tt> in una directory temporanea.
ja: もし <file>Makefile</file> ファイルを変更する必要があるなら、これら <tt>$(DESTDIR)</tt> 変数をサポートするようにしましょう。Makefile では <tt>$(DESTDIR)</tt> 変数は設定されておらず、プログラムのインストールに使われる各ファイルパスの前に付与されます。パッケージ作成スクリプトが <tt>$(DESTDIR)</tt> を一時ディレクトリにセットします。
zh_cn: 如果你需要修改 <file>Makefile</file> 文件，要确保其支持 <tt>$(DESTDIR)</tt> 变量。默认情况下 <tt>$(DESTDIR)</tt> 变量没有设置并且默认使用程序选择的安装位置。打包脚本会将 <tt>$(DESTDIR)</tt> 设置为临时目录。
zh_tw: 如果你需要修改 <file>Makefile</file> 檔案，要確保其支持 <tt>$(DESTDIR)</tt> 變量。默認情況下 <tt>$(DESTDIR)</tt> 變量沒有設置並且默認使用程式選擇的安裝位置。打包腳本會將 <tt>$(DESTDIR)</tt> 設置爲臨時目錄。

source: The temporary directory used by the <prgn>dh_auto_install</prgn> command is chosen as <file>debian/<var>package</var></file> for single binary packages. <footnote><p>For multiple binary packages, the <prgn>dh_auto_install</prgn> command uses <file>debian/tmp</file> as the temporary directory while the <prgn>dh_install</prgn> command with the help of <file>debian/<var>package-1</var>.install</file> and <file>debian/<var>package-2</var>.install</file> files will split contents of <file>debian/tmp</file> into <file>debian/<var>package-1</var></file> and <file>debian/<var>package-2</var></file> temporary directories to create multiple binary <file>*.deb</file> packages.</p></footnote> Everything that is contained in the temporary directory will be installed on a user's system when they install your package, the only difference is that <prgn>dpkg</prgn> will be installing the files in the root directory.
ca: El directori temporal fet servir per l'ordre <prgn>dh_auto_install</prgn> és <file>debian/<var>nom_del_paquet</var></file> per a paquets amb un arxiu binari <footnote><p>Si el paquet té més d'un binari, l'ordre <prgn>dh_auto_install</prgn> fa servir el directori temporal <file>debian/tmp</file> i l'ordre <prgn>dh_install</prgn> amb l'ajuda dels fitxers <file>debian/<var>paquet-1</var>.install</file> i <file>debian/<var>paquet-2</var>.install</file> distribuirà el contingut del directori <file>debian/tmp</file> en els directoris temporals <file>debian/<var>paquet-1</var></file> i <file>debian/<var>paquet-2</var></file> per tal de construir els paquets <file>*.deb</file> amb més d'un binari. </p></footnote>. El contingut complet del directori temporal s'instal·larà en el sistema de l'usuari quan aquest instal·li el paquet, amb la diferència que amb <prgn>dpkg</prgn> la instal·lació es fa des del directori arrel del sistema (en lloc del directori «debian/» o «debian/tmp» fet servir en la construcció del paquet).
es: El directorio temporal usado por la orden <prgn>dh_auto_install</prgn> es <file>debian/<var>nombre_de_paquete</var></file> para paquetes con un binario <footnote><p>Para paquetes con más de un archivo binario, la orden <prgn>dh_auto_install</prgn> utiliza como directorio temporal <file>debian/tmp</file> mientras que la orden <prgn>dh_install</prgn> con la ayuda de los archivos <file>debian/<var>paquete-1</var>.install</file> y <file>debian/<var>paquete-2</var>.install</file> distribuirá el contenido del directorio <file>debian/tmp</file> en los directorios temporales <file>debian/<var>paquete-1</var></file> y <file>debian/<var>package-2</var></file> para construir paquetes <file>*.deb</file> para más de un binario. </p></footnote>. El contenido completo del directorio temporal será instalado en en sistema del usuario cuando se instale el paquete, con la diferencia que con <prgn>dpkg</prgn> la instalación se realizará a partir del directorio raíz del sistema.
fr: Le répertoire temporaire utilisé par la commande <prgn>dh_auto_install</prgn> est choisi en tant que <file>debian/<var>paquet</var></file> pour les paquets binaires simples. <footnote><p>Pour les paquets binaires multiples, la commande <prgn>dh_auto_install</prgn> utilise <file>debian/tmp</file> comme répertoire temporaire alors que la commande <prgn>dh_install</prgn>, à l'aide des fichiers <file>debian/<var>paquet-1</var>.install</file> et <file>debian/<var>paquet-2</var>.install</file>, séparera le contenu de <file>debian/tmp</file> dans les répertoires temporaires <file>debian/<var>paquet-1</var></file> et <file>debian/<var>paquet-2</var></file> pour créer les paquets binaires multiples <file>*.deb</file>.</p></footnote> Le contenu du répertoire temporaire sera copié sur le système de l'utilisateur qui installera votre paquet, la seule différence est que <prgn>dpkg</prgn> placera ces fichiers dans le répertoire racine.
it: La directory temporanea, utilizzata dal comando <prgn>dh_auto_install</prgn>, è <file>debian/<var>pacchetto</var></file> per i pacchetti binari singoli. <footnote><p>Per i pacchetti binari multipli, il comando <prgn>dh_auto_install</prgn> utilizza la directory temporanea <file>debian/tmp</file>, mentre il comando <prgn>dh_install</prgn>, con l'aiuto dei file <file>debian/<var>pacchetto-1</var>.install</file> e <file>debian/<var>pacchetto-2</var>.install</file> suddivide il contenuto di <file>debian/tmp</file> nelle directory temporanee <file>debian/<var>pacchetto-1</var></file> e <file>debian/<var>pacchetto-2</var></file> per creare pacchetti binari multipli <file>*.deb</file>.</p></footnote> Tutto quello contenuto nella directory temporanea verrà installato sul sistema dell'utente, appena si installa il pacchetto, l'unica differenza è che <prgn>dpkg</prgn> installerà i file nella radice del file system.
ja: <prgn>dh_auto_install</prgn> コマンドが使う一時ディレクトリは、単一バイナリパッケージでは <file>debian/<var>package</var></file> のように指定されます。<footnote><p>複数バイナリパッケージでは、<prgn>dh_auto_install</prgn> コマンドは<file>debian/tmp</file> を一時ディレクトリとして使いますが、<prgn>dh_install</prgn> コマンドは <file>debian/<var>package-1</var>.install</file> や <file>debian/<var>package-2</var>.install</file> ファイルによって、<file>debian/tmp</file> の中身を <file>debian/<var>package-1</var></file> や <file>debian/<var>package-2</var></file> 一時ディレクトリに分配することで複数バイナリ <file>*.deb</file> パッケージを作成します。</p></footnote>一時ディレクトリに含まれているものは全て、ユーザがあなたのパッケージをインストールする時に、そのシステムにインストールされます。唯一の違いは、<prgn>dpkg</prgn> はファイルをルートディレクトリにインストールするということです。
zh_cn: 对于单个二进制包 <prgn>dh_auto_install</prgn> 将临时目录设置为 <file>debian/<var>package</var></file>。<footnote><p>对于多个二进制包，<prgn>dh_auto_install</prgn> 将临时目录设置为<file>debian/tmp</file>，而 <prgn>dh_install</prgn> 命令则将文件按照 <file>debian/<var>package-1</var>.install</file> 和 <file>debian/<var>package-2</var>.install</file> 等文件的描述将 <file>debian/tmp</file> 中的文件分别装入 <file>debian/<var>package-1</var></file> 和 <file>debian/<var>package-2</var></file> 等临时目录以创建 <file>*.deb</file> 软件包。</p></footnote> 临时目录中的全部文件都将在用户安装软件包时被安装到用户系统，唯一的区别是 <prgn>dpkg</prgn> 会把文件安装到真实的根目录树中。
zh_tw: 對於單個二進位套件 <prgn>dh_auto_install</prgn> 將臨時目錄設置爲 <file>debian/<var>package</var></file>。<footnote><p>對於多個二進位套件，<prgn>dh_auto_install</prgn> 將臨時目錄設置爲<file>debian/tmp</file>，而 <prgn>dh_install</prgn> 命令則將檔案按照 <file>debian/<var>package-1</var>.install</file> 和 <file>debian/<var>package-2</var>.install</file> 等檔案的描述將 <file>debian/tmp</file> 中的檔案分別裝入 <file>debian/<var>package-1</var></file> 和 <file>debian/<var>package-2</var></file> 等臨時目錄以創建 <file>*.deb</file> 套件。</p></footnote> 臨時目錄中的全部檔案都將在用戶安裝套件時被安裝到用戶系統，唯一的區別是 <prgn>dpkg</prgn> 會把檔案安裝到真實的根目錄樹中。

source: Bear in mind that even though your program installs in <file>debian/<var>package</var></file>, it still needs to behave correctly when placed in the root directory, i.e. when installed from the <file>.deb</file> package. So you must not allow the build system to hardcode strings like <tt>/home/me/deb/<var>package</var>-<var>version</var>/usr/share/<var>package</var></tt> into the package file.
ca: Tots els fitxers i directoris que s'instal·len en el directori <file>debian/<var>nom_del_paquet</var></file> en la construcció del paquet, huaràn de poder instal·lar-se correctament des del directori arrel quan s'instal·lin fent servir el fitxer <file>.deb</file>. No s'ha de fer servir cadenes del tipus <tt>/home/elmeu/deb/<var>nom_paquet</var>-<var>versió</var>/usr/share/<var>nom_paquet</var></tt> en la construcció del paquet.
es: Aunque el programa se instalen en el directorio <file>debian/<var>nombre_del_paquete</var></file> será necesario que se comporte correctamente cuando se instalen en el directorio raíz, esto es, cuando se instalen usando el archivo <file>.deb</file>. Debería evitar que el sistema de compilación incluya cadenas del tipo <tt>/home/mi/deb/<var>nombre_del_paquete</var>-<var>versión</var>/usr/share/<var>nombre_del_paquete</var></tt> en el fichero de paquete.
fr: Gardez à l'esprit que même si le programme s'installe dans <file>debian/<var>paquet</var></file>, il doit continuer à s'exécuter correctement quand il est installé dans le répertoire racine, c'est-à-dire quand il est installé à partir du paquet <file>.deb</file>. Vous ne devez donc pas laisser le système de construction coder en dur des chaînes de caractères comme <tt>/home/moi/deb/<var>paquet</var>-<var>version</var>/usr/share/<var>paquet</var></tt> dans les fichiers du paquet.
it: Bisogna tenere in considerazione che, anche se il programma viene installato in <file>debian/<var>pacchetto</var></file>, deve comunque rispettare i percorsi convenzionali, una volta posizionato nella radice, ad es. quando si installa un pacchetto <file>.deb</file>. Per questo motivo non bisogna consentire al sistema di compilazione di utilizzare stringhe impostate manualmente come costanti, ad esempio <tt>/home/me/deb/<var>package</var>-<var>version</var>/usr/share/<var>pacchetto</var></tt> nel file del pacchetto.
ja: パッケージの作成においては、プログラムは <file>debian/<var>package</var></file> にインストールされますが、例えば <file>.deb</file> パッケージからインストールされた時など、ルートディレクトリ以下に展開された場合も正しく動作できるようにしなければならない、ということを覚えておいてください。このため、ビルドシステムが <tt>/home/me/deb/<var>package</var>-<var>version</var>/usr/share/<var>package</var></tt> といった特定のパスを示す文字列をパッケージファイルの中に記録しないようにしなければなりません。
zh_cn: 请记住，即使你的程序正确安装到了<file>debian/<var>package</var></file>，仍然要考虑它可以在在实际的根目录中安装的情形，即从<file>.deb</file> 软件包文件安装的情形。所以绝对不允许将诸如 <tt>/home/me/deb/<var>package</var>-<var>version</var>/usr/share/<var>package</var></tt> 的内容硬编码到编译系统中并装入软件包文件。
zh_tw: 請記住，即使你的程式正確安裝到了<file>debian/<var>package</var></file>，仍然要考慮它可以在在實際的根目錄中安裝的情形，即從<file>.deb</file> 套件檔案安裝的情形。所以絕對不允許將諸如 <tt>/home/me/deb/<var>package</var>-<var>version</var>/usr/share/<var>package</var></tt> 的內容硬編碼到編譯系統中並裝入套件檔案。

source: Here's the relevant part of <package>gentoo</package>'s <file>Makefile</file> file <footnote><p>This is just an example to show how the <file>Makefile</file> file should look like. If the <file>Makefile</file> file is created by the <prgn>./configure</prgn> command, the correct way to fix this kind of <file>Makefile</file> is to executed the <prgn>./configure</prgn> command from the <prgn>dh_auto_configure</prgn> command with default options including <tt>--prefix=/usr</tt>.</p></footnote>:
ca: Aquest és la part important del fitxer <file>Makefile</file> del paquet <package>gentoo</package> <footnote><p>Només és un exemple del contingut de l'arxiu <file>Makefile</file>. Si el fitxer <file>Makefile</file> es construeix amb l'ordre <prgn>./configure</prgn>, el procediment correcte per solucionar això en l'arxiu <file>Makefile</file> és executar l'ordre <prgn>./configure</prgn> des de l'ordre <prgn>dh_auto_configure</prgn> amb les opcions predeterminades afegint l'opció <tt>--prefix=/usr</tt>. </p></footnote>:
es: Esta es la parte importante del <file>Makefile</file> de <package>gentoo</package> <footnote><p>Se trata solo de un ejemplo del contenido del archivo <file>Makefile</file>. Si el archivo <file>Makefile</file> se construye con la orden <prgn>./configure</prgn>, el procedimiento correcto es ejecutar <prgn>./configure</prgn> desde la orden <prgn>dh_auto_configure</prgn> con las opciones predeterminadas incluyendo <tt>--prefix=/usr</tt>.</p></footnote>:
fr: Voici les parties concernées du <file>Makefile</file> de <package>gentoo</package> <footnote><p>Il s'agit simplement d'un exemple pour montrer à quoi le fichier <file>Makefile</file> devrait ressembler. Si le fichier <file>Makefile</file> est créé par la commande <prgn>./configure</prgn>, la bonne façon de modifier ce genre de <file>Makefile</file> est d'exécuter la commande <prgn>./configure</prgn> à partir de la commande <prgn>dh_auto_configure</prgn> avec les options par défaut y compris <tt>--prefix=/usr</tt>.</p></footnote> :
it: Questa è la parte più importante del <file>Makefile</file> del pacchetto <package>gentoo</package> <footnote><p>Questo è solo un esempio che mostra come un <file>Makefile</file> dovrebbe apparire. Se il <file>Makefile</file> è creato dal comando <prgn>./configure</prgn>, il modo giusto per correggere il <file>Makefile</file> è eseguire il comando <prgn>./configure</prgn> dal comando <prgn>dh_auto_configure</prgn> includendo come opzione predefinita <tt>--prefix=/usr</tt>.</p></footnote>:
ja: <package>gentoo</package> の <file>Makefile</file> で該当する部分はこれです<footnote><p>これは <file>Makefile</file> ファイルがこうなっているべきである、ということを示すための例にすぎません。<file>Makefile</file> ファイルが <prgn>./configure</prgn> コマンドで作成されているなら、この手の <file>Makefile</file> を修正する正しい方法は、<prgn>dh_auto_configure</prgn> コマンドに <tt>--prefix=/usr</tt> を含むデフォルトのオプションを与えて、<prgn>./configure</prgn> コマンドを実行させることです。</p></footnote>:
zh_cn: 以下是 <package>gentoo</package> 的 <file>Makefile</file> 文件中的相关部分<footnote><p>这只是一个 <file>Makefile</file> 的例子。如果 <file>Makefile</file> 是通过 <prgn>./configure</prgn> 命令生成的，修复该类的 <file>Makefile</file> 的方法是通过 <prgn>dh_auto_configure</prgn> 执行 <prgn>./configure</prgn>，并带上如 <tt>--prefix=/usr</tt> 的默认选项。</p></footnote>：
zh_tw: 以下是 <package>gentoo</package> 的 <file>Makefile</file> 檔案中的相關部分<footnote><p>這只是一個 <file>Makefile</file> 的例子。如果 <file>Makefile</file> 是通過 <prgn>./configure</prgn> 命令生成的，修復該類的 <file>Makefile</file> 的方法是通過 <prgn>dh_auto_configure</prgn> 執行 <prgn>./configure</prgn>，並帶上如 <tt>--prefix=/usr</tt> 的默認選項。</p></footnote>：

source: # Where to put binary on 'make install'? BIN = /usr/local/bin # Where to put icons on 'make install'? ICONS = /usr/local/share/gentoo
ca: # On s'instal·larà el fitxer binari? BIN = /usr/local/bin # On instal·lar els icones? ICONS = /usr/local/share/gentoo/
es: # ¿Dónde poner el binario en «make install»? BIN = /usr/local/bin # ¿Dónde poner los iconos en «make install»? ICONS = /usr/local/share/gentoo/
fr: # Emplacement des binaires lors du 'make install' BIN = /usr/local/bin # Emplacement des icônes lors du 'make install' ICONS = /usr/local/share/gentoo
zh_cn: # make install 时放置二进制文件的位置 BIN = /usr/local/bin # make install 时放置图标文件的位置 ICONS = /usr/local/share/gentoo
zh_tw: # make install 時放置二進位檔案的位置 BIN = /usr/local/bin # make install 時放置圖示檔案的位置 ICONS = /usr/local/share/gentoo

source: We see that the files are set to install under <file>/usr/local</file>. Change those paths to:
ca: A l'exemple, els fitxers s'instal·laran en el directori <file>/usr/local</file>. Cal canviar l'ubicació a:
es: Vemos que los ficheros están configurados para instalarse bajo <file>/usr/local</file>. Cambia estas rutas a:
fr: Les fichiers sont configurés pour s'installer sous <file>/usr/local/</file>. Changez ces chemins en :
it: Da notare che i file verranno installati in <file>/usr/local</file>. Si modifichino questi percorsi con:
ja: ファイルが <file>/usr/local</file> 以下にインストールされるようになっていることがわかります。 このパスを以下のように変更してください：
zh_cn: 可以看到文件被放到了 <file>/usr/local</file> 下。把他们改变为：
zh_tw: 可以看到檔案被放到了 <file>/usr/local</file> 下。把他們改變爲：

source: # Where to put binary on 'make install'? BIN = $(DESTDIR)/usr/bin # Where to put icons on 'make install'? ICONS = $(DESTDIR)/usr/share/gentoo
ca: # On s'instal·larà el fitxer binari? BIN = $(DESTDIR)/usr/bin # On instal·lar els icones? ICONS = $(DESTDIR)/usr/share/gentoo
es: # ¿Dónde poner el binario en «make install»? BIN = $(DESTDIR)/usr/bin # ¿Dónde poner los iconos en «make install»? ICONS = $(DESTDIR)/usr/share/gentoo
fr: # Emplacement des binaires lors du 'make install' BIN = $(DESTDIR)/usr/bin # Emplacement des icônes lors du 'make install' ICONS = $(DESTDIR)/usr/share/gentoo
zh_cn: # make install 时放置二进制文件的位置 BIN = $(DESTDIR)/usr/bin # make install 时放置图标文件的位置 ICONS = $(DESTDIR)/usr/share/gentoo
zh_tw: # make install 時放置二進位檔案的位置 BIN = $(DESTDIR)/usr/bin # make install 時放置圖示檔案的位置 ICONS = $(DESTDIR)/usr/share/gentoo
