Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: Debian New Maintainers' Guide
ca: Guia del nou desenvolupador de Debian
es: Guía del nuevo desarrollador de Debian
fr: Guide du nouveau responsable Debian
it: Guida per il nuovo Maintainer
ja: Debian 新メンテナガイド
zh_cn: Debian 新维护人员手册
zh_tw: Debian 新維護人員手冊

source: version &docversion;, &docisodate;
ca: versió &docversion;, &docisodate;
es: versión &docversion;, &docisodate;
zh_cn: 版本 &docversion;， &docisodate;
zh_tw: 版本 &docversion;， &docisodate;

source: Copyright &copy; 2005-2010 Osamu Aoki
ca: Copyright &copy; 2005-2007 Osamu Aoki.

source: This document may be used under the terms the GNU General Public License version 2 or higher.
ca: Aquest document es publica amb llicència pública GNU versió 2 o posterior.
es: Este documento puede utilizarse en los términos descritos en la Licencia Pública GNU versión 2 o posterior.
fr: Ce document peut être utilisé selon les termes de la Licence publique générale de GNU version 2 ou suivante.
it: Questa guida può essere utilizzata nei termini della GNU General Public License versione 2 o successive.
ja: この文書は GNU 一般公有使用許諾書、バージョン 2 かそれ以降が規定する条件の下で使用できます。
zh_cn: 本文档可在 GNU 通用公共许可证第二版或更高版本的条款规定下使用。
zh_tw: 本文件可在 GNU 通用公共許可證第二版或更高版本的條款規定下使用。

source: This document was made using with these two documents as examples:
ca: Aquest document s'ha escrit fent servir aquest dos documents com a exemples:
es: Este documento se ha escrito usando estos dos documentos como ejemplo:
fr: Ce document a été créé en se basant sur les deux suivants :
it: Questo documento è stato realizzato utilizzando come modello i documenti seguenti:
ja: この文書は以下の二つの文書を参考にして書かれました。
zh_cn: 本文档在撰写过程中参考了以下两篇文档：
zh_tw: 本文件在撰寫過程中參考了以下兩篇文件：

source: Getting started The Right Way
ca: Començant correctament.
es: Empezando «de la forma correcta».
fr: Partir du bon pied
it: Partire nel modo giusto
ja: まずは「正しいやり方で」始めよう
zh_cn: 从一条正确的路开始
zh_tw: 從一條正確的路開始

source: This document tries to describe building of a Debian package to the common Debian user, and the prospectus developer. It uses pretty common language, and it's well covered with working examples. There is an old Roman saying, <em>Longum iter est per preaecepta, breve et efficax per exempla!</em> (It's a long way by the rules, but short and efficient with examples!).
ca: Aquest document descriurà com es construeix un paquet Debian GNU/Linux per a un usuari comú Debian i per a futurs desenvolupadors, fent servir un llenguatge informat i incloent molts exemples. Un antic dit romà diu <em>Longum iter est per preaecepta, breve et efficax per exempla!</em> («És un llarg camí amb les normes, però curt i eficient amb els exemples»).
es: Este documento tratará de describir cómo se construye un paquete Debian GNU/Linux para el usuario común de Debian y para futuros desarrolladores en un lenguaje informal, y con multitud de ejemplos. Hay un antiguo dicho romano que dice, «<em>Longum iter est per preaecepta, breve et efficax per exempla!</em>» (¡Es un largo camino con las reglas, pero corto y eficiente con ejemplos!).
fr: Ce document essaie de décrire à l'utilisateur Debian moyen, et au développeur en devenir, la construction d'un paquet Debian. Il utilise un langage assez courant et est complété par des exemples, selon le vieux proverbe romain : « <em>Longum iter est per preaecepta, breve et efficax per exempla !</em> » (c'est long par la règle, court et efficace par l'exemple !).
it: Questo documento ha l'obiettivo di descrivere le procedure necessarie per la costruzione di un pacchetto Debian GNU/Linux, per un normale utente Debian e aspirante sviluppatore, utilizzando un linguaggio immediato e con l'ausilio di esempi concreti. C'è un detto latino che dice <em>Longum iter est per preaecepta, breve et efficax per exempla!</em> (La via è lunga usando la teoria, ma breve ed efficiente con gli esempi!).
ja: この文書では、Debian パッケージを作るにはどうしたらよいか、一般的な Debian ユーザと開発者予備軍を対象に解説しようと思います。小難しい専門用語はできるだけ避けて、実用的な例を多く用いて説明していくつもりです。ことわざにもあるように、<em>百聞は一見にしかず</em>ですからね!
zh_cn: 本文档试图为普通 Debian 用户，和希望对 Debian 软件包有所了解的开发人员讲述如何制作 Debian 软件包。它使用了通俗的语言，并辅以大量可用于实践的示例。有一句古罗马谚语说得好：<em>一例胜千言！</em>
zh_tw: 本文件試圖爲普通 Debian 用戶，和希望對 Debian 套件有所瞭解的開發人員講述如何製作 Debian 套件。它使用了通俗的語言，並輔以大量可用於實踐的範例。有一句古羅馬諺語說得好：<em>一例勝千言！</em>

source: This document has been updated for the Debian <tt>squeeze</tt> release. <footnote><p>The document assumes you are using the <tt>squeeze</tt> system. If you need to follow this text in the <tt>lenny</tt> system, you must install backported <package>dpkg</package> and <package>debhelper</package> packages, at least.</p></footnote>
ca: Aquest document està actualitzat a la versió <tt>squeeze</tt> de Debian <footnote><p>En el document s'assumeix que fas servir la versió <tt>squeeze</tt>. Si vols fer servir aquest document amb la versió <tt>lenny</tt>, cal que tenguis instal·lats (com a mínim) els paquets <package>dpkg</package> i <package>debhelper</package>. </p></footnote>.
es: Este documento está actualizado a la versión <tt>squeeze</tt> de Debian <footnote><p>El documento asume que estás utilizando la versión <tt>squeeze</tt>. Si quieres utilizar este documento con la versión <tt>lenny</tt>, debes instalar (como mínimo) la versión «backport» de los paquetes <package>dpkg</package> y <package>debhelper</package>.</p></footnote>.
fr: Ce document a été mis à jour pour la version <tt>Squeeze</tt> de Debian. <footnote><p>Ce document suppose que vous utilisez le système <tt>Squeeze</tt>. Si vous avez l'intention de suivre ce texte avec un système <tt>Lenny</tt>, vous devez au moins installer les paquets <package>dpkg</package> et <package>debhelper</package> rétroportés.</p></footnote>
it: Questo documento è stato aggiornato per la distribuzione Debian <tt>squeeze</tt>. <footnote><p>Nel documento si suppone l'utilizzo di un sistema <tt>squeeze</tt>. Se si intende seguire questo documento per un sistema <tt>lenny</tt>, bisognerebbe almeno installare delle versioni backport (n.d.t. versioni dei programmi presenti nei pacchetti di testing e unstable, compilate per poter funzionare in un sistema stable) di <package>dpkg</package> e <package>debhelper</package>.</p></footnote>
ja: この文書は、Debian <tt>squeeze</tt> リリース用に更新されています。<footnote><p>文中では、<tt>squeeze</tt> のシステムを使っていると想定しています。この文書を <tt>lenny</tt> のシステム用として読みたいのであれば、少なくともバックポートされた <package>dpkg</package> および <package>debhelper</package> パッケージをインストールする必要があります。</p></footnote>
zh_cn: 本文档已经为 Debian <tt>squeeze</tt> 进行了更新。 <footnote><p>本文档默认您使用 <tt>squeeze</tt> 为操作系统。如果你需要在 <tt>lenny</tt> 系统上使用本文档记述的方法，则至少必须安装 backports 的 <package>dpkg</package> 和 <package>debhelper</package> 软件包。</p></footnote>
zh_tw: 本文件已經爲 Debian <tt>squeeze</tt> 進行了更新。 <footnote><p>本文件默認您使用 <tt>squeeze</tt> 爲作業系統。如果你需要在 <tt>lenny</tt> 系統上使用本文件記述的方法，則至少必須安裝 backports 的 <package>dpkg</package> 和 <package>debhelper</package> 套件。</p></footnote>

source: One of the things that makes Debian such a top-notch distribution is its package system. While there is a vast quantity of software already in the Debian format, sometimes you need to install software that isn't. You may be wondering how you can make your own packages and perhaps you think it is a very difficult task. Well, if you are a real novice on Linux, it is hard, but if you were rookie, you wouldn't be reading this doc now. :-) You do need to know a little about Unix programming but you certainly don't need to be a wizard.
ca: Una de les característiques que fan de Debian una de les distribucions més importants del mercat és el seu sistema de paquets. Tot i què hi ha una gran quantitat de programes disponibles en paquets de Debian, de vegades pots haver de fer servir programes que no estan disponibles en aquest format. Pot ésser que et demanis com construir els teus paquets i que pensis que és una tasca difícil. Bé doncs, si ets un principiant en GNU/Linux, pot ésser difícil, però si acabes de començar amb aquest sistema, no és recomanable que comencis per aquí :-). Cal saber algunes coses sobre programació en Unix, tot i què no és necessari ésser un mestre.
es: Una de las cosas que hace a Debian una de las distribuciones más importantes del mercado es su sistema de paquetes. Aunque hay una gran cantidad de programas disponibles en forma de paquetes de Debian, algunas veces necesitarás instalar programas que no están disponible en este formato. Puede que te preguntes cómo hacer tus propios paquetes y que pienses que quizás ésta es una tarea demasiado difícil. Bueno, si eres un principiante en GNU/Linux, sí es duro, pero si eres un novato, no deberías estar leyendo esto ahora mismo. :-) Necesitas saber algo sobre programación en Unix, pero, desde luego, no tienes que ser un maestro.
ja: Debian が最高峰の ディストリビューションと呼ばれるまでになった理由のひとつが、そのパッケージ管理システムです。すでに膨大な数のソフトウェアが Debian 形式で配布されていますが、まだパッケージ化されていないソフトウェアを、インストールしなければならないこともあるでしょう。あるいは、どうやったら自分でパッケージが作れるんだろう、とか、それはとても難しいことなんじゃないか、などと考えたことがあるかもしれません。まあ、もしあなたが本当に駆け出しの Linux ユーザなら難しいでしょうが、でもそうだったら今ごろこんな文書読んでませんて :-) パッケージを作成するには、Unix のプログラミングについてある程度知っている必要がありますが、神様みたいに精通している必要は全くありません。
zh_cn: Debian 能够成为一个顶级的发行版的原因之一就是它的软件包系统。尽管相当数量的软件已经被以 Debian 格式打包，有时还是需要安装一些不是这一格式的软件。可能你会为如何制作自己的软件包而迷惑，并可能认为这是很困难的任务。是的，如果你是一个 Linux 初学者，那么这的确很难；不过如果你真的只是一个新手，现在也不会来读这篇文档了。:-) 你的确需要对 Unix 编程有所了解，但显然不需要是这方面的天才。

source: One thing is certain, though: to properly create and maintain Debian packages you need many hours. Make no mistake, for our system to work the maintainers need to be both technically competent and diligent.
ca: Tot i així, una cosa és del tot segura: per construir i fer el manteniment de paquets Debian adequadament, calen moltes hores. Per a què el nostre sistema no tengui errors, cal que els nostres desenvolupadors siguin tècnicament competents.
es: Sin embargo, hay una cosa que es verdad: para construir y mantener paquetes Debian adecuadamente, necesitarás muchas horas. Para que nuestro sistema trabaje sin errores, nuestros desarrolladores necesitan ser técnicamente competentes y concienzudos.
fr: Une chose est sûre, cependant : pour créer et maintenir correctement des paquets Debian, il faut beaucoup de temps. Ne vous faites pas d'illusion, pour que votre système fonctionne, les responsables doivent à la fois être techniquement compétents et consciencieux.
it: Una cosa però è certa: per creare in maniera corretta e manutenere dei pacchetti Debian serviranno svariate ore di lavoro. Per far funzionare il nostro sistema, i maintainer devono stare attenti a non commettere errori, essere scrupolosi e tecnicamente competenti.
ja: ただ、確かなことがひとつあります。Debian パッケージをきちんと作成し、保守していくには、手間を惜しんではならない、ということです。間違えないでください。Debian のシステムをうまく動かしていくためには、メンテナは技術的に有能であるだけでなく、勤勉であることも必要なのです。
zh_cn: 有一件事是非常明确的：创建并维护一个 Debian 软件包需要花费很多时间。为了能够不犯错误，维护者需要良好的技术基础并十分勤奋。
zh_tw: 有一件事是非常明確的：創建並維護一個 Debian 套件需要花費很多時間。爲了能夠不犯錯誤，維護者需要良好的技術基礎並十分勤奮。

source: This document will explain every little (at first maybe irrelevant) step, and help you create that first package, and to gain some experience in building next releases of that and maybe other packages later on.
ca: Aquest document explicarà cada pas (fins i tot els més irrellevants), t'ajudarà a construir el teu primer paquet, a experimentar la construcció de noves versions i, tal vegada, a construir altres paquets més endavant.
es: Este documento explicará cada pequeño paso (al principio quizás irrelevantes), te ayudará a construir tu primer paquete, ganar alguna experiencia en construir próximas versiones de él, y quizás otros paquetes después.
fr: Ce document va expliquer toutes les étapes les plus petites (et peut-être a priori insignifiantes), vous aider à créer ce premier paquet, et à gagner de l'expérience pour construire les versions suivantes ainsi peut-être que d'autres paquets.
it: Questo documento spiegherà ogni piccolo (e forse all'inizio irrilevante) passo, aiuterà nella creazione del primo pacchetto e ad acquisire l'esperienza necessaria per manutenerne i successivi rilasci e possibilmente creare in futuro ulteriori pacchetti.
ja: この文書では (最初は関係無さそうに思えることまで) どんな 細かい手順も余さず説明します。 ともかく一つ作ってしまえば、あとは次のリリース、そして 他のパッケージへと経験を積んでいけばよいのです。
zh_cn: 本文档会讲述每一个细节(在开始时或许给人感觉毫不相关)，并帮助你创建出自己的第一个 Debian 软件包，从而使你学习到如何打包该软件的下一个版本或其他软件的经验。
zh_tw: 本文件會講述每一個細節(在開始時或許給人感覺毫不相關)，並幫助你創建出自己的第一個 Debian 套件，從而使你學習到如何打包該軟體的下一個版本或其他軟體的經驗。

source: If you need some help on packaging, please read <ref id="helpme">.
ca: Si vols més informació sobre la construcció de paquets, llegeix <ref id="helpme">.
es: Si quieres información complementaria sobre cómo construir paquetes lee <ref id="helpme">.
fr: Si vous avez besoin d'aide sur l'empaquetage, veuillez vous reporter en <ref id="helpme">.
it: Se è necessario qualche aiuto sulla pacchettizzazione, si consiglia la lettura di <ref id="helpme">.
ja: パッケージ作成において手助けが必要なら、<ref id="helpme">を読んでください。
zh_cn: 如果需要帮助，请阅读 <ref id="helpme">。
zh_tw: 如果需要幫助，請閱讀 <ref id="helpme">。

source: Newer versions of this document should always be available online at <url id="http://www.debian.org/doc/maint-guide/" name="http://www.debian.org/doc/maint-guide/"> and in the <package>maint-guide</package> package.
ca: Les noves versions d'aquest document es publiquen a <url id="http://www.debian.org/doc/maint-guide/" name="http://www.debian.org/doc/maint-guide/"> i es distribueix en el paquet <package>maint-guide</package>.
es: Las nuevas versiones de este documento están en <url id="http://www.debian.org/doc/maint-guide/" name="http://www.debian.org/doc/maint-guide/"> y en el paquete <package>maint-guide</package>.
fr: Les nouvelles versions de ce document devraient toujours être disponibles en ligne sur <url id="http://www.debian.org/doc/maint-guide/" name="http://www.debian.org/doc/maint-guide/">. La version de référence en anglais est disponible sur <url id="http://www.debian.org/doc/maint-guide/index.en.html" name="http://www.debian.org/doc/maint-guide/index.en.html"> et dans le paquet <package>maint-guide</package>. La traduction en français est également disponible dans le paquet <package>maint-guide-fr</package>.
it: Le versioni aggiornate di questo documento dovrebbero essere disponibili all'indirizzo <url id="http://www.debian.org/doc/maint-guide/" name="http://www.debian.org/doc/maint-guide/"> e nel pacchetto <package>maint-guide</package>. La traduzione in italiano è disponibile anche nel pacchetto <package>maint-guide-it</package>.
ja: この文書の最新版は常に以下の場所からネットワーク経由で入手できます。<url id="http://www.debian.org/doc/maint-guide/" name="http://www.debian.org/doc/maint-guide/"> また、「<package>maint-guide</package>」パッケージにも含まれています。日本語訳は「<package>maint-guide-ja</package>」パッケージの中にあります。
zh_cn: 本文档的最新版始终可在 <url id="http://www.debian.org/doc/maint-guide/" name="http://www.debian.org/doc/maint-guide/"> 和 <package>maint-guide</package> 软件包中找到，其简体中文版也可在 <package>maint-guide-zh-cn</package> 软件包中获得。
zh_tw: 本文件的最新版始終可在 <url id="http://www.debian.org/doc/maint-guide/" name="http://www.debian.org/doc/maint-guide/"> 和 <package>maint-guide</package> 套件中找到，其繁體中文版也可在 <package>maint-guide-zh-tw</package> 套件中獲得。

source: Programs you need for development
ca: Programes necessaris per treballar.
es: Programas necesarios para el desarrollo
fr: Programmes nécessaires au développement
it: Programmi necessari per lo sviluppo
ja: 開発に必要なプログラム
zh_cn: 开发时需要的软件
zh_tw: 開發時需要的軟體

source: Before you start anything, you should make sure that you have properly installed some additional packages needed for development. Note that the list doesn't contain any packages marked <tt>essential</tt> or <tt>required</tt> - we expect that you have those installed already.
ca: Abans de començar, cal instal·lar els paquets necessaris per a la construcció de paquets. A la llista de paquets no ﻿estan inclosos paquets amb prioritat «essencial» o «﻿requerit» (<tt>essential</tt> i <tt>required</tt>) degut a què segurament ja estan instal·lats.
es: Antes de empezar, deberías asegurarte de que tienes instalados algunos paquetes adicionales necesarios para el desarrollo. Observa que en la lista no están incluidos paquetes cuyas prioridades son «esencial» o «requerido», que se suponen ya instalados.
fr: Avant de commencer quoi que ce soit, vous devriez vous assurer d'avoir correctement installé certains paquets nécessaires au développement. Notez que la liste ne contient aucun paquet marqué <tt>essential</tt> ou <tt>required</tt> (essentiel ou requis) &mdash; nous supposons que ceux-ci sont déjà installés.
it: Prima di iniziare, bisogna assicurarsi di avere installato correttamente alcuni pacchetti aggiuntivi, necessari per lo sviluppo. Da notare che la lista non contiene nessun pacchetto etichettato come <tt>essenziale</tt> o <tt>richiesto</tt> - ci aspettiamo che siano già installati nel sistema.
ja: 何はさておき、開発に必要なパッケージがきちんとインストールされていることを確認せねばなりません。以下のリストには「essential」または「required」なパッケージが含まれていないことに注意してください。要するに、これらのパッケージは既にインストールされていることを前提としています。
zh_cn: 在开始之前，你需要确认你是否已经正确安装了开发所需要的附加软件包。注意这些软件包不包含任何已经被标记为 <tt>essential</tt> 或 <tt>required</tt> —— 我们假设你已经安装了它们。
zh_tw: 在開始之前，你需要確認你是否已經正確安裝了開發所需要的附加套件。注意這些套件不包含任何已經被標記爲 <tt>essential</tt> 或 <tt>required</tt> —— 我們假設你已經安裝了它們。

source: The following packages come with the standard Debian installation, so you probably have them already (along with any additional packages they depend on). Still, you should check it with "<tt>aptitude show <var>package</var></tt>".
ca: Els següents paquets estan inclosos en una instal·lació ﻿estàndard de Debian: probablement ja els tens en el teu sistema (i també els paquets dels quals depenen). Tot i així, pots fer la comprovació executant (en el terminal) "<tt>aptitude show <var>package</var></tt>".
es: Los siguientes paquetes vienen en una instalación estándar de Debian, así que probablemente ya los tengas (junto con los paquetes de los que dependen). Aún así, deberías comprobarlo ejecutando "<tt>aptitude show <var>nombre_del_paquete</var></tt>".
fr: Les paquets suivants sont fournis dans l'installation standard de Debian, de sorte que vous les avez probablement déjà (ainsi que les paquets supplémentaires dont ils dépendent). Néanmoins, vous devriez le vérifier avec « <tt>aptitude show <var>paquet</var></tt> ».
it: I seguenti pacchetti fanno parte dell'installazione standard di Debian, per cui probabilmente sono già presenti nel sistema (insieme ai pacchetti aggiuntivi dai quali dipendono). Si può effettuare un controllo con "<tt>aptitude show <var>pacchetto</var></tt>".
ja: 以下のパッケージは Debian の「標準」(standard) インストール 構成に含まれており、すでに (それらが依存する他のパッケージと いっしょに) システムに含まれているはずです。 しかし、念のために「<tt>aptitude show <var>パッケージ名</var></tt>」 で確認しておきましょう。
zh_cn: 以下这些软件包已经随标准的 Debian 安装而在系统中，所以你可能不需要再动手安装它们(以及任何附加的依赖软件包)。然而，你还是应该用 <tt>aptitude show <var>package</var></tt> 来检查一下。
zh_tw: 以下這些套件已經隨標準的 Debian 安裝而在系統中，所以你可能不需要再動手安裝它們(以及任何附加的依賴套件)。然而，你還是應該用 <tt>aptitude show <var>package</var></tt> 來檢查一下。

source: The most important package to install on your development system is the <package>build-essential</package> package. Once you try to install it, it will <em>pull in</em> other packages required to have a basic build environment.
ca: El paquet imprescindible per al desenvolupament és <package>build-essential</package>. Quan s'instal·la, <em>també s'instal·len</em> altres paquets necessaris, obtenint-se la instal·lació bàsica per a la construcció de paquets.
es: El paquete imprescindible para el desarrollo es <package>build-essential</package>. Al instalarlo, <em>también se instalaran otros paquetes</em> requeridos, consiguiendo una instalación básica para la construcción de paquetes.
fr: Le paquet le plus important à installer sur un système de développement est <package>build-essential</package>. Lors de son installation, il <em>tirera</em> avec lui d'autres paquets nécessaires à un environnement de compilation de base.
it: Il pacchetto più importante da installare in un sistema in cui si ha intenzione di sviluppare è <package>build-essential</package>. Questo <em>includerà</em> altri pacchetti necessari per avere un ambiente di base per la compilazione dei programmi.
ja: 開発用システムにインストールする一番重要なパッケージは、<package>build-essential</package> です。これをインストールしようとすると、基本的なビルド環境に必要な他のパッケージを <em>集めて</em> くるでしょう。
zh_cn: 在开发系统中要安装的最重要的软件包是 <package>build-essential</package>。当你安装它的时候，将会自动把基本编译环境里所需的其他软件包一并安装。
zh_tw: 在開發系統中要安裝的最重要的套件是 <package>build-essential</package>。當你安裝它的時候，將會自動把基本編譯環境裏所需的其他套件一併安裝。

source: For some types of packages, that is all you will require, however there is another set of packages that while not essential for all package builds are useful to have install or may be required by your package:
ca: Per a la construcció d'alguns paquets, amb això seria suficient, però n'hi ha d'altres que, sense ésser imprescindibles, pot ésser útil instal·lar-los o, fins i tot, necessaris:
es: Para la construcción de algunos paquetes esto seria suficiente, pero hay otros paquetes que, no siendo esenciales en general para la construcción de nuevos paquetes, puede ser útil tener instalados o, incluso, necesarios para el paquete que estás construyendo:
fr: Pour certaines catégories de paquets, c'est tout ce dont vous aurez besoin. Cependant d'autre paquets, bien que non essentiels à toutes les constructions de paquet, sont utile ou peuvent être nécessaire pour votre paquet :
it: Per alcuni tipi di pacchetti questo è tutto quello che serve, ci sono però una serie di pacchetti che, pur non essendo essenziali per lo sviluppo, vengono in aiuto allo sviluppatore o possono essere richiesti dal pacchetto su cui si lavora:
ja: パッケージの種類によっては、必要になるのはこれで全てかもしれません。ただ、全てのパッケージ作成に必須ではないにせよ、インストールしておくと便利だったり、パッケージによっては必要になったりするパッケージ群があります：
zh_cn: 对于某些类型的软件，以上的就是所需要的全部。然而还有一组软件包虽不是对于所有软件包都必须，却可能对你有用或被你的软件包所需要：
zh_tw: 對於某些類型的軟體，以上的就是所需要的全部。然而還有一組套件雖不是對於所有套件都必須，卻可能對你有用或被你的套件所需要：

source: <package>file</package> - this handy program can determine what type a file is. (see <manref section="1" name="file">)
ca: <package>file</package> - aquest programa és molt útil per saber de quin tipus és un fitxer determinat (﻿consulta <manref section="1" name="file">).
es: <package>file</package> - este útil programa puede determinar de qué tipo es un fichero (véase <manref section="1" name="file">).
fr: <package>file</package> &mdash; ce programme pratique peut déterminer la nature d'un fichier (voir <manref section="1" name="file">) ;
it: <package>file</package> - questo semplice programma stabilisce la tipologia di un file. (vedere <manref section="1" name="file">)
ja: <package>file</package> - この便利なプログラムを使うと、そのファイルがどういう形式のものか判定することができます (詳しくは <manref section="1" name="file"> を参照)。
zh_cn: <package>file</package> - 这个小程序可以检测文件的类型。(参看 <manref section="1" name="file">)
zh_tw: <package>file</package> - 這個小程式可以檢測檔案的類型。(參考 <manref section="1" name="file">)
