Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: This ensures to run $(MAKE) with all the default arguments given by the <prgn>dh_auto_build</prgn> command and <tt>build</tt> argument.
ca: D'aquest forma es garanteix l'execució de $(MAKE) amb tots els arguments predeterminats per l'ordre <prgn>dh_auto_build</prgn> i del argument <tt>build</tt>.
es: De esta forma se garantiza la ejecución de $(MAKE) con todos los argumentos predeterminados dados por la orden <prgn>dh_auto_build</prgn> y del argumento <tt>build</tt>.
fr: Ceci garanti d'exécuter $(MAKE) avec toutes les options par défaut données à la commande <prgn>dh_auto_build</prgn> avec en plus le paramètre <tt>build</tt>.
it: Questo ci assicura che $(MAKE) verrà eseguito con tutti i parametri predefiniti del comando <prgn>dh_auto_build</prgn> ed il parametro di <tt>build</tt>.
ja: $(MAKE)を、<prgn>dh_auto_build</prgn>コマンドと<tt>build</tt>コマンドにデフォルトで与えられた引数すべてを確実に実行します。
zh_cn: 这保证了 $(MAKE) 会使用 <prgn>dh_auto_build</prgn> 传递的所有参数并编译处理 <tt>build</tt> 这个 target。
zh_tw: 這保證了 $(MAKE) 會使用 <prgn>dh_auto_build</prgn> 傳遞的所有參數並編譯處理 <tt>build</tt> 這個 target。

source: If <file>Makefile</file> of a source for <package>gentoo</package> requires you to specify the <tt>packageclean</tt> target to clean it for Debian package instead of the <tt>distclean</tt> or <tt>clean</tt> targets in the <file>Makefile</file> file, you create an <tt>override_dh_auto_clean</tt> target to enable it.
ca: Si el fitxer <file>Makefile</file> de les fonts de <package>gentoo</package> requereix l'especificació de l'objectiu <tt>packageclean</tt> (per fer neteja després de la compilació), en lloc dels objectius <tt>distclean</tt> o <tt>clean</tt> a l'arxiu <file>Makefile</file> pots afegir un objectiu <tt>override_dh_auto_clean</tt> per habilitar l'ordre.
es: Si el <file>Makefile</file> de las fuentes de <package>gentoo</package> requiere la especificación del objetivo <tt>packageclean</tt> para limpiarlo, en lugar de los objetivos <tt>distclean</tt> o <tt>clean</tt> en el archivo <file>Makefile</file>, puedes añadir un objetivo <tt>override_dh_auto_clean</tt> para habilitarlo.
fr: Si le <file>Makefile</file> des sources de <package>gentoo</package> oblige à préciser la cible <tt>packageclean</tt> pour nettoyer le paquet Debian à la place des cibles <tt>distclean</tt> ou <tt>clean</tt> dans le fichier <file>Makefile</file>, vous pouvez créer une cible <tt>override_dh_auto_clean</tt> pour ce faire.
ja: もし、<package>gentoo</package>のソースの<file>Makefile</file>が、<tt>distclean</tt> や <tt>clean</tt> ターゲットの代わりに<tt>packageclean</tt>ターゲットを要求する場合は、<tt>override_dh_auto_clean</tt>ターゲットを作ることで、有効になります。
zh_cn: 如果 <package>gentoo</package> 的 <file>Makefile</file> 需要指定 <tt>packageclean</tt> 作为其清理用的 target，而非 Debian 软件包通常使用的 <tt>distclean</tt> 或 <tt>clean</tt>，你可以创建一个 <tt>override_dh_auto_clean</tt> target 来启用它。
zh_tw: 如果 <package>gentoo</package> 的 <file>Makefile</file> 需要指定 <tt>packageclean</tt> 作爲其清理用的 target，而非 Debian 套件通常使用的 <tt>distclean</tt> 或 <tt>clean</tt>，你可以創建一個 <tt>override_dh_auto_clean</tt> target 來啓用它。

source: If <file>Makefile</file> of a source for <package>gentoo</package> contains <tt>test</tt> target which you do not want to run for the Debian package building process, you can use empty <tt>override_dh_auto_test</tt> target to skip it.
ca: Si el fitxer <file>Makefile</file> de les fonts de <package>gentoo</package> té un objectiu <tt>test</tt> i desitges que no s'executi en la construcció del paquet, pots fer servir l'objectiu <tt>override_dh_auto_test</tt> sense ordres per tal de que no es faci res.
es: Si el <file>Makefile</file> de las fuentes de <package>gentoo</package> contiene un objetivo <tt>test</tt> que no deseas que se ejecute en la construcción del paquete Debian, puedes usar un objetivo <tt>override_dh_auto_test</tt> sin órdenes para ignorarlo.
fr: Si le <file>Makefile</file> des sources pour <package>gentoo</package> contient une cible <tt>test</tt> dont vous ne voulez pas pour exécuter le processus de construction du paquet Debian, vous pouvez utiliser une cible <tt>override_dh_auto_test</tt> vide pour l'omettre.
it: Se il <file>Makefile</file> di un sorgente per il pacchetto <package>gentoo</package> contiene l'obiettivo <tt>test</tt> che non vuole essere eseguito nel processo di costruzione del pacchetto Debian, si può utilizzare l'obiettivo <tt>override_dh_auto_test</tt> per saltarlo.
ja: もし、<package>gentoo</package>のソースの<file>Makefile</file>が、<tt>test</tt>ターゲットを含み、Debianパッケージをビルドする過程で実行されたくない場合は、空の<tt>override_dh_auto_clean</tt>ターゲットを作ることで、スキップできます。
zh_cn: 如果 <package>gentoo</package> 的 <file>Makefile</file> 包含了一个 <tt>test</tt> target 但你不想在 Debian 软件包编译过程中运行它，可以使用空的 <tt>override_dh_auto_test</tt> target 来跳过它。
zh_tw: 如果 <package>gentoo</package> 的 <file>Makefile</file> 包含了一個 <tt>test</tt> target 但你不想在 Debian 套件編譯過程中運行它，可以使用空的 <tt>override_dh_auto_test</tt> target 來跳過它。

source: If <package>gentoo</package> has an unusual upstream changelog file called <file>FIXES</file>, <prgn>dh_installchangelogs</prgn> will not install that file by default. The <prgn>dh_installchangelogs</prgn> command requires <file>FIXES</file> as its argument to install it. <footnote><p>The <file>debian/changelog</file> and <file>debian/NEWS</file> files are always automatically installed. The upstream changelog is searched by converting filenames to the lower case and matching them with the <file>changelog</file>, <file>changes</file>, <file>changelog.txt</file>, and <file>changes.txt</file>.</p></footnote>
ca: Si el paquet <package>gentoo</package> inclou el poc freqüent arxiu de canvis de l'autor amb el nom <file>FIXES</file>, <prgn>dh_installchangelogs</prgn> no en farà la instal·lació (és l'opció predeterminada). L'ordre <prgn>dh_installchangelogs</prgn> requereix l'argument <file>FIXES</file> per tal d'instal·lar-lo <footnote><p>Els fitxers <file>debian/changelog</file> i <file>debian/NEWS</file> sempre s'instal·len automàticament. També es busca el fitxer de canvis de l'autor canviant el nom a minúscules i per la seva coincidència amb <file>changelog</file>, <file>changes</file>, <file>changelog.txt</file>, i <file>changes.txt</file>. </p></footnote>.
es: Si <package>gentoo</package> contiene el poco frecuente archivo de cambios del autor con el nombre <file>FIXES</file>, <prgn>dh_installchangelogs</prgn> no lo instalará por omisión. La orden <prgn>dh_installchangelogs</prgn> requiere como argumento <file>FIXES</file> para instalarlo <footnote><p>Los archivos <file>debian/changelog</file> y <file>debian/NEWS</file> siempre se instalan automáticamente. También se busca el archivo de cambios del autor para cambiar el nombre a minúsculas y por su coincidencia con <file>changelog</file>, <file>changes</file>, <file>changelog.txt</file>, y <file>changes.txt</file>.</p></footnote>.
fr: Si <package>gentoo</package> possède un fichier journal de modification inhabituel appelé <file>FIXES</file>, <prgn>dh_installchangelogs</prgn> ne l'installera pas par défaut. La commande <prgn>dh_installchangelogs</prgn> a besoin de <file>FIXES</file> en option pour l'installer. <footnote><p>Les fichiers <file>debian/changelog</file> et <file>debian/NEWS</file> sont toujours installés automatiquement. Le journal de modification amont est cherché en convertissant les noms de fichiers en minuscule puis en vérifiant l'existence de <file>changelog</file>, <file>changes</file>, <file>changelog.txt</file>, et <file>changes.txt</file>.</p></footnote>
ja: もし、<package>gentoo</package>パッケージに、普通ではない<file>FIXES</file>という上流のチェンジログファイルがある場合、 <prgn>dh_installchangelogs</prgn>はデフォルトではそのファイルをインストールしません。このファイルをインストールするには、<file>FIXES</file>を引数として、<prgn>dh_installchangelogs</prgn>に渡してやる必要があります。<footnote><p><file>debian/changelog</file> と <file>debian/NEWS</file> は常に自動でインストールされます。上流のチェンジログファイルは、ファイル名を小文字に変換し、<file>changelog</file>、<file>changes</file>、<file>changelog.txt</file>、<file>changes.txt</file>のいずれかと一致するものを検索します。</p></footnote>
zh_cn: 如果 <package>gentoo</package> 有某个不常见的上游 changelog 文件名为 <file>FIXES</file>，默认情况下 <prgn>dh_installchangelogs</prgn> 不会安装它。<prgn>dh_installchangelogs</prgn> 命令需要将 <file>FIXES</file> 作为它的参数来安装它。<footnote><p><file>debian/changelog</file> 和 <file>debian/NEWS</file> 总是会被自动安装。程序会不分大小写地搜索以下文件名来检测上游 changelog：<file>changelog</file>、<file>changes</file>、<file>changelog.txt</file>和<file>changes.txt</file>。</p></footnote>
zh_tw: 如果 <package>gentoo</package> 有某個不常見的上游 changelog 檔案名爲 <file>FIXES</file>，默認情況下 <prgn>dh_installchangelogs</prgn> 不會安裝它。<prgn>dh_installchangelogs</prgn> 命令需要將 <file>FIXES</file> 作爲它的參數來安裝它。<footnote><p><file>debian/changelog</file> 和 <file>debian/NEWS</file> 總是會被自動安裝。程式會不分大小寫地搜索以下檔案名來檢測上游 changelog：<file>changelog</file>、<file>changes</file>、<file>changelog.txt</file>和<file>changes.txt</file>。</p></footnote>

source: When you use the new <prgn>dh</prgn> command, use of explicit targets such as the ones listed in <ref id="targets"> except <tt>get-orig-source</tt> target may make it difficult to understand their exact effects. Please limit explicit targets to <tt>override_dh_*</tt> targets and completely independent ones, if possible.
ca: Si fas sevir el nou <prgn>dh</prgn>, la utilització explícita d'objectius com els llistats a <ref id="targets"> (excepte <tt>get-orig-source</tt>) pot dificultar la correcta comprensió dels seus efectes. Si us plau, limita l'ús d'objectius explícits a objectius del tipus <tt>override_dh_*</tt> i de manera que siguin completament independents entre ells (sempre que sigui possible).
es: Cuando utilizas el nuevo programa <prgn>dh</prgn>, la utilización explícita de objetivos como los listados en <ref id="targets"> (excepto <tt>get-orig-source</tt>) puede dificultar la correcta comprensión de sus efectos exactos. Por favor, limita el uso de objetivos explícitos a objetivos del tipo <tt>override_dh_*</tt> y de forma que sean completamente independientes entre sí (siempre que sea posible).
fr: Lors de l'utilisation de la nouvelle commande <prgn>dh</prgn>, la compréhension des effets exacts des cibles explicites comme celles énumérées en <ref id="targets"> (à part <tt>get-orig-source</tt>) peut être rendue difficile. Veuillez limiter les cibles explicites aux cibles <tt>override_dh_*</tt>, et à celle complètement indépendantes, si possible.
ja: この新しい<prgn>dh</prgn>コマンドを使う際には、その正確な影響が把握するのが難しい<tt>get-orig-source</tt>を除き、<ref id="targets">にあるような明確なターゲット指定をします。可能であれば、<tt>override_dh_*</tt>ターゲットおよび、完全に独立したものに明確なターゲットを制限してください。
zh_cn: 如果你使用新的 <prgn>dh</prgn> 命令时，还使用 <ref id="targets"> 中除 <tt>get-orig-source</tt> 的 target ，会使得其效果难以预料。请尽量避免使用独立的或预设的 target，如果必须修改默认设置则酌情使用 <tt>override_dh_*</tt>。
zh_tw: 如果你使用新的 <prgn>dh</prgn> 命令時，還使用 <ref id="targets"> 中除 <tt>get-orig-source</tt> 的 target ，會使得其效果難以預料。請儘量避免使用獨立的或預設的 target，如果必須修改默認設置則酌情使用 <tt>override_dh_*</tt>。

source: Other files under the <file>debian</file> directory
ca: Altres fitxers del directori <file>debian</file>.
es: Otros ficheros en el directorio <file>debian</file>.
fr: Autres fichiers dans le répertoire <file>debian</file>
it: Altri file nella directory <file>debian</file>
ja: <file>debian</file>ディレクトリにあるその他のファイル
zh_cn: <file>debian</file> 目录下的其他文件
zh_tw: <file>debian</file> 目錄下的其他檔案

source: To control most of what <package>debhelper</package> does while building the package, you put optional configuration files under the <file>debian</file> directory. This chapter will make an overview of what each of these does and its format. Please read <url id="http://www.debian.org/doc/devel-manuals#policy" name="Debian Policy Manual"> and <url id="http://www.debian.org/doc/devel-manuals#devref" name="Debian Developer's Reference"> for guidelines for the packaging.
ca: Per tal de controlar el treball de <package>debhelper</package> en la compilació del paquet, pots afegir fitxers de configuració en el directori <file>debian</file>. En aquest capítol es resumeix el que pots fer amb cada un d'ells i el seu format. Consulta <url id="http://www.debian.org/doc/devel-manuals#policy" name="«Debian Policy Manual»"> i <url id="http://www.debian.org/doc/devel-manuals#devref" name="«Debian Developer's Reference»"> per a les directrius de construcció de paquets.
es: Para controlar el trabajo de <package>debhelper</package> en la compilación del paquete, puedes añadir archivos de configuración en el directorio <file>debian</file>. En este capítulo se resumirá lo que puede hacerse con cada uno de ellos y su formato. Por favor, lee <url id="http://www.debian.org/doc/devel-manuals#policy" name="«Debian Policy Manual»"> y <url id="http://www.debian.org/doc/devel-manuals#devref" name="«Debian Developer's Reference»"> para más información.
fr: Pour contrôler la plupart des actions de <package>debhelper</package> lors de la construction du paquet, placez des fichiers de configuration optionnels dans le répertoire <file>debian</file>. Ce chapitre présente globalement le rôle de ces fichiers et leur format. Veuillez vous reporter à la <url id="http://www.debian.org/doc/devel-manuals#policy" name="Charte Debian"> et à la <url id="http://www.debian.org/doc/devel-manuals#devref" name="référence du développeur Debian"> pour les principes d'empaquetage.
it: Per controllare la maggior parte delle operazioni che <package>debhelper</package> effettua durante la creazione del pacchetto, si possono inserire dei file di configurazione all'interno della directory <file>debian</file>. Questo capitolo fornirà una panoramica sull'utilizzo di ciascuno di essi ed il loro formato. Si legga <url id="http://www.debian.org/doc/devel-manuals#policy" name="Manuale delle policy di Debian"> e <url id="http://www.debian.org/doc/devel-manuals#devref" name="Guida di riferimento per lo sviluppatore Debian"> per le linee guida sulla creazione dei pacchetti.
ja: <package>debhelper</package>がパッケージのビルド中に行うことをコントロールするためには、任意の設定ファイルを<file>debian</file>ディレクトリに置きます。この章では、それぞれの設定ファイルが何をして、どのような書式なのか、その概説をしていきます。パッケージングのガイドラインについての詳細は<url id="http://www.debian.org/doc/devel-manuals#policy" name="Debian Policy Manual"> と <url id="http://www.debian.org/doc/devel-manuals#devref" name="Debian Developer's Reference"> を参照してください。
zh_cn: 要控制 <package>debhelper</package> 在构建软件包过程中的行为，可以在 <file>debian</file> 目录中放置可选的配置文件。本章将会对这些文件和它们的格式进行概述。请阅读 <url id="http://www.debian.org/doc/devel-manuals#policy" name="Debian Policy Manual"> 和 <url id="http://www.debian.org/doc/devel-manuals#devref" name="Debian Developer's Reference"> 来了解更多内容。
zh_tw: 要控制 <package>debhelper</package> 在構建套件過程中的行爲，可以在 <file>debian</file> 目錄中放置可選的設定檔案。本章將會對這些檔案和它們的格式進行概述。請閱讀 <url id="http://www.debian.org/doc/devel-manuals#policy" name="Debian Policy Manual"> 和 <url id="http://www.debian.org/doc/devel-manuals#devref" name="Debian Developer's Reference"> 來瞭解更多內容。

source: The <prgn>dh_make</prgn> command will create some template configuration files under the <file>debian</file> directory. Most of them come with filenames suffixed by "<tt>.ex</tt>". Some of them come with filenames prefixed by the binary package name such as <tt><var>package</var></tt>. Take a look at all of them.
ca: L'ordre <prgn>dh_make</prgn> construeix alguns fitxers de configuració com a plantilles i els col·loca en el directori <file>debian</file>. Alguns d'ells tenen el sufix <tt>.ex</tt> (de «example») en el nom. Altres tenen com a prefix (del nom) <tt><var>nom_paquet</var></tt> que estàs construint. Mira el contingut de tots ells.
es: La orden <prgn>dh_make</prgn> construye varios archivos de configuración a modo de plantillas y los ubica en el directorio <file>debian</file>. Algunos de ellos tienen el sufijo "<tt>.ex</tt>" (de «example») en el nombre. Otros tienen como prefijo en el nombre el nombre del paquete en la forma <tt><var>nombre_del_paquete</var></tt> . Mira el contenido de todos ellos.
fr: La commande <prgn>dh_make</prgn> crée quelques modèles de fichiers de configuration dans le répertoire <file>debian</file>. La plupart d'entre-eux ont une extension « <tt>.ex</tt> ». Certains d'entre-eux ont le nom du paquet binaire comme préfixe : <tt><var>paquet</var></tt>. Regardez les tous.
it: Il comando <prgn>dh_make</prgn> creerà il modello dei file di configurazione nella directory <file>debian</file>. Molti di questi file terminano con l'estensione "<tt>.ex</tt>". In altri inoltre il nome del file viene preceduto dal nome del pacchetto in binario, come <tt><var>pacchetto</var></tt>. Si dia uno sguardo a tutti i differenti file di configurazione.
ja: <prgn>dh_make</prgn>コマンドは、<file>debian</file>ディレクトリの中に設定ファイルの雛形を作成します。大抵の場合、"<tt>.ex</tt>"サフェックスが付いています。ファイル名の先頭に<tt><var>package</var></tt>などのように、バイナリパッケージの名前がつくものもあります。これらのファイルにはすべて目を通しておいてください。
zh_cn: <prgn>dh_make</prgn> 命令会在 <file>debian</file> 目录中创建一些配置文件模板，它们的文件名多带有 <tt>.ex</tt> 的后缀。其中的一些可能以软件包名作为前缀，如 <tt><var>package</var></tt>。现在对它们进行一个大致的了解。
zh_tw: <prgn>dh_make</prgn> 命令會在 <file>debian</file> 目錄中創建一些設定檔案模板，它們的檔案名多帶有 <tt>.ex</tt> 的後綴。其中的一些可能以套件名作爲前綴，如 <tt><var>package</var></tt>。現在對它們進行一個大致的瞭解。

source: The <prgn>dh_make</prgn> command may not create some template configuration files for <package>debhelper</package>. In such cases, you need to create them with the editor.
ca: En altres casos, <prgn>dh_make</prgn> no pot construir plantilles de configuració per a <package>debhelper</package>. En aquests casos tu mateix escriuràs els fitxers amb un editor.
es: En otros casos, <prgn>dh_make</prgn> no puede construir plantillas de configuración para <package>debhelper</package>. En estos casos, deberás construir tu mismo los archivos con un editor.
fr: La commande <prgn>dh_make</prgn> ne crée pas tous les modèles de fichiers de configuration pour <package>debhelper</package>. Dans ce cas, vous devez les créer avec un éditeur.
ja: <prgn>dh_make</prgn>コマンドは、<package>debhelper</package>用の設定ファイルを作らないことがあります。その場合、自分でエディターを使い設定ファイルを作成しなければなりません。
zh_cn: 还有一些 <package>debhelper</package> 的配置文件模板 <prgn>dh_make</prgn> 命令没有直接创建。在这种情况下如果你需要它们，则要使用文本编辑器手工创建。
zh_tw: 還有一些 <package>debhelper</package> 的設定檔案模板 <prgn>dh_make</prgn> 命令沒有直接創建。在這種情況下如果你需要它們，則要使用文本編輯器手工創建。

source: If you wish or need to activate any of those, please do the following.
ca: Si vols fer servir els fitxers generats en la construcció del paquet, fes el següent:
es: Si quieres utilizar estos archivos en la construcción de tu paquete, haz lo siguiente.
fr: Pour activer certains d'entre-eux, veuillez suivre les instructions suivantes :
it: Se si vuole o si ha bisogno di attivare alcuno di questi file, si effettuino le seguenti operazioni:
ja: 以下の手順で、設定ファイルを有効にできます。
zh_cn: 如果你希望或需要激活它们中的任意一个或多个，请按照下面的方法做。
zh_tw: 如果你希望或需要激活它們中的任意一個或多個，請按照下面的方法做。

source: rename template files by removing the <tt>.ex</tt> or <tt>.EX</tt> suffix if the template files have one.
ca: elimina els sufix <tt>.ex</tt> o <tt>.EX</tt> de tots els fitxers de plantilla.
es: elimina los sufijos <tt>.ex</tt> o <tt>.EX</tt> de los archivos de plantilla que lo tengan.
fr: renommer les fichiers modèles en enlevant l'extension <tt>.ex</tt> ou <tt>.EX</tt> si elle existe ;
it: si rinomini il file modello rimuovendo l'estensione <tt>.ex</tt> o <tt>.EX</tt> se presente.
ja: <tt>.ex</tt>や<tt>.EX</tt>サフェックスがついていれば、消してください。
zh_cn: 如果模板文件带有 <tt>.ex</tt> 或 <tt>.EX</tt> 后缀，则重命名它去掉后缀。
zh_tw: 如果模板檔案帶有 <tt>.ex</tt> 或 <tt>.EX</tt> 後綴，則重命名它去掉後綴。

source: rename the name of these configuration files using the actual binary package name in place of <tt><var>package</var></tt>.
ca: reanomena els fitxers de configuració fent servir el nom del fitxer del paquet binari en lloc de <tt><var>nom_paquet</var></tt>.
es: renombra los archivos de configuración utilizando el nombre del archivo del paquete binario en lugar de <tt><var>nombre_del_paquete</var></tt>.
fr: renommer les fichiers de configuration en utilisant le véritable nom du paquet binaire à la place de <tt><var>package</var></tt> ;
ja: ファイル名を、<tt><var>package</var></tt>の代わりに、実際のバイナリパッケージの名前に変更してください。
zh_cn: 按照需要，把带有软件包名的配置文件的前缀改为实际的二进制软件包名，例如 <tt><var>package</var></tt>。
zh_tw: 按照需要，把帶有套件名的設定檔案的前綴改爲實際的二進位套件名，例如 <tt><var>package</var></tt>。

source: modify template file contents to suit your needs.
ca: modifica el contingut dels fitxers de plantilla per adaptar-los a les teves necessitats.
es: modifica el contenido de los archivos de plantilla para adaptarlos a tus necesidades.
fr: modifiez le contenu des fichiers modèles selon vos besoins ;
it: si modifichi il contenuto del file in base al bisogno.
ja: 必要に応じて、ファイルの中身を書き換えます。
zh_cn: 修改模板文件来满足你的需要。
zh_tw: 修改模板檔案來滿足你的需要。

source: remove template files which you do not need.
ca: elimina els fitxers que no ﻿necessitis.
es: elimina aquellos archivos que no necesites.
fr: enlevez les fichiers modèles dont vous n'avez pas besoin ;
it: si elimini il file modello di cui non si ha più bisogno.
ja: 不要な雛形のファイルは削除してください。
zh_cn: 删除不需要的模板文件。
zh_tw: 刪除不需要的模板檔案。

source: modify the <file>control</file> file (see <ref id="control">), if necessary.
ca: fes les modificacions necessàries en el fitxer <file>control</file> (consulta <ref id="control">).
es: realiza las modificaciones necesarias en el archivo <file>control</file> (véase <ref id="control">).
fr: si nécessaire, modifiez le fichier <file>control</file> (cf. <ref id="control">) ;
it: si modifichi il file di <file>controllo</file> (si veda <ref id="control">), se necessario.
ja: 必要であれば、<file>control</file>ファイル(参照 <ref id="control">)を変更します。
zh_cn: 如果需要，修改 <file>control</file> 文件(参看 <ref id="control">)。
zh_tw: 如果需要，修改 <file>control</file> 檔案(參考 <ref id="control">)。

source: modify the <file>rules</file> file (see <ref id="rules">), if necessary.
ca: modifica el fitxer <file>rules</file> (consulta <ref id="rules">) si és necessari.
es: modifica el archivo <file>rules</file> (véase <ref id="rules">) si es necesario.
fr: si nécessaire, modifiez le fichier <file>rules</file> (cf. <ref id="rules">).
it: si modifiche il file delle <file>regole</file> (si veda <ref id="rules">), se necessario.
ja: 必要なら<file>rules</file>ファイル(参照 <ref id="rules">)を編集してください。
zh_cn: 如果需要，修改 <file>rules</file> 文件(参看 <ref id="rules">)。
zh_tw: 如果需要，修改 <file>rules</file> 檔案(參考 <ref id="rules">)。
