Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: <file>cron.monthly</file> - Installed as <file>/etc/cron.monthly/<var>package</var></file>: run once a month, usually early morning on the first of the month.
ca: <file>cron.monthly</file> - instal·lats com <file>/etc/cron.monthly/<var>nom_paquet</var></file>: s'executen cada mes, habitualment ﻿en el matí del primer dia del mes.
es: <file>cron.monthly</file> - instalados como <file>/etc/cron.monthly/<var>nombre_del_paquete</var></file>: se ejecutan cada mes, habitualmente por la mañana del primer día del mes.
fr: <file>cron.monthly</file> &mdash; installé comme <file>/etc/cron.monthly/<var>paquet</var></file> : exécuté une fois par mois, normalement tôt le matin du premier du mois ;
it: <file>cron.monthly</file> - Installato come <file>/etc/cron.monthly/<var>pacchetto</var></file>: viene eseguito una volta al mese, di solito ogni mattino del primo del mese.
ja: <file>cron.monthly</file> - <file>/etc/cron.monthly/<var>package</var></file>としてインストール: 1ヶ月に1度実行。普通は1日の早朝に実行する。
zh_cn: <file>cron.monthly</file> - 安装为 <file>/etc/cron.monthly/<var>package</var></file>：每月运行一次，通常在该月第一天的早晨。
zh_tw: <file>cron.monthly</file> - 安裝爲 <file>/etc/cron.monthly/<var>package</var></file>：每月運行一次，通常在該月第一天的早晨。

source: <file>cron.d</file> - Installed as <file>/etc/cron.d/<var>package</var></file>: for any other time
ca: <file>cron.d</file> - instal·lats com <file>/etc/cron.d/<var>nom_paquet</var></file>: per a qualsevol altre període de temps.
es: <file>cron.d</file> - instalados como <file>/etc/cron.d/<var>package</var></file>: para cualquier otro período de tiempo.
fr: <file>cron.d</file> &mdash; installé comme <file>/etc/cron.d/<var>paquet</var></file> : exécuté à tout autre moment ;
it: <file>cron.d</file> - Installato come <file>/etc/cron.d/<var>pacchetto</var></file>: per qualsiasi altro periodo
ja: <file>cron.d</file> - <file>/etc/cron.d/<var>package</var></file>としてインストール: 上記以外のどの時間でも指定可能。
zh_cn: <file>cron.d</file> - 安装为 <file>/etc/cron.d/<var>package</var></file> 指定的任意时间。
zh_tw: <file>cron.d</file> - 安裝爲 <file>/etc/cron.d/<var>package</var></file> 指定的任意時間。

source: For the named files, the format of them is the shell script. The different one is <file><var>package</var>.cron.d</file> which follows the format of <manref section="5" name="crontab">.
ca: Els fitxers tenen el format de guions shell. Amb l'excepció dels fitxers <file><var>nom_paquet</var>.cron.d</file> que s'ajustaran al format descrit a <manref section="5" name="crontab">.
es: Para los archivos mencionados, su formato es el de guiones shell. La única excepción son los archivos <file><var>nombre_del_paquete</var>.cron.d</file> que deben ajustarse al formato descrito en <manref section="5" name="crontab">.
fr: Ces fichiers sont des scripts shell, à l'exception de <file><var>paquet</var>.cron.d</file> dont le format est celui de <manref section="5" name="crontab">.
it: Il formato dei file qui presentati è lo script di shell. L'unico che differisce dagli altri è <file><var>pacchetto</var>.cron.d</file> che segue il formato di <manref section="5" name="crontab">.
ja: 上記のファイルの書式はシェルスクリプトです。<file><var>package</var>.cron.d</file>は違い、<manref section="5" name="crontab">の書式になります。
zh_cn: 对于前几个文件，其格式为 shell 脚本。唯一不同的是 <file><var>package</var>.cron.d</file>，它的格式需要参照 <manref section="5" name="crontab">
zh_tw: 對於前幾個檔案，其格式爲 shell 腳本。唯一不同的是 <file><var>package</var>.cron.d</file>，它的格式需要參照 <manref section="5" name="crontab">

source: Note that this doesn't include log rotation; for that, see <manref section="1" name="dh_installlogrotate"> and <manref section="8" name="logrotate">.
ca: Això no inclou la rotació de fitxers de registre, per aquest cas consulta <manref section="1" name="dh_installlogrotate"> i <manref section="8" name="logrotate">. Elimina aquest arxiu si no s'ha de fer servir amb el teu paquet.
es: Ten en cuenta que ésto no incluye la rotación de archivos de registro, para hacer eso consulta <manref section="1" name="dh_installlogrotate"> y <manref section="8" name="logrotate">. Elimina el fichero si el paquete no utiliza dichas tareas.
fr: Ceci n'inclut pas la rotation des journaux ; pour cela, voyez <manref section="1" name="dh_installlogrotate"> et <manref section="8" name="logrotate">.
it: Si noti che qui non è stata illustrata la rotazione dei log; a questo proposito si veda <manref section="1" name="dh_installlogrotate"> e <manref section="8" name="logrotate">.
ja: ここではログのローテーションは扱いません。ログローテーションについては<manref section="1" name="dh_installlogrotate"> および <manref section="8" name="logrotate">を参照してください。
zh_cn: 注意这里的操作不包含日志旋转，如果需要日志旋转，参看 <manref section="1" name="dh_installlogrotate"> 和 <manref section="8" name="logrotate">
zh_tw: 注意這裏的操作不包含日誌旋轉，如果需要日誌旋轉，參考 <manref section="1" name="dh_installlogrotate"> 和 <manref section="8" name="logrotate">

source: <file>dirs</file> file
ca: Fitxer <file>dirs</file>.
es: Archivo <file>dirs</file>
fr: Fichier <file>dirs</file>
it: Il file <file>dirs</file>
ja: <file>dirs</file>ファイル
zh_cn: <file>dirs</file> 文件
zh_tw: <file>dirs</file> 檔案

source: This file specifies the directories which we need but the normal installation procedure ("<tt>make install DESTDIR=...</tt>" invoked by "<tt>dh_auto_install</tt>") somehow doesn't create. This generally means there is a problem with the <file>Makefile</file>.
ca: Aquest arxiu especifica els directoris necessaris però que per alguna raó no s'han creat en el procés d'instal·lació normal (<tt>make install DESTDIR=...</tt>" executat per <tt>dh_auto_install</tt>). Generalment això és degut a un problema en el fitxer <file>Makefile</file>.
es: Este fichero especifica los directorios que se necesitan pero que por alguna razón no se crean en un proceso de instalación normal (<tt>make install DESTDIR=...</tt>" invocado por <tt>dh_auto_install</tt>). Generalmente es debido a un problema con el archivo <file>Makefile</file>.
fr: Ce fichier indique les répertoires nécessaires mais que la procédure d'installation normale (« <tt>make install DESTDIR=...</tt> » invoquée par « <tt>dh_auto_install</tt> ») ne crée pas. C'est souvent dû à un problème avec le <file>Makefile</file>.
it: Questo file specifica le directory di cui si ha bisogno ma che la normale procedura di installazione ("<tt>make install DESTDIR=...</tt>" chiamata da "<tt>dh_auto_install</tt>") non crea. Questo generalmente indica la presenza di un problema nel <file>Makefile</file>.
ja: このファイルにはパッケージが必要としているのに、なぜか通常のインストール手順("<tt>dh_auto_install</tt>"によって呼び出される"<tt>make install DESTDIR=...</tt>")では作成されないディレクトリを指定します。通常、これは<file>Makefile</file>に問題があることを示唆しています。
zh_cn: 这个文件指定了我们需要，但正常安装过程(<tt>dh_auto_install</tt> 触发 <tt>make install DESTDIR=...</tt>)里没有被安装的目录。通常这是由于 <file>Makefile</file> 中存在问题。
zh_tw: 這個檔案指定了我們需要，但正常安裝過程(<tt>dh_auto_install</tt> 觸發 <tt>make install DESTDIR=...</tt>)裏沒有被安裝的目錄。通常這是由於 <file>Makefile</file> 中存在問題。

source: Files listed in the <file>install</file> file doesn't need the directories created first. See <ref id="install">.
ca: Els fitxers llistats en el fitxer <file>install</file> no requereixen la creació prèvia dels directoris. Consulta <ref id="install">.
es: Los archivos listados en el archivo <file>install</file> no requieren la construcción previa de los directorios. Véase <ref id="install">.
fr: Les fichiers énumérés dans le fichier <file>install</file> n'ont pas besoin que les répertoires soient créés avant, cf. <ref id="install">.
ja: <file>install</file>ファイルに書かれてるファイルは最初にディレクトリを作成する必要がないファイルです。詳しくは <ref id="install"> を参照してください。
zh_cn: <file>install</file> 文件中列出的文件不需要提前创建目录，参看 <ref id="install">
zh_tw: <file>install</file> 檔案中列出的檔案不需要提前創建目錄，參考 <ref id="install">

source: It is best to first try to run the installation first and only use this if you run into trouble. There is no preceding slash on the directory names.
ca: És recomanable executar en primer lloc la instal·lació i només fer ús d'aquest arxiu si es produeix algú problema. ﻿No s'ha de posar la barra inicial en els noms dels directoris.
es: Es recomendable ejecutar en primer lugar la instalación y solo hacer uso de este archivo si se produce algún problema. No debe ponerse la barra inicial en los nombres de los directorios.
fr: Il est préférable d'essayer d'exécuter d'abord l'installation, et d'utiliser seulement ce recours si vous avez des problèmes. Il n'y a pas de barre oblique (« / ») au début des noms de répertoire.
it: Si raccomanda di provare prima ad eseguire l'installazione ed utilizzare questo file solo se si incorre in problemi. Si noti che non il carattere slash non precede il nome delle directory.
ja: まずはインストールしてみて、なにか問題が起きた場合にのみ使うべきでしょう。ディレクトリ名の頭にスラッシュが付かない事に注意してください。
zh_cn: 最好是先尝试安装，如果遇到了相关的问题再使用这个文件。目录名中不应有前导的 / 符号。
zh_tw: 最好是先嘗試安裝，如果遇到了相關的問題再使用這個檔案。目錄名中不應有前導的 / 符號。

source: <file><var>package</var>.doc-base</file> file
ca: Fitxer <file><var>nom_paquet</var>.doc-base</file>.
es: Archivo <file><var>nombre_del_paquete</var>.doc-base</file>
fr: Fichier <file><var>paquet</var>.doc-base</file>
it: Il file <file><var>pacchetto</var>.doc-base</file>
ja: <file><var>package</var>.doc-base</file> ファイル
zh_cn: <file><var>package</var>.doc-base</file> 文件
zh_tw: <file><var>package</var>.doc-base</file> 檔案

source: If your package has documentation other than manual pages and info docs, you should use the <package>doc-base</package> file to register it, so the user can find it with e.g. <manref section="1" name="dhelp">, <manref section="1" name="dwww"> or <manref section="1" name="doccentral">.
ca: Si el teu paquet té documentació a més de les pàgines de manual i d'informació, pots fer servir el fitxer <package>doc-base</package> per a registrar-la i així l'usuari la trobarà més fàcilment amb <manref section="1" name="dhelp">, <manref section="1" name="dwww"> o <manref section="1" name="doccentral">.
es: Si tu paquete tiene documentación además de las páginas de manual y de información, puedes utilizar el archivo <package>doc-base</package> para registrarla de modo que el usuario pueda encontrar esta documentación suplementaria con <manref section="1" name="dhelp">, <manref section="1" name="dwww"> o <manref section="1" name="doccentral">.
fr: Si votre paquet est fournit avec une autre documentation que des pages de manuel et des documents info, vous devriez utiliser le fichier <package>doc-base</package> pour l'enregistrer, de sorte que l'utilisateur puisse la trouver avec par exemple <manref section="1" name="dhelp">, <manref section="1" name="dwww"> ou <manref section="1" name="doccentral">.
it: Se il pacchetto generato ha altra documentazione oltre alle pagine del manuale e documenti informativi, dovrebbe essere utilizzato il file <package>doc-base</package> per segnalarla in modo che l'utente possa trovarla con, ad esempio <manref section="1" name="dhelp">, <manref section="1" name="dwww"> o <manref section="1" name="doccentral">.
ja: もしあなたのパッケージがマニュアルページや info 形式の文書以外に付属文書を含む場合、 <package>doc-base</package> ファイルを使ってそれらを登録し、ユーザがそれらの付属文書を、例えば<manref section="1" name="dhelp"> や <manref section="1" name="dwww">、あるいは <manref section="1" name="doccentral">コマンドなどで参照できるようにしましょう。
zh_cn: 如果你的软件包在 man 手册页和 info 信息文档外还有其他文档，你应该使用 <package>doc-base</package> 文件注册它们，这样用户可以使用例如 <manref section="1" name="dhelp">、<manref section="1" name="dwww"> 或 <manref section="1" name="doccentral"> 的工具找到它们。
zh_tw: 如果你的套件在 man 手冊頁和 info 訊息文件外還有其他文件，你應該使用 <package>doc-base</package> 檔案註冊它們，這樣用戶可以使用例如 <manref section="1" name="dhelp">、<manref section="1" name="dwww"> 或 <manref section="1" name="doccentral"> 的工具找到它們。

source: This usually includes HTML, PS and PDF files, shipped in <file>/usr/share/doc/<var>packagename</var>/</file>.
ca: La documentació inclourà fitxers HTML, PS i PDF ubicats en <file>/usr/share/doc/<var>nom_paquet</var>/</file>.
es: La documentación incluirá archivos HTML, PS y PDF ubicados en <file>/usr/share/doc/<var>nombre_del_paquete</var>/</file>.
fr: Cela inclut normalement les fichiers HTML, PS et PDF, inclus dans <file>/usr/share/doc/nomdepaquet/</file>.
it: Questa documentazione è solitamente costituita da documenti HTML, file PS e PDF, disponibili in <file>/usr/share/doc/<var>nomepacchetto</var>/</file>.
ja: これには通常、<file>/usr/share/doc/<var>packagename</var>/</file>の中に収められるようなHTML、PS、およびPDFなどの形式の付属文書が含まれます。
zh_cn: 这通常包括 HTML、PS 和 PDF 文件，放置在 <file>/usr/share/doc/<var>packagename</var>/</file>。
zh_tw: 這通常包括 HTML、PS 和 PDF 檔案，放置在 <file>/usr/share/doc/<var>packagename</var>/</file>。

source: This is how <package>gentoo</package>'s doc-base file <file>gentoo.doc-base</file> looks like:
ca: Aquest és el contingut del fitxer <file>gentoo.doc-base</file> de <package>gentoo</package>:
es: A continuación se muestra cómo es el fichero doc-base de <package>gentoo</package>, <file>gentoo.doc-base</file>:
fr: Voici ce à quoi le fichier <file>gentoo.doc-base</file> de <package>gentoo</package> ressemble :
it: Questo è il modo in cui il file doc-base di <package>gentoo</package>, <file>gentoo.doc-base</file>, appare:
ja: 例えば、<package>gentoo</package>の<file>gentoo.doc-base</file>ファイルは次のようになります:
zh_cn: 以下是 <package>gentoo</package> 的 doc-base 文件 <file>gentoo.doc-base</file> 的样子：
zh_tw: 以下是 <package>gentoo</package> 的 doc-base 檔案 <file>gentoo.doc-base</file> 的樣子：

source: For information on the file format, see <manref section="8" name="install-docs"> and the <package>doc-base</package> manual, in <file>/usr/share/doc/doc-base/doc-base.html/</file>.
ca: Consulta <manref section="8" name="install-docs"> i el manual <package>doc-base</package> a <file>/usr/share/doc/doc-base/doc-base.html/</file> si vols més informació.
es: Para más información sobre el formato del archivo véase <manref section="8" name="install-docs"> y el manual <package>doc-base</package>, en <file>/usr/share/doc/doc-base/doc-base.html/</file>.
fr: Pour plus d'informations sur le format de ce fichier, voir <manref section="8" name="install-docs"> et le manuel de <package>doc-base</package>, en <file>/usr/share/doc/doc-base/doc-base.html/index.html</file>.
it: Per informazioni sul formato del file si veda <manref section="8" name="install-docs"> ed il manuale <package>doc-base</package> , reperibile in <file>/usr/share/doc/doc-base/doc-base.html/</file>.
ja: このファイルの書式については<manref section="8" name="install-docs">および <file>/usr/share/doc/doc-base/doc-base.html/</file>にある<package>doc-base</package> のマニュアルを参照してください。
zh_cn: 关于文件格式的更多信息，参看 <manref section="8" name="install-docs"> 和 <file>/usr/share/doc/doc-base/doc-base.html/</file> 中的 <package>doc-base</package> 手册。
zh_tw: 關於檔案格式的更多訊息，參考 <manref section="8" name="install-docs"> 和 <file>/usr/share/doc/doc-base/doc-base.html/</file> 中的 <package>doc-base</package> 手冊。

source: For more details on installing additional documentation, look in <ref id="destdir">.
ca: Per a més detalls sobre la instal·lació de documentació addicional, consulta <ref id="destdir">.
es: Para más detalles sobre la instalación de documentación adicional, lee <ref id="destdir">.
fr: Pour plus d'informations sur l'installation de documentation supplémentaire, voir <ref id="destdir">.
it: Per ulteriori dettagli su come installare documentazione aggiuntiva, si veda in <ref id="destdir">.
ja: 追加ドキュメントのインストールについて、詳細は<ref id="destdir">を見てください。
zh_cn: 关于安装附加文档的更多信息，查看 <ref id="destdir">。
zh_tw: 關於安裝附加文件的更多訊息，查看 <ref id="destdir">。

source: <file>docs</file> file
ca: Fitxer <file>docs</file>.
es: Archivo <file>docs</file>
fr: Fichier <file>docs</file>
it: Il file <file>docs</file>
ja: <file>docs</file>ファイル
zh_cn: <file>docs</file> 文件
zh_tw: <file>docs</file> 檔案

source: This file specifies the file names of documentation files we can have <manref section="1" name="dh_installdocs"> install into the temporary directory for us.
ca: Aquest arxiu especifica els noms dels fitxers de documentació que <manref section="1" name="dh_installdocs"> instal·larà en el directori temporal.
es: Este fichero especifica los nombres de los ficheros de documentación que <manref section="1" name="dh_installdocs"> instalará en el directorio temporal.
fr: Ce fichier spécifie les noms des fichiers de documentation que <manref section="1" name="dh_installdocs"> peut installer pour vous dans le répertoire temporaire.
it: Questo file specifica il nome dei file di documentazione che si possono avere <manref section="1" name="dh_installdocs"> li installa nella directory temporanea automaticamente.
ja: このファイルには、<manref section="1" name="dh_installdocs">を使ってパッケージ生成用の一時的なディレクトリにインストールするために、パッケージに付属する資料のファイル名を指定してください。
zh_cn: 这个文件制定了我们使用 <manref section="1" name="dh_installdocs"> 安装到临时目录的文件名。
zh_tw: 這個檔案制定了我們使用 <manref section="1" name="dh_installdocs"> 安裝到臨時目錄的檔案名。

source: By default, it will include all existing files in the top-level source directory that are called "<file>BUGS</file>", "<file>README*</file>", "<file>TODO</file>" etc.
ca: L'opció predeterminada inclourà tots els fitxers existents en els directoris del nivell més alt del codi amb els noms "<file>BUGS</file>", "<file>README*</file>", "<file>TODO</file>" etc.
es: Por omisión, se incluirán todos los archivos existentes en los directorios de más alto nivel del código que con los nombres "<file>BUGS</file>", "<file>README*</file>", "<file>TODO</file>" etc.
fr: Par défaut, il inclut tous les fichiers, existant dans le répertoire racine des sources, qui sont nommés « <file>BUGS</file> », « <file>README*</file> », « <file>TODO</file> », etc.
it: Normalmente, questo file includerà tutti i file esistenti nella directory dei sorgenti di più alto livello che sono chiamati "<file>BUGS</file>", "<file>README*</file>", "<file>TODO</file>" ecc.
ja: デフォルトでは、ソースディレクトリのトップレベルに存在する "<file>BUGS</file>"、 "<file>README*</file>"、 "<file>TODO</file>" などの名前を持つファイル全てを含みます。
zh_cn: 默认情况下它会加入代码目录顶层的所有名为 <file>BUGS</file>、<file>README*</file>、<file>TODO</file> 等的文件。
zh_tw: 默認情況下它會加入程式碼目錄頂層的所有名爲 <file>BUGS</file>、<file>README*</file>、<file>TODO</file> 等的檔案。

source: For <package>gentoo</package>, I also included some other files:
ca: També n'inclouré alguns d'altres per a <package>gentoo</package>:
es: También incluiré algunos otros para <package>gentoo</package>:
fr: Pour<package>gentoo</package>, sont aussi inclus :
it: Per il pacchetto <package>gentoo</package>, nell'esempio, sono stati inclusi anche altri files:
ja: では、<package>gentoo</package>に付属文書をいくつか指定してみましょう。
zh_cn: 对于 <package>gentoo</package>，我还加入了一些其他文件：
zh_tw: 對於 <package>gentoo</package>，我還加入了一些其他檔案：

source: BUGS CONFIG-CHANGES CREDITS NEWS README README.gtkrc TODO
ca: BUGS CONFIG-CHANGES CREDITS ONEWS README README.gtkrc TODO
es: BUGS CONFIG-CHANGES CREDITS ONEWS README README.gtkrc TODO

source: <file>emacsen-*</file> file
ca: Fitxer <file>emacsen-*</file>.
es: Archivo <file>emacsen-*</file>
fr: Fichier <file>emacsen-*</file>
it: Il file <file>emacsen-*</file>
ja: <file>emacsen-*</file> ファイル
zh_cn: <file>emacsen-*</file> 文件
zh_tw: <file>emacsen-*</file> 檔案

source: If your package supplies Emacs files that can be bytecompiled at package installation time, you can use these files to set it up.
ca: Si el teu paquet proporciona fitxers Emacs que es poden compilar a bytes en el moment de la instal·lació, pots fer servir aquests fitxers.
es: Si tu paquete proporciona ficheros Emacs que pueden ser compilados a bytes («bytescompile») en el momento de la instalación, puedes usar estos ficheros.
fr: Si votre paquet fournit des fichiers Emacs qui peuvent être byte-compilés au moment de l'installation, vous pouvez utiliser ces fichiers pour les configurer.
it: Se il pacchetto generato contiene file Emacs che possono essere compilati al momento dell'installazione, i file emacsen-* possono essere usati per impostarne la compilazione
ja: パッケージをインストールする際にバイトコンパイル可能な Emacs ファイルがあなたのパッケージに含まれている場合、これらの emacsen-* ファイルを利用してそれを設定することができます。
zh_cn: 如果你的软件包提供可以在安装时编译为字节码的 Emacs 文件，你可以使用这些文件设置。
zh_tw: 如果你的套件提供可以在安裝時編譯爲字節碼的 Emacs 檔案，你可以使用這些檔案設置。

source: They are installed into the temporary directory by <manref section="1" name="dh_installemacsen">.
ca: Aquests fitxers seran instal·lats en el directori temporal per <manref section="1" name="dh_installemacsen">.
es: El programa <manref section="1" name="dh_installemacsen"> instalará estos archivos en el directorio temporal .
fr: Ils sont installés dans le répertoire temporaire par <manref section="1" name="dh_installemacsen">.
it: Tali file sono installati nella directory temporanea con <manref section="1" name="dh_installemacsen">.
ja: これらのファイルは<manref section="1" name="dh_installemacsen">によってパッケージ作成用の一時的なディレクトリにインストールされます。
zh_cn: 它们会被 <manref section="1" name="dh_installemacsen"> 安装到临时目录。
zh_tw: 它們會被 <manref section="1" name="dh_installemacsen"> 安裝到臨時目錄。

source: If you don't need these, remove them.
ca: ﻿Elimina'ls si no els necessites.
es: Elimínalos si no los necesitas.
fr: Si vous n'en avez pas besoin, effacez-les.
it: Se non se ne ha bisogno, possono essere eliminati.
ja: 不要ならこのファイルを削除してください。
zh_cn: 如果你不需要这些，就删除它们。
zh_tw: 如果你不需要這些，就刪除它們。

source: <file><var>package</var>.examples</file> file
ca: Fitxer <file><var>nom_paquet</var>.examples</file>.
es: Archivo <file><var>nombre_del_paquete</var>.examples</file>
fr: Fichier <file><var>paquet</var>.examples</file>
it: <file>Il file <var>pacchetto</var>.examples</file>
ja: <file><var>package</var>.examples</file>ファイル
zh_cn: <file><var>package</var>.examples</file> 文件
zh_tw: <file><var>package</var>.examples</file> 檔案

source: The <manref section="1" name="dh_installexamples"> command installs files and directories listed in this file as example files.
ca: L'ordre <manref section="1" name="dh_installexamples"> instal·la els fitxers i directoris llistats en aquest arxiu com a fitxers d'exemple.
es: La orden <manref section="1" name="dh_installexamples"> instala los archivos y directorios listados en este archivo como archivos de ejemplos.
fr: La commande <manref section="1" name="dh_installexamples"> installe les fichiers et répertoires énumérés ici comme des fichiers d'exemple.
ja: <manref section="1" name="dh_installexamples">コマンドはこのディレクトリに列挙されたファイルを例としてインストールします。
zh_cn: <manref section="1" name="dh_installexamples"> 会将列出的文件和目录作为示例文件安装。
zh_tw: <manref section="1" name="dh_installexamples"> 會將列出的檔案和目錄作爲範例檔案安裝。

source: <file><var>package</var>.init</file> and <file><var>package</var>.default</file> files
ca: Fitxers <file><var>nom_paquet</var>.init</file> <file><var>nom_paquet</var>.default</file>
es: Archivos <file><var>nombre_del_paquete</var>.init</file> y <file><var>nombre_del_paquete</var>.default</file>
fr: Fichiers <file><var>paquet</var>.init</file> et <file><var>paquet</var>.default</file>
ja: <file><var>package</var>.init</file> と <file><var>package</var>.default</file> ファイル
zh_cn: <file><var>package</var>.init</file> 和 <file><var>package</var>.default</file> 文件
zh_tw: <file><var>package</var>.init</file> 和 <file><var>package</var>.default</file> 檔案

source: If your package is a daemon that needs to be run at the system start-up, you've obviously disregarded my initial recommendation, haven't you? :-)
ca: Si el teu paquet és un dimoni que s'executa en iniciar-se el sistema, és que no has fet cas a la meva recomanació inicial, o no? :-)
es: Si tu paquete es un demonio que necesita ejecutarse en el arranque del sistema, obviamente has desatendido mi recomendación inicial, ¿o no? :-)
fr: Si votre paquet est un démon qui doit être exécuté au démarrage du système, vous avez de toute évidence ignoré les recommandations initiales, n'est-ce-pas ? :-)
it: Se il pacchetto generato è un demone che deve partire all'avvio del sistema, hai chiaramente ignorato le mie raccomandazioni iniziali, vero? :-)
ja: もしあなたのパッケージがデーモンであり、システムの起動時に 自動的に動作させる必要があるとしたら、私が最初に勧めたことを あなたはまるっきり無視してしまったわけですよね。そうでしょ ?:-)
zh_cn: 如果你的软件包需要在系统启动时运行一个守护进程，那么你显然没有按照我最初的建议做事，不是吗？ :-)
zh_tw: 如果你的套件需要在系統啓動時運行一個守護進程，那麼你顯然沒有按照我最初的建議做事，不是嗎？ :-)
