Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: <strong>Debian package version</strong>: The Debian package version is referred as the following.
ca: <strong>versió del paquet Debian</strong> («Debian package version»): es fan servir les següents expressions:
es: <strong>versión del paquete Debian</strong> («Debian package version»): para referirse a la versión del paquete Debian se utiliza la nomenclatura que se indica a continuación.
fr: <strong>version de paquet Debian</strong> : la version de paquet Debian est mentionnée comme suit :
it: <strong>Versione del pacchetto Debian (Debian package version)</strong>: La versione del pacchetto Debian è composta come segue.
ja: <strong>Debian パッケージバージョン</strong>: Debian のパッケージバージョンは、次のように呼ばれます。
zh_cn: <strong>Debian 软件包版本</strong>：Debian 软件包版本被按以下规则指代。
zh_tw: <strong>Debian 套件版本</strong>：Debian 套件版本被按以下規則指代。

source: <tt><var>version</var></tt> for the native Debian binary package and for the Debian source package.
ca: <tt><var>versió</var></tt> per als paquets binaris ﻿nadius de Debian i pels paquets del codi original.
es: <tt><var>versión</var></tt> para los paquetes binarios nativos de Debian y para los paquetes de código fuente.
fr: <tt><var>version</var></tt> pour un paquet binaire Debian natif et pour un paquet source Debian ;
it: <tt><var>version</var></tt> per i pacchetti binari e sorgenti nativi Debian.
ja: ネイティブの Debian バイナリパッケージと Debain のソースパッケージでは、<tt><var>version</var></tt> です。
zh_cn: 对于 Debian 创建的软件，其源代码包的版本即为上文所述的 <tt><var>version</var></tt>。
zh_tw: 對於 Debian 創建的軟體，其原始碼包的版本即爲上文所述的 <tt><var>version</var></tt>。

source: <tt><var>version</var>-<var>revision</var></tt> for the non-native Debian binary package.
ca: <tt><var>versió</var>-<var>revisió</var></tt> per als paquets binaris que no són ﻿nadius de Debian.
es: <tt><var>versión</var>-<var>revisión</var></tt> para los paquetes binarios de Debian no nativos.
fr: <tt><var>version</var>-<var>revision</var></tt> pour un paquet binaire Debian non natif.
it: <tt><var>version</var>-<var>revision</var></tt> per i pacchetti binari non-nativi Debian (esempio quelli di terze parti).
ja: ネイティブではない Debian バイナリパッケージでは、<tt><var>version</var>-<var>revision</var></tt> です。
zh_cn: 对于不是 Debian 创建的软件，其源代码包的版本为 <tt><var>version</var>-<var>revision</var></tt>。
zh_tw: 對於不是 Debian 創建的軟體，其原始碼包的版本爲 <tt><var>version</var>-<var>revision</var></tt>。

source: Please read the other manuals if you need more details on terminology.
ca: Els altres manuals de Debian, expliquen amb més detall la terminologia.
es: Para más detalles de la terminología, se aconseja leer los otros manuales de Debian.
fr: Veuillez lire les autres manuels pour plus de détail sur la terminologie.
it: Se si vuole approfondire nel dettaglio la terminologia, si consiglia la lettura di altri manuali.
ja: 用語についての詳細が必要であれば、他のマニュアルを読んでください。
zh_cn: 如果你需要更详细地了解术语，请阅读其他手册。
zh_tw: 如果你需要更詳細地瞭解術語，請閱讀其他手冊。

source: Official Debian Developer
ca: Desenvolupador oficial de Debian.
es: Desarrollador oficial de Debian
fr: Développeur Debian officiel
it: Sviluppatore ufficiale Debian
ja: 正式な Debian 開発者
zh_cn: 正式的 Debian Developer
zh_tw: 正式的 Debian Developer

source: You can not become an official <strong>Debian Developer</strong> (DD) over night because it takes more than technical skill. Please do not be discouraged by this. If it is useful to others, you can still upload your package either as a <strong>maintainer</strong> through a <strong>sponsor</strong> or as a <strong>Debian Maintainer</strong>. See <url id="&newmaint;" name="Debian New Maintainers"> for more.
ca: Tal vegada vols arribar a ésser desenvolupador oficial de Debian en acabar el teu paquet (o fins i tot abans). No és possible arribar a ésser desenvolupador oficial de Debian de la nit al dia degut a què no és suficient ésser tècnicament competent. Cal no desanimar-se per això. Pots aconseguir que el teu paquet passi al repositori, si és d'utilitat als usuaris, com a <strong>responsable</strong> mitjançant un <strong>patrocinador</strong> o un <strong>empaquetador de Debian</strong>. Pots informar-te sobre el procediment consultant l<url id="&newmaint;" name="el racó del nou desenvolupador de Debian">.
es: No puedes convertirte en <strong>desarrollador oficial de Debian</strong> (DD) de la noche a la mañana porque hace falta algo más que habilidades técnicas. No te sientas desilusionado por esto. Aún puedes subir tu paquete, si es útil a otras personas, como <strong>empaquetador</strong> a través de un <strong>patrocinador</strong> o un <strong>empaquetador de Debian</strong>. Encontrarás más información de este procedimiento en <url id="&newmaint;" name="el rincón del nuevo desarrollador de Debian">.
fr: Il n'est pas possible de devenir <strong>développeur Debian</strong> (DD) en une nuit car il ne suffit pas de compétences techniques. Veuillez ne pas vous décourager. Si c'est utile à d'autres, vous pouvez toujours envoyer vos paquets soit en tant que <strong>responsable</strong> via un <strong>parrain</strong> ou comme un <strong>responsable Debian</strong>. Voir le <url id="&newmaint;" name="coin du nouveau responsable Debian"> pour plus d'informations.
it: Non è possibile diventare uno <strong>sviluppatore Debian</strong> (DD) dal giorno alla notte, poiché questo richiede più che delle semplici conoscenze tecniche. Ma non ci si deve lasciare scoraggiare da questo. Se il lavoro che si è fatto è utile a qualcun altro, si può sempre depositare il proprio pacchetto sia come <strong>maintainer</strong> attraverso uno <strong>sponsor</strong> che come <strong>maintainer Debian</strong>. Vedere <url id="&newmaint;" name="L'angolo del nuovo manutentore Debian"> per maggiori informazioni.
ja: 一夜にして正式な <strong>Debian 開発者</strong> (DD) になることはできません。これは技術的なスキルだけに留まらない何かが必要となるからです。がっかりしないでください。それが他の人にとっても便利なものなら、<strong>メンテナ</strong>として <strong>スポンサー</strong> を通して、あるいは <strong>Debian メンテナ</strong> として、パッケージをアップロードすることは可能です。ここで述べたスポンサーとは正式な Debian 開発者で、メンテナがパッケージを Debian アーカイブにアップロードするのを補助する人を指します。この手順に関する詳細は <url id="&newmaint;" name="Debian 新規メンテナのコーナー"> にあります。
zh_cn: 你不可能在一夜之间成为 <strong>Debian Developer</strong> (DD)，因为一个 DD 所需要的远不只是技术能力，请不要因此感觉到挫败或沮丧。如果你的软件对其他人有用，你可以作为一个 <strong>维护者(maintainer)</strong> 通过 一位 <strong>保证人(sponsor)</strong> 来上传软件，或者申请成为一位 <strong>Debian Maintainer</strong>。详见 <url id="&newmaint;" name="Debian New Maintainers">。
zh_tw: 你不可能在一夜之間成爲 <strong>Debian Developer</strong> (DD)，因爲一個 DD 所需要的遠不只是技術能力，請不要因此感覺到挫敗或沮喪。如果你的軟體對其他人有用，你可以作爲一個 <strong>維護者(maintainer)</strong> 通過 一位 <strong>保證人(sponsor)</strong> 來上傳軟體，或者申請成爲一位 <strong>Debian Maintainer</strong>。詳見 <url id="&newmaint;" name="Debian New Maintainers">。

source: Please note that you do not need to create any new package to become an official Debian Developer. Contributing to the existing packages can provide a path to become an official Debian Developer too. There are many packages waiting for good maintainers (see <ref id="choose">).
ca: No és necessari construir un nou paquet per ésser desenvolupador oficial de Debian. Una opció és contribuir en el manteniment d'algun dels paquets de la distribució. Hi ha molts paquets pendents d'algú que s'en faci càrrec (consulta <ref id="choose">).
es: Ten en cuenta que no es necesario construir un paquete nuevo para poder convertirte en desarrollador oficial de Debian. Una opción para ser desarrollador oficial es contribuir al mantenimiento de los paquetes ya existentes en la distribución. Hay muchos paquetes esperando un buen responsable (véase <ref id="choose">).
fr: Remarquez qu'il n'est pas nécessaire de créer de nouveau paquet pour devenir un développeur Debian officiel. Contribuer aux paquets existants peut aussi fournir une voie pour devenir un développeur Debian. Beaucoup de paquets sont en attente de bons responsables (voir <ref id="choose">).
it: Non è necessario creare un nuovo pacchetto per diventare uno sviluppatore ufficiale Debian. Lo si può diventare anche semplicemente contribuendo alla manutenzione di pacchetti già esistenti. Ci sono molti pacchetti che aspettano solo dei bravi responsabili (vedere <ref id="choose">).
ja: 正式な Debian 開発者になるのに新しいパッケージの作成は必須ではないことに注意してください。既存のパッケージに対して貢献していくことでも正式な Debian 開発者への道は開かれます。多くのパッケージがよいメンテナを待っています (<ref id="choose"> を参照)。
zh_cn: 请注意，要成为一位正式的 Debian Developer 并不一定要创建新软件包。对已有软件做出贡献也是成为正式的 Debian Developer 的路径。眼下正有很多软件包正在等待一个好的维护者对其做出贡献。(参看 <ref id="choose">)
zh_tw: 請注意，要成爲一位正式的 Debian Developer 並不一定要創建新套件。對已有軟體做出貢獻也是成爲正式的 Debian Developer 的路徑。眼下正有很多套件正在等待一個好的維護者對其做出貢獻。(參考 <ref id="choose">)

source: Where to ask for help
ca: On demanar ajuda.
es: Dónde pedir ayuda
fr: Où demander de l'aide
it: Dove trovare aiuto
ja: 相談するには
zh_cn: 到何处寻求帮助
zh_tw: 到何處尋求幫助

source: Before you decide to ask your question in some public place, please just RTFM. That includes documentation in <file>/usr/share/doc/dpkg</file>, <file>/usr/share/doc/debian</file>, <file>&autotools-dev;</file>, <file>/usr/share/doc/<var>package</var>/*</file> files and the <prgn>man</prgn>/<prgn>info</prgn> pages for all the programs mentioned in this document. See all the information at <url id="&nm-home;">.
ca: Abans de fer preguntes en els ﻿fòrums públics, si us plau llegeix els manuals . Em refereixo a <file>/usr/share/doc/dpkg</file>, <file>/usr/share/doc/debian</file>, <file>&autotools-dev;</file>, <file>/usr/share/doc/<var>package</var>/*</file> i els manuals d'ajuda <prgn>man</prgn>/<prgn>info</prgn> de cada un dels programes fets servir en la construcció dels paquets, així com la informació disponible a <url id="&nm-home;">.
es: Antes de realizar preguntas en alguno de los foros públicos, por favor lee los manuales (N. de t.: el original utiliza el acrónimo inglés RTFM (traducido como LEJM) que es más «expresivo».). Esto incluye la documentación ubicada en <file>/usr/share/doc/dpkg</file>, <file>/usr/share/doc/debian</file>, <file>&autotools-dev;</file>, <file>/usr/share/doc/<var>package</var>/*</file> y los manuales de ayuda <prgn>man</prgn>/<prgn>info</prgn> de cada uno de los programas mencionados en este documento, así como la información disponible en <url id="&nm-home;">.
fr: Avant de vous décider à poser une question dans un lieu public, veuillez RTFM. Ceci comprend la documentation sous <file>/usr/share/doc/dpkg</file>, <file>/usr/share/doc/debian</file>, <file>&autotools-dev;</file>, <file>/usr/share/doc/<var>paquet</var>/*</file> et les pages de <prgn>man</prgn> et <prgn>info</prgn> pour tous les programmes mentionnés dans ce document. Consultez toutes les informations dans <url id="&nm-home;">.
ja: どこか公共の場で質問しようとする前に、まずマニュアルを読んでください。このマニュアルというのは、<file>/usr/share/doc/dpkg</file>、<file>/usr/share/doc/debian</file>、<file>&autotools-dev;</file>、<file>/usr/share/doc/<var>パッケージ名</var>/*</file> のドキュメントや、この文書で触れる全てのプログラムの <prgn>man</prgn>/<prgn>info</prgn>ページなどを含みます。<url id="&nm-home;"> にある情報すべてを参考にしてください。
zh_cn: 在公共场所提出问题前请先阅读各种文档(RTFM，Read The Fucking Manual)。包括但不限于 <file>/usr/share/doc/dpkg</file>、<file>/usr/share/doc/debian</file>、<file>&autotools-dev;</file>、<file>/usr/share/doc/<var>package</var>/*</file> 文件和本文档中提及的软件的 <prgn>man</prgn>/<prgn>info</prgn> 页面。更多内容参看 <url id="&nm-home;">
zh_tw: 在公共場所提出問題前請先閱讀各種文件(RTFM，Read The Fucking Manual)。包括但不限於 <file>/usr/share/doc/dpkg</file>、<file>/usr/share/doc/debian</file>、<file>&autotools-dev;</file>、<file>/usr/share/doc/<var>package</var>/*</file> 檔案和本文件中提及的軟體的 <prgn>man</prgn>/<prgn>info</prgn> 頁面。更多內容參考 <url id="&nm-home;">

source: Making a small test package is good way to learn details of packaging. Inspecting existing well maintained packages is the best way to learn how other people make packages.
ca: Començar a treballar en un paquet petit és una bona opció per aprendre els detalls de la creació de paquets. Inspeccionar els paquets mantinguts per altres persones és una excel·lent manera d'aprendre.
es: Construir un paquete pequeño es una buena forma de aprender los detalles del empaquetamiento. Inspeccionar paquetes bien mantenidos es la mejor forma de aprender cómo otros mantienen paquetes.
fr: Faire un petit paquet de test est une bonne façon d'apprendre les particularités de l'empaquetage. Examiner les paquets bien maintenus est le meilleur moyen d'apprendre comment les autres font leurs paquets.
it: Creare un piccolo pacchetto di test è un ottimo metodo per imparare i dettagli della pacchettizzazione. Analizzare dei pacchetti già esistenti e ben manutenuti, è invece, il metodo migliore per capire come creano i pacchetti le altre persone.
ja: 小さなテストパッケージを作ることは、パッケージ作成の詳細を学ぶよい方法です。他の人がどのようにパッケージを作成しているか学ぶには、既存のよく保守されているパッケージを調べるのが一番です。
zh_cn: 制作小的测试软件包是学习打包的好方法，仔细查看维护较好的软件包则是了解他人如何制作软件包的最佳办法。
zh_tw: 製作小的測試套件是學習打包的好方法，仔細查看維護較好的套件則是瞭解他人如何製作套件的最佳辦法。

source: If you still have questions about packaging that you couldn't find answers to in the available documentation and web resources, you can ask them on the Debian Mentors' mailing list at <url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org">. The more experienced Debian developers will gladly help you, but do read at least some of the documentation before asking a question!
ca: Si tens dubtes sobre la construcció de paquets i no les pots resoldre amb la documentació disponible, publica la pregunta a la llista de correu de «Debian Mentors» <url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org">. Desenvolupadors amb més experiència t'ajudaran, però llegeix la documentació abans de fer preguntes!
es: Si tienes dudas sobre empaquetado a las que no has podido encontrar respuesta en la documentación y en el la web, puedes preguntar en la lista de correo de Debian Mentors <url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org">. Los desarrolladores más experimentados de Debian, te ayudarán gustosamente, pero, por favor, ¡léete la documentación antes de preguntar!.
fr: Si vous avez encore des questions sur la création de paquets pour lesquelles vous n'avez pas pu trouver de réponse dans la documentation, vous pouvez les poser sur la liste de diffusion des mentors Debian en <url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org">. Les responsables Debian les plus expérimentés seront heureux de vous aider, mais au moins lisez une partie de la documentation avant de poser une question !
it: Se si ha una domanda a cui non si è trovata risposta né nella documentazione che nelle varie risorse web, si può chiedere nella mailing list dei mentori Debian, all'indirizzo <url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org">. Degli sviluppatori Debian esperti saranno lieti di aiutarvi, ma prima di porre una domanda è necessario leggere almeno parte della documentazione.
ja: 既存の文書やウェブの情報では答えが見つからないような、パッケージ作成についての質問がまだあるなら、<url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org"> にある Debian Mentors のメーリングリストで聞くことができます。より経験豊富な Debian 開発者が喜んで手助けしてくれるでしょう。ただし、質問する前に少なくともある程度は文書類を読んでおくこと！
zh_cn: 如果在所有可用的文档和在线资源中都无法找到答案，你可以在 Debian Mentors 邮件列表询问(<url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org">)。在那里会有经验更加丰富的 Debian 开发人员帮助你，但在发问前请确定要阅读已有的文档！
zh_tw: 如果在所有可用的文件和在綫資源中都無法找到答案，你可以在 Debian Mentors 郵件列表詢問(<url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org">)。在那裏會有經驗更加豐富的 Debian 開發人員幫助你，但在發問前請確定要閱讀已有的文件！

source: See <url id="http://lists.debian.org/debian-mentors/"> for more information about this mailing list.
ca: Consulta <url id="http://lists.debian.org/debian-mentors/"> si vols més informació sobre la llista de correu.
es: Consulta <url id="http://lists.debian.org/debian-mentors/"> para más información sobre esta lista de correo.
fr: Consultez <url id="http://lists.debian.org/debian-mentors/"> pour plus d'informations sur cette liste de diffusion.
it: Vedere <url id="http://lists.debian.org/debian-mentors/"> per avere più informazioni in merito alla mailing list.
ja: このメーリングリストについての詳細は、<url id="http://lists.debian.org/debian-mentors/">を参照してください。
zh_cn: 关于此邮件列表，参看 <url id="http://lists.debian.org/debian-mentors/">
zh_tw: 關於此郵件列表，參考 <url id="http://lists.debian.org/debian-mentors/">

source: When you receive a bug report (yes, actual bug reports!), you will know that it is time for you to dig into the <url id="http://www.debian.org/Bugs/" name="Debian Bug Tracking System"> and read the documentation there, to be able to deal with the reports efficiently. I highly recommend reading the <url id="http://www.debian.org/doc/manuals/developers-reference/pkgs.html#bug-handling" name="Developer's Reference, 5.8. 'Handling bugs'">.
ca: En rebre un ﻿avís d'error (sí, un avís d'error de veritat!) serà el moment de donar un cop d'ull al <url id="http://www.debian.org/Bugs/" name="Sistema de seguiment d'errades de Debian"> i llegir la documentació per tal de conèixer el procediment adequat. Et recomano la lectura de la <url id="http://www.debian.org/doc/manuals/developers-reference/pkgs.html#bug-handling" name="Developer's Reference, 5.8. 'Handling bugs'">.
es: Cuando recibas un aviso de fallo (sí, avisos de fallos, ¡de verdad!) sabrás que es el momento de indagar en el <url id="http://www.debian.org/Bugs/" name="Sistema de seguimiento de fallos de Debian"> y leer la documentación de allí para poder tratar los informes de forma eficiente. Te recomiendo la lectura de la Referencia del Desarrollador, en particular el capítulo de «<url id="http://www.debian.org/doc/manuals/developers-reference/pkgs.html#bug-handling" name="Referencia del desarrollador sección 5.8 - Manejo de fallos">» («Handling Bugs»).
fr: Quand vous recevrez un rapport de bogue (oui, un vrai rapport de bogue !) vous saurez qu'il est temps de vous plonger dans le <url id="http://www.debian.org/Bugs/" name="système de suivi de bogues Debian"> et de lire la documentation, pour être à même de gérer les rapports efficacement. La lecture de la <url id="http://www.debian.org/doc/manuals/developers-reference/pkgs.html#bug-handling" name="référence du développeur, chapitre 5.8 « Manipulation des bogues »"> est fortement recommandée.
it: Quando si ricevono delle segnalazioni di bug (sì, proprio quelle!), si dovrà approfondire l'utilizzo del <url id="http://www.debian.org/Bugs/" name="Sistema di tracciamento dei bug di Debian"> e leggere la relativa documentazione, per essere in grado di gestire le segnalazioni in maniera efficiente. È vivamente consigliato leggere <url id="http://www.debian.org/doc/manuals/developers-reference/pkgs.html#bug-handling" name="Developer's Reference, 5.8. 'Handling bugs'">.
ja: バグレポート (そう、本物のバグレポートです！) を受けとったら、レポートを効率的にさばくために、<url id="http://www.debian.org/Bugs/" name="Debian バグ追跡システム"> を掘り下げ、その説明文書を読む時だということがわかるでしょう。<url id="http://www.debian.org/doc/manuals/developers-reference/pkgs.html#bug-handling" name="開発者リファレンスの 5.8. 'Handling bugs'"> を読むよう、強くおすすめします。
zh_cn: 当你收到一个 Bug 报告后(没错，真正的 Bug 报告！)，你需要研究 <url id="http://www.debian.org/Bugs/" name="Debian Bug Tracking System"> (Debian Bug 跟踪系统，BTS)并阅读相关的文档以便高效处理这些报告。我推荐阅读 <url id="http://www.debian.org/doc/manuals/developers-reference/pkgs.html#bug-handling" name="Developer's Reference, 5.8. 'Handling bugs'">
zh_tw: 當你收到一個 Bug 報告後(沒錯，真正的 Bug 報告！)，你需要研究 <url id="http://www.debian.org/Bugs/" name="Debian Bug Tracking System"> (Debian Bug 跟蹤系統，BTS)並閱讀相關的文件以便高效處理這些報告。我推薦閱讀 <url id="http://www.debian.org/doc/manuals/developers-reference/pkgs.html#bug-handling" name="Developer's Reference, 5.8. 'Handling bugs'">

source: If you still have questions, ask on the Debian Developers' mailing list at <url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org">. See <url id="http://lists.debian.org/debian-devel/"> for more information about this mailing list.
ca: Si tot i així tens dubtes, pots fer consultes a la llista de distribució de Desenvolupadors de Debian a <url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org">. Consulta <url id="http://lists.debian.org/debian-devel/"> per saber-ne més sobre aquesta llista de correu.
es: Si aún tienes preguntas, házlas en la lista de distribución de Desarrolladores de Debian en <url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org">. Véase <url id="http://lists.debian.org/debian-devel/"> para más información sobre esta lista de correo.
fr: Si vous avez encore des questions, posez-les sur la liste de diffusion des développeurs Debian en <url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org">. Consultez <url id="http://lists.debian.org/debian-devel/"> pour plus d'informations sur cette liste de diffusion.
it: Se rimangono delle domande, si può chiedere nella mailing list degli sviluppatori Debian, all'indirizzo <url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org">. Vedere <url id="http://lists.debian.org/debian-devel/"> per avere più informazioni a riguardo della mailing list.
ja: 他にまだ質問があれば、<url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org"> にある Debian 開発者メーリングリストで聞いてください。このメーリングリストについての詳細は <url id="http://lists.debian.org/debian-devel/"> を参照してください。
zh_cn: 如果仍然不能解决所有的问题，则到 Debian Developers 邮件列表询问(<url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org">)。关于此邮件列表，参看 <url id="http://lists.debian.org/debian-devel/">
zh_tw: 如果仍然不能解決所有的問題，則到 Debian Developers 郵件列表詢問(<url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org">)。關於此郵件列表，參考 <url id="http://lists.debian.org/debian-devel/">

source: Even if it all worked well, it's time to start praying. Why? Because in just a few hours (or days) users from all around the world will start to use your package, and if you made some critical error you'll get mailbombed by numerous angry Debian users... Just kidding. :-)
ca: Encara que tot funcioni correctament, cal encomanar-se! Només en unes hores (o dies) els usuaris de tot el món faran ús del teu paquet, i si has fet alguna errada crítica, centenars d'usuaris furiosos de Debian et bombardejaran amb correus...feia broma :-)
es: Aunque todo funcione bien, es el momento de cruzar los dedos. ¿Por qué? Por que en sólo unas horas (o días) usuarios de todo el mundo empezarán a usar tu paquete, y si cometiste algún error crítico centenares de usuarios furiosos de Debian te bombardearán con correos... sólo bromeaba :-)
fr: Même si tout fonctionne bien, il est temps de commencer à prier. Pourquoi ? Parce que dans quelques heures (ou jours) les utilisateurs du monde entier vont commencer à utiliser votre paquet, et si vous avez fait des erreurs critiques, vous serez bombardé par les courriers électroniques d'utilisateurs Debian furieux... :-)
it: Anche se tutto è andato per il meglio, è arrivato il momento di pregare. Perché? Perché in poche ore (o giorni) utenti da tutto il mondo cominceranno ad usare il vostro pacchetto, e se si è commesso qualche errore grave, la proprio email sarà inondata da messaggi di molti utenti Debian incavolati... Si scherza ovviamente. :-)
ja: 全てうまくやったとしても、これからはお祈りの時間です。なぜか？ それは、ほんの数時間 (あるいは数日) で、世界中のユーザがそのパッケージを使いはじめるからです。もし何か致命的なエラーをやらかしていたら、膨大な数の怒った Debian ユーザからメール爆弾を受けとることになります……なんて冗談ですが :-)
zh_cn: 即使以上的问题都解决了，也不能高兴得太早。为什么？因为几个小时或几天内就会有人开始使用你的软件包，如果你犯了某些严重的错误，将被无数生气的 Debian 用户的邮件所轰炸…… 只是开个玩笑。:-)
zh_tw: 即使以上的問題都解決了，也不能高興得太早。爲什麼？因爲幾個小時或幾天內就會有人開始使用你的套件，如果你犯了某些嚴重的錯誤，將被無數生氣的 Debian 用戶的郵件所轟炸…… 只是開個玩笑。:-)
