Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: make install \ DESTDIR=<var>/path/to</var>/<var>package</var>_<var>version</var>-<var>revision</var>/debian/<var>package</var>
ca: make install \ DESTDIR=<var>/directori/del</var>/<var>paquet </var>_<var>versió</var>-<var>revisió</var>/debian/<var>nom_paquet</var>
es: make install \ DESTDIR=<var>/ruta/a</var>/<var>paquete</var>_<var>versión</var>-<var>revisión</var>/debian/<var>paquete</var>
fr: make install \ DESTDIR=<var>/chemin/vers</var>/<var>paquet</var>_<var>version</var>-<var>revision</var>/debian/<var>paquet</var>

source: Targets which require the <prgn>fakeroot</prgn> command contain <prgn>dh_testroot</prgn>. If you are not pretending to be root using this command, it exits with an error.
ca: Els objectius que cal executar amb l'ordre <prgn>fakeroot</prgn> contenen <prgn>dh_testroot</prgn>. Si no fas servir l'ordre «fakeroot» per simular l'execució per l'usuari «root», es produirà una errada que aturarà l'execució.
es: Los objetivos que deben ejecutarse con la orden <prgn>fakeroot</prgn> contienen <prgn>dh_testroot</prgn>. Si no utilizas la orden para simular la ejecución por el usuario «root», se producirá un error que detendrá la ejecución.
fr: Les cibles ayant besoin de la commande <prgn>fakeroot</prgn> contiennent <prgn>dh_testroot</prgn>. Si vous ne vous faites pas passer pour le superutilisateur lors de l'utilisation de cette commande, elle se terminera en erreur.
it: Gli obiettivi che richiedono il comando <prgn>fakeroot</prgn> contengono <prgn>dh_testroot</prgn>. Se non si sta fingendo di essere root utilizzando questo comando, questo terminerà con un errore.
ja: <prgn>fakeroot</prgn>コマンドを必要とするターゲットは<prgn>dh_testroot</prgn>を含みます。このコマンドでルートのふりをしなければ、エラーで終了します。
zh_cn: 需要 <prgn>fakeroot</prgn> 命令的都包含了 <prgn>dh_testroot</prgn>。如果你没有假装为 root，将会报错并退出。
zh_tw: 需要 <prgn>fakeroot</prgn> 命令的都包含了 <prgn>dh_testroot</prgn>。如果你沒有假裝爲 root，將會報錯並退出。

source: The important part to know about the <file>rules</file> file created by <prgn>dh_make</prgn>, is that it is just a suggestion. It will work for most packages but for more complicated ones, don't be afraid to customize it to fit your needs. Only things that you must not change are the names of the rules, because all the tools use these names, as mandated by the Debian Policy.
ca: És important tenir present que el fitxer <file>rules</file> construït per <prgn>dh_make</prgn> només és un exemple. Serà útil per a la majoria dels paquets simples, però no deixis de fer les adaptacions necessàries. L'únic que no pots canviar són els noms de les regles, degut a què totes les eines fan servir el mateixos seguint les normes de Debian.
es: Es importante tener presente que el archivo <file>rules</file> que genera <prgn>dh_make</prgn> es sólo una sugerencia. Será suficiente para la mayoría de los paquetes simples, pero no dejes de adaptarlo a tus necesidades en paquetes más complejos. Lo único que no debes cambiar son los nombres de las reglas, puesto que todas las herramientas los utilizan, como se especifica en la normas de Debian.
fr: Le plus important à propos du fichier <file>rules</file> créé par <prgn>dh_make</prgn>, c'est qu'il s'agit d'une simple suggestion. Il fonctionnera pour la plupart des paquets, mais pour les plus compliqués, vous ne devez pas hésiter à le modifier pour le faire correspondre à vos besoins. Les seules choses à ne pas pas changer sont les noms des règles, car tous les outils utilisent ces noms, conformément à la Charte.
it: La cosa importante da sapere riguardo al file <file>rules</file> creato da <prgn>dh_make</prgn>, è che il suo contenuto contiene dei semplici consigli. Funzionerà per la maggior parte dei pacchetti ma per i più complicati non si esiti a personalizzarlo secondo le proprie esigenze. Le uniche cose che non vanno cambiate sono i nomi delle regole, perché tutti gli strumenti utilizzano questi nomi, così come è indicato dalle policy di Debian.
ja: <prgn>dh_make</prgn>によって作成された<file>rules</file>ファイルについて知っておくべきことは、これは単なるひとつの例でしかないということです。 これはほぼ全てのパッケージに有効ですが、もっと複雑なものに対しては、必要に応じてカスタマイズをする勇気が必要です。ただし、ファイル内に記述された各ルールの名前だけは変えてはいけません。
zh_cn: 关于 <prgn>dh_make</prgn> 生成的 <file>rules</file> 文件，你应该知道的最重要的事是，它仅仅是一个建议。它对多数简单的软件包有效，但对于更复杂的则要大胆对其进行定制以满足需要。只有一件事不应改变，就是它们的名字，这些名称由 Debian Policy 定义且被所有工具使用。
zh_tw: 關於 <prgn>dh_make</prgn> 生成的 <file>rules</file> 檔案，你應該知道的最重要的事是，它僅僅是一個建議。它對多數簡單的套件有效，但對於更複雜的則要大膽對其進行定製以滿足需要。只有一件事不應改變，就是它們的名字，這些名稱由 Debian Policy 定義且被所有工具使用。

source: Although "<tt>install</tt>" is not required target, it is supported. "<tt>fakeroot dh install</tt>" behaves like "<tt>fakeroot dh binary</tt>" but stops after <prgn>dh_fixperms</prgn>.
ca: Malgrat que "<tt>install</tt>" no és un objectiu obligatori, es considera el seu ús. "<tt>fakeroot dh install</tt>" es comporta com "<tt>fakeroot dh binary</tt>" però s'atura després de <prgn>dh_fixperms</prgn>.
es: A pesar de que <tt>install</tt> no es un objetivo obligatorio, se contempla su uso. <tt>fakeroot dh install</tt> se comporta como <tt>fakeroot dh binary</tt> pero se detiene después de <prgn>dh_fixperms</prgn>.
fr: Bien que la cible « <tt>install</tt> » ne soit pas obligatoire, elle est gérée. « <tt>fakeroot dh install</tt> » se comporte comme « <tt>fakeroot dh binary</tt> » mais s'arrête après <prgn>dh_fixperms</prgn>.
it: Anche se l'obiettivo "<tt>install</tt>" non è richiesto, è comunque supportato. "<tt>fakeroot dh install</tt>" si comporta come "<tt>fakeroot dh binary</tt>" ma si ferma dopo <prgn>dh_fixperms</prgn>.
ja: "<tt>install</tt>"は、必須ではりませんがサポートはされています。"<tt>fakeroot dh install</tt>" は "<tt>fakeroot dh binary</tt>" のようにふるまいますが、<prgn>dh_fixperms</prgn>の後で停止します。
zh_cn: 尽管 <tt>install</tt> target 不是必须的，但也被支持。<tt>fakeroot dh install</tt> 的操作就像 <tt>fakeroot dh binary</tt>一样，但停止于 <prgn>dh_fixperms</prgn>。
zh_tw: 儘管 <tt>install</tt> target 不是必須的，但也被支持。<tt>fakeroot dh install</tt> 的操作就像 <tt>fakeroot dh binary</tt>一樣，但停止於 <prgn>dh_fixperms</prgn>。

source: Customization of <file>rules</file> file
ca: Personalització del fitxer <file>rules</file>.
es: Personalización del archivo <file>rules</file>
fr: Personnalisation du fichier <file>rules</file>
it: Personalizzazione del file <file>rules</file>
ja: <file>rules</file> ファイルのカスタマイズ
zh_cn: 定制 <file>rules</file> 文件
zh_tw: 定製 <file>rules</file> 檔案

source: There are many ways to customize the <file>rules</file> file created with the new <prgn>dh</prgn> command.
ca: Pots fer molts canvis per adaptar el fitxer <file>rules</file> construït per l'ordre <prgn>dh</prgn>.
es: Puedes realizar muchos cambios para adaptar el archivo <file>rules</file> construido por la orden <prgn>dh</prgn>.
fr: Il existe plusieurs façons de personnaliser le fichier <file>rules</file> créé avec la nouvelle commande <prgn>dh</prgn>.
it: Verrà qui spiegata la personalizzazione del file <file>rules</file>, creato con il nuovo comando <prgn>dh</prgn>.
ja: 新しい<prgn>dh</prgn>コマンドで作成された<file>rules</file>ファイルをカスタマイズする方法は何通りもあります。
zh_cn: 有很多方法来定制使用新的 <prgn>dh</prgn> 命令创建的 <file>rules</file> 文件。
zh_tw: 有很多方法來定製使用新的 <prgn>dh</prgn> 命令創建的 <file>rules</file> 檔案。

source: The "<tt>dh $@</tt>" command can be customized as follows. <footnote><p>If a package installs the <file>/usr/share/perl5/Debian/Debhelper/Sequence/<var>custom_name</var>.pm</file> file, you should activate its customization function by "<tt>dh --with <var>custom-name</var> $@</tt>". </p></footnote>
ca: L'ordre "<tt>dh $@</tt>" permet les següents adaptacions <footnote><p>Si un paquet instal·la el fitxer <file>/usr/share/perl5/Debian/Debhelper/Sequence/<var>nom_arxiu</var>.pm</file> pots activar la funció adaptada amb "<tt>dh --with <var>nom_arxiu</var> $@</tt>". </p></footnote>:
es: La orden "<tt>dh $@</tt>" permite las siguientes adaptaciones <footnote><p>Si un paquete instala el archivo <file>/usr/share/perl5/Debian/Debhelper/Sequence/<var>nombre_archivo</var>.pm</file> puedes activar la función adaptada con "<tt>dh --with <var>nombre_archivo</var> $@</tt>". </p></footnote>:
fr: La commande « <tt>dh $@</tt> » peut être personnalisée comme suit : <footnote><p>Si un paquet installe le fichier <file>/usr/share/perl5/Debian/Debhelper/Sequence/<var>nom_personnalise</var>.pm</file>, vous devriez déclencher sa fonction de personnalisation avec « <tt>dh --with <var>nom-personnalise</var> $@</tt> . </p></footnote>
ja: "<tt>dh $@</tt>" コマンドは以下の方法でカスタマイズできます。<footnote><p>もし、パッケージが <file>/usr/share/perl5/Debian/Debhelper/Sequence/<var>custom_name</var>.pm</file>ファイルをインストールする場合、そのカスタマイズの機能を "<tt>dh --with <var>custom-name</var> $@</tt>"で有効にしなければなりません。</p></footnote>
zh_cn: <tt>dh $@</tt> 命令可以按以下方式定制。<footnote><p>如果一个软件包安装了 <file>/usr/share/perl5/Debian/Debhelper/Sequence/<var>custom_name</var>.pm</file> 文件，你应当使用 <tt>dh --with <var>custom-name</var> $@</tt> 命令激活其功能。</p></footnote>
zh_tw: <tt>dh $@</tt> 命令可以按以下方式定製。<footnote><p>如果一個套件安裝了 <file>/usr/share/perl5/Debian/Debhelper/Sequence/<var>custom_name</var>.pm</file> 檔案，你應當使用 <tt>dh --with <var>custom-name</var> $@</tt> 命令激活其功能。</p></footnote>

source: Add support of the <prgn>dh_pysupport</prgn> command. (The best choice for Python.) <footnote><p>Use of the <prgn>dh_pysupport</prgn> command is preferred over use of the <prgn>dh_pycentral</prgn> command. Do not use the <prgn>dh_python</prgn> command.</p></footnote>
ca: Afegir funcionalitat per a l'ordre <prgn>dh_pysupport</prgn> (la millor opció per a Python) <footnote><p>És preferible fer servir l'ordre <prgn>dh_pysupport</prgn> abans que l'ordre <prgn>dh_pycentral</prgn>. No facis servir l'ordre <prgn>dh_python</prgn>. </p></footnote>.
es: Añadiendo la orden <prgn>dh_pysupport</prgn> (la mejor opción para Python) <footnote><p>Es preferible el uso de la orden <prgn>dh_pysupport</prgn> respecto a la orden <prgn>dh_pycentral</prgn>. No uses la orden <prgn>dh_python</prgn>. </p></footnote>.
fr: ajout de l'assistance de la commande <prgn>dh_pysupport</prgn> (la meilleure solution pour Python) : <footnote><p>L'utilisation de la commande <prgn>dh_pysupport</prgn> est préférable à <prgn>dh_pycentral</prgn>. N'utilisez pas la commande <prgn>dh_python</prgn>.</p></footnote>
ja: <prgn>dh_pysupport</prgn> コマンドのサポートを追加する(Pythonに最適の選択) <footnote><p><prgn>dh_pycentral</prgn>コマンドよりも<prgn>dh_pysupport</prgn>コマンドが好まれます。<prgn>dh_python</prgn>コマンドは使用しないでください。</p></footnote>
zh_cn: 添加 <prgn>dh_pysupport</prgn> 命令支持。(对于 Python 的最佳选择。)<footnote><p>在 <prgn>dh_pysupport</prgn> 和 <prgn>dh_pycentral</prgn> 命令之间更推荐使用前者，不要使用 <prgn>dh_python</prgn> 命令。</p></footnote>
zh_tw: 添加 <prgn>dh_pysupport</prgn> 命令支持。(對於 Python 的最佳選擇。)<footnote><p>在 <prgn>dh_pysupport</prgn> 和 <prgn>dh_pycentral</prgn> 命令之間更推薦使用前者，不要使用 <prgn>dh_python</prgn> 命令。</p></footnote>

source: Install the <package>python-support</package> package in "<tt>Build-Depends</tt>".
ca: Afegeix el paquet <package>python-support</package> en el camp "<tt>Build-Depends</tt>".
es: Añade el paquete <package>python-support</package> en el campo "<tt>Build-Depends</tt>".
fr: ajout de <package>python-support</package> à « <tt>Build-Depends</tt> » ;
ja: <package>python-support</package>を"<tt>Build-Depends</tt>"にインストールします。
zh_cn: 在 <tt>Build-Depends</tt> 中添加 <package>python-support</package> 软件包。
zh_tw: 在 <tt>Build-Depends</tt> 中添加 <package>python-support</package> 套件。

source: Use "<tt>dh $@</tt>" as usual. (This is enabled by default)
ca: No cal fer canvis en "<tt>dh $@</tt>" (és l'opció predeterminada).
es: Utiliza "<tt>dh $@</tt>" como de costumbre (es la opción predeterminada).
fr: utilisation normale de « <tt>dh $@</tt> » (activé par défaut) ;
ja: 通常通り"<tt>dh $@</tt>"を使用します。(デフォルトで有効になっています。)
zh_cn: 照常使用 <tt>dh $@</tt>。(它被默认启用)
zh_tw: 照常使用 <tt>dh $@</tt>。(它被默認啓用)

source: This handles Python modules using the <package>python-support</package> framework.
ca: Així es gestiona el mòdul Python fent servir el entorn («framework») de <package>python-support</package>.
es: Esto gestiona el módulo Python utilizando las funcionalidades de <package>python-support</package>.
fr: conséquence : gestion des modules Python avec la structure <package>python-support</package> ;
ja: これで<package>python-support</package>フレームワークを使用してPythonモジュールを利用できます。
zh_cn: 这会使用 <package>python-support</package> 框架处理 Python 模块。
zh_tw: 這會使用 <package>python-support</package> 框架處理 Python 模塊。

source: Add support of the <prgn>dh_pycentral</prgn> command.
ca: Afegir funcionalitat per a l'ordre <prgn>dh_pycentral</prgn>.
es: Añadiendo la orden <prgn>dh_pycentral</prgn>.
fr: ajout de l'assistance de la commande <prgn>dh_pycentral</prgn> :
ja: <prgn>dh_pycentral</prgn>のサポートを追加する
zh_cn: 添加 <prgn>dh_pycentral</prgn> 命令支持。
zh_tw: 添加 <prgn>dh_pycentral</prgn> 命令支持。

source: Install the <package>python-central</package> package in "<tt>Build-Depends</tt>".
ca: Afegeix el paquet <package>python-central</package> en el camp "<tt>Build-Depends</tt>".
es: Añade el paquete <package>python-central</package> en el campo "<tt>Build-Depends</tt>".
fr: ajout de <package>python-central</package> à « <tt>Build-Depends</tt> » ;
ja: <package>python-central</package>パッケージをインストールします。
zh_cn: 在 <tt>Build-Depends</tt> 中添加 <package>python-central</package> 软件包。
zh_tw: 在 <tt>Build-Depends</tt> 中添加 <package>python-central</package> 套件。

source: Use "<tt>dh --with python-central $@</tt>" instead.
ca: Fes servir "<tt>dh --with python-central $@</tt>" ﻿en el seu lloc.
es: Utiliza "<tt>dh --with python-central $@</tt>" en su lugar.
fr: utilisation de « <tt>dh --with python-central $@</tt> » à la place ;
ja: 代わりに"<tt>dh --with python-central $@</tt>"を使用します。
zh_cn: 使用 <tt>dh --with python-central $@</tt>
zh_tw: 使用 <tt>dh --with python-central $@</tt>

source: This also deactivates the <prgn>dh_pysupport</prgn> command.
ca: També es desactiva l'ordre <prgn>dh_pysupport</prgn>.
es: Esto desactiva la orden <prgn>dh_pysupport</prgn>.
fr: conséquence : désactivation de la commande <prgn>dh_pysupport</prgn> ;
ja: これで<prgn>dh_pysupport</prgn>コマンドも無効化されます。
zh_cn: 这样会同时停用 <prgn>dh_pysupport</prgn> 命令。
zh_tw: 這樣會同時停用 <prgn>dh_pysupport</prgn> 命令。

source: This handles Python modules using the <package>python-central</package> framework.
ca: I es gestiona el mòdul Python fent servir l'entorn («framework») de <package>python-central</package>.
es: Esto gestiona el módulo Python utilizando las funcionalidades de <package>python-central</package>.
fr: conséquence : gestion des modules Python avec la structure <package>python-central</package> ;
ja: これで<package>python-central</package>フレームワークを使用してPythonモジュールを利用できます。
zh_cn: 这会使用 <package>python-central</package> 框架处理 Python 模块。
zh_tw: 這會使用 <package>python-central</package> 框架處理 Python 模塊。

source: Add support of the <prgn>dh_installtex</prgn> command.
ca: Afegir funcionalitat per a l'ordre <prgn>dh_installtex</prgn>.
es: Añadiendo la orden <prgn>dh_installtex</prgn>.
fr: ajout de l'assistance de la commande <prgn>dh_installtex</prgn> :
ja: <prgn>dh_installtex</prgn>コマンドのサポートを追加する
zh_cn: 添加 <prgn>dh_installtex</prgn> 命令支持。
zh_tw: 添加 <prgn>dh_installtex</prgn> 命令支持。

source: Install the <package>tex-common</package> package in "<tt>Build-Depends</tt>".
ca: Afegeix el paquet <package>tex-common</package> en el camp "<tt>Build-Depends</tt>".
es: Añade el paquete <package>tex-common</package> en el campo "<tt>Build-Depends</tt>".
fr: ajout de <package>tex-common</package> à « <tt>Build-Depends</tt> » ;
ja: <package>tex-common</package>パッケージをインストールします。
zh_cn: 在 <tt>Build-Depends</tt> 中添加 <package>tex-common</package> 软件包。
zh_tw: 在 <tt>Build-Depends</tt> 中添加 <package>tex-common</package> 套件。

source: Use "<tt>dh --with tex $@</tt>" instead.
ca: Fes servir "<tt>dh --with tex $@</tt>" ﻿en el seu lloc.
es: Utiliza "<tt>dh --with tex $@</tt>" en su lugar.
fr: utilisation de « <tt>dh --with tex $@</tt> » à la place ;
ja: 代わりに"<tt>dh --with tex $@</tt>"を使用します。
zh_cn: 使用 <tt>dh --with tex $@</tt>
zh_tw: 使用 <tt>dh --with tex $@</tt>

source: This registers Type 1 fonts, hyphenation patterns, or formats with TeX.
ca: Així es registren les fonts «Type 1», els patrons per a la separació de paraules («hyphenation patterns») o els formats TeX.
es: Esto registra las fuentes «Type 1», los patrones de separación de palabras («hyphenation patterns») o los formatos TeX.
fr: conséquence : enregistrement des fontes de Type 1, des modèles de césure, ou des formats avec Tex ;
ja: これで、TeXによるType1フォント、ハイフネーション、またはフォーマットが登録されます。
zh_cn: 这样会注册 Type 1 字体、断句样式或其他使用 TeX 的格式。
zh_tw: 這樣會註冊 Type 1 字體、斷句樣式或其他使用 TeX 的格式。

source: Add support of the <prgn>dh_quilt_patch</prgn> and <prgn>dh_quilt_unpatch</prgn> commands.
ca: Afegir funcionalitat per a les ordres <prgn>dh_quilt_patch</prgn> i <prgn>dh_quilt_unpatch</prgn>.
es: Añadiendo las órdenes <prgn>dh_quilt_patch</prgn> y <prgn>dh_quilt_unpatch</prgn>.
fr: ajout de l'assistance des commandes <prgn>dh_quilt_patch</prgn> et <prgn>dh_quilt_unpatch</prgn> :
ja: <prgn>dh_quilt_patch</prgn> と <prgn>dh_quilt_unpatch</prgn> コマンドのサポートを追加する
zh_cn: 添加 <prgn>dh_quilt_patch</prgn> 和 <prgn>dh_quilt_unpatch</prgn> 命令支持。
zh_tw: 添加 <prgn>dh_quilt_patch</prgn> 和 <prgn>dh_quilt_unpatch</prgn> 命令支持。

source: Install the <package>quilt</package> package in "<tt>Build-Depends</tt>".
ca: Afegeix el paquet <package>quilt</package> en el camp "<tt>Build-Depends</tt>".
es: Añade el paquete <package>quilt</package> en el campo "<tt>Build-Depends</tt>".
fr: ajout de <package>quilt</package> à « <tt>Build-Depends</tt> » ;
ja: <package>quilt</package>パッケージをインストールします。
zh_cn: 在 <tt>Build-Depends</tt> 中添加 <package>quilt</package> 软件包。
zh_tw: 在 <tt>Build-Depends</tt> 中添加 <package>quilt</package> 套件。

source: Use "<tt>dh --with quilt $@</tt>" instead.
ca: Fes servir "<tt>dh --with quilt $@</tt>" ﻿en el seu lloc.
es: Utiliza "<tt>dh --with quilt $@</tt>" en su lugar.
fr: utilisation de « <tt>dh --with quilt $@</tt> » à la place ;
ja: 代わりに"<tt>dh --with quilt $@</tt>"を使用します。
zh_cn: 使用 <tt>dh --with quilt $@</tt>
zh_tw: 使用 <tt>dh --with quilt $@</tt>

source: This applies and un-applies patches to the upstream source from files in the <file>debian/patches</file> directory for the <tt>1.0</tt> source package.
ca: Així s'apliquen o es desfan, en els fitxers de les fonts originals, les modificacions dels fitxers del directori <file>debian/patches</file> en els paquets construïts amb el format <tt>1.0</tt>.
es: Esto aplica o elimina los parches en los archivos de las fuentes originales, basándose en los ficheros del directorio <file>debian/patches</file> en los paquetes con el formato <tt>1.0</tt>.
fr: conséquence : application et retrait des correctifs au code source amont à partir des fichiers du répertoire <file>debian/patches</file> pour les paquets source au format <tt>1.0</tt> ;
ja: <tt>1.0</tt>ソースパッケージの<file>debian/patches</file>ディレクトリ内にあるファイルの上流ソースにパッチを当てたり外したりできます。
zh_cn: 这会在你使用 <tt>1.0</tt> 格式的源代码包时自动应用或解除 <file>debian/patches</file> 目录中的补丁。
zh_tw: 這會在你使用 <tt>1.0</tt> 格式的原始碼包時自動應用或解除 <file>debian/patches</file> 目錄中的補丁。

source: This is not needed if you use the new <tt>3.0 (quilt)</tt> source package.
ca: Aquesta adaptació no és necessària pels paquets construïts amb el format <tt>3.0 (quilt)</tt>.
es: Esta adaptación no es necesaria para los paquetes con el nuevo formato <tt>3.0 (quilt)</tt>.
fr: inutile pour les paquets source au format <tt>3.0 (quilt)</tt> ;
ja: もし<tt>3.0 (quilt)</tt>ソースパッケージを使用している場合、これは不要です。
zh_cn: 如果你使用新的 <tt>3.0 (quilt)</tt> 源代码包格式时不需要这些。
zh_tw: 如果你使用新的 <tt>3.0 (quilt)</tt> 原始碼包格式時不需要這些。

source: Add support of the <prgn>dh_dkms</prgn> command.
ca: Afegir funcionalitat per a l'ordre <prgn>dh_dkms</prgn>.
es: Añadiendo la orden <prgn>dh_dkms</prgn>.
fr: ajout de l'assistance de la commande <prgn>dh_dkms</prgn> :
ja: <prgn>dh_dkms</prgn> コマンドのサポートを追加する
zh_cn: 添加 <prgn>dh_dkms</prgn> 命令支持。
zh_tw: 添加 <prgn>dh_dkms</prgn> 命令支持。

source: Install the <package>dkms</package> package in "<tt>Build-Depends</tt>".
ca: Afegeix el paquet <package>dkms</package> en el camp "<tt>Build-Depends</tt>".
es: Añade el paquete <package>dkms</package> en el campo "<tt>Build-Depends</tt>".
fr: ajout de <package>dkms</package> à « <tt>Build-Depends</tt> » ;
ja: <package>dkms</package>パッケージをインストールします。
zh_cn: 在 <tt>Build-Depends</tt> 中添加 <package>dkms</package> 软件包。
zh_tw: 在 <tt>Build-Depends</tt> 中添加 <package>dkms</package> 套件。

source: Use "<tt>dh --with dkms $@</tt>" instead.
ca: Fes servir "<tt>dh --with dkms $@</tt>" en el seu lloc.
es: Utiliza "<tt>dh --with dkms $@</tt>" en su lugar.
fr: utilisation de « <tt>dh --with dkms $@</tt> » à la place ;
ja: 代わりに"<tt>dh --with dkms $@</tt>"を使用します。
zh_cn: 使用 <tt>dh --with dkms $@</tt>
zh_tw: 使用 <tt>dh --with dkms $@</tt>

source: This correctly handles DKMS usage by the kernel module package.
ca: Així es controla correctament l'ús de DKMS en la construcció de paquets del nucli.
es: Esto controla correctamente el uso de DKMS en la construcción de paquetes del núcleo.
fr: conséquence : gestion correcte de l'utilisation de DKMS par le paquet de modules du noyau ;
ja: カーネルモジュールパッケージによるDKMSの使用方法正しく処理します。
zh_cn: 这会使内核模块软件包正确使用 DKMS。
zh_tw: 這會使核心模組套件正確使用 DKMS。

source: Add support of the <prgn>dh_autotools-dev_updateconfig</prgn> and <prgn>dh_autotools-dev_restoreconfig</prgn> commands.
ca: Afegir funcionalitat per a les ordres <prgn>dh_autotools-dev_updateconfig</prgn> i <prgn>dh_autotools-dev_restoreconfig</prgn>.
es: Añadiendo las ordenes <prgn>dh_autotools-dev_updateconfig</prgn> y <prgn>dh_autotools-dev_restoreconfig</prgn>.
fr: ajout de l'assistance des commandes <prgn>dh_autotools-dev_updateconfig</prgn> et <prgn>dh_autotools-dev_restoreconfig</prgn> :
ja: <prgn>dh_autotools-dev_updateconfig</prgn> と <prgn>dh_autotools-dev_restoreconfig</prgn> コマンドのサポートを追加する
zh_cn: 添加 <prgn>dh_autotools-dev_updateconfig</prgn> 和 <prgn>dh_autotools-dev_restoreconfig</prgn> 命令支持。
zh_tw: 添加 <prgn>dh_autotools-dev_updateconfig</prgn> 和 <prgn>dh_autotools-dev_restoreconfig</prgn> 命令支持。

source: Install the <package>autotools-dev</package> package in "<tt>Build-Depends</tt>".
ca: Afegeix el paquet <package>autotools-dev</package> en el camp "<tt>Build-Depends</tt>".
es: Añade el paquete <package>autotools-dev</package> en el campo "<tt>Build-Depends</tt>".
fr: ajout de <package>autotools-dev</package> à « <tt>Build-Depends</tt> » ;
ja: <package>autotools-dev</package> パッケージをインストールします。
zh_cn: 在 <tt>Build-Depends</tt> 中添加 <package>autotools-dev</package> 软件包。
zh_tw: 在 <tt>Build-Depends</tt> 中添加 <package>autotools-dev</package> 套件。

source: Use "<tt>dh --with autotools-dev $@</tt>" instead.
ca: Fes servir "<tt>dh --with autotools-dev $@</tt>" en el seu lloc.
es: Utiliza "<tt>dh --with autotools-dev $@</tt>" en su lugar.
fr: utilisation de « <tt>dh --with autotools-dev $@</tt> » à la place ;
ja: 代わりに "<tt>dh --with autotools-dev $@</tt>" を使用します。
zh_cn: 使用 <tt>dh --with autotools-dev $@</tt>
zh_tw: 使用 <tt>dh --with autotools-dev $@</tt>

source: This updates and restores <file>config.sub</file> and <file>config.guess</file>.
ca: Així s'actualitza i restaura <file>config.sub</file> i <file>config.guess</file>.
es: Esto actualiza y restaura <file>config.sub</file> y <file>config.guess</file>.
fr: conséquence : mise à jour et restauration de <file>config.sub</file> et <file>config.guess</file> ;
ja: これで<file>config.sub</file>と<file>config.guess</file>をアップデートおよびレストアします。
zh_cn: 这会自动更新或还原 <file>config.sub</file> 和 <file>config.guess</file> 文件。
zh_tw: 這會自動更新或還原 <file>config.sub</file> 和 <file>config.guess</file> 檔案。
