Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: Of course, replace the filename with the name of your original source archive. <footnote><p>If the upstream source provides the <file>debian</file> directory and its contents, run the <prgn>dh_make</prgn> command with the <tt>--addmissing</tt> option, instead. The new source <tt>3.0 (quilt)</tt> format is quite robust not to break even for these packages. You may need to update contents provided by the upstream for your Debian package.</p></footnote> See <manref section="1" name="dh_make"> for details.
ca: Caldrà canviar el nom del fitxer amb el codi font <footnote><p>Si el fitxer amb el codi font ja té un directori <file>debian</file> amb fitxers, executa l'ordre <prgn>dh_make</prgn> amb l'opció <tt>--addmissing</tt>. El nou format de paquet <tt>3.0 (quilt)</tt> és molt robust i traballarà be amb aquests paquets. Així s'actualitzarà el contingut dels fitxers de l'autor original per al teu paquet Debian. </p></footnote>. Consulta <manref section="1" name="dh_make"> per a una descripció més detallada.
es: Deberás cambiar el nombre del archivo por el correspondiente a tus fuentes <footnote><p>Si el archivo del código fuente original ya contiene un directorio <file>debian</file> con su contenido, ejecuta la orden <prgn>dh_make</prgn> con la opción <tt>--addmissing</tt>. El nuevo formato <tt>3.0 (quilt)</tt> es lo bastante robusto para no romper ni esos paquetes. Así se actualizará el contenido aportado por el autor para tu paquete Debian.</p></footnote>. Véase <manref section="1" name="dh_make"> para una descripción más detallada.
fr: Bien sûr, remplacez le nom de fichier par celui de votre archive source d'origine. <footnote><p>Si les sources amont fournissent le répertoire <file>debian</file> et son contenu, exécutez plutôt la commande <prgn>dh_make</prgn> avec l'option <tt>--addmissing</tt>. Le nouveau format source <tt>3.0 (quilt)</tt> est assez robuste pour ne pas casser même avec ces paquets. Vous pourriez avoir besoin de mettre à jour le contenu fourni en amont pour votre paquet Debian.</p></footnote> Voir <manref section="1" name="dh_make"> pour plus de détails.
it: Ovviamente, si deve sostituire il nome del file con il nome dell'archivio dei sorgenti originali. <footnote><p>Se i sorgenti originali forniscono la directory <file>debian</file> e il suo contenuto, si deve eseguire il comando <prgn>dh_make</prgn> con l'opzione <tt>--addmissing</tt>. Il nuovo formato dei sorgenti <tt>3.0 (quilt)</tt> è abbastanza maturo da non danneggiare questi pacchetti. Potrebbe essere necessario aggiornare i contenuti forniti nei sorgenti originali per il pacchetto debian.</p></footnote> Vedere <manref section="1" name="dh_make"> per i dettagli.
ja: 当然ですが、ファイル名はあなたのオリジナルのソースアーカイブの名前と置き換えてください。<footnote><p>上流のソースが <file>debian</file> ディレクトリとその中身を提供している場合は、かわりに <prgn>dh_make</prgn> コマンドを <tt>--addmissing</tt> オプションをつけて実行してください。新しい <tt>3.0 (quilt)</tt> 形式のソースはとても堅牢なので、こういったパッケージでも壊すことはありません。自分の Debian パッケージ用に、アップストリームで提供されている内容を更新する必要があるかもしれません。</p></footnote> 詳細は、<manref section="1" name="dh_make"> を参照してください。
zh_cn: 当然，使用你的原始源代码归档文件名替代示例中的文件名。<footnote><p>如果上游源代码提供 <file>debian</file> 目录和内容，运行 <prgn>dh_make</prgn> 命令是要加上 <tt>--addmissing</tt> 参数。新的 <tt>3.0 (quilt)</tt> 源代码格式十分强健，在这种情况下不会出现问题。你可能需要为你的 Debian 软件包更新上游提供的 <file>debian</file> 目录内容。</p></footnote>参看 <manref section="1" name="dh_make"> 以获得详细信息。
zh_tw: 當然，使用你的原始原始碼壓縮檔名替代範例中的檔案名。<footnote><p>如果上游原始碼提供 <file>debian</file> 目錄和內容，運行 <prgn>dh_make</prgn> 命令是要加上 <tt>--addmissing</tt> 參數。新的 <tt>3.0 (quilt)</tt> 原始碼格式十分強健，在這種情況下不會出現問題。你可能需要爲你的 Debian 套件更新上游提供的 <file>debian</file> 目錄內容。</p></footnote>參考 <manref section="1" name="dh_make"> 以獲得詳細訊息。

source: Some information will come up. It will ask you what sort of package you want to create. Gentoo is a single binary package - it creates only one binary, and thus one <file>.deb</file> file - so we will select the first option, with the "<tt>s</tt>" key, check the information on the screen and confirm by pressing "<tt><var>ENTER</var></tt>". <footnote><p>There are few choices here: "<tt>s</tt>" for "Single binary", "<tt>i</tt>" for "Arch-Independent", "<tt>m</tt>" for "Multiple binary", "<tt>l</tt>" for "Library", "<tt>k</tt>" for "Kernel module", "<tt>n</tt>" for "Kernel patch" and "<tt>b</tt>" for "<package>cdbs</package>". This document focuses on the use of the <package>debhelper</package> package with the <prgn>dh</prgn> command. This document focuses on the use of the new <prgn>dh</prgn> command for "Single binary" and touches on it for "Arch-Independent" and "Multiple binary". The <package>cdbs</package> package offers alternative package script infrastructure to the <prgn>dh</prgn> command and outside of the scope of this document.</p></footnote>
ca: En haver executat l'ordre, caldrà respondre a algunes preguntes sobre el paquet. «Gentoo» és un paquet binari simple (només crea un arxiu binari) i, per tant, només un arxiu <file>.deb</file>. Per això, seleccionaràs la primera opció amb la tecla "<tt>s</tt>". Comprova la informació que surt en pantalla i confirma polsant la tecla "<tt><var>ENTER</var></tt>"<footnote><p>Les opcions sobre el tipus de paquet són les següents: "<tt>s</tt>" per a un "binari", "<tt>i</tt>" per a un paquet "independent de l'arquitectura" (paquet de codi font o de documentació), "<tt>m</tt>" per a paquets amb "més d'un arxiu binari", "<tt>l</tt>" per a "biblioteques", "<tt>k</tt>" per a un "mòdul del nucli («kernel»)", "<tt>n</tt>" per a un "pegat del nucli" i "<tt>b</tt>" per a paquets "<package>cdbs</package>". Aquest document es centra amb l'ús del paquet <package>debhelper</package> i l'ordre <prgn>dh</prgn> per a la construcció de paquets amb "un binari " i tracta només parcialment el seu ús en la construcció de paquets "independent de l'arquitectura" i amb "més d'un arxiu binari". El paquet <package>cdbs</package> proporciona guions alternatius a l'ordre <prgn>dh</prgn> i no s'explica en aquest document. </p></footnote>.
es: Saldrá alguna información. Te preguntará qué tipo de paquete deseas construir. «Gentoo» es un paquete de binario simple (crea sólo un binario) y, por tanto, sólo un fichero <file>.deb</file> - así que seleccionaremos la primera opción, con la tecla "<tt>s</tt>". Comprueba la información que aparece en la pantalla y confirma pulsando la tecla "<tt><var>INTRO</var></tt>" <footnote><p>Se ofrecen varias opciones aquí: "<tt>s</tt>" para "un binario", "<tt>i</tt>" para un paquete "independiente de la arquitectura" (sólo código fuente o bien documentación), "<tt>m</tt>" para "más de un binario", "<tt>l</tt>" para una "biblioteca", "<tt>k</tt>" para un "módulo del núcleo" («kernel»), "<tt>n</tt>" para un "parche del núcleo", y "<tt>b</tt>" para paquetes "<package>cdbs</package>". Este documento se centra en el uso del paquete <package>debhelper</package> con la orden <prgn>dh</prgn> para la construcción de paquetes con "un binario" y trata solo parcialmente su uso en la construcción de paquetes "independiente de la arquitectura" y con "más de un binario". El paquete <package>cdbs</package> ofrece guiones alternativos a la orden <prgn>dh</prgn> y su uso queda fuera de este documento.</p></footnote>.
fr: Des informations seront affichées. Il vous sera demandé quelle sorte de paquet vous voulez créer. Gentoo est un paquet binaire simple &mdash; il ne crée qu'un exécutable, et donc un seul fichier <file>.deb</file> &mdash; donc la première option sera sélectionnée, avec la touche « <tt>s</tt> ». Une fois l'information vérifiée sur l'écran, confirmez en pressant « <tt><var>Entrée</var></tt> ». <footnote><p>Il y a peu de choix à ce moment : « <tt>s</tt> » pour « binaire simple », « <tt>i</tt> » pour « binaire indépendant de l'architecture », « <tt>m</tt> » pour « binaires multiples », « <tt>l</tt> » pour « bibliothèque », « <tt>k</tt> » pour « module de noyau », « <tt>n</tt> » pour « correctif de noyau » et « <tt>b</tt> » pour « <package>cdbs</package> ». Ce document se concentre sur l'utilisation du paquet <package>debhelper</package> avec la commande <prgn>dh</prgn>. Ce document se concentre sur l'utilisation de la nouvelle commande <prgn>dh</prgn> pour un « binaire simple » et l'effleure pour un « binaire indépendant de l'architecture » et un « binaire multiple ». Le paquet <package>cdbs</package> propose une autre infrastructure de scripts de paquets que la commande <prgn>dh</prgn> et sort du cadre de ce document.</p></footnote>
ja: 情報がいくつか表示されるでしょう。どんな種類のパッケージを作ろうとしているのかを尋ねられます。Gentoo は単一のバイナリパッケージです - バイナリを一つだけ生成するので、一個の .deb ファイルです - なので、"<tt>s</tt>" キーで最初の選択肢を選びましょう。表示された情報をチェックして、確認のために "<tt><var>ENTER</var></tt>" を押してください。<footnote><p>ここでの選択肢はわずかです。"<tt>s</tt>" は "Single binary (単一のバイナリ)"、"<tt>i</tt> は "Arch-Independent(アーキテクチャ非依存)"、"<tt>m</tt>" は "Multiple binary (複数のバイナリ)、"<tt>l</tt>" は "Library (ライブラリ)"、"<tt>k</tt>" は "Kernel module (カーネルモジュール)"、"<tt>n</tt>" は "Kernel patch (カーネルパッチ)"、"<tt>b</tt>" は "<package>cdbs</package>" です。このドキュメントでは、<prgn>dh</prgn> コマンドで <package>debhelper</package> パッケージを使うのに重点を置いています。</footnote>
zh_cn: 此时会出现一些提示信息。它会询问你要创建那种类型的软件包。Gentoo 是单个的二进制软件包——编译后仅生成一个二进制文件，也因此只需要一个 <file>.deb</file> 文件——所以我们使用 <tt>s</tt> 键选择第一个选项，检查屏幕上显示的信息，无误后按 <tt><var>ENTER</var></tt> 确认。<footnote><p>这里有几个候选项：<tt>s</tt> 为单个二进制包(Signle binary)、<tt>i</tt> 为平台独立软件包(Arch-Independent)、<tt>m</tt> 为多个二进制包(Multiple binary)、<tt>l</tt> 为库(Library)、<tt>k</tt> 为内核模块(Kernel module)、<tt>n</tt> 为内核补丁(Kernel patch)、<tt>b</tt> 为使用 <package>cdbs</package>。本文档重点介绍使用通过 <prgn>dh</prgn> 命令使用 <package>debhelper</package> 打包。本文档侧重于单个二进制包，也涉及平台独立和多二进制包类型的软件包。<package>cdbs</package> 软件包提供了类似 <prgn>dh</prgn> 的其他打包脚本框架，它并不在本文档的介绍范围内。</p></footnote>
zh_tw: 此時會出現一些提示訊息。它會詢問你要創建那種類型的套件。Gentoo 是單個的二進位套件——編譯後僅生成一個二進位檔案，也因此只需要一個 <file>.deb</file> 檔案——所以我們使用 <tt>s</tt> 鍵選擇第一個選項，檢查螢幕上顯示的訊息，無誤後按 <tt><var>ENTER</var></tt> 確認。<footnote><p>這裏有幾個候選項：<tt>s</tt> 爲單個二進位套件(Signle binary)、<tt>i</tt> 爲平臺獨立套件(Arch-Independent)、<tt>m</tt> 爲多個二進位套件(Multiple binary)、<tt>l</tt> 爲庫(Library)、<tt>k</tt> 爲核心模組(Kernel module)、<tt>n</tt> 爲核心補丁(Kernel patch)、<tt>b</tt> 爲使用 <package>cdbs</package>。本文件重點介紹使用通過 <prgn>dh</prgn> 命令使用 <package>debhelper</package> 打包。本文件側重於單個二進位套件，也涉及平臺獨立和多二進位套件類型的套件。<package>cdbs</package> 套件提供了類似 <prgn>dh</prgn> 的其他打包腳本框架，它並不在本文件的介紹範圍內。</p></footnote>

source: After this execution of <prgn>dh_make</prgn>, a copy of the upstream tarball is created as <file>gentoo_0.9.12.orig.tar.gz</file> in the parent directory to accommodate the creation of the non-native Debian source package with the <file>debian.tar.gz</file> later.
ca: Desprès d'executar l'ordre <prgn>dh_make</prgn>, es fa una còpia del fitxer amb el codi original amb el nom <file>gentoo_0.9.12.orig.tar.gz</file> en el directori arrel per facilitar la construcció del paquet de fonts no nadiu de Debian amb el fitxer <file>debian.tar.gz</file>.
es: Tras ejecutar <prgn>dh_make</prgn>, se genera una copia del código original con el nombre <file>gentoo_0.9.12.orig.tar.gz</file> en el directorio raíz para facilitar la construcción del paquete de fuentes no nativo de Debian con el archivo <file>debian.tar.gz</file>.
fr: Après cette exécution de <prgn>dh_make</prgn>, une copie de l'archive amont est créée sous <file>gentoo_0.9.12.orig.tar.gz</file> dans le répertoire parent pour permettre ensuite la création d'un paquet source Debian non natif avec <file>debian.tar.gz</file>.
it: Dopo l'esecuzione di <prgn>dh_make</prgn>, verrà eseguita una copia dell'archivio originale del programma, come nome <file>gentoo_0.9.12.orig.tar.gz</file>, nella directory superiore, per consentire, più avanti, la creazione di un pacchetto Debian sorgente non-nativo con il <file>debian.tar.gz</file>.
ja: <prgn>dh_make</prgn> を実行した後、上流の tarball のコピーを、親ディレクトリに <file>gentoo_0.9.12.orig.tar.gz</file> として作成します。次に、それに伴ってネイティブではない Debian ソースパッケージを <file>debian.tar.gz</file> として作成します。
zh_cn: 执行 <prgn>dh_make</prgn> 后，上一级目录中自动创建了一份上游 tarball 的副本，名为 <file>gentoo_0.9.12.orig.tar.gz</file>，这个文件和稍后介绍的 <file>debian.tar.gz</file> 在一起满足了 Debian 非本地源代码包的要求。
zh_tw: 執行 <prgn>dh_make</prgn> 後，上一級目錄中自動創建了一份上游 tarball 的副本，名爲 <file>gentoo_0.9.12.orig.tar.gz</file>，這個檔案和稍後介紹的 <file>debian.tar.gz</file> 在一起滿足了 Debian 非本地原始碼包的要求。

source: Please note 2 key features in this <file>gentoo_0.9.12.orig.tar.gz</file> file name:
ca: Posa atenció en els dos canvis en el nom del fitxer <file>gentoo_0.9.12.orig.tar.gz</file>:
es: Observa que hay dos cambios clave en el nombre del fichero <file>gentoo_0.9.12.orig.tar.gz</file>:
fr: Veuillez remarquer deux caractéristiques dans ce nom de fichier <file>gentoo_0.9.12.orig.tar.gz</file> :
it: Si presti attenzione a due caratteristiche chiave presenti nel nome del file <file>gentoo_0.9.12.orig.tar.gz</file>:
ja: この <file>gentoo_0.9.12.orig.tar.gz</file> ファイル名がもっている 2 つの特徴に注意してください：
zh_cn: 请注意 <file>gentoo_0.9.12.orig.tar.gz</file> 这个文件名的两个关键特点：
zh_tw: 請注意 <file>gentoo_0.9.12.orig.tar.gz</file> 這個檔案名的兩個關鍵特點：

source: Package name and version are separated by the "<tt>_</tt>" (underscore).
ca: El nom del paquet i de la versió estan separats per «<tt>_</tt>».
es: El nombre del paquete y la versión están separados por «<tt>_</tt>».
fr: le nom de paquet et la version sont séparés par « <tt>_</tt> » (tiret bas) ;
it: Il nome del pacchetto e la versione sono separati da "<tt>_</tt>" (trattino basso).
ja: パッケージ名とバージョンは "<tt>_</tt>" (アンダースコア) で区切られています。
zh_cn: 软件包名称和版本是以下划线 <tt>_</tt> 分隔的。
zh_tw: 套件名稱和版本是以底線 <tt>_</tt> 分隔的。

source: There is the <file>.orig</file> before the <file>.tar.gz</file>.
ca: S'ha afegit <file>.orig</file> abans de l'extensió <file>.tar.gz</file>.
es: Hay un <file>.orig</file> antes de <file>.tar.gz</file>.
fr: « <tt>orig.</tt> » est avant le « <tt>tar.gz</tt> ».
ja: "<tt>tar.gz</tt>" の前に "<tt>orig.</tt>" があります。
zh_cn: <file>.tar.gz</file> 扩展名前有 <file>.orig</file>。
zh_tw: <file>.tar.gz</file> 副檔名前有 <file>.orig</file>。

source: You should also notice that many template files are created in the source under the <file>debian</file> directory. These will be explained in <ref id="dreq"> and <ref id="dother">. You should also understand that the packaging is not automatic process. You need to modify the upstream source for Debian as <ref id="modify">. After all these, you need to build Debian packages under the proper method as <ref id="build">, check them as <ref id="checkit">, and upload them as <ref id="upload">. I will explain all these steps.
ca: Fitxa't que hi ha nous fitxers (de plantilla) en el directori <file>debian</file> dels quals es parlarà en <ref id="dreq"> i <ref id="dother">. El procés d'empaquetament no està totalment automatitzat. La modificació dels fitxers Debian s'explicarà a <ref id="modify">. A continuació es compilarà el paquet Debian en l'apartat <ref id="build">, la revisió del resultat a l'apartat <ref id="checkit"> i la transferència del paquet al repositori a <ref id="upload">. S'explicarà cada etapa a continuació.
es: Observa que la ejecución de la orden ha creado varios archivos de plantilla en el directorio <file>debian</file>. Se tratará sobre ellos en <ref id="dreq"> y <ref id="dother">. El proceso de empaquetado no está totalmente automatizado. Se tratará de la modificación de los archivos Debian en <ref id="modify">. A continuación se compilará el paquete Debian en el apartado <ref id="build">, la revisión del resultado en <ref id="checkit"> y el envío del paquete en <ref id="upload">. Se explicará cada una de estas etapas a continuación.
fr: Vous devriez aussi remarquer que de nombreux fichiers modèles sont créés dans les sources sous le répertoire <file>debian</file>. Ce sera expliqué en <ref id="dreq"> et <ref id="dother">. Vous devriez aussi comprendre que l'empaquetage n'est pas un processus automatique. Vous devez modifier les sources amont pour Debian comme en <ref id="modify">. Après tout cela, vous avez besoin de construire les paquets avec la méthode appropriée comme en <ref id="build">, les vérifier comme en <ref id="checkit">, et les envoyer comme en <ref id="upload">. Toutes ces étapes seront expliquées.
it: Si dovrebbe aver notato che nella sottodirectory dei sorgenti <file>debian</file> sono stati creati molti modelli di file. Questo verrà trattato in <ref id="dreq"> e <ref id="dother">. Dovreste aver capito che la pacchettizzazione non è un processo automatico. È necessario modificare il sorgente originale per Debian come descritto in <ref id="modify">. Dopo tutti questi passaggi, è necessario creare i pacchetti Debian in maniera appropriata come descritto in <ref id="build">, controllarli come descritto in <ref id="checkit">, e caricarli come descritto in <ref id="upload">. Verranno approfonditi tutti questi passaggi.
ja: ソース中の<file>debian</file>ディレクトリにたくさんのテンプレートファイルが作成されていることにも注意が必要です。これらについては、<ref id="dreq"> と <ref id="dother"> で説明します。パッケージ作成が自動的な過程ではないことも理解しておかねばなりません。<ref id="modify"> のように、開発元のソースを Debian 向けに変更する必要があります。こういった作業の後で、<ref id="build"> のように正しいやり方で Debian パッケージをビルドし、<ref id="checkit"> のようにチェックし、そして <ref id="upload"> のようにしてアップロードする必要があります。これら全てのステップについてこれから説明します。
zh_cn: 你应该可以注意到 <file>debian</file> 目录下有了许多模板文件。这些文件将在 <ref id="dreq"> 和 <ref id="dother"> 一一解释。你还应该明白，打包不是一个自动的过程，你还需要按照 <ref id="modify"> 中的方法来修改软件包。此后，你还要按照 <ref id="build"> 中叙述的合适的方法来编译 Debian 软件包、按照 <ref id="checkit"> 中的方法检查其中错误，最终依照 <ref id="upload"> 的介绍将其上传。我将对所有的这些步骤进行解释。
zh_tw: 你應該可以注意到 <file>debian</file> 目錄下有了許多模板檔案。這些檔案將在 <ref id="dreq"> 和 <ref id="dother"> 一一解釋。你還應該明白，打包不是一個自動的過程，你還需要按照 <ref id="modify"> 中的方法來修改套件。此後，你還要按照 <ref id="build"> 中敘述的合適的方法來編譯 Debian 套件、按照 <ref id="checkit"> 中的方法檢查其中錯誤，最終依照 <ref id="upload"> 的介紹將其上傳。我將對所有的這些步驟進行解釋。

source: Once again, as a new maintainer you are discouraged from creating complicated packages, e.g.,
ca: Com a nou desenvolupador, no s'aconsella la construcció de paquets complicats, per exemple:
es: Como nuevo desarrollador, se desaconseja construir paquetes complicados, por ejemplo:
fr: Rappelons-le, en tant que nouveau responsable, vous ne devriez pas créer de paquets compliqués, par exemple :
it: Ancora una volta, visto che si è alle prime armi come maintainer non è consigliato creare pacchetti complessi, ad esempio:
ja: 繰り返しますが、新規メンテナのあなたには、以下のような複雑なパッケージの作成はお勧めできません。
zh_cn: 再次强调，作为一个新维护人员，不推荐创建复杂的软件包，例如：
zh_tw: 再次強調，作爲一個新維護人員，不推薦創建複雜的套件，例如：

source: multiple binary packages,
ca: paquets amb més d'un binari.
es: múltiples paquetes binarios
fr: des paquets à binaires multiples ;
it: pacchetti binari multipli,
ja: 複数バイナリパッケージ
zh_cn: 多个二进制包的软件包；
zh_tw: 多個二進位套件的套件；

source: library packages,
ca: paquets de biblioteques.
es: paquetes de bibliotecas
fr: des paquets de bibliothèque ;
it: pacchetti di libreria,
ja: ライブラリパッケージ
zh_cn: 库软件包；
zh_tw: 庫套件；

source: kernel module packages,
ca: paquets amb mòduls del nucli.
es: paquetes de módulos del núcleo,
fr: des paquets de modules du noyau ;
it: pacchetti di moduli del kernel,
ja: カーネルモジュールパッケージ
zh_cn: 内核模块软件包；
zh_tw: 核心模組套件；

source: kernel patch packages,
ca: paquets amb pegats del nucli.
es: paquetes de parches del núcleo,
fr: des paquets de correctifs du noyau ;
it: pacchetti di patch del kernel,
ja: カーネルパッチパッケージ
zh_cn: 内核补丁软件包；
zh_tw: 核心補丁套件；

source: the source file format being neither in <file>tar.gz</file> nor <file>tar.bz2</file>, or
ca: paquets amb el codi font en fitxers amb format distint a <tt>tar.gz.</tt> i <tt>tar.bz2</tt>
es: paquetes en los que el formato del archivo fuente no es <tt>tar.gz.</tt> ni <tt>tar.bz2</tt>, o
fr: un format de fichier source n'étant ni <tt>tar.gz</tt>, ni <tt>tar.bz2</tt> ;
it: pacchetti i cui sorgenti non sono in formato <tt>tar.gz.</tt> o <tt>tar.bz2</tt>, oppure
ja: ソースファイルの形式が、<file>tar.gz.</file> や <file>tar.bz2</file> でないもの
zh_cn: 源代码不是 <file>tar.gz</file> 也不是 <file>tar.bz2</file> 格式，或
zh_tw: 原始碼不是 <file>tar.gz</file> 也不是 <file>tar.bz2</file> 格式，或

source: the source tarball containing undistributable contents.
ca: paquets amb parts de les fonts que no es poden distribuir.
es: paquetes cuyas fuentes contienen partes que no se pueden distribuir.
fr: une archive source avec des contenus non distribuables ;
it: l'archivio dei sorgenti ha contenuti non distribuibili.
ja: 配布できない内容がソースの tarball にあるもの
zh_cn: 源代码 tarball 中包含不可分发的内容。
zh_tw: 原始碼 tarball 中包含不可散佈的內容。

source: It's not too hard, but it does require a bit more knowledge, so we won't describe all of it here.
ca: Aquest casos no són especialment complicats però cal tenir alguns coneixements complementaris que no s'expliquen en aquest document.
es: Estos casos no son extremadamente difíciles pero es preciso tener algunos conocimientos más, así que aquí no se describirá el proceso de empaquetado para este tipo de paquetes.
fr: Ce n'est pas si difficile, mais cela requiert un peu plus de connaissances, et nous n'entrerons pas dans les détails ici.
it: Non è difficile, ma richiede un po' più di conoscenze, per cui non ne parleremo in questo documento.
ja: 実際には作業自体はそれほど大変ではないのですが、多少知識が余分に必要になります。そのため、ここではその作業について 一切説明しません。
zh_cn: 它们并非特别难于掌握，但确实需要更多的知识，所以我们不在这里对所有情况进行描述。
zh_tw: 它們並非特別難於掌握，但確實需要更多的知識，所以我們不在這裏對所有情況進行描述。

source: If you accidentally erased some template files while working on them, you can recover them by running <prgn>dh_make</prgn> with the <tt>--addmissing</tt> option again in a Debian package source tree.
ca: Si casualment elimines algun dels fitxers de plantilles del directori «debian», pots tornar a generar-los executant <prgn>dh_make</prgn> amb l'opció <tt>--addmissing</tt> des del directori de les fonts.
es: Si accidentalmente eliminó alguna de las plantillas mientras trabajaba en ellas, puedes regenerarlas ejecutando <prgn>dh_make</prgn> con la opción <tt>--addmissing</tt> desde el directorio con las fuentes del paquete Debian.
fr: Si vous effacez par mégarde quelques fichiers modèles en travaillant dessus, vous pouvez les retrouver en exécutant de nouveau <prgn>dh_make</prgn> avec l'option <tt>--addmissing</tt> dans une arborescence de paquet Debian.
ja: 作業中にテンプレートファイルを間違って消した場合は、Debian パッケージのソースツリーで <prgn>dh_make</prgn> を <tt>--addmissing</tt> オプションつきで再度実行することで修復できます。
zh_cn: 如果你在修改过程中不小心删除或弄坏了某些模板文件，你可以使用 <prgn>dh_make</prgn> 加上 <tt>--addmissing</tt> 参数来将其还原。
zh_tw: 如果你在修改過程中不小心刪除或弄壞了某些模板檔案，你可以使用 <prgn>dh_make</prgn> 加上 <tt>--addmissing</tt> 參數來將其還原。
