Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: <package>lintian</package> - this is the Debian package checker that can let you know of any common mistakes after you build the package, and explains the errors found. (see <manref section="1" name="lintian">, <file>/usr/share/doc/lintian/lintian.html/index.html</file>)
ca: <package>lintian</package> - aquest paquet es fa servir per comprovar els paquets Debian: informa dels errors més freqüents en la construcció de paquets i explica en què consisteixen (consulta <manref section="1" name="lintian">, <file>/usr/share/doc/lintian/lintian.html/index.html</file>).
es: <package>lintian</package> - este es el programa que comprueba los paquetes de Debian, puede indicarte muchos de los errores comunes después de construir un paquete, y explica los errores encontrados (véase <manref section="1" name="lintian">, <file>/usr/share/doc/lintian/lintian.html/index.html</file>).
fr: <package>lintian</package> &mdash; c'est le vérificateur de paquet Debian, qui peut indiquer de nombreuses erreurs courantes après la construction du paquet et expliquer les erreurs trouvées (voir <manref section="1" name="lintian">, <manref section="1" name="diffstat">, <file>/usr/share/doc/lintian/lintian.html/index.html</file>) ;
it: <package>lintian</package> - questo è l'analizzatore dei pacchetti Debian, una volta costruito il pacchetto, permette di scoprire gli errori più comuni, cercando di spiegarli. (vedere <manref section="1" name="lintian">, <file>/usr/share/doc/lintian/lintian.html/index.html</file>)
ja: <package>lintian</package> - これは Debian パッケージチェッカで、あなたがビルドしたパッケージを調べて、その中にありがちなミスが見つかったらそれを指摘し、その問題について説明してくれます。(詳しくは <manref section="1" name="lintian">、 <file>/usr/share/doc/lintian/lintian.html/index.html</file> 参照)
zh_cn: <package>lintian</package> - Debian 软件包检查工具，使你可以在编译软件包后知道它是否有常见的错误，并对找到的错误进行解释。(参看 <manref section="1" name="lintian">、<file>/usr/share/doc/lintian/lintian.html/index.html</file>)
zh_tw: <package>lintian</package> - Debian 套件檢查工具，使你可以在編譯套件後知道它是否有常見的錯誤，並對找到的錯誤進行解釋。(參考 <manref section="1" name="lintian">、<file>/usr/share/doc/lintian/lintian.html/index.html</file>)

source: <package>pbuilder</package> - this package contains programs which are used for creating and maintaining <prgn>chroot</prgn> environment. Building Debian package in this <prgn>chroot</prgn> environment verifies the proper build dependency and avoid FTBFS (Fails To Build From Source) bugs. (see <manref section="8" name="pbuilder"> and <manref section="1" name="pdebuild">)
ca: <package>pbuilder</package> - aquest paquet conté un conjunt de programes per construir i mantenir entorns <prgn>chroot</prgn>. Quan es construeix un paquet Debian en un entorn <prgn>chroot</prgn> es controla que les dependències són les adequades i s'eviten errors de construcció des del codi font (FTBFS, «Fails To Build From Source») (llegeix <manref section="8" name="pbuilder"> i <manref section="1" name="pdebuild">).
es: <package>pbuilder</package> - este paquete contiene programas para generar y mantener entornos <prgn>chroot</prgn>. Al construir paquetes Debian en estos entornos <prgn>chroot</prgn> se verifica que las dependencias son las adecuadas y se evitan fallos al construir desde el código fuente (FTBFS de «Fails To Build From Source»). Véase <manref section="8" name="pbuilder"> y <manref section="1" name="pdebuild">.
fr: <package>pbuilder</package> &mdash; ce paquet contient des programmes utilisés pour créer et maintenir un environnement « <prgn>chroot</prgn>é ». Construire un paquet Debian dans cet environnement permet de vérifier les dépendances correctes de construction et évite les bogues FTBFS (« Fails To Build From Source » pour les échecs de construction à partir du paquet source) (voir <manref section="8" name="pbuilder"> et <manref section="1" name="pdebuild">) ;
it: <package>pbuilder</package> - questo pacchetto contiene i programmi che vengono usati per creare e manutenere un ambiente <prgn>chroot</prgn>. Creare pacchetti Debian nell'ambiente <prgn>chroot</prgn> permette di verificare le dipendenze appropriate ed evitare bug di tipo FTBS (Fails To Build From Source, non compila da sorgente). (vedere <manref section="8" name="pbuilder"> e <manref section="1" name="pdebuild">)
ja: <package>pbuilder</package> - このパッケージには <prgn>chroot</prgn> 環境の作成や保守に使用されるプログラムが含まれます。この <prgn>chroot</prgn> 環境下で Debian パッケージをビルドすることで適切なビルド依存を確認して FTBFS (Fails To Build From Source) バグを回避することができます。(詳しくは <manref section="8" name="pbuilder"> と <manref section="1" name="pdebuild"> 参照)
zh_cn: <package>pbuilder</package> - 这个软件包提供了创建和维护 <prgn>chroot</prgn> 环境。在此 <prgn>chroot</prgn> 环境中编译 Debian 软件包可以检查编译依赖是否合适并避免 FTBFS (Fails To Build From Source，从源代码编译失败)的 Bug。(参看 <manref section="8" name="pbuilder"> 和 <manref section="1" name="pdebuild">)
zh_tw: <package>pbuilder</package> - 這個套件提供了創建和維護 <prgn>chroot</prgn> 環境。在此 <prgn>chroot</prgn> 環境中編譯 Debian 套件可以檢查編譯依賴是否合適並避免 FTBFS (Fails To Build From Source，從原始碼編譯失敗)的 Bug。(參考 <manref section="8" name="pbuilder"> 和 <manref section="1" name="pdebuild">)

source: <package>patchutils</package> - this package contains some utilities to work with patches such as the <prgn>lsdiff</prgn>, <prgn>interdiff</prgn> and <prgn>filterdiff</prgn> commands.
ca: <package>patchutils</package> - aquest paquet proporciona programes per gestionar els ﻿pegats, entre d'altres <prgn>lsdiff</prgn>, <prgn>interdiff</prgn> i <prgn>filterdiff</prgn>.
es: <package>patchutils</package> - este paquete contiene programas para trabajar con los «parches» como <prgn>lsdiff</prgn>, <prgn>interdiff</prgn> y <prgn>filterdiff</prgn>.
fr: <package>patchutils</package> &mdash; ce paquet contient certains utilitaires pour travailler avec les correctifs comme les commandes <prgn>lsdiff</prgn>, <prgn>interdiff</prgn> et <prgn>filterdiff</prgn> ;
ja: <package>patchutils</package> - このパッケージには、<prgn>lsdiff</prgn>、 <prgn>interdiff</prgn> や <prgn>filterdiff</prgn> といったパッチを扱うユーティリティが含まれています。
zh_cn: <package>patchutils</package> - 此软件包提供了一些可以帮助处理补丁的工具，如 <prgn>lsdiff</prgn>、<prgn>interdiff</prgn> 和 <prgn>filterdiff</prgn> 命令。
zh_tw: <package>patchutils</package> - 此套件提供了一些可以幫助處理補丁的工具，如 <prgn>lsdiff</prgn>、<prgn>interdiff</prgn> 和 <prgn>filterdiff</prgn> 命令。

source: <package>quilt</package> - this package helps you to manage a series of patches by keeping track of the changes each of them makes. They are logically organized as a stack, and you can apply (=push), un-apply (=pop), refresh them easily by traveling into the stack. (see <manref section="1" name="quilt">, <file>/usr/share/doc/quilt/README.Debian</file>)
ca: <package>quilt</package> - aquest paquet permet aplicar els pegats i fer el seguiment dels canvis realitzats. Fa les modificacions segons l'ordre establert i, amb ell, és possible aplicar, desfer i actualitzar les modificacions fàcilment (llegeix <manref section="1" name="quilt"> i <file>/usr/share/doc/quilt/README.Debian</file>).
es: <package>quilt</package> - este paquete ayuda a aplicar modificaciones («parches») y hacer el seguimiento de los cambios realizados. Aplica las modificaciones ordenadamente en pila, y es posible aplicar, deshacer y actualizar las modificaciones fácilmente recorriendo la pila (véase <manref section="1" name="quilt">, <file>/usr/share/doc/quilt/README.Debian</file>).
fr: <package>quilt</package> &mdash; ce paquet aide à gérer un ensemble de correctifs en gardant une trace du rôle de chacun. Ils sont logiquement organisés en pile, et vous pouvez les appliquer (« push »), les enlever (« pop »), et les rafraîchir facilement en parcourant le pile (voir <manref section="1" name="quilt"> et <file>/usr/share/doc/quilt/README.Debian</file>) ;
it: <package>quilt</package> - questo pacchetto aiuta a gestire una serie di patch, tenendo traccia dei cambiamenti apportati. Le patch sono organizzate in maniera logica come una pila, è possibile applicare(=push) le modifiche apportate dalla patch, oppure annullarle(=pop), semplicemente muovendosi attraverso la pila. (vedere <manref section="1" name="quilt">, <file>/usr/share/doc/quilt/README.Debian</file>)
ja: <package>quilt</package> - このパッケージは、一連のパッチそれぞれの変更点を追跡して、その管理を補助するものです。パッチはスタックとして論理的に構成されていて、スタックに分け入って、簡単に当てたり (=push) 外したり (=pop) 刷新したりすることができます。(詳しくは <manref section="1" name="quilt">、 <file>/usr/share/doc/quilt/README.Debian</file>参照)
zh_cn: <package>quilt</package> - 此软件包帮助你管理一系列的补丁。它们被以逻辑栈的方式组织在一起。你可以 apply (=push)、un-apply (=pop) 或简单地刷新它们然后再放入栈内。(参看 <manref section="1" name="quilt">、<file>/usr/share/doc/quilt/README.Debian</file>)
zh_tw: <package>quilt</package> - 此套件幫助你管理一系列的補丁。它們被以邏輯棧的方式組織在一起。你可以 apply (=push)、un-apply (=pop) 或簡單地更新它們然後再放入棧內。(參考 <manref section="1" name="quilt">、<file>/usr/share/doc/quilt/README.Debian</file>)

source: <package>git</package> - this package provides popular version control system designed to handle very large projects with speed and efficiency; it is used for many high profile open source projects, most notably the Linux kernel. (see <manref section="1" name="git">, <file>/usr/share/doc/git-doc/index.html</file>)
ca: <package>git</package> - aquest paquet instal·la el popular sistema de control de versions, dissenyat per al seguiment de grans projectes amb eficàcia i rapidesa; es fa servir amb molts projectes de codi lliure importants entre el quals el nucli de Linux (llegeix <manref section="1" name="git">, <file>/usr/share/doc/git-doc/index.html</file>).
es: <package>git</package> - este paquete instala el popular sistema de control de versiones, diseñado para hacer el seguimiento de proyectos grandes con eficacia y rapidez; se utiliza para proyectos de código libre importantes como es el caso del núcleo («kernel») de Linux (véase <manref section="1" name="git">, <file>/usr/share/doc/git-doc/index.html</file>).
fr: <package>git</package> &mdash; ce paquet fournit un système de gestion de version populaire conçu pour manipuler de très gros projets rapidement et efficacement ; il est utilisé pour des projets libres de grande envergure, en particulier le noyau Linux (voir <manref section="1" name="git"> et <file>/usr/share/doc/git-doc/index.html</file>).
ja: <package>git</package> - このパッケージは人気のあるバージョン管理システムで、大規模なプロジェクトを素早く、効率的に扱えるように設計されています。知名度の高い多数のオープンソースプロジェクトで使われており、特に有名なものとして Linux カーネルがあります。(詳しくは <manref section="1" name="git">、 <file>/usr/share/doc/git-doc/index.html</file>参照)
zh_cn: <package>git</package> - 此软件包提供了用于快捷处理大型项目的著名版本控制系统 - git。它被广泛用于各种开源项目，最著名的是 Linux 内核项目。(参看 <manref section="1" name="git">、<file>/usr/share/doc/git-doc/index.html</file>)
zh_tw: <package>git</package> - 此套件提供了用於快捷處理大型項目的著名版本控制系統 - git。它被廣泛用於各種開源項目，最著名的是 Linux 內核項目。(參考 <manref section="1" name="git">、<file>/usr/share/doc/git-doc/index.html</file>)

source: The following is the <em>very important</em> documentation which you should read along with this document:
ca: I finalment, la documentació <em>imprescindible</em> i que cal llegir amb aquest document:
es: Por último, la documentación que se indica a continuación es de <em>gran importancia</em> y debería leerse junto con este documento:
fr: Les documents suivants sont <em>très importants</em> et doivent être lus en parallèle à ce document :
it: Segue una serie di documenti <em>molto importanti</em> che è consigliabile leggere insieme a questo documento:
ja: 以下は、この文書と合わせて読むべき<em>とても重要な</em>文書です。
zh_cn: 以下是 <em>非常重要</em> 的文档，你应该在读本文档时同时参看它们：
zh_tw: 以下是 <em>非常重要</em> 的文件，你應該在讀本文件時同時參考它們：

source: <package>debian-policy</package> - the <url id="http://www.debian.org/doc/devel-manuals#policy" name="Debian Policy Manual"> includes explanations of the structure and contents of the Debian archive, several OS design issues, the Filesystem Hierarchy Standard (which says where each file and directory should be) etc. For you, the most important thing is that it describes requirements that each package must satisfy to be included in the distribution (see <file>&debian-policy;</file>).
ca: <package>debian-policy</package> - a <url id="http://www.debian.org/doc/devel-manuals#policy" name="Debian Policy Manual"> s'explica l'estructura i contingut del repositori, alguns aspectes del disseny del sistema operatiu, l﻿'estàndard del sistema de fitxers («Filesystem Hierarchy Standard») i el què és més important, descriu els requisits per a què un paquet s'afegeixi a la distribució (llegix <file>&debian-policy;</file>).
es: <package>debian-policy</package> - el <url id="http://www.debian.org/doc/devel-manuals#policy" name="manual de normas de Debian"> incluye la descripción de la estructura y contenidos del archivo, ciertas notas sobre el diseño del sistema operativo, el estándar de la jerarquía del sistema de ficheros («Filesystem Hierarchy Standard», que explica dónde deberían estar cada fichero y directorio), y, lo más importante para ti, describe los requisitos que debe satisfacer cada paquete para ser incluido en la distribución (véase <file>&debian-policy;</file>).
fr: <package>debian-policy</package> &mdash; la <url id="http://www.debian.org/doc/devel-manuals#policy" name="Charte Debian"> inclut des explications sur la structure et le contenu de l'archive Debian, plusieurs considérations sur l'architecture du système d'exploitation, la norme de hiérarchie des fichiers (« Filesystem Hierarchy Standard » ou FHS, qui dit où chaque fichier et répertoire doit se trouver), etc. Le plus important pour vous est qu'elle décrive les critères que chaque paquet doit vérifier pour être inclus dans la distribution (voir <file>&debian-policy;</file>) ;
it: <package>debian-policy</package> - il <url id="http://www.debian.org/doc/devel-manuals#policy" name="manuale delle policy Debian"> comprende le spiegazioni riguardanti la struttura e il contenuto dell'archivio Debian, numerose problematiche inerenti la progettazione del sistema operativo, lo Standard della Gerarchia del Filesystem (ndr. Filesystem Hierarchy Standard), (che indica la posizione prevista per ogni file e directory), ecc. In questo contesto, l'argomento più importante è la descrizione dei requisiti che ogni pacchetto deve soddisfare per essere incluso nella distribuzione. (vedere <file>&debian-policy;</file>)
ja: <package>debian-policy</package> - <url id="http://www.debian.org/doc/devel-manuals#policy" name="Debian ポリシーマニュアル"> には、Debian アーカイブの構造と内容、OS の設計に関するいくつかの論点、あるいは Filesystem Hierarchy Standard (個々のファイルやディレクトリがどこにあるべきかを規定した文書) についてなどいろいろ載っています。さしあたって重要なのは、ディストリビューションに含まれるためにそれぞれのパッケージが満たすべき必要条件の説明です (詳しくは <file>&debian-policy;</file>参照)。
zh_cn: <package>debian-policy</package> - <url id="http://www.debian.org/doc/devel-manuals#policy" name="Debian Policy Manual"> 包含了对 Debian 软件仓库、操作系统设计事宜、文件系统层级标准(FHS，Filesystem Hierarchy Standard)(讲述每个文件和目录应该放在哪里)等的描述。对于你而言，最重要的是它描述了软件包要进入官方仓库前必须满足的条件。(参看 <file>&debian-policy;</file>)
zh_tw: <package>debian-policy</package> - <url id="http://www.debian.org/doc/devel-manuals#policy" name="Debian Policy Manual"> 包含了對 Debian 軟體倉庫、作業系統設計事宜、檔案系統層級標準(FHS，Filesystem Hierarchy Standard)(講述每個檔案和目錄應該放在哪裏)等的描述。對於你而言，最重要的是它描述了套件要進入官方倉庫前必須滿足的條件。(參考 <file>&debian-policy;</file>)

source: <package>developers-reference</package> - the <url id="http://www.debian.org/doc/devel-manuals#devref" name="Debian Developer's Reference"> describes all matters not specifically about the technical details of packaging, like the structure of the archive, how to rename, orphan, pick up packages, how to do NMUs, how to manage bugs, best packaging practices, when and where to upload etc. (see <file>&developers-reference;</file>).
ca: <package>developers-reference</package> - a <url id="http://www.debian.org/doc/devel-manuals#devref" name="Debian Developer's Reference"> s'explican altres aspectes tècnics complementaris, com és ara l'estructura del repositori, el procediment per canviar el nom, adoptar o desfer-se d'un paquet, com fer NMU (paquets del tipus «Non-Maintainer Uploads», o sigui paquets mantinguts per una persona que no és el responsable directe), com gestionar els errors detectats pels usuaris, les bones pràctiques en la construcció de paquets, com i quan enviar els paquets al repositori, etc (llegeix <file>&developers-reference;</file>).
es: <package>developers-reference</package> - la <url id="http://www.debian.org/doc/devel-manuals#devref" name="referencia del desarrollador de Debian"> para todos los temas no específicamente relacionados con los detalles técnicos de cómo empaquetar, tales como la estructura del archivo (o repositorio de Debian), cómo renombrar, abandonar, adoptar paquetes, cómo hacer NMUs («Non-Maintainer Uploads», o envíos por personas distintas del desarrollador), como gestionar los errores que los usuarios envían, buenas prácticas de empaquetado, cómo y cuando enviar los paquetes, etc. (véase <file>&developers-reference;</file>).
fr: <package>developers-reference</package> &mdash; la <url id="http://www.debian.org/doc/devel-manuals#devref" name="Référence du développeur Debian"> concerne tout ce qui n'est pas spécifique aux détails techniques de la création de paquets, comme la structure des archives, comment renommer, abandonner, choisir les paquets, faire une NMU (« Non-Maintainer Uploads » ou mise à jour indépendante), comment gérer les bogues, les meilleures pratiques d'empaquetage, où et quand faire des envois de paquets, etc. (voir <file>&developers-reference;</file>) ;
it: <package>developers-reference</package> - la <url id="http://www.debian.org/doc/devel-manuals#devref" name="guida di riferimento per gli sviluppatori Debian"> descrive tutti gli argomenti che non riguardano in maniera specifica i dettagli tecnici sulla pacchettizzazione, come la struttura dell'archivio, come rinominarlo, come rendere orfano o prendere in carico un pacchetto, come fare gli NMU, come gestire i bug, i metodi migliori per creare pacchetti, quando e dove depositarli, ecc. (vedere &developers-reference;)
ja: <package>developers-reference</package><footnote>(訳注)日本語版は <package>developers-reference</package></footnote> - <url id="http://www.debian.org/doc/devel-manuals#devref" name="Debian 開発者リファレンス">には、例えばアーカイブの構造、パッケージ名の変更方法、パッケージの選び方、メンテナを降りるにはどうしたらよいか、どうやって NMU をするか、バグとのつき合い方、パッケージ作成のベストプラクティス、いつどこにアップロードすればよいかなどなど、特に技術的な事柄以外のパッケージ化についてのありとあらゆる情報がここにあります。(詳しくは <file>&developers-reference;</file>参照)。
zh_cn: <package>developers-reference</package> - <url id="http://www.debian.org/doc/devel-manuals#devref" name="Debian Developer's Reference"> 描述了打包所需的包含技术细节在内的全部详细信息，如仓库结构、如何重命名/丢弃/接手软件包、如何进行 NMU(非维护者上传)、如何管理 Bug 以及打包最佳经验、何时向何处上传等。(参看 <file>&developers-reference;</file>)
zh_tw: <package>developers-reference</package> - <url id="http://www.debian.org/doc/devel-manuals#devref" name="Debian Developer's Reference"> 描述了打包所需的包含技術細節在內的全部詳細訊息，如倉庫結構、如何重命名/丟棄/接手套件、如何進行 NMU(非維護者上傳)、如何管理 Bug 以及打包最佳經驗、何時向何處上傳等。(參考 <file>&developers-reference;</file>)

source: <url id="http://www.lrde.epita.fr/~adl/autotools.html" name="Autotools Tutorial"> provides very good tutorial for <url id="http://en.wikipedia.org/wiki/GNU_build_system" name="the GNU Build System known as the GNU Autotools"> whose most important components are Autoconf, Automake, Libtool, and gettext.
ca: <url id="http://www.lrde.epita.fr/~adl/autotools.html" name="Tutorial de «Autotools»"> és un bon tutorial del <url id="http://en.wikipedia.org/wiki/GNU_build_system" name="sistema de compilació GNU conegut como «GNU Autotools»"> composat per Autoconf, Automake, Libtool, i gettext.
es: <url id="http://www.lrde.epita.fr/~adl/autotools.html" name="Tutorial de «Autotools»"> contiene un tutorial muy bueno sobre <url id="http://es.wikipedia.org/wiki/GNU_build_system" name="el sistema de compilación GNU conocido como «GNU Autotools»"> cuyos componentes más importantes son «Autoconf», «Automake», «Libtool», y «gettext»
fr: Le <url id="http://www.lrde.epita.fr/~adl/autotools.html" name="tutoriel des Autotools"> fournit un très bon tutoriel pour le <url id="http://fr.wikipedia.org/wiki/Autotools" name="système de construction GNU connu comme les GNU Autotools"> dont les composants les plus importants sont Autoconf, Automake, Libtool, et gettext ;
ja: <url id="http://www.lrde.epita.fr/~adl/autotools.html" name="Autotools チュートリアル"> は、Autoconf、Automake、Libtool や gettext を最も重要な構成要素としてもつ <url id="http://en.wikipedia.org/wiki/GNU_build_system" name="GNU Autotools として知られる GNU ビルドシステム"> の大変よい手引き書です。
zh_cn: <url id="http://www.lrde.epita.fr/~adl/autotools.html" name="Autotools Tutorial"> 为 <url id="http://en.wikipedia.org/wiki/GNU_build_system" name="the GNU Build System known as the GNU Autotools"> 中最重要的工具 —— Autoconf、Automake、Libtool 和 gettext 提供了很好的文档。
zh_tw: <url id="http://www.lrde.epita.fr/~adl/autotools.html" name="Autotools Tutorial"> 爲 <url id="http://en.wikipedia.org/wiki/GNU_build_system" name="the GNU Build System known as the GNU Autotools"> 中最重要的工具 —— Autoconf、Automake、Libtool 和 gettext 提供了很好的文件。
