Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: You can compare file contents in two source Debian packages with the <manref section="1" name="debdiff"> command.
ca: Pots comparar el contingut de dos paquets de fonts Debian executant l'ordre <manref section="1" name="debdiff"> així:
es: Puedes comparar el contenido de dos paquetes de fuentes Debian ejecutando la orden <manref section="1" name="debdiff"> como sigue:
fr: La commande <manref section="1" name="debdiff"> peut comparer les contenus de fichiers entre deux paquets Debian sources.
it: Si può confrontare il contenuto dei file in due pacchetti sorgente Debian con il comando <manref section="1" name="debdiff">.
zh_cn: 你可以使用 <manref section="1" name="debdiff"> 命令比较两个 Debian 源代码包的内容。
zh_tw: 你可以使用 <manref section="1" name="debdiff"> 命令比較兩個 Debian 原始碼包的內容。

source: $ debdiff <var>old-package</var>.dsc <var>new-package</var>.dsc
ca: $ debdiff <var>versió_anterior</var>.dsc <var>nova_versió</var>.dsc
es: $ debdiff <var>versión_anterior</var>.dsc <var>nueva_versión</var>.dsc
fr: $ debdiff <var>ancien-paquet</var>.dsc <var>nouveau-paquet</var>.dsc

source: You can also compare file lists in two sets of binary Debian packages with the <manref section="1" name="debdiff"> command.
ca: Pots comparar la llista de fitxers de dos paquets binaris de Debian amb l'ordre <manref section="1" name="debdiff"> executant l'ordre següent:
es: Puedes comparar la lista de ficheros de dos paquetes binarios de Debian con la orden <manref section="1" name="debdiff"> ejecutando la orden como sigue:
fr: La commande <manref section="1" name="debdiff"> permet aussi de comparer les listes de fichiers entre deux ensembles de paquets Debian binaires.
it: Si possono anche confrontare le liste di file in due set di pacchetti binari Debian con il comando <manref section="1" name="debdiff">.
zh_cn: 你还可以使用 <manref section="1" name="debdiff"> 命令比较两个 Debian 二进制包的文件列表。
zh_tw: 你還可以使用 <manref section="1" name="debdiff"> 命令比較兩個 Debian 二進位套件的檔案列表。

source: $ debdiff <var>old-package</var>.changes <var>new-package</var>.changes
ca: $ debdiff <var>versió_anterior</var>.changes <var>nova_versió</var>.changes
es: $ debdiff <var>versión_anterior</var>.changes <var>nueva_versión</var>.changes
fr: $ debdiff <var>ancien-paquet</var>.changes <var>nouveau-paquet</var>.changes

source: These are useful to identify what has been changed in the source packages, if no files have been unintentionally misplaced or removed in the binary packages, and if no other inadvertent changes were made when updating binary packages.
ca: Aquest programa és útil per comprovar que no hi ha fitxers canviats d'ubicació o eliminats per error, i que no s'ha realitzat cap altre canvi no desitjat en l'actualització del paquet.
es: Este programa es útil para verificar que no hay ficheros que se hayan cambiado de sitio o eliminado por error, y que no se ha realizado ningún otro cambio no deseado al actualizar el paquete.
fr: Ces commandes sont utiles pour identifier ce qui a été modifié dans les paquets sources, si aucun fichier n'a été déplacé ou enlevé involontairement dans les paquets binaires, et qu'aucune autre modification n'a été faite par inadvertance lors de la mise à jour des paquets binaires.
it: Questi comandi sono utili per vedere cosa sia cambiato nei pacchetti sorgente, se alcun file sia stato spostato inavvertitamente o rimosso dai pacchetti, e se altri cambiamenti non intenzionali siano stati fatti durante l'aggiornamento dei pacchetti binari.
zh_cn: 这个命令对于检查源代码包中哪些文件被修改了非常有用，还可以发现二进制包中是否有文件被意外替换或删除，或在更新二进制包时检查是否有其他没有被提及的变更。
zh_tw: 這個命令對於檢查原始碼包中哪些檔案被修改了非常有用，還可以發現二進位套件中是否有檔案被意外替換或刪除，或在更新二進位套件時檢查是否有其他沒有被提及的變更。

source: <prgn>interdiff</prgn> command
ca: L'ordre <prgn>interdiff</prgn>.
es: La orden <prgn>interdiff</prgn>
fr: Commande interdiff
it: Il comando <prgn>interdiff</prgn>
ja: <prgn>interdiff</prgn> コマンド
zh_cn: <prgn>interdiff</prgn> 命令
zh_tw: <prgn>interdiff</prgn> 命令

source: You can compare two <file>diff.gz</file> files with the <manref section="1" name="interdiff"> command. This is useful for verifying that no inadvertent changes were made to the source by the maintainer when updating packages in the old <tt>1.0</tt> source format.
ca: Pots comparar dos fitxers <file>diff.gz</file> amb l'ordre <manref section="1" name="interdiff">. Això és útil per comprovar que el responsable del paquet no ha fet canvis inadvertits en l'actualització de paquets construïts amb el format <tt>1.0</tt>. Executa:
es: Puedes comparar dos ficheros <file>diff.gz</file> con la orden <manref section="1" name="interdiff">. Esto es muy útil para verificar que no se han realizado cambios inadvertidos por el responsable del paquete al actualizar el paquetes que se han construido con el formato <tt>1.0</tt>. Ejecuta lo siguiente:
fr: Vous pouvez comparer deux fichiers <file>diff.gz</file> avec la commande <manref section="1" name="interdiff">. C'est utile pour vérifier qu'aucune modification involontaire n'a été effectuée sur les sources par le responsable en mettant à jour les paquets à l'ancien format source <tt>1.0</tt>.
it: Si possono confrontare due file <file>diff.gz</file> con il comando <manref section="1" name="interdiff">. Questo è utile per verificare che il manutentore non abbia inavvertitamente fatto dei cambiamenti ai sorgenti durante il processo di aggiornamento dei pacchetti nel vecchio formato sorgente <tt>1.0</tt>.
zh_cn: 你可以使用 <manref section="1" name="interdiff"> 命令比较两个 <file>diff.gz</file> 文件。这对于更新使用旧的 <tt>1.0</tt> 源代码格式的软件包时，检查是否有意外的变更非常有用。
zh_tw: 你可以使用 <manref section="1" name="interdiff"> 命令比較兩個 <file>diff.gz</file> 檔案。這對於更新使用舊的 <tt>1.0</tt> 原始碼格式的套件時，檢查是否有意外的變更非常有用。

source: $ interdiff -z <var>old-package</var>.diff.gz <var>new-package</var>.diff.gz
ca: $ interdiff -z <var>versió_anterior</var>.diff.gz <var>nova_versió</var>.diff.gz
es: $ interdiff -z <var>versión_anterior</var>.diff.gz <var>nueva_versión</var>.diff.gz
fr: $ interdiff -z <var>ancien-paquet</var>.diff.gz <var>nouveau-paquet</var>.diff.gz

source: <prgn>mc</prgn> command
ca: L'ordre <prgn>mc</prgn>.
es: La orden <prgn>mc</prgn>
fr: Commande mc
it: Il comando <prgn>mc</prgn>
ja: <prgn>mc</prgn> コマンド
zh_cn: <prgn>mc</prgn> 命令
zh_tw: <prgn>mc</prgn> 命令

source: Many of these file inspection operations can be made into an intuitive process by using a file manager like <manref section="1" name="mc"> which will let you browse not only the contents of <file>*.deb</file> package files but also <file>*.udeb</file>, <file>*.debian.tar.gz</file>, <file>*.diff.gz</file>, and <file>*.orig.tar.gz</file> files.
ca: Algunes de les operacions de comprovació del paquet explicades poden realitzar-se de manera molt intuïtiva si es fa servir un gestor de fitxers com <manref section="1" name="mc">, que permet visualitzar el contingut del paquet <file>*.deb</file>, i dels fitxers <file>*.udeb</file>, <file>*.debian.tar.gz</file>, <file>*.diff.gz</file> i <file>*.orig.tar.gz</file>
es: Algunas de las operaciones de comprobación del paquete descritas puede realizarse de forma muy intuitiva si empleamos un gestor de ficheros como <manref section="1" name="mc">, que permite visionar tanto el contenido del paquete <file>*.deb</file>, como el de los ficheros <file>*.udeb</file>, <file>*.debian.tar.gz</file>, <file>*.diff.gz</file>, <file>*.orig.tar.gz</file>.
fr: Toutes ces opérations d'inspection de fichier peuvent être transformées en un processus intuitif avec un gestionnaire de fichiers comme <manref section="1" name="mc"> qui vous permet de consulter non seulement le contenu des fichiers paquet <file>*.deb</file>, mais aussi les fichiers <file>*.udeb</file>, <file>*.debian.tar.gz</file>, <file>*.diff.gz</file> et <file>*.orig.tar.gz</file>.
it: Molte delle operazione di ispezione dei file possono essere rese più semplici utilizzando un gestore dei file come <manref section="1" name="mc">, che permette di navigare non solo il contenuto dei pacchetti in formato <file>*.deb</file> ma anche degli <file>*.udeb</file>, <file>*.debian.tar.gz</file>, <file>*.diff.gz</file>, e dei file <file>*.orig.tar.gz</file>.
zh_cn: 很多文件检查操作可以通过使用类似 <manref section="1" name="mc"> 的文件管理器来完成，它可以帮助你直接查看 <file>*.deb</file> 文件的内容，除此之外还可以用于 <file>*.udeb</file>、<file>*.debian.tar.gz</file>、<file>*.diff.gz</file> 和 <file>*.orig.tar.gz</file> 文件。
zh_tw: 很多檔案檢查操作可以通過使用類似 <manref section="1" name="mc"> 的檔案管理器來完成，它可以幫助你直接查看 <file>*.deb</file> 檔案的內容，除此之外還可以用於 <file>*.udeb</file>、<file>*.debian.tar.gz</file>、<file>*.diff.gz</file> 和 <file>*.orig.tar.gz</file> 檔案。

source: Be on the lookout for extra unneeded files or zero length files, both in the binary and source package. Often cruft doesn't get cleaned up properly; adjust your <file>rules</file> file to compensate for that.
ca: Comprova que no hi hagi fitxers innecessaris o de tamany zero, tant en el binari com en el paquet font. De vegades , hi ha coses que no es varen netejar adequadament: caldrà ajustar el fitxer <file>rules</file> per arreglar això.
es: Vigila que no haya ficheros innecesarios extra o de tamaño cero, tanto en el binario como en el paquete fuente. A veces, hay cosas que no se limpiaron adecuadamente, debes ajustar tu fichero <file>rules</file> para arreglar esto.
fr: Soyez attentif aux fichiers inutiles ou de taille nulle, dans les paquets binaires et source. Souvent les fichiers inutiles ne sont pas nettoyés correctement ; adaptez le fichier <file>rules</file> pour compenser.
it: Si faccia attenzione ad ulteriori file non necessari o vuoti, sia nel pacchetto binario che in quello sorgente. Spesso non vengono ripuliti correttamente; si aggiusti il file <file>rules</file> per riparare a questo problema.
zh_cn: 还要检查在二进制包和源代码包中是否有不需要的文件或者空文件。这些文件经常没有被正确清理，如果存在这种情况，要调整 <file>rules</file> 文件进行处理。
zh_tw: 還要檢查在二進位套件和原始碼包中是否有不需要的檔案或者空檔案。這些檔案經常沒有被正確清理，如果存在這種情況，要調整 <file>rules</file> 檔案進行處理。

source: Uploading the package
ca: Enviar el paquet.
es: Enviar el paquete
fr: Envoi de paquet
it: Caricamento del pacchetto
ja: パッケージをアップロードする
zh_cn: 上传软件包
zh_tw: 上傳套件

source: Now that you have tested your new package thoroughly, you will be technically ready to start the Debian new maintainer application process, as described at <url id="http://www.debian.org/devel/join/newmaint">
ca: Ara que has comprovat el teu paquet en profunditat, estàs preparat per començar el procés de nou desenvolupador de Debian tal com es descriu a <url id="http://www.debian.org/devel/join/newmaint">
es: Ahora que has probado tu nuevo paquete en profundidad, estarás preparado para comenzar el proceso de nuevo desarrollador de Debian tal y como se describe en: <url id="http://www.debian.org/devel/join/newmaint">
fr: Maintenant que votre nouveau paquet a été testé en détail, vous êtes prêt à commencer le processus d'application de nouveau responsable Debian, décrit en <url id="http://www.debian.org/devel/join/newmaint">.
it: Una volta testato il nuovo pacchetto approfonditamente, si potrà procedere con il processo di candidatura a nuovo manutentore Debian, come descritto in <url id="http://www.debian.org/devel/join/newmaint">.
zh_cn: 当你完成了对软件包的彻底测试，在技术上你已经满足了申请 Debian 新维护人员的要求，详细的描述参看 <url id="http://www.debian.org/devel/join/newmaint">
zh_tw: 當你完成了對套件的徹底測試，在技術上你已經滿足了申請 Debian 新維護人員的要求，詳細的描述參考 <url id="http://www.debian.org/devel/join/newmaint">

source: Uploading to the Debian archive
ca: Enviar el paquet al repositori de Debian.
es: Enviar al repositorio de Debian
fr: Envoi vers l'archive Debian
it: Caricamento nell'archivio Debian
ja: Debian アーカイブへアップロードする
zh_cn: 上传到 Debian 仓库
zh_tw: 上傳到 Debian 倉庫

source: Once you become an official developer, you'll need to upload the package to the Debian archive. You can do this manually, but it's easier to use the provided automated tools, like <manref section="1" name="dupload"> or <manref section="1" name="dput">. We'll describe how it's done with <prgn>dupload</prgn>. <footnote><p>The <package>dput</package> package seems to come with more features and becoming more popular than the <package>dupload</package> package. It uses the <file>/etc/dput</file> file for the global configuration and the <file>~/.dput.cf</file> file for the per-user one. It supports Ubuntu related services out-of-box, too. </p></footnote>
ca: Quan siguis desenvolupador oficial Debian, podràs carregar el paquet al repositori de Debian. Pots fer això manualment, però és més fàcil fer-ho amb les eines automàtiques ja disponibles com <manref section="1" name="dupload"> o <manref section="1" name="dput">. A continuació descriurem com fer-ho amb <prgn>dupload</prgn> <footnote><p>És possible que el paquet <package>dput</package> ofereixi més funcionalitats i sigui més popular que <package>dupload</package>. Fes servir l'arxiu <file>/etc/dput</file> per a la configuració global i el fitxer <file>~/.dput.cf</file> per a la configuració pròpia de l'usuari. També incorpora l'assistència per a Ubuntu. </p></footnote>.
es: Cuando seas desarrollador oficial Debian, podrás transferir el paquete al repositorio de Debian. Puedes hacer esto manualmente, pero es más fácil hacerlo con las herramientas automáticas ya disponibles como <manref section="1" name="dupload"> o <manref section="1" name="dput">. A continuación describiremos cómo hacerlo con <prgn>dupload</prgn> <footnote><p>Tal vez el paquete <package>dput</package> tenga más funcionalidades y sea más popular que <package>dupload</package> . Utiliza el archivo <file>/etc/dput</file> para la configuración global y el archivo <file>~/.dput.cf</file> para la configuración del usuario. También incorpora la asistencia para Ubuntu. </p></footnote>.
fr: Une fois devenu un développeur Debian officiel, vous devrez envoyer le paquet sur les archives Debian. Vous pouvez le faire vous-même, mais il est plus facile d'utiliser les outils automatiques disponibles, comme <manref section="1" name="dupload"> ou <manref section="1" name="dput">. Nous décrirons la façon de faire avec <prgn>dupload</prgn>. <footnote><p>Le paquet <package>dput</package> semble fournir plus de fonctionnalités, et devient plus populaire que le paquet <package>dupload</package>. Il utilise le fichier <file>/etc/dput</file> pour la configuration globale et le fichier <file>~/.dput.cf</file> pour la configuration par utilisateur. Il gère aussi les services relatifs à Ubuntu d'origine.</p></footnote>
it: Una volta diventati sviluppatori ufficiali, si dovrà caricare il pacchetto nell'archivio Debian. Si potrebbe fare manualmente, ma è più semplice usare i tool automatici che vengono forniti, come <manref section="1" name="dupload"> o <manref section="1" name="dput">. Verrà qui descritto come tutto ciò può essere fatto utilizzando <prgn>dupload</prgn>. <footnote><p>Il pacchetto <package>dput</package> sembra avere più funzionalità e sta divenendo più famoso del pacchetto <package>dupload</package>. Questo utilizza il file <file>/etc/dput</file> per la configurazione globale ed il file <file>~/.dput.cf</file> per quella dei singoli utenti. Inoltre supporta nativamente anche i servizi relativi ad Ubuntu. </p></footnote>
zh_cn: 当你成为正式的开发人员，你会需要把软件包上传到 Debian 仓库。你可以手工进行这项工作，但使用例如 <manref section="1" name="dupload"> 或 <manref section="1" name="dput"> 的自动化工具可以帮你更好地完成这项操作。在此我们将叙述如何使用 <prgn>dupload</prgn> 操作。<footnote><p><package>dput</package> 软件包提供了更多的特性，相比于 <package>dupload</package> 也越来越受欢迎。它使用 <file>/etc/dput</file> 文件作为全局配置文件、<file>~/.dput.cf</file> 作为用户配置文件。它也直接支持 Ubuntu 相关的服务。</p></footnote>
zh_tw: 當你成爲正式的開發人員，你會需要把套件上傳到 Debian 倉庫。你可以手工進行這項工作，但使用例如 <manref section="1" name="dupload"> 或 <manref section="1" name="dput"> 的自動化工具可以幫你更好地完成這項操作。在此我們將敘述如何使用 <prgn>dupload</prgn> 操作。<footnote><p><package>dput</package> 套件提供了更多的特性，相比於 <package>dupload</package> 也越來越受歡迎。它使用 <file>/etc/dput</file> 檔案作爲全局設定檔案、<file>~/.dput.cf</file> 作爲用戶設定檔案。它也直接支持 Ubuntu 相關的服務。</p></footnote>

source: First you have to set up <prgn>dupload</prgn>'s config file. You can either edit the system-wide <file>/etc/dupload.conf</file> file, or have your own <file>~/.dupload.conf</file> file override the few things you want to change.
ca: Per començar, caldrà ajustar la configuració de <package>dupload</package>. Pots fer-ho editant el fitxer general <file>/etc/dupload.conf</file>, o construint el teu arxiu personalitzat <file>~/.dupload.conf</file> amb els paràmetres que vulguis canviar.
es: En primer lugar, tienes que generar un fichero de configuración de dupload. Puedes hacerlo editando el fichero general del sistema <file>/etc/dupload.conf</file>, o creando tu propio fichero <file>~/.dupload.conf</file> con lo que tu quieras cambiar.
fr: D'abord vous devez écrire le fichier de configuration de <prgn>dupload</prgn>. Vous pouvez soit éditer le fichier global <file>/etc/dupload.conf</file>, soit avoir votre propre fichier <file>~/.dupload</file> pour remplacer les quelques détails que vous voulez changer.
it: Innanzitutto andrà impostato il file di configurazione di <prgn>dupload</prgn>. Si può modificare il file <file>/etc/dupload.conf</file> per l'intero sistema, oppure far si che il file <file>~/.dupload.conf</file> sovrascriva le poche cose che si vogliono cambiare.
ja: まず <prgn>dupload</prgn> の設定ファイルを調整しなければいけません。 システム全体の設定ファイルである <file>/etc/dupload.conf</file> を編集するか、あるいはあなた専用の設定ファイルである <file>~/.dupload.conf</file> を使って変更したい項目だけをオーバーライドさせてもかまいません。
zh_cn: 首先需要设置 <prgn>dupload</prgn> 的配置文件。你既可以编辑系统级的 <file>/etc/dupload.conf</file> 文件，也可以使用自己的 <file>~/.dupload.conf</file> 文件覆盖一些需要修改的设置。
zh_tw: 首先需要設置 <prgn>dupload</prgn> 的設定檔案。你既可以編輯系統級的 <file>/etc/dupload.conf</file> 檔案，也可以使用自己的 <file>~/.dupload.conf</file> 檔案覆蓋一些需要修改的設置。

source: You can read the <manref section="5" name="dupload.conf"> manual page to understand what each of these options means.
ca: Consulta el manual de <manref section="5" name="dupload.conf"> per conèixer el significat de cada opció.
es: Consulta el manual de <manref section="5" name="dupload.conf"> para saber el significado de cada opción.
fr: Vous pouvez lire la page de manuel <manref section="5" name="dupload.conf"> pour comprendre ce que chacune de ces options signifie.
it: Si legga la pagina del manuale <manref section="5" name="dupload.conf"> per capire cosa significhino tutte le opzioni.
ja: またそれぞれのオプションが持つ意味を理解するため <manref section="5" name="dupload.conf"> マニュアルページを読むことができます。
zh_cn: 你可以阅读 <manref section="5" name="dupload.conf"> man 手册页来了解各选项的含义。
zh_tw: 你可以閱讀 <manref section="5" name="dupload.conf"> man 手冊頁來瞭解各選項的含義。

source: The <tt>$default_host</tt> option determines which of the upload queues will be used by default. <tt>anonymous-ftp-master</tt> is the primary one, but it's possible that you will want to use another one.
ca: L'opció <tt>$default_host</tt> és la més problemàtica: determina quina de les cues de càrrega es farà servir per defecte. "«anonymous-ftp-master»" és la primera però és possible que vulguis fer servir una altra més ràpida. Consulta la referència del desenvolupador, i més concretament la secció «Uploading a package», en <file>&uploading;</file> per saber-ne més sobre les cues de càrrega.
es: La opción <tt>$default_host</tt> es la más problemática; determina cuál de las colas de envíos se usará por omisión. «<tt>anonymous-ftp-master</tt>» es la primaria, pero es posible que quieras usar otra más rápida.
fr: L'option <tt>$default_host</tt> détermine la queue de téléchargement qui sera utilisée par défaut. <tt>anonymous-ftp-master</tt> est la principale, mais il est possible que vous souhaitiez en utiliser une autre.
it: L'opzione <tt>$default_host</tt> determina quali tra le code di caricamento vengano utilizzate in modo predefinito. <tt>anonymous-ftp-master</tt> è quella primaria, ma è possibile utilizzarne anche altre.
ja: もっとも気をつけるべき項目は <tt>$default_host</tt> の選択です。この項目にはデフォルトとして利用するアップロードキューを指定します。<tt>anonymous-ftp-master</tt>がメインのサーバーですが、別のホストを利用したいこともあるでしょう。
zh_cn: <tt>$default_host</tt> 选项决定了默认使用哪个上传队列，<tt>anonymous-ftp-master</tt> 是最基本的一个，但你很可能希望改用其他的。
zh_tw: <tt>$default_host</tt> 選項決定了默認使用哪個上傳隊列，<tt>anonymous-ftp-master</tt> 是最基本的一個，但你很可能希望改用其他的。

source: While connected to the Internet, you can upload your package by the following:
ca: Comprova que tens connexió a internet i executa l'ordre:
es: Ahora asegúrate que tienes conexión a internet y ejecuta la orden:
fr: Une fois connecté à Internet, vous pouvez envoyer le paquet :
it: Se si è connessi ad internet, si può caricare il proprio pacchetto con il comando:
zh_cn: 连接到互联网后，可以使用以下命令上传你的软件包：
zh_tw: 連接到互聯網後，可以使用以下命令上傳你的套件：

source: <prgn>dupload</prgn> checks that the MD5/SHA1/SHA256 checksums of the files match those from the <file>.changes</file> file. If they do not match, it will warn you to rebuild it as described in <ref id="completebuild"> so it can be properly uploaded.
ca: <prgn>dupload</prgn> comprova que les sumes MD5/SHA1/SHA256 dels fitxers transferits coincideixen amb els llistats en el fitxer <file>.changes</file>, en cas contrari t'avisarà i hauràs de reconstruir el paquet com s'explica a <ref id="completebuild"> per poder enviar-ho correctament.
es: <prgn>dupload</prgn> comprueba que las sumas MD5/SHA1/SHA256 de los archivos transferidos coinciden con las listadas en el fichero <file>.changes</file>, si no coinciden te avisará para que reconstruyas el paquete como se describe en <ref id="completebuild"> para poder enviarlo correctamente.
zh_cn: <prgn>dupload</prgn> 会检查文件的 MD5/SHA1/SHA256 校验和是否与 <file>.changes</file> 文件中的相匹配，如果不匹配它会做出警告。你应按照如 <ref id="completebuild"> 所述来重构建软件包使得它可以被正常上传。
