Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: Whenever you make changes that are not specifically related to Debian package such as <file>debian/patches/fix-gentoo-target.patch</file>, be sure to send them to the upstream maintainer so they can be included in the next program revision and be useful to everyone else. Also remember to make your fixes not specific to Debian or Linux (or even Unix!) prior to sending them -- make them portable. This will make your fixes much easier to apply.
ca: Sempre que facis canvis que no estiguin específicament relacionats amb el paquet Debian, tals com <file>debian/patches/fix-gentoo-target.patch</file>, envia'ls a l'autor del codi original per tal que aquest ho pugui incorporar en la pròxima revisió del programa i així li puguin ésser útils. A més, procura que els canvis realitzats no siguin exclusius per a Debian o GNU/Linux (ni tan sols per a Unix!) abans d'enviar-los: fes canvis que siguin portables. Això farà que els teus pedaços siguin fàcils d'aplicar.
es: Siempre que hagas cambios que no estén específicamente relacionados con el paquete Debian, tales como <file>debian/patches/fix-gentoo-target.patch</file>, asegúrate de que los envías al desarrollador original para que éste los pueda incluir en la próxima revisión del programa y así le puedan ser útiles a alguien más. Además, recuerda hacer que tus cambios no sean específicos para Debian o GNU/Linux (¡ni siquiera para Unix!) antes de enviarlos, hazlo portable. Esto hará que tus arreglos sean más fáciles de aplicar.
fr: Chaque fois que vous faites des modifications qui ne sont pas spécifiquement liées à Debian comme <file>debian/patches/fix-gentoo-target.patch</file>, envoyez-les au responsable amont pour qu'elles puissent être incluses dans la version suivante du programme et que tout le monde puisse en profiter. Souvenez-vous aussi de ne pas rendre vos corrections spécifiques à Debian ou Linux (ou même Unix !) avant de les envoyer &mdash; faites-les portables. Cela rendra vos corrections beaucoup plus faciles à appliquer.
it: Ogni volta che si apportano delle modifiche che non sono specificatamente legate alla pacchettizzazione Debian, come <file>debian/patches/fix-gentoo-target.patch</file>, bisogna assicurarsi di inviare le modifiche al manutentore originale, in modo che possano essere incluse nella prossima versione del programma e possano beneficiarne altri utenti. Ci si ricordi, di creare delle correzioni portabili, ovvero di non renderle specifiche per Debian o Linux (o altri Unix!), prima di inviarle. Questo renderà più semplice applicare le correzioni.
ja: <file>debian/patches/fix-gentoo-target.patch</file> のような、特に Debian パッケージだけに限定されない変更を行った場合、その内容を開発元のメンテナに報告するようにしてください。そうすれば、プログラムの次版に反映してもらうことができ、他のすべての利用者にとっても有益な結果をもたらすことになります。また、あなたの修正を送る前に、Debian や Linux (あるいは Unix でさえも!) に特化した修正にせず、移植性をもたせることも忘れないでください。そうすれば、あなたの変更はずっと採用されやすくなります。
zh_cn: 进行任何不是 Debian 特有的修改时，比如 <file>debian/patches/fix-gentoo-target.patch</file>，一定要向上游作者进行反馈，以便上游作者方便在下一版本中以使更多人受益。同时请记住在做不特别针对 Debian 或 Linux (甚至是 Unix！)的修改时要使其可以移植，这会使你的修改更容易被接受。
zh_tw: 進行任何不是 Debian 特有的修改時，比如 <file>debian/patches/fix-gentoo-target.patch</file>，一定要向上游作者進行反饋，以便上游作者方便在下一版本中以使更多人受益。同時請記住在做不特別針對 Debian 或 Linux (甚至是 Unix！)的修改時要使其可以移植，這會使你的修改更容易被接受。

source: Note that you don't have to send the <file>debian/*</file> files upstream.
ca: No cal enviar cap dels fitxers del directori <file>debian/*</file> a l'autor original.
es: Ten en cuenta que no tienes que enviar ninguno de los ficheros <file>debian/*</file> al desarrollador original.
fr: Remarquez que vous ne devez pas envoyer les fichiers <file>debian/*</file> en amont.
it: Da notare che non è necessario inviare i file <file>debian/*</file> all'autore originale.
ja: 開発元の作者へ <file>debian/*</file> ファイルを送らなくてもよいことに注意してください。
zh_cn: 注意你不一定要把 <file>debian/*</file> 都提交到上游。
zh_tw: 注意你不一定要把 <file>debian/*</file> 都提交到上游。

source: Differing libraries
ca: ﻿Diferències a les biblioteques.
es: Diferencias en las bibliotecas
fr: Bibliothèques différentes
it: Distinguere le librerie
ja: ライブラリの差異
zh_cn: 不一样的库名称
zh_tw: 不一樣的庫名稱

source: There is one other common problem: libraries are often different from platform to platform. For example, a <file>Makefile</file> can contain a reference to a library which doesn't exist on Debian systems. In that case, we need to change it to a library which does exist in Debian, and serves the same purpose.
ca: Hi ha un problema que és bastant freqüent: les biblioteques són generalment diferents entre plataformes. Per exemple, un arxiu <file>Makefile</file> pot fer referència a una biblioteca que no ﻿existeixi en Debian o fins i tot a GNU/Linux. En aquest cas, cal canviar-la a una biblioteca equivalent a Debian.
es: Hay otro problema común: las bibliotecas son generalmente diferentes entre plataformas. Por ejemplo, un <file>Makefile</file> puede contener una referencia a una biblioteca que no exista en Debian o ni siquiera en GNU/Linux. En este caso, se necesita cambiarla a una biblioteca que sí exista en Debian y sirva para el mismo propósito.
fr: Il y a un autre problème courant : des bibliothèques sont souvent différentes d'une plate-forme à l'autre. Par exemple, <file>Makefile</file> peut contenir une référence à une bibliothèque qui n'existe pas sur les systèmes Debian. Dans ce cas, changez-la en une bibliothèque qui existe dans Debian, et qui sert à la même chose.
it: C'è un altro problema comune: le librerie sono spesso diverse da piattaforma a piattaforma. Per esempio, il <file>Makefile</file> può contenere un riferimento a una libreria che non esiste nei sistemi Debian. In tal caso occorre cambiare il riferimento ad una libreria che serve allo stesso scopo e che esista in Debian.
ja: よくある問題がもう一つあります： ライブラリはしばしばプラットフォームごとに異なります。例えば、<file>Makefile</file> は Debian システム上に存在しないライブラリへの参照を含んでいるかもしれません。その場合には、Debian 上に存在する互換ライブラリを指すように変更し、同じ用を足すようにしてやらなければなりません。
zh_cn: 还有另外一个常见的问题：不同平台之间的库常常是不同的。例如一个 <file>Makefile</file> 中可能引了用一个不在 Debian 上存在的库。这种情况下我们需要将其修改为 Debian 中存在的、提供完全相同功能的库。
zh_tw: 還有另外一個常見的問題：不同平臺之間的庫常常是不同的。例如一個 <file>Makefile</file> 中可能引了用一個不在 Debian 上存在的庫。這種情況下我們需要將其修改爲 Debian 中存在的、提供完全相同功能的庫。

source: So, if there is a line in your program's <file>Makefile</file> (or <file>Makefile.in</file>) that says something like this (and your program doesn't compile) <footnote><p>The author realizes that this is not the best example considering our <package>libncurses</package> package now ships with a <file>libcurses.so</file> symlink, but he couldn't think of a better one. Suggestions very welcome :-)</p></footnote>:
ca: Hi ha una línia en el fitxer <file>Makefile</file> (o <file>Makefile.in</file>) del teu programa que posa alguna cosa com el següent (i degut en això la compilació no és possible)<footnote><p>L'autor és conscient que aquest no és un bon exemple ara que el paquet <package>libncurses</package> inclou un enllaç simbòlic <file>libcurses.so</file> però no se li ocorre un exemple millor. Serà benvingut qualsevol suggeriment:-) </p></footnote>:
es: Así, si hay una línea en el <file>Makefile</file> (o <file>Makefile.in</file>) de tu programa que dice algo como lo siguiente (y tu programa no compila) <footnote><p>El autor es consciente que este no es el mejor ejemplo ahora que el paquete <package>libncurses</package> incluye un enlace simbólico <file>libcurses.so</file> pero no tenia a mano un ejemplo mejor. Cualquier sugerencia será bienvenida :-)</p></footnote>:
fr: Ainsi, si une ligne de <file>Makefile</file> (ou <file>Makefile.in</file>) du programme indique quelque chose comme ceci (et que le programme ne compile pas) <footnote><p>NdA : ceci n'est pas le meilleur exemple dans la mesure où le paquet <package>libncurses</package> est maintenant livré avec un lien symbolique <file>libcurses.so</file>. Les suggestions sont les bienvenues :-)</p></footnote> :
it: Così, se c'è una riga nel <file>Makefile</file> del programma (o nel <file>Makefile.in</file>) che dice qualcosa tipo (e il programma non compila) <footnote><p>L'autore si rende conto che questo non è il miglior esempio, considerando che con il pacchetto <package>libncurses</package> viene fornito il link simbolico <file>libcurses.so</file>, ma non è riuscito a trovare di meglio. Sono molto graditi dei suggerimenti :-)</p></footnote>:
ja: そのため、プログラムの <file>Makefile</file> (もしくは <file>Makefile.in</file>) にこのような感じになっている行があった (そしてプログラムがコンパイルできない) 場合 <footnote><p><package>libncurses</package> パッケージが <file>libcurses.so</file> シンボリックリンクを持っていることを考えると、これが最適な例ではないと著者は思うのですが、よりよい例を思いつきません。提案をもらえるとありがたいです :-)</p></footnote> は：
zh_cn: 如果你手中程序的 <file>Makefile</file>(或 <file>Makefile.in</file>)中有如下的行(且程序无法通过编译)<footnote><p>作者已经意识到这不是一个最好的例子，因为我们的 <package>libncurses</package> 软件包现在提供了一个 <file>libcurses.so</file> 的符号链接，但作者还没有想出更好的例子。非常欢迎提出建议 :-)</p></footnote>：
zh_tw: 如果你手中程式的 <file>Makefile</file>(或 <file>Makefile.in</file>)中有如下的行(且程式無法通過編譯)<footnote><p>作者已經意識到這不是一個最好的例子，因爲我們的 <package>libncurses</package> 套件現在提供了一個 <file>libcurses.so</file> 的符號鏈接，但作者還沒有想出更好的例子。非常歡迎提出建議 :-)</p></footnote>：

source: LIBS = -lcurses -lsomething -lsomethingelse
ca: LIBS = -lcurses -lcosas -lméscoses
es: LIBS = -lcurses -lcosas -lmás_cosas
fr: LIBS = -lcurses -lquelquechose -lautrechose
ja: LIBS = -lcurses -lなんとか -lかんとか

source: Let's fix this as <file>debian/patches/ncurse.patch</file> by changing <tt>curses</tt> into <tt>ncurses</tt>.
ca: Corregeix això amb el fitxer <file>debian/patches/ncurse.patch</file> canviant <tt>curses</tt> per <tt>ncurses</tt>.
es: Corrige esto con el archivo <file>debian/patches/ncurse.patch</file> cambiando <tt>curses</tt> por <tt>ncurses</tt>.
fr: Il suffit de le corriger dans <file>debian/patches/ncurse.patch</file> en modifiant <tt>curses</tt> en <tt>ncurses</tt> :
it: Si cambi <tt>curses</tt> con <tt>ncurses</tt> e si salvi la correzione come <file>debian/patches/ncurse.patch</file>.
ja: これを <file>debian/patches/ncurse.patch</file> として修正し、<tt>curses</tt> を <tt>ncurses</tt> に変更しましょう。
zh_cn: 我们将这个补丁命名为 <file>debian/patches/ncurse.patch</file>，内容是把 <tt>curses</tt> 改为 <tt>ncurses</tt>。
zh_tw: 我們將這個補丁命名爲 <file>debian/patches/ncurse.patch</file>，內容是把 <tt>curses</tt> 改爲 <tt>ncurses</tt>。

source: $ quilt new ncurse.patch $ quilt add Makefile $ sed -i -e "s/-lcurses/-lncurses/g" Makefile $ quilt refresh $ quilt header -e ... describe patch
ca: $ quilt new ncurse.patch $ quilt add Makefile $ sed -i -e "s/-lcurses/-lncurses/g" Makefile $ quilt refresh $ quilt header -e ... descriu el canvi
es: $ quilt new ncurse.patch $ quilt add Makefile $ sed -i -e "s/-lcurses/-lncurses/g" Makefile $ quilt refresh $ quilt header -e ... describe el cambio
fr: $ quilt new ncurse.patch $ quilt add Makefile $ sed -i -e "s/-lcurses/-lncurses/g" Makefile $ quilt refresh $ quilt header -e ... description du correctif
ja: $ quilt new ncurse.patch $ quilt add Makefile $ sed -i -e "s/-lcurses/-lncurses/g" Makefile $ quilt refresh $ quilt header -e ... パッチの詳細
zh_cn: $ quilt new ncurse.patch $ quilt add Makefile $ sed -i -e "s/-lcurses/-lncurses/g" Makefile $ quilt refresh $ quilt header -e ... 描述补丁
zh_tw: $ quilt new ncurse.patch $ quilt add Makefile $ sed -i -e "s/-lcurses/-lncurses/g" Makefile $ quilt refresh $ quilt header -e ... 描述補丁

source: Required files under the <file>debian</file> directory
ca: Fitxers necessaris en el directori <file>debian</file>.
es: Archivos necesarios en el directorio <file>debian</file>
fr: Fichiers nécessaires dans le répertoire <file>debian</file>
it: File richiesti nella directory <file>debian</file>
ja: debian/ディレクトリ以下に無くてはならないファイル
zh_cn: <file>debian</file> 目录中的必须内容
zh_tw: <file>debian</file> 目錄中的必須內容

source: There is a new subdirectory under the program's source directory, it's called <file>debian</file>. There are a number of files in this directory that we should edit in order to customize the behavior of the package. The most important of them are <file>control</file>, <file>changelog</file>, <file>copyright</file> and <file>rules</file>, which are required for all packages.
ca: Ara tens un nou directori en el directori principal del programa («gentoo-0.9.12»), amb el nom <file>debian</file>. Hi ha alguns fitxers en aquest directori que caldrà editar per adaptar-los. Els fitxers més importants són <file>control</file>, <file>changelog</file>, <file>copyright</file> i <file>rules</file>, tots ells s'han d'incloure a tots els paquets.
es: Ahora hay un nuevo subdirectorio bajo el directorio principal del programa («gentoo-0.9.12»), que se llama <file>debian</file>. Hay algunos ficheros en este directorio que debemos editar para adaptar el comportamiento del paquete. La parte más importante es modificar los ficheros <file>control</file>, <file>changelog</file>, <file>copyright</file> y <file>rules</file> que son necesarios en todos los paquetes.
fr: Un nouveau sous-répertoire se trouve dans le répertoire des sources du programme, nommé <file>debian</file>. Certain fichiers de ce répertoire sont à modifier pour personnaliser le comportement du paquet. Les plus importants sont <file>control</file>, <file>changelog</file>, <file>copyright</file> et <file>rules</file>, ils sont nécessaires pour tous les paquets.
it: C'è una nuova sottodirectory all'interno della cartella contenente i sorgenti del programma ed è chiamata <file>debian</file>. All'interno di questa vi sono una serie di file che dovranno essere modificati per personalizzare il comportamento del pacchetto. I più importanti fra tutti questi sono i file <file>control</file>, <file>changelog</file>, <file>copyright</file> e <file>rules</file>, che vengono richiesti per tutti i pacchetti.
ja: プログラムのソースディレクトリの中に <file>debian</file>という名前の新しいディレクトリがつくられています。このディレクトリ内には多くのファイルがあり、パッケージの振る舞いをカスタマイズするには、これらを編集します。特に、 <file>control</file>、 <file>changelog</file>、 <file>copyright</file> 、 <file>rules</file>は全てのパッケージになくてはならないファイルです。
zh_cn: 运行 <prgn>dh_make</prgn> 后，程序源代码目录下新出现了一个名为 <file>debian</file> 的子目录。这个目录中有很多用于定制软件包行为的文件，需要我们编辑。其中最重要的几个是 <file>control</file>、<file>changelog</file>、<file>copyright</file> 和 <file>rules</file>，它们是所有软件包必须的。
zh_tw: 運行 <prgn>dh_make</prgn> 後，程式原始碼目錄下新出現了一個名爲 <file>debian</file> 的子目錄。這個目錄中有很多用於定製套件行爲的檔案，需要我們編輯。其中最重要的幾個是 <file>control</file>、<file>changelog</file>、<file>copyright</file> 和 <file>rules</file>，它們是所有套件必須的。

source: <file>control</file> file
ca: El fitxer <file>control</file>.
es: El archivo <file>control</file>
fr: Fichier <file>control</file>
it: Il file <file>control</file>
ja: <file>control</file>ファイル
zh_cn: <file>control</file> 文件
zh_tw: <file>control</file> 檔案

source: This file contains various values which <prgn>dpkg</prgn>, <prgn>dselect</prgn>, <prgn>apt-get</prgn>, <prgn>apt-cache</prgn>, <prgn>aptitude</prgn>, and other package management tools will use to manage the package. It is defined by the <url id="http://www.debian.org/doc/debian-policy/ch-controlfields.html" name="Debian Policy Manual, 5 'Control files and their fields'">.
ca: La informació d'aquest fitxer es fa servir per <prgn>dpkg</prgn>, <prgn>dselect</prgn>, <prgn>apt-get</prgn>, <prgn>apt-cache</prgn>, <prgn>aptitude</prgn> i altres eines de gestió de paquets. El seu contingut està explicat a <url id="http://www.debian.org/doc/debian-policy/ch-controlfields.html" name="«Debian Policy Manual, 5 'Control files and their fields'»">.
es: Este fichero contiene varios valores que <prgn>dpkg</prgn>, <prgn>dselect</prgn>, <prgn>apt-get</prgn>, <prgn>apt-cache</prgn>, <prgn>aptitude</prgn> y otras herramientas de gestión de paquetes usarán para gestionar el paquete. Su contenido está concretado en <url id="http://www.debian.org/doc/debian-policy/ch-controlfields.html" name="Debian Policy Manual, 5 'Control files and their fields'">.
fr: Ce fichier contient plusieurs valeurs utilisées par <prgn>dpkg</prgn>, <prgn>dselect</prgn>, <prgn>apt-get</prgn>, <prgn>apt-cache</prgn>, <prgn>aptitude</prgn> et d'autres outils de gestions de paquets pour gérer le paquet. Il est défini par la <url id="http://www.debian.org/doc/debian-policy/ch-controlfields.html" name="Charte Debian, 5 « Fichiers de contrôle et leurs champs »">.
it: Questo file contiene diversi valori che <prgn>dpkg</prgn>, <prgn>dselect</prgn>, <prgn>apt-get</prgn>, <prgn>apt-cache</prgn>, <prgn>aptitude</prgn>, ed altri strumenti utilizzeranno per gestire il pacchetto. Il tutto è definito nel <url id="http://www.debian.org/doc/debian-policy/ch-controlfields.html" name="Manuale delle policy di Debian, 5 'File di controllo e loro campi'">.
ja: <prgn>dpkg</prgn>、<prgn>dselect</prgn>、 <prgn>apt-get</prgn>、 <prgn>apt-cache</prgn>、 <prgn>aptitude</prgn>などのパッケージ管理のためのツールが利用する情報は、このファイルに記載されています。詳細は、<url id="http://www.debian.org/doc/debian-policy/ch-controlfields.html" name="Debian Policy Manual, 5 'Control files and their fields'">に定義されています。
zh_cn: 这个文件包含了很多供 <prgn>dpkg</prgn>、<prgn>dselect</prgn>、<prgn>apt-get</prgn>、<prgn>apt-cache</prgn>、<prgn>aptitude</prgn> 等软件包管理工具提取信息以进行管理时所使用的变量。这些变量均在 <url id="http://www.debian.org/doc/debian-policy/ch-controlfields.html" name="Debian Policy Manual, 5 'Control files and their fields'"> 中定义。
zh_tw: 這個檔案包含了很多供 <prgn>dpkg</prgn>、<prgn>dselect</prgn>、<prgn>apt-get</prgn>、<prgn>apt-cache</prgn>、<prgn>aptitude</prgn> 等套件管理工具提取訊息以進行管理時所使用的變量。這些變量均在 <url id="http://www.debian.org/doc/debian-policy/ch-controlfields.html" name="Debian Policy Manual, 5 'Control files and their fields'"> 中定義。

source: Here is the control file <prgn>dh_make</prgn> created for us:
ca: Aquest és el contingut del fitxer «control» generat per <prgn>dh_make</prgn>:
es: Aquí está el fichero de control que <prgn>dh_make</prgn> construye para nosotros:
fr: Le fichier <file>control</file> créé par <prgn>dh_make</prgn> ressemble à :
it: Questo è il file di controllo che <prgn>dh_make</prgn> crea:
ja: 以下は、<prgn>dh_make</prgn> が生成したcontrolファイルのひな型です。
zh_cn: 这是 <prgn>dh_make</prgn> 为我们创建的 <file>control</file> 文件：
zh_tw: 這是 <prgn>dh_make</prgn> 爲我們創建的 <file>control</file> 檔案：

source: 1 Source: gentoo 2 Section: unknown 3 Priority: extra 4 Maintainer: Josip Rodin &lt;joy-mg@debian.org&gt; 5 Build-Depends: debhelper (>= 7.0.50~) 6 Standards-Version: 3.8.4 7 Homepage: &lt;insert the upstream URL, if relevant&gt; 8 9 Package: gentoo 10 Architecture: any 11 Depends: ${shlibs:Depends}, ${misc:Depends} 12 Description: &lt;insert up to 60 chars description&gt; 13 &lt;insert long description, indented with spaces&gt;
ca: 1 Source: gentoo 2 Section: unknown 3 Priority: extra 4 Maintainer: Josip Rodin &lt;joy-mg@debian.org&gt; 5 Build-Depends: debhelper (>= 7.0.50~) 6 Standards-Version: 3.8.4 7 Homepage: &lt;aquí l'URL de l'autor original &gt; 8 9 Package: gentoo 10 Architecture: any 11 Depends: ${shlibs:Depends}, ${misc:Depends} 12 Description: &lt;descripció de fins a 60 caràcters&gt; 13 &lt;descripció llarga, ﻿cada línia amb un espai inicial.&gt;
es: 1 Source: gentoo 2 Section: unknown 3 Priority: extra 4 Maintainer: Josip Rodin &lt;joy-mg@debian.org&gt; 5 Build-Depends: debhelper (>= 7.0.50~) 6 Standards-Version: 3.8.4 7 Homepage: &lt;introduce aquí la URL del autor original &gt; 8 9 Package: gentoo 10 Architecture: any 11 Depends: ${shlibs:Depends}, ${misc:Depends} 12 Description: &lt;insertar hasta 60 caracteres de descripción&gt; 13 &lt;inserta una descripción larga, indentada con espacios.&gt;
fr: 1 Source: gentoo 2 Section: unknown 3 Priority: extra 4 Maintainer: Prénom Nom &lt;votre.adresse.mail@example.org&gt; 5 Build-Depends: debhelper (>= 7.0.50~) 6 Standards-Version: 3.8.4 7 Homepage: &lt;URL amont, si pertinente&gt; 8 9 Package: gentoo 10 Architecture: any 11 Depends: ${shlibs:Depends}, ${misc:Depends} 12 Description: &lt;description courte de 60 caractères au maximum&gt; 13 &lt;description longue, indentée par des espaces&gt;

source: (I've added the line numbers.)
ca: (S'han afegit els números de les línies).
es: (He añadido los números de línea)
fr: (Les numéros de ligne ont été ajoutés.)
it: (Sono stati aggiunti i numeri di riga.)
ja: (行番号は筆者による)
zh_cn: (注：我为它添加了行号。)
zh_tw: (注：我爲它添加了行號。)

source: Lines 1-6 are the control information for the source package.
ca: Les ﻿línies 1 a 6 tenen la informació de control per al paquet font.
es: Las líneas 1 a 6 son la información de control para el paquete fuente.
fr: Les lignes 1 à 6 sont les informations de contrôle pour le paquet source.
it: Le righe 1-6 contengono informazioni di controllo per il pacchetto sorgente.
ja: 1-6 行目は、ソースパッケージの管理情報です。
zh_cn: 第 1-6 行是源代码包的控制信息。
zh_tw: 第 1-6 行是原始碼包的控制訊息。

source: Line 1 is the name of the source package.
ca: La línia 1 és el nom del paquet font.
es: La línea 1 es el nombre del paquete fuente.
fr: La ligne 1 est le nom du paquet source.
it: La riga 1 contiene il nome del pacchetto sorgente.
ja: 1 行目は、ソースパッケージ名です。
zh_cn: 第 1 行是源代码包的名称。
zh_tw: 第 1 行是原始碼包的名稱。

source: Line 2 is the section of the distribution the source package goes into.
ca: La línia 2 és la secció de la distribució a la qual s'assignarà el paquet.
es: La línea 2 es la sección de la distribución dentro de la que estará este paquete.
fr: La ligne 2 est la section de la distribution à laquelle ce paquet appartient.
it: La riga 2 indica la sezione della distribuzione in cui il pacchetto sorgente dovrà andare.
ja: 2 行目は、パッケージが所属するディストリビューション内のセクションです。
zh_cn: 第 2 行是该源码包要进入发行版中的分类。
zh_tw: 第 2 行是該源碼包要進入發行版中的分類。
