Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: If it was packaged with another patch system such as <package>dpatch</package>, <package>dbs</package>, or <package>cdbs</package> with <tt>-p0</tt>, <tt>-p1</tt>, or <tt>-p2</tt>, convert it to the <package>quilt</package> command using <file>deb3</file> at <url id="http://bugs.debian.org/581186">.
ca: Si el paquet s'ha construït amb un altre sistema de pegats com <package>dpatch</package>, <package>dbs</package> o <package>cdbs</package>, fent servir les opcions <tt>-p0</tt>, <tt>-p1</tt> o <tt>-p2</tt>, pots convertir-ho al format <package>quilt</package> fent servir el guió <file>deb3</file> explicat a <url id="http://bugs.debian.org/581186">.
es: Si el paquete se ha construido con sistema de parches distinto como <package>dpatch</package>, <package>dbs</package> o <package>cdbs</package> utilizando las opciones <tt>-p0</tt>, <tt>-p1</tt> o <tt>-p2</tt>, puedes convertirlo al formato <package>quilt</package> utilizando el guión <file>deb3</file> explicado en <url id="http://bugs.debian.org/581186">.
fr: si l'empaquetage a été créé avec un autre système de correctif comme <package>dpatch</package>, <package>dbs</package> ou <package>cdbs</package> avec <tt>-p0</tt>, <tt>-p1</tt> ou <tt>-p2</tt>, convertissez-le à la commande <package>quilt</package> avec <file>deb3</file> disponible en <url id="http://bugs.debian.org/581186"> ;
zh_cn: 如果它使用了其他的补丁系统，例如 <package>dpatch</package>、<package>dbs</package> 或 <package>cdbs</package>，使用 <tt>-p0</tt>、<tt>-p1</tt> 或 <tt>-p2</tt> 级别，使用 <url id="http://bugs.debian.org/581186"> 的 <file>deb3</file> 命令将其转换到 <package>quilt</package> 系统。
zh_tw: 如果它使用了其他的補丁系統，例如 <package>dpatch</package>、<package>dbs</package> 或 <package>cdbs</package>，使用 <tt>-p0</tt>、<tt>-p1</tt> 或 <tt>-p2</tt> 級別，使用 <url id="http://bugs.debian.org/581186"> 的 <file>deb3</file> 命令將其轉換到 <package>quilt</package> 系統。

source: If it was packaged with the <prgn>dh</prgn> command with the "<tt>--with quilt</tt>" option or with the <prgn>dh_quilt_patch</prgn> and <prgn>dh_quilt_unpatch</prgn> commands, remove such things and make it use the newer <tt>3.0 (native)</tt> source format.
ca: Si el paquet s'ha construït executant l'ordre <prgn>dh</prgn> amb l'opció <tt>--with quilt</tt> o amb <prgn>dh_quilt_patch</prgn> i <prgn>dh_quilt_unpatch</prgn>, elimina tot això i fes servir el format <tt>3.0 (native)</tt>.
es: Si el paquete se ha construido con ejecutando la orden <prgn>dh</prgn> con la opción <tt>--with quilt</tt> o bien con <prgn>dh_quilt_patch</prgn> y <prgn>dh_quilt_unpatch</prgn>, elimina todo esto y utiliza el formato <tt>3.0 (native)</tt>.
fr: si l'empaquetage a été créé avec la commande <prgn>dh</prgn> et le paramètre « <tt>--with quilt</tt> » ou les commandes <prgn>dh_quilt_patch</prgn> et <prgn>dh_quilt_unpatch</prgn>, enlevez ces choses et utilisez le nouveau format source <tt>3.0 (native)</tt>.
zh_cn: 如果它使用 <prgn>dh</prgn> 命令的 <tt>--with quilt</tt> 选项，或 <prgn>dh_quilt_patch</prgn> 和 <prgn>dh_quilt_unpatch</prgn> 命令，删除它们并使其使用新的 <tt>3.0 (native)</tt> 源代码包格式。
zh_tw: 如果它使用 <prgn>dh</prgn> 命令的 <tt>--with quilt</tt> 選項，或 <prgn>dh_quilt_patch</prgn> 和 <prgn>dh_quilt_unpatch</prgn> 命令，刪除它們並使其使用新的 <tt>3.0 (native)</tt> 原始碼包格式。

source: You need to do other tasks described in <ref id="newupstream">, too.
ca: Repassa la secció <ref id="newupstream"> per si has de repetir alguns dels passos indicats en aquesta secció
es: Repasa la sección <ref id="newupstream"> por si debes repetir algunos de los pasos indicados en ella.
fr: D'autres tâches décrites en <ref id="newupstream"> sont aussi à effectuer.
it: Ci sarà anche bisogno di eseguire ulteriori operazioni descritte in <ref id="newupstream">.
zh_cn: 当然你还需要按照 <ref id="newupstream"> 完成其他的步骤。
zh_tw: 當然你還需要按照 <ref id="newupstream"> 完成其他的步驟。

source: Reminders for updating packages
ca: Recordatori per actualitzar paquets.
es: Recordatorio para actualizar paquetes
fr: Rappels pour la mise à jour de paquets
it: Note per l'aggiornamento dei pacchetti
ja: パッケージをアップグレードする際の注意点
zh_cn: 对更新软件包的几点提示
zh_tw: 對更新套件的幾點提示

source: Here are few reminders for updating packages.
ca: Aquí tens un llistat de coses a tenir en compte en actualitzar paquets:
es: A continuación se listan algunas cosas a tener en cuenta al actualizar paquetes.
fr: Voici quelques rappels pour la mise à jour de paquets :
it: Vengono qui presentate alcune note per l'aggiornamento dei pacchetti.
ja: パッケージをアップグレードする際の注意点は以下です。
zh_cn: 以下是对更新软件包的几点提示。
zh_tw: 以下是對更新套件的幾點提示。

source: Preserve old <file>changelog</file> entries (sounds obvious, but there have been incidents to type "<tt>dch</tt>" when you should have typed "<tt>dch -i</tt>".)
ca: Conserva les entrades anteriors del fitxer <file>changelog</file> (sona a obvietat, però s'han donat casos d'executar <tt>dch</tt> en lloc de <tt>dch -i</tt>).
es: Conserva las entradas anteriores del archivo <file>changelog</file> (suena a obviedad, pero se han dado casos de ejecutar <tt>dch</tt> en lugar de <tt>dch -i</tt>).
fr: préservez les anciennes entrées <file>changelog</file> (cela va de soit, mais il y a déjà eu des incidents du genre « <tt>dch</tt> » alors qu'il aurait fallu taper « <tt>dch -i</tt> ») ;
zh_cn: 保留旧的 <file>changelog</file> 条目(看似显然，但是总有可能把 <tt>dch -i</tt> 输入为 <tt>dch</tt>)。
zh_tw: 保留舊的 <file>changelog</file> 條目(看似顯然，但是總有可能把 <tt>dch -i</tt> 輸入爲 <tt>dch</tt>)。

source: Existing Debian changes need to be reevaluated; throw away stuff that upstream has incorporated (in one form or another) and remember to keep stuff that hasn't been incorporated by upstream, unless there is a compelling reason not to.
ca: Reconsidera els canvis en la construcció del paquet Debian: elimina les modificacions anteriors (sigui el que sigui) i recorda't d'afegir tot el necessari, sempre que no hi hagi una bona raó per no fer-ho.
es: Los cambios en la construcción del paquete Debian deben ser reconsiderados; elimina las modificaciones anteriores (sea lo que sea) y recuerda de añadir todo lo necesario, a no ser que haya una buena razón para no hacerlo.
fr: les modifications Debian existantes doivent être réévaluées ; jetez tout ce qui a été incorporé en amont (sous une forme ou une autre), et souvenez-vous de garder ce qui ne l'a pas été, à moins qu'il n'y ait une bonne raison de ne pas le faire ;
it: Cambiamenti preesistenti devono essere ricontrollati; si scarti tutto ciò che è stato incorporato in upstream (in una forma o nell'altra) e ci si ricordi di mantenere tutto quello che non è stato incorporato dall'upstream, a meno che non ci sia una buona ragione per non farlo.
zh_cn: 已存在的 Debian 修改需要被重新校验，去除上游已经接受的东西，除非有必要的原因，还要记录尚未被上游接受的部分。
zh_tw: 已存在的 Debian 修改需要被重新校驗，去除上游已經接受的東西，除非有必要的原因，還要記錄尚未被上游接受的部分。

source: If any changes were made to the build system (hopefully you'd know from inspecting upstream changes) then update the <file>debian/rules</file> and <file>debian/control</file> build dependencies if necessary.
ca: Si s'ha realitzat alguna modificació en la compilació (ho veuràs quan inspeccionis els canvis en les fonts originals) pot ser necessari actualitzar el fitxer <file>debian/rules</file> i les dependències de compilació en el fitxer <file>debian/control</file>.
es: Si se ha realizado alguna modificación en la compilación (te enterarás al inspeccionar los cambios en las fuentes originales) puede que sea necesario actualizar el archivo <file>debian/rules</file> y las dependencias de compilación en el archivo <file>debian/control</file>.
fr: si le système de construction a été modifié (avec un peu de chance, vous êtes au courant depuis l'inspection des modifications amont), mettez à jour les dépendances de construction <file>debian/rules</file> et <file>debian/control</file>, si besoin est ;
it: Se è stato fatto qualsiasi cambiamento nel sistema di costruzione del pacchetto (sperabilmente ce se ne renderà conto controllando i cambiamenti dall'originale) allora si aggiorni il file <file>debian/rules</file> e le dipendenze di <file>debian/control</file> se necessario.
zh_cn: 如果对编译系统作出了修改(希望你已经在检查上游变更时了解了这些)，那么要在必要时更新 <file>debian/rules</file> 和 <file>debian/control</file> 编译依赖关系。
zh_tw: 如果對編譯系統作出了修改(希望你已經在檢查上游變更時了解了這些)，那麼要在必要時更新 <file>debian/rules</file> 和 <file>debian/control</file> 編譯依賴關係。

source: Check to see <url id="http://www.debian.org/Bugs/" name="Debian Bug Tracking System (BTS)"> if someone have provided patches to bugs that are currently open in it.
ca: Comprova si hi ha alguna comunicació de pegats del paquet en el sistema de gestió d'errors (algun usuari pot haver construït i enviat un pegat que puguis fer servir) en <url id="http://www.debian.org/Bugs/" name="BTS">.
es: Debes comprobar si hay alguna comunicación de parches del paquete en el sistema de gestión de errores (puede darse el caso que algún usuario envíe un parche ya construido y que te sea de utilidad) en <url id="http://www.debian.org/Bugs/" name="BTS">.
fr: vérifiez dans le <url id="http://www.debian.org/Bugs/" name="système de gestion de bogues (BTS)"> que personne n'a fourni de correctifs aux bogues ouverts ;
it: Si controlli <url id="http://www.debian.org/Bugs/" name="Debian Bug Tracking System (BTS)"> se qualcuno abbia fornito delle patch a bug che sono attualmente aperti.
zh_cn: 检查 <url id="http://www.debian.org/Bugs/" name="Debian Bug Tracking System (BTS)"> 是否有人为某些仍然未修复的 Bug 提供了补丁。
zh_tw: 檢查 <url id="http://www.debian.org/Bugs/" name="Debian Bug Tracking System (BTS)"> 是否有人爲某些仍然未修復的 Bug 提供了補丁。

source: Check the contents of the <file>.changes</file> file to make sure you are uploading to the correct distribution, the proper bugs closures are listed in the <tt>Closes</tt> field, the <tt>Maintainer</tt> and <tt>Changed-By</tt> fields match, the file is GPG-signed, etc.
ca: Comprova el contingut del fitxer <file>.changes</file> per assegurar-te que envies el paquet a la distribució correcta, que els informes d'errors que es tanquen amb la nova versió estan llistats en el camp <tt>Closes</tt>, que el contingut dels camps <tt>Maintainer</tt> i <tt>Changed-By</tt> són correctes, que has signat el fitxer amb la teva clau GPG, etc.
es: Comprueba el contenido del archivo <file>.changes</file> para asegurarte que envías el paquete a la distribución correcta, que los informes de errores que se cierran con la nueva versión del paquete están listados en el campo <tt>Closes</tt> del archivo, que el contenido de los campos <tt>Maintainer</tt> y <tt>Changed-By</tt> son correctos, que has firmado el archivo con tu clave GPG, etc.
fr: vérifiez le contenu du fichier <file>.changes</file> pour vous assurer que vous envoyez vers la bonne distribution, que les rapports de bogues refermés sont correctement listés dans les champs <tt>Closes</tt>, que les champs <tt>Maintainer</tt> et <tt>Changed-By</tt> correspondent, que le fichier est signé avec GPG, etc.
zh_cn: 检查 <file>.changes</file> 文件以确保你正要上传到正确的发行版、正确的列于 <tt>Closes</tt> 域的 Bug、<tt>Maintainer</tt> 和 <tt>Changed-By</tt> 域相匹配，且该文件已经使用 GPG 签署等。
zh_tw: 檢查 <file>.changes</file> 檔案以確保你正要上傳到正確的發行版、正確的列於 <tt>Closes</tt> 域的 Bug、<tt>Maintainer</tt> 和 <tt>Changed-By</tt> 域相匹配，且該檔案已經使用 GPG 簽署等。

source: $ . ~/.bashrc $ cd ~/gentoo/gentoo-0.9.12 $ dh_make -f ../gentoo-0.9.12.tar.gz
es: $ cd ~/gentoo/gentoo-0.9.12 $ dh_make -f ../gentoo-0.9.12.tar.gz

source: The function of <prgn>dh_*</prgn> commands are almost self-evident from their names. <footnote><p>For complete information on what do all these <prgn>dh_*</prgn> scripts exactly do, and what their other options are, please read their respective manual pages and the <package>debhelper</package> documentation.</p></footnote> There are few notable ones worth making (over)simplified explanation here assuming typical build environment based on <file>Makefile</file>. <footnote><p>These commands support other build environments such as <file>setup.py</file> which can be listed by executiong "<tt>dh_auto_build --list</tt>" in a package source directory.</p></footnote>
es: La función de las órdenes <prgn>dh_*</prgn> puede deducirse de su nombre <footnote><p>Para una descripción completa de la función de cada <prgn>dh_*</prgn> y de sus opciones, lee los manuales respectivos así como la documentación de <package>debhelper</package>. </p></footnote>. A continuación se resume las funciones de las órdenes más importantes asumiendo que se utiliza un sistema de compilación basado en un archivo <file>Makefile</file> <footnote><p>La orden permite otros sistemas de compilación como <file>setup.py</file> y que pueden listarse con la ejecución de <tt>dh_auto_build --list</tt> desde el directorio de las fuentes del paquete. </p></footnote>.
fr: Le rôle des commandes <prgn>dh_*</prgn> est presque évident d'après leur nom. <footnote><p>Pour obtenir des informations complètes sur le rôle exact de tout ces scripts <prgn>dh_*</prgn> et sur leurs options, veuillez lire leur page de manuel respective et la documentation de <package>debhelper</package>.</p></footnote> Les plus remarquables d'entre-elles valent la peine d'en faire ici une présentation (très) simplifiée, dans l'hypothèse d'un environnement de construction basé sur <file>Makefile</file> : <footnote><p>Ces commandes gèrent d'autres environnements, comme <file>setup.py</file>, qui peuvent être énumérés en exécutant « <tt>dh_auto_build --list</tt> » dans le répertoire d'un paquet source.</p></footnote>
ja: <prgn>dh_*</prgn>は、名前からその機能がわかるようなものばかりです。<footnote><p><prgn>dh_*</prgn>スクリプトが、実際に何をして、どのようなオプションがあるのかを知りたい場合は、<package>debhelper</package> のマニュアルにある該当ページを参照してください。</p></footnote> ここでは、<file>Makefile</file>をもとに作られたビルド環境を前提にして、簡単な説明を行う価値があるいくつかの特筆すべき項目について述べます。<footnote><p>"<tt>dh_auto_build --list</tt>"</p></footnote>
zh_tw: <prgn>dh_*</prgn> 的功能幾乎都可以通過它的名稱來瞭解。<footnote><p>對於所有的 <prgn>dh_*</prgn> 腳本實際做的工作以及它們可以使用的選項，請閱讀它們的 man 手冊頁和 <package>debhelper</package> 文件。</p></footnote>有幾個命令有很值得一提的內容，在此處默認基於此 <file>Makefile</file> 使用典型的編譯環境。<footnote><p>這些命令支持其他例如 <file>setup.py</file> 的編譯環境，可以通過在套件原始碼目錄執行 <tt>dh_auto_build --list</tt> 列出。</p></footnote>

source: Making a Debian Package (AKA the Debmake Manual), copyright &copy; 1997 Jaldhar Vyas.
fr: Making a Debian Package (le manuel de debmake), copyright &copy; 1997 Jaldhar Vyas.
it: Making a Debian Package (noto come Manuale di Debmake), copyright &copy; 1997 Jaldhar Vyas.
ja: Debian パッケージの作り方 (Debmake マニュアル)、Copyright &copy; 1997 Jaldhar Vyas.

source: One of the things that makes Debian such a top-notch Linux distribution is its package system. While there is a vast quantity of software already in the Debian format, sometimes you need to install software that isn't. You may be wondering how you can make your own packages and perhaps you think it is a very difficult task. Well, if you are a real novice on Linux, it is hard, but if you were rookie, you wouldn't be reading this doc now. :-) You do need to know a little about Unix programming but you certainly don't need to be a wizard.
fr: Une des choses qui font de Debian une distribution de si haut niveau est son système de paquets. Bien qu'il existe une grande quantité de logiciels au format Debian, vous devrez parfois installer un logiciel qui ne l'est pas. Vous pouvez vous demander comment faire vos propres paquets et peut-être pensez-vous que c'est une tâche très difficile. Eh bien, si vous êtes vraiment un débutant sous Linux, c'est dur, mais si vous étiez un débutant, vous ne seriez pas en train de lire ce document. :-) Vous devez en savoir un peu sur la programmation Unix, mais vous n'avez certainement pas besoin d'être un magicien.
it: Una delle cose che rende Debian una delle distribuzioni GNU/Linux più importanti, è il suo sistema di pacchettizzazione. Sebbene ci sia una vasta quantità di software disponibile sotto forma di pacchetto Debian, qualche volta è necessario installare del software per il quale non è stato ancora creato il pacchetto. Si potrebbe pensare che creare dei pacchetti sia un compito molto difficile. In effetti, se si è alle prime armi con GNU/Linux è dura, ma se si ha esperienza non si può non leggere questo documento. :-) Servirà conoscere dei rudimenti di programmazione Unix, ma di sicuro non sarà necessario essere un mago della programmazione.
zh_tw: Debin 能夠成爲一個頂級的 Linux 發行版的原因之一就是它的套件系統。儘管相當數量的軟體已經被以 Debian 格式打包，有時還是需要安裝一些不是這一格式的軟體。可能你會爲如何製作自己的套件而迷惑，並可能認爲這是很困難的任務。是的，如果你是一個 Linux 初學者，那麼這的確很難；不過如果你真的只是一個新手，現在也不會來讀這篇文件了。:-) 你的確需要對 Unix 編程有所瞭解，但顯然不需要是這方面的天才。

source: For the <tt>contrib</tt> section, it must be compliant to all the DSFG but it may require a package outside of <tt>main</tt> for compilation or execution.
fr: pour la section <tt>contrib</tt> (contributions), il doit être conforme à tous les DFSG mais peut dépendre de paquets hors de <tt>main</tt> pour la compilation ou l'exécution ;
zh_tw: 對於 <tt>contrib</tt> 類的軟體，其許可證必須滿足 DFSG 的全部條件，但可以依賴於 <tt>main</tt> 之外的套件以完成編譯或運行。

source: For the <tt>non-free</tt> section, it may not be compliant to some of the DSFG but it <strong>must be distributable</strong>.
fr: pour la section <tt>non-free</tt> (non libre), il peut être non conforme à certaines DFSG mais <strong>doit être distribuable</strong>.
it: I programmi nella sezione <tt>non-free</tt>, possono non essere conformi alle DSFG, ma <strong>devono poter essere distribuibili</strong>.
zh_tw: 對於 <tt>non-free</tt> 類的軟體，其許可證可以不滿足 DFSG 中的一些條件，但至少需要是 <strong>可以散佈的</strong>。

source: Let's set up the Bash shell environment variable <tt>$DEBEMAIL</tt> and <tt>$DEBFULLNAME</tt> so many Debian maintenance tools recognize your name and email address to use for packages as follows.
fr: Configurez les variables d'environnement de l'interpréteur de commandes Bash <tt>$DEBEMAIL</tt> et <tt>$DEBFULLNAME</tt> de tel sorte que les nombreux outils de maintenance Debian identifient vos nom et adresse électronique comme suit :
it: Una delle prime cose da fare è impostare le variabili d'ambiente <tt>$DEBEMAIL</tt> e <tt>$DEBFULLNAME</tt> visto che molti strumenti di gestione di Debian usano queste variabili per recuperare il nome e l'email da utilizzare nei pacchetti. Ecco come fare.
ja: 次のようにして、Bash シェルの環境変数 <tt>$DEBEMAIL</tt> と <tt>$DEBFULLNAME</tt> を設定して、パッケージに使うあなたの名前と email アドレスを、多くの Debian メンテナンスツールが認識できるようにしましょう：
zh_tw: 首先我們設置兩個 Bash 環境變量，<tt>$DEBEMAIL</tt> 和 <tt>$DEBFULLNAME</tt>，使多數 Debian 維護工具能夠正確識別你用於維護套件的姓名和電子郵件地址。

source: d=. ; while [ ! -d "$d/debian" -a `readlink -e $d` != / ]; do d="$d/.."; done if [ -d "$d/debian" ] && [ -z "$QUILT_PATCHES" ]; then # Debian packaging case and unset $QUILT_PATCHES QUILT_PATCHES=debian/patches QUILT_PATCH_OPTS="--unified-reject-files" QUILT_DIFF_ARGS="-p ab --no-timestamps --no-index --color=auto" QUILT_REFRESH_ARGS="-p ab --no-timestamps --no-index" QUILT_COLORS="diff_hdr=1;32:diff_add=1;34:diff_rem=1;31:diff_hunk=1;33:diff_ctx=35:diff_cctx=33" if ! [ -d $d/debian/patches ]; then mkdir $d/debian/patches; fi fi
fr: d=. ; while [ ! -d "$d/debian" -a `readlink -e $d` != / ]; do d="$d/.."; done if [ -d "$d/debian" ] && [ -z "$QUILT_PATCHES" ]; then # Cas d'empaquetage Debian avec $QUILT_PATCHES non configuré QUILT_PATCHES=debian/patches QUILT_PATCH_OPTS="--unified-reject-files" QUILT_DIFF_ARGS="-p ab --no-timestamps --no-index --color=auto" QUILT_REFRESH_ARGS="-p ab --no-timestamps --no-index" QUILT_COLORS="diff_hdr=1;32:diff_add=1;34:diff_rem=1;31:diff_hunk=1;33:diff_ctx=35:diff_cctx=33" if ! [ -d $d/debian/patches ]; then mkdir $d/debian/patches; fi fi

source: $ dpkg -S libfoo.so.6
fr: $ dpkg -S libtoto.so.6

source: 1 Source: gentoo 2 Section: x11 3 Priority: optional 4 Maintainer: Josip Rodin &lt;joy-mg@debian.org&gt; 5 Build-Depends: debhelper (>= 7.0.5), xlibs-dev, libgtk1.2-dev, libglib1.2-dev 6 Standards-Version: 3.8.4 7 Vcs-Git: git://git.debian.org/git/collab-maint/gentoo.git 8 Vcs-browser: http://git.debian.org/?p=collab-maint/gentoo.git 9 Homepage: http://www.obsession.se/gentoo/ 10 11 Package: gentoo 12 Architecture: any 13 Depends: ${shlibs:Depends}, ${misc:Depends} 14 Suggests: file 15 Description: fully GUI-configurable, two-pane X file manager 16 gentoo is a two-pane file manager for the X Window System. gentoo lets the 17 user do (almost) all of the configuration and customizing from within the 18 program itself. If you still prefer to hand-edit configuration files, 19 they're fairly easy to work with since they are written in an XML format. 20 . 21 gentoo features a fairly complex and powerful file identification system, 22 coupled to a object-oriented style system, which together give you a lot 23 of control over how files of different types are displayed and acted upon. 24 Additionally, over a hundred pixmap images are available for use in file 25 type descriptions. 26 . 29 gentoo was written from scratch in ANSI C, and it utilises the GTK+ toolkit 30 for its interface.
fr: 1 Source: gentoo 2 Section: x11 3 Priority: optional 4 Maintainer: Prénom Nom &lt;votre.adresse.mail@example.org&gt; 5 Build-Depends: debhelper (>= 7.0.5), xlibs-dev, libgtk1.2-dev, libglib1.2-dev 6 Standards-Version: 3.8.4 7 Vcs-Git: git://git.debian.org/git/collab-maint/gentoo.git 8 Vcs-browser: http://git.debian.org/?p=collab-maint/gentoo.git 9 Homepage: http://www.obsession.se/gentoo/ 10 11 Package: gentoo 12 Architecture: any 13 Depends: ${shlibs:Depends}, ${misc:Depends} 14 Suggests: file 15 Description: fully GUI-configurable, two-pane X file manager 16 gentoo is a two-pane file manager for the X Window System. gentoo lets the 17 user do (almost) all of the configuration and customizing from within the 18 program itself. If you still prefer to hand-edit configuration files, 19 they're fairly easy to work with since they are written in an XML format. 20 . 21 gentoo features a fairly complex and powerful file identification system, 22 coupled to a object-oriented style system, which together give you a lot 23 of control over how files of different types are displayed and acted upon. 24 Additionally, over a hundred pixmap images are available for use in file 25 type descriptions. 26 . 29 gentoo was written from scratch in ANSI C, and it utilises the GTK+ toolkit 30 for its interface.
