Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: This will allow you to sign generated packages with your secret GPG key in the <file>~/.gnupg/</file> directory.
ca: Així signaràs els paquets amb la teva clau GPG emmagatzemada en el directori <file>~/.gnupg/</file>.
es: Así podrás firmar los paquetes con tu clave GPG almacenada en el directorio <file>~/.gnupg/</file>.
fr: Les paquets créés seront alors signés avec votre clé GPG du répertoire <file>~/.gnupg/</file>.
it: Questo permetterà di firmare i pacchetti generati con la tua chiave GPG segreta situata nella directory <file>~/.gnupg/</file>.
ja: これにより、<file>~/.gnupg/</file>ディレクトリにある、あなたのGPGキーで生成されたパッケージへの署名を許可します。
zh_cn: 这使你可以使用 <file>~/.gnupg/</file> 目录中的 GPG 私钥签署生成的软件包。
zh_tw: 這使你可以使用 <file>~/.gnupg/</file> 目錄中的 GPG 私鑰簽署生成的套件。

source: Let's then initialize the local <package>pbuilder</package> <prgn>chroot</prgn> system first as follows.
ca: Ara pots inicialitzar el sistema local <package>pbuilder</package> <prgn>chroot</prgn> per primera vegada executant:
es: Ahora puedes inicializar el sistema local <package>pbuilder</package> <prgn>chroot</prgn> por primera vez ejecutando:
fr: Le système <prgn>chroot</prgn> local de <package>pbuilder</package> doit d'abord être initialisé :
it: Si avvii <package>pbuilder</package> per costruire l'ambiente <prgn>chroot</prgn> locale, come segue.
ja: それでは、初めてのローカル<package>pbuilder</package> <prgn>chroot</prgn> システムを初期化しましょう。
zh_cn: 使用以下命令初始化 <package>pbuilder</package> <prgn>chroot</prgn> 系统：
zh_tw: 使用以下命令初始化 <package>pbuilder</package> <prgn>chroot</prgn> 系統：

source: If you already have the completed source packages, issue the following commands in the directory where the <file><var>foo</var>.orig.tar.gz</file>, <file><var>foo</var>.debian.tar.gz</file>, and <file><var>foo</var>.dsc</file> files exist to update the local <package>pbuilder</package> <prgn>chroot</prgn> system and to build binary packages in it.
ca: Si treballes amb un paquet font complet, executa les següents ordres en el directori on tenguis els fitxers <file><var>nom_paquet</var>.orig.tar.gz</file>, <file><var>nom_paquet</var>.debian.tar.gz</file> i <file><var>nom_paquet</var>.dsc</file> per actualitzar el sistema local <package>pbuilder</package> <prgn>chroot</prgn> i, a continuació, compilar el paquet binari:
es: Si ya dispones de un paquete fuente completo, ejecuta las siguientes órdenes en el directorio donde tengas los archivos <file><var>nombre_del_paquete</var>.orig.tar.gz</file>, <file><var>nombre_del_paquete</var>.debian.tar.gz</file> y <file><var>nombre_del_paquete</var>.dsc</file> para actualizar el sistema local <package>pbuilder</package> <prgn>chroot</prgn> y, a continuación, compilar el paquete binario en él:
fr: Si vous possédez déjà les paquets sources terminés, exécutez les commande suivantes dans le répertoire contenant les fichiers <file><var>toto</var>.orig.tar.gz</file>, <file><var>toto</var>.debian.tar.gz</file>, et <file><var>toto</var>.dsc</file> pour mettre à jour le système <prgn>chroot</prgn> de <package>pbuilder</package> et y construire les paquets binaires :
it: Se si hanno già i pacchetti sorgenti, eseguire i seguenti comandi nella directory in cui si trovano i file <file><var>foo</var>.orig.tar.gz</file>, <file><var>foo</var>.debian.tar.gz</file>, e <file><var>foo</var>.dsc</file> per aggiornare l'ambiente <prgn>chroot</prgn> di <package>pbuilder</package> e per costruirci dentro il pacchetto binario.
ja: 既に完全なソースパッケージがあれば、<file><var>foo</var>.orig.tar.gz</file>ファイル、 <file><var>foo</var>.debian.tar.gz</file>ファイル、<file><var>foo</var>.dsc</file>ファイルが存在するディレクトリで、ローカル<package>pbuilder</package> <prgn>chroot</prgn>システムをアップデートし、バイナリパッケージをビルドする為に以下のコマンドを発行しましょう。
zh_cn: 如果你已经创建了源代码包，在包含 <file><var>foo</var>.orig.tar.gz</file>、<file><var>foo</var>.debian.tar.gz</file> 和 <file><var>foo</var>.dsc</file> 文件的目录中执行下面的命令来更新 <package>pbuilder</package> <prgn>chroot</prgn> 系统以便执行构建。
zh_tw: 如果你已經創建了原始碼包，在包含 <file><var>foo</var>.orig.tar.gz</file>、<file><var>foo</var>.debian.tar.gz</file> 和 <file><var>foo</var>.dsc</file> 檔案的目錄中執行下面的命令來更新 <package>pbuilder</package> <prgn>chroot</prgn> 系統以便執行構建。

source: $ sudo pbuilder --update $ sudo pbuilder --build <var>foo</var>.dsc
ca: $ sudo pbuilder --update $ sudo pbuilder --build <var>nom_paquet</var>.dsc
es: $ sudo pbuilder --update $ sudo pbuilder --build <var>nombre_del_paquete</var>.dsc
fr: $ sudo pbuilder --update $ sudo pbuilder --build <var>toto</var>.dsc

source: $ sudo pbuilder --build --debbuildopts "-sa" <var>foo</var>.dsc
ca: $ sudo pbuilder --build --debbuildopts "-sa" <var>nom_paquet</var>.dsc
es: $ sudo pbuilder --build --debbuildopts "-sa" <var>nombre_del_paquete</var>.dsc
fr: $ sudo pbuilder --build --debbuildopts "-sa" <var>toto</var>.dsc

source: The newly built packages will be located in <file>/var/cache/pbuilder/result/</file> with non-root ownership.
ca: En acabar la compilació, el paquet compilat estarà en el directori <file>/var/cache/pbuilder/result/</file> i tu en seràs el propietari.
es: Una vez finalizada la compilación, el paquete compilado estará en el directorio <file>/var/cache/pbuilder/result/</file> cuyo propietario será tu usuario en lugar del usuario administrador.
fr: Les paquets nouvellement créés sont accessibles en <file>/var/cache/pbuilder/result/</file> et n'appartiennent pas au superutilisateur.
it: Il nuovo pacchetto sarà creato nella directory <file>/var/cache/pbuilder/result/</file> con proprietà non assegnata all'utente root.
ja: 新しくビルドしたパッケージは非ルート所有者として<file>/var/cache/pbuilder/result/</file>に置かれます。
zh_cn: 新构建的软件包将被放置于 <file>/var/cache/pbuilder/result/</file> 且属主不是 root。
zh_tw: 新構建的套件將被放置於 <file>/var/cache/pbuilder/result/</file> 且屬主不是 root。

source: If you already have the updated source tree without generating the matching source packages, issue the following commands in the source directory where the <file>debian</file> directory exists, instead.
ca: Si en lloc d'iniciar la construcció del paquet a partir d'un paquet ja construït, disposes d'un directori amb les fonts originals actualitzades, hauràs d'executar les següents ordres des del directori de les fonts originals (on hi haurà el directori <file>debian</file> amb el seu contingut):
es: Si en lugar de iniciar la construcción del paquete a partir de un paquete ya construido, dispones de un directorio con las fuentes originales actualizadas, deberás ejecutar las siguientes órdenes desde el directorio de las fuentes originales (y en el que deberá estar presente el directorio <file>debian</file> con todo su contenido):
fr: Si vous possédez déjà l'arborescence des sources à jour, sans avoir créé les paquets sources correspondants, exécutez plutôt les commande suivantes dans le répertoire des sources avec le répertoire <file>debian</file> :
it: Se si ha già l'albero dei sorgenti aggiornato, senza generare i rispettivi pacchetti sorgenti, eseguire i seguenti comandi nella directory dei sorgenti in cui si trova il file <file>debian</file>.
ja: 更新されたソースツリーが既にあり、一致するソースパッケージを生成していない場合は、代わりに、<file>debian</file> ディレクトリが存在するディレクトリで、以下のコマンドを発行します。
zh_cn: 如果你已经更新了源代码树但没有生成对应的源代码包，在存放 <file>debian</file> 目录的目录里执行：
zh_tw: 如果你已經更新了原始碼樹但沒有生成對應的原始碼包，在存放 <file>debian</file> 目錄的目錄裏執行：

source: You can log into its <prgn>chroot</prgn> environment with the "<tt>pbuilder --login --save-after-login</tt>" command and configure it as you wish. This environment can be saved by leaving its shell prompt with <tt>^D</tt> (Control-D).
ca: Pots «connectar-te» a l'entorn <prgn>chroot</prgn> executant l'ordre <tt>pbuilder --login --save-after-login</tt> i configurar-lo per adaptar-lo a les teves necessitats. Aquest entorn pot desar-se sortint del «shell» amb <tt>^D</tt> (Control-D).
es: Puedes «conectarte» al entorno <prgn>chroot</prgn> ejecutando la orden <tt>pbuilder --login --save-after-login</tt> y configurarlo para adaptarlo a tus necesidades. Este entorno puede guardarse saliendo del «shell» con <tt>^D</tt> (Control-D).
fr: Vous pouvez vous connecter à l'environnement <prgn>chroot</prgn> avec la commande « <tt>pbuilder --login --save-after-login</tt> » et le configurer à votre convenance. Cet environnement peut être sauvegardé en quittant l'invite de commande avec <tt>^D</tt> (Contrôle-D).
it: È possibile accedere all'ambiente <prgn>chroot</prgn> con il comando "<tt>pbuilder --login --save-after-login</tt>" e configurarlo come si vuole. Questo ambiente può essere salvato, semplicemente uscendo dalla shell con <tt>^D</tt> (Control-D).
ja: "<tt>pbuilder --login --save-after-login</tt>"コマンドで、<prgn>chroot</prgn>環境にログインし、好きに設定することができます。シェルプロンプトから<tt>^D</tt> (Control-D)で抜けると、その環境を保存しておくことができます。
zh_cn: 你可以使用 <tt>pbuilder --login --save-after-login</tt> 命令登录到这个 <prgn>chroot</prgn> 环境中并按照需要对其进行配置。通过 <tt>^D</tt> (Control-D)离开这个 shell 时环境会被保存。
zh_tw: 你可以使用 <tt>pbuilder --login --save-after-login</tt> 命令登錄到這個 <prgn>chroot</prgn> 環境中並按照需要對其進行設定。通過 <tt>^D</tt> (Control-D)離開這個 shell 時環境會被保存。

source: The latest version of the <prgn>lintian</prgn> command can be executed in the <tt>chroot</tt> environment using the hook script <file><var>/var/cache/pbuilder/hooks</var>/B90lintian</file> configured as follows. <footnote><p>This assumes <tt>HOOKDIR="/var/cache/pbuilder/hooks"</tt>. You can find many examples of the hook script in the <file>/usr/share/doc/pbuilder/examples</file> directory.</p></footnote>
ca: La darrera versió de l'ordre <prgn>lintian</prgn> pot executar-se automàticament en l'entorn <tt>chroot</tt> fent servir el guió «hook» disponible a <file><var>/var/cache/pbuilder/hooks</var>/B90lintian</file> i configurat de la següent manera <footnote><p>Se suposa que la variable d'entorn <tt>HOOKDIR="/var/cache/pbuilder/hooks"</tt> ja està configurada. Tens exemples a <file>/usr/share/doc/pbuilder/examples</file>. </p></footnote>:
es: La última versión de la orden <prgn>lintian</prgn> puede ejecutarse automáticamente en el entorno <tt>chroot</tt> utilizando el guión «hook» disponible en <file><var>/var/cache/pbuilder/hooks</var>/B90lintian</file> y configurado como sigue <footnote><p>Se supone que la variable de entorno <tt>HOOKDIR="/var/cache/pbuilder/hooks"</tt> ya está configurada. Puedes consultar otros ejemplos en <file>/usr/share/doc/pbuilder/examples</file>. </p></footnote>:
fr: La dernière version de la commande <prgn>lintian</prgn> peut être exécutée dans l'environnement <tt>chroot</tt> en utilisant le script hook <file><var>/var/cache/pbuilder/hooks</var>/B90lintian</file> configuré comme suit : <footnote><p>Il est supposé que <tt>HOOKDIR="<var>/var/cache/pbuilder/hooks</var>"</tt> est déjà configuré. De nombreux exemples de scripts hook sont disponibles dans le répertoire <file>/usr/share/doc/pbuilder/examples</file>.</p></footnote>
ja: 最新の<prgn>lintian</prgn>コマンドは<tt>chroot</tt>環境から次のように設定されたフックスクリプト<file><var>/var/cache/pbuilder/hooks</var>/B90lintian</file>を使用して実行することができます。<footnote><p><tt>HOOKDIR="/var/cache/pbuilder/hooks"</tt>に設定した場合。フックスクリプトのサンプルは<file>/usr/share/doc/pbuilder/examples</file> ディレクトリににあります。</p></footnote>
zh_cn: 最新版的 <prgn>lintian</prgn> 命令可以通过设置钩子脚本 <file><var>/var/cache/pbuilder/hooks</var>/B90lintian</file> 在 <tt>chroot</tt> 环境中运行。脚本内容如下：<footnote><p>此处默认 <tt>HOOKDIR="/var/cache/pbuilder/hooks"</tt>。你可以在 <file>/usr/share/doc/pbuilder/examples</file> 目录中找到很多钩子脚本的例子。</p></footnote>
zh_tw: 最新版的 <prgn>lintian</prgn> 命令可以通過設置鉤子腳本 <file><var>/var/cache/pbuilder/hooks</var>/B90lintian</file> 在 <tt>chroot</tt> 環境中運行。腳本內容如下：<footnote><p>此處默認 <tt>HOOKDIR="/var/cache/pbuilder/hooks"</tt>。你可以在 <file>/usr/share/doc/pbuilder/examples</file> 目錄中找到很多鉤子腳本的例子。</p></footnote>

source: #!/bin/sh set -e install_packages() { apt-get -y --force-yes install "$@" } install_packages lintian echo "+++ lintian output +++" su -c "lintian -i -I --show-overrides /tmp/buildd/*.changes" - pbuilder # use this version if you don't want lintian to fail the build #su -c "lintian -i -I --show-overrides /tmp/buildd/*.changes; :" - pbuilder echo "+++ end of lintian output +++"
ca: #!/bin/sh set -e install_packages() { apt-get -y --force-yes install "$@" } install_packages lintian echo "+++ informe de lintian +++" su -c "lintian -i -I --show-overrides /tmp/buildd/*.changes" - pbuilder # si vols evitar que lintian aturi la construcció fes servir el següent #su -c "lintian -i -I --show-overrides /tmp/buildd/*.changes; :" - pbuilder echo "+++ final de l'informe de lintian +++"«
es: #!/bin/sh set -e install_packages() { apt-get -y --force-yes install "$@" } install_packages lintian echo "+++ informe de lintian +++" su -c "lintian -i -I --show-overrides /tmp/buildd/*.changes" - pbuilder # si quieres evitar que lintian pare la construcción utiliza lo siguiente #su -c "lintian -i -I --show-overrides /tmp/buildd/*.changes; :" - pbuilder echo "+++ final del informe de lintian +++"
fr: #!/bin/sh set -e install_packages() { apt-get -y --force-yes install "$@" } install_packages lintian echo "+++ début de lintian +++" su -c "lintian -i -I --show-overrides /tmp/buildd/*.changes" - pbuilder # utilisez ceci si vous ne voulez pas que lintian arrête la construction #su -c "lintian -i -I --show-overrides /tmp/buildd/*.changes; :" - pbuilder echo "+++ fin de lintian +++"

source: You need to have access to the latest <tt>sid</tt> environment to build packages properly for <tt>sid</tt>. In reality, <tt>sid</tt> may be experiencing issues which makes it not desirable for you to migrate your whole system. The <package>pbuilder</package> package can help you to cope with this kind of situation.
ca: Has de tenir un entorn <tt>sid</tt> actualitzat per construir correctament paquets per a <tt>sid</tt>. En realitat, la versió <tt>sid</tt> pot tenir errades que no fan recomanable la migració del teu sistema en aquesta versió. El paquet <package>pbuilder</package> t'ajuda a fer front en aquesta situació.
es: Debes tener un entorno <tt>sid</tt> actualizado para construir correctamente paquetes para <tt>sid</tt>. En realidad, al versión <tt>sid</tt> puede contener errores que no hacen recomendable la migración de tu sistema a esta versión. El paquete <package>pbuilder</package> te ayuda a hacer frente a esta situación.
fr: Un environnement <tt>sid</tt> à jour est nécessaire pour construire correctement les paquet destinés à <tt>sid</tt>. En fait, <tt>sid</tt> peut parfois être victime de problèmes qui peuvent rendre non souhaitable la migration de votre système complet. Le paquet <package>pbuilder</package> peut vous aider à faire face à ce genre de situation.
ja: <tt>sid</tt>環境向けのパッケージを正しくビルドするには最新の<tt>sid</tt>環境が必要です。<tt>sid</tt>には環境を移行するには望ましくない問題を抱えていることが少なくありません。<package>pbuilder</package>パッケージはそのような状況に対処できるようになっています。
zh_cn: 为 <tt>sid</tt> 编译软件包需要使用 <tt>sid</tt> 环境。在现实中 <tt>sid</tt> 存在很多问题以至于你不愿意将整个系统都迁移到其上。<package>pbuilder</package> 可以在这种情况下很好地解决问题。
zh_tw: 爲 <tt>sid</tt> 編譯套件需要使用 <tt>sid</tt> 環境。在現實中 <tt>sid</tt> 存在很多問題以至於你不願意將整個系統都遷移到其上。<package>pbuilder</package> 可以在這種情況下很好地解決問題。

source: You may need to update your <tt>stable</tt> packages after their release for <tt>stable-proposed-updates</tt>, <tt>stable/updates</tt>, etc. <footnote><p>There are some restrictions for such updates of your <tt>stable</tt> package.</p></footnote> For such occasions, "I am running <tt>sid</tt> system" is not good enough excuse not to update them promptly. The <package>pbuilder</package> package can help you to access environments of almost any Debian derivative distributions of the same CPU architecture.
ca: És possible que hagis d'actualitzar el paquet per a la versió <tt>stable</tt> després de distribuir-lo per a <tt>stable-proposed-updates</tt>, <tt>stable/updates</tt>, etc <footnote><p>Hi ha restriccions per a aquestes actualitzacions del teu paquet per a la versió <tt>stable</tt>. </p></footnote>. En algunes ocasions, «Jo treballo amb la versió <tt>sid</tt>» pot no ésser una excusa per deixar d'actualitzar el paquet. El paquet <package>pbuilder</package> t'ajuda a treballar en entorns per a totes les distribucions derivades Debian en una arquitectura determinada.
es: Es posible que debas actualizar tu paquete <tt>stable</tt> después de distribuirlo para <tt>stable-proposed-updates</tt>, <tt>stable/updates</tt>, etc <footnote><p>Hay algunas restricciones para estas actualizaciones de tu paquete <tt>stable</tt>. </p></footnote>. En algunas ocasiones, «Yo trabajo con la versión <tt>sid</tt>» puede no ser una excusa para dejar de actualizar el paquete. El paquete <package>pbuilder</package> te ayuda trabajar en entornos para todas las distribuciones derivadas Debian para una arquitectura determinada.
fr: Vous pouvez avoir besoin de mettre à jour vos paquets <tt>stable</tt> après sa publication à destination de <tt>stable-proposed-updates</tt>, <tt>stable/updates</tt>, etc. <footnote><p>Il existe des restrictions pour de telles mises à jour de paquet <tt>stable</tt>.</p></footnote> Dans ces cas-là, « j'utilise <tt>sid</tt> » est une mauvaise excuse pour ne pas les mettre à jour au plus tôt. Le paquet <package>pbuilder</package> vous permet d'accéder à la plupart des distributions dérivées de Debian pour la même architecture de microprocesseur.
ja: <tt>stable/updates</tt>や<tt>stable-proposed-updates</tt>がリリースされた後、<tt>stable</tt>パッケージのアップデートが必要な場合があります。<footnote><p><tt>stable</tt> パッケージのそのようなアップデートには制限が課せられます。</p></footnote>そのような場合に、 即座にアップデートしない言い訳として"<tt>sid</tt> を使っているから" というのは不十分です。<package>pbuilder</package>パッケージは、同じCPUアーキテクチャのほぼ全てのDebian派生であるディストリビューションへのアクセスを手助けします。
zh_cn: 你可能需要通过 <tt>stable-proposed-updates</tt>、<tt>stable/updates</tt> 等升级你的 <tt>stable</tt> 软件包。<footnote><p>升级你的 <tt>stable</tt> 软件包有规定限制。</p></footnote>对于这类情况，“我正在运行 <tt>sid</tt> 系统” 并不是你不为它们进行升级的充分理由。<package>pbuilder</package> 软件包可以帮助你使用到相同 CPU 构架下几乎所有 Debian 和 Debian 衍生版系统。
zh_tw: 你可能需要通過 <tt>stable-proposed-updates</tt>、<tt>stable/updates</tt> 等升級你的 <tt>stable</tt> 套件。<footnote><p>升級你的 <tt>stable</tt> 套件有規定限制。</p></footnote>對於這類情況，“我正在運行 <tt>sid</tt> 系統” 並不是你不爲它們進行升級的充分理由。<package>pbuilder</package> 套件可以幫助你使用到相同 CPU 構架下幾乎所有 Debian 和 Debian 衍生版系統。

source: See <url id="&pbuilder-home;">, <manref section="1" name="pdebuild">, <manref section="5" name="pbuilderrc">, and <manref section="8" name="pbuilder">.
ca: Consulta <url id="&pbuilder-home;">, <manref section="1" name="pdebuild">, <manref section="5" name="pbuilderrc">, i <manref section="8" name="pbuilder">.
es: Consulta <url id="&pbuilder-home;">, <manref section="1" name="pdebuild">, <manref section="5" name="pbuilderrc">, y <manref section="8" name="pbuilder">.
fr: Voir <url id="&pbuilder-home;">, <manref section="1" name="pdebuild">, <manref section="5" name="pbuilderrc">, et <manref section="8" name="pbuilder"> .
it: Vedere <url id="&pbuilder-home;">, <manref section="1" name="pdebuild">, <manref section="5" name="pbuilderrc">, e <manref section="8" name="pbuilder">.
ja: 詳しくは、<url id="&pbuilder-home;">、<manref section="1" name="pdebuild">、<manref section="5" name="pbuilderrc">、<manref section="8" name="pbuilder">を参照してください。
zh_cn: 参看 <url id="&pbuilder-home;">、<manref section="1" name="pdebuild">、<manref section="5" name="pbuilderrc"> 和 <manref section="8" name="pbuilder">
zh_tw: 參考 <url id="&pbuilder-home;">、<manref section="1" name="pdebuild">、<manref section="5" name="pbuilderrc"> 和 <manref section="8" name="pbuilder">

source: <prgn>git-buildpackage</prgn> command and similars
ca: L'ordre <prgn>git-buildpackage</prgn> i semblants.
es: La orden <prgn>git-buildpackage</prgn> y similares
fr: Commande git-buildpackage et similaires
it: Il comando <prgn>git-buildpackage</prgn> ed altri simili
ja: <prgn>git-buildpackage</prgn>コマンドとその仲間
zh_cn: <prgn>git-buildpackage</prgn> 和相似命令
zh_tw: <prgn>git-buildpackage</prgn> 和相似命令

source: If your upstream uses the source code management system (<url id="http://www.debian.org/doc/manuals/debian-reference/ch10.en.html#_version_control_systems" name="VCS">) to maintain their code, you should consider to use them. That makes merging and cherry-picking upstream patches much easier. There are several specialized wrapper script packages for the Debian package building for each VCS.
ca: Si l'autor original fa servir un sistema de gestió de versions per al codi (<url id="http://www.debian.org/doc/manuals/debian-reference/ch10.en.html#_version_control_systems" name="VCS">) pots considerar fer-ho servir. Així facilites la coordinació i la selecció dels pegats per a les fonts. Debian disposa de diversos paquets de guions especialitzats en cada tipus de VCS:
es: Si el autor original utiliza un sistema de gestión de versiones para el código (<url id="http://www.debian.org/doc/manuals/debian-reference/ch10.en.html#_version_control_systems" name="VCS">) puedes considerar utilizarlo. Así se facilita la coordinación y la selección de los parches en las fuentes. Debian dispone de varios paquetes de guiones especializados en cada tipos de VCS:
fr: Si les développeurs amont utilisent un système de gestion de version (<url id="http://www.debian.org/doc/manuals/debian-reference/ch10.fr.html#_version_control_systems" name="VCS">) pour maintenir leur code source, vous devriez envisager de l'utiliser. Cela rend la fusion et la sélection (« cherry-picking ») des correctifs amont plus facile. De nombreux paquets de scripts d'enrobage sont disponibles pour la construction de paquets Debian pour chaque système de gestion de version :
it: Se l'autore originale utilizza un sistema di controllo di versione (<url id="http://www.debian.org/doc/manuals/debian-reference/ch10.en.html#_version_control_systems" name="VCS">) per gestire il proprio codice, si dovrebbe prendere in considerazione di usarlo. Questo rende molto più semplice la fusione e la raccolta di patch dai sorgenti originali. Ci sono diversi pacchetti di script adatti alla costruzione di pacchetti Debian per ogni sistema VCS.
ja: 上流がソースコード管理システム(<url id="http://www.debian.org/doc/manuals/debian-reference/ch10.en.html#_version_control_systems" name="VCS">)を使っているのであれば、同様に使用することを考えるべきです。それによって、マージと上流パッチの取捨選択がより簡単になります。DebianパッケージをVCS用にビルドするための特別なラッパースクリプトのパッケージもいくつかあります。
zh_cn: 如果你的上游对源代码使用版本控制系统(<url id="http://www.debian.org/doc/manuals/debian-reference/ch10.en.html#_version_control_systems" name="VCS">)，你也应该考虑使用它们。这会使得合并和提取上游补丁更加简单。在 Debian 有多个为不同 VCS 设计的脚本软件包来协助 Debian 软件包构建。
zh_tw: 如果你的上游對原始碼使用版本控制系統(<url id="http://www.debian.org/doc/manuals/debian-reference/ch10.en.html#_version_control_systems" name="VCS">)，你也應該考慮使用它們。這會使得合併和提取上游補丁更加簡單。在 Debian 有多個爲不同 VCS 設計的腳本套件來協助 Debian 套件構建。

source: <package>git-buildpackage</package>: Suite to help with Debian packages in Git repositories.
ca: <package>git-buildpackage</package>: conjunt per a la compilació de paquets en repositoris «Git».
es: <package>git-buildpackage</package>: conjunto para la compilación de paquetes en repositorios «Git».
fr: <package>git-buildpackage</package> : assistants pour les paquets Debian en dépôts Git ;
ja: <package>git-buildpackage</package>: Gitリポジトリ内でのDebianパッケージを支援するパッケージソフトです。
zh_cn: <package>git-buildpackage</package>：帮助维护 Git 仓库中软件包的套件。
zh_tw: <package>git-buildpackage</package>：幫助維護 Git 倉庫中套件的套件。

source: <package>topgit</package>: a Git patch queue manager
ca: <package>topgit</package>: per gestionar les piles de pegats en «Git».
es: <package>topgit</package>: para gestionar las pilas de parches en «Git».
fr: <package>topgit</package> : gestionnaire de file de correctifs Git ;
it: <package>topgit</package>: un gestore di code per le patch che utilizza Git
ja: <package>topgit</package>:キューマネージャーのGitパッチです。
zh_cn: <package>topgit</package>：一个 Git 补丁队列管理器。
zh_tw: <package>topgit</package>：一個 Git 補丁隊列管理器。
