Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: For the <tt>main</tt> section, it <strong>must be compliant to all the Debian Free Software Guidelines (DFSG)</strong> (see <url id="http://www.debian.org/social_contract#guidelines">) and <strong>that program must not require a package outside of <tt>main</tt></strong> for compilation or execution as required by the Debian Policy. This is desired case.
ca: Per a paquets de la secció <tt>main</tt> cal que el programa <strong>s'ajusti a les Directrius de Debian per al programari (DFSG)</strong> lliure (consulta <url id="http://www.debian.org/social_contract.html#guidelines">) i <strong>no ha de precisar la instal·lació de cap altre paquet</strong> que no pertanyi a la secció <tt>main</tt> en la compilació o execució com requereix la directiva de Debian («Debian Policy»).
es: Si el paquete debe pertenecer a la sección <tt>main</tt> el programa <strong>debe cumplir con las Directrices de Debian para el software (DFSG)</strong> libre (véase <url id="http://www.debian.org/social_contract.html#guidelines">) y <strong>no debe precisar la instalación de otro paquete que no pertenezca a la sección <tt>main</tt></strong> para su compilación o ejecución como requiere la directiva de Debian («Debian Policy»).
fr: pour la section <tt>main</tt> (principale), elle <strong>doit être conforme à tous les principes du logiciel libre selon Debian (« Debian Free Software Guidelines » ou DFSG)</strong> (voir <url id="http://www.debian.org/social_contract#guidelines">) et <strong>ce programme ne doit pas dépendre de paquets hors de <tt>main</tt></strong> pour la compilation ou l'exécution, conformément à la Charte Debian. C'est le cas idéal ;
ja: <tt>main</tt> セクションは、<strong>Debian フリーソフトウェアガイドライン (DFSG) に完全に準拠しなければなりません</strong>し (<url id="http://www.debian.org/social_contract#guidelines"> 参照)、また Debian ポリシーにより、コンパイル・実行時に <strong><tt>main</tt> にあるもの以外のパッケージに依存してはなりません</strong>。これが望ましいケースです。
zh_cn: 对于 <tt>main</tt> 类的软件，其许可证 <strong>必须满足 Debian Free Software Guidelines (DFSG) 的全部条件</strong> (参看 <url id="http://www.debian.org/social_contract#guidelines">) 以及 <strong>不能依赖于 <tt>main</tt> 之外的软件包</strong> 以满足 Debian Policy 中对于编译和运行的要求。正如我们所期望的，<tt>main</tt> 是容纳绝大多数自由软件的场所。
zh_tw: 對於 <tt>main</tt> 類的軟體，其許可證 <strong>必須滿足 Debian Free Software Guidelines (DFSG) 的全部條件</strong> (參考 <url id="http://www.debian.org/social_contract#guidelines">) 以及 <strong>不能依賴於 <tt>main</tt> 之外的套件</strong> 以滿足 Debian Policy 中對於編譯和運行的要求。正如我們所期望的，<tt>main</tt> 是容納絕大多數自由軟體的場所。

source: For the <tt>contrib</tt> section, it must be compliant to all the DFSG but it may require a package outside of <tt>main</tt> for compilation or execution.
ca: Per a paquets de la secció <tt>contrib</tt>, la llicència cal que compleixi tots els requisits de la DFSG però pot precisar la instal·lació d'altres paquets que no siguin de la secció <tt>main</tt> en la compilació o execució.
es: Para paquetes de la sección <tt>contrib</tt> la licencia debe cumplir todos los requisitos de la DFSG pero puede precisar la instalación de otro paquete que no sea de la sección <tt>main</tt> para su compilación o ejecución.
ja: <tt>contrib</tt> セクションは、DFSG に完全に準拠していなければなりませんが、コンパイル・実行時に <tt>main</tt> にあるもの以外のパッケージに依存していても構いません。
zh_cn: 对于 <tt>contrib</tt> 类的软件，其许可证必须满足 DFSG 的全部条件，但可以依赖于 <tt>main</tt> 之外的软件包以完成编译或运行。

source: For the <tt>non-free</tt> section, it may not be compliant to some of the DFSG but it <strong>must be distributable</strong>.
ca: Per a paquets de la secció <tt>non-free</tt>, no és necessari que la llicència compleixi tots els requisits de la DFSG però <strong>cal que permeti la distribució del programa</strong>.
es: Para paquetes de la sección <tt>non-free</tt>, no es necesario que la licencia cumpla todos los requisitos de la DFSG pero <strong> debe permitir la distribución del programa</strong>.
ja: <tt>non-free</tt> セクションは、DFSG に準拠していない部分があるかもしれませんが、<strong>配布可能でなければなりません</strong>。
zh_cn: 对于 <tt>non-free</tt> 类的软件，其许可证可以不满足 DFSG 中的一些条件，但至少需要是 <strong>可以分发的</strong>。

source: If you are unsure about where it should go, post the license text on <url id="http://lists.debian.org/debian-legal/" name="debian-legal@lists.debian.org"> and ask for advice.
ca: Si tens dubtes a l'hora d'assignar al paquet a una secció, envia un correu amb el text de la llicència (en anglès) adreçat a <url id="http://lists.debian.org/debian-legal/" name="debian-legal@lists.debian.org">.
es: Si no estás seguro sobre en qué lugar debería ir, envía el texto de la licencia y pide consejo con un correo (en inglés) dirigido a <url id="http://lists.debian.org/debian-legal/" name="debian-legal@lists.debian.org">.
fr: En cas de doute sur la section à laquelle il devrait appartenir, envoyez la licence sur <url id="http://lists.debian.org/debian-legal/" name="debian-legal@lists.debian.org"> et demandez conseil ;
it: Se non si è sicuri su quale sezione il pacchetto dovrebbe essere incluso, si può mandare il testo della licenza alla mailing list <url id="http://lists.debian.org/debian-legal/" name="debian-legal@lists.debian.org"> e chiedere consigli.
ja: どうするべきかよくわからなければ、<url id="http://lists.debian.org/debian-legal/" name="debian-legal@lists.debian.org"> にライセンス文を送り、アドバイスを求めてください。
zh_cn: 如果你不清楚你的软件应该分入哪一类，则把许可证文本发送到 <url id="http://lists.debian.org/debian-legal/" name="debian-legal@lists.debian.org"> 请他人提出意见。
zh_tw: 如果你不清楚你的軟體應該分入哪一類，則把許可證文本發送到 <url id="http://lists.debian.org/debian-legal/" name="debian-legal@lists.debian.org"> 請他人提出意見。

source: That program certainly should <strong>not</strong> run setuid root, or even better - it shouldn't need to be setuid or setgid to anything.
ca: El programa <strong>no</strong> s'ha d'executar com a «setuid root»: cal que no sigui «setuid» ni «setgid».
es: El programa <strong>no</strong> debería ejecutarse con «setuid root», o aún mejor: no debería ser «setuid» ni «setgid».
fr: le programme ne devrait certainement <strong>pas</strong> être exécuté setuid root, ou encore mieux, il ne devrait pas être setuid ou setgid quoi que ce soit ;
it: il programma <strong>non</strong> dovrebbe girare come setuid root, o meglio, non dovrebbe richiedere di essere setuid o setgid per nessun utente.
ja: 実行時に root に setuid <strong>しない</strong>プログラムがよいでしょう。もっと言えば、どんなときも setuid や setgid を必要としないほうがよいでしょう。
zh_cn: 程序 <strong>不应该</strong> setuid 到 root，甚至可以更好——不 setuid 或 setgid 到任何用户或组。
zh_tw: 程式 <strong>不應該</strong> setuid 到 root，甚至可以更好——不 setuid 或 setgid 到任何用戶或組。

source: That program should not be a daemon, or something that goes in <file>*/sbin</file> directories, or open a port as root.
ca: Cal que el programa no sigui un dimoni, o que s'instal·li en els directoris <file>*/sbin</file> o ﻿obrir un port com a usuari administrador.
es: El programa no debería ser un demonio, o algo que vaya en los directorios <file>*/sbin</file>, o abrir un puerto como usuario administrador.
fr: le programme ne devrait ni être un démon, ni s'installer dans les répertoires <file>*/sbin</file>, ni ouvrir un port en tant que superutilisateur ;
it: il programma non dovrebbe essere un daemon, o qualcosa che debba essere installato nelle directory <file>*/sbin</file>, o aprire una porta come root.
ja: デーモンとして動作するプログラムや、<file>*/sbin</file> ディレクトリに配置するプログラム、また root 特権を使ってポートを開くプログラムでないほうがよいでしょう。
zh_cn: 这个程序不应该是守护进程，也不应该安装文件到 <file>*/sbin</file> 目录或者以 root 打开任何端口。
zh_tw: 這個程式不應該是守護進程，也不應該安裝檔案到 <file>*/sbin</file> 目錄或者以 root 打開任何端口。

source: That program should result in binary executable form, libraries are harder to handle.
ca: ﻿El programa hauria d'estar compost per binaris executables, no intentis empaquetar llibreries (és difícil).
es: El programa debería estar compuesto por binarios ejecutables, no intentes empaquetar aún bibliotecas (son difíciles).
fr: le programme résultant devrait être sous forme de binaire exécutable, les bibliothèques sont plus difficiles à gérer ;
it: il programma dovrebbe essere in formato binario eseguibile, le librerie sono più difficili da gestire.
ja: バイナリ実行形式が得られるプログラムを選びましょう。ライブラリを扱うのはずっと難しいのです。
zh_cn: 程序应当最终以二进制可执行程序的形式呈现，库则较难处理。
zh_tw: 程式應當最終以二進位可執行程式的形式呈現，庫則較難處理。

source: That program should be well documented and its code needs to be understandable (i.e. not obfuscated).
ca: Cal que el programa estigui ben documentat, que el codi sigui llegible i clar.
es: El programa debería tener una buena documentación o al menos un código fuente legible y no ofuscado.
fr: il devrait être bien documenté, et le code doit être compréhensible (c'est-à-dire, pas volontairement obscur) ;
it: il programma dovrebbe essere ben documentato e il suo codice facilmente comprensibile (ad es. non offuscato).
ja: ちゃんとした説明書きのあるプログラムで、ソースコードが理解可能なもの (つまり、わかりにくくないこと)。
zh_cn: 程序应当有很好的文档，最好源代码也容易理解(比如不混乱)。
zh_tw: 程式應當有很好的文件，最好原始碼也容易理解(比如不混亂)。

source: You should contact program's author(s) to check if they agree with packaging it and amicable to Debian. It is important to be able to consult with author(s) about the program in case of any program specific problems, so don't try to package unmaintained pieces of software.
ca: Cal que contactis amb l'autor o autors del programa per comprovar que accepten la construcció del paquet. És important que els autors ﻿continuïn amb el manteniment del programa de manera que puguis fer consultes sobre problemes específics del programa. No comencis a empaquetar un programa que no sigui mantingut pels autors.
es: Deberías contactar con el autor o autores del programa para comprobar su conformidad con el empaquetado. Es importante que el autor o autores sigan manteniendo el programa para que puedas en el futuro consultarle/s en caso de que haya problemas específicos. No deberías intentar empaquetar programas que no estén mantenidos.
fr: vous devriez contacter les auteurs du programme pour vérifier qu'ils soient d'accord pour la création du paquet et bienveillants envers Debian. Il est important de pouvoir consulter les auteurs à propos du programme en cas de problèmes spécifiques à celui-ci, donc n'essayez pas de créer un paquet à partir de programmes non maintenus.
it: Si dovrebbe contattare l'autore o gli autori del programma per verificare che siano d'accordo con la sua pacchettizzazione. È importante essere in grado di consultarsi con l'autore/i sul programma nel caso di problemi specifici del programma, per questo è meglio non provare a pacchettizzare programmi non più manutenuti.
ja: プログラムの作者に連絡をとって、パッケージ化の承諾と Debian に友好的かどうかを確認しておきましょう。何かプログラムそのものに起因する問題が発生した際に、作者にいろいろ聞けるということは重要なので、由来のはっきりしないソフトウェアの断片をパッケージ化するのはやめておきましょう。
zh_cn: 你应该与程序的作者取得联系问一下他是否认为程序应当被打包，以及他是否对 Debian 友好。能够询问作者关于程序的任何问题是非常重要的，不要尝试打包一个无人维护的软件。
zh_tw: 你應該與程式的作者取得聯繫問一下他是否認爲程式應當被打包，以及他是否對 Debian 友好。能夠詢問作者關於程式的任何問題是非常重要的，不要嘗試打包一個無人維護的軟體。

source: Of course, these things are just safety measures, and intended to save you from raging users if you do something wrong in some setuid daemon... When you gain some more experience in packaging, you'll be able to do such packages, but even the experienced developers consult the <url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org"> mailing list when they are in doubt. And people there will gladly help.
ca: Aquesta llista t'ajudarà a començar amb garanties, i et salvaguardarà d'usuaris enfurismats si fas alguna cosa malament amb algun dimoni «setuid»...Quan tenguis més experiència en empaquetar, podràs fer aquest tipus de paquets: fins i tot els desenvolupadors més experimentats fan consultes a la llista de correus <url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org"> si tenen dubtes. ﻿La gent t'ajudarà gustosament.
es: Por supuesto, esta lista son sólo medidas de seguridad, y con la intención de salvarte de usuarios enfurecidos si haces algo mal con algún demonio «setuid»... Cuando tengas más experiencia en empaquetar, podrás hacer este tipo de paquetes: incluso los desarrolladores más experimentados hacen consultas en la lista de correo <url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org"> cuando tienen dudas. La gente te ayudará gustosamente.
fr: Bien sûr, toutes ces remarques ne sont que des mesures de sécurité, et ont pour but de vous préserver d'utilisateurs fous de rage si vous faites une erreur dans un démon setuid... Quand vous aurez plus d'expérience dans la création de paquets, vous pourrez faire de tels paquets, mais même les développeurs les plus expérimentés consultent la liste de discussion <url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org"> en cas de doute. Les personnes présentes seront heureuses de vous aider.
it: Ovviamente queste sono solo misure di sicurezza, fatte per salvare il futuro maintainer dall'ira degli utenti se si commette qualche errore in qualche daemon setuid... Una volta acquisita esperienza nella pacchettizzazione, si riuscirà a creare pure quel tipo di pacchetti, ma anche lo sviluppatore più esperto consulta la mailing list <url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian"> quando ha qualche dubbio. E i partecipanti saranno lieti di dare una mano.
ja: もちろんこれらのことは安全策というだけのことです。setuid デーモンで何かミスしてしまい、怒り狂ったユーザから抗議殺到という事態を回避したいのです。パッケージ化についてもっと経験を積めば、こうしたパッケージも 作れるようになるでしょう。しかし、どんなに老練な開発者だって、何か分からないことがあれば <url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org"> メーリングリストで質問するのです。そこには喜んで手助けしてくれる人々がいます。
zh_cn: 当然，这些问题都只是为了安全，并试图让你不至于在比如 setuid 守护进程等问题上犯错误而激怒了用户... 当你在打包方面有了更多经验时，就可以处理这些软件包了。但即便是富有经验的开发人员在遇到疑惑时也会发邮件到 <url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org"> 邮件列表咨询，那里的人会很乐意提供帮助。
zh_tw: 當然，這些問題都只是爲了安全，並試圖讓你不至於在比如 setuid 守護進程等問題上犯錯誤而激怒了用戶... 當你在打包方面有了更多經驗時，就可以處理這些套件了。但即便是富有經驗的開發人員在遇到疑惑時也會發郵件到 <url id="http://lists.debian.org/debian-mentors/" name="debian-mentors@lists.debian.org"> 郵件列表諮詢，那裏的人會很樂意提供幫助。

source: For more help about these, check in <url id="http://www.debian.org/doc/devel-manuals#devref" name="Debian Developer's Reference">.
ca: Pots consultar la <url id="http://www.debian.org/doc/devel-manuals#devref" name="Referència del desenvolupador">.
es: Para más ayuda sobre el tema, lee la <url id="http://www.debian.org/doc/devel-manuals#devref" name="Referencia del desarrollador">.
fr: Pour plus d'informations à ce sujet, consultez la <url id="http://www.debian.org/doc/devel-manuals#devref" name="référence du Développeur Debian">.
it: Per maggiori informazioni, consulta la <url id="http://www.debian.org/doc/devel-manuals#devref" name="Guida di riferimento per lo sviluppatore">.
ja: もっと詳しい話は、<url id="http://www.debian.org/doc/devel-manuals#devref" name="Debian 開発者リファレンス">に載っていますので、そちらを参照してください。
zh_cn: 关于这些问题的更多帮助，查看 <url id="http://www.debian.org/doc/devel-manuals#devref" name="Debian Developer's Reference">。
zh_tw: 關於這些問題的更多幫助，查看 <url id="http://www.debian.org/doc/devel-manuals#devref" name="Debian Developer's Reference">。

source: Get the program, and try it out
ca: ﻿Aconsegueix el programa i prova'l.
es: Obtén el programa y pruébalo
fr: Obtenir le programme, et l'essayer
it: Prendere il programma e provarlo
ja: プログラムの入手と検証
zh_cn: 获得程序，并且试用它
zh_tw: 獲得程式，並且試用它

source: So the first thing to do is to find and download the original source code. I presume that you already have the source file that you picked up at the author's homepage. Sources for free Unix programs usually come in <prgn>tar</prgn>+<prgn>gzip</prgn> format with extension <file>.tar.gz</file>, or <prgn>tar</prgn>+<prgn>bzip2</prgn> format with extension <file>.tar.bz2</file>. These usually contain the subdirectory called <file><var>programname</var>-<var>version</var></file> in them and all the sources under it.
ca: La primera passa és trobar i descarregar el codi font original del programa. Les fonts dels programes lliures de GNU/Linux és habitual que es distribueixin en fitxers amb format <prgn>tar</prgn>+<prgn>gzip</prgn>, amb extensió <file>.tar.gz</file> o amb format <prgn>tar</prgn>+<prgn>bzip2</prgn> amb extensió <file>.tar.bz2</file>, i generalment tenen un directori amb el nom <file><var>programa</var>-<var>versió</var></file> amb tots els fitxers del codi font.
es: Lo primero que debes hacer es encontrar y descargar el código fuente original. A partir de este punto se da por supuesto que ya tienes el código fuente que obtuviste de la página del autor. Las fuentes de los programas libres de Unix (y GNU/Linux) generalmente vienen en formato <prgn>tar</prgn>+<prgn>gzip</prgn>, con extensión <file>.tar.gz</file> o en formato <prgn>tar</prgn>+<prgn>bzip2</prgn> con extensión <file>.tar.bz2</file>, y generalmente contienen un subdirectorio llamado <file><var>programa</var>-<var>versión</var></file> con todas las fuentes en él.
fr: La première chose à faire est de trouver et télécharger le code source d'origine. Supposons que vous ayez déjà le fichier source pris sur la page web de l'auteur. Les sources pour les logiciels Unix libres sont d'habitude distribués au format <prgn>tar</prgn>+<prgn>gzip</prgn> avec l'extension <file>.tar.gz</file>, ou au format <prgn>tar</prgn>+<prgn>bzip2</prgn> avec l'extension <file>.tar.bz2</file>. Elles contiennent normalement un sous-répertoire nommé <file><var>nom_du_programme</var>-<var>version</var></file> avec toutes les sources dedans.
it: La prima cosa da fare è trovare e scaricare il codice sorgente del programma. Supponendo che si è recuperato il file dal sito web dell'autore. Generalmente il codice sorgente di programmi liberi per Unix e derivati sono in formato <prgn>tar</prgn>+<prgn>gzip</prgn> con estensione <file>.tar.gz</file>, oppure in formato <prgn>tar</prgn>+<prgn>bzip2</prgn> con estensione <file>.tar.bz2</file>. Di solito, questi file, contengono la sottodirectory dal nome <file><var>programma</var>-<var>versione</var></file> con tutti i sorgenti.
ja: さて、最初にすべきことは、オリジナルのソースコードを探してダウンロードすることです。ここでは作者のホームページから、すでにソースファイルを入手したとして話を進めます。フリーな Unix 用プログラムのソースは、ふつう <file>.tar.gz</file> 拡張子が付いた <prgn>tar</prgn>+<prgn>gzip</prgn> 形式や、<file>.tar.bz2</file> 拡張子が付いた <prgn>tar</prgn>+<prgn>bzip2</prgn> 形式で提供されています。この中にはたいてい、すべてのソースが入った <file><var>プログラム名</var>-<var>バージョン</var></file> というサブディレクトリがあります。
zh_cn: 第一件要做的事就是找到并下载原始的源代码。我假定你已经从作者的主页上找到了它的源代码。Unix 下的自由软件源代码通常是以 <prgn>tar</prgn>+<prgn>gzip</prgn> 格式(扩展名为 <file>.tar.gz</file>)或 <prgn>tar</prgn>+<prgn>bzip2</prgn> 格式(扩展名为 <file>.tar.bz2</file>)的形式提供的。通常归档文件中包含了一个名为 <file><var>programname</var>-<var>version</var></file> 的子目录，里面包含了全部的源代码。
zh_tw: 第一件要做的事就是找到並下載原始的原始碼。我假定你已經從作者的首頁上找到了它的原始碼。Unix 下的自由軟體原始碼通常是以 <prgn>tar</prgn>+<prgn>gzip</prgn> 格式(副檔名爲 <file>.tar.gz</file>)或 <prgn>tar</prgn>+<prgn>bzip2</prgn> 格式(副檔名爲 <file>.tar.bz2</file>)的形式提供的。通常壓縮檔中包含了一個名爲 <file><var>programname</var>-<var>version</var></file> 的子目錄，裏麵包含了全部的原始碼。

source: If the latest version of such sources are available through VCS such as Git, Subversion, or CVS repository, you need to get it with "<tt>git clone</tt>", "<tt>cvs co</tt>", or "<tt>svn co</tt>" and repack it into <prgn>tar</prgn>+<prgn>gzip</prgn> format by yourself using the "<tt>--exclude-vcs</tt>" option.
ca: Si la darrera versió del codi font és a un sistema VCS tipus Git, «Subversion» o a un repositori CVS, pots descarregar-ho executant <tt>git clone</tt>, <tt>cvs co</tt> o <tt>svn co</tt> i, a continuació ho comprimeixes en un arxiu amb format <prgn>tar</prgn>+<prgn>gzip</prgn> executant l'opció <tt>--exclude-vcs</tt>.
es: Si la última versión del código fuente se puede obtener de un sistema VCS del tipo Git, Subversion o un repositorio CVS, puedes descargarlo ejecutando «<tt>git clone</tt>», «<tt>cvs co</tt>» o «<tt>svn co</tt>» y, a continuación comprimiéndolo en un archivo con formato <prgn>tar</prgn>+<prgn>gzip</prgn> ejecutando la opción «<tt>--exclude-vcs</tt>».
fr: Si la dernière version des sources est disponible dans un dépôt de gestion de version tel que Git, Subversion ou CVS, vous devez la prendre avec « <tt>git clone</tt> », « <tt>cvs co</tt> », ou « <tt>svn co</tt> » et la compresser vous-même au format <prgn>tar</prgn>+<prgn>gzip</prgn> avec l'option « <tt>--exclude-vcs</tt> ».
it: Se è presente un sistema di controllo di versione (VCS) come Git, Subversion o CVS, è possibile scaricare l'ultima versione del codice sorgente con "<tt>git clone</tt>", "<tt>svn co</tt>", o "<tt>cvs co</tt>" e comprimerlo in formato <prgn>tar</prgn>+<prgn>gzip</prgn> utilizzando l'opzione "<tt>--exclude-vcs</tt>".
ja: 該当ソースの最新版が Git や Subversion、CVS リポジトリのような VCS で提供されているなら、取得するのに "<tt>git clone</tt>"、"<tt>cvs co</tt>" や "<tt>svn co</tt>" してから、"<tt>--exclude-vcs</tt>" オプションを使って自分で <prgn>tar</prgn>+<prgn>gzip</prgn> 形式に再パックする必要があります。
zh_cn: 如果源代码的最新版需要通过诸如 Git、Subversion 或 CVS 这类 VCS (Version Control System，版本控制系统)仓库获得，那么你需要使用“<tt>git clone</tt>”“<tt>cvs co</tt>”或“<tt>svn co</tt>”等命令获得代码后，再使用 <prgn>tar</prgn> 程序的 <tt>--exclude-vcs</tt> 选项将其重新打包为 <prgn>tar</prgn>+<prgn>gzip</prgn> 格式。
zh_tw: 如果原始碼的最新版需要通過諸如 Git、Subversion 或 CVS 這類 VCS (Version Control System，版本控制系統)倉庫獲得，那麼你需要使用“<tt>git clone</tt>”“<tt>cvs co</tt>”或“<tt>svn co</tt>”等命令獲得程式碼後，再使用 <prgn>tar</prgn> 程式的 <tt>--exclude-vcs</tt> 選項將其重新打包爲 <prgn>tar</prgn>+<prgn>gzip</prgn> 格式。

source: If your program's source comes as some other sort of archive (for instance, the filename ends in <file>.Z</file> or <file>.zip</file><footnote><p>You can identify the archive format using the <prgn>file</prgn> command when the file extension is not enough.</p></footnote>), unpack it with appropriate tools and repack it, too.
ca: Si el programa està disponible en una altre format (pot ésser un arxiu acabat en <file>.Z</file> o <file>.zip</file><footnote><p>Pots identificar el format de l'arxius fent servir l'ordre <prgn>file</prgn>.</p></footnote>), ho descomprimeixes amb l'eina adequada i el tornes a empaquetar adequadament.
es: Si tu programa viene en otro tipo de archivo (por ejemplo, el fichero termina en <file>.Z</file> o <file>.zip</file><footnote><p>Puedes identificar el formato de archivo utilizando la herramienta <prgn>file</prgn> cuando no es suficiente con la extensión de fichero.</p></footnote>), descomprímelo con las herramientas adecuadas y reempaquetalo de nuevo.
fr: Si les sources du programme sont disponibles dans un autre format d'archive (par exemple, le programme se termine par <file>.Z</file> ou <file>.zip</file> <footnote><p>Vous pouvez identifier le format de l'archive en utilisant la commande <prgn>file</prgn> si l'extension du fichier ne suffit pas.</p></footnote>), décompressez-le avec les outils adéquats et compressez-le de nouveau.
it: Se il codice sorgente è in qualche altro formato di archiviazione (per esempio, con estensione <file>.Z</file> o <file>.zip</file><footnote><p>si può utilizzare il comando <prgn>file</prgn> per scoprire il formato di archiviazione</p></footnote>), scompattarlo con i programmi appropriati, e comprimerlo di nuovo.
ja: プログラムのソースが、他の種類のアーカイブ (例えば、<file>.Z</file>で終わるファイル名や、<file>.zip</file><footnote><p>ファイルの拡張子で足りなければ、<prgn>file</prgn> コマンドを使ってアーカイブ形式を判別することができます。</p></footnote>) の場合も、適切なツールで展開してから再パックしてください。
zh_cn: 如果你的程序源代码是以其他形式提供的(比如文件名以 <file>.Z</file> 或 <file>.zip</file> 结尾<footnote><p>当文件扩展名不足以判断文件类型时，可以使用 <prgn>file</prgn> 命令来判断。</p></footnote>)，则使用合适的工具将其解包，再重新打包。
zh_tw: 如果你的程式原始碼是以其他形式提供的(比如檔案名以 <file>.Z</file> 或 <file>.zip</file> 結尾<footnote><p>當檔案副檔名不足以判斷檔案類型時，可以使用 <prgn>file</prgn> 命令來判斷。</p></footnote>)，則使用合適的工具將其解壓縮，再重新打包。
