Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: If someone else wants to re-create your package from scratch, they can easily do so using the above three files. The extraction procedure is trivial: just copy the three files somewhere else and run "<tt>dpkg-source -x gentoo_0.9.12-1.dsc</tt>". <footnote><p>You can avoid applying <prgn>quilt</prgn> patches in the <tt>3.0 (quilt)</tt> source format at the end of the extraction with the <tt>--skip-patches</tt> option. Alternatively, you can run "<tt>quilt pop -a</tt>" after normal operation.</p></footnote>
ca: Si una altra persona vol tornar a construir el paquet des de l'inici, pot fer-ho fàcilment fent servir aquests tres fitxers. El procés d'extracció és trivial: només cal copiar-los en un directori i executar <tt>dpkg-source -x gentoo_0.9.12-1.dsc</tt> <footnote><p>Pots evitar l'aplicació automàtica dels pegats per <prgn>quilt</prgn> en els paquets amb el format <tt>3.0 (quilt)</tt> al final de l'extracció amb l'opció <tt>--skip-patches</tt>. També pots optar per desfer les modificacions, una vegada acabada l'extracció, executant <tt>quilt pop -a</tt>. </p></footnote>.
es: Si alguien quiere volver a construir tu paquete desde cero, puede hacerlo fácilmente usando los tres ficheros de arriba. El proceso de extracción es trivial: sólo se debe copiar los tres ficheros en algún lado y ejecutar <tt>dpkg-source -x gentoo_0.9.12-1.dsc</tt> <footnote><p>Puedes evitar la aplicación automática de las modificaciones por <prgn>quilt</prgn> en los paquetes con formato <tt>3.0 (quilt)</tt> al final de la extracción con la opción <tt>--skip-patches</tt>. También puedes deshacer las modificaciones al finalizar la extracción con la ejecución de <tt>quilt pop -a</tt>. </p></footnote>.
fr: Si quelqu'un d'autre veut recréer le paquet depuis le début, il peut facilement le faire en utilisant ces trois fichiers. La procédure d'extraction est facile : copier simplement ces trois fichiers quelque part et exécuter « <tt>dpkg-source -x gentoo_0.9.12-1.dsc</tt> ». <footnote><p>Il est possible de ne pas appliquer les correctifs <prgn>quilt</prgn> du format source <tt>3.0 (quilt)</tt> à la fin de l'extraction avec l'option <tt>--skip-patches</tt>. Sinon, il est aussi possible d'exécuter « <tt>quilt pop -a</tt> » après l'extraction normale.</p></footnote>
it: Se qualcun altro volesse ri-creare il pacchetto da zero, potrebbe farlo facilmente usando i suddetti tre file. La procedura di estrazione è banale: basta copiare i tre file da qualche parte ed eseguire "<tt>dpkg-source -x gentoo_0.9.12-1.dsc</tt>". <footnote><p>È possibile evitare di applicare la patch con <prgn>quilt</prgn>, nel formato sorgente <tt>3.0 (quilt)</tt>, aggiungendo il parametro <tt>--skip-patches</tt> al comando di estrazione. In alternativa, è possibile eseguire "<tt>quilt pop -a</tt>" dopo le normali operazioni.</p></footnote>
ja: 上記３つのファイルを使えば誰でも簡単にあなたのパッケージをスクラッチから構築することができます。３つのファイルを任意の場所にコピーし、"<tt>dpkg-source -x gentoo_0.9.12-1.dsc</tt>"を実行するだけです。<footnote><tt>3.0 (quilt)</tt>ソースフォーマットで<p><prgn>quilt</prgn>パッチを当てないようにするには、上記コマンドに<tt>--skip-patches</tt>オプションをつけて実行します。または、通常の工程の後に、"<tt>quilt pop -a</tt>"を実行する方法もあります。</p></footnote>
zh_cn: 如果其他人想要重新构建你的软件包，他们可以使用以上三个文件很容易地完成。只需复制三个文件，再运行 <tt>dpkg-source -x gentoo_0.9.12-1.dsc</tt>。 <footnote><p>你可以使用 <tt>--skip-patches</tt> 选项来在正常的是否操作后避免应用 <tt>3.0 (quilt)</tt> 源代码包格式中的 <prgn>quilt</prgn> 补丁。你也可以在正常解压后使用 <tt>quilt pop -a</tt> 恢复这些补丁对源码的修改。</p></footnote>
zh_tw: 如果其他人想要重新構建你的套件，他們可以使用以上三個檔案很容易地完成。只需複製三個檔案，再運行 <tt>dpkg-source -x gentoo_0.9.12-1.dsc</tt>。 <footnote><p>你可以使用 <tt>--skip-patches</tt> 選項來在正常的是否操作後避免應用 <tt>3.0 (quilt)</tt> 原始碼包格式中的 <prgn>quilt</prgn> 補丁。你也可以在正常解壓後使用 <tt>quilt pop -a</tt> 恢復這些補丁對源碼的修改。</p></footnote>

source: <file>gentoo_0.9.12-1_i386.deb</file>
ca: <em>gentoo_0.9.12-1_i386.deb</em>
es: <em>gentoo_0.9.12-1_i386.deb</em>

source: This is your completed binary package. You can use <prgn>dpkg</prgn> to install and remove this just like any other package.
ca: Aquest és el paquet binari Debian. Pots fer servir <prgn>dpkg</prgn> per instal·lar o eliminar aquest paquet o qualsevol altre.
es: Este es el paquete binario completo. Puedes usar <prgn>dpkg</prgn> para instalar o eliminar tanto este paquete como cualquier otro.
fr: C'est le paquet binaire terminé. Vous pouvez utiliser <prgn>dpkg</prgn> pour l'installer ou le retirer comme n'importe quel autre paquet.
it: Questo è il pacchetto binario completo. Si può usare <prgn>dpkg</prgn> per installarlo e rimuoverlo, come per ogni altro pacchetto.
ja: これは、あなたが生成した完全なバイナリパッケージです。他の全てのパッケージと同じく、<prgn>dpkg</prgn>を使ってインストールしたり削除したりできます。
zh_cn: 这是你的二进制包，可以使用 <prgn>dpkg</prgn> 程序安装或卸载它，就像其他软件包一样。
zh_tw: 這是你的二進位套件，可以使用 <prgn>dpkg</prgn> 程式安裝或反安裝它，就像其他套件一樣。

source: <file>gentoo_0.9.12-1_i386.changes</file>
ca: <em>gentoo_0.9.12-1_i386.changes</em>
es: <em>gentoo_0.9.12-1_i386.changes</em>

source: This file describes all the changes made in the current package revision, and it is used by the Debian FTP archive maintenance programs to install the binary and source packages in it. It is partly generated from the <file>changelog</file> file and the <file>.dsc</file> file. This file is GPG signed, so that people can be sure that it's really yours.
ca: Aquest arxiu conté la descripció dels canvis fets en la revisió actual del paquet, i el fan servir els programes de gestió FTP del repositori Debian per instal·lar-hi els paquets binaris i de fonts. Se genera parcialment amb l'arxiu <file>changelog</file> i el fitxer <file>.dsc</file>. Aquest arxiu està signat amb GPG, per assegurar-ne l'autoria.
es: Este fichero describe todos los cambios hechos en la revisión actual del paquete, y lo utilizan los programas de mantenimiento del archivo FTP de Debian para instalar los paquetes binarios y fuentes en él. Se genera parcialmente a partir del fichero <file>changelog</file> y el fichero <file>.dsc</file>. Este fichero está firmado con GPG, de forma que cualquiera puede estar aún más seguro de que es realmente tuyo.
fr: Ce fichier contient toutes les modifications effectuées dans la révision actuelle du paquet, et est utilisé par les programmes de maintenance des archives FTP Debian pour y installer les paquets binaires et sources. Il est partiellement créé à partir des fichiers <file>changelog</file> et <file>.dsc</file>. Ce fichier est signé avec GPG, de sorte que les gens peuvent être sûrs qu'il s'agit bien du vôtre.
it: Questo file descrive tutte le modifiche effettuate nella revisione corrente del pacchetto, ed è usata dai programmi di manutenzione dell'archivio FTP di Debian, per installare i pacchetti binari e sorgenti. È generato parzialmente dal contenuto del file <file>changelog</file> e dal file <file>.dsc</file>. Questo file è firmato con GPG, in modo da confermare l'autenticità dell'autore del pacchetto.
ja: このファイルは現在のリビジョンパッケージにおける変更点をすべて記載したもので、Debian FTP アーカイブ管理プログラムによって、バイナリおよびソースパッケージをFTPアーカイブにインストールするために利用されます。このファイルの一部は、<file>changelog</file>ファイルと<file>.dsc</file>をもとに生成されます。また、GPG で署名されているので、本当にあなた自身が作成したものかどうかを利用者が検証できます。
zh_cn: 这个文件描述了当前版本的软件包中的全部变更，它被 Debian FTP 仓库维护程序用于安装二进制和源代码包。它的是部分从 <file>changelog</file> 和 <file>.dsc</file> 文件生成的，并使用 GPG 签名以便别人可以确信它确实是你提供的。
zh_tw: 這個檔案描述了當前版本的套件中的全部變更，它被 Debian FTP 倉庫維護程式用於安裝二進位和原始碼包。它的是部分從 <file>changelog</file> 和 <file>.dsc</file> 檔案生成的，並使用 GPG 簽名以便別人可以確信它確實是你提供的。

source: As you keep working on the package, behavior will change and new features will be added. People downloading your package can look at this file and quickly see what has changed. Debian archive maintenance programs will also post the contents of this file to the <url id="http://lists.debian.org/debian-devel-announce/" name="debian-devel-announce@lists.debian.org"> mailing list.
ca: Amb el temps, el paquet anirà canviat i s'afegiran funcions. Les persones que descarreguin el paquet poden llegir aquest arxiu i assabentar-se dels canvis. Els programes de manteniment del repositori Debian també envien el contingut d'aquest arxiu a la llista de correu <url id="http://lists.debian.org/debian-devel-announce/" name="debian-devel-announce@lists.debian.org">.
es: Mientras sigues trabajando en el paquete, éste cambiará su comportamiento y se le añadirán nuevas funciones. Las personas que descarguen tu paquete pueden leer este fichero y ver qué ha cambiado. Los programas de mantenimiento del archivo de Debian, también enviarán el contenido de este fichero a la lista de correo <url id="http://lists.debian.org/debian-devel-announce/" name="debian-devel-announce@lists.debian.org">.
fr: Au fur et à mesure que vous travaillez sur le paquet, son comportement va évoluer et de nouvelles fonctionnalités seront ajoutées. Les gens qui téléchargent votre paquet peuvent lire ce fichier et voir rapidement ce qui a changé. Les programmes de maintenance des archives Debian vont aussi poster le contenu de ce fichier sur la liste de diffusion <url id="http://lists.debian.org/debian-devel-announce/" name="debian-devel-announce@lists.debian.org">.
it: Quando si lavora sul pacchetto, potrebbero cambiare il funzionamento del programma, o potrebbero venire introdotte nuove funzionalità. Chi scaricherà il pacchetto, potrà controllare questo file per vedere velocemente quali sono i cambiamenti. I programmi di manutenzione dell'archivio Debian invieranno anche i contenuti di questo file alla mailing list <url id="http://lists.debian.org/debian-devel-announce/" name="debian-devel-announce@lists.debian.org">.
ja: パッケージの保守管理を続けていくと、挙動の変更や新機能の追加をすることがあります。あなたのパッケージをダウンロードする人は、このファイルを見れば何が変わったのか、一目でわかります。また、このファイルの中身はDebian アーカイブ管理プログラムによって、<url id="http://lists.debian.org/debian-devel-announce/" name="debian-devel-announce@lists.debian.org">メーリングリストへ流されます。
zh_cn: 随着你不断完善这个软件包，程序的行为会发生变化，也会有更多新特性添加进来。下载你软件包的人可以查看这个文件来快速找到有那些变化，Debian 仓库维护程序还会把它的内容发表至 <url id="http://lists.debian.org/debian-devel-announce/" name="debian-devel-announce@lists.debian.org"> 邮件列表。
zh_tw: 隨着你不斷完善這個套件，程式的行爲會發生變化，也會有更多新特性添加進來。下載你套件的人可以查看這個檔案來快速找到有那些變化，Debian 倉庫維護程式還會把它的內容發表至 <url id="http://lists.debian.org/debian-devel-announce/" name="debian-devel-announce@lists.debian.org"> 郵件列表。

source: The long strings of numbers in the <file>.dsc</file> and <file>.changes</file> files are MD5/SHA1/SHA256 checksums for the files mentioned. A person downloading your files can test them with <manref section="1" name="md5sum">, <manref section="1" name="sha1sum">, or <manref section="1" name="sha256sum"> and if the numbers don't match, they'll know the file is corrupt or has been tampered with.
ca: Les llistes de números en els fitxers <file>.dsc</file> i <file>.changes</file> són les sumes MD5/SHA1/SHA256 dels fitxers. Les persones que descarreguen els arxius poden comprovar-los amb <manref section="1" name="md5sum">, <manref section="1" name="sha1sum"> o <manref section="1" name="sha256sum"> i si els nombres no coincideixen sabran que el fitxer està corrupte o s'ha modificat.
es: Las largas listas de números en los ficheros <file>.dsc</file> y <file>.changes</file> son las sumas MD5/SHA1/SHA256 de los ficheros incluidos en el paquete. Las personas que descarguen estos ficheros pueden comprobarlos con <manref section="1" name="md5sum">, <manref section="1" name="sha1sum"> o <manref section="1" name="sha256sum"> y si los números no coinciden, sabrán que el fichero está corrupto o ha sido modificado.
fr: Les longues chaînes de chiffres dans les fichiers <file>.dsc</file> et <file>.changes</file> sont les sommes MD5, SHA1 et SHA256 des fichiers mentionnés. Les personnes téléchargeant vos fichiers peuvent les tester avec <manref section="1" name="md5sum">, <manref section="1" name="sha1sum"> ou <manref section="1" name="sha256sum">, et si les fichiers ne correspondent pas, elles sauront que le fichier a été corrompu ou falsifié.
it: Le lunghe stringhe di numeri nei file <file>.dsc</file> e <file>.changes</file> sono codici di controllo MD5/SHA1/SHA256 per i file menzionati. Chi scarica questi file, può controllarli con <manref section="1" name="md5sum">, <manref section="1" name="sha1sum">, o <manref section="1" name="sha256sum"> e se i numeri non corrispondessero saprebbe che il file relativo è corrotto, o è stato alterato.
ja: <file>.dsc</file> と <file>.changes</file> ファイルに記載されている長い数字の羅列は各ファイルの MD5/SHA1/SHA256 チェックサムです。パッケージをダウンロードした人は、<manref section="1" name="md5sum">、 <manref section="1" name="sha1sum">、<manref section="1" name="sha256sum">を使って整合性をテストすることができます。もし、数字が一致しない場合には、ファイルが壊れているか、あるいは何者かによって改ざんされていると分かるわけです。
zh_cn: <file>.dsc</file> 和 <file>.changes</file> 文件中很长的数字串是其中提及文件的 MD5/SHA1/SHA256 校验和。下载你软件包的人可以使用 <manref section="1" name="md5sum">、<manref section="1" name="sha1sum"> 或 <manref section="1" name="sha256sum"> 来进行核对。如果校验和不符，则说明文件已被损坏或偷换。
zh_tw: <file>.dsc</file> 和 <file>.changes</file> 檔案中很長的數字串是其中提及檔案的 MD5/SHA1/SHA256 校驗和。下載你套件的人可以使用 <manref section="1" name="md5sum">、<manref section="1" name="sha1sum"> 或 <manref section="1" name="sha256sum"> 來進行覈對。如果校驗和不符，則說明檔案已被損壞或偷換。

source: Debian supports many <url id="http://www.debian.org/ports/" name="ports"> with the <url id="http://www.debian.org/devel/buildd/" name="autobuilder network"> running <prgn>buildd</prgn> daemons on many different architecture computers. Although you do not need to do this by yourself, you should be aware of what will happen on your packages. Let's look into roughly how your packages are rebuild for many different architectures by them. <footnote><p>The actual autobuilder system involves much more complicated schemes than the one documented here. Such details are beyond the scope of this document.</p></footnote>
ca: Debian manté diverses <url id="http://www.debian.org/ports/" name="adaptacions «ports»"> amb la <url id="http://www.debian.org/devel/buildd/" name="xarxa de servidors de compilació automàtica"> que executa dimonis <prgn>buildd</prgn> en ordinadors d'arquitectura diferent. Encara que tu no hauràs de fer res de tot això, has de conèixer el processament del teu paquet. Veurem com es processa el paquet per compilar-ho en diferents arquitectures <footnote><p>El funcionament del sistema actual de compilació automàtica és més complicat del que s'explica en aquest document. Molts dels detalls del seu funcionament no són objectiu d'aquest document. </p></footnote>.
es: Debian mantiene diversas <url id="http://www.debian.org/ports/" name="adaptaciones «ports»"> con la <url id="http://www.debian.org/devel/buildd/" name="red de servidores de compilación automática"> que ejecuta demonios <prgn>buildd</prgn> en ordenadores con diferentes arquitecturas. Aunque no deberás hacer todo esto tú mismo, debes conocer el proceso al que se verá sometido tu paquete. Veamos cómo se procesa el paquete para compilarlo en diversas arquitecturas. <footnote><p>El funcionamiento del sistema actual de compilación automática es más complicado que lo expuesto en este documento. Muchos detalles quedan fuera de los objetivos de este documento. </p></footnote>.
fr: Debian gère de nombreux <url id="http://www.debian.org/ports/" name="portages"> avec le <url id="http://www.debian.org/devel/buildd/" name="réseau de serveurs d'empaquetage automatique"> faisant fonctionner des démons <prgn>buildd</prgn> sur de nombreux ordinateurs d'architectures différentes. Même si vous n'avez pas besoin de le faire vous-même, vous devriez être au courant de ce qui va arriver à vos paquets. La suite présente brièvement comment les paquets sont reconstruits sur ces différentes architectures. <footnote><p>Le véritable réseau de serveurs d'empaquetage automatique a un fonctionnement autrement plus compliqué que celui présenté ici. De tels détails sortent du cadre de ce document.</p></footnote>
it: Debian supporta molti <url id="http://www.debian.org/ports/" name="port"> tramite la <url id="http://www.debian.org/devel/buildd/" name="autobuilder network">, su cui sono in esecuzione i demoni di <prgn>buildd</prgn> su molti computer con architetture differenti. Anche se non sarà necessario fare questo da soli, si dovrebbe essere consapevoli di quello che succederà ai pacchetti. Si vedrà, in maniera non approfondita, come i pacchetti vengono ricostruiti per architetture differenti. <footnote><p>L'attuale sistema di auto-costruzione è molto più complicato di come è qui documentato. Tali dettagli esulano dallo scopo del documento.</p></footnote>
ja: Debian は、様々なアーキテクチャ上で<prgn>buildd</prgn>デーモンを走らせている<url id="http://www.debian.org/devel/buildd/" name="autobuilder network">によって、色々な<url id="http://www.debian.org/ports/" name="ports">をサポートしています。あなたがそれらを明示的に使う必要はありませんが、パッケージがどうなるのかを知っておくと良いでしょう。それでは、あなたのパッケージがどのように異なるアーキテクチャ向けに再構築されるのかを見ていきましょう。<footnote><p>実際の autobuilder システムは、本稿の説明よりもかなり複雑なスキームによって実現しています。それらの詳細は、本稿の範囲を超えるため割愛します。</p></footnote>
zh_cn: Debian 通过在各种不同构架的计算机上运行 <prgn>buildd</prgn> 守护进程组成的 <url id="http://www.debian.org/devel/buildd/" name="autobuilder network"> 来支持多种 <url id="http://www.debian.org/ports/" name="ports">。尽管这些工作不需要全由你完成，我们现在仍然要大致看看在各种构架上你的软件包是如果被构建的。<footnote><p>实际的自动编译系统涉及到比这篇文档所叙述的复杂许多的预设，这些细节已经超出了本文档的范围。<p></footnote>
zh_tw: Debian 通過在各種不同構架的計算機上運行 <prgn>buildd</prgn> 守護進程組成的 <url id="http://www.debian.org/devel/buildd/" name="autobuilder network"> 來支持多種 <url id="http://www.debian.org/ports/" name="ports">。儘管這些工作不需要全由你完成，我們現在仍然要大致看看在各種構架上你的套件是如果被構建的。<footnote><p>實際的自動編譯系統涉及到比這篇文件所敘述的複雜許多的預設，這些細節已經超出了本文件的範圍。<p></footnote>

source: For "<tt>Architecture: any</tt>" packages, the autobuilder system rebuild them. It ensures to install
ca: Els paquets del tipus <tt>Architecture: any</tt>, són construïts pel sistema de compilació automàtica. El sistema garanteix la instal·lació de:
es: Los paquetes del tipo <tt>Architecture: any</tt>, son construidos por el sistema de compilación automática. El sistema garantiza la instalación de:
fr: Les paquets « <tt>Architecture: any</tt> » sont reconstruits par les serveurs d'empaquetage automatique. Seront installés :
it: I pacchetti con "<tt>Architecture: any</tt>", verranno ricostruiti dal sistema di auto-costruzione. Ci si assicuri di avere installato
ja: "<tt>Architecture: any</tt>"のパッケージは、atuobuilder システムによって再構築されます。それは、
zh_cn: 对于 <tt>Architecture: any</tt> 的软件包，自动编译系统重构建它们，它确保系统中已经安装：
zh_tw: 對於 <tt>Architecture: any</tt> 的套件，自動編譯系統重構建它們，它確保系統中已經安裝：

source: the <package>build-essential</package> package, and
ca: el paquet <package>build-essential</package>, i
es: el paquete <package>build-essential</package>, y
fr: le paquet <package>build-essential</package> ;
it: il pacchetto <package>build-essential</package>, e
ja: <package>build-essential</package>パッケージと
zh_cn: <package>build-essential</package> 软件包；
zh_tw: <package>build-essential</package> 套件；

source: packages listed in the <tt>Build-Depends</tt> field (see <ref id="control">).
ca: els paquets llistats en el camp <tt>Build-Depends</tt> (consulta <ref id="control">).
es: los paquetes listados en el campo <tt>Build-Depends</tt> (véase <ref id="control">).
fr: les paquets énumérés dans le champ <tt>Build-Depends</tt>, cf. <ref id="control">.
ja: <tt>Build-Depends</tt>に挙げられているパッケージ (参照 <ref id="control">)を確実にインストールします。
zh_cn: 列于 <tt>Build-Depends</tt> 域的软件包(参看 <ref id="control">)。
zh_tw: 列於 <tt>Build-Depends</tt> 域的套件(參考 <ref id="control">)。

source: Then it issues the following command in the source directory:
ca: A continuació s'executa la següent ordre en el directori de les fonts:
es: A continuación se ejecuta la siguiente orden en el directorio de las fuentes:
fr: Ensuite, la commande suivante est exécutée dans le répertoire des sources :
it: Dopo si può eseguire il comando seguente nella directory dei sorgenti:
ja: そして、ソースディレクトリで次のコマンドを実行します:
zh_cn: 然后在源代码目录中执行以下命令：
zh_tw: 然後在原始碼目錄中執行以下命令：

source: This will do everything to make architecture dependent binary packages on another architecture. It will:
ca: D'aquest manera, s'executa tot el necessari per a la construcció del paquet binari depenent de l'arquitectura per a cada arquitectura. Fa el següent:
es: De esta manera, se ejecuta todo lo necesario para construir el paquete binario dependiente de la arquitectura en cada arquitectura. Hace lo siguiente:
fr: Ceci fera tout le nécessaire pour créer entièrement les paquets binaires dépendants de l'architecture sur l'architecture concernée :
it: Questo comando creerà i pacchetti binari e sorgenti al posto vostro. Eseguirà le seguenti operazioni:
ja: これは、別のアーキテクチャ上で、アーキテクチャ依存のバイナリパッケージを生成する作業をすべて行ってくれます。これには以下の作業が含まれます。
zh_cn: 这样会自动完成从源代码包构建平台依赖二进制包的工作，包括：
zh_tw: 這樣會自動完成從原始碼包構建平臺依賴二進位套件的工作，包括：

source: build architecture dependent binary packages ("<tt>fakeroot debian/rules binary-arch</tt>")
ca: construeix el paquet binari per a l'arquitectura (<tt>fakeroot debian/rules binary-arch</tt>).
es: construye el paquete binario para la arquitectura (<tt>fakeroot debian/rules binary-arch</tt>)
fr: construction des paquets binaires dépendants de l'architecture (« <tt>fakeroot debian/rules binary-arch</tt> ») ;
it: costruirà il pacchetto binario per una specifica architettura ("<tt>fakeroot debian/rules binary-arch</tt>")
ja: アーキテクチャ依存のバイナリパッケージを構築("<tt>fakeroot debian/rules binary-arch</tt>")
zh_cn: 构建平台依赖二进制包(<tt>fakeroot debian/rules binary-arch</tt>)
zh_tw: 構建平臺依賴二進位套件(<tt>fakeroot debian/rules binary-arch</tt>)

source: This is why you see your package for other architectures.
ca: Així, el paquet estarà disponible per a altres arquitectures.
es: Esta es la razón por la que el paquete estará disponible para otras arquitecturas.
fr: C'est pourquoi votre paquet est disponible sur plusieurs architectures.
it: È questo il motivo per il quale si vede il proprio pacchetto per altre architetture.
ja: あなたのパッケージが他のアーキテクチャ用にも存在するのは、このためです。
zh_cn: 这就是你看到你的软件包在其他平台上可用的原因。
zh_tw: 這就是你看到你的套件在其他平臺上可用的原因。
