Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: Line 4 is the name and email address of the maintainer. Make sure that this field includes a valid "<tt>To: </tt>" header for an email, because after you upload it, the bug tracking system will use it to deliver bug emails to you. Avoid using commas, ampersands and parenthesis.
it: La riga 4 indica il nome e l'indirizzo email del manutentore. Ci si assicuri che questo campo includa una testata "<tt>To: </tt>" valida per un indirizzo mail, perché una volta caricato il pacchetto, il sistema di rilevazione bug la userà per inviare le mail contenenti i bug. Si eviti di utilizzare virgole, 'e' commerciali e parentesi.

source: The 5th line includes the list of packages required to build your package as the <tt>Build-Depends:</tt> field. You can also have the <tt>Build-Depends-Indep:</tt> field as an additional line, here. (see the <url id="http://www.debian.org/doc/debian-policy/ch-relationships.html#s-sourcebinarydeps" name="Debian Policy Manual, 7.7 'Relationships between source and binary packages - Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep'">). Some packages like <package>gcc</package> and <package>make</package> which are required by the <package>build-essential</package> package are implied. If you need to have other tools to build your package, you should add them to these fields. Multiple entries are separated with commas; read on for the explanation of binary dependencies to find out more about the syntax of these lines.
it: La quinta linea include la lista dei pacchetti richiesti per costruire il pacchetto, ad es. il campo <tt>Build-Depends:</tt>. Si può, inoltre, avere una riga contenente il campo <tt>Build-Depends-Indep:</tt>. (vedere il <url id="http://www.debian.org/doc/debian-policy/ch--relationships.html#s-sourcebinarydeps" name="Manuale delle policy di Debian, 7.7 'Relazione tra pacchetti sorgenti e binari - Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep'">). Alcuni pacchetti come <package>gcc</package> e <package>make</package> sono richiesti implicitamente, dal pacchetto <package>build-essential</package>. Se si ha la necessità di avere altri strumenti per costruire il pacchetto, questi devono essere aggiunti negli appositi campi. I campi multipli sono separati con le virgole; si legga una spiegazione sulle dipendenze binarie per scoprirne di più sulla sintassi di queste righe.

source: For all packages packaged with the <prgn>dh</prgn> command in the <file>debian/rules</file> file, you must have "<tt>debhelper (>=7.0.50~)</tt>" in the <tt>Build-Depends:</tt> field to satisfy the Debian Policy requirement for the <tt>clean</tt> target.
it: Per tutti i pacchetti creati utilizzando il comando <prgn>dh</prgn> nel file <file>debian/rules</file>, è necessario avere "<tt>debhelper (>=7.0.50~)</tt>" nel campo <tt>Build-Depends:</tt>, per aderire alle policy di Debian che richiedono per l'obiettivo <tt>clean</tt>.

source: Line 6 is the version of the Debian Policy standards this package follows, the versions of the <url id="http://www.debian.org/doc/devel-manuals#policy" name="Debian Policy Manual"> you read while making your package.
it: La riga 6 indica la versione degli standard delle policy Debian che il pacchetto segue, corrispondenti alle versioni del <url id="http://www.debian.org/doc/devel-manuals#policy" name="Manuale delle policy Debian"> che si sono seguite per costruire il pacchetto.

source: On line 7 you can put the URL of the homepage for the upstream package.
it: Nella riga 7 si può inserire l'URL della pagina da cui prelevare il pacchetto originale.

source: Line 11 shows one of the most powerful features of the Debian packaging system. Packages can relate to each other in various ways. Apart from <tt>Depends:</tt>, other relationship fields are <tt>Recommends:</tt>, <tt>Suggests:</tt>, <tt>Pre-Depends:</tt>, <tt>Conflicts:</tt>, <tt>Provides:</tt>, and <tt>Replaces:</tt>.
it: La riga 11 mostra una delle caratteristiche più potenti del sistema di pacchettizzazione Debian. I pacchetti infatti possono relazionarsi tra di loro in differenti modi. A parte la già nota <tt>Depends:</tt>, altre relazioni sono <tt>Recommends:</tt>, <tt>Suggests:</tt>, <tt>Pre-Depends:</tt>, <tt>Conflicts:</tt>, <tt>Provides:</tt>, e <tt>Replaces:</tt>.

source: This is stronger than <tt>Depends:</tt>. The package will not be installed unless the packages it pre-depends on are installed and <em>correctly configured</em>. Use this <em>very</em> sparingly and only after discussing it on the <url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org"> mailing list. Read: don't use it at all. :-)
it: Questa relazione è più forte di <tt>Depends:</tt>. Il pacchetto non verrà installato a meno che i pacchetti da cui pre-dipende sono stati installati e <em>correttamente configurati</em>. Si usi questa relazione con <em>molta</em> parsimonia e solo dopo averne discusso sulla mailing list <url id="http://lists.debian.org/debian-devel/" name="debian-devel@lists.debian.org"> . Leggasi: non utilizzarla affatto. :-)

source: Use this when your program replaces files from another package, or completely replaces another package (used in conjunction with <tt>Conflicts:</tt>). Files from the named packages will be overwritten with the files from your package.
it: Si usi questa relazione quando il programma rimpiazza i file di un altro pacchetto, o lo rimpiazza completamente (utilizzato in congiunzione con <tt>Conflicts:</tt>). I file dei pacchetti indicati saranno sovrascritti con i file del nuovo pacchetto.

source: Having said all that, we can leave the <tt>Depends:</tt> field exactly as it is now, and insert another line after it saying "<tt>Suggests: file</tt>", because <package>gentoo</package> can use some features provided by that <package>file</package> package.
it: Avendo detto ciò, si può lasciare la riga <tt>Depends:</tt> esattamente come è ora, si può inserire un'altra riga dopo questa che dica "<tt>Suggests: file</tt>", perché <package>gentoo</package> può utilizzare alcune caratteristiche fornite dal pacchetto <package>file</package>.

source: Line 12 is the short description. Most people screens are 80 columns wide so this shouldn't be longer than about 60 characters. I'll change it to "<tt>fully GUI configurable X file manager using GTK+</tt>".
it: La riga 12 contiene una breve descrizione del pacchetto. La maggioranza degli schermi degli utenti è larga 80 colonne quindi il contenuto non dovrebbe superare i 60 caratteri. Si cambia questo valore in "<tt>fully GUI configurable X file manager using GTK+</tt>".

source: <prgn>dh_make</prgn> can give you a template copyright file. Let's use the "<tt>--copyright gpl2</tt>" option here to get a template file for the <package>gentoo</package> package released under GPL-2.
it: <prgn>dh_make</prgn> può fornire un modello di file del copyright, basta utilizzare l'opzione <tt>--copyright</tt> per selezionare quello giusto, se si desidera rilasciare il pacchetto <package>gentoo</package> sotto licenza GPL-2.

source: You must fill in missing information such as the place you got the package from, the actual copyright notice and their license to complete this file. For the common free software licenses such as GNU GPL-2, GNU GPL-3, LGPL-2, LGPL-3, BSD, Apache or the Artistic license, you can just refer to the appropriate file in <file>/usr/share/common-licenses/</file> directory that exists on every Debian system. Otherwise, you must include the complete license.
it: Si devono inserire le informazioni mancanti per completare questo file, come la fonte utilizzata per recuperare il pacchetto, le informazioni attuali di copyright e la licenza. Per le licenze più comuni relative al software libero come, GNU GPL-2, GNU GPL-3, LGPL-2, LGPL-3, BSD, Apache o la licenza Artistic, è possibile fare riferimento al file appropriato nella directory <file>/usr/share/common-licenses/</file> presente su ogni sistema Debian. In alternativa è necessario includere la licenza completa.

source: Please follow the HOWTO provided by ftpmasters and sent to debian-devel-announce: <url id="&copyright-howto;"> .
it: Si prega di seguire l'HOWTO fornito da ftpmasters ed inviato a debian-devel-announce: <url id="&copyright-howto;"> .

source: You can read more about updating the changelog file later in <ref id="update">.
it: Si possono leggere ulteriori informazioni sull'aggiornamento del file changelog successivamente in <ref id="update">.

source: Any extra details or discrepancies between the original package and your <em>debianized</em> version should be documented here.
it: Ogni ulteriore dettaglio o discrepanza tra il pacchetto originale e la versione <em>debianizzata</em>, che si è creata, dovrebbe essere documentato qui.

source: Files listed in the <file>install</file> file doesn't need the directories created first. See <ref id="install">
it: I file elencati nel file <file>install</file> non hanno bisogno che le directory vengano create prima. Si veda <ref id="install">

source: The <manref section="1" name="dh_installexamples"> command installs files and directories listed in this file as example files .
it: Il comando <manref section="1" name="dh_installexamples"> installa i file e le directory elencati al suo interno come file di esempio.

source: The <file><var>package</var>.default</file> file will be installed into <file>etc/default/<var>package</var></file>. This file sets defaults that are sourced by the init script. Most times this default file is used to disable running a daemon, set some default flags or timeouts. If your init script has certain <em>settable</em> features you want to install these into the default file, not the init script.
it: Il file <file><var>pacchetto</var>.default</file> viene installato in <file>etc/default/<var>pacchetto</var></file>. Questo file imposta delle variabili che vengono caricate dallo script di init. La maggioranza delle volte questo file predefinito viene utilizzato per disabilitare l'esecuzione di un demone, impostare degli argomenti predefiniti oppure dei timeout. Se lo script di init ha alcune caratteristiche <em>configurabili</em> si dovrà installare queste nel file predefinito, non nello script di init.

source: If your upstream package has an init file you can either use it or not. If you don't use their init.d script then create a new one in <file>debian/init</file>. However if the upstream init script looks fine and installs in the right place you still need to setup the <file>rc*</file> symlinks. To do this you will need to override <prgn>dh_installinit</prgn> in the <file>rules</file> file with the following lines:
it: Se il pacchetto originario ha un file di init si può decidere di utilizzarlo o meno. Se non viene utilizzato quello script init.d allora ne dovrà essere creato uno nuovo in <file>debian/init</file>. Comunque se lo script di init originario sembra funzionare bene ed installa tutto nella corretta destinazione, si devono comunque impostare i link simbolici <file>rc*</file>. Per fare questo si deve sovrascrivere <prgn>dh_installinit</prgn> nel file <file>rules</file> con le seguenti righe:

source: <file><var>package</var>.info</file> files
it: I file <file><var>pacchetto</var>.info</file>

source: Your program(s) should have a manual page. If they don't, you must create them. The <prgn>dh_make</prgn> command creates few template files for a manual page. These need to be copied and edited for each command without its manual page. Please make sure to remove unused templates.
it: I programmi creati dovrebbero avere una pagina che faccia da manuale. In caso contrario ciascuno di questi file contiene un modello che può essere riempito. Il comando <prgn>dh_make</prgn> crea diversi file modello per la pagina del manuale. Questi devono essere rinominati e modificati. Si faccia attenzione a rimuovere i file modello non utilizzati.

source: If you prefer XML over SGML, you can use the <tt>manpage.xml.ex</tt> template. If you do this, you have two choices:
it: Se si preferisce l'XML all'SGML, si può utilizzare il modello <tt>manpage.xml.ex</tt> . se si sceglie questa via si avranno due scelte:

source: <file><var>package</var>.manpages</file> files
it: I file <file><var>pacchetto</var>.manpages</file>

source: For <ref id="first">, we created 3 patches in <file>debian/patches</file>.
it: Per <ref id="first">, sono state create 3 patch in <file>debian/patches</file>.

source: packages listed in the <tt>Build-Depends:</tt> field (see <ref id="control">), and
it: i pacchetti elencati nel campo <tt>Build-Depends:</tt> (vedere <ref id="control">), e

source: packages listed in the <tt>Build-Depends-indep:</tt> field (see <ref id="control">).
it: i pacchetti elencati nel campo <tt>Build-Depends-indep:</tt> (vedere <ref id="control">).

source: This compressed tarball contains your <file>debian</file> directory contents. Each and every addition you made to the original source code are stored as quilt patches in <file>debian/patches</file>.
it: Questo file compresso contiene il contenuto della directory <file>debian</file>. Ogni modifica effettuata al codice sorgente originale, verrà memorizzata come patch di quilt in <file>debian/patches</file>.

source: packages listed in the <tt>Build-Depends:</tt> field (see <ref id="control">).
it: i pacchetti elencati nel campo <tt>Build-Depends:</tt> (vedere <ref id="control">).

source: Although packages listed in the <tt>Build-Depends-indep:</tt> field are required to be installed for the normal packaging by us (see <ref id="completebuild">), they are not required to be installed for the autobuilder system since it build only architecture dependent binary packages. <footnote><p>Unlike under the <package>pbuilder</package> package, the <prgn>chroot</prgn> environment under the <package>sbuild</package> package used by the autobuilder system does not force the minimal system and may leave many packages installed.</p></footnote> This difference between normal packaging and autobuilder situation dictates whether you record such required packages in the <tt>Build-Depends:</tt> or <tt>Build-Depends-indep:</tt> fields of the <file>debian/control</file> file (see <ref id="control">).
it: Anche se i pacchetti sono elencati nel campo <tt>Build-Depends-indep:</tt>, per la normale creazione del pacchetto, devono comunque essere installati (vedere <ref id="completebuild">), invece per il sistema di auto-costruzione non è necessario installarli dato che costruisce solamente pacchetti binari per una specifica architettura. <footnote><p>Diversamente dal pacchetto <package>pbuilder</package>, l'ambiente <prgn>chroot</prgn> sotto il pacchetto <package>sbuild</package>, usato dal sistema di auto-costruzione, non forza la creazione di un sistema minimale, e potrebbe lasciare installati molti pacchetti.</p></footnote> Questa differenza tra la normale pacchettizzazione e il sistema di auto-costruzione determina se i pacchetti richiesti devono essere registrati nei campi <tt>Build-Depends:</tt> o <tt>Build-Depends-indep:</tt> nel file <file>debian/control</file> (vedere <ref id="control">).

source: You have to make sure that there are no overlapped files with other existing packages using the <file>Contents-<var>i386</var></file> file downloaded from the Debian archive to prevent installation problem on different systems. The <prgn>apt-file</prgn> command may be handy for this task. If there are overlapped files, please take actions to avoid the real problem using the alternatives mechanism (see <manref section="1" name="update-alternatives">) by coordinating with other affected packages or by setting the "<tt>Conflicts:</tt>" entry in the <file>debian/control</file> file.
it: Bisogna assicurarsi che non ci siano file che si sovrappongono ad altri pacchetti esistenti utilizzando il file <file>Contents-<var>i386</var></file> scaricato dall'archivio Debian per prevenire problemi di installazione su sistemi differenti. Il comando <prgn>apt-file</prgn> può tornare utile a questo scopo. Se ci sono file che si sovrappongono, si prega di prendere delle misure per evitare l'insorgere del problema utilizzando meccanismi alternativi (si veda <manref section="1" name="update-alternatives">) che permettendo di coordinarsi con gli altri pacchetti interessati o settano la voce "<tt>Conflicts:</tt>" nel file <file>debian/control</file>.

source: "<tt>quilt new <var>bugname.patch</var></tt>" to set patch name.
it: "<tt>quilt new <var>bugname.patch</var></tt>" per impostare il nome della patch.

source: "<tt>quilt add <var>buggy-file</var></tt>" to declare file to be modified.
it: "<tt>quilt add <var>buggy-file</var></tt>" per indicare i file modificati.

source: Correct the problem in the package source for the upstream bug.
it: Correggere il problema evidenziato dal bug report nel pacchetto sorgente.

source: "<tt>quilt refresh</tt>" to record to <file><var>bugname.patch</var></file>.
it: "<tt>quilt refresh</tt>" per registrare le modifiche in <file><var>bugname.patch</var></file>.

source: "<tt>quilt header -e</tt>" to add its description.
it: "<tt>quilt header -e</tt>" per aggiungere una descrizione.

source: "<tt>quilt pop <var>foo.patch</var></tt>" to recall existing <file><var>foo.patch</var></file>.
it: "<tt>quilt pop <var>foo.patch</var></tt>" per richiamare la patch <file><var>foo.patch</var></file> esistente.

source: Correct the problem in the old <file><var>foo.patch</var></file>.
it: Correggere il problema nella vecchia patch <file><var>foo.patch</var></file>.

source: "<tt>quilt refresh</tt>" to update <file><var>foo.patch</var></file>.
it: "<tt>quilt refresh</tt>" per aggiornare <file><var>foo.patch</var></file>.

source: "<tt>quilt header -e</tt>" to update its description.
it: "<tt>quilt header -e</tt>" per aggiornarne la descrizione.

source: Changes to some auto-generated files by autotools such as <file>missing</file>, <file>aclocal.m4</file>, <file>config.guess</file>, <file>config.h.in</file>, <file>config.sub</file>, <file>configure</file>, <file>depcomp</file>, <file>install-sh</file>, <file>ltmain.sh</file>, and <file>Makefile.in</file> may be ignored. You may erase them before running <prgn>diff</prgn> to the source for inspection.
it: Cambiamenti effettuati ad alcuni file generati automaticamente dagli autotools come <file>missing</file>, <file>aclocal.m4</file>, <file>config.guess</file>, <file>config.h.in</file>, <file>config.sub</file>, <file>configure</file>, <file>depcomp</file>, <file>install-sh</file>, <file>ltmain.sh</file>, e <file>Makefile.in</file> possono essere ignorati. Possono anzi venire cancellati prima di eseguire <prgn>diff</prgn> per controllare i sorgenti.

source: If a package <package><var>foo</var></package> is properly packaged in the newer <tt>3.0 (native)</tt> or <tt>3.0 (quilt)</tt> formats, packaging a new upstream version is essentially moving the old <file>debian</file> directory to the new source. This can be done by running "<tt>tar xvzf /<var>path</var>/<var>to</var>/<var>foo</var>_<var>oldversion</var>.debian.tar.gz</tt>" in the new untared source. <footnote><p>If a package <package><var>foo</var></package> is packaged in the old <tt>1.0</tt> format, this can be done by running "<tt>zcat /<var>path</var>/<var>to</var>/<var>foo</var>_<var>oldversion</var>.diff.gz|patch -p1</tt>" in the new un-tared source, instead. </p></footnote> Of course, you need to do few obvious chores.
it: Se un pacchetto <package><var>foo</var></package> è stato impacchettato correttamente nei nuovi formati <tt>3.0 (native)</tt> o <tt>3.0 (quilt)</tt>, si rende necessario impacchettare anche la versione originale muovendo la directory <file>debian</file> nella nuova sorgente. Questo può essere fatto eseguendo "<tt>tar xvzf /<var>path</var>/<var>to</var>/<var>foo</var>_<var>oldversion</var>.debian.tar.gz</tt>" nella nuova directory sorgente scompattata. <footnote><p>Se un pacchetto <package><var>foo</var></package> è stato pacchettizzato nel vecchio formato <tt>1.0</tt>, si deve invece eseguire "<tt>zcat /<var>path</var>/<var>to</var>/<var>foo</var>_<var>oldversion</var>.diff.gz|patch -p1</tt>" nella nuova directory sorgente scompattata. </p></footnote> Ovviamente bisognerà effettuare alcuni passaggi.

source: If you need to add erased template files for any reason, you may run <prgn>dh_make</prgn> again in the same, already <em>debianized</em>, directory with <tt>--addmissing</tt> option. Then edit it properly.
it: Se c'è bisogno per qualsiasi motivo di aggiungere file di template cancellati, si può ancora eseguire il comando <prgn>dh_make</prgn> nella stessa directory, già <em>debianizzata</em>, con l'opzione <tt>--addmissing</tt>. Fatto ciò si potrà modificarla di conseguenza.

source: If you want to update the <file>rules</file> file created with the makefile inclusion mechanism of the Common Debian Build System (<package>cdbs</package>) to the <prgn>dh</prgn> syntax, see <file>/usr/share/doc/cdbs/cdbs-doc.html</file> and understand its <tt>DEB_*</tt> configuration variables. <footnote><p>In the <package>cdbs</package> (0.4.74) package, there are some negative descriptions of the <file>rules</file> file created by the <prgn>dh_make</prgn> command for the non-<package>cdbs</package> choices. Do not worry about it. It applies only for <tt>lenny</tt> which created explicit targets with long list of <prgn>dh_*</prgn> commands.</p></footnote>
it: Se si vuole aggiornare il file <file>rules</file> creato con il meccanismo di inclusione del makefile del Common Debian Build System (<package>cdbs</package>) per la sintassi di <prgn>dh</prgn>, si veda <file>/usr/share/doc/cdbs/cdbs-doc.html</file> e si presti attenzione alle sue variabili di configurazione <tt>DEB_*</tt>. <footnote><p>Nel pacchetto <package>cdbs</package> (0.4.74), ci sono alcune note errate riguardo al file <file>rules</file> creato dal comando <prgn>dh_make</prgn> per le scelte che non utilizzano <package>cdbs</package>. Non ce se ne deve preoccupare. Queste ultime si riferivano solo alla distribuzione <tt>lenny</tt> che creava esplicitamente delle regole come una lunga lista di comandi <prgn>dh_*</prgn>.</p></footnote>

source: Preserve old changelog entries (sounds obvious, but there have been incidents to type "<tt>dch</tt>" when you should have typed "<tt>dch -i</tt>".)
it: Si preservino le vecchie voci del changelog (sembra ovvio, ma a volte si sono verificati problemi per aver scritto "<tt>dch</tt>" mentre si sarebbe dovuto scrivere "<tt>dch -i</tt>".)

source: Check the contents of the <file>.changes</file> file to make sure you are uploading to the correct distribution, the proper bugs closures are listed in the <tt>Closes:</tt> field, the <tt>Maintainer:</tt> and <tt>Changed-By:</tt> fields match, the file is GPG-signed, etc.
it: Si controlli il contenuto del file <file>.changes</file> per essere sicuri che si stia caricando la distribuzione corretta; le risoluzioni ai bug vengono listate nel campo <tt>Closes:</tt>, i campi <tt>Maintainer:</tt> e <tt>Changed-By:</tt> corrispondono, il file è firmato con GPG, ecc.
