Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: As a novice maintainer, you should avoid any manual editing of <em>maintainer scripts</em> because they are problematic. For more information look in the <url id="http://www.debian.org/doc/debian-policy/ch-maintainerscripts.html" name="Debian Policy Manual, 6 'Package maintainer scripts and installation procedure'">, and take a look at these example files provided by <prgn>dh_make</prgn>.
ca: Hauries d'evitar editar manualment els <em>guions del desenvolupador</em> degut a la seva complexitat. Consulta <url id="http://www.debian.org/doc/debian-policy/ch-maintainerscripts.html" name="«Debian Policy Manual, 6 'Package maintainer scripts and installation procedure'»">, i examina els exemples contruïts per <prgn>dh_make</prgn>.
es: Por ahora, deberías intentar evitar editar manualmente estos <em>guiones del desarrollador</em> si puedes porque suelen hacerse muy complejos. Para más información lee <url id="http://www.debian.org/doc/debian-policy/ch-maintainerscripts.html" name="«Debian Policy Manual, 6 'Package maintainer scripts and installation procedure'»">, y echa un vistazo a los ejemplos proporcionados por <prgn>dh_make</prgn>.
fr: En tant que responsable débutant, vous devriez éviter de modifier manuellement les <em>scripts du responsable</em> parce qu'ils ont tendance à être complexes. Pour plus d'informations, regardez dans la <url id="http://www.debian.org/doc/debian-policy/ch-maintainerscripts.html" name="Charte Debian, chapitre 6 « scripts du responsable et procédure d'installation »">, et examinez les fichiers d'exemple fournis par <prgn>dh_make</prgn>.
it: Un nuovo manutentore dovrebbe, se possibile, evitare ogni modifica manuale degli <em>script del manutentore</em> perché potrebbero creare dei problemi. Per maggiori informazioni si guardi nel <url id="http://www.debian.org/doc/debian-policy/ch-maintainerscripts.html" name="Manuale delle policy di Debian, 6 'Script di manutenzione del pacchetto e procedure di installazione'">, e si dia un'occhiata ai file di esempio forniti da <prgn>dh_make</prgn>.
ja: メンテナ初心者のうちは、問題になることが多いので<em>maintainer scripts</em>を直接編集しないようにしましょう。詳しくは<url id="http://www.debian.org/doc/debian-policy/ch-maintainerscripts.html" name="Debian Policy Manual, 6 'Package maintainer scripts and installation procedure'">を参照し、<prgn>dh_make</prgn>によって生成されるサンプルファイルに目を通してください。
zh_cn: 作为一个新维护人员，你应当避免手工编辑 <em>maintainer scripts</em>，因为它们常存在各种问题。更多信息请阅读 <url id="http://www.debian.org/doc/debian-policy/ch-maintainerscripts.html" name="Debian Policy Manual, 6 'Package maintainer scripts and installation procedure'"> 并查看 <prgn>dh_make</prgn> 给出的示例。
zh_tw: 作爲一個新維護人員，你應當避免手工編輯 <em>maintainer scripts</em>，因爲它們常存在各種問題。更多訊息請閱讀 <url id="http://www.debian.org/doc/debian-policy/ch-maintainerscripts.html" name="Debian Policy Manual, 6 'Package maintainer scripts and installation procedure'"> 並查看 <prgn>dh_make</prgn> 給出的範例。

source: If you did not listen to me and made your custom <em>maintainer scripts</em> for a package, you should make sure to test them not only for <strong>install</strong> and <strong>upgrade</strong> but also for <strong>remove</strong> and <strong>purge</strong>.
ca: Si malgrat les meves advertències, adaptes els <em>guions del desenvolupador</em> per al teu paquet, comprova el seu funcionament en la <strong>instal·lació</strong>, <strong>actualització</strong>, <strong>desinstal·lació</strong> i <strong>eliminació completa</strong>.
es: Si a pesar de mis advertencias, adaptas los <em>guiones del desarrollador</em> para el paquete, asegúrate de comprobar su funcionamiento no sólo para la <strong>instalación</strong> y <strong>actualización</strong> del paquete, sino también para su <strong>desinstalación</strong> y <strong>eliminación completa</strong>.
fr: Si vous préférez n'en faire qu'à votre tête en personnalisant vos <em>scripts du responsable</em> pour un paquet, vous devriez les essayer non seulement lors de l'<strong>installation</strong> et la <strong>mise à jour</strong>, mais aussi pour la <strong>désinstallation</strong> et la <strong>purge</strong>.
it: Se non si è data retta e si sono creati dei <em>script del manutentore</em> personalizzati per un pacchetto, bisogna essere sicuri di averli provati non solo per <strong>install</strong> e <strong>upgrade</strong>, ma anche per <strong>remove</strong> e <strong>purge</strong>.
ja: もし私の忠告を無視して、<em>maintainer scripts</em>を直接編集した場合は、 <strong>インストール</strong>、<strong>アップグレード</strong>だけでなく、 <strong>削除</strong>と<strong>パージ</strong>のテストもしっかり行ってください。
zh_cn: 如果你不听我的劝告，自己为一个软件包创建了 <em>maintainer scripts</em>，你必须保证不仅测试 <strong>install</strong> 和 <strong>upgrade</strong>，还应测试 <strong>remove</strong> 和 <strong>purge</strong>。
zh_tw: 如果你不聽我的勸告，自己爲一個套件創建了 <em>maintainer scripts</em>，你必須保證不僅測試 <strong>install</strong> 和 <strong>upgrade</strong>，還應測試 <strong>remove</strong> 和 <strong>purge</strong>。

source: Upgrades to the new version should be silent and non-intrusive (existing users should not notice the upgrade except by discovering that old bugs have been fixed and there perhaps are new features).
ca: Les actualitzacions a una nova versió cal que siguin «silencioses» i no intrusives (els usuaris només haurien de veure que s'han arreglat els errors i afegit noves funcions).
es: Las actualizaciones a una nueva versión deben ser «silenciosas» y no intrusivas. Los usuarios no deberían darse cuenta de la actualización, salvo quizás para descubrir que se han arreglado errores antiguos y porque hay alguna nueva funcionalidad.
fr: Les mises à jour devraient être silencieuses et non intrusives (les utilisateurs existants ne devraient pas remarquer la mise à jour à part en constatant la résolution de vieux bogues et peut-être l'arrivée de nouvelles fonctionnalités).
it: Gli aggiornamenti alle nuove versioni dovrebbero essere indolore e non invadenti (gli utenti esistenti non dovrebbero notare gli aggiornamenti a meno di scoprire che vecchi bug sono stati corretti e che vi sono magari delle nuove funzionalità).
ja: 新バージョンへのアップグレードはおとなしく、そして押し付けがましくしてはいけません。（現行のユーザは、バグが直されたことと新機能の追加以外については、アップグレードに気づかないのが理想です。)
zh_cn: 升级到新版本应当是静默的(已有用户应当只在发现旧的 Bug 被修复或有新特性时注意到升级的变化)。
zh_tw: 升級到新版本應當是靜默的(已有用戶應當只在發現舊的 Bug 被修復或有新特性時注意到升級的變化)。

source: When the upgrade is necessarily intrusive (eg., config files scattered through various home directories with totally different structure), you may consider to set package to the safe default (e.g., disabled service) and provide proper documentations required by the policy (<file>README.Debian</file> and <file>NEWS.Debian</file>) as the last resort. Don't bother user with the <prgn>debconf</prgn> note invoked from these <em>maintainer scripts</em> for upgrades.
ca: Quan l'actualització és necessàriament intrusiva (p. ex. fitxers de configuració dispersos en diversos directoris amb una estructura totalment modificada), s'haurien d'establir els valors predeterminats segurs (p. ex. desactivar els serveis) i facilitar la documentació apropiada establerta en les normes (fitxers <file>README.Debian</file> i <file>NEWS.Debian</file>) com a darrer recurs. Cal evitar molestar a l'usuari amb notes <prgn>debconf</prgn> invocades pels <em>guions del desenvolupador</em> en les actualitzacions.
es: Cuando la actualización es necesariamente intrusiva (p.e. archivos de configuración dispersos en varios directorios con una estructura totalmente modificada), se deberían establecer los valores predeterminados seguros (p.e. desactivar los servicios) y facilitar la documentación apropiada establecida por las normas (archivos <file>README.Debian</file> y <file>NEWS.Debian</file>) como último recurso. Hay que evitar molestar al usuario con notas <prgn>debconf</prgn> invocadas por los <em>guiones del desarrollador</em> en las actualizaciones.
fr: Lorsque la mise à jour est forcément intrusive (par exemple des fichiers de configuration dispersés dans plusieurs répertoires personnels avec des structures complètement différentes), vous pouvez envisager de remettre une configuration par défaut sûre du paquet (par exemple avec service désactivé), et de fournir les documentations adéquates requises par la Charte Debian (<file>README.Debian</file> et <file>NEWS.Debian</file>) en dernier ressort. N'embêtez pas l'utilisateur avec une note debconf déclenchée par ces <em>scripts du responsable</em> lors des mises à jour.
it: Quando l'aggiornamento deve per forza di cose essere invadente (per esempio, file di configurazione sparsi all'interno di diverse cartelle home con strutture totalmente differenti), si può impostare il pacchetto ai valori sicuri predefiniti (esempio, servizi disabilitati) e fornire una valida documentazione come richiesto dalla policy (<file>README.Debian</file> e <file>NEWS.Debian</file>) come ultima spiaggia. Sarebbe meglio non disturbare l'utente con la nota <prgn>debconf</prgn> richiamata da questi <em>script del manutentore</em> per gli aggiornamenti.
ja: アップグレードが出しゃばる必要がある場合(例えば構造が変わって、設定ファイルがあっちこちに散らばってしまった場合など)、パッケージのデフォルトを安全側に設定したり(例えばサービスを停止しておくなど)、最後の手段としてはポリシーに要求されるきちんとしたドキュメント(<file>README.Debian</file>と<file>NEWS.Debian</file>)を提供するなどの対策を考えるべきです。アップグレード際に<em>maintainer scripts</em>で<prgn>debconf</prgn>ノートを呼び出すような嫌がらせはやめてください。
zh_cn: 当更新必须以非静默模式进行时(例如多个主目录中的配置文件都要改为完全不同的结构时)，你应该考虑将软件包设置到安全的默认配置(例如禁用服务)并按照 Debian Policy 提供相应的文档(<file>README.Debian</file> 和 <file>NEWS.Debian</file>)。不要在升级时使用 <em>maintainer scripts</em> 触发 <prgn>debconf</prgn> 来打扰用户。
zh_tw: 當更新必須以非靜默模式進行時(例如多個主目錄中的設定檔案都要改爲完全不同的結構時)，你應該考慮將套件設置到安全的默認設定(例如禁用服務)並按照 Debian Policy 提供相應的文件(<file>README.Debian</file> 和 <file>NEWS.Debian</file>)。不要在升級時使用 <em>maintainer scripts</em> 觸發 <prgn>debconf</prgn> 來打擾用戶。

source: The <package>ucf</package> package provides <em>conffile-like</em> handling infrastructure to preserve user changes for files that may not be labeled <em>conffiles</em> such as ones managed by the <em>maintainer scripts</em>. This should minimize issues associated with them.
ca: El paquet <package>ucf</package> facilita el sistema <em>conffile-like</em> per preservar els canvis de configuració realitzats per l'usuari i per això no han de nomenar-se com <em>conffiles</em> els fitxers gestionats pels <em>guions del desenvolupador</em>. Així es minimitzen les incidències associades amb ells.
es: El paquete <package>ucf</package> facilita el sistema <em>conffile-like</em> para preservar los cambios de configuración realizados por el usuario y por ello no deben nombrarse como <em>conffiles</em> los archivos manejados por los <em>guiones del desarrollador</em>. Así se minimizan las incidencias asociadas con ellos.
fr: Le paquet <package>ucf</package> fournit un dispositif <em>à la conffile</em> pour conserver les modifications des utilisateurs pour les fichiers qui n'ont pas été marqués <em>conffiles</em> comme ceux gérés par les <em>scripts du responsable</em>. Cela permet de réduire les problèmes associés à ces fichiers.
ja: <package>ucf</package>パッケージは、<em>maintainer scripts</em>によって管理されているような<em>conffiles</em>にされていない、ユーザによって変更されたファイルを保存し、<em>conffileのように</em>処理する仕組みを提供します。この仕組みによって、関連する問題を最小化しています。
zh_cn: <package>ucf</package> 软件包提供了 <em>类似 conffile</em> 的对不应标记为 <em>conffiles</em> 的文件的保留机制。这可以将与 <em>maintainer scripts</em> 相关的问题减少到最低。
zh_tw: <package>ucf</package> 套件提供了 <em>類似 conffile</em> 的對不應標記爲 <em>conffiles</em> 的檔案的保留機制。這可以將與 <em>maintainer scripts</em> 相關的問題減少到最低。

source: These <em>maintainer scripts</em> are the Debian enhancements that explain <strong>why people choose Debian</strong>. You must be very careful not to annoy them with these.
ca: Aquests <em>guions del desenvolupador</em> són un exemple de les característiques de Debian que expliquen <strong>perquè la gent elegeix Debian</strong>. Has de ser acurat amb no molestar amb ells.
es: Estos <em>guiones del desarrollador</em> son un ejemplo de las características de Debian que explican <strong>por qué la gente elige Debian</strong>. Debes ser cuidadoso con no molestarles con ellos.
fr: Ces <em>scripts du responsable</em> sont des améliorations Debian qui expliquent <strong>pourquoi les gens choisissent Debian</strong>. Prenez garde de ne pas les ennuyer avec ces scripts.
it: Questi <em>script del manutentore</em> sono delle migliorie di Debian che fanno capire <strong>come mai le persone scelgano Debian</strong>. Bisogna stare molo attenti a non infastidirle a causa loro.
ja: これら、<em>maintainer scripts</em>は<strong>なぜDebianを選ぶのか</strong>という理由の１つでもあります。これらの仕組みで、ユーザの邪魔をしないようにしましょう。
zh_cn: 这些 <em>maintainer scripts</em> 是 Debian 对于软件系统的增强特性，它们解释了 <strong>人们为什么选择 Debian</strong>。你必须非常小心，保证人们不因此产生烦恼。
zh_tw: 這些 <em>maintainer scripts</em> 是 Debian 對於軟體系統的增強特性，它們解釋了 <strong>人們爲什麼選擇 Debian</strong>。你必須非常小心，保證人們不因此產生煩惱。

source: <file>TODO</file> file
ca: Fitxer <file>TODO</file>.
es: Archivo <file>TODO</file>
fr: Fichier <file>TODO</file>
it: Il file <file>TODO</file>
ja: <file>TODO</file> ファイル
zh_cn: <file>TODO</file> 文件
zh_tw: <file>TODO</file> 檔案

source: The <manref section="1" name="dh_installdocs"> command installs this.
ca: L'ordre <manref section="1" name="dh_installdocs"> instal·la aquest arxiu.
es: La orden <manref section="1" name="dh_installdocs"> instala este archivo.
fr: La commande <manref section="1" name="dh_installdocs"> l'installe.
it: Il comando <manref section="1" name="dh_installdocs"> installa questo file.
ja: <manref section="1" name="dh_installdocs">コマンドでインストールします。
zh_cn: <manref section="1" name="dh_installdocs"> 命令会安装这个文件。
zh_tw: <manref section="1" name="dh_installdocs"> 命令會安裝這個檔案。

source: <file>watch</file> file
ca: Fitxer <file>watch.ex</file>.
es: Archivo <file>watch.ex</file>
fr: Fichier <file>watch</file>
it: Il file <file>watch</file>
ja: <file>watch</file> ファイル
zh_cn: <file>watch</file> 文件
zh_tw: <file>watch</file> 檔案

source: The <file>watch</file> file format is documented in the <manref section="1" name="uscan"> manpage. The <file>watch</file> file configures the <prgn>uscan</prgn> program (in the <package>devscripts</package> package) to watch the site where you originally got the source from. This is also used by <url id="http://wiki.debian.org/DEHS" name="Debian External Health Status (DEHS)">.
ca: El format del fitxer <file>watch</file> està documentat en la pàgina de manual de <manref section="1" name="uscan">. El fitxer <file>watch</file> es fa servir per configurar el programa <prgn>uscan</prgn> (del paquet <package>devscripts</package>) que vigila el servidor on està el codi font original. També ho fa servir <url id="http://wiki.debian.org/DEHS" name="«Debian External Health Status (DEHS)»">.
es: El formato del archivo <file>watch</file> se documenta en la página de manual de <manref section="1" name="uscan">. El archivo <file>watch</file> se usa para configurar el programa <prgn>uscan</prgn> (del paquete <package>devscripts</package>) que vigila el servidor de donde obtuviste las fuentes originales. También lo utiliza <url id="http://wiki.debian.org/DEHS" name="«Debian External Health Status (DEHS)»">.
fr: Le format du fichier <file>watch</file> est documenté dans la page de manuel <manref section="1" name="uscan">. Le fichier <file>watch</file> configure le programme <prgn>uscan</prgn> (dans le paquet <package>devscripts</package>) pour surveiller le site sur lequel vous avez obtenu les sources. C'est également utilisé par l'<url id="http://wiki.debian.org/DEHS" name="état de santé exterieur à Debian ou « Debian External Health Status » (DEHS)">.
it: Questo file è utilizzato per configurare il programma <manref section="1" name="uscan"> (nel pacchetto <package>devscripts</package> ). Questo viene utilizzato per controllare il sito da cui sono stati presi i sorgenti originali. Viene utilizzato anche da <url id="http://wiki.debian.org/DEHS" name="Debian External Health Status (DEHS)">.
ja: <file>watch</file>ファイルの書式は<manref section="1" name="uscan">を参照してください。<file>watch</file>ファイルは、<prgn>uscan</prgn> ( <package>devscripts</package>パッケージに含まれます)を設定し、ソースをどこから入手したのかを監視しています。<url id="http://wiki.debian.org/DEHS" name="Debian External Health Status (DEHS)">によっても使用されています。
zh_cn: <file>watch</file> 文件的格式被详述于 <manref section="1" name="uscan"> man 手册页中。<file>watch</file> 文件配置了 <prgn>uscan</prgn> 程序(<package>devscripts</package> 中)以便监视你获得原始源代码的网站。它还被用于 <url id="http://wiki.debian.org/DEHS" name="Debian External Health Status (DEHS)">。
zh_tw: <file>watch</file> 檔案的格式被詳述於 <manref section="1" name="uscan"> man 手冊頁中。<file>watch</file> 檔案設定了 <prgn>uscan</prgn> 程式(<package>devscripts</package> 中)以便監視你獲得原始原始碼的網站。它還被用於 <url id="http://wiki.debian.org/DEHS" name="Debian External Health Status (DEHS)">。

source: Here's what I put in it:
ca: Això he escrit jo:
es: Esto es lo que he puesto yo:
fr: Voici ce qu'il contient ici :
it: Questo è ciò che si può mettere al suo interno:
ja: 今回は以下のようにしました。
zh_cn: 以下是我写入的内容：
zh_tw: 以下是我寫入的內容：

source: Normally with this <file>watch</file> file, the URL at "<tt>http://sf.net/gentoo</tt>" is downloaded and searched for links of the form "<tt>&lt;a href=...&gt;</tt>". The base name (just the part after the final "<tt>/</tt>") of these linked URLs are matched against Perl regexp (see <manref section="1" name="perlre">) pattern "<tt>gentoo-(.+)\.tar\.gz</tt>". Out of matched files, the file with the greatest version number is downloaded and the <prgn>uupdate</prgn> program is run to create the updated source tree from them.
ca: Amb aquest arxiu <file>watch</file>, l'URL <tt>http://sf.net/gentoo</tt> es descarrega i es busca els enllaços de tipus "<tt>&lt;a href=...&gt;</tt>". El nom base (just la part després del "<tt>/</tt>" final) d'aquests enllaços URL es comparen amb la funció «regexp» de Perl (consulta <manref section="1" name="perlre">) amb el patró "<tt>gentoo-(.+)\.tar\.gz</tt>". Dels fitxers trobats que s'ajusten al patró, es descarrega el de la versió més recent i el programa <prgn>uupdate</prgn> s'executa per actualitzar el codi original.
es: Con el archivo <file>watch</file>, la URL "<tt>http://sf.net/gentoo</tt>" se descarga y se buscan los enlaces del tipo "<tt>&lt;a href=...&gt;</tt>". El nombre base (justo la parte después del "<tt>/</tt>" final) de las direcciones URL enlazadas se comparan con la expresión regular de Perl (véase <manref section="1" name="perlre">) con el patrón "<tt>gentoo-(.*)\.tar\.gz</tt>". Se descarga el archivo de versión más reciente de entre todos los archivos encontrados cuyo nombre se ajuste al patrón, y se ejecutará el programa <prgn>uupdate</prgn> para construir el árbol de código fuente actualizado en base a este fichero.
ja: 通常、この<file>watch</file>ファイルでは、"<tt>http://sf.net/gentoo</tt>"のURLがダウンロードされ、"<tt>&lt;a href=...&gt;</tt>"フォームへのリンクを検索します。リンクされたURLのベースネーム(最後の"<tt>/</tt>"から後の部分)はPerlの正規表現(参照 <manref section="1" name="perlre">)パターン"<tt>gentoo-(.+)\.tar\.gz</tt>"に照らし合わされます。一致したファイルの中から、バージョンの番号が一番大きいものがダウンロードされ、アップデートのためのソースツリーを作成するために<prgn>uupdate</prgn>を実行します。
zh_cn: 通常，在按照这个 <file>watch</file> 文件执行时，URL <tt>http://sf.net/gentoo</tt>" 会被下载，程序在其中搜搜 <tt>&lt;a href=...&gt;</tt>。<tt>/</tt> 后的基本名称会按照 Perl 正则表达式匹配(参看 <manref section="1" name="perlre">) <tt>gentoo-(.+)\.tar\.gz</tt>。在所有匹配的文件里，将会下载带有最大版本号的，此后由 <prgn>uupdate</prgn> 程序创建更新的源代码树。

source: Although this is true for other sites, the SourceForge download service at <url id="http://sf.net"> is an exception. When the <file>watch</file> file has an URL matching with the Perl regexp "<tt>^http://sf\.net/</tt>", the <prgn>uscan</prgn> program substitutes it with "<tt>http://qa.debian.org/watch/sf.php/</tt>" and then applies this rule. The URL redirector service at this <url id="http://qa.debian.org/"> is designed to offer a stable redirect service to the desired file for the <file>watch</file> file having "<tt>http://sf.net/<var>project</var>/<var>tar-name</var>-(.+)\.tar\.gz</tt>". This solves issues related to the periodically changing URL there.
ca: Encara que és possible fer això amb altres portals, el servei de descàrrega «SourceForge» a <url id="http://sf.net"> és una excepció. Quan el fitxer <file>watch</file> té una URL que concorda amb el patró Perl <tt>^http://sf\.net/</tt>, el programa <prgn>uscan</prgn> el substitueix per <tt>http://qa.debian.org/watch/sf.php/</tt> i després aplica la regla. El servei de re-adreçament URL a la de <url id="http://qa.debian.org/"> està dissenyat per oferir un servei estable de en el fitxer present en <file>watch</file> i que concordi amb <tt>http://sf.net/<var>projecto</var>/<var>nom_arxiu_tar</var>-(.+)\.tar\.gz</tt>.
es: Aunque es posible hacer esto con otros portales, el servicio de descarga de «SourceForge» en <url id="http://sf.net"> es una excepción. Cuando el archivo <file>watch</file> tiene una URL que concuerda con el patrón Perl <tt>^http://sf\.net/</tt>, el programa <prgn>uscan</prgn> lo substituye por <tt>http://qa.debian.org/watch/sf.php/</tt> y después aplica esta regla. El servicio de redireccionamiento URL a la dirección <url id="http://qa.debian.org/"> está diseñado para ofrecer un servicio estable de redireccionamiento al archivo presente en <file>watch</file> y que concuerda con <tt>http://sf.net/<var>proyecto</var>/<var>nombre_archivo_tar</var>-(.*)\.tar\.gz</tt>
fr: Bien que ce soit vrai pour les autres sites, le service de téléchargement de SourceForge en <url id="http://sf.net"> est une exception. Quand le fichier <file>watch</file> comporte une URL concordant avec le motif d'expression rationnelle « <tt>^http://sf\.net/</tt> », le programme <prgn>uscan</prgn> le remplace par « <tt>http://qa.debian.org/watch/sf.php/</tt> » et applique ensuite cette règle. Le service de redirection en <url id="http://qa.debian.org/"> est conçu pour offrir un service stable vers le fichier voulu pour un fichier <file>watch</file> avec « <tt>http://sf.net/<var>projet</var>/<var>nom-d-archive</var>-(.+)\.tar\.gz</tt> ». Le but est de résoudre le problème lié au fréquent changement d'URL pour ce domaine.
ja: 他のサイトでは上記の通りですが、<url id="http://sf.net">のSourceForgeのダウンロードサービスは例外です。<file>watch</file>ファイルがPerlの正規表現"<tt>^http://sf\.net/</tt>"に一致するURLを含む場合、<prgn>uscan</prgn>プログラムが代わりに"<tt>http://qa.debian.org/watch/sf.php/</tt>"を使い、このルールを当てはめます。<url id="http://qa.debian.org/">のURLリダイレクトは"<tt>http://sf.net/<var>project</var>/<var>tar-name</var>-(.+)\.tar\.gz</tt>"を含む<file>watch</file>ファイルのために安定したリダイレクトを提供するよう設計されています。これにより、周期的に変化するURLに関する問題を解決しています。
zh_cn: 尽管上述内容对于所有站点都适用，但 SourceForge 下载服务(<url id="http://sf.net">)仍是一个例外。当 <file>watch</file> 中包含匹配 Perl 正则表达式 <tt>^http://sf\.net/</tt> 的 URL 时，<prgn>uscan</prgn> 程序会将其替换为 <tt>http://qa.debian.org/watch/sf.php/</tt> 然后应用此规则。<url id="http://qa.debian.org/"> 的 URL 重定向服务器被设计用于提供一个稳定的重定向服务以满足 <file>watch</file> 文件中的 <tt>http://sf.net/<var>project</var>/<var>tar-name</var>-(.+)\.tar\.gz</tt> 形式，这样解决了关于经常性 URL 变更导致的问题。
zh_tw: 儘管上述內容對於所有站點都適用，但 SourceForge 下載服務(<url id="http://sf.net">)仍是一個例外。當 <file>watch</file> 中包含匹配 Perl 正則表達式 <tt>^http://sf\.net/</tt> 的 URL 時，<prgn>uscan</prgn> 程式會將其替換爲 <tt>http://qa.debian.org/watch/sf.php/</tt> 然後應用此規則。<url id="http://qa.debian.org/"> 的 URL 重定向服務器被設計用於提供一個穩定的重定向服務以滿足 <file>watch</file> 檔案中的 <tt>http://sf.net/<var>project</var>/<var>tar-name</var>-(.+)\.tar\.gz</tt> 形式，這樣解決了關於經常性 URL 變更導致的問題。

source: <file>source/format</file> file
ca: Fitxer <file>source/format</file>.
es: Archivo <file>source/format</file>
fr: Fichier <file>source/format</file>
it: Il file <file>source/format</file>
ja: <file>source/format</file> ファイル
zh_cn: <file>source/format</file> 文件
zh_tw: <file>source/format</file> 檔案
