Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: 1 Format-Specification: http://svn.debian.org/wsvn/dep/web/deps/dep5.mdwn?op=file&amp;rev=135 2 Name: gentoo 3 Maintainer: Josip Rodin &lt;joy-mg@debian.org&gt; 4 Source: http://sourceforge.net/projects/gentoo/files/ 5 6 Copyright: 1998-2010 Emil Brink &lt;emil@obsession.se&gt; 7 License: GPL-2+ 8 9 Files: icons/* 10 Copyright: 1998 Johan Hanson &lt;johan@tiq.com&gt; 11 License: GPL-2+ 12 13 Files: debian/* 14 Copyright: 1998-2010 Josip Rodin &lt;joy-mg@debian.org&gt; 15 License: GPL-2+ 16 17 License: GPL-2+ 18 This program is free software; you can redistribute it and/or modify 19 it under the terms of the GNU General Public License as published by 20 the Free Software Foundation; either version 2 of the License, or 21 (at your option) any later version. 22 . 23 This program is distributed in the hope that it will be useful, 24 but WITHOUT ANY WARRANTY; without even the implied warranty of 25 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 26 GNU General Public License for more details. 27 . 28 You should have received a copy of the GNU General Public License along 29 with this program; if not, write to the Free Software Foundation, Inc., 30 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA. 31 . 32 On Debian systems, the full text of the GNU General Public 33 License version 2 can be found in the file 34 `/usr/share/common-licenses/GPL-2'.
fr: 1 Format-Specification: http://svn.debian.org/wsvn/dep/web/deps/dep5.mdwn?op=file&amp;rev=135 2 Name: gentoo 3 Maintainer: Prénom Nom &lt;votre.adresse.mail@example.org&gt; 4 Source: http://sourceforge.net/projects/gentoo/files/ 5 6 Copyright: 1998-2010 Emil Brink &lt;emil@obsession.se&gt; 7 License: GPL-2+ 8 9 Files: icons/* 10 Copyright: 1998 Johan Hanson &lt;johan@tiq.com&gt; 11 License: GPL-2+ 12 13 Files: debian/* 14 Copyright: 2010 Prénom Nom &lt;votre.adresse.mail@example.org&gt; 15 License: GPL-2+ 16 17 License: GPL-2+ 18 This program is free software; you can redistribute it and/or modify 19 it under the terms of the GNU General Public License as published by 20 the Free Software Foundation; either version 2 of the License, or 21 (at your option) any later version. 22 . 23 This program is distributed in the hope that it will be useful, 24 but WITHOUT ANY WARRANTY; without even the implied warranty of 25 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 26 GNU General Public License for more details. 27 . 28 You should have received a copy of the GNU General Public License along 29 with this program; if not, write to the Free Software Foundation, Inc., 30 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA. 31 . 32 On Debian systems, the full text of the GNU General Public 33 License version 2 can be found in the file 34 `/usr/share/common-licenses/GPL-2'.

source: 1 gentoo (0.9.12-1) unstable; urgency=low 2 3 * Initial release (Closes: #<var>nnnn</var>) &lt;<var>nnnn</var> is the bug number of your ITP&gt; 4 5 -- Josip Rodin &lt;joy-mg@debian.org&gt; Mon, 22 Mar 2010 00:37:31 +0100 6
fr: 1 gentoo (0.9.12-1) unstable; urgency=low 2 3 * Initial release (Closes: #<var>nnnn</var>) &lt;<var>nnnn</var> est le numéro de bogue de votre ITP&gt; 4 5 -- Prénom Nom &lt;votre.adresse.mail@example.org&gt; Mon, 22 Mar 2010 00:37:31 +0100 6

source: 1 gentoo (0.9.12-1) unstable; urgency=low 2 3 * Initial Release. Closes: #12345 4 * This is my first Debian package. 5 * Adjusted the Makefile to fix $(DESTDIR) problems. 6 7 -- Josip Rodin &lt;joy-mg@debian.org&gt; Mon, 22 Mar 2010 00:37:31 +0100 8
fr: 1 gentoo (0.9.12-1) unstable; urgency=low 2 3 * Initial Release. Closes: #12345 4 * This is my first Debian package. 5 * Adjusted the Makefile to fix $(DESTDIR) problems. 6 7 -- Prénom Nom &lt;votre.adresse.mail@example.org&gt; Mon, 22 Mar 2010 00:37:31 +0100 8

source: 1 #!/usr/bin/make -f 2 # -*- makefile -*- 3 # Sample debian/rules that uses debhelper. 4 # This file was originally written by Joey Hess and Craig Small. 5 # As a special exception, when this file is copied by dh-make into a 6 # dh-make output file, you may use that output file without restriction. 7 # This special exception was added by Craig Small in version 0.37 of dh-make. 8 9 # Uncomment this to turn on verbose mode. 10 #export DH_VERBOSE=1 11 12 %: 13 dh $@
fr: 1 #!/usr/bin/make -f 2 # -*- makefile -*- 3 # Exemple de debian/rules utilisant debhelper. 4 # Ce fichier a initialement été écrit par Joey Hess et Craig Small. 5 # En tant qu'exception particulière, lorsque ce fichier est copié 6 # par dh-make dans un fichier de sortie dh-make, vous pouvez 7 # utiliser ce fichier sans restriction. Cette exception particulière 8 # a été ajoutée par Craig Small dans la version 0.37 de dh-make. 9 10 # Décommentez la ligne suivante pour le mode volubile. 11 #export DH_VERBOSE=1 12 13 %: 14 dh $@

source: gentoo for Debian ----------------- &lt;possible notes regarding this package - if none, delete this file&gt; -- Josip Rodin &lt;joy-mg@debian.org&gt;, Wed, 11 Nov 1998 21:02:14 +0100
fr: gentoo for Debian ----------------- &lt;considérations éventuelles à propos de ce paquet - sinon, effacer ce fichier&gt; -- Josip Rodin &lt;joy-mg@debian.org&gt;, Wed, 11 Nov 1998 21:02:14 +0100
it: gentoo per Debian ----------------- &lt;possibili note riguardanti questo pacchetto - se non presenti, si cancelli questo file&gt; -- Josip Rodin &lt;joy-mg@debian.org&gt;, Wed, 11 Nov 1998 21:02:14 +0100

source: Normally with this <file>watch</file> file, the URL at "<tt>http://sf.net/gentoo</tt>" is downloaded and searched for links of the form "<tt>&lt;a href=...&gt;</tt>". The base name (just the part after the final "<tt>/</tt>") of these linked URLs are matched against Perl regexp (see <manref section="1" name="perlre">) pattern "<tt>gentoo-(.*)\.tar\.gz</tt>". Out of matched files, the file with the greatest version number is downloaded and the <prgn>uupdate</prgn> program is run to create the updated source tree from them.
fr: Normalement, avec ce fichier <file>watch</file>, la page servie à l'URL « <tt>http://sf.net/gentoo</tt> » est téléchargée pour chercher des liens sous la forme « <tt>&lt;a href=...&gt;</tt> ». Ces liens sont comparés au nom de base (juste après la dernière « <tt>/</tt> ») « <tt>gentoo-(.*)\.tar\.gz</tt> » comme motif d'expression rationnelle Perl (cf. <manref section="1" name="perlre">). Parmi les fichiers concordants, celui avec le plus grand numéro de version est téléchargé puis le programme <prgn>uupdate</prgn> est exécuté pour créer une arborescence source mise à jour à partir de ce fichier.
zh_tw: 通常，在按照這個 <file>watch</file> 檔案執行時，URL <tt>http://sf.net/gentoo</tt>" 會被下載，程式在其中搜搜 <tt>&lt;a href=...&gt;</tt>。<tt>/</tt> 後的基本名稱會按照 Perl 正則表達式匹配(參考 <manref section="1" name="perlre">) <tt>gentoo-(.*)\.tar\.gz</tt>。在所有匹配的檔案裏，將會下載帶有最大版本號的，此後由 <prgn>uupdate</prgn> 程式創建更新的原始碼樹。

source: Autobuilder
fr: Serveurs d'empaquetage automatique (« autobuilder »)
it: Auto-costruzione
zh_cn: 自动编译系统
zh_tw: 自動編譯系統

source: <prgn>dupload</prgn> checks that the MD5/SHA1/SHA256 checksums of the files match those from the <file>.changes</file> file, so it will warn you to rebuild it as described in <ref id="completebuild"> so it can properly upload.
fr: <prgn>dupload</prgn> vérifie que les sommes MD5, SHA1 et SHA256 des fichiers sont identiques à celles du fichier <file>.changes</file>, pour pouvoir vous avertir de reconstruire comme décrit en <ref id="completebuild"> et charger le fichier correctement.
it: <prgn>dupload</prgn> controlla che i checksum MD5/SHA1/SHA256 dei file corrispondano con quelli del file <file>.changes</file>, così si verrà avvertiti di ricostruire il pacchetto come descritto in <ref id="completebuild"> per poi poterlo ricaricare.
ja: <prgn>dupload</prgn> は各ファイルの MD5/SHA1/SHA256 チェックサムを計算し、 <file>.changes</file> ファイルの中の情報と照合します。 もし一致しない場合には適正にアップロードできないため、 <ref id="completebuild"> の説明に従って最初から再構築をするよう、警告してきます。
zh_tw: <prgn>dupload</prgn> 會檢查檔案的 MD5/SHA1/SHA256 校驗和是否與 <file>.changes</file> 檔案中的相匹配，如果不匹配它會做出警告。你應按照如 <ref id="completebuild"> 所述來重構建套件使得它可以被正常上傳。

source: &dochome;/maint-guide/maint-guide.en.html/index.en.html
zh_cn: &dochome;/maint-guide/maint-guide.zh-cn.html/index.zh-cn.html
zh_tw: &dochome;/maint-guide/maint-guide.zh-cn.html/index.zh-cn.html

source: The New-Maintainer's Debian Packaging Howto, copyright &copy; 1997 Will Lowe.
ja: 新米メンテナのための Debian パッケージング Howto、copyright &copy; 1997 Will Lowe.

source: <tt>Depends</tt>
ja: <tt>Depends (依存)</tt>

source: <tt>Recommends</tt>
ja: <tt>Recommends (推奨)</tt>

source: <tt>Suggests</tt>
ja: <tt>Suggests (提案)</tt>

source: <tt>Pre-Depends</tt>
ja: <tt>Pre-Depends (事前依存)</tt>

source: <tt>Conflicts</tt>
ja: <tt>Conflicts (競合)</tt>

source: <tt>Breaks</tt>
ja: <tt>Breaks (破壊)</tt>

source: <tt>Provides</tt>
ja: <tt>Provides (提供)</tt>

source: <tt>Replaces</tt>
ja: <tt>Replaces (置換)</tt>

source: <package>patchutils</package> - this package contains some utilities to work with patches such as the <prgn>lsdiff</prgn> , <prgn>interdiff</prgn> and <prgn>filterdiff</prgn> commands.
it: <package>patchutils</package> - questo pacchetto contiene dei programmi che lavorano con le patch, come <prgn>lsdiff</prgn>, <prgn>interdiff</prgn> e <prgn>filterdiff</prgn>.

source: <package>git-core</package> - this package provides popular version control system designed to handle very large projects with speed and efficiency; it is used for many high profile open source projects, most notably the Linux kernel. (see <manref section="1" name="git">, <file>/usr/share/doc/git-doc/index.html</file>)
it: <package>git-core</package> - questo pacchetto contiene un famoso sistema per il controllo delle versioni, progettato per gestire progetti molto grandi con velocità ed efficienza; è utilizzato da molti progetti open source, tra cui il kernel Linux. (see <manref section="1" name="git">, <file>/usr/share/doc/git-doc/index.html</file>)

source: Let's try to make your own package.
it: Proviamo a creare un pacchetto.

source: If the package already exists, well, install it! :-) If it happens to be orphaned -- if its maintainer is set to "Debian QA Group", you may be able to pick it up.
it: Se il pacchetto esiste già, allora non rimane che installarlo! :-) Se invece divenisse orfano -- ovvero se il suo maintainer è configurato come "Debian QA Group", si può sempre prenderlo in carico.

source: Then you should consult the Debian web site at <url id="http://www.debian.org/devel/wnpp/" name="Work-Needing and Prospective Packages"> and <url id="http://wnpp.debian.net/" name="the latest adoption/orphan status of the package">.
it: Si può consultare nel sito web Debian la <url id="http://www.debian.org/devel/wnpp/" name="lista dei pacchetti che hanno bisogno di un nuovo manutentore e dei futuri pacchetti Debian"> e gli <url id="http://wnpp.debian.net/" name="ultimi aggiornamenti sui pacchetti da adottare e orfani">.

source: For the <tt>main</tt> section, it <strong>must be compliant to all the Debian Free Software Guidelines(DFSG)</strong> (see <url id="http://www.debian.org/social_contract#guidelines">) and <strong>That program must not require a package outside of <tt>main</tt></strong> for compilation or execution as required by the Debian Policy. This is desired case.
it: I programmi nella sezione <tt>main</tt>, <strong>devono essere in accordo con le Linee Guida per il Software Libero Debian (DFSG, Debian Free Software Guidelines)</strong> (vedere <url id="http://www.debian.org/social_contract#guidelines">) e <strong>non devono richiede nessun pacchetto che non sia presente nella sezione <tt>main</tt></strong>, per la compilazione o l'esecuzione, come previsto dalla policy di Debian. Questo è il caso preferito.

source: For the <tt>contrib</tt> section, it must be compliant to all the DSFG but it may require a package outside of main for compilation or execution.
it: I programmi nella sezione <tt>contrib</tt>, devono essere conformi alle DSFG, ma potrebbero richiedere, per la compilazione o l'esecuzione, un pacchetto che non è presente nella sezione main.

source: Create a subdirectory under your home directory named <file>debian</file> or <file>deb</file> or anything you find appropriate (e.g. just <file>~/gentoo</file> would do fine in this case). Place the downloaded archive in it, and uncompress it (with "<tt>tar xzf gentoo-0.9.12.tar.gz</tt>"). Make sure there are no errors, even some <em>irrelevant</em> ones, because there will most probably be problems unpacking on other people's systems, whose unpacking tools may or may not ignore those anomalies. On your console screen, you should see the following.
it: È buona regola creare una sottodirectory nella directory home e nominarla <file>debian</file> o <file>deb</file> o qualsiasi altro nome appropriato (ad es. in questo caso <file>~/gentoo</file> andrebbe più che bene). Scaricare l'archivio e scompattarlo (con il comando "<tt>tar xzf gentoo-0.9.12.tar.gz</tt>"). Bisogna assicurarsi che non ci siano errori, per quanto in apparenza <em>irrilevanti</em>, perché potrebbero causare problemi nell'estrazione dell'archivio sul sistema di altre persone, alcuni strumenti di estrazione a volte ignorano queste anomalie. Nella console dovrebbe esserci quanto segue.

source: The process varies from program to program, but a lot of modern programs come with a <prgn>./configure</prgn> script that configures the source under your system and makes sure that your system is in condition to compile it. After configuring with <prgn>./configure</prgn>, programs are usually compiled with "<tt>make</tt>". Some of them support "<tt>make check</tt>", to run included self-checks. Installation in destination directories is usually done with "<tt>make install</tt>".
it: La procedura cambia da programma a programma, ma molti programmi recenti hanno uno script <prgn>./configure</prgn>> che configura i sorgenti del programma in modo da essere compilati nel sistema in uso. Dopo la configurazione (con il comando <prgn>./configure</prgn>), i programmi sono generalmente compilati con <tt>"make"</tt>. Alcuni supportano il comando "<tt>make check</tt>", che serve per eseguire dei controlli automatici. L'installazione nelle directory di destinazione viene fatta generalmente con "<tt>make install</tt>".

source: Initial <em>debianization</em>
it: La <em>debianizzazione</em> iniziale

source: Let's make initial <em>debianization</em> by issuing the <prgn>dh_make</prgn> command as follows.
it: Adesso si può iniziare la <em>debianizzazione</em> eseguendo il programma <prgn>dh_make</prgn> come segue:

source: Some information will come up. It will ask you what sort of package you want to create. Gentoo is a single binary package - it creates only one binary, and thus one <file>.deb</file> file - so we will select the first option, with the "<tt>s</tt>" key, check the information on the screen and confirm by pressing "<tt><var>ENTER</var></tt>". <footnote><p>There are few choices here: "<tt>s</tt>" for "Single binary", "<tt>i</tt>" for "Arch-Independent", "<tt>m</tt>" for "Multiple binary", "<tt>l</tt>" for "Library", "<tt>k</tt>" for "Kernel module", "<tt>b</tt>" for "<package>cdbs</package>", "<tt>--kpatch</tt>" for "Kernel patch". This document focuses on the use of the <package>debhelper</package> package with the <prgn>dh</prgn> command. This document focuses on the use of the new <prgn>dh</prgn> command for "Single binary" and touches on it for "Arch-Independent" and "Multiple binary". The <package>cdbs</package> package offers alternative package script infrastructure to the <prgn>dh</prgn> command and outside of the scope of this document.</p></footnote>
it: Verranno visualizzate alcune informazioni. Verrà chiesto che tipo di pacchetto creare. Gentoo è un singolo pacchetto binario - crea un solo binario, e quindi un solo file <file>.deb</file> - per cui si dovrà selezionare la prima opzione con il tasto "<tt>s</tt>", controllare le informazioni sullo schermo e confermare la scelta con "<tt><var>ENTER</var></tt>". <footnote><p>Ecco le varie opzioni: "<tt>s</tt>" che sta per "Binario singolo" (Single binary), "<tt>i</tt>" per "Indipendente dall'architettura" (Arch-Independent), "<tt>m</tt>" per "Binario multiplo" (Multiple binary), "<tt>l</tt>" per "Libreria" (Library), "<tt>k</tt>" per "Modulo del kernel" (Kernel module), "<tt>b</tt>" per "<package>cdbs</package>", "<tt>--kpatch</tt>" per "Patch del kernel". Questo documento si concentra sull'uso del pacchetto <package>debhelper</package> con il comando <prgn>dh</prgn>. Verrà trattato l'utilizzo del nuovo programma <prgn>dh</prgn> per i "Binari singoli" e tratta brevemente gli "Indipendenti dall'architettura" e i "Binari multipli". Il pacchetto <package>cdbs</package> offre un'infrastruttura di script alternativa al comando <prgn>dh</prgn> e non rientra nell'ambito di questo documento.</p></footnote>

source: There is the <file>.orig</file> before the <file>.tar.gz</file> .
it: C'è <file>.orig</file> prima di <file>.tar.gz</file> .

source: If you accidentally erased some template files while working on them, you can recover them by running <prgn>dh_make</prgn> with the <tt>--addmissing</tt> option again in an already <em>debianized</em> directory.
it: Se accidentalmente viene cancellato qualche modello di file mentre ci si lavora, è possibile recuperarlo eseguendo <prgn>dh_make</prgn> con l'opzione <tt>--addmissing</tt> nella directory già <em>debianizzata</em>.

source: The <prgn>quilt</prgn> program offers the basic method to record modification to the source for the Debian packaging. Since slightly different default is desirable for Debian packaging, let's set up <file>~/.quilrc</file> as follows. <footnote><p>You can disable this configuration by starting the <prgn>quilt</prgn> command as "<tt>quilt --quiltrc /dev/null ...</tt>". </p></footnote>
it: Il programma <prgn>quilt</prgn> offre il metodo base per registrare le modifiche dei sorgenti per la pacchettizzazione di Debian. Siccome è norma che il sistema di pacchettizzazione di Debian abbia alcune piccole differenze nelle impostazioni predefinite, si deve impostare il <file>~/. quilrc</file> come segue.<footnote><p>Si può disabilitare tale configurazione lanciando il comando <prgn>quilt</prgn> come "<tt>quilt --quiltrc /dev/null ...</tt>". </p></footnote>"

source: Ask quilt to refresh the patch to create <file>debian/patches/fix-gentoo-target.patch</file> and add its description.
it: Adesso bisogna chiedere a quilt di aggiornare e creare la patch <file>debian/patches/fix-gentoo-target.patch</file> e di aggiungere una descrizione.

source: Note that if your program uses GNU <manref section="1" name="automake"> and/or <manref section="1" name="autoconf">, meaning the source includes <file>Makefile.am</file> and/or <file>Makefile.in</file> files, respectively, you will need to modify these files if you need to change the <file>Makefile</file> file. This is because each <prgn>automake</prgn> invocation will rewrite <file>Makefile.in</file> files with information generated from <file>Makefile.am</file> files, and each "<prgn>./configure</prgn>" invocation will do the same with <file>Makefile</file> files, with data from <file>Makefile.in</file> files. Editing <file>Makefile.am</file> files requires some knowledge of <prgn>automake</prgn>, which you can read about in "<tt>info automake</tt>", whereas editing <file>Makefile.in</file> files is pretty much the same as editing <file>Makefile</file> files, just pay attention to the variables, i.e. any strings surrounded with "<tt>@</tt>"s, for example <tt>@CFLAGS@</tt> or <tt>@LN_S@</tt>, which are replaced with actual stuff on each "<prgn>./configure</prgn>" invocation. Please make sure to read <file>&autotools-dev;</file> before proceeding.
it: Notare che se il programma che si intende pacchettizzare, utilizza GNU <manref section="1" name="automake"> e/o <manref section="1" name="autoconf">, i sorgenti includeranno i file <file>Makefile.am</file> e/o <file>Makefile.in</file>, a cui si dovranno apportare modificare se si vuole cambiare il file <file>Makefile</file>. Questo perché ogni esecuzione di <prgn>automake</prgn> provoca la riscrittura del file <file>Makefile.in</file> con informazioni generate a partire dal file <file>Makefile.am</file>, e ogni esecuzione di "<prgn>./configure</prgn>" farà lo stesso con il corrispondente <file>Makefile</file>, con i dati ricavati dal file <file>Makefile.in</file>. Modificare i file <file>Makefile.am</file> richiede qualche conoscenza di <prgn>automake</prgn>, per più informazioni si può consultare "<tt>info automake</tt>", mentre la modifica del file <file>Makefile.in</file>, è abbastanza simile alla modifica del file <file>Makefile</file>, è necessario solamente fare attenzione alle variabili, ad es. qualunque stringa tra i simboli "<tt>@</tt>", come <tt>@CFLAGS@</tt> o <tt>@LN_S@</tt>, che saranno sostituite ad ogni esecuzione di "<prgn>./configure</prgn>". Prima di procedere è vivamente consigliata la lettura di <file>&autotools-dev;</file>.

source: Edit those files and in those lines replace <tt>/usr/local/lib</tt> with <tt>usr/lib</tt>.
it: Si modifichino quei file in quelle righe, sostituendo <tt>/usr/local/lib</tt> con <tt>/usr/lib</tt>.

source: After careful check, if everything is fine, ask quilt to refresh the patch to create <file>debian/patches/install.patch</file> and add its description.
it: Dopo un'attenta analisi, se tutto è andato bene, si può aggiornare con quilt la patch creando il file <file>debian/patches/install.patch</file> ed aggiungendogli una descrizione.

source: As you may have noticed, Debian is divided in sections: <tt>main</tt> (the free software), <tt>non-free</tt> (the not really free software) and <tt>contrib</tt> (free software that depends on non-free software). Under those, there are logical subsections that describe in short what packages are in. So we have <tt>admin</tt> for administrator-only programs, <tt>base</tt> for the basic tools, <tt>devel</tt> for programmer tools, <tt>doc</tt> for documentation, <tt>libs</tt> for libraries, <tt>mail</tt> for e-mail readers and daemons, <tt>net</tt> for network apps and daemons, <tt>x11</tt> for X11 programs that don't fit anywhere else, and many more. See the <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-subsections" name="Debian Policy Manual, 2.4 'Sections'"> and <url id="http://packages.debian.org/unstable/" name="List of sections in 'sid'"> for the guidance.
it: Come si sarà notato, Debian è diviso in sezioni: <tt>main</tt> (il software libero), <tt>non-free</tt> (il software non propriamente libero) e <tt>contrib</tt> (il software libero che dipende da software non libero). Sotto queste esistono delle sottosezioni che descrivono brevemente quali pacchetti vi si possono trovare. Quindi si hanno le sezioni <tt>admin</tt> per i programmi dell'amministratore, <tt>base</tt> per gli strumenti di base, <tt>devel</tt> per gli strumenti di sviluppo, <tt>doc</tt> per la documentazione, <tt>libs</tt> per le librerie, <tt>mail</tt> per client di posta e demoni associati, <tt>net</tt> per applicazioni e demoni di rete, <tt>x11</tt> per programmi X11 che non appartengono alle altre categorie, e tanti altri. Si legga <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-subsections" name="Manuale delle policy di Debian, 2.4 'Sezioni'"> e <url id="http://packages.debian.org/unstable/" name="List of sections in 'sid'"> per maggiori informazioni.

source: The <tt>optional</tt> priority will usually work for new packages that do not conflict with others with <tt>required</tt>, <tt>important</tt> or <tt>standard</tt> or priorities.
it: La priorità <tt>optional</tt> solitamente viene usata per i nuovi pacchetti che non vanno in conflitto con altri pacchetti con priorità <tt>required</tt>, <tt>important</tt> o <tt>standard</tt>.
