Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: The last feature you need to know about is <tt>${shlibs:Depends}</tt>, <tt>${perl:Depends}</tt>, <tt>${misc:Depends}</tt>, etc. These entries are substituted by the list generated by other <package>debhelper</package> components when the <manref section="1" name="dh_gencontrol"> command is executed.
ca: La darrera funcionalitat que has de conèixer és <tt>$(shlibs:Depends)</tt>,<tt>${perl:Depends}</tt>, <tt>${misc:Depends}</tt>, etc. Aquestes entrades funcionen com a variables: són substituïdes per llistes de paquets quan <package>debhelper</package> executa l'ordre <manref section="1" name="dh_gencontrol">.
es: La última funcionalidad que necesitas conocer es <tt>$(shlibs:Depends)</tt>,<tt>${perl:Depends}</tt>, <tt>${misc:Depends}</tt>, etc. Estas entradas funcionan como variables: son substituidas por listas de paquetes cuando <package>debhelper</package> ejecuta la orden <manref section="1" name="dh_gencontrol">.
fr: La dernière fonctionnalité à connaître est <tt>${shlibs:Depends}</tt>, <tt>${perl:Depends}</tt>, <tt>${misc:Depends}</tt>, etc. Ces paramètres seront remplacés par une liste générée par les autres composants de <package>debhelper</package> quand la commande <manref section="1" name="dh_gencontrol"> est exécutée.
it: L'ultima caratteristica che si deve conoscere riguarda <tt>${shlibs:Depends}</tt>, <tt>${perl:Depends}</tt>, <tt>${misc:Depends}</tt>, ecc. Queste voci sono sostituite dalle liste generate da altri componenti di <package>debhelper</package> quando il comando <manref section="1" name="dh_gencontrol"> viene eseguito.
ja: もう１つ、知っておくべき機能があります。<tt>${shlibs:Depends}</tt>、<tt>${perl:Depends}</tt>、<tt>${misc:Depends}</tt>などです。上記のエントリーは<manref section="1" name="dh_gencontrol">コマンドが実効されるとき、別の<package>debhelper</package>コンポーネントで生成されたリストで代用されます。
zh_cn: 你应当知道的最后一个特性是关于 <tt>${shlibs:Depends}</tt>、<tt>${perl:Depends}</tt>、<tt>${misc:Depends}</tt> 等。这些条目的值会由 <package>debhelper</package> 的其他组件在 <manref section="1" name="dh_gencontrol"> 运行时生成。
zh_tw: 你應當知道的最後一個特性是關於 <tt>${shlibs:Depends}</tt>、<tt>${perl:Depends}</tt>、<tt>${misc:Depends}</tt> 等。這些條目的值會由 <package>debhelper</package> 的其他組件在 <manref section="1" name="dh_gencontrol"> 運行時生成。

source: <manref section="1" name="dh_shlibdeps"> will scan it for binaries and libraries determine their shared library dependencies and detect which packages they are in, such as <package>libc6</package> or <package>xlib6g</package>, after your package has been built and installed into the temporary directory. This list of shared library dependencies is used for <tt>${shlibs:Depends}</tt>.
ca: En haver-se compilat el teu paquet i instal·lat en el directori temporal, <manref section="1" name="dh_shlibdeps"> l'analitzarà per determinar les dependències de biblioteques compartides i els paquets que les instal·len, com és el cas de <package>libc6</package> o <package>xlib6g</package>. Aquesta llista de biblioteques compartides es farà sevir per a <tt>${shlibs:Depends}</tt>.
es: Después de que tu paquete se compile y se instale en el directorio temporal, <manref section="1" name="dh_shlibdeps"> lo escaneará en busca de binarios y bibliotecas para determinar las dependencias de bibliotecas compartidas y en qué paquetes están, tales como como <package>libc6</package> o <package>xlib6g</package>. Esta lista sera utilizada por <tt>${shlibs:Depends}</tt>.
fr: <manref section="1" name="dh_shlibdeps"> parcourra le paquet après sa construction et son installation dans le répertoire temporaire, afin de rechercher les exécutables et bibliothèques, déterminer leurs dépendances en bibliothèques partagées, et détecter dans quels paquets elles se trouvent (<package>libc6</package> ou <package>xlib6g</package> par exemple). La liste des bibliothèques partagées dépendantes est utilisée pour remplacer <tt>${shlibs:Depends}</tt>.
it: <manref section="1" name="dh_shlibdeps"> farà la scansione alla ricerca di binari e librerie per determinare le loro dipendenze da altre librerie e individuare in quali pacchetti si trovano, come <package>libc6</package> o <package>xlib6g</package>, dopo che il pacchetto sia stato costruito ed installato nella directory temporanea. Questa lista di dipendenze di libreria condivise è utilizzata per <tt>${shlibs:Depends}</tt>.
ja: <manref section="1" name="dh_shlibdeps">はパッケージがビルドされ一時ディレクトリにインストールされた後で、バイナリとライブラリによって使用される共有ライブラリと、それがどのパッケージに属しているのか（例えば <package>libc6</package> や <package>xlib6g</package>など）を調べます。その結果は<tt>${shlibs:Depends}</tt>によって利用されます。
zh_cn: <manref section="1" name="dh_shlibdeps"> 会在程序编译完成并被放入临时文件夹后扫描二进制文件和库文件来确定动态库的依赖关系，并检测包含它们的软件包名称。例如 <package>libc6</package> 或 <package>xlib6g</package>。 这些软件包将被列在 <tt>${shlibs:Depends}</tt> 的位置。
zh_tw: <manref section="1" name="dh_shlibdeps"> 會在程式編譯完成並被放入臨時檔案夾後掃描二進位檔案和庫檔案來確定動態庫的依賴關係，並檢測包含它們的套件名稱。例如 <package>libc6</package> 或 <package>xlib6g</package>。 這些套件將被列在 <tt>${shlibs:Depends}</tt> 的位置。

source: The package list generated by the <manref section="1" name="dh_perl"> is used for <tt>${perl:Depends}</tt>.
ca: La llista de paquets generada per <manref section="1" name="dh_perl"> es fa servir per reemplaçar <tt>${perl:Depends}</tt>.
es: La lista de paquetes generada por <manref section="1" name="dh_perl"> se usa para <tt>${perl:Depends}</tt>.
fr: La liste de paquets créée par <manref section="1" name="dh_perl"> est utilisée pour remplacer <tt>${perl:Depends}</tt>.
it: La lista di pacchetti generata da <manref section="1" name="dh_perl"> viene utilizzata per <tt>${perl:Depends}</tt>.
ja: <manref section="1" name="dh_perl">によって生成されたパッケージのリストは<tt>${perl:Depends}</tt>のために利用されます。
zh_cn: <manref section="1" name="dh_perl"> 所生成的软件包列表将用于 <tt>${perl:Depends}</tt> 的位置。
zh_tw: <manref section="1" name="dh_perl"> 所生成的套件列表將用於 <tt>${perl:Depends}</tt> 的位置。

source: Some <package>debhelper</package> commands may make the generated package need to depend on some other packages. This list of required packages is used for <tt>${misc:Depends}</tt>.
ca: Algunes ordres de <package>debhelper</package> determinen les dependències dels paquets llistats anteriorment. La llista d'aquests paquets reemplaçaran a <tt>${misc:Depends}</tt>.
es: Algunas órdenes de <package>debhelper</package> determinan las dependencias de los paquetes listados anteriormente. La lista de estos paquetes se usará para <tt>${misc:Depends}</tt>.
fr: Certaines commandes de <package>debhelper</package> peuvent rendre la création de paquet dépendante d'autres paquets. Cette liste de paquets nécessaires est utilisée pour remplacer <tt>${misc:Depends}</tt>.
it: Alcuni comandi <package>debhelper</package> possono far si che il pacchetto generato abbia bisogno di dipendere da altri pacchetti. Questa lista di pacchetti richiesti è utilizzata per <tt>${misc:Depends}</tt>.
ja: <package>debhelper</package>コマンドは、他のパッケージに依存するために必要な、生成されたパッケージを作ることもあります。この、要求されるパッケージのリストは<tt>${misc:Depends}</tt>のために利用されます。
zh_cn: 一些 <package>debhelper</package> 命令可能会使生成的软件包需要依赖于某些其他软件包，这些软件包将被列于 <tt>${misc:Depends}</tt> 的位置。
zh_tw: 一些 <package>debhelper</package> 命令可能會使生成的套件需要依賴於某些其他套件，這些套件將被列於 <tt>${misc:Depends}</tt> 的位置。

source: Having said all that, we can leave the <tt>Depends</tt> field exactly as it is now, and insert another line after it saying "<tt>Suggests: file</tt>", because <package>gentoo</package> can use some features provided by that <package>file</package> package.
ca: La línia <tt>Depends</tt> pot quedar així com està però afegirem una línia "<tt>Suggests: file</tt>", degut a què el paquet <package>gentoo</package> fa servir algunes funcions d'aquest program.
es: Después de decir todo esto, podemos dejar la línea de <tt>Depends</tt> exactamente como está ahora e insertar otra línea tras ésta con el texto "<tt>Suggests: file</tt>", porque <package>gentoo</package> utiliza algunas funciones proporcionadas por el paquete/programa <package>file</package>.
fr: Ceci dit, le champ <tt>Depends</tt> peut rester exactement comme il est maintenant, et une autre ligne avec « <tt>Suggests: file</tt> » peut être ajoutée, car <package>gentoo</package> peut utiliser certaines fonctionnalités fournies par le paquet <package>file</package>.
ja: とは言っても、今のところ<tt>Depends</tt>フィールドはそのままにして、その下に"<tt>Suggests: file</tt>"という新たな行を追加しましょう。<package>gentoo</package>は<package>file</package>パッケージによって提供される機能を利用することができるからです。
zh_cn: 说过这些以后，我们可以把 <tt>Depends</tt> 项保持现状不动，并在其下插入一行 <tt>Suggests: file</tt>"，因为 <package>gentoo</package> 可以使用 <package>file</package> 软件包提供的某些特性。
zh_tw: 說過這些以後，我們可以把 <tt>Depends</tt> 項保持現狀不動，並在其下插入一行 <tt>Suggests: file</tt>"，因爲 <package>gentoo</package> 可以使用 <package>file</package> 套件提供的某些特性。

source: Line 12 is the short description. Most people screens are 80 columns wide so this shouldn't be longer than about 60 characters. I'll change it to "<tt>fully GUI-configurable, two-pane X file manager</tt>".
ca: La línia 12 és una descripció curta del programa. La major part dels monitors dels usuaris són de 80 columnes d'amplada (els terminals, és clar!) per la qual cosa la descripció no hauria de tenir més de 60 caràcters. Canviaré la descripció per a "<tt>fully GUI configurable GTK+ file manager</tt>" («Interfície gràfica d'usuari GTK+ de gestió de fitxers completament configurable»).
es: La línea 12 es una descripción corta. La mayor parte de los monitores (en realidad, de las terminales en modo de texto) de la gente son de 80 columnas de ancho, así que no debería tener más de 60 caracteres. Cambiaré esto a "<tt>fully GUI-configurable, two-pane X file manager</tt>" («Gestor de ficheros GTK+ completamente configurable por GUI»).
fr: La ligne 12 est la description courte. La plupart des écrans sont larges de 80 colonnes, aussi cela ne devrait pas dépasser les 60 caractères. « <tt>fully GUI-configurable, two-pane X file manager</tt> » convient ici.
ja: 12行目は手短な説明です。ほとんどの人は1行（半角）80文字幅のスクリーンを使用しているので、(半角)60字以上にならないようにしましょう。"<tt>fully GUI-configurable, two-pane X file manager</tt>"に変更します。
zh_cn: 第 12 行是短描述。绝大多数人的屏幕是 80 列宽，所以描述不应超过 60 个字符。在这个例子里我把它写为 <tt>fully GUI-configurable, two-pane X file manager</tt>。
zh_tw: 第 12 行是短描述。絕大多數人的螢幕是 80 列寬，所以描述不應超過 60 個字符。在這個例子裏我把它寫爲 <tt>fully GUI-configurable, two-pane X file manager</tt>。

source: Line 13 is where the long description goes. This should be a paragraph which gives more details about the package. Column 1 of each line should be empty. There must be no blank lines, but you can put a single "<tt>.</tt>" (dot) in a column to simulate that. Also, there must be no more than one blank line after the long description.
ca: La línia 13 és per fer una descripció més llarga del paquet. Cal que sigui almenys d'un paràgraf amb detalls sobre el paquet. Cada línia començarà amb un espai buit. No hi pot haver línies en blanc, però es pot simular amb un "<tt>.</tt>" (punt) a la segona columna. Tampoc hi pot haver més d'una línia en blanc al final de la descripció completa.
es: La línea 13 es donde va la descripción larga del paquete. Debería ser al menos un párrafo que dé más detalles del paquete. La primera columna de cada línea debería estar vacía. No puede haber líneas en blanco, pero puede poner un "<tt>.</tt>" (punto) en una columna para simularlo. Tampoco debe haber más de una línea en blanco después de la descripción completa.
fr: À la ligne 13 commence la description longue. Celle-ci devrait être un paragraphe qui donne plus de détails sur le paquet. La colonne 1 de chaque ligne doit être vide. Il ne peut y avoir de ligne vide, mais vous pouvez mettre un seul « . » (point) dans la colonne 2 pour simuler une ligne vide. De plus, il ne peut pas y avoir plus d'une ligne vide après la description longue.
it: Nella riga 13 va messa la descrizione lunga. Questa dovrebbe consistere in un paragrafo che fornisce più dettagli sul pacchetto. La prima colonna di ogni riga dovrebbe essere vuota. Non ci dovrebbero essere linee vuote, ma si può mettere un singolo "<tt>.</tt>" (punto) in una colonna per simularle. Inoltre non ci dovrebbe essere più di una linea vuota dopo questa descrizione.
ja: 13行目は詳細な説明です。ここでは1つの段落でパッケージについてより詳しく説明します。各行の先頭は空白（スペース文字）で始めます。空白行を入れてはいけませんが、 "<tt>.</tt>" (半角ピリオド) を1つ書くことで、それらしく見せることができます。説明文の後にも空白行を入れることはできません。
zh_cn: 第 13 行是长描述开始的地方。这应当是一段更详细地描述软件包的话。每行的第一个格应当留空。描述中不应存在空行，如果必须使用空行，则在行中仅放置一个 <tt>.</tt> (半角句点)。同时，长描述后也不应有超过一行的空白。
zh_tw: 第 13 行是長描述開始的地方。這應當是一段更詳細地描述套件的話。每行的第一個格應當留空。描述中不應存在空行，如果必須使用空行，則在行中僅放置一個 <tt>.</tt> (半角句點)。同時，長描述後也不應有超過一行的空白。

source: Let's insert <tt>Vcs-*</tt> fields documented in <url id="http://www.debian.org/doc/manuals/developers-reference/best-pkging-practices.html#bpp-vcs" name="Developer's Reference, 6.2.5. 'Version Control System location'"> between line 6 and 7. Let's assume that the <package>gentoo</package> package is located in Debian Alioth Git Service at <tt>git://git.debian.org/git/collab-maint/gentoo.git</tt>.
ca: Afegirem els camps <tt>Vcs-*</tt> documentats a <url id="http://www.debian.org/doc/manuals/developers-reference/best-pkging-practices.html#bpp-vcs" name="«Developer's Reference, 6.2.5. 'Version Control System location'»"> entre les línies 6 i 7. Això si el paquet <package>gentoo</package> fa servir el servei «Debian Alioth Git» a <tt>git://git.debian.org/git/collab-maint/gentoo.git</tt> per a la gestió del codi font.
es: Vamos a poner los campos <tt>Vcs-*</tt> documentados en <url id="http://www.debian.org/doc/manuals/developers-reference/best-pkging-practices.html#bpp-vcs" name="«Developer's Reference, 6.2.5. 'Version Control System location'»"> entre las lineas 6 y 7. Se supone que el paquete <package>gentoo</package> está alojado en el servicio «Debian Alioth Git» en <tt>git://git.debian.org/git/collab-maint/gentoo.git</tt>.
fr: Le champ <tt>Vcs-*</tt> documenté dans la <url id="http://www.debian.org/doc/manuals/developers-reference/best-pkging-practices.html#bpp-vcs" name="référence du développeur, 6.2.5 « Emplacement du système de gestion de versions »"> peut être inséré entre les lignes 6 et 7. Considérons que le paquet <package>gentoo</package> est localisé sur le service Git d'Alioth en <tt>git://git.debian.org/git/collab-maint/gentoo.git</tt>.
it: Si inseriscono quindi i campi <tt>Vcs-*</tt> documentati su <url id="http://www.debian.org/doc/manuals/developers-reference/best-pkging-practices.html#bpp-vcs" name="Developer's Reference, 6.2.5. 'Version Control System location'"> tra la linea 6 e 7. Si supponga che il pacchetto <package>gentoo</package> è posizionato nel Debian Alioth Git Service su <tt>git://git.debian.org/git/collab-maint/gentoo.git</tt>.
ja: <url id="http://www.debian.org/doc/manuals/developers-reference/best-pkging-practices.html#bpp-vcs" name="Developer's Reference, 6.2.5. 'Version Control System location'"> の6行目と7行目で説明されている<tt>Vcs-*</tt>フィールドを追加しましょう。<package>gentoo</package>パッケージが<tt>git://git.debian.org/git/collab-maint/gentoo.git</tt>のDebian Alioth Git Serviceにあると仮定しましょう。
zh_cn: 接下来我们按照 <url id="http://www.debian.org/doc/manuals/developers-reference/best-pkging-practices.html#bpp-vcs" name="Developer's Reference, 6.2.5. 'Version Control System location'"> 中记叙的内容在第 6 和第 7 行之间添加 <tt>Vcs-*</tt> 项。这里我们假设 <package>gentoo</package> 软件包处于 Debian Alioth Git 服务的 <tt>git://git.debian.org/git/collab-maint/gentoo.git</tt>
zh_tw: 接下來我們按照 <url id="http://www.debian.org/doc/manuals/developers-reference/best-pkging-practices.html#bpp-vcs" name="Developer's Reference, 6.2.5. 'Version Control System location'"> 中記敘的內容在第 6 和第 7 行之間添加 <tt>Vcs-*</tt> 項。這裏我們假設 <package>gentoo</package> 套件處於 Debian Alioth Git 服務的 <tt>git://git.debian.org/git/collab-maint/gentoo.git</tt>

source: Finally, here is the updated <file>control</file> file:
ca: Finalment, el fitxer <file>control</file> actualitzat quedarà així:
es: Aquí está el archivo <file>control</file> actualizado:
fr: Finalement, voici le fichier <file>control</file> mis à jour :
it: Infine, ecco come appare il file di controllo aggiornato:
ja: 以下が修正後の<file>control</file> ファイルです。
zh_cn: 到此为止，我们做好了 <file>control</file> 文件：
zh_tw: 到此爲止，我們做好了 <file>control</file> 檔案：

source: <file>copyright</file> file
ca: El fitxer <file>copyright</file>.
es: El archivo <file>copyright</file>
fr: Fichier <file>copyright</file>
it: Il file <file>copyright</file>
ja: <file>copyright</file>ファイル
zh_cn: <file>copyright</file> 文件
zh_tw: <file>copyright</file> 檔案

source: This file contains the information about package upstream resources, copyright and license information. Its format is not dictated by the Debian Policy Manual, but the content is (<url id="http://www.debian.org/doc/debian-policy/ch-docs.html#s-copyrightfile" name="Debian Policy Manual, 12.5 'Copyright information'">). You may also consult <url id="http://dep.debian.net/deps/dep5/" name="DEP-5: Machine-parseable debian/copyright">.
ca: Aquest arxiu conté la informació de la llicència i drets d'autor de les fonts originals del paquet. El format no està definit per les normes, però si el seu contingut (<url id="http://www.debian.org/doc/debian-policy/ch-docs.html#s-copyrightfile" name="«Debian Policy Manual, 12.5 'Copyright information'»">). Consulta <url id="http://dep.debian.net/deps/dep5/" name="«DEP-5: Machine-parseable debian/copyright»">.
es: Este fichero contiene la información sobre la licencia y copyright de las fuentes originales del paquete. El formato no está definido en las normas, pero sí en sus contenidos (<url id="http://www.debian.org/doc/debian-policy/ch-docs.html#s-copyrightfile" name="«Debian Policy Manual, 12.5 'Copyright information'»">). También puedes consultar <url id="http://dep.debian.net/deps/dep5/" name="«DEP-5: Machine-parseable debian/copyright»">.
fr: Ce fichier contient les informations sur les ressources en amont, le copyright et la licence du paquet. Le format n'est pas dicté par la Charte Debian, mais son contenu l'est (<url id="http://www.debian.org/doc/debian-policy/ch-docs.html#s-copyrightfile" name="Charte Debian, 12.5 « Informations sur le copyright »">). Vous pouvez aussi consulter la <url id="http://dep.debian.net/deps/dep5/" name="DEP-5 : debian/copyright analysable automatiquement">.
it: Questo file contiene le informazioni sulle risorse del pacchetto, il copyright e la licenza. Il suo formato non è definito dal Manuale delle policy di Debian, ma il contenuto si trova in (<url id="http://www.debian.org/doc/debian-policy/ch-docs.html#s-copyrightfile" name="Manuale delle policy di Debian, 12.5 'Informazioni di copyright'">). Si può anche consultare <url id="http://dep.debian.net/deps/dep5/" name="DEP-5: Machine-parseable debian/copyright">.
ja: このファイルにはパッケージの上流(upstream)に関するリソース、著作権、ライセンスなどの情報を記載します。書式に関しては、Debianポリシーマニュアルに定義されてませんが、内容は(<url id="http://www.debian.org/doc/debian-policy/ch-docs.html#s-copyrightfile" name="Debian Policy Manual, 12.5 'Copyright information'">)にあります。<url id="http://dep.debian.net/deps/dep5/" name="DEP-5: Machine-parseable debian/copyright">も参考になるかもしれません。
zh_cn: 这个文件包含了上游软件的资源、版权以及许可证信息。它的形式没有在 Debian Policy 中详述，但其内容为 (<url id="http://www.debian.org/doc/debian-policy/ch-docs.html#s-copyrightfile" name="Debian Policy Manual, 12.5 'Copyright information'">)。你还可以查看 <url id="http://dep.debian.net/deps/dep5/" name="DEP-5: Machine-parseable debian/copyright">。
zh_tw: 這個檔案包含了上游軟體的資源、版權以及許可證訊息。它的形式沒有在 Debian Policy 中詳述，但其內容爲 (<url id="http://www.debian.org/doc/debian-policy/ch-docs.html#s-copyrightfile" name="Debian Policy Manual, 12.5 'Copyright information'">)。你還可以查看 <url id="http://dep.debian.net/deps/dep5/" name="DEP-5: Machine-parseable debian/copyright">。

source: <prgn>dh_make</prgn> can give you a template <file>copyright</file> file. Let's use the "<tt>--copyright gpl2</tt>" option here to get a template file for the <package>gentoo</package> package released under GPL-2.
ca: <prgn>dh_make</prgn> proporciona una plantilla per a l'arxiu <file>copyright</file>. Amb l'opció "<tt>--copyright gpl2</tt>" s'aconsegueix la plantilla per al paquet <package>gentoo</package> amb la llicència GPL-2.
es: <prgn>dh_make</prgn> proporciona una plantilla para el archivo <file>copyright</file>. Con la opción "<tt>--copyright gpl2</tt>" se consigue la plantilla para el paquete <package>gentoo</package> con la licencia GPL-2.
fr: <prgn>dh_make</prgn> peut proposer un modèle de fichier <file>copyright</file>. L'option « <tt>--copyright gpl2</tt> » peut être utilisée ici pour obtenir un modèle de fichier pour le paquet <package>gentoo</package> package publié sous GPL-2.
ja: <prgn>dh_make</prgn>は<file>copyright</file>ファイルのテンプレートを作成します。GPL-2でリリースされた<package>gentoo</package>パッケージのテンプレートを入手するには、"<tt>--copyright gpl2</tt>"オプションを使用します。
zh_cn: <prgn>dh_make</prgn> 可以给出一个 <file>copyright</file> 文件的模板。在这里我们使用 <tt>--copyright gpl2</tt> 参数来获得一个模板写明 <package>gentoo</package> 软件包是发布于 GPL-2 许可证下。
zh_tw: <prgn>dh_make</prgn> 可以給出一個 <file>copyright</file> 檔案的模板。在這裏我們使用 <tt>--copyright gpl2</tt> 參數來獲得一個模板寫明 <package>gentoo</package> 套件是發佈於 GPL-2 許可證下。

source: You must fill in missing information such as the place you got the package from, the actual copyright notice and their license to complete this file. For the common free software licenses such as GNU GPL-1, GNU GPL-2, GNU GPL-3, LGPL-2, LGPL-2.1, LGPL-3, GNU FDL-1.2, GNU FDL-1.3, Apache-2.0 or the Artistic license, you can just refer to the appropriate file in <file>/usr/share/common-licenses/</file> directory that exists on every Debian system. Otherwise, you must include the complete license.
ca: Has de completar la informació sobre el lloc on es pot obtenir el codi font, les condicions dels drets d'autor i la llicència. Les llicències de codi lliure més comuns són GNU GPL-1, GNU GPL-2, GNU GPL-3, LGPL-2, LGPL-2.1, LGPL-3, GNU FDL-1.2, GNU FDL-1.3, Apache-2.0 o la «Artistic license» i fer referència al fitxer corresponent disponible a <file>/usr/share/common-licenses/</file> en els sistemes Debian. En cas contrari, cal incloure el text complet de la llicència en el fitxer.
es: Debes completar la información sobre el lugar donde se puede obtener el código fuente, la condiciones de derechos de autor y la licencia. Las licencias de código libre más comunes son GNU GPL-1, GNU GPL-2, GNU GPL-3, LGPL-2, LGPL-2.1, LGPL-3, GNU FDL-1.2, GNU FDL-1.3, Apache-2.0 o la «Artistic license» y hacer referencia al archivo correspondiente ubicado en el directorio <file>/usr/share/common-licenses/</file>, que existen en todos los sistemas Debian. De lo contrario, debe incluirse el texto de la licencia completo.
fr: Les choses à ajouter obligatoirement à ce fichier sont l'endroit où vous avez trouvé ce paquet, ainsi que le copyright et la licence d'exploitation réelle. Si la licence est une des licences de logiciel libre populaires comme GNU GPL-1, GNU GPL-2, GNU GPL-3, LGPL-2, LGPL-2.1, LGPL-3, GNU FDL-1.2, GNU FDL-1.3, Apache ou Artistic, vous pouvez juste faire référence au fichier approprié dans le répertoire <file>/usr/share/common-licenses/</file>, qui existe sur chaque système Debian. Sinon, vous devez inclure la licence en entier.
ja: パッケージの入手先や著作権表示、ラインセンスなど、抜けている情報を書き加え、ファイルを完成させましょう。GNU GPL-1、GNU GPL-2、GNU GPL-3、LGPL-2、LGPL-2.1,、LGPL-3、GNU FDL-1.2、GNU FDL-1.3、Apache-2.0や 創作上の特権など、一般的にフリーソフトウェアに使用される代表的なライセンスは、各Debianシステムの<file>/usr/share/common-licenses/</file>ディレクトリ内にあるファイルを参照することができ、全文の引用は不要です。その他のライセンスの場合、完全なライセンスを同包しなければなりません。
zh_cn: 你必须填写上其余的信息，如你从何处获得此软件，实际的版权声明和它们的许可证。对于常见的自由软件许可证，如 GNU GPL-1、GNU GPL-2、GNU GPL-3、LGPL-2、LGPL-2.1、LGPL-3、GNU FDL-1.2、GNU FDL-1.3、Apache-2.0 或 Artistic 许可证，你可以直接将其指向存在于所有 Debian 系统的 <file>/usr/share/common-licenses/</file> 目录下的相关文件。其他的许可证则必须包含完整的许可证文本。
zh_tw: 你必須填寫上其餘的訊息，如你從何處獲得此軟體，實際的版權聲明和它們的許可證。對於常見的自由軟體許可證，如 GNU GPL-1、GNU GPL-2、GNU GPL-3、LGPL-2、LGPL-2.1、LGPL-3、GNU FDL-1.2、GNU FDL-1.3、Apache-2.0 或 Artistic 許可證，你可以直接將其指向存在於所有 Debian 系統的 <file>/usr/share/common-licenses/</file> 目錄下的相關檔案。其他的許可證則必須包含完整的許可證文本。
