Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: Those <package>debhelper</package> configuration files without <file><var>package</var></file> prefix such as <file>install</file> apply to the first binary package. When there are many binary packages, their configurations can be specified by prefixing their name to their configuration filenames such as <file><var>package-1</var>.install</file>, <file><var>package-2</var>.install</file>, etc.
ca: Els fitxers de configuració construïts per <package>debhelper</package> que no tenen el prefix <file><var>nom_paquet</var></file> com és ara <file>install</file> s'aplicaran al primer paquet binari. Si hi ha més d'una paquet binari, les seves configuracions s'especificaran amb el prefix del paquet binari corresponent al seu nom: <file><var>paquet-1</var>.install</file>, <file><var>paquet-2</var>.install</file>, etc.
es: Los archivos de configuración construidos por <package>debhelper</package> que no tienen el prefijo <file><var>nombre_del_paquete</var></file> tales como <file>install</file> se aplicaran al primer paquete binario. Si hay varios paquetes binarios. sus configuraciones se especificaran con el prefijo de paquete binario correspondiente en su nombre: así tendrás los archivos <file><var>paquete-1</var>.install</file>, <file><var>paquete-2</var>.install</file>, etc.
fr: Les fichiers de configuration de <package>debhelper</package> sans préfixe <file><var>paquet</var></file> comme <file>install</file> sont relatifs au premier paquet binaire. Lorsqu'il y a plusieurs paquets binaires, leur configuration respective peut être précisée en ajoutant leur nom en préfixe du nom de fichier de configuration : <file><var>paquet-1</var>.install</file>, <file><var>paquet-2</var>.install</file>, etc.
it: Questi file di configurazione di <package>debhelper</package> senza prefisso del <file><var>pacchetto</var></file>, come nel file <file>install</file> vengono applicati al primo pacchetto binario. Quando ci sono molti pacchetti binari le loro configurazioni possono essere specificate aggiungendo il loro prefisso al nome del file di configurazione come <file><var>pacchetto-1</var>.install</file>, <file><var>pacchetto-2</var>.install</file>, ecc.
ja: <file><var>package</var></file>をプリフェックスとして持たない、例えば<file>install</file>のような<package>debhelper</package>の設定ファイルは、最初のバイナリパッケージへ適用されます。 バイナリパッケージが多数ある場合、<file><var>package-1</var>install</file>、<file><var>package-2</var>.install</file>、などのように、パッケージ名を設定ファイルのプリフェックスとすることで指定できます。
zh_cn: 不带有二进制软件包名(例如 <file><var>package</var></file>)前缀的 <package>debhelper</package> 配置文件则默认用于 <file>control</file> 文件中列出的第一个二进制软件包，如默认情况下的 <file>install</file> 文件。如果需要为其他二进制包使用配置，则应在配置文件名前加上二进制包名，如 <file><var>package-1</var>.install</file>、<file><var>package-2</var>.install</file> 等。
zh_tw: 不帶有二進位套件名(例如 <file><var>package</var></file>)前綴的 <package>debhelper</package> 設定檔案則默認用於 <file>control</file> 檔案中列出的第一個二進位套件，如默認情況下的 <file>install</file> 檔案。如果需要爲其他二進位套件使用設定，則應在設定檔案名前加上二進位套件名，如 <file><var>package-1</var>.install</file>、<file><var>package-2</var>.install</file> 等。

source: <file>README.Debian</file> file
ca: <file>README.Debian</file> (﻿LLEGEIX-ME.debian)
es: Archivo <file>README.Debian</file> (LÉEME.debian)
fr: Fichier <file>README.Debian</file>
it: Il file <file>README.Debian</file>
ja: <file>README.Debian</file> ファイル
zh_cn: <file>README.Debian</file> 文件
zh_tw: <file>README.Debian</file> 檔案

source: Any extra details or discrepancies between the original package and your Debian version should be documented here.
ca: Qualsevol detall extra o discrepància entre el programa original i la seva versió Debian cal documentar-la en aquest arxiu.
es: Cualquier detalle extra o discrepancias entre el programa original y su versión debianizada debería documentarse aquí.
fr: Tous les détails ou différences entre le paquet original et votre version Debian devraient être documentés ici.
ja: パッケージに関して、何か特別にユーザに知らせなければならない情報や、オリジナルのソフトウェアと作成したDebianパッケージとの相違点があればここに記述します。
zh_cn: 所有关于你的 Debian 版本与原始版本间的额外信息或差别都应在这里记录。
zh_tw: 所有關於你的 Debian 版本與原始版本間的額外訊息或差別都應在這裏記錄。

source: <prgn>dh_make</prgn> created a default one, this is what it looks like:
ca: <file>dh_make</file> crea una plantialla predeterminada, amb el següent text:
es: dh_make construye uno predeterminado, y éste es su aspecto:
fr: <prgn>dh_make</prgn> en crée un par défaut, qui ressemble à ceci :
it: <prgn>dh_make</prgn> ne crea uno predefinito, ecco come appare:
ja: 以下は<prgn>dh_make</prgn>がデフォルトとして生成するものです。
zh_cn: <prgn>dh_make</prgn> 创建了一个默认的文件，以下是它的样子：
zh_tw: <prgn>dh_make</prgn> 創建了一個默認的檔案，以下是它的樣子：

source: If you have nothing to be documented, remove this file. See <manref section="1" name="dh_installdocs">.
ca: Atès que no tenim res per explicar, eliminarem el fitxer. Consulta <manref section="1" name="dh_installdocs">.
es: Dado que no tenemos que poner nada aquí - está permitido borrarlo.Véase <manref section="1" name="dh_installdocs">.
fr: Si vous n'avez rien à documenter, effacez ce fichier, cf. <manref section="1" name="dh_installdocs">.
it: Qui dovrebbero inserire delle brevi informazioni specifiche di Debian. Si veda <manref section="1" name="dh_installdocs">.
ja: もし、ドキュメントがなければこのファイルを削除してください。詳しくは <manref section="1" name="dh_installdocs">を参照してください。
zh_cn: 如果你没有需要写在这里的东西，则删除这个文件。参看 <manref section="1" name="dh_installdocs">
zh_tw: 如果你沒有需要寫在這裏的東西，則刪除這個檔案。參考 <manref section="1" name="dh_installdocs">

source: <file>compat</file> file
ca: Fitxer <file>compat</file>.
es: Archivo <file>compat</file>
fr: Fichier <file>compat</file>
it: Il file <file>compat</file>
ja: <file>compat</file> ファイル
zh_cn: <file>compat</file> 文件
zh_tw: <file>compat</file> 檔案

source: The <file>compat</file> file defines the <package>debhelper</package> compatibility level. Currently, you should set it to the <package>debhelper</package> V7 by the following.
ca: El fitxer <file>compat</file> defineix el nivell de compatibilitat de <package>debhelper</package>. Actualment, ﻿establiràs la compatibilitat a la versió 7 de <package>debhelper</package> de la següent manera:
es: El archivo <file>compat</file> define el nivel de compatibilidad de <package>debhelper</package>. Actualmente, establecerás la compatibilidad a la versión 7 de <package>debhelper</package> como se indica a continuación.
fr: Le fichier <file>compat</file> définit le niveau de compatibilité de <package>debhelper</package>. Actuellement, vous devriez le définir à <package>debhelper</package> V7 comme suit :
ja: <file>compat</file>ファイルは、<package>debhelper</package>の互換性レベルを規定します。現段階では、以下のように<package>debhelper</package> V7に設定します。
zh_cn: <file>compat</file> 文件定义了 <package>debhelper</package> 的兼容级别。目前你应当使用以下命令将其设置为 <package>debhelper</package> V7。
zh_tw: <file>compat</file> 檔案定義了 <package>debhelper</package> 的兼容級別。目前你應當使用以下命令將其設置爲 <package>debhelper</package> V7。

source: <file>conffiles</file> file
ca: Fitxer <file>conffiles</file>.
es: Archivo <file>conffiles</file>
fr: Fichier <file>conffiles</file>
it: I file <file>conffiles</file>
ja: <file>conffiles</file>ファイル
zh_cn: <file>conffiles</file> 文件
zh_tw: <file>conffiles</file> 檔案

source: One of the most annoying things about software is when you spend a great deal of time and effort customizing a program, only to have an upgrade stomp all over your changes. Debian solves this problem by marking configuration files so that when you upgrade a package, you'll be prompted whether you want to keep your old configuration or not.
ca: Una de les coses més molestes dels programes és quan després de dedicar molt de temps i esforç a configurar un programa (com a usuari), una actualització del programa fa inútils els canvis. Debian resol aquesta situació marcant els fitxers de configuració de manera que quan actualitzes un paquet, tens l'opció de mantenir la teva configuració.
es: Una de las cosas más molestas de los programas es cuando pasas mucho tiempo y esfuerzo adaptando un programa (como usuario) y una actualización destroza todos tus cambios. Debian resuelve este problema marcando los ficheros de configuración de forma que cuando actualizas un paquete se te pregunta si deseas mantener la nueva configuración o no.
fr: Une des choses les plus irritantes à propos des logiciels est de consacrer beaucoup de temps et d'efforts pour configurer un programme, et de voir une seule mise à jour détruire tous ses changements. Debian résout ce problème en marquant les fichiers de configuration de sorte que quand vous mettez à jour un paquet, il vous sera demandé si vous voulez gardez votre ancienne configuration ou pas.
it: Una delle cose più fastidiose riguardanti il software accade quando si spende una grande quantità di tempo e di sforzi per personalizzare un programma solo per vedere un aggiornamento spazzare via tutte le modifiche fatte. Debian risolve questo problema applicando un marchio ai file di configurazione in modo tale che, quando si aggiorna un pacchetto, verrà richiesto se si vogliono mantenere o meno i vecchi file di configurazione.
ja: 大変な時間と労力を費やしてプログラムをカスタマイズしても、一回のアップグレードで上書きされてしまうとうんざりします。Debianはこの問題を、設定ファイルを記録しておき、パッケージをアップグレードする際に古い設定をそのまま使いたいかどうかを質問することで解決しました。
zh_cn: 系统管理中有件很恼人的事，就是当你付出了很多时间和经历来自定义一个程序，但是升级后所有的修改都被覆盖掉了。Debian 通过将配置文件单独标记来解决这个问题，当软件包升级的时候，你将会被询问是否要保留你的旧配置文件。
zh_tw: 系統管理中有件很惱人的事，就是當你付出了很多時間和經歷來自定義一個程式，但是升級後所有的修改都被覆蓋掉了。Debian 通過將設定檔案單獨標記來解決這個問題，當套件升級的時候，你將會被詢問是否要保留你的舊設定檔案。

source: Since <package>debhelper</package> V3, <manref section="1" name="dh_installdeb"> will <em>automatically</em> flag any files under the <file>/etc</file> directory as conffiles, so if your program only has conffiles there you do not need to specify them in this file. For most package types, the only place there is (and should be conffiles) is under <file>/etc</file> and so this file doesn't need to exist.
ca: Des de la versió 3 de <package>debhelper</package>, <manref section="1" name="dh_installdeb"> considera <em>automàticament</em> a tots els fitxers ubicats en el directori <file>/etc</file> com fitxers de configuració, de manera que si tots els fitxers de configuració del programa són en aquest directori, no es necessari que els incloguis en el fitxer «conffiles» (abreviatura d'arxiu de configuració). Per a la majoria de paquets, l'única ubicació dels arxius de configuració és <file>/etc</file> i en aquest cas pots eliminar aquest arxiu.
es: Desde la versión 3 de <package>debhelper</package>, <manref section="1" name="dh_installdeb"> considera <em>automáticamente</em> a todos los archivos ubicados en el directorio <file>/etc</file> como «conffiles» (archivos de configuración gestionados por el sistema de paquetes). Así, si todos los «conffiles» están en este directorio no es necesario que los incluyas en este archivo. Para la mayoría de paquetes, la única ubicación de los «conffiles» es <file>/etc</file> por lo que no es necesario generar este archivo.
fr: Depuis <package>debhelper</package> V3, <manref section="1" name="dh_installdeb"> va <em>automatiquement</em> considérer tous les fichiers du répertoire <file>/etc</file> comme des fichiers de configuration, donc si tous les fichiers de configuration de votre programme sont dans ce répertoire, il n'est pas nécessaire de les indiquer dans ce fichier. Pour la plupart des paquets, le seul endroit (et ce devrait toujours être le cas) contenant des fichiers de configuration est <file>/etc</file>, donc ce fichier ne devrait pas exister.
it: A partire da <package>debhelper</package> V3, <manref section="1" name="dh_installdeb"> <em>automaticamente</em> marcherà ogni file che si trova nella directory <file>/etc</file> come conffiles, così che se il programma ha soli file di configurazione in quella directory, non ci sarà bisogno di specificarli in questo file. Per la maggioranza dei tipi di pacchetto, l'unico posto in cui si trovano (ed in cui si dovrebbero trovare i conffile) è all'interno di <file>/etc</file> e quindi non c'è bisogno che questo file esista.
ja: <package>debhelper</package> V3、 <manref section="1" name="dh_installdeb"> は<em>自動的に</em><file>/etc</file>ディレクトリ以下のファイルを全てconffilesとみなすので、あなたのプログラムが他のディレクトリにconffilesを持たない場合は特に指定する必要はありません。ほとんどのパッケージの場合、<file>/etc</file>以下にのみconffilesがある（そうあるべきです）ので、このファイルの存在は不要です。
zh_cn: 从 <package>debhelper</package> V3 开始，<manref section="1" name="dh_installdeb"> 将 <em>自动</em> 识别所有在 <file>/etc</file> 目录下的文件为配置文件。所以如果你的程序只有在那里的配置文件，则不需再指定它们。
zh_tw: 從 <package>debhelper</package> V3 開始，<manref section="1" name="dh_installdeb"> 將 <em>自動</em> 識別所有在 <file>/etc</file> 目錄下的檔案爲設定檔案。所以如果你的程式只有在那裏的設定檔案，則不需再指定它們。

source: If your program uses configuration files but also rewrites them on its own, it's best not to make them as conffiles because <prgn>dpkg</prgn> will then prompt users to verify the changes all the time.
ca: Si el teu programa fa servir fitxers de configuració però també els sobreescriu ell mateix (directament des del codi font) es millor no marcar-los com «conffiles». Si ho fas, <prgn>dpkg</prgn> informarà als usuaris que revisin els canvis realitzats en aquests fitxers en cada actualització.
es: En el caso de que tu programa utilice ficheros de configuración pero también los reescriba él mismo es mejor no marcarlos como «conffiles». Si lo haces, <prgn>dpkg</prgn> informará a los usuarios que verifiquen los cambios de estos ficheros cada vez que lo actualicen.
fr: Si votre programme utilise des fichiers de configuration, mais les réécrit aussi de son côté, il vaut mieux ne pas les marquer comme fichiers de configuration, parce que <prgn>dpkg</prgn> va alors interroger les utilisateurs pour vérifier les modifications tout le temps.
it: Se il programma creato utilizza file di configurazione e li sovrascrive in automatico, è meglio non rendere questi ultimi dei file di configurazione perché <prgn>dpkg</prgn> chiederà ogni volta agli utenti di verificare i cambiamenti.
ja: あなたのプログラムが設定ファイルを利用する場合であっても、 その設定ファイルがプログラム自身によって頻繁に上書きされるような場合には、パッケージをアップグレードするたびに<prgn>dpkg</prgn>によって設定ファイルの変更について確認を求められることになるので、その設定ファイルをconffilesに登録しないほうが良いでしょう。
zh_cn: 如果你的程序使用配置文件，但程序会自动对配置进行改写，则最好也将其标记为配置文件，这样 <prgn>dpkg</prgn> 总是会要求用户校验发生了的变更。
zh_tw: 如果你的程式使用設定檔案，但程式會自動對設定進行改寫，則最好也將其標記爲設定檔案，這樣 <prgn>dpkg</prgn> 總是會要求用戶校驗發生了的變更。

source: If the program you're packaging requires every user to modify the configuration files in the <file>/etc</file> directory, there are 2 popular ways to make them not as conffiles to keep <prgn>dpkg</prgn> quiet.
ca: Si el programa que empaquetes requereix que cada usuari modifiqui els fitxers de configuració del directori <file>/etc</file>, hi ha dues formes per a no marcar-los com fitxers «conffiles» i que no siguin manipulats per <prgn>dpkg</prgn>:
es: Si el programa que estas empaquetando requiere que cada usuario modifique los archivos de configuración del directorio <file>/etc</file>, hay dos formas para no marcarlos como archivos «conffiles» y que no sean manipulados por <prgn>dpkg</prgn>
fr: Si le programme que vous empaquetez oblige chaque utilisateur à modifier les fichiers de configuration du répertoire <file>/etc</file>, il y a deux façons usuelles de ne pas les marquer comme fichiers de configuration pour que <prgn>dpkg</prgn> reste silencieux :
it: Se il programma di cui si sta creando il pacchetto richiede ad ogni utente di modificare i file di configurazione nella directory <file>/etc</file>, ci sono principalmente 2 modi per non renderli conffiles e quindi di mantenere <prgn>dpkg</prgn> tranquillo.
ja: あなたのパッケージングするプログラムが、ユーザーに<file>/etc</file>ディレクトリの中にある設定ファイルを編集することを要求する場合、<prgn>dpkg</prgn>を黙らせるためにconffilesとして登録するためによく使われる方法が２つあります。
zh_cn: 如果你正在打包的程序需要所有用户都为自己修改 <file>/etc</file> 目录中的配置，有两种常见的方法让 <prgn>dpkg</prgn> 不将其记录为配置文件。
zh_tw: 如果你正在打包的程式需要所有用戶都爲自己修改 <file>/etc</file> 目錄中的設定，有兩種常見的方法讓 <prgn>dpkg</prgn> 不將其記錄爲設定檔案。

source: You make a symlink under the <file>/etc</file> directory pointing to a file under the <file>/var</file> directory generated by the <em>maintainer scripts</em>.
ca: Construir un enllaç simbòlic dels fitxers ubicats en <file>/etc</file> que apunti als fitxers ubicats en el directori <file>/var</file> generats per <em>guions del desenvolupador</em> («maintainer scripts»).
es: Construir un enlace simbólico de los archivos ubicados en <file>/etc</file> que apunten a archivos ubicados en el directorio <file>/var</file> generados por <em>guiones del desarrollador </em> («maintainer scripts»).
fr: faire un lien symbolique dans le répertoire <file>/etc</file> vers un fichier du répertoire <file>/var</file> créé par les <em>scripts du responsable</em> ;
it: Si può creare un link simbolico nella directory <file>/etc</file> che punti ad un file nella directory <file>/var</file> generato dagli <em>script del manutentore</em>.
ja: <file>/etc</file>ディレクトリ中に、<em>maintainer scripts</em>によって生成された<file>/var</file>ディレクトリ以下のファイルにシンボリックリンクを張る方法と、
zh_cn: 用 <em>maintainer scripts</em> 在 <file>/etc</file> 目录中创建指向 <file>/var</file> 相关目录的符号链接。
zh_tw: 用 <em>maintainer scripts</em> 在 <file>/etc</file> 目錄中創建指向 <file>/var</file> 相關目錄的符號鏈接。

source: You make a file generated by the <em>maintainer scripts</em> under the <file>/etc</file> directory.
ca: Posar els fitxers generats pels <em>guions del desenvolupador</em> en el directori <file>/etc</file>.
es: Poner los archivos generados por los <em>guiones del desarrollador</em> en el directorio <file>/etc</file>.
fr: créer un fichier dans le répertoire <file>/etc</file> par les <em>scripts du responsable</em> ;
it: Si fa generare un file dagli <em>script del manutentore</em> nella directory <file>/etc</file>.
ja: <file>/etc</file>ディレクトリの中に<em>maintainer scripts</em>によってファイルを生成する方法です。
zh_cn: 用 <em>maintainer scripts</em> 在 <file>/etc</file> 目录中生成一个文件。
zh_tw: 用 <em>maintainer scripts</em> 在 <file>/etc</file> 目錄中生成一個檔案。

source: For more information on the <em>maintainer scripts</em>, see <ref id="maintscripts">.
ca: Si vols més informació sobre els <em>guions del desenvolupador</em> consulta <ref id="maintscripts">.
es: Para más información sobre los <em>guiones del desarrollador</em> véase <ref id="maintscripts">.
fr: Pour plus d'informations sur les <em>scripts du responsable</em>, veuillez consulter <ref id="maintscripts">.
it: Per maggiori informazioni sugli <em>script del manutentore</em>, si veda <ref id="maintscripts">.
ja: <em>maintainer scripts</em>について、詳細は<ref id="maintscripts">を参照してください。
zh_cn: 更多关于 <em>maintainer scripts</em> 的信息，参看 <ref id="maintscripts">
zh_tw: 更多關於 <em>maintainer scripts</em> 的訊息，參考 <ref id="maintscripts">

source: <file><var>package</var>.cron.*</file> files
ca: Fitxers <file><var>nom_paquet</var>.cron.*</file>
es: Archivos <file><var>nombre_del_paquete</var>.cron.*</file>
fr: Fichiers <file><var>paquet</var>.cron.*</file>
it: I file <file><var>pacchetto</var>.cron.*</file>
ja: <file><var>package</var>.cron.*</file>ファイル
zh_cn: <file><var>package</var>.cron.*</file> 文件
zh_tw: <file><var>package</var>.cron.*</file> 檔案

source: If your package requires regularly scheduled tasks to operate properly, you can use this file to set it up. You can either setup regular tasks that happen hourly, daily, weekly or monthly or alternatively happen any other time that you wish. The filenames are:
ca: Si el teu paquet requereix la realització de tasques periòdiques per funcionar correctament, pots fer servir aquest arxiu. Pots establir la realització de tasques cada hora, dia, setmana o mes o qualsevol altre període de temps. Els noms dels fitxers són:
es: Si tu paquete requiere tareas periódicas para funcionar adecuadamente, puedes usar este fichero como patrón. Puedes establecer la realización de tareas que se ejecuten cada hora, día, semana, o mes. O pueden ejecutarse en cualquier otro momento, si lo desea. Los nombres de los archivos son:
fr: Si votre paquet a besoin d'exécuter des tâches régulièrement pour fonctionner correctement, vous pouvez utiliser ce fichier pour les configurer. Vous pouvez soit programmer des tâches régulières horaires, quotidiennes ou mensuelles, soit des tâches qui se produiront au moment que vous préférez. Les noms de fichiers sont :
it: Se il pacchetto creato richiede che vengano programmate delle operazioni per funzionare correttamente, si può utilizzare questo file per lo scopo. Si possono programmare delle operazioni in modo tale che vengano eseguite su base oraria, giornaliera, settimanale, mensile o che vengano eseguite alternativamente in qualsiasi momento si voglia.
ja: パッケージが正しく動作するために、定期的にあるタスクを実行する必要がある場合は、このファイルで設定します。毎時間、毎日、毎週、または指定した時間にタスクを実行するように指定することができます。ファイル名：
zh_cn: 如果你的软件包需要有计划运行的操作以保证正常工作，可以使用这个文件进行设置。既可以设置常规的任务使其在每小时、每天、每星期、每月或其他情况或时间下运行。相应的文件名是：
zh_tw: 如果你的套件需要有計劃運行的操作以保證正常工作，可以使用這個檔案進行設置。既可以設置常規的任務使其在每小時、每天、每星期、每月或其他情況或時間下運行。相應的檔案名是：

source: <file>cron.hourly</file> - Installed as <file>/etc/cron.hourly/<var>package</var></file>: run once an hour every hour.
ca: <file>cron.hourly</file> - instal·lats com <file>/etc/cron.hourly/<var>nom_paquet</var></file>: s'executen cada hora.
es: <file>cron.hourly</file> - instalados como <file>/etc/cron.hourly/<var>nombre_del_paquete</var></file>: se ejecutan cada hora.
fr: <file>cron.hourly</file> &mdash; installé comme <file>/etc/cron.hourly/<var>paquet</var></file> : exécuté une fois par heure, toutes les heures ;
it: <file>cron.hourly</file> - Installato come <file>/etc/cron.hourly/<var>pacchetto</var></file>: viene eseguito una volta all'ora, ogni ora.
ja: <file>cron.hourly</file> - <file>/etc/cron.hourly/<var>package</var></file>としてインストール: 1時間ごとに実行する。
zh_cn: <file>cron.hourly</file> - 安装为 <file>/etc/cron.hourly/<var>package</var></file>：每小时运行一次。
zh_tw: <file>cron.hourly</file> - 安裝爲 <file>/etc/cron.hourly/<var>package</var></file>：每小時運行一次。

source: <file>cron.daily</file> - Installed as <file>/etc/cron.daily/<var>package</var></file>: run once a day, usually early morning.
ca: <file>cron.daily</file> - instal·lats com <file>/etc/cron.daily/<var>nom_paquet</var></file>: s'executen cada dia, habitualment a primera hora del matí.
es: <file>cron.daily</file> - instalados como <file>/etc/cron.daily/<var>nombre_del_paquete</var></file>: se ejecutan cada día, habitualmente por la mañana temprano.
fr: <file>cron.daily</file> &mdash; installé comme <file>/etc/cron.daily/<var>paquet</var></file> : exécuté une fois par jour, normalement tôt le matin ;
it: <file>cron.daily</file> - Installato as <file>/etc/cron.daily/<var>pacchetto</var></file>: viene eseguito una volta al giorno, di solito ogni mattino.
ja: <file>cron.daily</file> - <file>/etc/cron.daily/<var>package</var></file>としてインストール: 1日に1度実行。普通は早朝に実行する。
zh_cn: <file>cron.daily</file> - 安装为 <file>/etc/cron.daily/<var>package</var></file>：每天运行一次，通常在早晨。
zh_tw: <file>cron.daily</file> - 安裝爲 <file>/etc/cron.daily/<var>package</var></file>：每天運行一次，通常在早晨。

source: <file>cron.weekly</file> - Installed as <file>/etc/cron.weekly/<var>package</var></file>: run once a week, usually early Sunday morning.
ca: <file>cron.weekly</file> - instal·lats com <file>/etc/cron.weekly/<var>nom_paquet</var></file>: s'executen cada setmana, habitualment ﻿en el matí del diumenge.
es: <file>cron.weekly</file> - instalados como <file>/etc/cron.weekly/<var>nombre_del_paquete</var></file>: se ejecutan cada semana, habitualmente en la mañana del domingo.
fr: <file>cron.weekly</file> &mdash; installé comme <file>/etc/cron.weekly/<var>paquet</var></file> : exécuté une fois par semaine, normalement tôt le dimanche matin ;
it: <file>cron.weekly</file> - Installato come <file>/etc/cron.weekly/<var>pacchetto</var></file>: viene eseguito una volta a settimana, di solito ogni mattino di Domenica.
ja: <file>cron.weekly</file> - <file>/etc/cron.weekly/<var>package</var></file>としてインストール: 1週間に1度実行。普通は日曜の早朝に実行する。
zh_cn: <file>cron.weekly</file> - 安装为 <file>/etc/cron.weekly/<var>package</var></file>：每星期运行一次，通常在星期日早晨。
zh_tw: <file>cron.weekly</file> - 安裝爲 <file>/etc/cron.weekly/<var>package</var></file>：每星期運行一次，通常在星期日早晨。
