Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: The <prgn>quilt</prgn> command is explained in <manref section="1" name="quilt">. It records modifications to the source as a stack of <tt>-p1</tt> patch files in the <file>debian/patches</file> directory and the source tree is untouched outside of the <file>debian</file> directory. The order of these patches are recorded in the <file>debian/patches/series</file> file. You can apply (=push), un-apply (=pop), and refresh patches easily. <footnote><p>If you are asking a sponsor to upload your package, this kind of clear separation and documentation of your changes are very important to expedite the package review by your sponsor.</p></footnote>
ca: El funcionament de l'ordre <prgn>quilt</prgn> s'explica en <manref section="1" name="quilt">. Conserva les modificacions de les fonts en una col·lecció de fitxers de pegats <tt>-p1</tt> en el directori <file>debian/patches</file> i les fonts originals romanen sense modificar fora del directori <file>debian</file>. L'ordre d'aplicació de les modificacions es conserva en el fitxer <file>debian/patches/series</file>. Pots executar («push»), desfer («pop») i actualitzar les modificacions fàcilment <footnote><p>Si has demanat a un ﻿patrocinador que afegeixi el paquet al repositori Debian, aquest sistema de separació i documentació dels canvia és molt important per facilitar la revisió del paquet per part del ﻿patrocinador. </p></footnote>.
es: El funcionamiento de la orden <prgn>quilt</prgn> se explica en <manref section="1" name="quilt">. Conserva las modificaciones de las fuentes en una colección de archivos de parches <tt>-p1</tt> en el directorio <file>debian/patches</file> y las fuentes originales permanecen sin modificar fuera del directorio <file>debian</file>. El orden de aplicación de las modificaciones se conserva en el archivo <file>debian/patches/series</file>. Puedes aplicar («push»), deshacer («pop») y actualizar las modificaciones fácilmente <footnote><p>Si has solicitado a un patrocinador que transfiera el paquete al repositorio, este sistema de separación y documentación de los cambios es muy importante para facilitar la revisión del paquete por el patrocinador. </p></footnote>.
fr: La commande <prgn>quilt</prgn> est expliquée en <manref section="1" name="quilt">. Elle enregistre les modifications des sources comme une pile de fichiers correctifs <tt>-p1</tt> dans le répertoire <file>debian/patches</file> et l'arborescence source n'est pas modifiée en dehors du répertoire <file>debian</file>. L'ordre d'application de ces correctifs est enregistré dans le fichier <file>debian/patches/series</file>. Vous pouvez appliquer (« <tt>push</tt> »), enlever (« <tt>pop</tt> »), et rafraîchir (« refresh ») les correctifs facilement. <footnote><p>Si vous demandez à un parrain d'envoyer le paquet, cette séparation plutôt claire et cette documentation de vos changements sont très importantes pour accélérer l'examen du paquet.</p></footnote>
ja: <prgn>quilt</prgn>コマンドについては<manref section="1" name="quilt">で説明されています。ソースへの変更は、<file>debian/patches</file>ディレクトリ内<tt>-p1</tt>パッチファイルのスタックとして記録され、<file>debian</file>ディレクトリの外のソースツリーには触れません。それらのパッチの順番は<file>debian/patches/series</file>ファイルに記録されます。パッチの適用(push)も、外す(pop)のも、更新(refresh)も、簡単にできます。 <footnote><p>スポンサーにパッケージのアップロードを頼む時にも、あなたが加えた変更に対するこのような明確な分離とドキュメントは、スポンサーによるパッケージのレビューを促進させるためにも、非常に重要です。</p></footnote>
zh_cn: <prgn>quilt</prgn> 命令在 <manref section="1" name="quilt"> 中有详细描述。它将对源代码的修改维护于 <file>debian/patches</file> 中一系列 <tt>-p1</tt> 级别的补丁文件中，<file>debian</file> 目录外的文件没有任何修改。这些补丁的顺序记录于 <file>debian/patches/series</file> 文件中。你可以轻松地 apply (=push)、un-apply (=pop) 和 refresh 补丁。<footnote><p>如果你需要一个 sponsor 上传你的软件包，这种情况下，清晰的软件包分解和对你做出的更改的描述对于软件包的审查都非常重要。</p></footnote>
zh_tw: <prgn>quilt</prgn> 命令在 <manref section="1" name="quilt"> 中有詳細描述。它將對原始碼的修改維護於 <file>debian/patches</file> 中一系列 <tt>-p1</tt> 級別的補丁檔案中，<file>debian</file> 目錄外的檔案沒有任何修改。這些補丁的順序記錄於 <file>debian/patches/series</file> 檔案中。你可以輕鬆地 apply (=push)、un-apply (=pop) 和 refresh 補丁。<footnote><p>如果你需要一個 sponsor 上傳你的套件，這種情況下，清晰的套件分解和對你做出的更改的描述對於套件的審查都非常重要。</p></footnote>

source: For <ref id="modify">, we created 3 patches in <file>debian/patches</file>.
ca: A <ref id="modify">, s'han construït tres fitxers de pegats en el directori <file>debian/patches</file>.
es: En <ref id="modify">, se han construido tres archivos de parches en <file>debian/patches</file>.
fr: En <ref id="modify">, trois correctifs ont été créés dans <file>debian/patches</file>.
ja: <ref id="modify">では、<file>debian/patches</file>に３つのパッチを作りました。
zh_cn: 在 <ref id="modify"> 中，我们在 <file>debian/patches</file> 创建了三个补丁。
zh_tw: 在 <ref id="modify"> 中，我們在 <file>debian/patches</file> 創建了三個補丁。

source: Since Debian patches are located in <file>debian/patches</file>, please make sure to setup the <prgn>quilt</prgn> command properly as described in <ref id="quiltrc">.
ca: Com que els pegats s'ubiquen en <file>debian/patches</file>, comprova que has configurat correctament l'ordre <prgn>quilt</prgn> com es descriu a <ref id="quiltrc">.
es: Puesto que los parches se ubican en <file>debian/patches</file>, por favor asegúrate que has configurado adecuadamente la orden <prgn>quilt</prgn> como se describe en <ref id="quiltrc">.
fr: Puisque les correctifs Debian sont localisés en <file>debian/patches</file>, veuillez vous assurer d'avoir configuré correctement la commande <prgn>quilt</prgn> conformément à la description en <ref id="quiltrc">.
it: Dal momento che le patch di Debian sono posizionate in <file>debian/patches</file>, si prega di impostare correttamente il comando <prgn>quilt</prgn> come descritto in TODO "ref id="quiltrc"".
ja: Debianのパッチは<file>debian/patches</file>にあるので、<ref id="quiltrc">を参照し、<prgn>quilt</prgn>コマンドを正しく設定してください。
zh_cn: 因为 Debian 补丁位于 <file>debian/patches</file>，请确定按照 <ref id="quiltrc"> 中的方法正确配置 <prgn>quilt</prgn>。
zh_tw: 因爲 Debian 補丁位於 <file>debian/patches</file>，請確定按照 <ref id="quiltrc"> 中的方法正確設定 <prgn>quilt</prgn>。

source: When someone (including yourself) provides you with a patch <file><var>foo</var>.patch</file> to the source later, then the modification of a <tt>3.0 (quilt)</tt> source package is quite simple:
ca: Quan algú (inclòs tu mateix), facilita un pegat <file><var>nom_pegat</var>.patch</file> per a les fonts, una vegada construït el paquet, la modificació del paquet amb format <tt>3.0 (quilt)</tt> és així de simple:
es: Cuando alguien (incluido tú mismo), facilita un parche <file><var>nombre_parche</var>.patch</file> para las fuentes, cuando ya está construido el paquete, la modificación de un paquete con formato <tt>3.0 (quilt)</tt> es así de simple:
fr: Quand quelqu'un (éventuellement vous-même) fournit un correctif <file><var>toto</var>.patch</file> par la suite, la modification d'un paquet source <tt>3.0 (quilt)</tt> est assez simple :
it: Quando una qualsiasi persona fornisce una patch <file><var>foo</var>.patch</file> per i sorgenti, allora la modifica del pacchetto sorgente di tipo <tt>3.0 (quilt)</tt>è abbastanza semplice:
ja: 誰かが(あなた自身も含みます)<file><var>foo</var>.patch</file>というパッチを後から提供した時、<tt>3.0 (quilt)</tt>ソースパッケージの変更はとてもシンプルです。
zh_cn: 如果在之后有人提供了一个补丁 <file><var>foo</var>.patch</file>，对于 <tt>3.0 (quilt)</tt> 源代码包格式可以很容易修改：
zh_tw: 如果在之後有人提供了一個補丁 <file><var>foo</var>.patch</file>，對於 <tt>3.0 (quilt)</tt> 原始碼包格式可以很容易修改：

source: $ dpkg-source -x gentoo_0.9.12.dsc $ cd gentoo-0.9.12 $ quilt import ../<var>foo</var>.patch $ quilt push $ quilt refresh $ quilt header -e ... describe patch
ca: $ dpkg-source -x gentoo_0.9.12.dsc $ cd gentoo-0.9.12 $ quilt import ../<var>nom_pegat</var>.patch $ quilt push $ quilt refresh $ quilt header -e ... descripció de la modificació
es: $ dpkg-source -x gentoo_0.9.12.dsc $ cd gentoo-0.9.12 $ quilt import ../<var>nombre_parche</var>.patch $ quilt push $ quilt refresh $ quilt header -e ... descripción de la modificación
fr: $ dpkg-source -x gentoo_0.9.12.dsc $ cd gentoo-0.9.12 $ quilt import ../<var>toto</var>.patch $ quilt push $ quilt refresh $ quilt header -e ... description du correctif

source: The patches stored in the newer <tt>3.0 (quilt)</tt> source format must be <em>fuzz</em> free. You should ensure it as "<tt>quilt pop -a; while quilt push; do quilt refresh; done</tt>".
ca: Els pegats conservats amb el nou format de fonts <tt>3.0 (quilt)</tt> han d'estar <em>exempts</em> de coses innecessàries. Pots comprovar-ho executant "<tt>quilt pop -a; while quilt push; do quilt refresh; done</tt>".
es: Los parches conservados con el nuevo formato de fuentes <tt>3.0 (quilt)</tt> deben estar exentos de <em>cosas innecesarias</em>. Debes asegurarte ejecutando "<tt>quilt pop -a; while quilt push; do quilt refresh; done</tt>".
fr: Les correctifs conservés au nouveau format source <tt>3.0 (quilt)</tt> doivent être sans approximation (« <em>fuzz</em> »). Vous devriez vous en assurer avec « <tt>quilt pop -a; while quilt push; do quilt refresh; done</tt> ».
it: Le patch salvate nel nuovo formato sorgente <tt>3.0 (quilt)</tt> devono essere prive di <em>fuzz</em>. Bisogna quindi assicurarsi di ciò eseguendo "<tt>quilt pop -a; while quilt push; do quilt refresh; done</tt>".
ja: 新しい<tt>3.0 (quilt)</tt>形式で保存されるパッチは<em>曖昧</em>であってはいけません。それを保証するために、"<tt>quilt pop -a; while quilt push; do quilt refresh; done</tt>"としてください。
zh_cn: 存储于新的 <tt>3.0 (quilt)</tt> 源代码包格式的补丁必须有 <em>清晰的边界</em>。你应该通过 <tt>quilt pop -a; while quilt push; do quilt refresh; done</tt> 来验证这点。
zh_tw: 存儲於新的 <tt>3.0 (quilt)</tt> 原始碼包格式的補丁必須有 <em>清晰的邊界</em>。你應該通過 <tt>quilt pop -a; while quilt push; do quilt refresh; done</tt> 來驗證這點。

source: Building the package
ca: Construir el paquet.
es: Construyendo el paquete
fr: Construction du paquet
it: Costruzione del pacchetto
ja: パッケージの構築
zh_cn: 构建软件包
zh_tw: 構建套件

source: We should now be ready to build the package.
ca: Ara hauríem d'estar preparats per construir el paquet.
es: Ahora deberíamos estar preparados para construir el paquete.
fr: Tout devrait maintenant être prêt pour construire le paquet.
it: A questo punto, si dovrebbe essere pronti a creare il pacchetto.
ja: これでパッケージを構築する準備が整いました。
zh_cn: 现在我们已经为构建软件包做好了准备。
zh_tw: 現在我們已經爲構建套件做好了準備。

source: Complete (re)build
ca: Reconstrucció completa.
es: (Re)construcción completa
fr: Reconstruction complète
it: (ri)Creazione completa
ja: 完全な（再）構築
zh_cn: 完整的(重)构建
zh_tw: 完整的(重)構建

source: In order to properly make complete (re)build of a package, you have to ensure to install
ca: Per realitzar correctament la construcció ( o la reconstrucció) completa d'un paquet, comprova que els següents paquets estan instal·lats:
es: Para realizar correctamente la (re)compilación completa de un paquete, debes asegurarte que tienes instalados:
fr: Pour faire correctement la reconstruction complète d'un paquet, doivent être installés :
it: Al fine di (ri)creare un pacchetto in modo appropriato, è necessario assicurarsi di installare
ja: 完全なパッケージの（再）構築を行うには、
zh_cn: 为保证完整的软件包(重)构建能顺利进行，你必须保证系统中已经安装：
zh_tw: 爲保證完整的套件(重)構建能順利進行，你必須保證系統中已經安裝：

source: the <package>build-essential</package> package,
ca: el paquet <package>build-essential</package>.
es: el paquete <package>build-essential</package>.
fr: le paquet <package>build-essential</package> ;
it: il pacchetto <package>build-essential</package>,
ja: <package>build-essential</package>パッケージ、
zh_cn: <package>build-essential</package> 软件包；
zh_tw: <package>build-essential</package> 套件；

source: packages listed in the <tt>Build-Depends</tt> field (see <ref id="control">), and
ca: els paquets llistats en el camp <tt>Build-Depends</tt> del fitxer «control» (consulta <ref id="control">).
es: los paquetes listados en el campo <tt>Build-Depends</tt> del archivo «control» (<ref id="control">).
fr: les paquets énumérés dans le champ <tt>Build-Depends</tt>, cf. <ref id="control"> ;
ja: <tt>Build-Depends</tt>に挙げられているパッケージ(参照<ref id="control">)
zh_cn: 列于 <tt>Build-Depends</tt> 域的软件包(参看 <ref id="control">)；
zh_tw: 列於 <tt>Build-Depends</tt> 域的套件(參考 <ref id="control">)；

source: packages listed in the <tt>Build-Depends-indep</tt> field (see <ref id="control">).
ca: els paquets llistats en el camp <tt>Build-Depends-indep</tt> (també de l'arxiu «control», consulta <ref id="control">).
es: los paquetes listados en el campo <tt>Build-Depends-indep</tt> (también del archivo «control», <ref id="control">).
fr: les paquets énumérés dans le champ <tt>Build-Depends-indep</tt>, cf. <ref id="control">.
ja: <tt>Build-Depends-indep</tt>に挙げられているパッケージ(参照 <ref id="control">)が全てインストールされていなければなりません。
zh_cn: 列于 <tt>Build-Depends-indep</tt> 域的软件包(参看 <ref id="control">)。
zh_tw: 列於 <tt>Build-Depends-indep</tt> 域的套件(參考 <ref id="control">)。

source: Then you issue the following command in the source directory:
ca: Accedeix al directori principal del codi font del programa i executa la següent ordre:
es: Después ejecuta la siguiente orden en el directorio raíz del código fuente del programa:
fr: Ensuite, exécutez la commande suivante dans le répertoire des sources :
it: Adesso ci si sposti nella directory dei sorgenti del programma e si lancia il comando:
ja: ソースディレクトリーで以下のコマンドを実行してください:
zh_cn: 然后在源代码目录中执行以下命令：
zh_tw: 然後在原始碼目錄中執行以下命令：

source: $ dpkg-buildpackage
ca: dpkg-buildpackage -rfakeroot

source: This will do everything to make full binary and source packages for you. It will:
ca: Aquesta ordre farà totes les tasques necessàries per construir els paquets binaris i de fonts. Més concretament:
es: Esto hará todo lo necesario para construir los paquetes binarios y de fuentes para ti. Para ello:
fr: Ceci fera tout le nécessaire pour créer entièrement les paquets binaires et source à votre place :
it: Questo comando creerà i pacchetti binari e sorgenti al posto vostro. Eseguirà le seguenti operazioni:
ja: このコマンドはバイナリパッケージとソースパッケージを構築する作業をすべて行ってくれます。これには以下の作業が含まれます。
zh_cn: 这样会自动完成所有从源代码包构建二进制包的工作，包括：
zh_tw: 這樣會自動完成所有從原始碼包構建二進位套件的工作，包括：

source: clean the source tree ("<tt>debian/rules clean</tt>")
ca: neteja l'arbre del codi (<tt>debian/rules clean</tt>).
es: limpia el árbol del código fuente («<tt>debian/rules clean</tt>»)
fr: nettoyage de l'arbre des sources (« <tt>debian/rules clean</tt> ») ;
it: pulirà l'albero dei sorgenti ("<tt>debian/rules clean</tt>")
ja: ソースツリーの掃除 ("<tt>debian/rules clean</tt>")
zh_cn: 清理源代码树(<tt>debian/rules clean</tt>)
zh_tw: 清理原始碼樹(<tt>debian/rules clean</tt>)

source: build the source package ("<tt>dpkg-source -b</tt>")
ca: construeix el paquet de codi font (<tt>dpkg-source -b</tt>).
es: construye el paquete de código («<tt>dpkg-source -b</tt>»)
fr: construction du paquet source (« <tt>dpkg-source -b</tt> ») ;
it: costruirà il pacchetto sorgente ("<tt>dpkg-source -b</tt>")
ja: ソースパッケージの構築 ("<tt>dpkg-source -b</tt>")
zh_cn: 构建源代码包(<tt>dpkg-source -b</tt>)
zh_tw: 構建原始碼包(<tt>dpkg-source -b</tt>)

source: build the program ("<tt>debian/rules build</tt>")
ca: compila el programa (<tt>debian/rules build</tt>).
es: construye el programa («<tt>debian/rules build</tt>»)
fr: construction du programme (« <tt>debian/rules build</tt> ») ;
it: costruirà il programma ("<tt>debian/rules build</tt>")
ja: プログラムの構築 ("<tt>debian/rules build</tt>")
zh_cn: 构建程序(<tt>debian/rules build</tt>)
zh_tw: 構建程式(<tt>debian/rules build</tt>)

source: build binary packages ("<tt>fakeroot debian/rules binary</tt>")
ca: construeix el paquet binari ("<tt>fakeroot debian/rules binary</tt>")
es: construye el paquete binario ("<tt>fakeroot debian/rules binary</tt>")
fr: construction des paquets binaires (« <tt>fakeroot debian/rules binary</tt> ») ;
it: costruirà il pacchetto binario ("<tt>fakeroot debian/rules binary</tt>")
ja: バイナリパッケージの構築 ("<tt>fakeroot debian/rules binary</tt>")
zh_cn: 构建二进制包(<tt>fakeroot debian/rules binary</tt>)
zh_tw: 構建二進位套件(<tt>fakeroot debian/rules binary</tt>)

source: sign the source <file>.dsc</file> file, using <prgn>gpg</prgn>
ca: signa el fitxer font <tt>.dsc</tt>, fent servir <prgn>gpg</prgn>.
es: firma el fichero fuente <tt>.dsc</tt>, usando <prgn>gpg</prgn>
fr: signature du fichier source <file>.dsc</file>, en utilisant <prgn>gpg</prgn> ;
it: firmerà il file sorgente <file>.dsc</file> file, usando <prgn>gpg</prgn>
ja: <prgn>gpg</prgn> を使用したソース<file>.dsc</file>ファイルへの署名
zh_cn: 使用 <prgn>gpg</prgn> 签署 <file>.dsc</file> 文件
zh_tw: 使用 <prgn>gpg</prgn> 簽署 <file>.dsc</file> 檔案

source: create and sign the upload <file>.changes</file> file, using <prgn>dpkg-genchanges</prgn> and <prgn>gpg</prgn>
ca: construeix i signa el fitxer de càrrega telemàtica <tt>.changes</tt>, fent servir <prgn>dpkg-genchanges</prgn> i <prgn>gnupg</prgn>.
es: genera y firma el fichero de envío <tt>.changes</tt>, usando <prgn>dpkg-genchanges</prgn> y <prgn>gpg</prgn>
fr: création et signature du fichier de téléchargement <file>.changes</file>, en utilisant <prgn>dpkg-genchanges</prgn> et <prgn>gpg</prgn>.
it: creerà e firmerà il file di upload <file>.changes</file> file, usando <prgn>dpkg-genchanges</prgn> e <prgn>gpg</prgn>
ja: <prgn>dpkg-genchanges</prgn>および<prgn>gpg</prgn>を使用したアップロード用<file>.changes</file>ファイルの生成と署名
zh_cn: 使用 <prgn>dpkg-genchanges</prgn> 和 <prgn>gpg</prgn> 创建并签署上传用的 <file>.changes</file> 文件
zh_tw: 使用 <prgn>dpkg-genchanges</prgn> 和 <prgn>gpg</prgn> 創建並簽署上傳用的 <file>.changes</file> 檔案

source: The only input that will be required of you is your GPG secret pass phrase, twice.
ca: En el procés, hauràs d'escriure la teva contrasenya secreta de la clau GPG, dues vegades.
es: Lo único que se te pedirá es que escribas tu contraseña secreta de la clave GPG, dos veces.
fr: Seul votre mot de passe GPG vous sera demandé, deux fois.
it: Il solo input richiesto è la password per la propria chiave GPG, due volte.
ja: 途中で GPG の秘密鍵を 2 回入力する必要がありますが、 それ以外はこのプログラムにすべて任せておけば大丈夫です。
zh_cn: 这个过程中你需要做的就是输入两次你的 GPG 私钥密码。
zh_tw: 這個過程中你需要做的就是輸入兩次你的 GPG 私鑰密碼。

source: After all this is done, you will see the following files in the directory above (<file>~/gentoo</file>):
ca: Quan acabi el procés, veuràs els següents fitxers en el directori superior al directori de treball (<file>~/gentoo/</file>):
es: Después de hacer todo esto, verás los siguientes archivos en el directorio superior al directorio de trabajo (<file>~/gentoo/</file>):
fr: Une fois terminé, les fichiers suivants seront dans le répertoire parent (<file>~/gentoo/</file>) :
it: Fatto ciò, si vedranno quattro nuovi file nella directory dei sorgenti (<file>~/gentoo</file>):
ja: 一連の作業が終わった後、上記ディレクトリ(<file>~/gentoo</file>)には以下のファイルが生成されているはずです。
zh_cn: 之后查看上级目录(<file>~/gentoo</file>)：
zh_tw: 之後查看上級目錄(<file>~/gentoo</file>)：

source: <file>gentoo_0.9.12.orig.tar.gz</file>
ca: <em>gentoo_0.9.12.orig.tar.gz</em>
es: <em>gentoo_0.9.12.orig.tar.gz</em>

source: This is the original source code tarball, merely renamed to the above so that it adheres to the Debian standard. Note that this was created initially by the "<tt>dh_make -f ../gentoo-0.9.12.tar.gz</tt>".
ca: És el codi font original comprimit, simplement s'ha canviat el nom per ajustar-ho als estandards Debian. El fitxer s'ha construït executant l'ordre <tt>dh_make -f ../gentoo-0.9.12.tar.gz</tt> a l'inici.
es: Este es el código fuente original comprimido, simplemente se ha renombrado para seguir los estándares de Debian. Nótese que fue generado usando la opción «-f» de <tt>dh_make -f ../gentoo-0.9.12.tar.gz</tt> ejecutada en el inicio.
fr: C'est le code source d'origine, simplement renommé pour être conforme aux normes Debian. Il a été créé au début avec « <tt>dh_make -f ../gentoo-0.9.12.tar.gz</tt> ».
it: Questo è il codice sorgente originale, semplicemente rinominato in modo da aderire allo standard Debian. Da notare che questo è stato creato inizialmente con "<tt>dh_make -f ../gentoo-0.9.12.tar.gz</tt>".
ja: これは単に Debian 標準に合わせるために名前を変更しただけで、 中身はオリジナルなソースコードの tar アーカイブです。これはもともと、"<tt>dh_make -f ../gentoo-0.9.12.tar.gz</tt>"で作成されたということを覚えておいてください。
zh_cn: 这是原始的源代码 tarball，由 <tt>dh_make -f ../gentoo-0.9.12.tar.gz</tt> 命令重命名以符合 Debian 的标准。
zh_tw: 這是原始的原始碼 tarball，由 <tt>dh_make -f ../gentoo-0.9.12.tar.gz</tt> 命令重命名以符合 Debian 的標準。

source: <file>gentoo_0.9.12-1.dsc</file>
ca: <em>gentoo_0.9.12-1.dsc</em>
es: <em>gentoo_0.9.12-1.dsc</em>

source: This is a summary of the contents of the source code. The file is generated from your <file>control</file> file, and is used when unpacking the source with <manref section="1" name="dpkg-source">. This file is GPG signed, so that people can be sure that it's really yours.
ca: Aquest és un sumari dels continguts del codi font. Aquest arxiu es genera amb la informació del fitxer <file>control</file> i es fa servir quan es descomprimeixen les fonts amb <manref section="1" name="dpkg-source">. Aquest arxiu està signat amb GPG i així és possible comprovar qui és l'autor.
es: Este es un sumario de los contenidos del código fuente. Este fichero se genera a partir del fichero de <file>control</file> y se usa cuando se descomprimen las fuentes con <manref section="1" name="dpkg-source">. Este fichero está firmado con GPG de forma que cualquiera pueda estar seguro de que es realmente tuyo.
fr: C'est un résumé du contenu du code source. Il est créé à partir du fichier <file>control</file>, et est utilisé pour décompresser les sources avec <manref section="1" name="dpkg-source">. C'est un fichier signé avec GPG, de sorte que les gens peuvent être sûrs qu'il s'agit bien du vôtre.
it: Questo è un sommario del contenuto del codice sorgente. Questo file è generato dal file <file>control</file>, ed è usato quando si decomprime il sorgente con <manref section="1" name="dpkg-source">. Questo file è firmato con GPG, in modo da confermare l'autenticità dell'autore del pacchetto.
ja: これはソースコードの内容の概要です。このファイルは あなたの<file>control</file>ファイルから生成され、<manref section="1" name="dpkg-source">によって ソースを展開する時に使われます。また、GPG で署名されているので、本当にあなた自身が作成したものかどうかを利用者が検証できます。
zh_cn: 这是一个从 <file>control</file> 文件生成的源代码概要，可用于 <manref section="1" name="dpkg-source"> 程序。这个文件是使用 GPG 签署过的，以便别人可以确信它确实是你所提供的。
zh_tw: 這是一個從 <file>control</file> 檔案生成的原始碼概要，可用於 <manref section="1" name="dpkg-source"> 程式。這個檔案是使用 GPG 簽署過的，以便別人可以確信它確實是你所提供的。

source: This compressed tarball contains your <file>debian</file> directory contents. Each and every addition you made to the original source code are stored as <prgn>quilt</prgn> patches in <file>debian/patches</file>.
ca: Aquest arxiu comprimit té tots els fitxers del directori <file>debian</file>. Les modificacions de les fonts originals es conserven en els fitxers de pegats <prgn>quilt</prgn> en el directori <file>debian/patches</file>.
es: Este fichero comprimido contiene el directorio <file>debian</file> completo. Todas las modificaciones de las fuentes originales se conservan en los archivos de parches <prgn>quilt</prgn> en el directorio <file>debian/patches</file>.
fr: Cette archive compressée contient le répertoire <file>debian</file>. Tous les ajouts et modifications au code source d'origine sont conservés en tant que correctifs <prgn>quilt</prgn> dans <file>debian/patches</file>.
ja: この圧縮されたターボールには、あなたの<file>debian</file>ディレクトリーの中身が含まれています。オリジナルのソースコードに行った変更や追加などの情報は全て<file>debian/patches</file>内に、<prgn>quilt</prgn>パッチとして保存されます。
zh_cn: 这个压缩的 Tar 归档包含你的 <file>debian</file> 目录。其他对于源代码的修改都由 <prgn>quilt</prgn> 补丁存储于 <file>debian/patches</file> 中。
zh_tw: 這個壓縮的 Tar 歸檔包含你的 <file>debian</file> 目錄。其他對於原始碼的修改都由 <prgn>quilt</prgn> 補丁存儲於 <file>debian/patches</file> 中。
