Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: Relax and be ready for bug reports, because there is a lot more work to be done before your package will be fully in line with Debian policies and its best practice guidelines (once again, read the <em>real documentation</em> for details). Good luck!
ca: ﻿Relaxa't i estiguis preparat per rebre informes d'errades, perquè el camí és llarg per aconseguir el compliment de las Normes de Debian (una vegada més llegeix la <em>documentació real</em> per a més detalls). Bona sort!
es: Relájate y prepárate para recibir informes de fallos, porque hay mucho más trabajo que realizar antes de que tu paquete cumpla las Normas de Debian (una vez más lee la <em>documentación real</em> para más detalles). ¡Buena suerte!
fr: Relaxez-vous et soyez prêt pour les rapports de bogues, parce qu'il y aura beaucoup plus de travail à faire avant que votre paquet soit parfaitement conforme aux règles Debian (une fois encore, lisez la <em>vraie documentation</em> pour les détails). Bonne chance !
it: Ci si deve rilassare ed essere pronti per le segnalazioni di bug, perché c'è molto lavoro prima che un pacchetto sia completamente conforme alle policy di Debian (ancora una volta, si legga la <em>vera documentazione</em> per i dettagli). In bocca al lupo!
ja: リラックスしてバグ報告に備えてください。なにしろ、そのパッケージが Debian ポリシーやそのベストプラクティスに完全に沿うようになるまでには、やらなくてはいけないことは沢山あるのですから (繰り返しますが、詳細は<em>実際の文書</em>を読んでください)。頑張ってください！
zh_cn: 放松一点并准备好处理 Bug 报告，在你的软件包完全符合 Debian 的各项规范前还需要付出很多努力，处理 Bug 也是对你很好的锻炼(再一次提醒，阅读那些 <em>必须的文档</em> 来了解详情)。祝你好运！
zh_tw: 放鬆一點並準備好處理 Bug 報告，在你的套件完全符合 Debian 的各項規範前還需要付出很多努力，處理 Bug 也是對你很好的鍛鍊(再一次提醒，閱讀那些 <em>必須的文件</em> 來瞭解詳情)。祝你好運！

source: First steps
ca: ﻿Primers passos.
es: Primeros pasos
fr: Premiers pas
it: Primi passi
ja: はじめの一歩
zh_cn: 第一步
zh_tw: 第一步

source: Let's try to make your own package (or, better even, adopt an existing one).
ca: Començarem la construcció del teu paquet (o encara millor, pots adoptar un paquet ja existent).
es: Vamos a construir nuestro propio paquete (o, mejor aún, adoptar un paquete ya existente).
fr: Comment réaliser son premier paquet (ou, encore mieux, en adopter un).
ja: 自分のパッケージを作成してみましょう (それよりずっと良いのは、既存のものを引き取ってみることです)。
zh_cn: 让我们尝试创建一个自己的软件包(“收养”一个已存在的软件包则更好)。
zh_tw: 讓我們嘗試創建一個自己的套件(“收養”一個已存在的套件則更好)。

source: Choose your program
ca: Seleccionar el programa.
es: Elige el programa
fr: Choix du programme
it: Scegliamo il programma
ja: プログラムの選定
zh_cn: 选择你的程序
zh_tw: 選擇你的程式

source: You have probably chosen the package you want to create. The first thing you need to do is check if the package is in the distribution archive already by using <prgn>aptitude</prgn>.
ca: Probablement ja tens clar quin paquet vols construir. Primer cal que comprovis si ja està inclòs en el repositori fent servir l'ordre <prgn>aptitude</prgn>.
es: Probablemente hayas escogido ya el paquete que deseas construir. Lo primero que debes hacer es comprobar si el paquete está ya en el archivo de la distribución utilizando <prgn>aptitude</prgn>.
fr: Vous avez probablement choisi le paquet que vous voulez créer. La première chose à faire est de vérifier si le paquet ne se trouve pas déjà dans l'archive de la distribution en utilisant <prgn>aptitude</prgn>.
it: La prima cosa da fare, dopo quella di scegliere il programma per cui creare il pacchetto, è controllare se il pacchetto è già presente negli archivi della distribuzione, utilizzando <prgn>aptitude</prgn>.
ja: おそらく、作成したいパッケージを選んだことと思います。まず最初にしなければならないことは、ディストリビューションのアーカイブにそのパッケージがすでにあるかどうか、<prgn>aptitude</prgn> を使って確認することです。
zh_cn: 可能你已经选好了要制作的软件包。第一件要做的事是使用 <prgn>aptitude</prgn> 检查它是否已经存在于发行版仓库中了。
zh_tw: 可能你已經選好了要製作的套件。第一件要做的事是使用 <prgn>aptitude</prgn> 檢查它是否已經存在於發行版倉庫中了。

source: You can also check package information through <url id="http://www.debian.org/distrib/packages" name="package search page"> and <url id="http://packages.qa.debian.org/common/index.html" name="Debian Package Tracking System">.
ca: També pots consultar la <url id="http://www.debian.org/distrib/packages" name="﻿pàgina de recerca de paquets"> i el <url id="http://packages.qa.debian.org/common/index.html" name="Sistema de seguiment de paquets de Debian">.
es: También debes consultar la <url id="http://www.debian.org/distrib/packages" name="página de búsqueda de paquetes"> y en el <url id="http://packages.qa.debian.org/common/index.html" name="Sistema de seguimiento de paquetes de Debian">.
fr: Vous pouvez aussi vérifier les informations de paquets avec la <url id="http://www.debian.org/distrib/packages" name="page de recherche de paquets"> et le <url id="http://packages.qa.debian.org/common/index.html" name="système de suivi des paquets Debian">.
it: Si possono controllare le informazioni sui pacchetti anche nella <url id="http://www.debian.org/distrib/packages" name="pagina di ricerca dei pacchetti"> e nel <url id="http://packages.qa.debian.org/common/index.html" name="sistema di tracciamento dei bug di Debian">.
ja: パッケージの情報は、<url id="http://www.debian.org/distrib/packages" name="パッケージ検索ページ"> や <url id="http://packages.qa.debian.org/common/index.html" name="Debian パッケージ追跡システム">でもチェックすることができます。
zh_cn: 你还可以通过 <url id="http://www.debian.org/distrib/packages" name="软件包搜索页面"> 和 <url id="http://packages.qa.debian.org/common/index.html" name="Debian Package Tracking System"> (Debian 软件包跟踪系统，PTS)查询软件包信息。
zh_tw: 你還可以通過 <url id="http://www.debian.org/distrib/packages" name="套件搜索頁面"> 和 <url id="http://packages.qa.debian.org/common/index.html" name="Debian Package Tracking System"> (Debian 套件跟蹤系統，PTS)查詢套件訊息。

source: If the package already exists, well, install it! :-) If it happens to be <strong>orphaned</strong> -- if its maintainer is set to <url id="http://qa.debian.org/" name="Debian QA Group">, you may be able to pick it up if it's still available (check the ownership status at <url id="http://bugs.debian.org/wnpp" name="Debian Bug report logs: Bugs in package wnpp in unstable">). You may also adopt a package for which the corresponding maintainer has filed a "Request for Adoption" (<strong>RFA</strong>).
ca: Si el paquet ja existeix, comença per instal·lar-ho. Si és un ﻿paquet <strong>orfe</strong> (si el responsable actual és el <url id="http://qa.debian.org/" name="«Debian QA Group»">, el grup de qualitat de Debian), ﻿pots adoptar-lo (convertir-te en el responsable del manteniment) si està disponible. Cal que ho comprovis a <url id="http://bugs.debian.org/wnpp" name="«Debian Bug report logs»: errors en el paquet «wnpp» de la distribució de treball («inestable» o «sid»)">. També pots adoptar un paquet si hi ha un avís de «sol·licitud d'adopció» («"Request for Adoption"» o <strong>RFA</strong>).
es: Si el paquete ya existe, ¡instálalo! :-) Si te encuentras con que el paquete es un paquete <strong>huérfano</strong> (cuando su desarrollador es el <url id="http://qa.debian.org/" name="Debian QA Group">, es decir, el grupo de calidad de Debian), puedes adoptarlo (convertirte en el responsable de empaquetarlo y mantenerlo) si está disponible, comprueba si realmente está disponible en <url id="http://bugs.debian.org/wnpp" name="«Debian Bug report logs»: Errores en el paquete «wnpp» en la distribución de trabajo («inestable» o «sid»)">. También puedes adoptar un paquete para el cual se ha emitido una «solicitud de adopción» ("Request for Adoption" o <strong>RFA</strong>) por su desarrollador o por un DD.
fr: Si le paquet existe déjà, et bien, installez-le :-). S'il se trouve qu'il est <strong>orphelin</strong> &mdash; si son responsable est « <url id="http://qa.debian.org/" name="Debian QA Group"> », vous devriez pouvoir le reprendre s'il est toujours disponible (vérifier qui est le propriétaire sur les <url id="http://bugs.debian.org/wnpp" name="jounaux de rapport de bogue Debian : bogues du paquet wnpp dans unstable">). Vous pouvez aussi adopter un paquet pour lequel le responsable a rempli une demande d'adoption (« Request for Adoption » ou <strong>RFA</strong>).
ja: もしパッケージが既に存在していたら、インストールしましょう！ :-) もしそのパッケージが<strong>「みなしご化」</strong>されていたら -- つまりメンテナが <url id="http://qa.debian.org/" name="Debian QA Group"> になっていたら、そのパッケージがまだ利用可能であれば、そのパッケージを引き取ることができるかもしれません (<url id="http://bugs.debian.org/wnpp" name="Debian Bug report logs: Bugs in package wnpp in unstable"> で所有者の状況をチェックしてください)。関係しているメンテナが "引き取り依頼" (<strong>RFA</strong>) を出しているパッケージを引きとるのもアリです。
zh_cn: 如果软件包已经存在，直接安装就好了！:-) 如果它是被 <strong>抛弃(orphaned)</strong> 的——也就是说它的维护者被设置为 <url id="http://qa.debian.org/" name="Debian QA Group">，那么你可以尝试接手维护它(在 <url id="http://bugs.debian.org/wnpp" name="Debian Bug report logs: Bugs in package wnpp in unstable"> 检查它的维护者信息)。你也可以“收养”维护者发出“Request for Adoption”(<strong>RFA</strong>)请求的软件包。
zh_tw: 如果套件已經存在，直接安裝就好了！:-) 如果它是被 <strong>拋棄(orphaned)</strong> 的——也就是說它的維護者被設置爲 <url id="http://qa.debian.org/" name="Debian QA Group">，那麼你可以嘗試接手維護它(在 <url id="http://bugs.debian.org/wnpp" name="Debian Bug report logs: Bugs in package wnpp in unstable"> 檢查它的維護者訊息)。你也可以“收養”維護者發出“Request for Adoption”(<strong>RFA</strong>)請求的套件。

source: Several different views of orphaned or RFA'ed packages are available at:
ca: Pots consultar les ﻿següents llistes de paquets orfes o de RFA a:
es: Puedes consultar las siguientes listas de paquetes huérfanos o de RFA en:
fr: Différentes vues des paquets orphelins ou en attente d'adoption sont disponibles :
ja: みなしご化された、あるいは RFA されたパッケージについて、いくつか違った見方ができるようになっています：
zh_cn: 有几种查看 RFA 软件包的方法：
zh_tw: 有幾種查看 RFA 套件的方法：

source: As a side note, it's important to point out that Debian already has packages for most kinds of programs, and the number of packages already in the Debian archive is much larger than that of contributors with upload rights. Thus, contributions to packages already in the archive are far more appreciated (and more likely to receive sponsorship) by other developers <footnote><p>Having said that, there will of course always be new programs that are worthwhile packaging.</p></footnote>. You can do that in various ways.
ca: Cal tenir present que Debian incorpora paquets d'un gran nombre de programes de tot tipus i que la quantitat de paquets disponibles en el repositori de Debian és major que el nombre de col·laboradors amb autorització per afegir paquets al repositori. En conseqüència, la col·laboració en el manteniment de paquets que ja estan en el repositori es valora molt positivament (i és més fàcil trobar un patrocinador) per la resta de desenvolupadors <footnote><p>Tot i així, hi ha nous programes que són d'interès per a Debian. </p></footnote>. Per col·laborar en el manteniment de paquets ja disponibles en el repositori tens les següents opcions:
es: A modo de nota al margen, es importante tener presente que Debian incorpora paquetes de un gran número de programas de todo tipo, y que la cantidad de paquetes disponibles en el repositorio de Debian es mucho mayor al de colaboradores con permiso para incorporar paquetes al repositorio. En consecuencia, la colaboración en el mantenimiento de paquetes que ya están en el repositorio se valora muy positivamente (y es más fácil conseguir patrocinador) por el resto de desarrolladores <footnote><p>Dicho esto, hay, por supuesto, nuevos programas que vale la pena empaquetar para Debian.</p></footnote>. Puedes hacer esto de distintas formas.
fr: En remarque, il est important de souligner que Debian possède déjà des paquets pour quasiment tous les types de programme, et que le nombre de paquets déjà dans l'archive Debian est bien plus important que le nombre de personnes ayant les droits suffisants pour envoyer les mises à jour. Par conséquent, contribuer aux paquets existants déjà dans l'archive est bien plus apprécié (avec plus de chances d'être parrainé) des autres développeurs <footnote><p>Ceci dit, il existera toujours des paquets qui vaudront la peine d'être empaquetés.</p></footnote>. Il est possible de le faire de plusieurs façons comme suit :
ja: 注釈ですが、Debian にはすでにほとんどの種類のプログラムが含まれていること、Debian アーカイブにすでに含まれているパッケージの数は、アップロード権限をもつユーザの数よりもはるかに多いこと、に注意しておくのは重要です。従って、すでにアーカイブに含まれているパッケージへの作業は、他の開発者からはるかに喜ばれます (し、よりスポンサーしてもらえる見込みがあります)。 <footnote><p>とはいっても、パッケージ化する価値のある新しいプログラムはいつだって存在するでしょう。</p></footnote>。作業のやり方はいろいろあります。
zh_cn: 仅作为一笔旁注，Debian 已经拥有了绝大多数类型软件的软件包，仓库中软件包的数量也远远超过了有上传权限的贡献者的数量。因此，为已经在仓库中的软件包贡献力量是非常受其他开发者欢迎的(且更容易获得 sponsorship)<footnote><p>当然，也一定总是有值得打包的新软件。</p></footnote>。你可以通过非常多的方式来实现这一目的。
zh_tw: 僅作爲一筆旁註，Debian 已經擁有了絕大多數類型軟體的套件，倉庫中套件的數量也遠遠超過了有上傳權限的貢獻者的數量。因此，爲已經在倉庫中的套件貢獻力量是非常受其他開發者歡迎的(且更容易獲得 sponsorship)<footnote><p>當然，也一定總是有值得打包的新軟體。</p></footnote>。你可以通過非常多的方式來實現這一目的。

source: taking over orphaned, yet actively used, packages
ca: Fer-te càrrec de paquets orfes d'ús freqüent
es: hacerte cargo de paquetes huérfanos pero que son utilizados frecuentemente por otros usuarios
fr: se charger de paquets orphelins, encore largement utilisés ;
ja: まだよく使われている、みなしごのパッケージを引き取る
zh_cn: 接手被抛弃而仍然被很多人使用的软件包。
zh_tw: 接手被拋棄而仍然被很多人使用的套件。

source: joining <url id="http://wiki.debian.org/Teams" name="packaging teams">
ca: Consultar els <url id="http://wiki.debian.org/Teams" name="equips de desenvolupadors">.
es: consultando <url id="http://wiki.debian.org/Teams" name="equipos de desarrolladores">.
fr: rejoindre des <url id="http://wiki.debian.org/Teams" name="équipes d'empaquetage"> ;
ja: <url id="http://wiki.debian.org/Teams" name="パッケージ化チーム">に参加する
zh_cn: 加入 <url id="http://wiki.debian.org/Teams" name="打包小组">。
zh_tw: 加入 <url id="http://wiki.debian.org/Teams" name="打包小組">。

source: triaging bugs of very popular packages
ca: Selecciona errors dels paquets més populars.
es: seleccionando errores de los paquetes más populares
fr: trier des bogues de paquets populaires ;
ja: よく使われているパッケージのバグに対処する
zh_cn: 为某些常用的软件包分类 Bug。
zh_tw: 爲某些常用的套件分類 Bug。

source: preparing <url id="http://www.debian.org/doc/developers-reference/pkgs.html#nmu-qa-upload" name="QA or NMU uploads">
ca: Selecciona <url id="http://www.debian.org/doc/developers-reference/pkgs.html#nmu-qa-upload" name="paquets QA o NMU">.
es: preparando <url id="http://www.debian.org/doc/developers-reference/pkgs.html#nmu-qa-upload" name="paquetes QA o NMU">
fr: préparer des <url id="http://www.debian.org/doc/developers-reference/pkgs.html#nmu-qa-upload" name="envois de QA ou des NMU">
ja: <url id="http://www.debian.org/doc/developers-reference/pkgs.html#nmu-qa-upload" name="QA もしくは NMU アップロード"> を準備する
zh_cn: 在需要时准备 <url id="http://www.debian.org/doc/developers-reference/pkgs.html#nmu-qa-upload" name="QA 或 NMU 上传">。
zh_tw: 在需要時準備 <url id="http://www.debian.org/doc/developers-reference/pkgs.html#nmu-qa-upload" name="QA 或 NMU 上傳">。

source: If you are able to adopt the package, get the sources (with something like "<tt>apt-get source <var>packagename</var></tt>") and examine them. This document unfortunately doesn't include comprehensive information about adopting packages. Thankfully you shouldn't have a hard time figuring out how the package works since someone has already done the initial set up for you. Keep reading, though, a lot of the advice below will still be applicable for your case.
ca: Si pots adoptar un paquet, descarrega el codi original (pots fer servir "<tt>apt-get source packagename</tt>") i ﻿examina-les amb atenció. Aquest document no explica amb detall el procés d'adopció de paquets. No hauria de ser difícil saber com funciona el paquet: el treball inicial de construcció ja està fet. Tot i així, molta de la informació d'aquest document et serà d'utilitat.
es: Si puedes adoptar el paquete, descarga las fuentes (con algo como "<tt>apt-get source <var>nombre_del_paquete</var></tt>") y examínalas. Desgraciadamente este documento no incluye aún información exhaustiva sobre la adopción de paquetes. No debería ser difícil entender cómo funciona el paquete ya que alguien ha hecho el trabajo inicial por ti. Aún así es mejor que sigas leyendo, muchos de los consejos que se dan a continuación serán también aplicables para tu caso.
fr: Si vous pouvez adopter le paquet, récupérez les sources (avec quelque chose comme « <tt>apt-get source <var>nomdepaquet</var></tt> ») et examinez-les. Malheureusement ce document n'inclut pas d'informations exhaustives sur l'adoption de paquets. Heureusement, vous ne devriez pas avoir de problèmes à comprendre comment le paquet fonctionne, puisque quelqu'un a déjà fait la configuration pour vous. Continuez quand même à lire ce document, une bonne partie des conseils qui suivent seront applicables dans votre cas.
it: Appena ci si sente in grado di adottare un pacchetto, bisogna scaricare i sorgenti (con qualcosa tipo "<tt>apt-get source <var>pacchetto</var></tt>") ed esaminarli. Questo documento purtroppo non include tutte le informazioni che riguardano l'adozione dei pacchetti. Fortunatamente non sarà difficile capire come funziona il pacchetto dal momento che qualcuno avrà già effettuato la configurazione iniziale. Continua a leggere comunque, molti dei suggerimenti qui di seguito saranno ancora utili al caso.
ja: もしパッケージを引き取ることができるなら、(<tt>apt-get source <var>パッケージ名</var></tt> などの方法で) ソースを入手して、調べてみてください。残念ながらこの文書では、パッケージを引き取ることについて、わかりやすく説明してはいません。ありがたいことに、既に誰かがあなたのためにパッケージを準備してくれたわけですから、そのパッケージがどのように動作するのか理解することは、それほど難しくはないでしょう。とはいえ、そうした場合でもこの文書に書かれた多くのアドバイスはそのまま通用しますから、このまま読み進めていってください。
zh_cn: 如果你有能力“收养”那个软件包，下载(使用 <tt>apt-get source <var>packagename</var></tt> 或其他类似的工具)并分析它的代码。这篇文档没有包含如何接手软件包的详细信息，但幸运的是因为接手软件包时起始的工作已经有人完成，接手的工作应比从头开始轻松得多。尽管如此，请继续阅读，下面给出的建议会对你很有帮助。
zh_tw: 如果你有能力“收養”那個套件，下載(使用 <tt>apt-get source <var>packagename</var></tt> 或其他類似的工具)並分析它的程式碼。這篇文件沒有包含如何接手套件的詳細訊息，但幸運的是因爲接手套件時起始的工作已經有人完成，接手的工作應比從頭開始輕鬆得多。儘管如此，請繼續閱讀，下面給出的建議會對你很有幫助。

source: If the package is new, and you decide you'd like to see it in Debian, proceed as follows:
ca: Si el paquet és nou i decideixes que t'agradaria posar-lo a disposició dels usuaris de Debian, ﻿has de seguir els passos indicats a continuació:
es: Si el paquete es nuevo y decides que te gustaría verlo en Debian debes seguir los pasos indicados a continuación:
fr: Si le paquet est nouveau, et que vous aimeriez le voir dans Debian, procédez comme suit :
it: Se il pacchetto è nuovo, e si pensa che sarebbe bello entrare a far parte di Debian, ecco come procedere:
ja: もしあなたの選んだプログラムがまだパッケージ化されていないもので、それを Debian に入れたいと決めたなら、以下のチェック項目について確認してください。
zh_cn: 如果你要制作的软件包是全新的，并且希望它出现在 Debian 中，请按照以下的步骤进行：
zh_tw: 如果你要製作的套件是全新的，並且希望它出現在 Debian 中，請按照以下的步驟進行：

source: First, you must know that program works, and have tried it for some time to confirm its usefulness.
ca: Aprèn el funcionament del programa i fes-ho servir una temporada (per comprovar la seva utilitat).
es: En primer lugar deberías saber cómo funciona, y haberlo utilizado durante algún tiempo (para confirmar su utilidad).
fr: d'abord, assurez-vous qu'il fonctionne, et essayez-le pendant quelques temps pour confirmer son utilité ;
it: Prima di tutto bisogna capire se il programma funziona in modo corretto, e averlo provato per almeno un po' di tempo e dimostrarne l'utilità.
ja: まず、そのプログラムが機能することがわかっていて、その有用性についてある程度の期間確かめておかねばなりません。
zh_cn: 首先，你必须知道这个软件能够工作，并且需要试用一段时间。
zh_tw: 首先，你必須知道這個軟體能夠工作，並且需要試用一段時間。

source: You must check if no one else is working on the package already at <url id="http://www.de.debian.org/devel/wnpp/being_packaged" name="the list of packages being worked on">. If no one else is working on it, file an ITP (Intent To Package) bug report to the <package>wnpp</package> pseudo-package using <prgn>reportbug</prgn>. If someone's already on it, contact them if you feel you need to. If not - find another interesting program that nobody maintains.
ca: Comprova que no hi ha cap altra persona treballant en el paquet consultant <url id="http://www.de.debian.org/devel/wnpp/being_packaged" name="la llista de paquets en els què s'està treballant">. Si ningú hi treballa, envia un informe d'error de tipus «ITP» («Intent To Package») al <package>wnpp</package> meta-paquet fent servir el programa de comunicació d'errors <prgn>reportbug</prgn> (accessible en el menú d'eines del sistema). En cas contrari, pots contactar amb les persones que hi treballen: és possible que puguis col·laborar. També pots intentar trobar un altra programa interessant en el qual no hi treballi cap persona.
es: Comprueba que no hay nadie más trabajando ya en el paquete consultando <url id="http://www.de.debian.org/devel/wnpp/being_packaged" name="la lista de paquetes en los que se está trabajando">. Si nadie está ya trabajando en el empaquetado del programa, envía un informe de error de tipo ITP («Intent To Package», Intento de empaquetado) al meta-paquete <package>wnpp</package> utilizando el programa de comunicación de errores <prgn>reportbug</prgn> (accesible en el menú de herramientas del sistema). Si ya hay alguien trabajando en él, contacta con esa persona: es posible que podáis colaborar. En caso contrario, intenta encontrar otro programa interesante que nadie mantenga.
fr: vérifiez que personne d'autre ne travaille déjà sur ce paquet en consultant la <url id="http://www.debian.org/devel/wnpp/being_packaged" name="liste des paquets en cours de création">. Si personne ne travaille dessus, déclarez votre intention de l'empaqueter (« Intent To Package » ou ITP) avec un bogue ITP sur le pseudo-paquet <package>wnpp</package> en utilisant <prgn>reportbug</prgn>. Si quelqu'un travaille déjà dessus, contactez-le si vous voulez. Sinon, trouvez un autre programme intéressant dont personne n'est responsable.
it: Bisogna controllare su <url id="http://www.debian.org/devel/wnpp/being_packaged" name="lista dei pacchetti sui quali si lavora"> che nessun altro stia lavorando sullo stesso pacchetto. Se nessuno ci sta lavorando, si può segnalare un bug di tipo ITP (Intent To Package) allo pseudo-pacchetto <package>wnpp</package> usando il programma <prgn>reportbug</prgn>. Se qualcuno ci sta lavorando e si ritiene necessario si potrebbe contattare il maintainer. Altrimenti - si potrebbe trovare un altro programma interessante che non manutenuto.
ja: <url id="http://www.de.debian.org/devel/wnpp/being_packaged" name="作業中のパッケージ"> を確認し、他に誰も同じパッケージを作っていないことを確かめてください。誰も作業していなければ、<prgn>reportbug</prgn> を使って ITP (Intent To Package) のバグレポートを、<package>wnpp</package> 疑似パッケージに送ってください。もし既に誰かが作業していたら、必要に応じて連絡をとってください。もしその必要が無ければ、まだ誰も手をつけていない他の面白いプログラムを探して再チャレンジです。
zh_cn: 你必须在 <url id="http://www.debian.org/devel/wnpp/being_packaged" name="正在被处理的软件包列表"> 上查看以确定没有其他人已经开始了工作。如果没有，则提交一份 ITP (Intent To Package) Bug 报告到 <package>wnpp</package> pseudo 软件包(可以使用 <prgn>reportbug</prgn>)。如果已经有人在处理，则在需要的情况下联系他或他们。如果不需要你的帮助，就寻找其他你感兴趣且没有人维护的软件包。
zh_tw: 你必須在 <url id="http://www.debian.org/devel/wnpp/being_packaged" name="正在被處理的套件列表"> 上查看以確定沒有其他人已經開始了工作。如果沒有，則提交一份 ITP (Intent To Package) Bug 報告到 <package>wnpp</package> pseudo 套件(可以使用 <prgn>reportbug</prgn>)。如果已經有人在處理，則在需要的情況下聯繫他或他們。如果不需要你的幫助，就尋找其他你感興趣且沒有人維護的套件。

source: That program <strong>must have a license</strong>.
ca: Cal que el programa <strong>tengui</strong> una llicència:
es: El programa <strong>debe</strong> tener una licencia.
fr: le programme <strong>doit</strong> avoir une licence :
it: il programma <strong>deve avere una licenza</strong>.
ja: プログラムには、<strong>ライセンスが必須</strong>です。
zh_cn: 软件 <strong>必须有一个许可证</strong>。
zh_tw: 軟體 <strong>必須有一個許可證</strong>。
