Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: If <package>lintian</package> reports an erroneous diagnostics for a case when the policy allows exceptions to some rule, you can use <file><var>package</var>.lintian-overrides</file> or <file>source/lintian-overrides</file> to quiet it. Please read <file>/usr/share/doc/lintian/lintian.html/index.html</file> and refrain from abusing this.
ca: Si el programa <package>lintian</package> fa una diagnosi equivocada en algun dels casos que les normes de Debian permeten excepcions, fes servir els fitxers <file><var>nom_paquet</var>.lintian-overrides</file> o <file>source/lintian-overrides</file> i així no avisarà de l'error. Consulta <file>/usr/share/doc/lintian/lintian.html/index.html</file> i ﻿procura no abusar d'aquesta opció per ocultar errors autèntics.
es: Si el programa <package>lintian</package> emite un informe de diagnóstico erróneo en algún caso en que las normas admitan excepciones, podrás utilizar los archivos <file><var>nombre_del_paquete</var>.lintian-overrides</file> o <file>source/lintian-overrides</file> para evitar que se emita el error. Por favor, lee <file>/usr/share/doc/lintian/lintian.html/index.html</file> error y procura no abusar de esta opción (para ocultar errores auténticos).
fr: Si <package>lintian</package> signale des erreurs dans son diagnostique alors que la Charte accepte des exceptions à certaines règles, vous pouvez utiliser <file><var>paquet</var>.lintian-overrides</file> ou <file>source/lintian-overrides</file> pour le rendre silencieux. Veuillez lire <file>/usr/share/doc/lintian/lintian.html/index.html</file> et vous abstenir d'en abuser.
it: Se il pacchetto <package>lintian</package> segnala degli errori di diagnostica in un caso in cui esista una policy che ammette delle eccezioni alle regole, si possono utilizzare i file <file><var>pacchetto</var>.lintian-overrides</file> o <file>source/lintian-overrides</file> per inibire le segnalazioni. Si legga <file>/usr/share/doc/lintian/lintian.html/index.html</file> e si eviti di farne un uso eccessivo.
ja: ポリシーが例外を認めているにも関わらず、<package>lintian</package>が間違った診断情報を報告してきた場合、<file><var>package</var>.lintian-overrides</file>か<file>source/lintian-overrides</file>を使って黙らせることができます。<file>/usr/share/doc/lintian/lintian.html/index.html</file>を読み、過度な使用は控えてください。
zh_cn: 如果 <package>lintian</package> 报告了一个 Debian Policy 允许的例外的错误诊断，你可以使用 <file><var>package</var>.lintian-overrides</file> 或 <file>source/lintian-overrides</file> 使其不再警告。请阅读 <file>/usr/share/doc/lintian/lintian.html/index.html</file> 并应严格避免滥用。
zh_tw: 如果 <package>lintian</package> 報告了一個 Debian Policy 允許的例外的錯誤診斷，你可以使用 <file><var>package</var>.lintian-overrides</file> 或 <file>source/lintian-overrides</file> 使其不再警告。請閱讀 <file>/usr/share/doc/lintian/lintian.html/index.html</file> 並應嚴格避免濫用。

source: <file><var>package</var>.lintian-overrides</file> is for the binary package named as <package><var>package</var></package> and is installed into <file>usr/share/lintian/overrides/<var>package</var></file> by the <prgn>dh_lintian</prgn> command.
ca: El fitxer <file><var>nom_paquet</var>.lintian-overrides</file> és per a un paquet binari amb el nom <package><var>nom_paquet</var></package> i s'instal·la a <file>usr/share/lintian/overrides/<var>nom_paquet</var></file> per l'ordre <prgn>dh_lintian</prgn>.
es: <file><var>nombre_del_paquete</var>.lintian-overrides</file> es para un paquete binario con el nombre <package><var>nombre_del_paquete</var></package> y es instalado en <file>usr/share/lintian/overrides/<var>nombre_del_paquete</var></file> por la orden <prgn>dh_lintian</prgn>.
fr: <file><var>paquet</var>.lintian-overrides</file> concerne le paquet binaire appelé <package><var>paquet</var></package>, il est installé en <file>usr/share/lintian/overrides/<var>paquet</var></file> par la commande <prgn>dh_lintian</prgn>.
it: Il file <file><var>pacchetto</var>.lintian-overrides</file> è ovviamente utilizzato per il pacchetto binario chiamato <package><var>pacchetto</var></package> ed è installato in <file>usr/share/lintian/overrides/<var>pacchetto</var></file> dal comando <prgn>dh_lintian</prgn>.
ja: <file><var>package</var>.lintian-overrides</file>は<package><var>package</var></package>と名づけられたパッケージのためのファイルで、<prgn>dh_lintian</prgn>コマンドによって<file>usr/share/lintian/overrides/<var>package</var></file>にインストールされます。
zh_cn: <file><var>package</var>.lintian-overrides</file> 是对于名为 <package><var>package</var></package> 有效的配置，会由 <prgn>dh_lintian</prgn> 命令安装到<file>usr/share/lintian/overrides/<var>package</var></file>
zh_tw: <file><var>package</var>.lintian-overrides</file> 是對於名爲 <package><var>package</var></package> 有效的設定，會由 <prgn>dh_lintian</prgn> 命令安裝到<file>usr/share/lintian/overrides/<var>package</var></file>

source: <file>source/lintian-overrides</file> is for the source package. This is not installed.
ca: El fitxer <file>source/lintian-overrides</file> és per als paquets de codi original i no s'instal·la.
es: El archivo <file>source/lintian-overrides</file> es para los paquetes de fuentes y no se instala.
fr: <file>source/lintian-overrides</file> concerne le paquet source. Il n'est pas installé.
it: Il file <file>source/lintian-overrides</file> è utilizzato per il pacchetto sorgente. Questo non viene installato.
ja: <file>source/lintian-overrides</file>はソースパッケージのためのファイルです。これはインストールされません。
zh_cn: <file>source/lintian-overrides</file> 是针对源代码包的，不会安装。
zh_tw: <file>source/lintian-overrides</file> 是針對原始碼包的，不會安裝。

source: <file>manpage.*</file> files
ca: Fitxers <file>manpage.*</file>.
es: Archivos <file>manpage.*</file>
fr: Fichiers <file>manpage.*</file>
it: I file <file>manpage.*</file>
ja: <file>manpage.*</file>ファイル
zh_cn: <file>manpage.*</file> 文件
zh_tw: <file>manpage.*</file> 檔案

source: Your program(s) should have a manual page. If they don't, you should create them. The <prgn>dh_make</prgn> command creates few template files for a manual page. These need to be copied and edited for each command without its manual page. Please make sure to remove unused templates.
ca: Cal que el programa tengui una pàgina de manual. Si l'autor original no l'ha fet, l'hauràs de fer tu. L'ordre <prgn>dh_make</prgn> construeix alguns fitxers de plantilla per a les pàgines de manual. Caldrà editar-los i emplenar-los. Comprova que elimines els fitxers que no fas servir.
es: El/los programa/s debería/n tener una página de manual. Tendrás que escribirla si no existe. La orden <prgn>dh_make</prgn> construye varios archivos de plantilla para las páginas de manual. Deberás copiarlos y editarlos para cada programa que no tenga página de manual. Asegúrate de eliminar los que no utilices.
fr: Le programme devrait être livré avec une page de manuel. Sinon, vous devriez en créer au moins une. La commande <prgn>dh_make</prgn> crée quelques modèles de fichiers pour page de manuel. Ils doivent être copiés et modifiés pour chaque commande sans page de manuel. Assurez-vous d'avoir effacé les modèles non utilisés.
ja: プログラムはマニュアルページが必ず必要ですもしなければ、作らなければなりません。<prgn>dh_make</prgn>コマンドはマニュアルページの雛形を作成します。マニュアルページがないコマンドのために、コピー、編集する必要があります。不要な雛形ファイルを削除するのを忘れないようにしてください。
zh_cn: 你的程序应该有 man 手册页，如果它们没有自带则需要由你来创建。<prgn>dh_make</prgn> 命令创建了几个 man 手册页的模板。它们需要被妥善地编辑，并且要删除未使用的模板。
zh_tw: 你的程式應該有 man 手冊頁，如果它們沒有自帶則需要由你來創建。<prgn>dh_make</prgn> 命令創建了幾個 man 手冊頁的模板。它們需要被妥善地編輯，並且要刪除未使用的模板。

source: <file>manpage.1.ex</file> file
ca: Fitxers <file>manpage.1.ex</file>
es: Archivo <file>manpage.1.ex</file>
fr: Fichier <file>manpage.1.ex</file>
it: Il file <file>manpage.1.ex</file>
ja: <file>manpage.1.ex</file> ファイル
zh_cn: <file>manpage.1.ex</file> 文件
zh_tw: <file>manpage.1.ex</file> 檔案

source: Manual pages are normally written in <manref section="1" name="nroff">. The <file>manpage.1.ex</file> template is written in <prgn>nroff</prgn>, too. See the <manref section="7" name="man"> manual page for a brief description of how to edit such a file.
ca: Las pàgines de manual s'escriuen normalment amb <manref section="1" name="nroff">. L'exemple <file>manpage.1.ex</file> està escrit amb <prgn>nroff</prgn>. Consulta la pàgina de manual <manref section="7" name="man"> on s'explica com editar el fitxer.
es: Las páginas de manual se escriben normalmente con <manref section="1" name="nroff">. La plantilla <file>manpage.1.ex</file> está escrita con<prgn>nroff</prgn>. Consulta la página de manual <manref section="7" name="man"> para una breve descripción sobre como editar el archivo.
fr: Les pages de manuel sont normalement écrites en <manref section="1" name="nroff">. L'exemple <tt>manpage.1.ex</tt> est aussi écrit en nroff. Lisez la page de manuel <manref section="7" name="man"> pour une description brève de la façon d'éditer ce genre de fichier.
it: Le pagine del manuale sono solitamente scritte per <manref section="1" name="nroff">. Anche il file modello <file>manpage.1.ex</file> è scritto per <prgn>nroff</prgn>. Si veda la pagina di manuale <manref section="7" name="man"> per una breve descrizione su come modificare un file del genere.
ja: マニュアルページは通常、<manref section="1" name="nroff">で書かれています。<file>manpage.1.ex</file>のテンプレートも<prgn>nroff</prgn>で書かれています。これらのファイルをどう編集するのかについて、簡単な説明が<manref section="7" name="man">にあります。
zh_cn: man 手册页通常是使用 <manref section="1" name="nroff"> 的格式编写的。<file>manpage.1.ex</file> 模板也是使用 <prgn>nroff</prgn> 格式的。参看 <manref section="7" name="man"> 手册页来简要了解如何编辑这个文件。
zh_tw: man 手冊頁通常是使用 <manref section="1" name="nroff"> 的格式編寫的。<file>manpage.1.ex</file> 模板也是使用 <prgn>nroff</prgn> 格式的。參考 <manref section="7" name="man"> 手冊頁來簡要瞭解如何編輯這個檔案。

source: The final manual page file name should include the name of the program it is documenting, so we will rename it from "<tt>manpage</tt>" to "<tt>gentoo</tt>". The file name also includes "<tt>.1</tt>" as the first suffix, which means it's a manual page for a user command. Be sure to verify that this section is indeed the correct one. Here's a short list of manual page sections:
ca: El nom del fitxer de manual ha d'incloure el nom del programa corresponent: així canviaràs el nom de "<tt>manpage</tt>" a "<tt>gentoo</tt>". El nom del fitxer inclou "<tt>.1</tt>" com a sufixe: aquest és el codi que indica que la pàgina de manual correspon a un programa d'usuari. Comprova que és la secció correcta. Aquí tens una petita llista de les seccions de les pàgines de manual.
es: El nombre del archivo de manual debería incluir el nombre del programa que está documentando, así que lo renombraremos de "<tt>manpage</tt>" a "<tt>gentoo</tt>". El nombre del fichero incluye también "<tt>.1</tt>" como primer sufijo, lo que significa que es una página de manual para una programa de usuario. Asegúrate de verificar que esa sección es la correcta. Aquí tienes una pequeña lista de las secciones de las páginas de manual.
fr: Le nom de fichier de la page de manuel devrait inclure le nom du programme qu'elle documente, donc « <tt>manpage</tt> » doit être renommé en « <tt>gentoo</tt> ». Le nom de fichier inclut aussi « <tt>.1</tt> » comme premier suffixe, qui signifie que c'est une page de manuel pour une commande utilisateur. Assurez-vous de vérifier que cette section est effectivement la bonne. Voici une courte liste des sections de pages de manuel :
it: L'ultimo file delle pagine del manuale dovrebbe includere il nome del programma che si sta documentando, quindi verrà rinominato da "<tt>manpage</tt>" a "<tt>gentoo</tt>". Il nome del file include anche "<tt>.1</tt>" come primo suffisso, il che sta ad indicare che la sezione della pagina del manuale è relativa ad un comando dell'utente. Si verifichi che questa sezione sia quella corretta. Qui di seguito viene presentata una breve lista delle sezioni delle pagine del manuale:
ja: 最終的なマニュアルページのファイル名は、解説されているプログラム名を含めなければなりません。ここでは、ファイル名を"<tt>manpage</tt>"から"<tt>gentoo</tt>"に変更しましょう。ファイル名は、"<tt>.1</tt>"というサフェックスも含みます。これは、このマニュアルページはユーザーコマンドのものだ、という意味です。この部分を間違わないように気をつけてください。以下はマニュアルページのリストです:
zh_cn: 最终的 man 手册页文件名应当包含它所描述的程序名，所以我们把它从 <tt>manpage</tt> 改名为 <tt>gentoo</tt>；文件名还应以类似 <tt>.1</tt> 的数字结尾作为后缀，<tt>.1</tt> 代表它是一个用户命令的 man 手册页。请确认这个章节号是否使用正确。以下是一个 man 手册 章节简表：:
zh_tw: 最終的 man 手冊頁檔案名應當包含它所描述的程式名，所以我們把它從 <tt>manpage</tt> 改名爲 <tt>gentoo</tt>；檔案名還應以類似 <tt>.1</tt> 的數字結尾作爲後綴，<tt>.1</tt> 代表它是一個用戶命令的 man 手冊頁。請確認這個章節號是否使用正確。以下是一個 man 手冊 章節簡表：:

source: Section | Description | Notes 1 User commands Executable commands or scripts. 2 System calls Functions provided by the kernel. 3 Library calls Functions within system libraries. 4 Special files Usually found in /dev 5 File formats E.g. /etc/passwd's format 6 Games Or other frivolous programs 7 Macro packages Such as man macros. 8 System administration Programs typically only run by root. 9 Kernel routines Non-standard calls and internals.
ca: Secció | Descripció | Notes 1 Ordres d'usuari Programes o guions executables. 2 Crides al Sistema Funcions que ofereix el nucli. 3 Crides a Biblioteques Funcions de les biblioteques del sistema. 4 Fitxers especials Generalment els fitxers de /dev. 5 Formats d'arxiu P. ex. el format de /etc/passwd. 6 Jocs Jocs i programes d'entreteniment. 7 Paquets de macros Com és el cas de les macros de man. 8 Administració del Sist. Programes que executa «root». 9 Rutines del nucli Crides al sistema no estàndar.
es: Sección | Descripción | Notas 1 Órdenes de Usuario Programas o guiones ejecutables. 2 Llamadas al Sistema Funciones que ofrece el núcleo. 3 Llamadas a Bibliotecas Funciones dadas por las bibliotecas del sistema. 4 Ficheros Especiales Generalmente se encuentran en /dev. 5 Formatos de Fichero Por ejemplo, el formato del /etc/passwd. 6 Juegos U otros programas frívolos. 7 Paquetes de Macros Como las macros de man. 8 Administración del Sist. Programas que sólo suele ejecutar el superusuario. 9 Rutinas del Núcleo Llamadas al sistema no estándar.
fr: Section | Description | Notes 1 Commandes utilisateur Commandes ou scripts exécutables. 2 Appels système Fonctions fournies par le noyau. 3 Appels bibliothèque Fonctions des bibliothèques système. 4 Fichiers spéciaux D'ordinaire trouvés dans /dev. 5 Formats de fichiers Par ex. le format /etc/password. 6 Jeux Ou d'autres programmes frivoles. 7 Paquets de macros Comme les macros de man. 8 Administration système Programmes normalement exécutés par root. 9 Routines noyau Appels non standards et routines internes.
zh_cn: 章节 | 描述 | 注释 1 用户命令 可执行命令或脚本。 2 系统调用 内核提供的函数。 3 函数库调用 系统库提供的函数。 4 特殊文件 常见于 /dev 5 文件格式 例如 /etc/passwd 的格式。 6 游戏 游戏或其他无足轻重的程序。 7 宏包 例如 man 宏。 8 系统管理 典型由 root 运行的程序。 9 内核函数 非标准调用和内部控制结构。
zh_tw: 章節 | 描述 | 註釋 1 用戶命令 可執行命令或腳本。 2 系統調用 內核提供的函數。 3 函數庫調用 系統庫提供的函數。 4 特殊檔案 常見於 /dev 5 檔案格式 例如 /etc/passwd 的格式。 6 遊戲 遊戲或其他無足輕重的程式。 7 宏包 例如 man 宏。 8 系統管理 典型由 root 運行的程式。 9 內核函數 非標準調用和內部控制結構。

source: So <package>gentoo</package>'s man page should be called <file>gentoo.1</file>. If there was no <file>gentoo.1</file> man page in the original source, you should create it by renaming the <file>manpage.1.ex</file> template to <file>gentoo.1</file> and edit it by using information from the example and from upstream docs.
ca: En el cas del <package>gentoo</package>, el nom del fitxer serà <file>gentoo.1</file>. Com què no hi havia una pàgina de manual en els fitxers de fonts de <file>gentoo.1</file>, en vaig escriure una canviant el nom de la plantilla <file>manpage.1.ex</file> per <file>gentoo.1</file> i editant-la fent servir la informació de l'exemple i la documentació del programador original.
es: Así que la página de manual de <package>gentoo</package> debería nombrarse como <file>gentoo.1</file>. No había una página de manual <file>gentoo.1</file> en el paquete fuente así que la escribí renombrando la plantilla <file>manpage.1.ex</file> como <file>gentoo.1</file> y modifiandola usando la información del ejemplo y de los documentos del programador original.
fr: Ainsi, la page de manuel de <package>gentoo</package> devrait être appelée <file>gentoo.1</file>. S'il n'y avait pas de page de manuel <file>gentoo.1</file> dans les sources originales, il aurait fallu renommer le modèle <file>manpage.1.ex</file> en <file>gentoo.1</file> puis le modifier à partir des informations de l'exemple et de la documentation amont.
it: Così la pagina man del pacchetto <package>gentoo</package> dovrebbe chiamarsi <file>gentoo.1</file>. Se non ci fosse alcuna pagina man <file>gentoo.1</file> nei sorgenti originali, andrebbe creata rinominando il modello <file>manpage.1.ex</file> in <file>gentoo.1</file> e modificandolo utilizzando le informazioni contenute negli esempi e nei documenti originali.
ja: つまり、<package>gentoo</package>のmanページは<file>gentoo.1</file>となります。オリジナルのソースファイルに<file>gentoo.1</file>というmanページがなければ、上流のドキュメントと例を元にして、<file>manpage.1.ex</file>という雛形ファイルを編集し<file>gentoo.1</file>というmanページを作らなければなりません。
zh_cn: 所以 <package>gentoo</package> 的 man 手册页应叫 <file>gentoo.1</file>。如果原始代码中没有 <file>gentoo.1</file> man 手册页，你需要重命名 <file>manpage.1.ex</file> 模板为 <file>gentoo.1</file> 并按照示例和上游文档编辑它。
zh_tw: 所以 <package>gentoo</package> 的 man 手冊頁應叫 <file>gentoo.1</file>。如果原始程式碼中沒有 <file>gentoo.1</file> man 手冊頁，你需要重命名 <file>manpage.1.ex</file> 模板爲 <file>gentoo.1</file> 並按照範例和上游文件編輯它。

source: You can use the <prgn>help2man</prgn> command to generate a man page out of "<tt>--help</tt>" and "<tt>--version</tt>" output of each program, too. <footnote><p>If the command is missing <prgn>info</prgn> page but have documentation files in the <file>/usr/share/<var>package</var></file> directory, you should manually edit generated the man page created by the <prgn>help2man</prgn> command. </p></footnote>
ca: Fes servir l'ordre <prgn>help2man</prgn> per generar la pàgina de manual fent servir la informació aportada per les opcions «<tt>--help</tt>» i "«<tt>--version</tt>» de cada programa <footnote><p>Si el programa no té una pàgina <prgn>info</prgn> però si fitxers de documentació en el directori <file>/usr/share/<var>nom_paquet</var></file>, pots editar manualment la pàgina de manual ﻿construïda per <prgn>help2man</prgn>. </p></footnote>.
es: Utiliza la orden <prgn>help2man</prgn> para generar la página de manual a partir de la información dada por «<tt>--help</tt>» and "«<tt>--version</tt>» para cada programa <footnote><p>Si el programa no tiene página <prgn>info</prgn> pero contiene archivos de documentación en el directorio <file>/usr/share/<var>nombre_del_paquete</var></file>, deberás editar manualmente la página de manual construida por <prgn>help2man</prgn>. </p></footnote>.
fr: La commande <prgn>help2man</prgn> peut aussi être utilisée pour créer une page de manuel à partir de la sortie de « <tt>--help</tt> » et « <tt>--version</tt> » pour chaque programme. <footnote><p>Si la commande n'a pas non plus de page <prgn>info</prgn>, mais possède des fichiers de documentation dans le répertoire <file>/usr/share/<var>paquet</var></file>, vous devriez modifier manuellement la page créée par la commande <prgn>help2man</prgn>. </p></footnote>
ja: "<tt>--help</tt>"と"<tt>--version</tt>"から<prgn>help2man</prgn>コマンドを用いてmanページを作成することも可能です。 <footnote><file>/usr/share/<var>package</var></file>ディレクトリにドキュメントがあるにも関わらず、<p>コマンドが<prgn>info</prgn>ページを見つけられない場合は、<prgn>help2man</prgn>コマンドで生成されたページを直接編集します。</p></footnote>
zh_cn: 你也可以使用 <prgn>help2man</prgn> 命令来通过程序的 <tt>--help</tt> 和 <tt>--version</tt> 参数的输出创建 man 手册页。<footnote><p>如果命令没有 <prgn>info</prgn> 信息页但在 <file>/usr/share/<var>package</var></file> 目录中有其他文档，你应该手工编辑 <prgn>help2man</prgn> 命令所创建的 man 手册页。</p></footnote>
zh_tw: 你也可以使用 <prgn>help2man</prgn> 命令來通過程式的 <tt>--help</tt> 和 <tt>--version</tt> 參數的輸出創建 man 手冊頁。<footnote><p>如果命令沒有 <prgn>info</prgn> 訊息頁但在 <file>/usr/share/<var>package</var></file> 目錄中有其他文件，你應該手工編輯 <prgn>help2man</prgn> 命令所創建的 man 手冊頁。</p></footnote>

source: <file>manpage.sgml.ex</file> file
ca: Fitxer <file>manpage.sgml.ex</file>.
es: Archivo <file>manpage.sgml.ex</file>
fr: Fichier <file>manpage.sgml.ex</file>
it: Il file <file>manpage.sgml.ex</file>
ja: <file>manpage.sgml.ex</file> ファイル
zh_cn: <file>manpage.sgml.ex</file> 文件
zh_tw: <file>manpage.sgml.ex</file> 檔案

source: If on the other hand you prefer writing SGML instead of <prgn>nroff</prgn>, you can use the <file>manpage.sgml.ex</file> template. If you do this, you have to:
ca: Si prefereixes fer servir el format SGML en lloc de <prgn>nroff</prgn> pots fer servir la plantilla <file>manpage.sgml.ex</file>. En aquest cas hauràs de fer el següent:
es: Por otro lado, puede que prefieras escribir usando SGML en lugar de <prgn>nroff</prgn>. En este caso, puedes usar la plantilla <file>manpage.sgml.ex</file>. Si haces esto, tendrás que:
fr: D'un autre côté, si vous préférez écrire du SGML plutôt que du nroff, vous pouvez utiliser le modèle <tt>manpage.sgml.ex</tt>. Si vous le faites, vous devez :
it: Se d'altra parte si preferisce scrivere in SGML piuttosto che utilizzare <prgn>nroff</prgn>, si può utilizzare il modello <file>manpage.sgml.ex</file> . Se si procede in questo modo andrà:
ja: もし、<prgn>nroff</prgn>よりSGMLのほうが好みであれば、<tt>manpage.sgml.ex</tt> のほうをひな型として使うことも できます。こちらの場合には、以下の手順が必要です。
zh_cn: 如果你希望使用 SGML 而非 <prgn>nroff</prgn> 格式编写 man 手册页，可以使用 <file>manpage.sgml.ex</file> 模板。如果你要这样，需要进行以下步骤：
zh_tw: 如果你希望使用 SGML 而非 <prgn>nroff</prgn> 格式編寫 man 手冊頁，可以使用 <file>manpage.sgml.ex</file> 模板。如果你要這樣，需要進行以下步驟：

source: rename the file to something like <file>gentoo.sgml</file>.
ca: reanomenar el fitxer com <file>gentoo.sgml</file>.
es: renombrar el fichero a algo como <file>gentoo.sgml</file>.
fr: renommer le fichier en quelque chose comme <tt>gentoo.sgml</tt> ;
it: rinominato il file in qualcosa del tipo <file>gentoo.sgml</file>
ja: ファイル名を<file>gentoo.sgml</file>のような名前に変更します。
zh_cn: 重命名文件为类似 <file>gentoo.sgml</file> 的名称。
zh_tw: 重命名檔案爲類似 <file>gentoo.sgml</file> 的名稱。

source: install the <package>docbook-to-man</package> package
ca: instal·lar el paquet <package>docbook-to-man</package>
es: instalar el paquete <package>docbook-to-man</package>
fr: installer le paquet <package>docbook-to-man</package> ;
it: installato il pacchetto <package>docbook-to-man</package>
ja: <package>docbook-to-man</package> パッケージのインストール
zh_cn: 安装 <package>docbook-to-man</package> 软件包。
zh_tw: 安裝 <package>docbook-to-man</package> 套件。

source: add <tt>docbook-to-man</tt> to the <tt>Build-Depends</tt> line in the <file>control</file> file
ca: afegir <tt>docbook-to-man</tt> a la línia de <tt>Build-Depends</tt> a l'arxiu <tt>control</tt>
es: añadir <tt>docbook-to-man</tt> a la línea de <tt>Build-Depends</tt> en el fichero <tt>control</tt>
fr: ajouter <tt>docbook-to-man</tt> à la ligne <tt>Build-Depends</tt> dans le fichier <tt>control</tt> ;
it: aggiunto <tt>docbook-to-man</tt> alla linea <tt>Build-Depends</tt> nel file <file>control</file>
ja: <tt>control</tt> ファイルの <tt>Build-Depends</tt> 行へ <tt>docbook-to-man</tt> を追加
zh_cn: 在 <file>control</file> 文件的 <tt>Build-Depends</tt> 中添加 <package>docbook-to-man</package> 软件包。
zh_tw: 在 <file>control</file> 檔案的 <tt>Build-Depends</tt> 中添加 <package>docbook-to-man</package> 套件。

source: add a <tt>override_dh_auto_build</tt> target to your <file>rules</file> file:
ca: afegir l'objectiu <tt>override_dh_auto_build</tt> en el fitxer <file>rules</file> com a l'exemple:
es: añadir el objetivo <tt>override_dh_auto_build</tt> en el fichero <file>rules</file> de la siguiente forma:
fr: ajouter une cible <tt>override_dh_auto_build</tt> au fichier <file>rules</file> :
it: aggiungere un obiettivo <tt>override_dh_auto_build</tt> al file <file>rules</file> :
ja: <tt>rules</tt>ファイルに<tt>override_dh_auto_build</tt>ターゲットを追加
zh_cn: 在 <file>rules</file> 文件里添加 <tt>override_dh_auto_build</tt> target：
zh_tw: 在 <file>rules</file> 檔案裏添加 <tt>override_dh_auto_build</tt> target：

source: <file>manpage.xml.ex</file> file
ca: Fitxer <file>manpage.xml.ex</file>.
es: Archivo <file>manpage.xml.ex</file>
fr: Fichier <file>manpage.xml.ex</file>
it: Il file <file>manpage.xml.ex</file>
ja: <file>manpage.xml.ex</file> ファイル
zh_cn: <file>manpage.xml.ex</file> 文件
zh_tw: <file>manpage.xml.ex</file> 檔案
