Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: All <em>maintainer scripts</em>, i.e., <file>preinst</file>, <file>prerm</file>, <file>postinst</file>, and <file>postrm</file> files, are non-trivial unless they are auto-generated by the <package>debhelper</package> programs. So do not use them if you are a novice maintainer (see <ref id="maintscripts">).
ca: Ja s'ha comentat que els <em>guions d'instal·lació</em> (els fitxers <file>preinst</file>, <file>prerm</file>, <file>postinst</file> i <file>postrm</file>) són complicats, excepte si s'utilitzen els generats per el paquet <package>debhelper</package>. No es recomana la seva utilització als desenvolupadors principiants (consulta <ref id="maintscripts">).
es: Ya se ha comentado que los <em>guiones del desarrollador</em> (los archivos <file>preinst</file>, <file>prerm</file>, <file>postinst</file> y <file>postrm</file>) son complicados, excepto si se utilizan los generados por el paquete <package>debhelper</package>. No se recomienda su utilización a los desarrolladores principiantes (véase <ref id="maintscripts">).
fr: Tous les <em>scripts du responsable</em>, c'est-à-dire les fichiers <file>preinst</file>, <file>prerm</file>, <file>postinst</file> et <file>postrm</file> files, ne sont pas triviaux, à moins qu'ils n'aient été générés automatiquement par les programmes <package>debhelper</package>. Ne les utilisez donc pas si vous êtes un responsable débutant, cf. <ref id="maintscripts">.
it: Tutti gli <em>script del manutentore</em>, ad esempio, <file>preinst</file>, <file>prerm</file>, <file>postinst</file>, e <file>postrm</file>, non sono di poco conto a meno che non siano stati generati automaticamente dai programmi di <package>debhelper</package>. Si consiglia pertanto di non utilizzarli se non si ha sufficiente esperienza come manutentore (si veda <ref id="maintscripts">).
ja: <file>preinst</file> や <file>prerm</file> や <file>postinst</file>や <file>postrm</file> ファイルという、全ての<em>メンテナスクリプト</em>は、<package>debhelper</package> プログラムによって自動生成されたものでも無い限り簡単ではありません。新米メンテナならこれらを使うのは止めましょう (<ref id="maintscripts">参照)。
zh_cn: 所有 <em>maintainer scripts</em>，包括 <file>preinst</file>、<file>prerm</file>、<file>postinst</file> 和 <file>postrm</file> 文件，除非是由 <package>debhelper</package> 程序自动生成的，都是测试的重点。如果你是新维护人员则不要使用它们(参看 <ref id="maintscripts">)。
zh_tw: 所有 <em>maintainer scripts</em>，包括 <file>preinst</file>、<file>prerm</file>、<file>postinst</file> 和 <file>postrm</file> 檔案，除非是由 <package>debhelper</package> 程式自動生成的，都是測試的重點。如果你是新維護人員則不要使用它們(參考 <ref id="maintscripts">)。

source: If the package makes use of these non-trivial <em>maintainer scripts</em>, be sure to test not only for install but also for remove, purge, and upgrade. Many <em>maintainer script</em> bugs show up when packages are removed or purged. Use the <prgn>dpkg</prgn> command as follows to test them.
ca: Si el paquet utilitza <em>guions del desenvolupador</em>modificats, has de comprovar el seu funcionament en la instal·lació, desinstal·lació, eliminació i actualització. Alguns dels problemes en aquests guions només es detecten en l'eliminació o desinstal·lació. Fes servir l'ordre <prgn>dpkg</prgn> per fer la comprovació:
es: Si el paquete utiliza estos <em>guiones del desarrollador</em> modificados o no triviales, debes comprobar su funcionamiento en la instalación, desinstalación, eliminación y actualización. Algunos errores en estos <em>guiones del desarrollador</em> sólo se producen cuando los paquetes se eliminan o purgan. Utiliza la orden <prgn>dpkg</prgn> como se indica a continuación para probarlos:
fr: Si le paquet utilise des <em>scripts du responsable</em> non triviaux, veuillez les essayer non seulement pour l'installation, mais aussi la suppression, la purge et la mise à niveau. De nombreux bogues dans les <em>scripts du responsable</em> surviennent lors de la suppression et de la purge. Utilisez la commande <prgn>dpkg</prgn> comme ceci pour les essayer :
it: Se il pacchetto utilizza questi particolari <em>script del manutentore</em>, ci si assicuri di effettuare delle prove non solo per l'operazione di install, ma anche per il remove, purge, e l'upgrade. Molti bu degli <em>script del manutentore</em> vengono fuori quando i pacchetti sono rimossi o viene applicato il purge. Si utilizzi il comando <prgn>dpkg</prgn> nel seguente modo per testarli.
ja: パッケージがこういった簡単ではない<em>メンテナスクリプト</em>を使う場合は、インストールだけではなく、削除や完全削除やアップグレードもテストしましょう。多くの<em>メンテナスクリプト</em>バグはパッケージが削除されたり完全削除される際に発現します。以下のように<prgn>dpkg</prgn> コマンドを使いこれらを確認しましょう。
zh_cn: 如果软件包使用了这些需要严格测试的 <em>maintainer scripts</em>，请确保不仅测试 install，还要测试 remove、purge 和 upgrade。很多 <em>maintainer scripts</em> 的 Bug 都显现于卸载或彻底删除软件包时。使用 <prgn>dpkg</prgn> 命令来测试它们。
zh_tw: 如果套件使用了這些需要嚴格測試的 <em>maintainer scripts</em>，請確保不僅測試 install，還要測試 remove、purge 和 upgrade。很多 <em>maintainer scripts</em> 的 Bug 都顯現於反安裝或徹底刪除套件時。使用 <prgn>dpkg</prgn> 命令來測試它們。

source: $ sudo dpkg -r gentoo $ sudo dpkg -P gentoo $ sudo dpkg -i gentoo_<var>version</var>-<var>revision</var>_<var>i386</var>.deb
ca: $ sudo dpkg -r gentoo $ sudo dpkg -P gentoo $ sudo dpkg -i gentoo_<var>versió</var>-<var>revisió</var>_<var>i386</var>.deb
es: $ sudo dpkg -r gentoo $ sudo dpkg -P gentoo $ sudo dpkg -i gentoo_<var>versión</var>-<var>revisión</var>_<var>i386</var>.deb

source: This should be done with sequences such as the following.
ca: Segueix aquesta seqüència per a la comprovació:
es: Sigue esta secuencia para la comprobación:
fr: Les séquences suivantes devraient être essayées :
it: Questa operazione si dovrebbe effettuare con delle sequenze di questo tipo.
ja: 以下のような手順でこれは実施するべきです。
zh_cn: 整个测试过程应按照以下序列操作：
zh_tw: 整個測試過程應按照以下序列操作：

source: install the previous version (if needed).
ca: Instal·la la versió anterior del paquet (obligatori).
es: Instala la versión anterior del paquete (requerido).
fr: installation de la version précédente (si elle existe) ;
it: installazione della versione precedente (se necessaria).
ja: (可能な場合は)前回バージョンをインストール
zh_cn: 如果可能，安装前一个版本的软件包；
zh_tw: 如果可能，安裝前一個版本的套件；

source: upgrade it from the previous version.
ca: Actualitza ara a la versió actual.
es: Actualiza ahora a la versión actual.
fr: mise à niveau depuis la version précédente ;
it: aggiornamento dalla versione precedente.
ja: 旧バージョンからアップグレードします。
zh_cn: 从前一个版本升级软件包；
zh_tw: 從前一個版本升級套件；

source: downgrade it back to the previous version (optional).
ca: Torna a la versió anterior (opcional).
es: Vuelve a la versión anterior (opcional).
fr: dégradation (« downgrade ») à la version précédente (optionnel) ;
it: ritorno alla versione precedente (opzionale).
ja: 旧バージョンになるよう、ダウングレードします (オプション)。
zh_cn: 降级软件包到前一个版本(可选)；
zh_tw: 降級套件到前一個版本(可選)；

source: purge it.
ca: Desinstal·la el paquet.
es: Elimínalo.
fr: purge ;
it: applicazione del purge.
ja: 完全削除します。
zh_cn: 彻底删除该软件包；
zh_tw: 徹底刪除該套件；

source: install the new package.
ca: Instal·la la nova versió del paquet.
es: Instala la nueva versión del paquete.
fr: installation du nouveau paquet ;
it: installazione del nuovo pacchetto.
ja: 新パッケージとしてインストールします。
zh_cn: 全新安装该软件包；
zh_tw: 全新安裝該套件；

source: remove it.
ca: Elimina'l.
es: Elimínalo.
fr: suppression (« remove ») du paquet.
it: rimozione del pacchetto.
ja: 削除します。
zh_cn: 卸载该软件包；
zh_tw: 反安裝該套件；

source: install it again.
ca: Instal·la'l de nou.
es: Instálalo de nuevo.
fr: installation du paquet, encore.
it: reinstallazione del pacchetto.
ja: もう一度インストールします。
zh_cn: 再次安装该软件包。
zh_tw: 再次安裝該套件。

source: If this is your first package, you should create dummy packages with different versions to test your package in advance to prevent future problems.
ca: Si treballes en la construcció de la primera versió del paquet, construeix versions «fantasma» anteriors (és suficient canviar el número de versió) per realitzar les proves i prevenir problemes.
es: Si estás trabajando en la construcción de la primera versión del paquete, construye versiones «fantasma» anteriores (será suficiente cambiar el número de la versión) para realizar las pruebas y así prevenir problemas.
fr: Pour votre premier paquet, vous devriez créer des paquets factices avec différentes versions pour essayer votre paquet à l'avance et éviter des problèmes par la suite.
it: Se si sta creando il primo pacchetto, andrebbero creati dei pacchetti fittizi con diversi numeri di versione per testare il pacchetto originale in anticipo e prevenire problemi futuri.
ja: もしこれがあなたの最初のパッケージなら、あなたのパッケージを将来問題が起こらないように事前にテストするための異なるバージョンのダーミーパッケージを作るべきです。
zh_cn: 如果这是你的第一个软件包，你应该使用其他版本号创建一个测试用的软件包来完成升级测试，这样可以避免将来的问题。
zh_tw: 如果這是你的第一個套件，你應該使用其他版本號創建一個測試用的套件來完成升級測試，這樣可以避免將來的問題。

source: Bear in mind that if your package has previously been released in Debian, people will often be upgrading to your package from the version that was in the last Debian release. Remember to test upgrades from that version too.
ca: Recorda que si hi ha versions anteriors del paquet en el repositori Debian, els usuaris actualitzaran el paquet des de la versió anterior disponible (i aquesta versió pot ésser distinta en la versió estable i de proves). Realitza les comprovacions també amb aquestes versions.
es: Recuerda que si ya hay versiones anteriores del paquete en el repositorio Debian, los usuarios actualizarán el paquete desde la versión anterior disponible (y esta versión puede ser distinta en la versión estable y de pruebas). Realiza las comprobaciones también con estas versiones.
fr: Gardez à l'esprit que si votre paquet a déjà été publié avec Debian, des gens vont mettre à jour ce paquet à partir de la version qui était dans la publication Debian précédente. Souvenez-vous d'essayer aussi les mises à jour à partir de cette version.
it: Si tenga in mente che se il pacchetto è stato già rilasciato in Debian, le persone spesso effettueranno un aggiorneranno a quest'ultimo a partire dall'ultima versione disponibile su Debian. Si ricordi di testare gli aggiornamenti anche a partire da questa versione.
ja: もしあなたのパッケージが過去にリリースされたバージョンの Debian に含まれていた場合には、多くの人々が Debian の最新の リリース版に含まれていたバージョンのパッケージから アップグレードしてくるだろうということを覚えておいてください。 そして、そのバージョンからもきちんとアップグレードできることを 忘れずに上記の手順で確認しておいてください。
zh_cn: 请牢记如果你的软件包已经在以往版本的 Debian 中发布，人们通常会从最近发布的 Debian 发布里的版本升级，所以也要测试从那个版本升级到当前的版本。
zh_tw: 請牢記如果你的套件已經在以往版本的 Debian 中發佈，人們通常會從最近發佈的 Debian 發布里的版本升級，所以也要測試從那個版本升級到當前的版本。

source: Although downgrade is not officially supported, it should be nice to support it.
ca: Encara que no es garanteix la reinstal·lació d'una versió anterior, és preferible assegurar-se que és possible fer-ho sense generar problemes.
es: Aunque no se garantiza la reinstalación de una versión anterior, es preferible asegurarse que es posible sin generar problemas.
fr: Même si la dégradation n'est pas officiellement gérée, il est préférable de la permettre.
it: Anche se il ritorno ad una versione precedente non è supportato ufficialmente, sarebbe buona abitudine che lo fosse.
ja: ダウングレードは正式にはサポートされていないとは言え、それがサポートされるのは良い事です。
zh_cn: 尽管降级没有被正式支持，支持它也总是不错的。
zh_tw: 儘管降級沒有被正式支持，支持它也總是不錯的。

source: <package>lintian</package> package
ca: El paquet <package>lintian</package>.
es: El paquete <package>lintian</package>
fr: Paquet lintian
it: Il pacchetto <package>lintian</package>
ja: <package>lintian</package> パッケージ
zh_cn: <package>lintian</package> 软件包
zh_tw: <package>lintian</package> 套件

source: Run <manref section="1" name="lintian"> on your <file>.changes</file> file. The <prgn>lintian</prgn> command runs many test scripts to check for many common packaging errors. <footnote><p>You do not need to provide the <prgn>lintian</prgn> option "<tt>-i -I --show-overrides</tt>" if you customized <file>/etc/devscripts.conf</file> or <file>~/.devscripts</file> as described in <ref id="debuild">. </p></footnote>
ca: Executa <manref section="1" name="lintian"> amb el teu arxiu de canvis <file>.changes</file>. L'ordre <prgn>lintian</prgn> executa diversos guions de comprovació del paquet per localitzar els errors més freqüents <footnote><p>No és necessari afegir a <prgn>lintian</prgn> l'opció "<tt>-i -I --show-overrides</tt>" si l'has inclòs en la configuració a <file>/etc/devscripts.conf</file> o <file>~/.devscripts</file> com s'ha explicat a <ref id="debuild">. </p></footnote>.
es: Ejecuta <manref section="1" name="lintian"> sobre tu fichero de cambios <file>.changes</file>. La orden <prgn>lintian</prgn> ejecuta varios guiones de comprobación del paquete para localizar los errores más frecuentes <footnote><p>No es necesario añadir la opción "<tt>-i -I --show-overrides</tt>" si la has incluido en la configuración en <file>/etc/devscripts.conf</file> o <file>~/.devscripts</file> según se explicó en <ref id="debuild">. </p></footnote> .
fr: Exécutez <manref section="1" name="lintian"> sur le fichier <file>.changes</file>. La commande <prgn>lintian</prgn> exécute de nombreux scripts de tests pour vérifier la plupart des erreurs habituelles d'empaquetage. <footnote><p>Il n'est pas nécessaire d'ajouter le paramètre « <tt>-i -I --show-overrides</tt> » à <prgn>lintian</prgn> si vous avez personnalisé <file>/etc/devscripts.conf</file> ou <file>~/.devscripts</file> comme décrit en <ref id="debuild">. </p></footnote>
it: Si esegua <manref section="1" name="lintian"> sul file <file>.changes</file>. Il comando <prgn>lintian</prgn> esegue molti script di test alla ricerca dei più comuni errori di pacchettizzazione. <footnote><p>Non c'è bisogno di fornire l'opzione <prgn>lintian</prgn> "<tt>-i -I --show-overrides</tt>" se si è personalizzato il file <file>/etc/devscripts.conf</file> o il file <file>~/.devscripts</file> come descritto in <ref id="debuild">. </p></footnote>
ja: あなたの <file>.changes</file> ファイルに <manref section="1" name="lintian"> を実行します。<prgn>lintian</prgn> コマンドはパッケージ作成上の典型的エラーをチェックする多くのテストスクリプトを実行します。<footnote><p><ref id="debuild">に記述されたように <file>/etc/devscripts.conf</file> や <file>~/.devscripts</file> をカスタマイズしていれば 、"<tt>-i -I --show-overrides</tt>" を<prgn>lintian</prgn> オプションとし与える必要はありません。</p></footnote>
zh_cn: 使用 <manref section="1" name="lintian"> 检查你的 <file>.changes</file> 文件。<prgn>lintian</prgn> 命令会运行很多测试脚本来检查常见的打包错误。<footnote><p>如果你按照 <ref id="debuild"> 中的叙述定义了 <file>/etc/devscripts.conf</file> 或 <file>~/.devscripts</file> 文件，就不需要再添加 <prgn>lintian</prgn> 选项 <tt>-i -I --show-overrides</tt>。</p></footnote>
zh_tw: 使用 <manref section="1" name="lintian"> 檢查你的 <file>.changes</file> 檔案。<prgn>lintian</prgn> 命令會運行很多測試腳本來檢查常見的打包錯誤。<footnote><p>如果你按照 <ref id="debuild"> 中的敘述定義了 <file>/etc/devscripts.conf</file> 或 <file>~/.devscripts</file> 檔案，就不需要再添加 <prgn>lintian</prgn> 選項 <tt>-i -I --show-overrides</tt>。</p></footnote>

source: Of course, replace the filename with the name of the <file>.changes</file> file generated for your package. The output of the <prgn>lintian</prgn> command are marked as follows.
ca: Per suposat, canvia el nom de l'arxiu pel nom de l'arxiu <file>.changes</file> del teu paquet. Els missatges d'error de <prgn>lintian</prgn> es codifiquen amb una lletra inicial en la línia del missatge:
es: Por supuesto, cambia el nombre del fichero por el nombre del fichero <file>.changes</file> generado por tu paquete. Los mensajes de error de <prgn>lintian</prgn> se codifican con una letra al inicio de la línea del mensaje:
fr: Bien sûr, remplacez le nom de fichier par celui du fichier <file>.changes</file> créé pour votre paquet. La sortie de la commande <prgn>lintian</prgn> est marquée ainsi :
it: Ovviamente va rimpiazzato il nome con quello del file <file>.changes</file> generato per il pacchetto. I risultati del comando <prgn>lintian</prgn> vengono qui elencati di seguito.
ja: もちろん、あなたのパッケージにより作成される <file>.changes</file> ファイルの名前をこれと置き換えます。<prgn>lintian</prgn> コマンドの出力は以下のようにマークされています。
zh_cn: 当然，要使用你自己软件包所生成的 <file>.changes</file> 文件的文件名。<prgn>lintian</prgn> 命令的输出常带有以下几种标记：
zh_tw: 當然，要使用你自己套件所生成的 <file>.changes</file> 檔案的檔案名。<prgn>lintian</prgn> 命令的輸出常帶有以下幾種標記：

source: <tt>E:</tt> for error; a sure policy violation or a packaging error.
ca: <tt>E:</tt> error; per indicar violacions de les normes o un error en el paquet.
es: <tt>E:</tt> para los errores; indica violaciones de las normas o un error en el paquete.
fr: <tt>E:</tt> pour erreur ; une violation certaine de la Charte ou erreur d'empaquetage ;
it: <tt>E:</tt> errore; una violazione certa di una policy o un errore di pacchettizzazione.
ja: <tt>E:</tt> はエラー; ポリシー違反とかパッケージエラーであることが確実。
zh_cn: <tt>E:</tt> 代表错误：确定违反了 Debian Policy 或是一个肯定的打包错误。
zh_tw: <tt>E:</tt> 代表錯誤：確定違反了 Debian Policy 或是一個肯定的打包錯誤。

source: <tt>W:</tt> for warning; a possible policy violation or a packaging error.
ca: <tt>W:</tt> advertència; per advertir d'una possible violació de les normes o error en el paquet (però pot ésser una falsa alarma).
es: <tt>W:</tt> para las advertencias; indica una posible violación de las normas o error en el paquete (pero pudiendo ser una falsa alarma).
fr: <tt>W:</tt> pour avertissement ; une violation possible de la Charte ou erreur d'empaquetage ;
it: <tt>W:</tt> attenzione; una possibile violazione di policy o un errore della pacchettizzazione.
ja: <tt>W:</tt> は警告; ポリシー違反かパッケージエラーである可能性あり。
zh_cn: <tt>W:</tt> 代表警告：可能违反了 Debian Policy 或是一个可能的打包错误。
zh_tw: <tt>W:</tt> 代表警告：可能違反了 Debian Policy 或是一個可能的打包錯誤。

source: <tt>I:</tt> for info; a information on certain packaging aspects.
ca: <tt>I:</tt> informació; informació sobre algun aspecte del paquet (que tal vegada és millorable).
es: <tt>I:</tt> para información; proporciona algo de información sobre algún aspecto del paquete (que tal vez sea mejorable).
fr: <tt>I:</tt> pour information ; une information sur certains aspects d'empaquetage ;
it: <tt>I:</tt> informazione; una informazione su alcuni aspetti della pacchettizzazione.
ja: <tt>I:</tt> は参考情報; パッケージ上の特定アスペクトに関する参考情報。
zh_cn: <tt>I:</tt> 代表信息：对于特定打包类别的信息。
zh_tw: <tt>I:</tt> 代表訊息：對於特定打包類別的訊息。

source: <tt>N:</tt> for note; a detailed message to help your debugging.
ca: <tt>N:</tt> nota o anotació; per a missatges detallats que poden ajudar-te en la depuració del paquet.
es: <tt>N:</tt> para las notas o anotaciones; proporciona mensajes detallados que pueden ayudarte en la depuración del paquete.
fr: <tt>N:</tt> pour note ; un message détaillé pour vous aider à déboguer ;
it: <tt>N:</tt> nota; un messaggio dettagliato per aiutare nell'analisi degli errori.
ja: <tt>N:</tt> は詳細; あなたのデバグを援助する詳細メッセージ。
zh_cn: <tt>N:</tt> 代表注释：帮助你调试的详细信息。
zh_tw: <tt>N:</tt> 代表註釋：幫助你調試的詳細訊息。

source: <tt>O:</tt> for overridden; a message overridden by the <file>lintian-overrides</file> files but displayed by the <tt>--show-overrides</tt> option.
ca: <tt>O:</tt> ignorat; un missatges ignorat (segons la configuració dels fitxers <file>lintian-overrides</file>) però que s'emet degut a l'opció <tt>--show-overrides</tt>.
es: <tt>O:</tt> para mensajes ignorados; un mensaje ignorado (según lo configurado en los archivos <file>lintian-overrides</file> pero que se emite debido a la opción <tt>--show-overrides</tt>.
fr: <tt>O:</tt> pour ignoré ; un message ignoré par le fichier <file>lintian-overrides</file> mais affiché avec le paramètre <tt>--show-overrides</tt>.
ja: <tt>O:</tt> はオーバーライド済み; <file>lintian-overrides</file> ファイルによりメッセージがオーバーライドされるが、<tt>--show-overrides</tt> オプションのために表示される。
zh_cn: <tt>O:</tt> 代表已覆盖：一个被 <file>lintian-overrides</file> 文件覆盖的信息，但由于使用 <tt>--show-overrides</tt> 选项而显示。
zh_tw: <tt>O:</tt> 代表已覆蓋：一個被 <file>lintian-overrides</file> 檔案覆蓋的訊息，但由於使用 <tt>--show-overrides</tt> 選項而顯示。

source: For warnings, tune the package to avoid them or verify that the warnings are spurious. If spurious, set the <file>lintian-overrides</file> files as described in <ref id="lintian">.
ca: En el cas dels errors (línies amb «E:» inicial), llegeix l'explicació (línies «N:»), fes els canvis necessaris en el paquet o comprova que són avisos falsos. En aquest cas, fes que <file>lintian</file> els accepti com s'ha explicat a <ref id="lintian">.
es: En el caso de los errores (líneas que comienzan por E:), lee la explicación (líneas N:), cambia el paquete para eliminarlos (y reconstruye como se describe en <ref id="completebuild"> o verifica que los avisos son falsos. En este caso, crea los archivos <file>lintian-overrides</file> como se ha descrito en <ref id="lintian">.
fr: Pour les avertissements, mettez au point le paquet pour les éviter ou vérifier qu'ils sont infondés. S'ils sont infondés, configurez les fichiers <file>lintian-overrides</file> comme décrit en <ref id="lintian">.
it: Per gli avvertimenti, si imposti il pacchetto in modo tale da evitarli o si verifichi che tali avvertimenti non siano indicativi di un errore. In quest'ultimo caso, si impostino i file <file>lintian-overrides</file> come descritto in <ref id="lintian">.
ja: 警告に関しては、パッケージを調整して回避するか、警告が誤謬であることを確認しましょう。誤謬である場合には、<ref id="lintian">に記載されたようにして <file>lintian-overrides</file> ファイルを設定します。
zh_cn: 对于警告，你应该改进软件包或者检查警告是否的确无意义。如果确定没有意义，则按照 <ref id="lintian"> 中的叙述使用 <file>lintian-overrides</file> 文件将其覆盖。
zh_tw: 對於警告，你應該改進套件或者檢查警告是否的確無意義。如果確定沒有意義，則按照 <ref id="lintian"> 中的敘述使用 <file>lintian-overrides</file> 檔案將其覆蓋。

source: Note that you can build the package with <prgn>dpkg-buildpackage</prgn> and run <prgn>lintian</prgn> on it in one command with <manref section="1" name="debuild"> or with <manref section="1" name="pdebuild">.
ca: Observa que pots construir el paquet amb <prgn>dpkg-buildpackage</prgn> i executar <prgn>lintian</prgn> només amb una ordre si fas servir <manref section="1" name="debuild"> o <manref section="1" name="pdebuild">.
es: Observa que puedes construir el paquete con <prgn>dpkg-buildpackage</prgn> y ejecutar <prgn>lintian</prgn> todo con sólo una orden si utilizas <manref section="1" name="debuild"> o <manref section="1" name="pdebuild">.
fr: Vous pouvez reconstruire le paquet avec <prgn>dpkg-buildpackage</prgn> et lancer <prgn>lintian</prgn> en une seule commande avec <manref section="1" name="debuild"> ou <manref section="1" name="pdebuild">.
it: Si noti che si può costruire il pacchetto con <prgn>dpkg-buildpackage</prgn> ed eseguire <prgn>lintian</prgn> su di esso in una sola volta con <manref section="1" name="debuild"> o con <manref section="1" name="pdebuild">.
ja: <prgn>dpkg-buildpackage</prgn> によるパッケージの生成と <prgn>lintian</prgn> の実行を、 <manref section="1" name="debuild"> や <manref section="1" name="pdebuild"> を使うとひとつのコマンドでできます。
zh_cn: 你可以使用 <manref section="1" name="debuild"> 或 <manref section="1" name="pdebuild"> 将 <prgn>dpkg-buildpackage</prgn> 与在其后运行 <prgn>lintian</prgn> 合并到一个命令里。
zh_tw: 你可以使用 <manref section="1" name="debuild"> 或 <manref section="1" name="pdebuild"> 將 <prgn>dpkg-buildpackage</prgn> 與在其後運行 <prgn>lintian</prgn> 合併到一個命令裏。

source: <prgn>debc</prgn> command
ca: L'ordre <prgn>debc</prgn>.
es: La orden <prgn>debc</prgn>
fr: Commande debc
it: Il comando <prgn>debc</prgn>
ja: <prgn>debc</prgn> コマンド
zh_cn: <prgn>debc</prgn> 命令
zh_tw: <prgn>debc</prgn> 命令

source: You can list files in the binary Debian package by <manref section="1" name="debc"> command.
ca: Pots veure una llista dels fitxers del paquet binari Debian executant l'ordre <manref section="1" name="debc"> així:
es: Puedes ver la lista de archivos del paquete binario Debian ejecutando la orden <manref section="1" name="debc"> como sigue:
fr: La commande <manref section="1" name="debc"> peut énumérer les fichiers du paquet Debian binaire.
it: Si possono elencare i file nel pacchetto binario Debian con il comando <manref section="1" name="debc">.
zh_cn: 你可以使用 <manref section="1" name="debc"> 命令列出一个二进制 Debian 软件包中的文件。
zh_tw: 你可以使用 <manref section="1" name="debc"> 命令列出一個二進位 Debian 套件中的檔案。

source: $ debc <var>package</var>.changes
ca: $ debc <var>nom_paquet</var>.changes
es: $ debc <var>nombre_del_paquete</var>.changes
fr: $ debc <var>paquet</var>.changes

source: <prgn>debdiff</prgn> command
ca: L'ordre <prgn>debdiff</prgn>.
es: La orden <prgn>debdiff</prgn>
fr: Commande debdiff
it: Il comando <prgn>debdiff</prgn>
ja: <prgn>debdiff</prgn> コマンド
zh_cn: <prgn>debdiff</prgn> 命令
zh_tw: <prgn>debdiff</prgn> 命令
