Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: Add support of the <prgn>dh_autoreconf</prgn> and <prgn>dh_autoreconf_clean</prgn> commands.
ca: Afegir funcionalitat per a les ordres <prgn>dh_autoreconf</prgn> i <prgn>dh_autoreconf_clean</prgn>.
es: Añadiendo la orden <prgn>dh_autoreconf</prgn> y <prgn>dh_autoreconf_clean</prgn>.
fr: ajout de l'assistance des commandes <prgn>dh_autoreconf</prgn> et <prgn>dh_autoreconf_clean</prgn> :
ja: <prgn>dh_autoreconf</prgn> と <prgn>dh_autoreconf_clean</prgn> コマンドのサポートを追加
zh_cn: 添加 <prgn>dh_autoreconf</prgn> 和 <prgn>dh_autoreconf_clean</prgn> 命令支持。
zh_tw: 添加 <prgn>dh_autoreconf</prgn> 和 <prgn>dh_autoreconf_clean</prgn> 命令支持。

source: Install the <package>dh-autoreconf</package> package in "<tt>Build-Depends</tt>".
ca: Afegeix el paquet <package>dh-autoreconf</package> en el camp "<tt>Build-Depends</tt>".
es: Añade el paquete <package>dh-autoreconf</package> en el campo "<tt>Build-Depends</tt>".
fr: ajout de <package>dh-autoreconf</package> à « <tt>Build-Depends</tt> » ;
ja: <package>dh-autoreconf</package>パッケージをインストールします。
zh_cn: 在 <tt>Build-Depends</tt> 中添加 <package>dh-autoreconf</package> 软件包。
zh_tw: 在 <tt>Build-Depends</tt> 中添加 <package>dh-autoreconf</package> 套件。

source: Use "<tt>dh --with autoreconf $@</tt>" instead.
ca: Fes servir "<tt>dh --with autoreconf $@</tt>" en el seu lloc.
es: Utiliza "<tt>dh --with autoreconf $@</tt>" en su lugar.
fr: utilisation de « <tt>dh --with autoreconf $@</tt> » à la place ;
ja: 代わりに"<tt>dh --with autoreconf $@</tt>"を使用します。
zh_cn: 使用 <tt>dh --with autoreconf $@</tt>
zh_tw: 使用 <tt>dh --with autoreconf $@</tt>

source: This updates the GNU Build System files and restores them after the build.
ca: Així s'actualitzen els fitxers del sistema de compilació GNU i els restaura després de la compilació.
es: Así se actualiza los archivos del sistema de compilación GNU y los restaura después de la compilación.
fr: conséquence : mise à jour des fichiers du système de construction GNU et restauration de ceux-ci après la construction ;
ja: これは、ビルド後にGNUビルドシステムのファイルのアップデートおよびレストアを行います。
zh_cn: 这样会在编译时更新 GNU 编译系统文件并在编译后对其进行恢复。
zh_tw: 這樣會在編譯時更新 GNU 編譯系統檔案並在編譯後對其進行恢復。

source: Add support to the <prgn>bash</prgn> completion feature.
ca: Afegir funcionalitat d'ompliment automàtic a <prgn>bash</prgn>.
es: Añadir la funcionalidad de autocompletar a <prgn>bash</prgn>.
fr: ajout de l'assistance de la fonctionnalité de complétion de <prgn>bash</prgn> :
ja: <prgn>bash</prgn>補完機能のサポートを追加する
zh_cn: 添加 <prgn>bash</prgn> 补全特性支持。
zh_tw: 添加 <prgn>bash</prgn> 補全特性支持。

source: Install the <package>bash-completion</package> package in "<tt>Build-Depends</tt>".
ca: Afegeix el paquet <package>bash-completion</package> en el camp "<tt>Build-Depends</tt>".
es: Añade el paquete <package>bash-completion</package> en el campo "<tt>Build-Depends</tt>".
fr: ajout de <package>bash-completion</package> à « <tt>Build-Depends</tt> » ;
ja: <package>bash-completion</package>パッケージをインストールします。
zh_cn: 在 <tt>Build-Depends</tt> 中添加 <package>bash-completion</package> 软件包。
zh_tw: 在 <tt>Build-Depends</tt> 中添加 <package>bash-completion</package> 套件。

source: Use "<tt>dh --with bash-completion $@</tt>" instead.
ca: Fes servir "<tt>dh --with bash-completion $@</tt>" en el seu lloc.
es: Utiliza "<tt>dh --with bash-completion $@</tt>" en su lugar.
fr: utilisation de « <tt>dh --with bash-completion $@</tt> » à la place ;
ja: 代わりに"<tt>dh --with bash-completion $@</tt>"を使用します。
zh_cn: 使用 <tt>dh --with bash-completion $@</tt>
zh_tw: 使用 <tt>dh --with bash-completion $@</tt>

source: This installs <prgn>bash</prgn> completions using configuration file at <file>debian/<var>package</var>.bash-completion</file>.
ca: Així s'instal·la la funció ompliment automàtic de <prgn>bash</prgn> fent servir l'arxiu de configuració de <file>debian/<var>nom_paquet</var>.bash-completion</file>.
es: Esto instala la función autocompletar de <prgn>bash</prgn> utilizando el archivo de configuración de <file>debian/<var>nombre_del_paquete</var>.bash-completion</file>.
fr: conséquence : installation des complétions de <prgn>bash</prgn> en utilisant le fichier de configuration <file>debian/<var>paquet</var>.bash-completion</file>.
ja: このコマンドを使用すると、<prgn>bash</prgn>補完機能から、 <file>debian/<var>package</var>.bash-completion</file>の設定を使うことができるようになります。
zh_cn: 这会使用 <file>debian/<var>package</var>.bash-completion</file> 中的配置文件安装 <prgn>bash</prgn> 补全。
zh_tw: 這會使用 <file>debian/<var>package</var>.bash-completion</file> 中的設定檔案安裝 <prgn>bash</prgn> 補全。

source: For sources using Autotools, use combination of above as "<tt>dh --with autotools-dev --with autoreconf $@</tt>" to be most current with the GNU Build System.
ca: Per a les fonts que fan servir «Autotools», combinar les opcions anteriors amb <tt>dh --with autotools-dev --with autoreconf $@</tt> és habitual amb el sistema de compilació GNU.
es: Para las fuentes que usan «Autotools», combinar las opciones anteriores con <tt>dh --with autotools-dev --with autoreconf $@</tt> es lo habitual con el sistema de compilación GNU.
fr: Pour les sources utilisant Autotools, la combinaison « <tt>dh --with autotools-dev --with autoreconf $@</tt> » est la plus courante avec le système de construction GNU.
ja: Autotoolsを使用したソースは、"<tt>dh --with autotools-dev --with autoreconf $@</tt>"と、コマンドを組み合わせて使うことで、最新のGNU Build Systemを使うことができます。
zh_cn: 对于使用 Autotools 的源代码，使用 <tt>dh --with autotools-dev --with autoreconf $@</tt> 让其使用最新的 GNU 编译系统。
zh_tw: 對於使用 Autotools 的原始碼，使用 <tt>dh --with autotools-dev --with autoreconf $@</tt> 讓其使用最新的 GNU 編譯系統。

source: Many <prgn>dh_*</prgn> commands invoked by the new <prgn>dh</prgn> command can be customized by the corresponding configuration files in the <file>debian</file> directory. See <ref id="dother"> and the manpage of each command for the customization of such features.
ca: Moltes de les ordres <prgn>dh_*</prgn> executades per la nova ordre <prgn>dh</prgn> es poden personalitzar amb fitxers de configuració ubicats en el directori <file>debian</file>. Consulta <ref id="dother"> i els manuals (les «manpage») de cada ordre.
es: Muchas de las órdenes <prgn>dh_*</prgn> invocadas por la nueva orden <prgn>dh</prgn> son personalizables mediante sus archivos de configuración en el directorio <file>debian</file>. Véase <ref id="dother"> y los manuales (las «manpage») para cada orden.
fr: De nombreuses commandes <prgn>dh_*</prgn> invoquées par la nouvelle commande <prgn>dh</prgn> peuvent être personnalisées par les fichiers de configuration correspondants dans le répertoire <file>debian</file>. Voir <ref id="dother"> et la page de manuel de chaque commande pour la personnalisation de telles fonctionnalités.
it: Molti comandi del tipo <prgn>dh_*</prgn>, invocati da <prgn>dh</prgn>, possono essere personalizzati modificando i rispettivi file di configurazione nella directory <file>debian</file>. Si veda <ref id="dother"> per la personalizzazione di tali caratteristiche.
ja: 多くの<prgn>dh_*</prgn>コマンドは、<prgn>dh</prgn>コマンドによって呼び出されます。この<prgn>dh</prgn>コマンドは、<file>debian</file> ディレクトリ内に設定ファイルがあり、カスタマイズすることが可能です。各コマンドの機能と、カスタマイズ方法については、 <ref id="dother"> とコマンドごとのmanpageを参照してください。
zh_cn: 很多由新的 <prgn>dh</prgn> 命令触发的 <prgn>dh_*</prgn> 都可以通过修改 <file>debian</file> 目录中的配置文件来对其行为进行定制。参看 <ref id="dother"> 和每个命令的 man 手册页。
zh_tw: 很多由新的 <prgn>dh</prgn> 命令觸發的 <prgn>dh_*</prgn> 都可以通過修改 <file>debian</file> 目錄中的設定檔案來對其行爲進行定製。參考 <ref id="dother"> 和每個命令的 man 手冊頁。

source: Some <prgn>dh_*</prgn> commands invoked by the new <prgn>dh</prgn> command may require you to run it with some arguments or to run additional commands with them or to skip them. For such cases, you create an <tt>override_dh_<var>foo</var></tt> target with its rule in the <file>rules</file> file only for the <prgn>dh_<var>foo</var></prgn> command you want to change. It basically say "<em>run me instead</em>". <footnote><p>Under <tt>lenny</tt>, if you wanted to change the behavior of a <prgn>dh_*</prgn> script you found the relevant line in the <file>rules</file> file and adjusted it.</p></footnote>
ca: Algunes ordres <prgn>dh_*</prgn> invocades per la nova ordre <prgn>dh</prgn> poden necessitar l'adició d'arguments o l'execució d'ordres addicionals. Per a aquests casos, hauràs d'afegir l'objectiu <tt>override_dh_<var>nom_ordre</var></tt> en el fitxer <file>rules</file> per a l'ordre <prgn>dh_<var>nom_ordre</var></prgn> que cal canviar. Es tracta de "<em>execute'm a mi en el seu lloc</em>" <footnote><p>En <tt>lenny</tt>, quan calia canviar un guió <prgn>dh_*</prgn> calia trobar la línia adequada en el fitxer <file>rules</file> i canviar-la. Ara és suficient afegir un objectiu. </p></footnote>.
es: Algunas órdenes <prgn>dh_*</prgn> invocadas por la nueva orden <prgn>dh</prgn> pueden precisar la adición de argumentos (opciones), la ejecución de órdenes adicionales u omitirlas del todo. Para estos casos, deberás añadir el objetivo <tt>override_dh_<var>nombre_de_la_orden</var></tt> con las reglas a ejecutar en el archivo <file>rules</file> sólo para la orden <prgn>dh_<var>nombre_de_la_orden</var></prgn> que vas a cambiar. Se trata de decir "<em>ejecútame a mí en su lugar</em>" <footnote><p>En <tt>lenny</tt>, cuando querías cambiar el comportamiento de un programa <prgn>dh_*</prgn> tenías que encontrar la línea adecuada en el archivo <file>rules</file> y cambiarla.</p></footnote>.
fr: Certaines commandes <prgn>dh_*</prgn> invoquées par la nouvelle commande <prgn>dh</prgn> doivent parfois utiliser des paramètres, exécuter des commandes supplémentaires, ou être ignorées. Pour ce faire, créez une cible <tt>override_dh_<var>toto</var></tt> avec sa règle dans le fichier <file>rules</file> uniquement pour la commande <prgn>dh_<var>toto</var></prgn> à remplacer. Son rôle est fondamentalement de dire « <em>exécute-moi à la place</em> ». <footnote><p>Avec <tt>Lenny</tt>, pour modifier le comportement d'un script <prgn>dh_*</prgn> il fallait trouver et adapter la ligne pertinente du fichier <file>rules</file>.</p></footnote>
it: Alcuni comandi del tipo <prgn>dh_*</prgn>, invocati da <prgn>dh</prgn>, possono richiedere la propria esecuzione con alcuni parametri o in aggiunta ad altri comandi da eseguire contestualmente o al posto dei comandi originali. In tali casi viene creato nel file <file>rules</file> l' obiettivo <tt>override_dh_<var>foo</var></tt> aggiungendo una regola solo per il comando <prgn>dh_<var>foo</var></prgn> che si intende modificare. Fondamentalmente tale regola dice "<em>esegui me al posto di</em>". <footnote><p>Sotto <tt>lenny</tt>, se si vuole cambiare il comportamento di uno script <prgn>dh_*</prgn> basta cercare la riga relativa nel file <file>rules</file> e modificarla.</p></footnote>
ja: <prgn>dh</prgn>コマンドによって呼び出される<prgn>dh_*</prgn>コマンドの中には、特定のコマンドと一緒に使ったり、引数をつけないと無視される場合があります。そのような場合は、変更したい<prgn>dh_<var>foo</var></prgn>コマンドについて、<tt>override_dh_<var>foo</var></tt> ターゲットを<file>rules</file>ファイルに追記してください。簡単に説明すると、このターゲットは"<em>かわりにこのコマンドを使用する</em>"という意味です。<footnote><p><tt>lenny</tt>では、<prgn>dh_*</prgn>スクリプトの挙動を変えたい場合、<file>rules</file>ファイル内の該当する行を見つけ出し、調整していました。</p></footnote>
zh_cn: 某些由新的 <prgn>dh</prgn> 命令所触发的 <prgn>dh_*</prgn> 命令可能需要额外的参数使其一同执行或者跳过执行。对于这类情况，你可以在 <file>rules</file> 文件中创建一个 <tt>override_dh_<var>foo</var></tt> target 来使其完成你想要的 <prgn>dh_<var>foo</var></prgn> 命令。它的作用简单说就是 <em>把运行的命令换成我</em>。<footnote><p>在 <tt>lenny</tt> 下，如果你希望更改某个 <prgn>dh_*</prgn> 脚本的行为，你需要在 <file>rules</file> 中找到相应的行然后进行调整。</p></footnote>
zh_tw: 某些由新的 <prgn>dh</prgn> 命令所觸發的 <prgn>dh_*</prgn> 命令可能需要額外的參數使其一同執行或者跳過執行。對於這類情況，你可以在 <file>rules</file> 檔案中創建一個 <tt>override_dh_<var>foo</var></tt> target 來使其完成你想要的 <prgn>dh_<var>foo</var></prgn> 命令。它的作用簡單說就是 <em>把運行的命令換成我</em>。<footnote><p>在 <tt>lenny</tt> 下，如果你希望更改某個 <prgn>dh_*</prgn> 腳本的行爲，你需要在 <file>rules</file> 中找到相應的行然後進行調整。</p></footnote>

source: Please note that the <prgn>dh_auto_*</prgn> commands tend to do more than what has been discussed as (over)simplified explanation to take care all the corner cases. Use of simplified equivalent command instead of these in <tt>override_dh_*</tt> targets except the <tt>override_dh_auto_clean</tt> target is a bad idea since it may kill such <package>debhelper</package>'s smart features.
ca: Les ordres <prgn>dh_auto_*</prgn> fan més coses que les explicades en aquest document. L'ús d'ordres equivalents més senzilles en el lloc d'aquestes en els objectius <tt>override_dh_*</tt> (amb l'excepció de l'objectiu <tt>override_dh_auto_clean</tt>) no és una bona idea ja que pot eliminar funcions intel·ligents de <package>debhelper</package>.
es: Las ordenes <prgn>dh_auto_*</prgn> hacen más cosas que las expuestas aquí. El uso de ordenes equivalentes más sencillas en lugar de éstas en los objetivos <tt>override_dh_*</tt> (excepto el objetivo <tt>override_dh_auto_clean</tt>) es una mala idea ya que puede eliminar funciones inteligentes de <package>debhelper</package>.
fr: Les commandes <prgn>dh_auto_*</prgn> ont tendance à en faire plus que ce ce qui a été présenté (très) simplement, pour prendre en compte toutes les situations délicates. L'utilisation d'une commande équivalente simplifiée à la place de celles des cibles <tt>override_dh_*</tt> (à part pour la cible <tt>override_dh_auto_clean</tt>) est une mauvaise idée qui risque de détruire les fonctionnalités intelligentes de <package>debhelper</package>.
it: Si noti che i comandi <prgn>dh_auto_*</prgn> tendono a fare più di quanto si sia qui illustrato in questa ultra-semplificata spiegazione per tenere in conto tutti casi limite. L'utilizzo di comandi semplificati nell'obiettivo <tt>override_dh_*</tt> è una cattiva idea in quanto potrebbe annullare molte delle caratteristiche utili di <package>debhelper</package>.
ja: ここでは簡単な説明を行いましたが、実際には、めったに発生しない厄介なケースを処理するため、<prgn>dh_auto_*</prgn>コマンドは、もっと複雑なことを行っているということを覚えておいてください。そのため、<tt>override_dh_auto_clean</tt>ターゲット以外は、<tt>override_dh_*</tt> ターゲットを使用して、簡素化された別のコマンドで代用しようとしてはいけません。<package>debhelper</package>の賢い機能が台無しになってしまうからです。
zh_cn: 请注意 <prgn>dh_auto_*</prgn> 命令所做的比上述简化的步骤中介绍的内容更多。除了 <tt>override_dh_auto_clean</tt> 外把上面的简化命令写成 <tt>override_dh_*</tt> 中是不明智的，这样会使得 <package>debhelper</package> 的许多智能特性无法体现。
zh_tw: 請注意 <prgn>dh_auto_*</prgn> 命令所做的比上述簡化的步驟中介紹的內容更多。除了 <tt>override_dh_auto_clean</tt> 外把上面的簡化命令寫成 <tt>override_dh_*</tt> 中是不明智的，這樣會使得 <package>debhelper</package> 的許多智能特性無法體現。

source: If you want to store the system configuration data for the <package>gentoo</package> package in the <file>/etc/gentoo</file> directory instead of the usual <file>/etc</file> directory, you can override the default <tt>--sysconfig=/etc</tt> argument given by the <prgn>dh_auto_configure</prgn> command to the <prgn>./configure</prgn> command by the following. <footnote><p>The <package>gentoo</package> package uses the GNU build system, also known as the Autotools. See <url id="http://en.wikipedia.org/wiki/GNU_build_system">.</p></footnote>
ca: Si les dades de configuració del paquet <package>gentoo</package> es desen en el directori <file>/etc/gentoo</file> en lloc del directori habitual <file>/etc</file>, cal anular l'execució de l'argument predeterminat <tt>--sysconfig=/etc</tt> de l'ordre <prgn>dh_auto_configure</prgn> per <prgn>./configure</prgn> amb el següent <footnote><p>El paquet <package>gentoo</package> fa sevir el sistema de compilació GNU, també conegut com «Autotools». Consulta <url id="http://es.wikipedia.org/wiki/GNU_build_system">. </p></footnote>:
es: Si vas a guardar los datos de configuración del paquete <package>gentoo</package> en el directorio <file>/etc/gentoo</file> en lugar del directorio habitual <file>/etc</file>, debes anular la ejecución del argumento predeterminado <tt>--sysconfig=/etc</tt> de la orden <prgn>dh_auto_configure</prgn> por <prgn>./configure</prgn> con lo siguiente <footnote><p>El paquete <package>gentoo</package> utiliza el sistema de compilación GNU, también conocido por «Autotools». Véase <url id="http://es.wikipedia.org/wiki/GNU_build_system">. </p></footnote>:
fr: Pour conserver les données de configuration du paquet <package>gentoo</package> dans le répertoire <file>/etc/gentoo</file> plutôt que dans le répertoire consacré <file>/etc</file>, il suffit de remplacer l'option <tt>--sysconfig=/etc</tt> donnée par la commande <prgn>dh_auto_configure</prgn> à la commande <prgn>./configure</prgn> avec : <footnote><p>Le paquet <package>gentoo</package> utilise le système de construction GNU, ou Autotools. Voir <url id="http://fr.wikipedia.org/wiki/Autotools">.</p></footnote>
it: Se si vogliono registrare i dati di configurazione di sistema del pacchetto <package>gentoo</package> nella directory <file>/etc/gentoo</file> invece che nella solita directory <file>/etc</file>, si può sovrascrivere il parametro predefinito <tt>--sysconfig=/etc</tt> dato dal comando <prgn>dh_auto_configure</prgn> al comando <prgn>./configure</prgn> nel modo seguente. <footnote><p>Il pacchetto <package>gentoo</package> utilizza il sistema di costruzione GNU, conosciuto anche come Autotools. Si veda <url id="http://en.wikipedia.org/wiki/GNU_build_system">.</p></footnote>
ja: <package>gentoo</package>パッケージのための設定情報を<file>/etc</file>ディレクトリではなく、<file>/etc/gentoo</file>ディレクトリへ置きたい場合、以下のようにして<prgn>dh_auto_configure</prgn>コマンドによって与えられる、デフォルトの引数<tt>--sysconfig=/etc</tt>を、<prgn>./configure</prgn>によってオーバーライドできます。<footnote><p><package>gentoo</package>パッケージはAutotoolsとしても知られているGNU build systemを使用します。詳細は<url id="http://en.wikipedia.org/wiki/GNU_build_system">を参照してください。</p></footnote>
zh_cn: 如果你希望把 <package>gentoo</package> 软件包的配置文件安装到 <file>/etc/gentoo</file> 而非默认的 <file>/etc</file> 目录，你可以覆盖 <prgn>dh_auto_configure</prgn> 默认的使用的 <tt>--sysconfig=/etc</tt> 参数，改为向 <prgn>./configure</prgn> 命令传递以下参数：<footnote><p><package>gentoo</package> 软件包使用 GNU 编译系统，又称 Autotools。参看 <url id="http://en.wikipedia.org/wiki/GNU_build_system"></p></footnote>
zh_tw: 如果你希望把 <package>gentoo</package> 套件的設定檔案安裝到 <file>/etc/gentoo</file> 而非默認的 <file>/etc</file> 目錄，你可以覆蓋 <prgn>dh_auto_configure</prgn> 默認的使用的 <tt>--sysconfig=/etc</tt> 參數，改爲向 <prgn>./configure</prgn> 命令傳遞以下參數：<footnote><p><package>gentoo</package> 套件使用 GNU 編譯系統，又稱 Autotools。參考 <url id="http://en.wikipedia.org/wiki/GNU_build_system"></p></footnote>

source: The arguments given after <tt>--</tt> are appended to the default arguments of the auto-executed program to override them. Using the <prgn>dh_auto_configure</prgn> command is better than the <prgn>./configure</prgn> command here since it will only override the <tt>--sysconfig</tt> argument and keeps well intended other arguments to the <prgn>./configure</prgn> command.
ca: Els arguments a continuació de <tt>dh_auto_configure --</tt> s'afegeixen als predeterminants, anul·lant-los , en l'execució automàtica del programa. És millor fer servir l'ordre <prgn>dh_auto_configure</prgn> que el <prgn>./configure</prgn>: d'aquesta manera només s'anul·larà l'argument <tt>--sysconfig</tt> mantenint els altres arguments de <prgn>./configure</prgn>.
es: Los argumentos a continuación de <tt>--</tt> se añaden a los argumentos predeterminados, anulándolos, en la ejecución automática del programa. Es mejor utilizar la orden <prgn>dh_auto_configure</prgn> que el <prgn>./configure</prgn> ya que así sólo anulará el argumento <tt>--sysconfig</tt> manteniendo intactos otros argumentos de <prgn>./configure</prgn>.
fr: Les options données après <tt>--</tt> sont ajoutées aux options par défaut du programme exécuté automatiquement dans le but de les remplacer. L'utilisation de la commande <prgn>dh_auto_configure</prgn> est ici préférable à la commande <prgn>./configure</prgn> puisqu'elle remplacera seulement l'option <tt>--sysconfig</tt> et conservera les autre options pertinentes de la commande <prgn>./configure</prgn>.
it: I parametri immessi dopo <tt>--</tt> vengono aggiunti dopo i parametri predefiniti dei programmi eseguiti pr sovrascriverli. Utilizzare il comando <prgn>dh_auto_configure</prgn> è preferibile rispetto al comando <prgn>./configure</prgn> dal momento che sovrascriverà esclusivamente il parametro <tt>--sysconfig</tt> e manterrà gli altri parametri del comando <prgn>./configure</prgn>.
ja: <tt>--</tt>以下の引数は、自動的に実行されるプログラムの引数に付け足されます。<prgn>dh_auto_configure</prgn>コマンドは、引数<tt>--sysconfig</tt>のみをオーバーライドしその他の引数には触れないため、<prgn>./configure</prgn>コマンドより優れているとされています。
zh_cn: 在 <tt>--</tt> 后给出的参数被附加于程序自动添加的默认参数后以对其进行覆盖。使用 <prgn>dh_auto_configure</prgn> 命令好于直接使用 <prgn>./configure</prgn>，因为这样只覆盖了 <tt>--sysconfig</tt> 参数而保留了其他参数。
zh_tw: 在 <tt>--</tt> 後給出的參數被附加於程式自動添加的默認參數後以對其進行覆蓋。使用 <prgn>dh_auto_configure</prgn> 命令好於直接使用 <prgn>./configure</prgn>，因爲這樣只覆蓋了 <tt>--sysconfig</tt> 參數而保留了其他參數。

source: If <file>Makefile</file> of a source for <package>gentoo</package> requires you to specify <tt>build</tt> as its target to build it <footnote><p><prgn>dh_auto_build</prgn> without any arguments will execute the first target in the <file>Makefile</file> file.</p></footnote>, you create an <tt>override_dh_auto_build</tt> target to enable it.
ca: Si el <file>Makefile</file> de les fonts de <package>gentoo</package> requereix l'especificació de l'objectiu <tt>build</tt> per a la compilació <footnote><p><prgn>dh_auto_build</prgn> sense arguments executarà el primer objectiu del fitxer <file>Makefile</file>. </p></footnote>, pots afegir un objectiu <tt>override_dh_auto_build</tt> per tal d'﻿anul·lar-lo.
es: Si el <file>Makefile</file> de las fuentes de <package>gentoo</package> requiere la especificación del objetivo <tt>build</tt> para compilarlo <footnote><p><prgn>dh_auto_build</prgn> sin argumentos ejecutará el primer objetivo del archivo <file>Makefile</file>.</p></footnote>, puedes añadir un objetivo <tt>override_dh_auto_build</tt> para anularlo.
fr: Si le <file>Makefile</file> des sources de <package>gentoo</package> nécessite de préciser <tt>build</tt> comme cible pour la construction <footnote><p><prgn>dh_auto_build</prgn> sans autre option exécutera la première cible du fichier <file>Makefile</file>.</p></footnote>, vous pouvez créer une cible <tt>override_dh_auto_build</tt> pour ce faire.
it: Se il <file>Makefile</file> di un sorgente per il pacchetto <package>gentoo</package> necessita che venga specificato l'obiettivo <tt>build</tt> per essere costruito <footnote><p><prgn>dh_auto_build</prgn> senza alcun argomento eseguirà il primo obiettivo del file <file>Makefile</file>.</p></footnote>, basterà creare l'obiettivo <tt>override_dh_auto_build</tt> pe abilitarlo.
ja: もしも<package>gentoo</package>のソースの<file>Makefile</file>が、ビルドするために、<tt>build</tt>ターゲットを必要とする場合、<footnote><p>引数なしの<prgn>dh_auto_build</prgn>は、<file>Makefile</file>の最初のターゲットを実行します。</p></footnote><tt>override_dh_auto_build</tt>ターゲットを作り、有効化しなければなりません。
zh_cn: 如果 <package>gentoo</package> 的 <file>Makefile</file> 需要指定 <tt>build</tt> 作为其编译用的 target<footnote><p>没有参数的 <prgn>dh_auto_build</prgn>命令将执行 <file>Makefile</file> 中的第一个 target。</p></footnote>，你可以创建一个 <tt>override_dh_auto_build</tt> target 来启用它。
zh_tw: 如果 <package>gentoo</package> 的 <file>Makefile</file> 需要指定 <tt>build</tt> 作爲其編譯用的 target<footnote><p>沒有參數的 <prgn>dh_auto_build</prgn>命令將執行 <file>Makefile</file> 中的第一個 target。</p></footnote>，你可以創建一個 <tt>override_dh_auto_build</tt> target 來啓用它。
