Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: The <file><var>package</var>.init</file> file is installed as the <file>/etc/init.d/<var>package</var></file> script. Its fairly generic skeleton template is provided by the <prgn>dh_make</prgn> command as <file>init.d.ex</file>. You'll likely have to rename and edit it, a lot, while making sure to provide Filesystem Hierarchy Standard (see <file>/usr/share/doc/debian-policy/fhs/</file>) compliant headers. It gets installed into the temporary directory by <manref section="1" name="dh_installinit">.
ca: El fitxer <file><var>nom_paquet</var>.init</file> s'instal·la com un guió en <file>/etc/init.d/<var>nom_paquet</var></file>. Es tracta d'una plantilla genèrica construïda per l'ordre <prgn>dh_make</prgn> amb el nom <file>init.d.ex</file>. Caldrà canviar-li el nom i fer molts canvis per assegurar-te que compleix amb ﻿les capçaleres de l'estàndard de la jerarquia del sistema de fitxers («Filesystem Hierarchy Standard» consulta <file>/usr/share/doc/debian-policy/fhs/</file>). <manref section="1" name="dh_installinit"> ho instal·la en el directori temporal.
es: El archivo <file><var>nombre_del_paquete</var>.init</file> se instala como un guión en <file>/etc/init.d/<var>nombre_del_paquete</var></file>. Se trata de una plantilla genérica construida por la orden <prgn>dh_make</prgn> como <file>init.d.ex</file>. Deberás renombrarlo y hacerle muchos cambios para asegurarte que cumpla con las cabeceras del estándar de la jerarquía del sistema de archivos («Filesystem Hierarchy Standard» véase <file>/usr/share/doc/debian-policy/fhs/</file>). <manref section="1" name="dh_installinit"> lo instalará en el directorio temporal.
fr: Le fichier <file><var>paquet</var>.init</file> est installé comme un script en <file>/etc/init.d/<var>paquet</var></file>. Un squelette de modèle générique est fournit par la commande <prgn>dh_make</prgn> en <file>init.d.ex</file>. Vous devrez sans doute le renommer et le modifier, beaucoup, en vous assurant que les en-têtes respectent la norme de hiérarchie de fichiers (cf. <file>/usr/share/doc/debian-policy/fhs/</file>). Il est installé dans le répertoire temporaire par <manref section="1" name="dh_installinit">.
it: Il file <file><var>pacchetto</var>.init</file> viene installato come lo script <file>/etc/init.d/<var>pacchetto</var></file>. La sua struttura abbastanza generica è fornita dal comando <prgn>dh_make</prgn> come <file>init.d.ex</file>. Probabilmente si dovrà rinominare e modificare un bel po', cercando di assicurarsi di fornire degli header che rispettino gli standard della gerarchia dei filesystem (si veda <file>/usr/share/doc/debian-policy/fhs/</file>). Il file viene installato nella directory temporanea con <manref section="1" name="dh_installinit">.
ja: <file><var>package</var>.init</file> ファイルは <file>/etc/init.d/<var>package</var></file> スクリプトとしてインストールされます。その極めて標準的なテンプレートファイルは<prgn>dh_make</prgn>コマンドによって提供される <file>init.d.ex</file>です。ファイル階層標準 (詳しくは <file>/usr/share/doc/debian-policy/fhs/</file>を参照) に準拠するためには、おそらくファイル名を変更し、かなりの編集が必要になります。このファイルは<manref section="1" name="dh_installinit">によって、一時的なディレクトリにインストールされます。
zh_cn: <file><var>package</var>.init</file> 文件会被安装为 <file>/etc/init.d/<var>package</var></file> 脚本。<prgn>dh_make</prgn> 创建的 <file>init.d.ex</file> 是一个很好的骨架文件。你可能要对其改名并做很多修改，同时还要提供文件系统层级标准(FHS，参看 <file>/usr/share/doc/debian-policy/fhs/</file>)所要求的文件头。它们会被 <manref section="1" name="dh_installinit"> 安装到临时目录。
zh_tw: <file><var>package</var>.init</file> 檔案會被安裝爲 <file>/etc/init.d/<var>package</var></file> 腳本。<prgn>dh_make</prgn> 創建的 <file>init.d.ex</file> 是一個很好的骨架檔案。你可能要對其改名並做很多修改，同時還要提供檔案系統層級標準(FHS，參考 <file>/usr/share/doc/debian-policy/fhs/</file>)所要求的檔案頭。它們會被 <manref section="1" name="dh_installinit"> 安裝到臨時目錄。

source: The <file><var>package</var>.default</file> file will be installed into <file>/etc/default/<var>package</var></file>. This file sets defaults that are sourced by the init script. Most times this default file is used to disable running a daemon, set some default flags or timeouts. If your init script has certain <em>settable</em> features you want to install these into the default file, not the init script.
ca: El fitxer <file><var>nom_paquet</var>.default</file> s'instal·la en el directori <file>/etc/default/<var>nom_paquet</var></file>. Aquest arxiu estableix els valors predeterminats facilitats pel guió «init». En la majoria de casos aquest arxiu es fa servir per desactivar l'execució del dimoni, establint alguns indicadors predeterminats o temps d'espera. Si el teu guió «init» té característiques configurables, les has d'incloure en aquest arxiu <file>default</file>, no en el guió «init».
es: El archivo <file><var>nombre_del_paquete</var>.default</file> se instalará en el directorio <file>/etc/default/<var>nombre_del_paquete</var></file>. Este archivo establece los valores predeterminados que utiliza el guión «init». En la mayoría de casos, este archivo se utiliza para desactivar la ejecución del demonio, estableciendo algunos indicadores predeterminados o tiempos de espera. Las características configurables que puedan existir en tu guión «init» deben incluirse en este archivo <file>default</file>, y no en el propio guión.
fr: Le fichier <file><var>paquet</var>.default</file> est installé en <file>/etc/default/<var>paquet</var></file>. Ce fichier définit les valeurs par défaut des variables utilisées par le script <file>.init</file>. La plupart du temps, ce fichier est utilisé pour désactiver le démarrage d'un démon, paramétrer quelques drapeaux (« flags ») ou temps limites. Si le script <file>init</file> contient certaines fonctionnalités <em>paramétrables</em>, elles ont leur place dans ce fichier <file>.default</file>, pas dans le script <file>init</file>.
ja: <file><var>package</var>.default</file>ファイルは<file>/etc/default/<var>package</var></file>にインストールされます。このファイルはinitスクリプトのデフォルト設定となります。このデフォルトファイルは大抵、デーモンを停止したり、デフォルトのフラグやタイムアウトなどの設定に使われます。もしもあなたのinitスクリプトが、特定の<em>設定可能</em>な機能を有しているのであれば、それは起動スクリプトではなく、このデフォルトファイルに設定しておくべきでしょう。
zh_cn: <file><var>package</var>.default</file> 文件会被安装为 <file>/etc/default/<var>package</var></file>。该文件会被 init 脚本引用为默认设置。多数情况下这个文件被用于禁止运行一个守护程序、设置默认的标识或超时。如果你的脚本有特定的可设置特性，请把它们安装到这个文件，而不是 init 脚本。
zh_tw: <file><var>package</var>.default</file> 檔案會被安裝爲 <file>/etc/default/<var>package</var></file>。該檔案會被 init 腳本引用爲默認設置。多數情況下這個檔案被用于禁止運行一個守護程式、設置默認的標識或超時。如果你的腳本有特定的可設置特性，請把它們安裝到這個檔案，而不是 init 腳本。

source: If your upstream program has an init file you can either use it or not. If you don't use their init.d script then create a new one in <file>debian/<var>package</var>.init</file>. However if the upstream init script looks fine and installs in the right place you still need to setup the <file>rc*</file> symlinks. To do this you will need to override <prgn>dh_installinit</prgn> in the <file>rules</file> file with the following lines:
ca: Si el programa original inclou un arxiu «init», tu pots fer-ne ús o bé descartar-ho. Si decideixes no fer servir el guió «init.d» original, caldrà que en facis un de nou en <file>debian/<var>nom_paquet</var>.init</file>. Tot i així, si el guió original té bona pinta i s'instal·la en la ubicació correcta, encara caldrà configurar el fitxer <file>rc*</file> d'enllaços simbòlics. Caldrà reescriure l'objectiu <prgn>dh_installinit</prgn> de l'arxiu <file>rules</file> com segueix:
es: Si el programa original incluye un archivo «init», tu puedes hacer uso de él o bien descartarlo. Si optas por no hacer uso del guión «init.d» original, deberás construir uno nuevo en <file>debian/<var>nombre_del_paquete</var>.init</file>. En cualquier caso deberás construir los enlaces simbólicos <file>rc*</file> aunque el guión original parezca correcto y se instale en el lugar adecuado. Para ello, deberás reescribir el objetivo <prgn>dh_installinit</prgn> en el archivo <file>rules</file> con las siguientes líneas:
fr: Si le programme amont possède un fichier <file>init</file>, vous avez le choix de l'utiliser ou non. Si vous n'utilisez pas leur script <file>init.d</file>, créez-en un nouveau en <file>debian/<var>paquet</var>.init</file>. Cependant, si le script <file>init</file> amont semble fonctionnel et s'installe au bon endroit, il vous faudra tout de même configurer le lien symbolique <file>rc*</file>. Pour ce faire il faudra remplacer <prgn>dh_installinit</prgn> dans le fichier <file>rules</file> avec les lignes suivantes :
ja: 上流プログラムの起動ファイルを使用するか、しないかにかかわらずです。もし上流からのinit.dスクリプトを使わないのであれば<file>debian/<var>package</var>.init</file>に新しいのを作成しましょう。上流の起動スクリプトが大丈夫そうで、正しい場所にインストールされたとしても、<file>rc*</file> シンボリックリンクの設定は必要です。そのために、<file>rules</file>ファイルに以下を追加して、<prgn>dh_installinit</prgn>をオーバーライドしましょう。
zh_cn: 如果你的上游程序中包含了 init 文件，你可以选择是否使用它。如果不使用，则创建相应的 <file>debian/<var>package</var>.init</file> 文件；如果上游的 init 脚本很好且被安装到正确的位置，你仍然需要设置 <file>rc*</file> 符号链接。你需要按照以下的方法在 <file>rules</file> 文件中覆盖 <prgn>dh_installinit</prgn>：
zh_tw: 如果你的上遊程式中包含了 init 檔案，你可以選擇是否使用它。如果不使用，則創建相應的 <file>debian/<var>package</var>.init</file> 檔案；如果上游的 init 腳本很好且被安裝到正確的位置，你仍然需要設置 <file>rc*</file> 符號鏈接。你需要按照以下的方法在 <file>rules</file> 檔案中覆蓋 <prgn>dh_installinit</prgn>：

source: If you don't need this, remove the files.
ca: Elimina el fitxer si no el fas servir.
es: Elimina el fichero si no lo necesitas.
fr: Si vous n'en avez pas besoin, effacez ces fichiers.
it: Se non si ha bisogno di tutto ciò, si possono rimuovere i file.
ja: 不要なら、このファイルを削除してください。
zh_cn: 如果你不需要这些，就删除它们。
zh_tw: 如果你不需要這些，就刪除它們。

source: <file>install</file> file
ca: Fitxer <file>install</file>.
es: Archivo <file>install</file>
fr: Fichier <file>install</file>
it: Il file <file>install</file>
ja: <file>install</file> ファイル
zh_cn: <file>install</file> 文件
zh_tw: <file>install</file> 檔案

source: If there are files that need to be installed into your package but your standard "<tt>make install</tt>" won't do it, you put the filenames and destinations into this <file>install</file> file. They are installed by <manref section="1" name="dh_install">.<footnote><p>This replaces the deprecated <manref section="1" name="dh_movefiles"> command which is configured by the <file>files</file> file.</p></footnote> You should first check there is not a more specific tool to use. For example, documents should be in the <file>docs</file> file and not in this one.
ca: Si hi ha fitxers que han d'ésser instal·lats pel paquet però "<tt>make install</tt>" no ho fa, pots llistar els fitxers i les seves destinacions a l'arxiu <file>install</file>. S'encarregarà de la instal·lació l'ordre <manref section="1" name="dh_install"> <footnote><p>Aquesta ordre reemplaça l'ordre obsoleta <manref section="1" name="dh_movefiles"> que feia servir el fitxer <file>files</file>. </p></footnote>. Comprova que no hi ha un mètode més específic per fer aquesta instal·lació. Per exemple, en el cas de la documentació, cal fer servir el fitxer <file>docs</file>.
es: Si hay archivos que deben ser instalados por el paquete pero no lo hace "<tt>make install</tt>" , puedes listar los archivos y sus destinos en el archivo <file>install</file>. Se encargará de la instalación la orden <manref section="1" name="dh_install"> <footnote><p>Esto reemplaza la orden obsoleta <manref section="1" name="dh_movefiles"> que se configuraba con el archivo <file>files</file>. </p></footnote>. Debes asegurarte que no hay un sistema más específico para hacer esta instalación. Por ejemplo, para la documentación debes utilizar el archivo <file>docs</file>, en lugar de este archivo.
fr: Si des fichiers doivent être installés dans le paquet mais que « <tt>make install</tt> » normal ne le fait pas, il faut ajouter les noms de fichiers et leur destination dans ce fichier <file>install</file>. Il sont installés par <manref section="1" name="dh_install">.<footnote><p>Cela remplace la commande obsolète <manref section="1" name="dh_movefiles"> configurée par le fichier <file>files</file>.</p></footnote> Vous devriez d'abord vérifier s'il n'y a pas un outil plus approprié à utiliser. Par exemple, les documents devraient être dans le fichier <file>docs</file> et non dans celui-ci.
it: Se ci sono dei file che devono essere installati nel pacchetto ma con il normale comando "<tt>make install</tt>" non vengono elaborati, i nomi di quest'ultimi e le cartelle di destinazione vanno messe in questo file <file>install</file>. Tali file vengono installati con il comando <manref section="1" name="dh_install">.<footnote><p>Questo comando rimpiazza il comando <manref section="1" name="dh_movefiles">, ormai deprecato, che veniva configurato dal file <file>files</file>.</p></footnote> Andrebbe innanzitutto controllato che non ci sia uno strumento più specifico da poter utilizzare. Per esempio, i documenti dovrebbero essere elencati nel file <file>docs</file> e non in questo file.
ja: パッケージにとってインストールが必要なファイルがあるにも関わらず、 "<tt>make install</tt>"ではインストールされない場合、そのファイル名とファイルを置く目的地を<file>install</file>ファイルに記述します。そうすると、<manref section="1" name="dh_install">によってそれらのファイルがインストールされます。<footnote><p><file>files</file>ファイルによって、<manref section="1" name="dh_movefiles">コマンドが設定され、置換されます。 </p></footnote> まずは使えそうな別のツールがないかどうかを調べましょう。例えば、ドキュメントはこのファイルではなく<file>docs</file>ファイルにあるべきです。
zh_cn: 如果你的软件包需要标准的 <tt>make install</tt> 没有安装的文件，可以把文件名和目标路径写入 <file>install</file> 文件，它们将被 <manref section="1" name="dh_install"> 安装。<footnote><p>这取代了已经废弃的 <manref section="1" name="dh_movefiles"> 命令，它本是用 <file>files</file> 文件所配置的。</p></footnote> 你需要首先检查要安装的文件是否有更有针对性的特定工具会对其进行安装，例如示例、文档应写在 <file>docs</file> 文件中安装。
zh_tw: 如果你的套件需要標準的 <tt>make install</tt> 沒有安裝的檔案，可以把檔案名和目標路徑寫入 <file>install</file> 檔案，它們將被 <manref section="1" name="dh_install"> 安裝。<footnote><p>這取代了已經廢棄的 <manref section="1" name="dh_movefiles"> 命令，它本是用 <file>files</file> 檔案所設定的。</p></footnote> 你需要首先檢查要安裝的檔案是否有更有針對性的特定工具會對其進行安裝，例如範例、文件應寫在 <file>docs</file> 檔案中安裝。

source: This <file>install</file> file has one line per file installed, with the name of the file (relative to the top build directory) then a space then the installation directory (relative to the install directory). One example of where this is used is where a binary is forgotten to be installed, the <file>install</file> file would look like:
ca: En el fitxer <file>install</file> hi haurà una línia per a cada un dels fitxers a instal·lar, amb el seu nom (sempre relatiu al directori superior de la compilació) i després d'un espai, el directori d'instal·lació (relatiu al directori d'instal·lació). En el cas que no s'instal·li el fitxer binari del <file>gentoo</file>, hauries d'escriure el següent:
es: El archivo <file>install</file> tendrá una línea para cada uno de los archivos a instalar, con el nombre del archivo (relativo al directorio superior de la compilación) seguido de un espacio y a continuación el directorio de instalación (relativo al directorio superior de instalación). Suponiendo que el archivo binario no se instalase, deberías utilizar el archivo <file>install</file> como sigue:
fr: Ce fichier <file>install</file> possède une ligne par fichier installé, avec le nom du fichier (par rapport au répertoire de construction principal) suivi d'un espace puis du répertoire d'installation (par rapport au répertoire d'installation). Par exemple, si un binaire est oublié lors de l'installation, le fichier <file>install</file> ressemblera à :
it: Nel file <file>install</file> compare una riga per ogni file installato, contenente il nome del file (relativo alla directory in cui avviene la costruzione del pacchetto), uno spazio e la directory di installazione (relativa alla posizione del file install). Un esempio dell'utilizzo è quando un file binario non è stato installato, in questo caso il file <file>install</file> dovrebbe essere:
ja: <file>install</file>ファイルはインストールされるファイルごとに1行必要とします。ファイル名（ビルドディレクトリのトップを基点とした相対パス）、スペース、インストールするディレクトリ名（インストールディレクトリを基点とした相対パス）という書式です。例えば、バイナリのインストールを忘れた場合などに、 <file>install</file> ファイルのエントリは以下のように記述します。
zh_cn: 这个 <file>install</file> 文件每行安装一份文件，格式上先是相对于编译目录的源目录，然后是一个空格，接下来是相对于安装目录的目标目录。假设某个二进制文件没有被默认安装，则应在 <file>install</file> 文件添加如下内容：
zh_tw: 這個 <file>install</file> 檔案每行安裝一份檔案，格式上先是相對於編譯目錄的源目錄，然後是一個空格，接下來是相對於安裝目錄的目標目錄。假設某個二進位檔案沒有被默認安裝，則應在 <file>install</file> 檔案添加如下內容：

source: src/foo/mybin usr/bin
ca: src/nom_paquet/arxiu_binari usr/bin
es: src/nombre_del_paquete/nombre_archivo_binario usr/bin
fr: src/toto/monbin usr/bin

source: This will mean when this package is installed, there will be a binary file <file>/usr/bin/mybin</file>.
ca: Quan s'instal·li el paquet, s'instal·larà el fitxer binari en <file>/usr/bin/arxiu_binari</file>.
es: Al instalarse el paquete, se instalará el archivo binario <file>/usr/bin/nombre_archivo_binario</file>.
fr: Cela signifie que lors de l'installation du paquet, il y aura un fichier binaire <file>/usr/bin/monbin</file>.
it: Questo significa che quando il pacchetto verrà installato, ci sarà un file binario <file>/usr/bin/mybin</file>.
ja: 上記によって、パッケージがインストールされたときに、<file>/usr/bin/mybin</file>というバイナリファイルが存在することになります。
zh_cn: 这意味着安装这个软件包时将有一个二进制文件 <file>/usr/bin/mybin</file>
zh_tw: 這意味着安裝這個套件時將有一個二進位檔案 <file>/usr/bin/mybin</file>

source: Alternatively, this <file>install</file> can have the name of the file only without the installation directory when the relative directory path does not change. This format is usually used for a large package that splits build result into multiple binary packages using <file><var>package-1</var>.install</file>, <file><var>package-2</var>.install</file>, etc.
ca: En el fitxer <file>install</file> pots escriure el nom del fitxer sense el directori d'instal·lació sempre que la ruta relativa de directori no canvii. Aquest format es fa servir amb paquets grans que separen el resultat de la compilació en més d'un paquet binari fent servir el conjunt de fitxers <file><var>nom_paquet-1</var>.install</file>, <file><var>nom_paquet-2</var>.install</file>, etc.
es: En el archivo <file>install</file> puedes escribir el nombre del archivo sin el directorio de instalación siempre que no cambie la ruta relativa de directorio. Este formato se usa en paquetes grandes que separan el resultado de la compilación en múltiples paquetes binarios haciendo uso de <file><var>nombre_del_paquete-1</var>.install</file>, <file><var>nombre_del_paquete-2</var>.install</file>, etc.
fr: Ce fichier <file>install</file> peut renseigner seulement le nom du fichier sans le répertoire d'installation quand le chemin relatif n'est pas modifié. Ce format est normalement utilisé pour un gros paquet qui découpe le résultat de la construction en multiples paquets binaires à l'aide de <file><var>paquet-1</var>.install</file>, <file><var>paquet-2</var>.install</file>, etc.
it: Alternativamente, questo file <file>install</file> può presentare il nome del file senza la directory di installazione solo quando il percorso relativo della directory non cambia. Questo formato è solitamente utilizzato per grandi pacchetti che organizzano i risultati della costruzione in pacchetti multipli utilizzando <file><var>pacchetto-1</var>.install</file>, <file><var>pacchetto-2</var>.install</file>, ecc.
ja: また、この<file>install</file>ファイルは相対パスが変わらない場合、インストールディレクトリの指定を省略することもできます。この書式はビルドした結果を、<file><var>package-1</var>.install</file>, <file><var>package-2</var>.install</file>, などを使用し、複数のバイナリパッケージに分割するような、大規模なパッケージで使われます。
zh_cn: 当然 <file>install</file> 文件也可以只包含相对的源路径而不带目标位置。这样的格式通常用于使用 <file><var>package-1</var>.install</file>、<file><var>package-2</var>.install</file> 等将大软件包分割为多个二进制包的情况。
zh_tw: 當然 <file>install</file> 檔案也可以只包含相對的源路徑而不帶目標位置。這樣的格式通常用於使用 <file><var>package-1</var>.install</file>、<file><var>package-2</var>.install</file> 等將大套件分割爲多個二進位套件的情況。

source: The <prgn>dh_install</prgn> command will fall back to look in <file>debian/tmp</file> for files, if it doesn't find them in the current directory (or wherever you've told it to look using <tt>--sourcedir</tt>).
ca: L'ordre <prgn>dh_install</prgn> revisarà el directori <file>debian/tmp</file> per cercar els fitxers si no els troba en el directori actual (o en la ubicació establerta per a la recerca amb l'opció <tt>--sourcedir</tt>).
es: La orden <prgn>dh_install</prgn> retrocederá al directorio <file>debian/tmp</file> buscar los archivos si no los encuentra en el directorio actual (o en la ubicación que hayas establecido con para la búsqueda con <tt>--sourcedir</tt>).
fr: La commande <prgn>dh_install</prgn> finira par chercher les fichiers dans <file>debian/tmp</file>, s'il ne les trouve pas dans le répertoire courant (ou quelque soit l'endroit où il lui a été demandé de chercher avec <tt>--sourcedir</tt>).
it: Il comando <prgn>dh_install</prgn> andrà a controllare nella cartella <file>debian/tmp</file> alla ricerca di file, se non ne trova nella directory corrente (or in qualsiasi altro posto si sia indicato di guardare utilizzando <tt>--sourcedir</tt>).
ja: <prgn>dh_install</prgn> コマンドはもし、カレントディレクトリでファイルが見つからなかった場合は、(または、<tt>--sourcedir</tt> で探すように指示したディレクトリ内で見つからなかった場合は)フォールバックして <file>debian/tmp</file>内を検索します。
zh_cn: 如果 <prgn>dh_install</prgn> 命令没有在当前目录(或者你可能使用 <tt>--sourcedir</tt> 参数指定的位置)找到文件，它会回滚至使用 <file>debian/tmp</file> 目录。
zh_tw: 如果 <prgn>dh_install</prgn> 命令沒有在當前目錄(或者你可能使用 <tt>--sourcedir</tt> 參數指定的位置)找到檔案，它會回滾至使用 <file>debian/tmp</file> 目錄。

source: <file><var>package</var>.info</file> file
ca: Fitxer <file><var>nom_paquet</var>.info</file>.
es: Archivo <file><var>nombre_del_paquete</var>.info</file>
fr: Fichier <file><var>paquet</var>.info</file>
ja: <file><var>package</var>.info</file> ファイル
zh_cn: <file><var>package</var>.info</file> 文件
zh_tw: <file><var>package</var>.info</file> 檔案

source: If your package has info pages, you should install them using <manref section="1" name="dh_installinfo"> by listing them in the <file><var>package</var>.info</file> files.
ca: Si el teu paquet fa servir fitxers «info» (sistema d'ajuda), pots instal·lar-los fent servir <manref section="1" name="dh_installinfo"> que utilitzarà el llistat del fitxer <file><var>package</var>.info</file>.
es: Si tu paquete utiliza páginas de información («info pages»), podrás instalarlas utilizando <manref section="1" name="dh_installinfo"> que utilizará el listado del archivo <file><var>package</var>.info</file>.
fr: Si le paquet possède des pages d'information, vous devriez les installer avec <manref section="1" name="dh_installinfo"> en les énumérant dans les fichiers <file><var>paquet</var>.info</file>.
it: Se il pacchetto generato ha delle pagine informative, queste andrebbero installate utilizzando il comando <manref section="1" name="dh_installinfo"> ed elencandole nei file <file><var>pacchetto</var>.info</file>.
ja: パッケージにinfoページがある場合、<file><var>package</var>.info</file>にそれらを挙げて、<manref section="1" name="dh_installinfo">を使用してインストールします。
zh_cn: 如果你的软件包有 info 信息页，应该使用 <manref section="1" name="dh_installinfo"> 安装，要安装的文件列于 <file><var>package</var>.info</file> 文件中。
zh_tw: 如果你的套件有 info 訊息頁，應該使用 <manref section="1" name="dh_installinfo"> 安裝，要安裝的檔案列於 <file><var>package</var>.info</file> 檔案中。

source: <file>{<var>package</var>.|source/}lintian-overrides</file> files
ca: Fitxers <file>{<var>nom_arxiu</var>.|source/}lintian-overrides</file>
es: Archivos <file>{<var>nombre_del_paquete</var>.|source/} lintian-overrides</file>
fr: Fichiers <file>{<var>paquet</var>.|source/}lintian-overrides</file>
it: I file <file>{<var>pacchetto</var>.|source/}lintian-overrides</file>
ja: <file>{<var>package</var>.|source/}lintian-overrides</file> ファイル
zh_cn: <file>{<var>package</var>.|source/}lintian-overrides</file> 文件
zh_tw: <file>{<var>package</var>.|source/}lintian-overrides</file> 檔案
