Repository: lurdan/trans-ddp
Catalog: maint-guide/maint-guide.*.po
Languages: ca, es, fr, it, ja, zh_cn, zh_tw

source: As you may have noticed, Debian archive is divided in sections: <tt>main</tt> (the free software), <tt>non-free</tt> (the not really free software) and <tt>contrib</tt> (free software that depends on non-free software). Under those, there are logical subsections that describe in short what packages are in. So we have <tt>admin</tt> for administrator-only programs, <tt>base</tt> for the basic tools, <tt>devel</tt> for programmer tools, <tt>doc</tt> for documentation, <tt>libs</tt> for libraries, <tt>mail</tt> for e-mail readers and daemons, <tt>net</tt> for network apps and daemons, <tt>x11</tt> for X11 programs that don't fit anywhere else, and many more. See the <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-subsections" name="Debian Policy Manual, 2.4 'Sections'"> and <url id="http://packages.debian.org/unstable/" name="List of sections in 'sid'"> for the guidance.
ca: Debian està dividit en seccions: <tt>main</tt> (principal, per als programes de codi lliure), <tt>non-free</tt> (propietaris, per als programes propietaris) i <tt>contrib</tt> (per als programes que depenen de programari propietari). A cada secció hi ha subdivisions segons el tipus de programari. Tenim <tt>admin</tt> per a programes que es fan servir per l'administració del sistema (habitualment només per l'usuari «root»), <tt>base</tt> per a les eines bàsiques del sistema, <tt>devel</tt> per al programari de desenvolupament, <tt>doc</tt> per a la documentació, <tt>libs</tt> per a les biblioteques, <tt>mail</tt> per a lectors de correu i dimonis de correu electrònic, <tt>net</tt> per a programes i dimonis de xarxa, <tt>x11</tt> per a programes específics de X11 i molts d'altres. Consulteu les <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-subsections" name="Normes de Debian , secció 2.4 "> i <url id="http://packages.debian.org/unstable/" name="Llista de seccions a «sid»'">.
es: Como puede que hayas notado, Debian está dividida en secciones: <tt>main</tt> (principal, los programas libres o de código abierto), <tt>non-free</tt> (no libre, los programas que no son libres, que son de propietario) y <tt>contrib</tt> (programas libres que dependen de programas no libre o de propietario). Bajo ellas hay subdivisiones lógicas que describen en una palabra qué paquetes hay dentro. Así que tenemos <tt>admin</tt> para programas que sólo usa un administrador,<tt>base</tt> para las herramientas básicas, <tt>devel</tt> para las herramientas de programación, <tt>doc</tt> para la documentación, <tt>libs</tt> para las bibliotecas, <tt>mail</tt> para lectores y demonios de correo-e, <tt>net</tt> para aplicaciones y demonios de red, <tt>x11</tt> para programas específicos de X11, y muchos más. Como guía véanse las <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-subsections" name="normas de Debian, 2.4 'Secciones'"> y la <url id="http://packages.debian.org/unstable/" name="lista de secciones en «sid»">.
fr: Comme vous avez pu le constater, l'archive Debian est divisée en sections : <tt>main</tt> (logiciels libres), <tt>non-free</tt> (logiciels non libres), et <tt>contrib</tt> (logiciels libres qui dépendent de logiciels non libres). Des sous-sections logiques décrivent de manière concise le type de paquets qui s'y trouvent, par exemple <tt>admin</tt> pour les programmes destinés aux administrateurs, <tt>base</tt> pour les outils fondamentaux, <tt>devel</tt> pour les outils de programmation, <tt>doc</tt> pour la documentation, <tt>libs</tt> pour les bibliothèques, <tt>mail</tt> pour les lecteurs et les démons de courrier électronique, <tt>net</tt> pour les applications et démons de réseau, <tt>x11</tt> pour les programmes X11 qui ne conviennent pas mieux ailleurs, et bien d'autres. Lisez la <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-subsections" name="Charte Debian, 2.4 « Sections »"> et la <url id="http://packages.debian.org/unstable/" name="liste des sections dans <tt>Sid</tt>"> pour des conseils.
ja: ご存知のように、Debianアーカイブは<tt>main</tt> (完全にフリーなソフトウェア)、<tt>non-free</tt> (実質フリーであるとはいえないソフトウェア)、<tt>contrib</tt> (自身はフリーだがnon-freeに依存するソフトウェア)にわかれています。さらにその下で、論理的なサブセクションに分類されています。例えば、管理者専用のプログラムは<tt>admin</tt> 、基本的なツールは<tt>base</tt>、プログラマのためのツールは<tt>devel</tt> 、文書作成関連は<tt>doc</tt>、ライブラリ群は<tt>libs</tt>、メールリーダやメールサーバに必要なデーモンなどは<tt>mail</tt>、ネットワーク関連のアプリケーションやデーモンは<tt>net</tt>、分類ができないX11用のプログラムは<tt>x11</tt>に分類され、他にも様々なサブセクションがあります。詳しくは、<url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-subsections" name="Debian Policy Manual, 2.4 'Sections'"> と <url id="http://packages.debian.org/unstable/" name="List of sections in 'sid'"> を参照してください。
zh_cn: 你可能已经注意到，Debian 仓库被分为几个类别：<tt>main</tt> (自由软件)、<tt>non-free</tt> (非自由软件)以及 <tt>contrib</tt> (依赖于非自由软件的自由软件)。在这些大的分类之下还有多个逻辑上的子分类，用以简短描述软件包的用途类别。<tt>admin</tt> 为仅供系统管理员使用的程序，<tt>base</tt> 为基本工具，<tt>devel</tt> 为开发工具，<tt>doc</tt> 为文档，<tt>libs</tt> 为库，<tt>mail</tt> 为电子邮件阅读器或邮件系统守护程序，<tt>net</tt> 为网络应用程序或网络服务守护进程，<tt>x11</tt> 为不属于其他分类的为 X11 程序。更多的子分类见 <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-subsections" name="Debian Policy Manual, 2.4 'Sections'"> 和 <url id="http://packages.debian.org/unstable/" name="List of sections in 'sid'">
zh_tw: 你可能已經注意到，Debian 倉庫被分爲幾個類別：<tt>main</tt> (自由軟體)、<tt>non-free</tt> (非自由軟體)以及 <tt>contrib</tt> (依賴於非自由軟體的自由軟體)。在這些大的分類之下還有多個邏輯上的子分類，用以簡短描述套件的用途類別。<tt>admin</tt> 爲僅供系統管理員使用的程式，<tt>base</tt> 爲基本工具，<tt>devel</tt> 爲開發工具，<tt>doc</tt> 爲文件，<tt>libs</tt> 爲庫，<tt>mail</tt> 爲電子郵件閱讀器或郵件系統守護程式，<tt>net</tt> 爲網絡應用程式或網絡服務守護進程，<tt>x11</tt> 爲不屬於其他分類的爲 X11 程式。更多的子分類見 <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-subsections" name="Debian Policy Manual, 2.4 'Sections'"> 和 <url id="http://packages.debian.org/unstable/" name="List of sections in 'sid'">

source: Let's change it then to x11. (A <tt>main/</tt> prefix is implied so we can omit it.)
ca: Canviarem aquesta línia a «x11». El prefix <tt>main/</tt> és implícit, així que ho pots ometre. Consulta el <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-subsections" name="Manual de normes de Debian, 2.4 'Seccions'"> i <url id="http://packages.debian.org/unstable/" name="Llista de seccions a «sid»">.
es: Vamos a cambiarla para que ponga x11. El prefijo <tt>main/</tt> ya va implícito, así que podemos omitirlo. Véase <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-subsections" name="Manual de normas de Debian, 2.4 'Secciones'">.
fr: Changez la section en x11 (le préfixe <tt>main/</tt> est implicite, et peut donc être omis).
it: Si può quindi cambiare il valore alla seconda riga in x11. (Il prefisso <tt>main/</tt> è implicito e può essere omesso.)
ja: ここではx11に変更してみましょう。(省略時は<tt>main/</tt>がデフォルトとして設定されます)
zh_cn: 我们将本例设置为 x11。( <tt>main/</tt> 前缀是默认值，可以省略。)
zh_tw: 我們將本例設置爲 x11。( <tt>main/</tt> 前綴是默認值，可以省略。)

source: Line 3 describes how important it is that the user installs this package. See the <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-priorities" name="Debian Policy Manual, 2.5 'Priorities'"> for the guidance.
ca: La línia 3 descriu la importància que pot tenir per a l'usuari (o el sistema) la instal·lació del paquet. Pots consultar el manual de normes de Debian («Debian Policy») a <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-priorities" name="Manual de normes de Debian, 2.5 'Prioritat'"> per saber els possibles valors d'aquest camp.
es: La línea 3 describe cómo de importante es para el usuario la instalación de este paquete. Podrás consultar en el manual de normas de Debian («Debian Policy», N. del T.) en <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-priorities" name="Manual de normas de Debian, 2.5 'Prioridad'"> la guía de los valores que deberían tener estos campos.
fr: La ligne 3 décrit l'importance pour l'utilisateur d'installer ce paquet. Lisez la <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-priorities" name="Charte Debian, 2.5 « Priorités »"> pour des informations sur ces valeurs :
it: La riga numero 3 indica quanto sia importante per l'utente installare questo pacchetto. Si legga <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-priorities" name="Manuale delle policy di Debian, 2.5 'Priorità'"> per maggiori informazioni.
ja: 3行目は、ユーザーがパッケージをインストールする重要度を示しています。詳しくは<url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-priorities" name="Debian Policy Manual, 2.5 'Priorities'">を参照してください。
zh_cn: 第 3 行描述了用户安装此软件包的优先级。具体说明参看 <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-priorities" name="Debian Policy Manual, 2.5 'Priorities'">
zh_tw: 第 3 行描述了用戶安裝此套件的優先級。具體說明參考 <url id="http://www.debian.org/doc/debian-policy/ch-archive.html#s-priorities" name="Debian Policy Manual, 2.5 'Priorities'">

source: The <tt>optional</tt> priority will usually work for new packages that do not conflict with others with <tt>required</tt>, <tt>important</tt> or <tt>standard</tt> priorities.
ca: La prioritat <tt>optional</tt> es fa servir per a paquets nous que no tenen conflictes amb altres paquets amb prioritat <tt>required</tt>, <tt>important</tt> o <tt>standard</tt>.
es: La prioridad <tt>optional</tt> se utiliza para paquetes nuevos que no entran en conflicto con otros de prioridad <tt>required</tt>, <tt>important</tt> o <tt>standard</tt>.
fr: la priorité <tt>optional</tt> fonctionne habituellement pour les nouveaux paquets qui ne sont pas en conflit avec d'autres de priorité <tt>required</tt>, <tt>important</tt> ou <tt>standard</tt> ;
ja: <tt>required</tt>、 <tt>important</tt>、<tt>standard</tt>のパッケージと競合しない新規のパッケージの場合は、<tt>optional</tt>で問題ないでしょう。
zh_cn: <tt>optional</tt> 优先级适用于不与优先级为 <tt>required</tt>、<tt>important</tt> 或 <tt>standard</tt> 的软件包冲突的新软件包。
zh_tw: <tt>optional</tt> 優先級適用於不與優先級爲 <tt>required</tt>、<tt>important</tt> 或 <tt>standard</tt> 的套件衝突的新套件。

source: The <tt>extra</tt> priority will usually work for new packages that conflict with others with non-<tt>extra</tt> priorities.
ca: La prioritat <tt>extra</tt> es fa servir per als nous paquets que tenen conflictes amb altres paquets que no tenguin la prioritat <tt>extra</tt>
es: La prioridad <tt>extra</tt> se utiliza para nuevos paquetes que entran en conflicto con otros que no tienen la prioridad <tt>extra</tt>.
fr: la priorité <tt>extra</tt> fonctionne habituellement pour les nouveaux paquets qui sont en conflit avec d'autres de priorité non <tt>extra</tt>.
it: La priorità <tt>extra</tt> solitamente viene usata per i nuovi pacchetti, che andrebbero in conflitto con altri pacchetti che non hanno questa priorità
ja: <tt>extra</tt>以外のパッケージと競合する可能性のある、新規パッケージの場合は、<tt>extra</tt>とすると大抵うまくいきます。
zh_cn: <tt>extra</tt> 优先级适用于与其他非 <tt>extra</tt> 优先级软件包冲突的新软件包。
zh_tw: <tt>extra</tt> 優先級適用於與其他非 <tt>extra</tt> 優先級套件衝突的新套件。

source: Section and priority are used by the frontends like <prgn>aptitude</prgn> when they sort packages and select defaults. Once you upload the package to Debian, the value of these two fields can be overridden by the archive maintainers, in which case you will be notified by email.
ca: «Section» i «Priority» es fan servir per les ﻿interfícies com <prgn>dselect</prgn> quan ordenen els paquets i seleccionen els predeterminats. Una vegada el teu paquet s'afegeixi a Debian, el contingut d'aquests camps pot ésser canviat per les persones responsables del repositori, que t'informaran per correu electrònic.
es: «Section» y «Priority» se usan en las interfaces como <prgn>aptitude</prgn> cuando ordenan los paquetes y seleccionan los predeterminados. Una vez que envíes el paquete a Debian, el valor de estos dos campos puede no ser aceptado por los responsables del archivo, en cuyo caso te lo notificarán por correo electrónico.
fr: Les sections et les priorités sont utilisées par des interfaces comme <prgn>aptitude</prgn> quand elles trient les paquets et sélectionnent les valeurs par défaut. Quand vous enverrez le paquet dans Debian, les valeurs de ces deux champs peuvent être modifiées par les responsables des archives, auquel cas vous serez notifié par courrier.
it: Le sezioni e le priorità vengono solitamente utilizzate da interfacce come <prgn>aptitude</prgn> in cui i pacchetti vengono suddivisi e vengono selezionati quelli predefiniti. Una volta caricato il pacchetto in Debian, il valore di ciascuno di questi due campi può essere sovrascritto dai manutentori dell'archivio, in tal caso si verrà avvertiti via mail.
ja: セクション(Section)と優先度(Priority)は<prgn>aptitude</prgn>のようなフロントエンドがパッケージをソートする際と、デフォルトを選択する際に利用されます。Debianにアップロードしたパッケージのこれらの値は、アーカイブメンテナによって上書きされることがありますが、その場合は電子メールによって通知されます。
zh_cn: Section 和 Priority 常被如 <prgn>aptitude</prgn> 的前端所使用，以分类软件包并计算默认值。一旦你把软件包上传到 Debian，这两项的值可以被仓库维护人员修改，在被修改时你将收到邮件。
zh_tw: Section 和 Priority 常被如 <prgn>aptitude</prgn> 的前端所使用，以分類套件並計算默認值。一旦你把套件上傳到 Debian，這兩項的值可以被倉庫維護人員修改，在被修改時你將收到郵件。

source: As this is a normal priority package and doesn't conflict with anything else, we will change the priority to "<tt>optional</tt>".
ca: Com és un paquet de prioritat normal i no té conflictes amb cap altre paquet, deixarem la prioritat a "<tt>optional</tt>" (opcional).
es: Como es un paquete de prioridad normal y no tiene conflictos con ningún otro, lo dejaremos con prioridad "<tt>optional</tt>" (opcional).
fr: Comme c'est un paquet de priorité normale et qu'il n'entre pas en conflit avec quoi que ce soit, il suffit de laisser la priorité à « <tt>optional</tt> ».
it: Dal momento che il pacchetto trattato ha una priorità normale e non va in conflitto con altri, si cambierà la priorità a "<tt>optional</tt>".
ja: このパッケージは通常の優先度で、競合もないので、 "<tt>optional</tt>"にしましょう。
zh_cn: 由于这是一个常规优先级的软件，并不与其他软件包冲突，我们将优先级改为 <tt>optional</tt>。
zh_tw: 由於這是一個常規優先級的軟體，並不與其他套件衝突，我們將優先級改爲 <tt>optional</tt>。

source: Line 4 is the name and email address of the maintainer. Make sure that this field includes a valid "<tt>To</tt>" header for an email, because after you upload it, the bug tracking system will use it to deliver bug emails to you. Avoid using commas, ampersands and parenthesis.
ca: A la línia 4 hi ha el nom i l'adreça electrònica del desenvolupador. Assegura't que l'adreça electrònica és vàlida per al camp "<tt>A</tt>" : el sistema de seguiment d'errades («Bug Tracking System») la farà servir per enviar-te els missatges de les errades del paquet. No facis servir «"», el signe «&amp;» i ﻿parèntesi.
es: La línea 4 es el nombre y correo electrónico del desarrollador. Asegúrate de que este campo incluye una cabecera válida "<tt>To</tt>" («A:»), para una dirección de correo electrónico, porque después de que envíes el paquete, el sistema de seguimiento de errores («Bug Tracking System») utilizará esta dirección para enviarte los mensajes de los bugs. Evita usar comas, el signo «&» y paréntesis.
fr: La ligne 4 est le nom et l'adresse électronique du responsable. Assurez-vous que ce champ contient un en-tête « <tt>To</tt> » valable pour un courrier électronique, car après l'envoi du paquet, le système de suivi des bogues l'utilisera pour vous délivrer les courriers relatifs aux bogues. Évitez d'utiliser des virgules, esperluettes (« &amp; ») ou parenthèses.
ja: 4行目は、メンテナの名前と電子メールアドレスです。バグ追跡システムは、このフィールドに記載された宛先へユーザーからのバグ報告を送信するので、正しいメールアドレスを記載してください。コンマ ,、アンド記号 &、括弧 ()は使用しないでください。
zh_cn: 第 4 行是维护者的姓名和电子邮件地址。请确保此处的值可以直接用于电子邮件头的 <tt>To</tt> 项。因为一旦你将软件包上传至仓库，Bug 跟踪系统将使用其向你发送可能的 Bug 报告邮件。避免使用逗号、“&”符号或括号。
zh_tw: 第 4 行是維護者的姓名和電子郵件地址。請確保此處的值可以直接用於電子郵件頭的 <tt>To</tt> 項。因爲一旦你將套件上傳至倉庫，Bug 跟蹤系統將使用其向你發送可能的 Bug 報告郵件。避免使用逗號、“&”符號或括號。

source: The 5th line includes the list of packages required to build your package as the <tt>Build-Depends</tt> field. You can also have the <tt>Build-Depends-Indep</tt> field as an additional line, here. (see the <url id="http://www.debian.org/doc/debian-policy/ch-relationships.html#s-sourcebinarydeps" name="Debian Policy Manual, 7.7 'Relationships between source and binary packages - Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep'">). Some packages like <package>gcc</package> and <package>make</package> which are required by the <package>build-essential</package> package are implied. If you need to have other tools to build your package, you should add them to these fields. Multiple entries are separated with commas; read on for the explanation of binary dependencies to find out more about the syntax of these lines.
ca: A la línia 5 hi ha els paquets necessaris per a la construcció del teu paquet (en el camp <tt>Build-Depends</tt>). Hi pot haver una línia ﻿addicional amb el camp <tt>Build-Depends-Indep</tt> (consulta <url id="http://www.debian.org/doc/debian-policy/ch-relationships.html#s-sourcebinarydeps" name="Debian Policy Manual, 7.7 'Relationships between source and binary packages - Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep">). Alguns paquets com a <package>gcc</package> i <package>make</package> que son necessaris per a <package>build-essential</package> no és necessari posar-los (es consideren implícitament). Si el teu programa fa servir algun compilador que no sigui habitual o alguna altra eina per a la construcció del paquet, hauries d'afegir la línia «Build-Depends». Els noms dels paquets se separen amb comes. Consulta l'explicació de les dependències binaries per saber més sobre la ﻿sintaxi d'aquest camp. A més a més, cal considerar aquest casos:
es: La línea 5 incluye la lista de paquetes requeridos para construir tu paquete (en el campo <tt>Build-Depends</tt>). Puedes tener una línea adicional con el campo <tt>Build-Depends-Indep</tt> (consulta <url id="http://www.debian.org/doc/debian-policy/ch-relationships.html#s-sourcebinarydeps" name="«Debian Policy Manual, 7.7 Relationships between source and binary packages - Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep»"> para más información sobre este campo). Algunos paquetes como <package>gcc</package> y <package>make</package> están implícitos, consulta el paquete <package>build-essential</package> para más detalles. Si se necesita algún compilador no estándar u otra herramienta para construir tu paquete, deberías añadirla en la línea «Build-Depends». Las entradas múltiples se separan con comas, lee la explicación de las dependencias binarias para averiguar más sobre la sintaxis de este campo.
fr: La cinquième ligne contient la liste des paquets nécessaires pour construire le paquet dans le champ <tt>Build-Depends</tt>. Le champ <tt>Build-Depends-Indep</tt> peut-être ajouté dans une ligne supplémentaire (voir la <url id="http://www.debian.org/doc/debian-policy/ch-relationships.html#s-sourcebinarydeps" name="Charte Debian, 7.7 « Relations entre paquets sources et binaires &mdash; Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep »">). Certains paquets comme <package>gcc</package> ou <package>make</package> sont implicites, puisqu'ils dépendent de <package>build-essential</package>. Si d'autres outils sont nécessaires pour construire le paquet, vous devez les ajouter à ces champs. Les multiples éléments sont séparées par des virgules ; lisez ci-après les explications sur les dépendances entre binaires pour mieux comprendre la syntaxe de ces lignes :
ja: 5行目の<tt>Build-Depends</tt>フィールドは、新規パッケージのビルドに必要なパッケージのリストです。必要であればここに、<tt>Build-Depends-Indep</tt>フィールドを追加できます。(詳しくは<url id="http://www.debian.org/doc/debian-policy/ch-relationships.html#s-sourcebinarydeps" name="Debian Policy Manual, 7.7 'Relationships between source and binary packages - Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep'">を参照してください、)<package>gcc</package>や<package>make</package>のような<package>build-essential</package>に含まれるパッケージはデフォルトで含まれています。他のツールが必要な場合は、このフィールドに追加しましょう。複数記載する場合は、コンマで区切ります。このフィールドの書式については、バイナリ依存関係（後述）のところでもう少し詳しく説明します。
zh_cn: 第 5 行中的 <tt>Build-Depends</tt> 项列出了编译此软件包需要的软件包。一些情况下你还需要这里添加一行 <tt>Build-Depends-Indep</tt> (参看 <url id="http://www.debian.org/doc/debian-policy/ch-relationships.html#s-sourcebinarydeps" name="Debian Policy Manual, 7.7 'Relationships between source and binary packages - Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep'">)。<package>build-essential</package> 依赖的软件包，如 <package>gcc</package> 和 <package>make</package> 等，已经默认安装而不需再写到此处。如果你需要其他工具来编译这个软件包，请将它们加到这里。多个软件包应使用半角逗号分隔，继续阅读二进制包依赖关系以增进对这些行的语法的理解。
zh_tw: 第 5 行中的 <tt>Build-Depends</tt> 項列出了編譯此套件需要的套件。一些情況下你還需要這裏添加一行 <tt>Build-Depends-Indep</tt> (參考 <url id="http://www.debian.org/doc/debian-policy/ch-relationships.html#s-sourcebinarydeps" name="Debian Policy Manual, 7.7 'Relationships between source and binary packages - Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep'">)。<package>build-essential</package> 依賴的套件，如 <package>gcc</package> 和 <package>make</package> 等，已經默認安裝而不需再寫到此處。如果你需要其他工具來編譯這個套件，請將它們加到這裏。多個套件應使用半角逗號分隔，繼續閱讀二進位套件依賴關係以增進對這些行的語法的理解。

source: For all packages packaged with the <prgn>dh</prgn> command in the <file>debian/rules</file> file, you must have "<tt>debhelper (>=7.0.50~)</tt>" in the <tt>Build-Depends</tt> field to satisfy the Debian Policy requirement for the <tt>clean</tt> target.
ca: A tots els paquets construïts amb l'ordre <prgn>dh</prgn> en el fitxer <file>debian/rules</file>, caldrà posar <tt>debhelper (>=7.0.50~)</tt> en el camp <tt>Build-Depends</tt> per seguir les normes Debian respecte a l'objectiu <tt>clean</tt>.
es: Para todos los paquetes construidos con la orden <prgn>dh</prgn> en el archivo <file>debian/rules</file>, estará <tt>debhelper (>=7.0.50~)</tt> en el campo <tt>Build-Depends</tt> para ajustarse a las normas de Debian respecto al objetivo <tt>clean</tt>.
fr: pour tous les paquets empaquetés avec la commande <prgn>dh</prgn> dans le fichier <file>debian/rules</file>, « <tt>debhelper (>=7.0.50~)</tt> » doit faire partie du champ <tt>Build-Depends</tt> pour être conforme à la Charte Debian au sujet de la cible <tt>clean</tt> ;
ja: <file>debian/rules</file>を使用し、<prgn>dh</prgn>コマンドでパッケージングされたパッケージは、<tt>clean</tt>ターゲットに関するDebian ポリシーを満たすために、<tt>Build-Depends</tt>フィールドに"<tt>debhelper (>=7.0.50~)</tt>" を記載しなければなりません。
zh_cn: 对于所有在 <file>debian/rules</file> 文件中使用 <prgn>dh</prgn> 命令的软件包，必须在 <tt>Build-Depends</tt> 中包含 <tt>debhelper (>=7.0.50~)</tt> 以满足 Debian Policy 中对 <tt>clean</tt> target 的要求。
zh_tw: 對於所有在 <file>debian/rules</file> 檔案中使用 <prgn>dh</prgn> 命令的套件，必須在 <tt>Build-Depends</tt> 中包含 <tt>debhelper (>=7.0.50~)</tt> 以滿足 Debian Policy 中對 <tt>clean</tt> target 的要求。
