Repository: lurdan/trans-ddp
Catalog: refcard/po4a/*.po
Languages: da, de, el, eu, it, nb, nl, pt_br

source: apt-cache rdepends <replaceable>package-names</replaceable>
nl: apt-cache rdepends <replaceable>pakketnamen</replaceable>

source: List all packages that need the one given.
da: Vis alle pakker der behøver denne pakke.
de: Listet alle Pakete auf, die selbst ein bestimmtes Paket benötigen.
el: Εμφάνιση όλων των πακέτων που χρειάζονται το συγκεκριμένο πακέτο.
eu: Zerrendatu emandako paketea behar duten paketeen zerrenda.
it: Mostra tutti i pacchetti che dipendono da quello indicato.
nl: Toon lijst afhankelijke pakketten voor opgegeven pakket.
pt_br: Lista todos os pacotes que dependem de um pacote.

source: Update content listings from package repositories, see <command>apt-get update</command>
da: Opdater indholdslisten fra installations-kilder, se <command>apt-get update</command>
de: Aktualisiert die Inhaltsdatenbank der Paketrepositorien, siehe <command>apt-get update</command>.
el: Ανανέωση των λιστών περιεχομένου από τα αποθετήρια των πακέτων, δείτε την εντολή <command>apt-get update</command>
eu: Eguneratu pakete biltegien edukien zerrendak, <command>apt-get update</command> ikusi
it: Aggiorna gli elenchi dai repository di pacchetti, si veda anche <command>apt-get update</command>
nb: Oppdater innholdslista fra installasjonskilder, se <command>apt-get update</command>
nl: Ververs de inhoudsopgaven van de pakketlijsten, zie <command>apt-get update</command>.
pt_br: Atualiza listagens dos conteúdos de um repositório de pacotes, veja <command>apt-get update</command>

source: apt-file search <replaceable>file-name</replaceable>
nl: apt-file search <replaceable>bestandsnaam</replaceable>

source: Search packages for file.
da: Søg i pakker efter fil.
de: Durchsucht Pakete nach Dateien.
el: Αναζήτηση πακέτων για συγκεκριμένο αρχείο.
eu: Bilatu fitxategia paketeetan.
it: Cerca i pacchetti per file.
nb: Søker i pakker etter fil.
nl: Doorzoek pakketten voor bestand.
pt_br: Procura por um arquivos em pacotes.

source: apt-file list <replaceable>package-name</replaceable>
nl: apt-file list <replaceable>pakketnaam</replaceable>

source: List contents of a package.
da: Vis indholdet af pakke.
de: Listet den Inhalt eines Paketes auf.
el: Εμφάνιση των περιεχομένων ενός πακέτου.
eu: Zerrendatu paketearen edukia.
it: Mostra il contenuto di un pacchetto.
nb: Viser innholdet av pakke.
nl: Toon lijst van bestanden in pakket.
pt_br: Lista o conteúdo de um pacote.

source: Installs packages automatically if needed, can replace <command>apt-file</command>, needs <literal>auto-apt</literal>.
da: Installer pakker automatisk hvis de behøves, kan erstatte <command>apt-file</command>, behøver <literal>auto-apt</literal>.
de: Installiert automatisch Pakete bei Bedarf. Alternative zu <literal>apt-file</literal>, benötigt <literal>auto-apt</literal>.
el: Εγκαθιστά αυτόματα πακέτα αν χρειάζεται, μπορεί να αντικαταστήσει το <command>apt-file</command>, χρειάζεται το <literal>auto-apt</literal>.
eu: Paketeak automatikoki instalatu behar izanez gero, <command>apt-file</command> ordeztu dezake, <literal>auto-apt</literal> behar du.
it: Installa pacchetti automaticamente se richiesti , può sostituire <command>apt-file</command>, richiede <literal>auto-apt</literal>.
nb: Installerer pakker automatisk hvis de kreves, kan erstatte <command>apt-file</command>, behøver <literal>auto-apt</literal>.
nl: Installeer pakketten automatisch indien nodig, kan <command>apt-file</command> vervangen. Vereist <literal>auto-apt</literal>.
pt_br: Instala pacotes automaticamente conforme necessário, pode substituir <command>apt-file</command>, precisa de <literal>auto-apt</literal>.

source: Console interface to APT, needs <literal>aptitude</literal>.
da: Konsolgrænseflade til APT, behøver <literal>aptitude</literal>.
de: Konsolenschnittstelle zu APT, benötigt <literal>aptitude</literal>.
el: Διεπαφή κονσόλας για το APT, χρειάζεται το <literal>aptitude</literal>.
eu: APT kontsola interfazea. <literal>aptitude</literal> behar du.
it: Interfaccia per console ad APT, richiede <literal>aptitude</literal>.
nb: Konsollgrensesnitt til APT, krever <literal>aptitude</literal>.
nl: Console interface naar APT. Vereist <literal>aptitude</literal>.
pt_br: Interface de console para o APT, precisa de <literal>aptitude</literal>.

source: GUI interface to APT, needs <literal>synaptic</literal>.
da: GUIgrændeflade til APT, behøver <literal>synaptic</literal>.
de: Graphische Schnittstelle zu APT, benötigt <literal>synaptic</literal>.
el: Γραφική διεπαφή για το APT, χρειάζεται το <literal>synaptic</literal>.
eu: APT interfaze grafikoa, <literal>synaptic</literal> behar du.
it: Interfaccia grafica ad APT, richiede <literal>synaptic</literal>.
nb: GUI-grensesnitt til APT, krever <literal>synaptic</literal>.
nl: Grafische interface naar APT. Vereist <literal>synaptic</literal>.
pt_br: Interface GUI para o APT, precisa de <literal>synaptic</literal>.

source: dpkg -l <optional><replaceable>names</replaceable></optional>
nl: dpkg -l <optional><replaceable>pakketnamen</replaceable></optional>

source: List packages.
da: Vis pakker.
de: Listet Pakete auf.
el: Εμφάνιση λίστας πακέτων.
eu: Zerrendatu paketeak.
it: Elenca i pacchetti.
nb: Viser pakker.
nl: Toon pakketten.
pt_br: Lista pacotes.

source: Show package information.
da: Vis pakkeinformation.
de: Zeigt Paketinformationen.
el: Εμφάνιση πληροφοριών για το πακέτο.
eu: Ikusi pakete argibideak.
it: Mostra informazioni sul pacchetto.
nb: <glossterm>kill <optional><replaceable>-9</replaceable></optional> <replaceable>nummer</replaceable></glossterm>
nl: Toon pakketinformatie.
pt_br: Mostra informações do pacote.

source: List contents of package file.
da: Vis indholdet af pakkefilen.
de: Listet den Inhalt einer Paketdatei auf.
el: Εμφάνιση περιεχομένων ενός αρχείου πακέτου.
eu: Zerrendatu pakete fitxategiaren edukiak.
it: Mostra il contenuto del pacchetto.
nb: Viser innholdet av pakkefilen.
nl: Toon inhoud van pakketbestand.
pt_br: Lista conteúdo de pacotes.

source: dpkg -S <replaceable>filename</replaceable>
nl: dpkg -S <replaceable>bestandsnaam</replaceable>

source: Show which package a file belongs to.
da: Vis hvilken pakke filen tilhører.
de: Zeigt, zu welchem Paket eine Datei gehört.
el: Δείχνει σε ποιο πακέτο ανήκει ένα συγκεκριμένο αρχείο.
eu: Begiratu zein paketekoa den fitxategia.
it: Mostra da quale pacchetto proviene un file.
nb: Viser hvilken pakke fila tilhører.
nl: Toon bij welk pakket een bestand hoort.
pt_br: Mostra a qual pacote o arquivo pertence.

source: Install package files.
da: Installer pakkefilen.
de: Installiert Paketdateien.
el: Εγκατάσταση των αρχείων ενός πακέτου.
eu: Instalatu pakete fitxategiak. instalatu.
it: Installa i pacchetti indicati.
nb: Installerer pakkefiler.
nl: Installeer pakketbestand.
pt_br: Instala pacotes.

source: Audit check sums of installed packages, needs <literal>debsums</literal>.
da: Bekræft checksummer for de installerede pakker, behøver <literal>debsums</literal>.
de: Prüft die Check-Summen installierter Pakete, benötigt <literal>debsums</literal>.
el: Έλεγχος αυθεντικότητας των check sums των εγκατεστημένων πακέτων, χρειάζεται το <literal>debsums</literal>.
eu: Instalaturik dauden paketeen egiaztapen batuketak arakatu, <literal>debsums</literal> behar du.
it: Verifica il check-sum dei pacchetti installati, richiede <literal>debsums</literal>.
nb: Gransk sjekksummer for installerte pakker, krever <literal>debsums</literal>.
nl: Controleer de controlesom van geïnstalleerde pakketten. Vereist <literal>debsums</literal>.
pt_br: Audita as somas de verificação ("checksums") de pacotes instalados, precisa de <literal>debsums</literal>.

source: dpkg-divert <optional>options</optional> <replaceable>file</replaceable>
nl: dpkg-divert <optional>opties</optional> <replaceable>bestand</replaceable>

source: Override a package&apos;s version of a file.
da: Tilsidesæt en pakkes version af en fil.
de: Aufheben der Version einer Datei eines Paketes.
el: Υπερκερασμός της έκδοσης του αρχείου ενός πακέτου&apos;.
eu: Aldatu pakete baten fitxategiaren bertsioa.
it: Cambia la locazione del file di un pacchetto.
nb: Overstyrer en pakkes versjon av en fil.
nl: Dwing installatie van gegeven versie af.
pt_br: Substitui uma versão de pacote de um arquivo.

source: Compare version numbers, check with <command>echo $?</command>.
da: Sammenlign versionsnumre, check med <command>echo $?</command>.
de: Vergleicht zwei Versionsnummern, Ergebnis mit <command>echo $?</command>.
el: Σύγκριση αριθμών εκδόσεων, έλεγχος με την εντολή <command>echo $?</command>.
eu: Bertsio zenbakiak parekatu, <command>echo $?</command> erabiliaz egiaztatu.
it: Confronta numeri di versione, controllare con <command>echo $?</command>.
nb: Sammenligner versjonsnumre, sjekk med <command>echo $?</command>.
nl: Vergelijk versienummers, controleer met <command>echo $?</command>.
pt_br: Compara os números de versão, verifique com <command>echo $?</command>.

source: dpkg-query -W <literal>--showformat</literal>=<replaceable>format</replaceable>
nl: dpkg-query -W <literal>--showformat</literal>=<replaceable>formaat</replaceable>

source: Query installed packages, format e.g. '${Package} ${Version} ${Installed-Size}\n'.
da: Forespørgsel på installerede pakker, format eks. '${Package} ${Version} ${Installed-Size}\n'.
de: Abfrage über installierte Pakete, Format-Bsp.: '${Package} ${Version} ${Installed-Size}\n'.
el: Έρευνα εγκατεστημένων πακέτων, με την μορφή πχ. '${Package} ${Version} ${Installed-Size}\n'.
eu: Instalaturiko paketeak arakatu emandako formatuan adib. '${Package} ${Version} ${Installed-Size}\n'.
it: Elenca pacchetti installati in formato personalizz., es.:'${Package} ${Version} ${Installed-Size}\n'.
nb: Spør installerte pakker, format f.eks. '${Package} ${Version} ${Installed-Size}\n'.
nl: Zoek geïnstalleerde pakketten, formaat bv. '${Package} ${Version} ${Installed-Size}\n'.
pt_br: Consulta pacotes instalados, formato e.g. '${Package} ${Version} ${Installed-Size}\n'.

source: dpkg <literal>--get-selections</literal> &gt; <replaceable>file</replaceable>
nl: dpkg <literal>--get-selections</literal> &gt; <replaceable>bestand</replaceable>

source: Write package selections to file.
da: Skriv pakkevalg til fil.
de: Schreibt Paketauswahl in Datei.
el: Εγγραφή των επιλογών πακέτων σε αρχείο.
eu: Idatzi fitxategi aukeraketa fitxategi batetan.
it: Scrive, su file, l'elenco dei pacchetti installati nel sistema.
nb: Skriver pakkevalg til fil.
nl: Schrijf pakketenselectie naar bestand.
pt_br: Escreve a seleção de pacotes em um arquivo.

source: dpkg <literal>--set-selections</literal> &lt; <replaceable>file</replaceable>
nl: dpkg <literal>--set-selections</literal> &lt; <replaceable>bestand</replaceable>

source: Set package selections from file.
da: Hent pakkevalg fra fil.
de: Setzt Paketauswahl aus Datei.
el: Καθορισμός επιλογής πακέτων από ένα αρχείο.
eu: Ezarri pakete aukeraketa fitxategi batetik.
it: Importa da un file l'elenco dei pacchetti da installare.
nb: Sett pakkevalg fra fil.
nl: Selecteer pakketten uit bestand.
pt_br: Seta uma seleção de pacotes a partir de um arquivo.

source: The Network
da: Netværket
de: Das Netzwerk
el: Το Δίκτυο
eu: Sarea
it: Rete
nb: Nettverket
nl: Het netwerk
pt_br: A Rede

source: Network interface configuration.
da: Konfiguration af netværk.
de: Netzwerkkonfiguration.
el: Ρύθμιση της διεπαφής δικτύου.
eu: Sare interfaze konfigurazioa.
it: Configurazione dell'interfaccia di rete.
nl: Configuratie van netwerkinterface.
pt_br: Configuração de interface de rede.

source: Start, stop network interfaces according to files above.
da: Start, stop netværksgrænseflader beskrevet i filerne ovenover.
de: Starten, stoppen von Schnittstellen entsprechend obiger Dateien.
el: Εκκίνηση, τερματισμός δικτυακών διεπαφών σύμφωνα με τα παραπάνω αρχεία.
eu: Goiko fitxategian ezarririk dauden erara sare interfazeak abiarazi edo gelditu.
it: Attiva, disattiva una interfaccia di rete, secondo i parametri dei file precedenti.
nb: Start, stopp nettverksgrensesnitt i følge filene ovenfor.
nl: Start of stop netwerkinterfaces volgens de bovengenoemde bestanden.
pt_br: Inicia, pára interfaces de rede de acordo com os arquivos acima.

source: Show and manipulate network interfaces and routing, needs <literal>iproute</literal>.
da: Vis og kontroller netværksgrænseflader og rutning, behøver <literal>iproute</literal>.
de: Zeigt und manipuliert Netzwerkschnittstellen und Routing, benötigt <literal>iproute</literal>.
el: Εμφάνιση και χειρισμός δικτυακών διεπαφών και δρομολόγησης, χρειάζεται το <literal>aptitude</literal>.
eu: Ikusi eta aldatu sare interfazea eta bideak, <literal>iproute</literal> behar du.
it: Mostra e modifica le interfacce di rete ed il routing, richiede <literal>iproute</literal>.
nl: Toon en bewerk nerwerkinterfaces en routes. Vereist <literal>iproute</literal>.
pt_br: Exibe e manipula interfaces de rede e roteamento, necessita <literal>iproute</literal>.

source: Login at other machine.
da: Login på andre maskiner.
de: Login auf einem anderen Rechner.
el: Είσοδος σε ένα άλλο μηχάνημα.
eu: Beste makina batetan saioa hasi.
it: Esegue il login su un'altra macchina.
nb: Logg inn på andre maskiner.
nl: Inloggen op andere computer.
pt_br: Login em outra máquina.

source: scp <replaceable>files</replaceable> <replaceable>user@host:path</replaceable>
nl: scp <replaceable>bestanden</replaceable> <replaceable>user@host:path</replaceable>

source: Copy files to other machine (and vice versa).
da: Kopier filer til andre maskiner (og omvendt).
de: Dateien zwischen Rechnern kopieren.
el: Αντιγραφή αρχείων σε ένα άλλο μηχάνημα (και αντίστροφα).
eu: Kopiatu fitxategiak beste makina batetara (eta alderantziz).
it: Copia file su un'altra macchina (e viceversa).
nb: Kopierer filer til andre maskiner (og omvendt).
nl: Kopiëer bestanden naar een ander computer (en andersom).
pt_br: Copia arquivos para outra máquina (e vice-versa).

source: Configuration files.
da: Konfigurationsfiler.
de: Konfigurationsdateien.
el: Αρχεία ρύθμισης.
eu: Konfigurazio fitxategiak.
it: File di configurazione.
nb: Konfigurasjonsfiler.
nl: Configuratiebestanden.
pt_br: Arquivos de configuração.

source: Contains virtual hosts. To enable a virtual host, use <command>a2ensite</command>.
da: Indeholder tilgængelige websteder. Aktivering sker med kommandoen <command>a2ensite</command>.
de: Enthält verfügbare virtuelle Hosts. Um einen virtuellen Host zu aktivieren, verwenden Sie <command>a2ensite</command>.
el: Περιέχει εικονικούς εξυπηρετητές. Για να ενεργοποιήσετε έναν εικονικό εξυπηρετητή χρησιμοποιήστε την εντολή <filename>a2ensite</filename>.
eu: Ostalari birtualak ditu. Ostalari birtual bat gaitzeko, <command>a2ensite</command>.
it: Contiene gli host virtuali. Per attivarne uno, usare <command>a2ensite</command>.
nl: Bevat virtuele servernamen. Om een servernaam te activeren, gebruik <command>a2ensite</command>.
pt_br: Contém hosts virtuais. Para habilitar um host virtual, use <command>a2ensite</command>.

source: Contains available modules files. To enable a module, use <command>a2enmod</command>.
da: Indeholder tilgængelige moduler. Aktivering sker med kommandoen <command>a2enmod</command>.
de: Enthält verfügbare Moduldateien. Um ein Modul zu aktivieren, benutzen Sie <command>a2enmod</command>.
el: Περιέχει τα αρχεία των διαθέσιμων αρθρωμάτων. Για να ενεργοποιήσετε ένα άρθρωμα, χρησιμοποιήστε την εντολή <filename>a2enmod</filename>.
eu: Eskuragarri dauden modulu fitxategiak. Modulu bat gaitu nahi ezkero sortu esteka sinboliko bat <filename>/etc/apache2/mods-enabled/</filename>-en barnean.
it: Contiene i moduli disponibili. Per attivarne uno, usare <command>a2enmod</command>.
nl: Bevat beschikbare modulebestanden. Om een module te activeren, gebruik <command>a2enmod</command>.
pt_br: Contém os arquivos de módulo disponíveis. Para ativar um módulo, use <command>a2enmod</command>.

source: File and Print Server (Samba)
da: Fil- og udskriftsserver (Samba)
de: Datei- und Druck-Server (Samba)
el: Εξυπηρετητής αρχείων και εκτύπωσης (Samba)
eu: Fitxategi eta inprimagailu zerbitzaria (Samba)
it: File e Print Server (Samba)
nb: Fil- og utskriftstjener (Samba)
nl: Bestands- en printserver (Samba)
pt_br: Servidor de Arquivos e Impressão (Samba)

source: Main configuration file.
da: Hovedkonfigurationsfil.
de: Hauptkonfigurationsdatei.
el: Κύριο αρχείο ρύθμισης.
eu: Konfigurazio fitxategi orokorra.
it: Principale file di configurazione.
nb: Hovedkonfigurasjonsfil.
nl: Belangrijkste configuratiebestand.
pt_br: Arquivo principal de configuração.

source: Browse SMB network resources, e.g. download, upload files.
da: Browse SMB netværk resourcer, f.eks. download, upload filer.
de: SMB-Netzwerk-Ressourcen durchstöbern, z.B. Dateien hoch- oder runterladen.
el: Περιήγηση των πόρων του δικτύου SMB, πχ. κατεβάστε και ανέβάστε αρχεία.
eu: SMB sare baliabideak nabigatu, adib. fitxategiak deskargatu edo igo.
it: Mostra le risorse SMB della rete, es. download, upload file.
nb: Utforsk SMB-nettverkressurser, f.eks. nedlasting, opplasting av filer.
nl: Bladeren SMB netwerkbronnen, bv. bestanden downloaden/uploaden.
pt_br: Acessa recursos de rede SMB, e.g. download, upload de arquivos.

source: Your Name ("Language")
da: Anders Wegge Keller (Dansk)
de: A. Schmehl/W. Martin Borgert (Deutsch)
el: Emmanuel Galatoulas (Greek)
eu: Piarres Beobide (Euskara)
it: J. Haggi (Italian)
nb: Hans Fredrik Nordhaug (Norsk bokmål)
pt_br: Eder L. Marques (Brazilian Portuguese)

source: This document may be used under the terms the GNU General Public License version 3 or higher. Conditions for copying and translations can be found at <ulink url="http://xinocat.com/refcard/"> <literal>http://xinocat.com/refcard/</literal></ulink>, where you can always get the latest version of the reference card.
da: Dette dokument må benyttes under betingelserne i GNU General Public License, version 3 eller nyere. Betingelserne for kopiering og oversættelse finde på <ulink url="http://xinocat.com/refcard/"> <literal>http://xinocat.com/refcard/</literal></ulink>, hvorfra den nyeste version af referencekortet også kan hentes.
eu: Dokumentu hau GNU publikoarentzako lizentzi orokorraren 2. bertsioak ezartzen dituen baldintzetan erabili behar da. Kopiatze eta itzulpen baldintzak <ulink url="http://xinocat.com/refcard/"> <literal>http://xinocat.com/refcard/</literal></ulink>-en, aurki ditzakezu erreferentzi txartelaren azken bertsioa bezalaxe.

source: Bugs
da: Fejl
de: Fehler
el: Σφάλματα
eu: Programa-erroreak
it: Bachi
nb: Feil

source: After changing <filename>/boot/grub/menu.lst</filename>.
da: Efter ændring af <filename>/boot/grub/menu.lst</filename>.
de: Nach Änderung der Datei <filename>/boot/grub/menu.lst</filename>.
el: Μετά την αλλαγή του αρχείου <filename>/boot/grub/menu.lst</filename>.
eu: <filename>/boot/grub/menu.lst</filename> aldatu ondoren.
it: Dopo cambiamenti a <filename>/boot/grub/menu.lst</filename>.
pt_br: Após alterar <filename>/boot/grub/menu.lst</filename>.

source: Web Server (Apache2)
eu: Web Zerbitzaria (Apache2)
it: Server Web (Apache2)
nb: Nettjener (Apache2)
pt_br: Servidor Web (Apache2)

source: This document may be used under the terms the GNU General Public License version 3 or higher. Conditions for copying and translations can be found at <ulink url="http://www.tangosoft.com/refcard/"> <literal>http://www.tangosoft.com/refcard/</literal></ulink>, where you can always get the latest version of the reference card.
el: Το κείμενο αυτό μπορεί να χρησιμοποιηθεί κάτω από τους όρους της GNU General Public License έκδοση 3 ή μεταγενέστερη. Οι όροι για την αντιγραφή ή τη μετάφρασή του μπορούν να βρεθούν στο <ulink url="http://www.tangosoft.com/refcard/"> <literal>http://www.tangosoft.com/refcard/</literal></ulink>, όπου μπορείτε πάντα να βρείτε την πιο πρόσφατη έκδοση αυτής της κάρτας αναφοράς.

source: This document may be used under the terms the GNU General Public License version 3 or higher. Conditions for copying and translations can be found at <ulink url="http://tangosoft.com/refcard/"> <literal>http://tangosoft.com/refcard/</literal></ulink>, where you can always get the latest version of the reference card.
de: Dieses Dokument kann unter den Bedingungen der GNU General Public License Version 3 oder höher genutzt werden. Die Bedingungen zur Weitergabe und Übersetzung können Sie unter <ulink url="http://tangosoft.com/refcard/"> <literal>http://tangosoft.com/refcard/</literal></ulink> einsehen, wo es auch die jeweils aktuelle Version dieser Referenzkarte gibt.
pt_br: Este documento pode ser utilizado sob os termos da Licença Pública Geral do GNU, versão 3 ou superior. Condições para cópia e tradução podem ser encontradas em <ulink url="http://tangosoft.com/refcard/"> <literal>http://tangosoft.com/refcard/</literal></ulink>, onde você pode sempre conseguir a mais nova versão do cartão de referência.

source: W. Martin Borgert
de: W. Martin Borgert (English)

source: This document may be used under the terms the GNU General Public License version 3 or higher. Conditions for copying and translations can be found at <ulink url="http://www.xinocat.com/refcard/"> <literal>http://www.xinocat.com/refcard/</literal></ulink>, where you can always get the latest version of the reference card.
it: Questo documento può essere usato secondo le condizioni della GNU General Public License ver.3 o successive. Le condizioni per la copia e la traduzione sono reperibili qui: <ulink url="http://xinocat.com/refcard/"> <literal>http://xinocat.com/refcard/</literal></ulink>, dove è possibile anche trovare l'ultima versione di questa reference card.
nb: Dette dokumentet kan brukes i henhold til vilkårene i GNU General Public License versjon 3 eller nyere. Vilkårene for kopiering og oversetting fins på <ulink url="http://www.xinocat.com/refcard/"> <literal>http://www.xinocat.com/refcard/</literal></ulink>, hvor du alltid finner siste versjon av referansekortet.

source: Create and install third-party modules (nvidia, ...), needs <literal>module-assistant</literal>.
it: Crea ed installa moduli di terze parti (nvidia, ...), richiede da <literal>module-assistant</literal>.
nb: Opprett og installer tredjeparts moduler (nvidia, ...), krever <literal>module-assistant</literal>.
