Repository: lurdan/trans-ddp
Catalog: refcard/po4a/*.po
Languages: da, de, el, eu, it, nb, nl, pt_br

source: Default values for many daemons and services.
da: Standardværdier for mange dæmoner og servicer.
de: Standardwerte für viele Daemonen und Dienste.
el: Προκαθορισμένες τιμές για πολλούς δαίμονες και υπηρεσίες.
eu: Zerbitzu eta deabru gehienen lehenetsiriko balioak.
it: I valori di default per molti demoni e servizi.
nb: Standardverdier for mange nisser og tjenere.
nl: Standaardwaarden voor veel achtergronddiensten en voorzieningen.
pt_br: Valores padrão para vários daemons e serviços.

source: Important Shell Commands
da: Vigtige skal komandoer
de: Wichtige Shell-Kommandos
el: Σημαντικές εντολές κελύφους
eu: Shell komando garrantzizkoak
it: Importanti comandi di Shell
nb: Viktige skallkommandoer
nl: Belangrijke shell-commando&apos;s
pt_br: Comandos Importantes do Shell

source: cat <replaceable>files</replaceable>
nl: cat <replaceable>bestanden</replaceable>

source: Print files to screen.
da: Udskriv filer til skærm.
de: Ausgeben der Dateien.
el: Εκτυπώστε το περιεχόμενο αρχείων στην οθόνη.
eu: Inprimatu fitxategiak pantailan.
it: Mostra sullo schermo il contenuto dei file.
nb: Lister filenes innhold på skjermen.
nl: Toon inhoud van bestanden op scherm.
pt_br: Imprime arquivos na tela.

source: cd <replaceable>directory</replaceable>
nl: cd <replaceable>map</replaceable>

source: Change to directory.
da: Skift til mappe.
de: Wechselt das Verzeichnis
el: Αλλάξτε στον κατάλογο.
eu: Aldatu direktoriora.
it: Cambia directory.
nb: Skifter til mappe.
nl: Ga naar map.
pt_br: Muda para o diretório.

source: cp <replaceable>files</replaceable> <replaceable>dest</replaceable>
nl: cp <replaceable>bestanden</replaceable> <replaceable>doellocatie</replaceable>

source: Copy files and directories.
da: Kopier filer og mapper.
de: Kopiert Dateien und Verzeichnisse.
el: Αντιγράψτε αρχεία και καταλόγους.
eu: Kopiatu fitxategi eta direktorioak.
it: Copia file e directory.
nb: Kopierer filer og mapper.
nl: Kopiëer bestanden en mappen.
pt_br: Copia arquivos e diretórios.

source: echo <replaceable>string</replaceable>
nl: echo <replaceable>tekenreeks</replaceable>

source: Echo string to screen.
da: Skriver strengen til skærmen.
de: Ausgabe des Textes.
el: Ηχώ της συμβολοσειράς στην οθόνη.
eu: Katea pantailan erakutsi.
it: Stampa la stringa sullo schermo.
nb: Sender teksten til skjermen.
nl: Toon tekenreeks op scherm.
pt_br: Escreve string na tela.

source: gzip, bzip2 <optional><literal>-d</literal></optional> <replaceable>files</replaceable>
nl: gzip, bzip2 <optional><literal>-d</literal></optional> <replaceable>bestanden</replaceable>

source: Compress, uncompress files.
da: Komprimer, dekomprimer filer.
de: Komprimiert, dekomprimiert Dateien.
el: Συμπίεση, αποσυμπίεση αρχείων.
eu: Konprimitu eta deskonprimitu fitxategiak.
it: Comprime, decomprime i file.
nb: Komprimerer, dekomprimerer filer.
nl: Comprimeer, decomprimeer bestanden.
pt_br: Compacta, descompacta arquivos.

source: pager <replaceable>files</replaceable>
nl: pager <replaceable>bestanden</replaceable>

source: Show contents of files.
da: Vis indholdet af filer.
de: Zeigt den Inhalt von Dateien.
el: Εμφάνιση του περιεχομένου αρχείων.
eu: Ikusi fitxategien edukia.
it: Mostra il contenuto dei file.
nb: Viser innholdet av filer.
nl: Toon inhoud van bestanden.
pt_br: Mostra conteúdo de arquivos.

source: ls <optional><replaceable>files</replaceable></optional>
nl: ls <optional><replaceable>map</replaceable></optional>

source: List files.
da: List filer.
de: Listet Dateien auf.
el: Παράθεση λίστας των αρχείων.
eu: Zerrendatu fitxategiak.
it: Elenca i file.
nb: Lister filer.
nl: Toon lijst van bestanden in map.
pt_br: Lista arquivos.

source: mkdir <replaceable>directory-names</replaceable>
nl: mkdir <replaceable>map</replaceable>

source: Create directories.
da: Opret mapper.
de: Erzeugt Verzeichnisse.
el: Δημιουργήστε καταλόγους.
eu: Sortu direktorioak.
it: Crea directory.
nb: Oppretter mapper.
nl: Maak nieuwe mappen.
pt_br: Cria diretórios.

source: mv <replaceable>file1</replaceable> <literal> </literal> <replaceable>file2</replaceable>
nl: mv <replaceable>bestand1</replaceable> <literal> </literal> <replaceable>bestand2</replaceable>

source: Move, rename files.
da: Flyt, omdøb filer.
de: Verschiebt Dateien und/oder benennt sie um.
el: Mετακινήστε, επανονομάστε αρχεία.
eu: Mugitu, berrizendatu fitxategiak.
it: Sposta, rinomina i file.
nb: Flytter, gir nytt navn til filer.
nl: Verplaats, hernoem bestanden.
pt_br: Move, renomeia arquivos.

source: rm <replaceable>files</replaceable>
nl: rm <replaceable>bestanden</replaceable>

source: Remove files.
da: Slet filer.
de: Löscht Dateien.
el: Διαγραφή αρχείων.
eu: Ezabatu fitxategiak.
it: Rimuove i file.
nb: Sletter filer.
nl: Verwijder bestanden.
pt_br: Remove arquivos.

source: rmdir <replaceable>dirs</replaceable>
nl: rmdir <replaceable>mappen</replaceable>

source: Remove empty directories.
da: Fjern tomme mapper.
de: Löscht leere Verzeichnisse.
el: Διαγραφή κενών καταλόγων.
eu: Ezabatu direktorio hutsak.
it: Rimuove le directory vuote.
nb: Fjerner tomme mapper.
nl: Verwijder lege mappen.
pt_br: Remove diretórios vazios.

source: tar <optional>c</optional><optional>x</optional><optional>t</optional><optional>z</optional><optional>j</optional> -f <replaceable>file</replaceable>.tar <literal> </literal> <optional><replaceable>files</replaceable></optional>
nl: tar <optional>c</optional><optional>x</optional><optional>t</optional><optional>z</optional><optional>j</optional> -f <replaceable>bestand</replaceable>.tar <literal> </literal> <optional><replaceable>bestanden</replaceable></optional>

source: <emphasis>C</emphasis>reate, e<emphasis>X</emphasis>tract, list <emphasis>T</emphasis>able of archive file, <emphasis>z</emphasis>, <emphasis>j</emphasis> for <filename>.gz</filename>, <filename>.bz2</filename>.
da: <emphasis>C</emphasis>reate (opret), e<emphasis>X</emphasis>tract (udpak), list <emphasis>T</emphasis>able of archive file (vis indholdet), <emphasis>z</emphasis>, <emphasis>j</emphasis> til <filename>.gz</filename>, <filename>.bz2</filename>.
de: Erzeugt (c), entpackt (x) oder listet den Inhalt (t) einer Archivdatei, z/j für .gz/.bz2.
el: <emphasis>C</emphasis>reate, e<emphasis>X</emphasis>tract, list <emphasis>T</emphasis>able συμπιεσμένων αρχείων, <emphasis>z</emphasis>, <emphasis>j</emphasis> για <filename>.gz</filename>, <filename>.bz2</filename>.
eu: <emphasis>(C)</emphasis>sortu, <emphasis>(X)</emphasis>atera, <emphasis>(T)</emphasis> fitxategi taula bistarazi, <emphasis>z</emphasis>, <emphasis>j</emphasis> <filename>.gz</filename>, <filename>.bz2</filename>-rentzat.
it: <emphasis>C</emphasis>rea, e<emphasis>X</emphasis>trae, mostra il con<emphasis>T</emphasis>enuto di un file archivio, <emphasis>z</emphasis>, <emphasis>j</emphasis> per <filename>.gz</filename>, <filename>.bz2</filename>.
nb: <emphasis>c</emphasis>=opprett, <emphasis>x</emphasis>=pakk ut, <emphasis>t</emphasis>=list filer, i en arkivfil. Bruk <emphasis>z</emphasis> <filename>.gz</filename> og <emphasis>j</emphasis> for <filename>.bz2</filename>.
nl: Creëer (<emphasis>c</emphasis>), pak uit (<emphasis>x</emphasis>), maak inhoudsopgave van archief-bestand (<emphasis>t</emphasis>), <emphasis>z</emphasis> en <emphasis>j</emphasis> voor <filename>.gz</filename> en <filename>.bz2</filename>.
pt_br: <emphasis>C</emphasis>ria, e e<emphasis>x</emphasis>trai, lista a <emphasis>T</emphasis>abela de arquivos agrupados, <emphasis>z</emphasis>, <emphasis>j</emphasis> para <filename>.gz</filename>, <filename>.bz2</filename>.

source: find <replaceable>directories expressions</replaceable>
nl: find <replaceable>mappen termen</replaceable>

source: Find files like <literal>-name <replaceable>name</replaceable></literal> or <literal>-size <replaceable>+1000</replaceable></literal>, etc.
da: Find filer som <literal>-name <replaceable>navn</replaceable></literal> eller <literal>-size</literal>(størrelse)<literal> <replaceable>+1000</replaceable></literal>, osv.
de: Findet passende Dateien (z.B. <literal>-name <replaceable>name</replaceable></literal> oder <literal>-size <replaceable>+1000</replaceable></literal>)
el: Βρείτε αρχεία που ταιριάζουν στο <literal>-name <replaceable>όνομα</replaceable></literal> ή μέγεθος <literal>-size <replaceable>+1000</replaceable></literal>, κ.λπ.
eu: Fitxategiak bilatu. Adib. <literal>-name <replaceable>izena</replaceable></literal> edo <literal>-size <replaceable>+1000</replaceable></literal>, etab.
it: Trova i file con <literal>-name <replaceable>nome</replaceable></literal> o con <literal>-size <replaceable>+1000</replaceable></literal>, ecc.
nb: Finn filer som <literal>-name <replaceable>navn</replaceable></literal> eller <literal>-size</literal>(størrelse)<literal> <replaceable>+1000</replaceable></literal>, osv.
nl: Vind bestanden zoals <literal>-name <replaceable>naam</replaceable></literal> of <literal>-size <replaceable>+1000</replaceable></literal>, etc.
pt_br: Encontra arquivos como <literal>-name <replaceable>nome</replaceable></literal> ou <literal>-size <replaceable>+1000</replaceable></literal>, etc.

source: grep <replaceable>search-string</replaceable> <replaceable>files</replaceable>
nl: grep <replaceable>zoekwoord</replaceable> <replaceable>bestanden</replaceable>

source: Find search-string in files.
da: Find søge-streng i filer.
de: Findet gesuchten Text in Dateien.
el: Εύρεση αναζητούμενης-συμβολοσειράς στα αρχεία.
eu: Bilatu bilaketa katea fitxategietan.
it: Cerca la <replaceable>stringa</replaceable> nei <replaceable>file</replaceable>.
nb: Finn søketekst i filer.
nl: Vind zoekwoord in bestanden.
pt_br: Encontra uma expressão em arquivos.

source: kill <optional><replaceable>-9</replaceable></optional> <replaceable>number</replaceable>
nl: kill <optional><replaceable>-9</replaceable></optional> <replaceable>getal</replaceable>

source: Send signal to process (e.g. terminate it).
da: Send signal til process (f.eks. terminerer den).
de: Sendet Signal an Prozess (z.B. zum Beenden).
el: Στείλτε σήμα σε μια διαδικασία (πχ. τερματισμού της).
eu: Seinale bat bidali prozesu bati(adib. prozesua amaitu).
it: Manda segnali ad un processo (es. lo termina).
nb: Sender signal til prosess (f.eks. terminerer den).
nl: Zend signaal naar proces (b.v. beëindigen)
pt_br: Envia sinal para processos (e.g. finalizar).

source: ln -s <replaceable>file</replaceable> <replaceable>link</replaceable>
nl: ln -s <replaceable>bestand</replaceable> <replaceable>link</replaceable>

source: Create a symbolic link to a file.
da: Opret en symbolsk lænke til en fil.
de: Erzeugt einen symbolischen Link auf eine Datei.
el: Δημιουργία συμβολικού συνδέσμου για ένα αρχείο.
eu: Sortu fitxategi batera esteka sinboliko bat.
it: Crea un link simbolico ad un file.
nb: Lager en symbolsk lenke til en fil.
nl: Creëer een symbolische koppeling naar een bestand.
pt_br: Cria uma ligação simbólica para um arquivo.

source: ps <optional><replaceable>options</replaceable></optional>
nl: ps <optional><replaceable>opties</replaceable></optional>

source: Show current processes.
da: Vis nuværende processer.
de: Zeigt aktuelle Prozesse.
el: Εμφάνιση τρεχουσών διαδικασιών.
eu: Ikusi martxan dauden prozesuak.
it: Mostra i processi correnti.
nb: Viser nåværende prosesser.
nl: Laat lopende processen zien.
pt_br: Mostra processos atuais.

source: su - <optional><replaceable>username</replaceable></optional>
nl: su - <optional><replaceable>gebruikersnaam</replaceable></optional>

source: Become another user, e.g. <literal>root</literal>.
da: Bliv en anden bruger, f.eks. <literal>root</literal>.
de: Zu einem anderen Benutzer werden, z.B. <literal>root</literal>.
el: Γίνετε ένας άλλος χρήστης, πχ. <literal>root</literal>.
eu: Beste erabiltzaile batean bihurtu, adib. <literal>root</literal>.
it: Diventare un'altro utente, es. <literal>root</literal>.
nb: Blir en annen bruker, f.eks. <literal>root</literal>.
nl: Word een andere gebruiker (b.v. <literal>root</literal>).
pt_br: Tornar-se outro usuário, e.g. <literal>root</literal>.

source: sudo <replaceable>command</replaceable>
nl: sudo <replaceable>commando</replaceable>

source: Execute a command as <literal>root</literal> as normal user, see <filename>/etc/sudoers</filename>
da: Udfør en komando som <literal>root</literal> som normal bruger, se <filename>/etc/sudoers</filename>
de: Führt als normaler Benutzer ein Kommando als <literal>root</literal> aus, siehe <filename>/etc/sudoers</filename>
el: Εκτελέστε μια εντολή του χρήστη <literal>root</literal> ενώ είστε απλός χρήστης, δείτε το <filename>/etc/sudoers</filename>
eu: Erabiltzaile arruntaz komando bat <literal>root</literal> gisa abiarazi, begiratu <filename>/etc/sudoers</filename>
it: Esecuzione di un comando come <literal>root</literal> da parte di un utente normale, si veda <filename>/etc/sudoers</filename>.
nb: Utfører en kommando som <literal>root</literal> som normal bruker, se <filename>/etc/sudoers</filename>
nl: Voer commando uit met <literal>root</literal>-rechten als normale gebruiker, zie <filename>/etc/sudoers</filename>.
pt_br: Executa um comando como <literal>root</literal> sendo um usuário normal, veja <filename>/etc/sudoers</filename>.

source: <replaceable>command</replaceable> <literal>&gt;</literal> <replaceable>file</replaceable>
nl: <replaceable>commando</replaceable> <literal>&gt;</literal> <replaceable>bestand</replaceable>

source: Overwrite file with output of command.
da: Overskriv filen med output fra komandoen.
de: Überschreibt Datei mit Ausgabe des Kommandos.
el: Υπερεγγραφή ενός αρχείου από την έξοδο μιας εντολής.
eu: Gainidatzi fitxategia komandoaren irteeraz.
it: Sovrascrive il file con l'output del comando.
nb: Overskriver fila med utdata fra kommandoen.
nl: Overschrijf bestand met uitvoer van commando.
pt_br: Sobrescreve arquivo com a saída do comando.

source: <replaceable>command</replaceable> <literal>&gt;&gt;</literal> <replaceable>file</replaceable>
nl: <replaceable>commando</replaceable> <literal>&gt;&gt;</literal> <replaceable>bestand</replaceable>

source: Append output of command to file.
da: Tilføj output fra komandoen til filen.
de: Fügt Ausgabe des Kommandos an Datei an.
el: Επιπρόσθεση της εξόδου μιας εντολής σε αρχείο.
eu: Gehitu komando irteera fitxategira.
it: Aggiunge l'output del comando alla fine del file.
nb: Legger til utdata fra kommandoen til fila.
nl: Voeg uitvoer commando toe aan bestand.
pt_br: Adiciona saída do comando a arquivo.

source: Use output of command 1 as input of command 2.
da: Brug output fra komando1 som input til komando2.
de: Benutzt Ausgabe von Kommando 1 als Eingabe von Kommando 2.
el: Χρήση της εξόδου της εντολής 1 ως εισόδου της εντολής 2.
eu: Erabili 1 komandoaren irteera 2 komandoaren sarrera bezala.
it: Utilizza l'output di cmd1 come input di cmd2.
nb: Bruker utdata fra kommando1 som inndata til kommando2.
nl: Gebruik uitvoer commando 1 als invoer commando 2.
pt_br: Usa a saída do comando 1 como entrada do comando 2.

source: <replaceable>command</replaceable> <literal>&lt;</literal> <replaceable>file</replaceable>
nl: <replaceable>commando</replaceable> <literal>&lt;</literal> <replaceable>bestand</replaceable>

source: Use file as input for command.
da: Brug filen som input til komando.
de: Benutzt Datei als Eingabe für Kommando.
el: Χρήση ενός αρχείου ως εισόδου μιας εντολής.
eu: Erabili fitxategia komandoaren sarrera bezala.
it: Utilizza un file come input per un comando.
nb: Bruker fila som inndata til kommando.
nl: Gebruik bestand als invoer voor commando.
pt_br: Usa arquivo como entrada para comando.

source: Update packages listings from package repositories as listed in <filename>/etc/apt/sources.list</filename>. Required whenever that file or the contents of the repositories change.
da: Opdaterer pakkelister fra installations-kilder som står i <filename>/etc/apt/sources.list</filename>. Kør, hvis indholdet af en af installations-kilderne har ændret sig, eller hvis du ikke er sikker.
de: Aktualisiert die Datenbank der vorhandenen Pakete aus den in <filename>/etc/apt/sources.list</filename> aufgelisteten Repositorien. Erforderlich, wenn der Inhalt der Repositorien oder die Datei selbst verändert wurde.
el: Ανανέωση της λίστας των πακέτων από τα αποθετήρια όπως αναγράφονται στο αρχείο <filename>/etc/apt/sources.list</filename>. Απαιτείται όποτε αλλάζει το αρχείο αυτό ή τα περιεχόμενα των αποθετηρίων.
eu: Pakete zerrenda <filename>/etc/apt/sources.list</filename> fitxategian ezartzen den biltegietatik eguneratu. Biltegi bat aldatu bada, edo ziur ez egonez gero abiarazi.
it: Aggiorna l'elenco dei pacchetti dai repository di pacchetti indicati in <filename>/etc/apt/sources.list</filename>. Necessario quando il file o il contenuto dei repository sono cambiati.
nl: Download de nieuwe pakketlijsten van de bronnen in het bestand <filename>/etc/apt/sources.list</filename>. Noodzakelijk als er dat bestand of de inhoud van de bronnen verandert.
pt_br: Atualiza listagem de pacotes dos repositórios de pacotes listados em <filename>/etc/apt/sources.list</filename>. Requerido sempre que o arquivo ou o conteúdo dos repositórios mudar.

source: apt-cache search <replaceable>search-string</replaceable>
nl: apt-cache search <replaceable>zoekwoord</replaceable>

source: Search packages and descriptions for <replaceable>search-string</replaceable>.
da: Søg i pakker og beskrivelser efter <replaceable>søge-streng</replaceable>.
de: Durchsucht Paketnamen und ihre Beschreibungen nach dem <replaceable>Text</replaceable>.
el: Αναζήτηση πακέτων και περιγραφών τους για τη <replaceable>συμβολοσειρά-αναζήτησης</replaceable>.
eu: Bilatu <replaceable>bilaketa-katea</replaceable> pakete izen eta azalpenetan.
it: Cerca pacchetti e descrizioni contenenti la <replaceable>stringa-di-ricerca</replaceable>.
nb: Søk i pakker og beskrivelser etter <replaceable>søketekst</replaceable>.
nl: Zoek pakketten en omschrijvingen voor <replaceable>zoekwoord</replaceable>.
pt_br: Procura pacotes e descrições para <replaceable>string--de-busca</replaceable>.

source: apt-cache policy <replaceable>package-names</replaceable>
nl: apt-cache policy <replaceable>pakketnamen</replaceable>

source: Show versions and priorities of available packages.
da: Vis version og prioritet af pakker der er til rådighed.
de: Zeigt Versionen und Prioritäten verfügbarer Pakete.
el: Εμφάνιση των εκδόσεων και της προτεραιότητας των διαθέσιμων πακέτων.
eu: Ikusi eskuragarri dauden pakete bertsio eta lehentasunak.
it: Mostra versioni e priorità dei pacchetti disponibili.
nb: Viser versjoner og prioritet for tilgjengelig pakker.
nl: Laat versies en prioriteiten van beschikbare pakketten zien.
pt_br: Mostra versões e prioridades dos pacotes disponíveis.

source: apt-cache show <replaceable>package-names</replaceable>
nl: apt-cache show <replaceable>pakketnamen</replaceable>

source: Show package information incl. description.
da: Vis pakkeinformation inklusiv beskrivelse.
de: Zeigt Paketinformationen einschließlich Beschreibung.
el: Εμφάνιση πληροφοριών των πακέτων συμπεριλαμβανομένης της περιγραφής τους.
eu: Ikusi paketearen argibideak, deskribapena barne.
it: Mostra informazioni e descrizione di un pacchetto.
nb: Viser pakkeinformasjon inkl. beskrivelse.
nl: Laat pakketinformatie inclusief omschrijving zien.
pt_br: Mostra informações sobre o pacote incluindo descrição.

source: apt-cache showpkg <replaceable>package-names</replaceable>
nl: apt-cache showpkg <replaceable>pakketnamen</replaceable>

source: Show package dependencies (needed packages).
da: Vis pakkeafhængiheder (pakker der behøves).
de: Zeigt Paketabhängigkeiten (benötigte Pakete).
el: Εμφάνιση των εξαρτήσεων των πακέτων (απαιτούμενα πακέτα).
eu: Ikusi pakete dependentziak (beharrezko paketeak).
it: Mostra le dipendenze di un pacchetto (pacchetti necessari).
nb: Viser pakkeavhengigheter (pakker som kreves).
nl: Laat pakket-afhankelijkheden zien (benodigde pakketten).
pt_br: Mostra dependências dos pacotes (pacotes necessários).

source: apt-get install <replaceable>package-names</replaceable>
nl: apt-get install <replaceable>pakketnamen</replaceable>

source: Install packages from repositories with all dependencies.
da: Installer pakke fra installations-kilder med alle afhængigheder.
de: Installiert Pakete aus den Repositorien mit allen Abhängigkeiten.
el: Εγκατάσταση πακέτων από τα αποθετήρια μαζί με όλες τις εξαρτήσεις τους.
eu: Instalatu paketeak dependentzia guztiak beteaz.
it: Installa pacchetti dai repository con tutte le dipendenze.
nb: Installerer pakke fra installasjonskilder med alle avhengigheter.
nl: Installeer pakketten vanaf de bron inclusief afhankelijkheden.
pt_br: Instala pacotes a partir dos repositórios com todas as dependências.

source: Install newest versions of all packages currently installed.
da: Installer nyeste version af alle pakke der allerede er installeret.
de: Installiert die neuesten Versionen aller derzeit installierten Pakete.
el: Εγκατάσταση των πιο πρόσφατων εκδόσεων όλων των πακέτων που είναι αυτή τη στιγμή εγκατεστημένα.
eu: Dagoeneko instalaturik dauden pakete guztien azken bertsioak instalatu.
it: Installa le versioni più recenti di tutti i pacchetti attualmente installati.
nb: Installerer nyeste versjon av alle pakker som allerede er installert.
nl: Installeer de nieuwste versie van alle pakketten die momenteel zijn geïnstalleerd.
pt_br: Instala a versão mais nova de todos os pacotes atualmente instalados.

source: Like <command>apt-get upgrade</command>, but with advanced conflict resolution.
da: Som <command>apt-get upgrade</command>, men med avanceret konfliktløsning.
de: Wie <command>apt-get upgrade</command>, aber mit erweiterter Konfliktauflösung.
el: Όπως και η <command>apt-get upgrade</command>, αλλά με προχωρημένη διευθέτηση συγκρούσεων.
eu: <command>apt-get upgrade</command> bezala baina, hedaturiko baterezintasun ebazpenaz.
it: Come <command>apt-get upgrade</command>, ma con un'avanzata risoluzione dei conflitti nelle dipendenze.
nb: Som <command>apt-get upgrade</command>, men med avansert konfliktløsning.
nl: Net als <command>apt-get upgrade</command>, maar met geavanceerde conflictafhandeling.
pt_br: Semelhante ao <command>apt-get upgrade</command>, mas com resolução de conflitos avançada.

source: apt-get remove <replaceable>package-names</replaceable>
nl: apt-get remove <replaceable>pakketnamen</replaceable>

source: Remove packages with all needed packages.
da: Fjern pakke med alle behøvede pakker.
de: Entfernt installiertes Paket und alle davon abhängenden Pakete.
el: Απομάκρυνση πακέτων μαζί με όλα τα απαραίτητα πακέτα.
eu: Ezabatu paketea beharrezko pakete guztiekin.
it: Rimuove i pacchetti e quelli che ne dipendono.
nb: Fjerner pakke med alle avhengigheter.
nl: Verwijder pakketten met alle benodigde pakketten.
pt_br: Remove pacotes com todos os pacotes necessários.

source: Remove packages that no other packages depend on.
da: Fjern pakker der ikke behøves af andre pakker.
de: Entfernt installiertes Paket und alle davon abhängenden Pakete.
el: Απομάκρυνση πακέτων από τα οποία δεν εξαρτώνται άλλα πακέτα.
eu: Ezabatu beste paketeek behar ez dituzten paketeak.
it: Rimuove i pacchetti dai quali non ne dipendono altri.
nl: Verwijder pakketten waar geen andere pakketten van afhankelijk zijn.
pt_br: Remove pacotes dos quais nenhum outro pacote depende.

source: apt-cache depends <replaceable>package-names</replaceable>
nl: apt-cache depends <replaceable>pakketnamen</replaceable>

source: List all packages needed by the one given.
da: Vis alle pakker den har brug for den angivne.
de: Listet alle Pakete auf, die von einem bestimmten Paket benötigt werden.
el: Εμφάνιση όλων των πακέτων που απαιτούνται από ένα συγκεκριμένο πακέτο.
eu: Zerrendatu emandako paketearen beharrak.
it: Mostra tutti i pacchetti da cui dipende quello indicato.
nl: Toon lijst met benodigde pakketten voor opgegeven pakket.
pt_br: Lista todos os pacotes dos quais um pacote depende.
