Repository: lurdan/trans-ddp
Catalog: refcard/po4a/*.po
Languages: da, de, el, eu, it, nb, nl, pt_br

source: en-GB
da: da
de: de
el: el
eu: eu
it: it
nb: nb
nl: nl
pt_br: pt-BR

source: Debian&#x00A0;GNU/Linux Reference Card
da: Debian&#x00A0;GNU/Linux håndbog
de: Debian&#x00A0;GNU/Linux Referenzkarte
el: Κάρτα Αναφοράς για το Debian&#x00A0;GNU/Linux
eu: Debian&#x00A0;GNU/Linux erreferentzi&#x00A0;txartela
it: Scheda di riferimento per Debian&#x00A0;GNU/Linux
nb: Debian&#x00A0;GNU/Linux referansekort
nl: Debian&#x00A0;GNU/Linux Hulpkaart
pt_br: Cartão de Referência Debian&#x00A0; GNU/Linux

source: The 101 most important things when using Debian GNU/Linux
da: De 101 vigtigste ting når man bruger Debian GNU/Linux
de: Die 101 wichtigsten Dinge bei der Nutzung von Debian GNU/Linux
el: Tα 101 πιο σημαντικά πράγματα όταν χρησιμοποιείτε το Debian GNU/Linux
eu: Debian GNU/Linux erabiltzeko 101 gomendio garrantzitsuenak
it: Le 101 più importanti cose da sapere per usare Debian GNU/Linux
nb: De 101 viktigste ting når man bruker Debian GNU/Linux
nl: De 101 belangrijkste dingen voor de GNU/Linux Debiangebruiker.
pt_br: As 101 coisas mais importantes quando utilizando o Debian GNU/Linux

source: <copyright> <year>2004</year> <year>2010</year> <holder>W. Martin Borgert</holder> </copyright> <copyright> <year>2004</year> <year>2010</year> <holder>Your Name ("Language")</holder> </copyright>
nl: <copyright> <year>2004</year> <year>2010</year> <holder>W. Martin Borgert</holder> </copyright> <copyright> <year>2004</year> <year>2010</year> <holder>C. Prins, Paul Gevers (Dutch)</holder> </copyright>

source: This document may be used under the terms the GNU General Public License version 3 or higher. Conditions for copying and translations can be found at <ulink url="http://www.debian.org/doc/manuals/refcard/"> <literal>http://www.debian.org/doc/manuals/refcard/</literal></ulink>, where you can always get the latest version of the reference card.
nl: Dit document mag gebruikt worden onder de voorwaarden van de GNU General Public License versie 3 of hoger. De voorwaarden voor kopiëren en vertalen kunnen gevonden worden op <ulink url="http://www.debian.org/doc/manuals/refcard/"> <literal>http://www.debian.org/doc/manuals/refcard/</literal></ulink>, waar ook altijd de nieuwste versie van de hulpkaart te vinden is.

source: reference card
da: referencekort
de: Referenzkarte
el: κάρτα αναφοράς
eu: erreferentzi txartela
it: scheda di riferimento
nb: referansekort
nl: hulpkaart
pt_br: cartão de referência

source: basic commands
da: basale kommandoer
de: grundlegende Befehle
el: βασικές εντολές
eu: oinarrizko komandoak
it: comandi di base
nb: grunnleggende kommandoer
nl: basis commando's
pt_br: comandos básicos

source: Version
el: Έκδοση
eu: Bertsioa
it: Versione
nb: Versjon
nl: Versie
pt_br: Versão

source: Made by
da: Lavet af
de: Erstellt mit
el: Έγινε από
eu: Egilea
nb: Laget av
nl: Gemaakt door
pt_br: Feito por

source: Getting Help
da: Find hjælp
de: Hilfe bekommen
el: Βρίσκοντας Βοήθεια
eu: Laguntza eskuratzen
it: Ottenere informazioni
nb: Få hjelp
nl: Hulp zoeken
pt_br: Obtendo Ajuda

source: man <replaceable>page</replaceable> or man bash
nl: man <replaceable>pagina</replaceable> of man bash

source: Read online help for every command and many configuration files.
da: Læs online hjælp for hver komando og mange konfigurationsfiler.
de: Lesen der Handbuchseite für jedes Kommando und viele Konfigurationsdateien.
el: Διαβάστε online βοήθεια για οποιαδήποτε εντολή και έναν μεγάλο αριθμό αρχείων ρυθμίσεων.
eu: Irakurri komando bakoitza eta konfigurazio fitxategi gehienen zuzeneko sare bidezko laguntza.
it: Mostra la guida online di ogni comando e di molti file di configurazione.
nb: Alltid tilgjengelig dokumentasjon for alle kommandoer og mange konfigurasjonsfiler.
nl: Lees beknopte informatie over het commando. Elk commando en vele configuratiebestanden hebben een man-page.
pt_br: Ler a ajuda online para cada comando e vários arquivos de configuração.

source: <replaceable>command</replaceable> <literal> </literal> <optional><literal>--</literal>help, <literal>-</literal>h</optional>
nl: <replaceable>commando</replaceable> <literal> </literal> <optional><literal>--</literal>help, <literal>-</literal>h</optional>

source: Brief help for most commands.
da: Viser hjælp for de fleste komandoer.
de: Die meisten Kommandos haben eine kurze Hilfe.
el: Σύντομη βοήθεια για τις περισσότερες εντολές .
eu: Komando gehienen laguntza laburra.
it: Una sintetica spiegazione per molti comandi.
nb: Kortfattet hjelp for de fleste kommandoer.
nl: Samenvatting opties voor de meeste commando&apos;s.
pt_br: Ajuda rápida para a maioria dos comandos.

source: <filename>/usr/share/doc/<optional><replaceable>package-name</replaceable>/</optional></filename>
nl: <filename>/usr/share/doc/<optional><replaceable>pakketnaam</replaceable>/</optional></filename>

source: Find all documentation here, optional file <filename>README.Debian</filename> contains specifics.
da: Her findes hele dokumentationen, valgfri fil <filename>README.Debian</filename> indeholder mere specifikke ting.
de: Hier finden Sie alle Dokumentationen. <filename>README.Debian</filename> enthält ggf. Spezifika.
el: Βρείτε όλη την τεκμηρίωση εδώ, Το προαιρετικό αρχείο <filename>README.Debian</filename> περιέχει την πιο εξειδικευμένη πληροφορία.
eu: Dokumentazio osoa, aukerako <filename>README.Debian</filename> argibide bereziak baleude.
it: Qui c'è tutta la documentazione, il file opzionale <filename>README.Debian</filename> contiene informazioni specifiche per Debian.
nb: Her fins hele dokumentasjonen; filen <filename>README.Debian</filename> (hvis tilstede) inneholder mer bestemte ting.
nl: Hier is alle documentatie te vinden. Soms staan bijzonderheden in het bestand <filename>README.Debian</filename>
pt_br: Encontre toda a documentação aqui, arquivo opcional <filename>README.Debian</filename> contém peculiaridades.

source: <ulink url="http://www.debian.org/doc/">Web documentation</ulink>
nl: <ulink url="http://www.debian.org/doc/">Online documentatie</ulink>

source: Reference, manuals, FAQs, HOWTOs, etc. at <literal>http://www.debian.org/doc/</literal>
da: Håndbøger, manualer, OSS'er, HOWTO'er, osv. på; <literal>http://www.debian.org/doc/</literal>
de: Referenz, Handbücher, FAQs, HOWTOs, usw. unter <literal>http://www.debian.org/doc/</literal>
el: Αναφορά, εγχειρίδια, Συχνές Ερωτήσεις (FAQ), HOWTO, κτλ. στην διεύθυνση <literal>http://www.debian.org/doc/</literal>
eu: Erreferentzia, manualak, FAQ-ak, HOWTO-ak, etab. <literal>http://www.debian.org/doc/</literal>
it: Guide, manuali, FAQ, HOWTO, ecc. all'indirizzo <literal>http://www.debian.org/doc/</literal>
nb: Håndbøker, manualer, OSS-er, HOWTO-er, osv. på <literal>http://www.debian.org/doc/</literal>
nl: Naslagwerken, handleidingen, FAQ&apos;s, HOWTO&apos;s, en andere documentatie op de website <literal>http://www.nl.debian.org/doc/</literal>.
pt_br: Referências, manuais, FAQs, HOWTOs, etc. em <literal>http://www.debian.org/doc/</literal>

source: <ulink url="http://lists.debian.org/">Mailing lists</ulink> at <literal>http://lists.debian.org/</literal>
nl: <ulink url="http://lists.debian.org/">E-maillijsten</ulink> op <literal>http://lists.debian.org/</literal>

source: The community is always helpful, search for <literal>users</literal>.
da: Community'en er altid hjælpsom, kig i <literal>users</literal>.
de: Die Debian-Gemeinde ist immer hilfsbereit, suchen Sie nach <literal>users</literal>.
el: Η κοινότητα πάντα βοηθάει, ψάξτε για <literal>users</literal>.
eu: Komunitatea beti laguntzeko prest, bilatu <literal>users</literal> taldeak.
it: La comunità è sempre disponibile ad aiutare, cercare le liste <literal>users</literal>.
nb: Debiansamfunneten kan hjelpe deg, særlig på <literal>users</literal>-listen.
nl: De Debian gemeenschap is altijd behulpzaam, kijk onder <literal>users</literal>.
pt_br: A comunidade é sempre útil, pesquise por <literal>usuários</literal>.

source: <ulink url="http://wiki.debian.org/">The Wiki</ulink> at <literal>http://wiki.debian.org/</literal>
nl: <ulink url="http://wiki.debian.org/">De wiki</ulink> op <literal>http://wiki.debian.org/</literal>

source: Contains all kind of useful information.
da: Indeholder alle slags nyttig information
de: Enthält jede Menge nützlicher Informationen.
el: Περιέχει κάθε λογής χρήσιμες πληροφορίες.
eu: Informazio erabilgarri mota guztiak ditu.
it: Contiene utili infomazioni di tutti i tipi
nl: Bevat allerlei nuttige informatie.
pt_br: Contém todo o tipo de informação útil.

source: Installation
el: Εγκατάσταση
eu: Instalazioa
it: Installazione
nb: Installasjon
nl: Installatie
pt_br: Instalação

source: <ulink url="http://www.debian.org/devel/debian-installer/">Installer</ulink>
nl: <ulink url="http://www.debian.org/devel/debian-installer/">Installatie- programma</ulink>

source: All information about it at <literal>http://www.debian.org/devel/debian-installer/</literal>
da: Alle informationer om det er på <literal>http://www.debian.org/devel/debian-installer/</literal>
de: Alle Informationen dazu unter <literal>http://www.debian.org/devel/debian-installer/</literal>
el: Όλες οι πληροφορίες σχετικά με τον Εγκαταστάτη στο <literal>http://www.debian.org/devel/debian-installer/</literal>
eu: Instalatzailearen argibideak: <literal>http://www.debian.org/devel/debian-installer/</literal>
it: Tutte le informazioni su di esso a: <literal>http://www.debian.org/devel/debian-installer/</literal>
nb: Alle informasjon om det er på <literal>http://www.debian.org/devel/debian-installer/</literal>
nl: Alle informatie over het installatieprogramma is te vinden op <literal>http://www.nl.debian.org/devel/debian-installer/</literal>.
pt_br: Todas as informações sobre ele em <literal>http://www.debian.org/devel/debian-installer/</literal>

source: Download from <literal>http://www.debian.org/distrib/</literal>
da: Download fra <literal>http://www.debian.org/distrib/</literal>
de: Download von <literal>http://www.debian.org/distrib/</literal>
el: Κατεβάστε από το <literal>http://www.debian.org/distrib/</literal>
eu: Deskargatu hemendik: <literal>http://www.debian.org/distrib/</literal>
it: Scaricabili da: <literal>http://www.debian.org/distrib/</literal>
nb: Last ned fra <literal>http://www.debian.org/distrib/</literal>
nl: Download van <literal>http://www.debian.org/distrib/</literal>
pt_br: Download de <literal>http://www.debian.org/distrib/</literal>

source: E.g. to set up the network w/o DHCP or using LILO instead of GRUB.
da: F.eks. at sætte netværk op uden at bruge DHCP eller at bruge LILO i stedet for GRUB.
de: Z.B. zum Konfigurieren des Netzwerkes ohne DHCP oder zum Nutzen von LILO statt GRUB.
el: Πχ. για να ρυθμίσετε το δίκτυο με/χωρίς DHCP ή για να χρησιμοποιήσετε LILO αντί του GRUB.
eu: Adib. sarea DHCP gabe edo LILO GRUB ordez.
it: Per poter, ad esempio, configurare la rete con/senza DHCP o per usare LILO invece di GRUB.
nb: F.eks. å angi nettverk opp uten å bruke DHCP eller å bruke LILO i stedet for GRUB.
nl: Bv. om het netwerk in te stellen zonder DHCP of om LILO te gebruiken i.p.v. GRUB.
pt_br: E.g. para configurar a rede com/sem DHCP ou usando LILO ao invés do GRUB.

source: <ulink url="http://bugs.debian.org/">Bug Tracking</ulink> at <literal>http://bugs.debian.org/</literal>
nl: <ulink url="http://bugs.debian.org/">Bug tracering</ulink> op <literal>http://bugs.debian.org/</literal>

source: All about existing and fixed bugs.
da: Alt om eksisterende fejl og allerede fixede fejl.
de: Alles über bekannte und gelöste Fehler.
el: Τα πάντα σχετικά με τα υπάρχοντα και τα διορθωμένα σφάλματα.
eu: Dena irekiriko eta konponduriko programa-erroreei buruz.
it: Tutto sui bachi esistenti e risolti.
nb: Alt om eksisterende og allerede rettede feil.
nl: Alles over bestaande en gerepareerde bugs.
pt_br: Tudo sobre bugs existentes e corrigidos.

source: Package specific
nl: Pakket specifiek

source: See <literal>http://bugs.debian.org/<replaceable>package-name</replaceable>/</literal>, use <literal>wnpp</literal> to ask for new packages.
da: Se <literal>http://bugs.debian.org/<replaceable>pakkenavn</replaceable>/</literal>, brug <literal>wnpp</literal> for at finde nye pakker.
de: Siehe <literal>http://bugs.debian.org/<replaceable>Paketname</replaceable></literal>, benutze <literal>wnpp</literal>, um neue Pakete anzufragen.
el: Δείτε το <literal>http://bugs.debian.org/<replaceable>package-name</replaceable>/</literal>, χρησιμοποιήστε <literal>wnpp</literal> για να μάθετε για καινούρια πακέτα.
eu: Begiratu <literal>http://bugs.debian.org/<replaceable>pakete-izena</replaceable>/</literal>, <literal>wnpp</literal> erabili pakete berriei buruz galdetzeko.
it: Guardare <literal>http://bugs.debian.org/<replaceable>nome-pacchetto</replaceable>/</literal>, usare <literal>wnpp</literal> per richiedere un nuovi pacchetti.
nb: Se <literal>http://bugs.debian.org/<replaceable>pakkenavn</replaceable>/</literal>, bruk <literal>wnpp</literal> for å finne nye pakker.
nl: Zie <literal>http://bugs.debian.org/<replaceable>pakketnaam</replaceable>/</literal>, gebruik <literal>wnpp</literal> om nieuwe pakketten aan te vragen.
pt_br: Veja <literal>http://bugs.debian.org/<replaceable>nome-do-pacote</replaceable>/</literal>, use <literal>wnpp</literal> para consultar por novos pacotes.

source: Report a bug by e-mail.
da: Raport en fejl pr. e-mail.
de: Fehler per E-Mail berichten.
el: Αναφέρετε ένα σφάλμα με e-mail.
eu: Programa-errore baten berri epostaz emateko.
it: Segnala un baco via e-mail.
nb: Rapporter en feil via e-post.
nl: Om een bug via e-mail te rapporteren.
pt_br: Relatar um bug por e-mail.

source: <ulink url="http://www.debian.org/Bugs/Reporting">Reporting</ulink>
nl: <ulink url="http://www.debian.org/Bugs/Reporting.nl.html">Rapporteren</ulink>

source: Instructions at <literal>http://www.debian.org/Bugs/Reporting</literal>
da: Instruktioner på <literal>http://www.debian.org/Bugs/Reporting</literal>
de: Anweisungen zum Berichten von Fehlern unter <literal>http://www.debian.org/Bugs/Reporting</literal>
el: Οδηγίες στο <literal>http://www.debian.org/Bugs/Reporting</literal>
eu: Argibideak <literal>http://www.debian.org/Bugs/Reporting</literal>-en daude
it: Istruzioni presso <literal>http://www.debian.org/Bugs/Reporting</literal>
nb: Instruksjoner på <literal>http://www.debian.org/Bugs/Reporting</literal>
nl: Instructies staan op <literal>http://www.debian.org/Bugs/Reporting.nl.html</literal>
pt_br: Instruções em <literal>http://www.debian.org/Bugs/Reporting</literal>

source: Configuration
da: Konfiguration
de: Konfiguration
el: Ρυθμίσεις
eu: Konfigurazioa
it: Configurazione
nb: Konfigurasjon
nl: Configuratie
pt_br: Configuração

source: All system configuration files are under directory <filename>/etc/</filename>.
da: Alle system konfigurationsfiler er i mappen <filename>/etc/</filename>.
de: Alle Konfigurationsdateien des Systems befinden sich im Verzeichnis <filename>/etc/</filename>.
el: Όλα τα αρχεία ρυθμίσεων του συστήματος βρίσκονται στον κατάλογο <filename>/etc/</filename>.
eu: Sistemako konfigurazio fitxategi guztiak <filename>/etc/</filename> direktorioan daude.
it: Tutti i file di configurazione sono nella directory <filename>/etc/</filename>.
nb: Alle systemkonfigurasjonsfiler er i mappa <filename>/etc/</filename>.
nl: Alle systeem-configuratiebestanden staan in <filename>/etc/</filename>.
pt_br: Todos os arquivos de configuração do sistema estão no diretório <filename>/etc/</filename>.

source: editor <replaceable>files</replaceable>
nl: editor <replaceable>bestanden</replaceable>

source: Default text editor. May be <command>nano</command>, <command>emacs</command>, <command>vi</command>, <command>joe</command>.
da: nano er defaulteditoren. Hvis den ikke findes, så prøv <command>emacs</command>, <command>vi</command>, <command>joe</command>.
de: Standard Text-Editor. Kann z.B. <command>nano</command>, <command>emacs</command>, <command>vi</command> oder <command>joe</command> sein.
el: Προκαθορισμένος επεξεργαστής κειμένου. Μπορεί να είναι ένας από τους <command>nano</command>, <command>emacs</command>, <command>vi</command>, <command>joe</command>.
eu: Lehenetsiriko testu editorea. <command>nano</command>, <command>emacs</command>, <command>vi</command> edo <command>joe</command> saiatu.
it: L'editor di default. Potrebbe essere <command>nano</command>, <command>emacs</command>, <command>vi</command>, <command>joe</command>.
nl: Standaard teksteditor. Kan <command>nano</command>, <command>emacs</command>, <command>vi</command> of <command>joe</command> zijn.
pt_br: Editor de texto padrão. Talvez <command>nano</command>, <command>emacs</command>, <command>vi</command>, <command>joe</command>.

source: <ulink url="http://localhost:631">CUPS</ulink> at <literal>http://hostname:631</literal>
nl: <ulink url="http://localhost:631">CUPS</ulink> op <literal>http://hostname:631</literal>

source: Browser interface to printing system.
da: Browsergrænseflade til printsystem.
de: Browser-Oberfläche zur Druckerkonfiguration.
el: Διεπαφή περιηγητή ιστοσελίδων στο σύστημα εκτύπωσης.
eu: Inprimatze sistemaren web bidezko interfazea.
it: Interfaccia tramite browser al sistema di stampa.
nb: Nettlesergrensesnitt til utskriftssystemet.
nl: Browser-interface naar printerconfiguratie.
pt_br: Interface web para o sistema de impressão.

source: dpkg-reconfigure <replaceable>package-name</replaceable>
nl: dpkg-reconfigure <replaceable>pakketnaam</replaceable>

source: Reconfigure a package, e.g. console-common (keyboard), locales (localisation).
da: Rekonfigure en pakke, f.eks. console-common (tastatur), locales (lokaltilpasning).
de: Neukonfigurieren eines Paketes, z.B. console-common (Tastatur), locales (Sprache).
el: Επαναρυθμίσετε ένα πακέτο, πχ. τα console-common (πληκτρολόγιο), locales (τοπικοποίηση).
eu: Pakete bat birkonfiguratu, adib. e.g. console-common (teklatua), locales (lokalizazioa).
it: Riconfigura un pacchetto, es. console-common (tastiera), locales (localizzazione).
nb: Sett opp en pakke på nytt, f.eks. console-common (tastatur), locales (lokaltilpasning).
nl: Herconfigureer een pakket, bv console-common (toetsenbord), locales (lokalisatie).
pt_br: Reconfigura um pacote, e.g. console-common (teclado), locales (configurações regionais).

source: update-alternatives <replaceable>options</replaceable>
nl: update-alternatives <replaceable>opties</replaceable>

source: Manage command alternatives.
da: Hold styr på komamndoalternativer.
de: Konfiguration von Kommando-Alternativen.
el: Διαχειριστείτε εναλλακτικές εντολών.
eu: Komando alternatiboak kudeatu.
nb: Hold styr på kommandoalternativer.
nl: Beheer commando-alternatieven.
pt_br: Administra alternativas de comandos.

source: After changing <filename>/etc/default/grub</filename>.
nl: Nadat <filename>/etc/default/grub</filename> is aangepast.

source: make-kpkg <literal>--</literal>initrd <literal>--</literal>revision=2:my.1.0 <literal>--</literal>rootcmd fakeroot <literal>--</literal>uc <literal>--</literal>us <literal>kernel_image</literal>
nl: make-kpkg <literal>--</literal>initrd <literal>--</literal>revision=2:mijn.1.0 <literal>--</literal>rootcmd fakeroot <literal>--</literal>uc <literal>--</literal>us <literal>kernel_image</literal>

source: Build a kernel packages from sources, if a customised kernel is really needed, needs <literal>kernel-package</literal>.
da: Byg en kernel fra kildekode, hvis en anderledes kernel behøes, behøver <literal>kernel-package</literal>.
de: Ein Kernel-Paket aus den Quellen bauen, wenn ein angepasster Kernel wirklich gebraucht wird. Benötigt <literal>kernel-package</literal>.
el: Φτιάξτε καινούρια πακέτα πυρήνα από τον πηγαίο κώδικα, αν πραγματικά χρειάζεστε έναν δικό σας πυρήνα, απαιτεί το πακέτο <literal>kernel-package</literal>.
eu: Kernel pakete bat iturburutik sortu, kernel pertsonalizatu bat benetan behar izanez gero, <literal>kernel-package</literal> behar du.
it: Crea un pacchetto del kernel dai sorgenti, se è necessario un kernel personalizzato, richiede anche <literal>kernel-package</literal>.
nb: Bygg en kjerne fra kildekode, hvis du trenger en annerledes kjerne. Krever <literal>kernel-package</literal>.
nl: Compileer een kernel-pakket vanuit broncode, als een aangepaste kernel echt nodig is. Vereist <literal>kernel-package</literal>.
pt_br: Constrói um pacote do kernel a partir dos fontes, se um kernel customizado é realmente necessário, precisa do <literal>kernel-package</literal>.

source: Create and install third-party modules (gspca, ...), needs <literal>module-assistant</literal>.
da: Lav og installer tredjeparts moduler (gspca, ...), behøver <literal>module-assistant</literal>.
de: Erzeugt und installiert Fremd-Module (gspca, ...), benötigt <literal>module-assistant</literal>.
el: Δημιουργήστε και εγκαταστήστε αρθρώματα από τρίτους (gspca, ...), χρειάζεται το πακέτο <literal>module-assistant</literal>.
eu: Hirugarrengoen moduluak (gspca,...) sortu eta instalatu, <literal>module-assistant</literal> behar du.
nl: Creëer en installeer modules van derden (gspca, ...). Vereist <literal>module-assistant</literal>.
pt_br: Cria e instala módulos de terceiros (gspca, ...), precisa do <literal>module-assistant</literal>.

source: Daemons and System
da: Dæmoner og System
de: Daemonen und System
el: Δαίμονες και Σύστημα
eu: Deabru eta sistema
it: Demoni e Sistema
nb: Nisser (daemons) og system
nl: Achtergronddiensten en systeem
pt_br: Daemons e Sistema

source: <filename>/etc/init.d/<replaceable>file</replaceable></filename> restart
nl: <filename>/etc/init.d/<replaceable>bestand</replaceable></filename> restart

source: Restart a service, system daemon.
da: Genstart en service, systemdæmon.
de: Neustart eines Dienstes oder Systemdaemons.
el: Επανεκκινήστε μια υπηρεσία, δαίμονα του συστήματος.
eu: Berrabiarazi zerbitzu bat, sistema deabru bat.
it: Riavvia un servizio, un demone.
nb: Starter på nytt en tjeneste, systemnisse.
nl: Start een achtergronddienst opnieuw op.
pt_br: Reinicia um serviço, daemon do sistema.

source: <filename>/etc/init.d/<replaceable>file</replaceable></filename> stop
nl: <filename>/etc/init.d/<replaceable>bestand</replaceable></filename> stop

source: Stop a service, system daemon.
da: Stop en service, systemdæmon.
de: Stoppt einen Dienst oder Systemdaemon.
el: Σταματήστε μια υπηρεσία, δαίμονα του συστήματος.
eu: Gelditu zerbitzu bat, sistema deabru bat.
it: Ferma un servizio, un demone.
nb: Stopper en tjeneste, systemnisse.
nl: Stop een achtergronddienst.
pt_br: Pára um serviço, daemon do sistema.

source: <filename>/etc/init.d/<replaceable>file</replaceable></filename> start
nl: <filename>/etc/init.d/<replaceable>bestand</replaceable></filename> start

source: Start a service, system daemon.
da: Start en service, systemdæmon.
de: Startet einen Dienst oder Systemdaemon.
el: Εκκινήστε μια υπηρεσία, δαίμονα του συστήματος.
eu: Abiarazi Zerbitzu bat, sistema deabru bat.
it: Avvia un servizio, un demone.
nb: Starter en tjeneste, systemnisse.
nl: Start een achtergronddienst.
pt_br: Inicia um serviço, daemon do sistema.

source: Halts, reboots, shuts down system.
da: Stopper, genstarter, lukker systemet.
de: Hält das System an, startet es neu oder schaltet es aus.
el: Σταματά, επανεκκινεί, κλείνει το σύστημα.
eu: Sistema gelditu, berrabiarazi eta itzali egiten dute.
it: Ferma, riavvia, spegne il sistema.
nb: Stopper, starter på nytt, slår av systemet.
nl: Stop systeem, start systeem opnieuw, zet systeem uit.
pt_br: Pára, reinicia, desliga o sistema.

source: All log files are under this directory.
da: Alle logfiler er i denne mappe.
de: Hier finden Sie alle Protokolldateien.
el: Όλα τα αρχεία καταγραφής βρίσκονται σ' αυτόν τον κατάλογο.
eu: Erregistro fitxategi guztiak direktorio honetan daude.
it: Tutti i file di log sono in questa directory.
nb: Alle loggfiler er i denne mappa.
nl: Alle logbestanden staan in deze map.
pt_br: Todos os arquivos de log estão neste diretório.
