<!DOCTYPE debiandoc PUBLIC "-//DebianDoc//DTD DebianDoc//EN" [
  <!entity % dynamicdata  SYSTEM "../dynamic.ent"       > %dynamicdata;
  <!entity % shareddata   SYSTEM "../release-notes.ent" > %shareddata;
  <!entity docid "$Id: release-notes.de.sgml,v 1.1 2003-01-04 00:37:57 joy Exp $">
]>

<!-- Corrected and completed translation by Joerg Jaspert joerg@debian.org -->
<!-- should be in sync with english version 1.153 -->

<debiandoc>
  <book>
    <titlepag>
      <title>Release Notes f&uuml;r &debian; &release; (`&releasename'), &arch-title;</title>
      <author>
        <name/Josip Rodin, Bob Hilliard, Adam Di Carlo, Anne Bezemer, Rob Bradford/<email//
      </author>
      <author>
        <name//<email/debian-doc@lists.debian.org/
      </author>
      <version>&docid;</version>
    </titlepag>
    <toc detail="sect1">
    <chapt id="whats-new">Was ist neu bei &debian; &release;

        <p>[Die aktuelle Version dieses Dokuments finden Sie unter 
        <url id="&url-release-notes;">. Falls Ihre Version dieser Datei &auml;lter als einen Monat 
	sein sollte, ist es empfehlenswert eine neue Version herunterzuladen]

        <p>Die vorhergehende &debian; 2.2 release ('potato') unterst&uuml;tzte sechs 
	Computer-Architekturen, die in dieser Release um vier erweitert worden sind. 
	Diese vier sind bei der folgenden Aufstellung durch ein Sternchen [*] 
        gekennzeichnet. Im folgenden die vollst&auml;ndige Liste aller
	Architekturen die von dieser Release unterst&uuml;tzt werden.</p>

      <p>
          <list>
	  <item>Intel x86 ('i386')</item>
	  <item>Motorola 680x0 ('m68k')</item>
	  <item>Alpha ('alpha')</item>
	  <item>SPARC ('sparc')</item>
	  <item>PowerPC ('powerpc')</item>
	  <item>ARM ('arm')</item>
	  <item>MIPS ('mips' (Big endian) und 'mipsel' (Little endian)) [*]</item>
	  <item>Intel Itanium ('ia64') [*]</item>
	  <item>HP PA-RISC ('hppa') [*]</item>
	  <item>S/390 ('s390') [*]</item>
	</list>
          
<![ %not-i386 [ 
          
<!-- i386 doesn't have a port page - or do they now? --> 

          <p> Details &uuml;ber Port-Status und port-spezifische Informationen finden Sie unter 
	  <url id="&url-ports;" name="Debian port web pages">.</p>
 
]]>

<![ %hppa %s390 %mips %mipsel %ia64 [ 

          <p>Dies ist die erste offizielle Release von &debian; f&uuml;r &arch-title. Wir sind 
	  der Meinung, dass der Probelauf ausreichend genug war um released zu werden. 
	  Da diese Version nicht so ausreichend wie die Vorg&auml;nger-Versionen getestet wurde, 
	  k&ouml;nnte es sein, dass Sie auf Fehler sto&szlig;en. Wir bitten Sie, uns diese
          unter Verwendung unseres <url id="&url-bts;" name="bug tracking system">.
	  mittzuteilen. 
	  Vergewissern Sie sich, dass Sie im Fehlerbericht auch den
	  Namen der verwendeten Architektur (&architecture;) angeben.
]]>

          <p>&debian; &release; f&uuml;r  &arch-title;-Architectur kommt
          standardm&auml;ssig mit Kernel Version &kernelversion;.</p>

      <![ %default-kernel-2.2 [ 

      <p>Die 2.2 Kernel-Serie wurde extensiv verbessert und ausgebaut. 
	  Es gibt einige n&uuml;tzliche &Auml;nderungen im Kernel und bei
	  Programmen die Kernel-Feature nutzen. Weiterhin kamen viele neue 
	  Hardware Treiber und Bug Fixes f&uuml;r existierende Treibern hinzu.</p>
      
      <p>Ein 2.4 Kernel ist ebenfalls in dieser Release enthalten. 
	  Er kann optional vom User installiert werden. Obwohl der 2.4-Zweig laut 
	  den Kernel-Entwicklern stabil ist, hat das Release-Team beschlossen, 
	  dass dieser Kernel noch nicht ausreichend getestet wurde um als 
	  Standard-Kernel in dieser Release benutzt zu werden.

]]>
        
        <sect id="newinst">Was ist neu im Installation System?

          <p>Das neue <package>debootstrap</package>-Programm l&auml;dt, entpackt 
	  und extrahiert &debian;-Pakete f&uuml;r die Grundinstallation.  Dies ist eine 
	  Verbesserung gegen&uuml;ber dem alten Installations-System, das einen tarball
          mit dem Grundsystem verwendete. Das Installationsgrundsystem kann nun
          dynamischer mit dem System aktualisiert werden.</p>

	<p> Das Task-System wurde erneuert. Tasks in der vorigen Release bestanden 
	  aus Meta-Paketen (Pakete sind Sammlungen von anderen Paketen). Das neue 
	  System verwendet spezielle Header um innerhalb des existierenden Paketsystems 
	  alle Aufgaben je nach Paketzugeh&ouml;rigkeit richtig zuzuordnen.
</p>

	<!-- this isn't true, is it? We don't have any way for people to pick
	part of a task except to pick some packages, right? -->

	<p>Dies erm&ouml;glicht eine gr&ouml;&szlig;ere Auswahl von Aufgaben und erleichtert 
	  die Installation von ausgesuchten Teilen von Aufgaben 
	  (es muss also nicht die komplette Aufgabe installiert werden). </p>
	
	<!-- TODO: 
	- Ask on debian-boot how many translated boot-floppies are
	available.  
	- get the number of packages with po files translated
	(international/l10n only has the number of po files).  
	- get the number of packages with debconf files translated (idem) -->

	<p>
	  Fast die gesamte Konfiguration w&auml;hrend der Installation und die Rekonfiguration 
	  danach wird mit Debconf durchgef&uuml;hrt. 
          Debconf hat verschiedene Oberfl&auml;chen; eine nicht-interaktive f&uuml;r automatische
          Installation, eine (Standard) Dialog-Oberl&auml;che im Textmodus und eine GNOME-Oberfl&auml;che.
	  Debconf's Engine wurde ebenfalls komplett erneuert und verbessert und ist nun flexibler
          denn je. Kurz gesagt, "debconf makes the world go around" :).</p>
        
	<p>Ausf&uuml;hrliche Details zu Debian's Installation's System finden Sie auf der ersten CD oder unter
	  <url id="&url-install-manual;"></p>

	<![ %i386 [ 

	<p>Kernel-Images sind in verschiedenen Variationen, "flavors" genannt, 
	  verf&uuml;gbar. Diese Flavors unterst&uuml;tzen verschiedene Arten von Hardware. Folgende Flavors sind 
	  f&uuml;r &debian; &release; f&uuml;r &arch-title; verf&uuml;gbar: </p>
	
	<p>
            <taglist>
	    <tag>`vanilla'</tag>
	    <item><p>Vanilla ist das Standard-Kernel-Package unter Debian. Es beinhaltet fast alle 
	      Treiber-Module die unter Linux verf&uuml;gbar sind, wie zB. Treiber f&uuml;r Netzwerkger&auml;te, 
	      SCSI-Ger&auml;te, Soundkarten, Video4Linux Ger&auml;te, usw. `Vanilla' besteht aus einer 
	      rescue, einer root und vier Treiber-Disketten.</p></item>
	    
	    <tag>`ide'</tag>
	    <item><p>`ide' ist `vanilla' sehr &auml;hnlich. Es beinhaltet allerdings einen zus&auml;tzlichen 
	      IDE-Patch. Dieser Patch von Andre Hedrick's unterst&uuml;tzt UDMA66-Ger&auml;te.</p></item>
	    
	    <tag>`compact'</tag>
	    <item><p>`compact' ist &auml;hnlich `vanilla', es wurde allerdings um einige kaum verwendete 
	      Treiber (zB Sound, Video4Linux, usw.) gek&uuml;rzt. Zus&auml;tzlich werden unter `compact'
              PCI-Ethernet-Ger&auml;te wie NE2000, 3c905, Tulip, Via-Rhine und Intel EtherExpress Pro100
              unterst&uuml;tzt. Diese eingebauten Treiber erm&ouml;glichen eine komplette Netzinstallation,
              soda&szlig; nur noch die Root und Rescue-Diskette erstellt werden m&uuml;ssen. 
              Ausserdem unterst&uuml;tzt `compact' auch einige g&auml;ngige RAID-Controller: DAC960 und SMART2
              RAID Controller von Compaq. 
	      Das `compact'-Flavor beinhaltet eine Rescue-, eine Root und zwei Treiber-Disketten.</p></item>
	    
	    <tag>`idepci' </tag>
	    <item><p>Der `idepci' Kernel unterst&uuml;tzt ausschlie&szlig;lich IDE und PCI-Ger&auml;te, sowie einige 
	      ISA-Ger&auml;te. Wenn sich Ihr System beim Booten aufgrund der SCSI-Treiber aufh&auml;ngt
	      (Resource-Konflikten oder dem Verhalten des Treibers oder einer Karte Ihres Systems),
              so sollten Sie sich f&uuml;r dieses Flavor entscheiden. 
	      Der `idepci' Kernel hat einen eingebauten IDE-Diskettenlaufwerk-Treiber, sodass Sie 
	      von LS120 oder ZIP-Ger&auml;ten installieren k&ouml;nnen.</p> </item>

	    <tag>`bf2.4`</tag>
	    <item><p>An `bf2.4` wird noch entwickelt. Es ist eine spezielle Version eines 
	      Kernel-Image-2.4-Pakets. Es unters&uuml;tzt neuere Hardware (zB mehr USB-Hardware,
	      moderne IDE-Kontroller, neuere Netzwerkkarten, sowie Ext3 und Reiser Filesysteme), 
	      die w&auml;hrend der Entwicklung der stabileren &auml;lteren Flavor noch nicht existierte. 
              Im Vergleich zu den Treibern eines Kernel-Image-2.4.x-Paketes im Debian Archiv wurden
              manche unwesentliche Treiber aus diesem Flavor entfernt um die Zahl der n&ouml;tigen Disketten
              nicht zu erh&ouml;hen.</p></item>
	  </taglist>
          </p>

	<p>Sie finden die Dateien der Kernel-Konfiguration dieser Flavors in den jeweiligen 
	  Verzeichnissen unter dem Dateinamen `kernel-config`</p>

	]]>

      <sect id="newdistro">Whas ist neu in der Distribution?

<![ %default-kernel-2.2 %not-i386 [ 

           <p> W&auml;hrend der Installation wird Kernel kernelversion; verwendet, Die aktuelle 
	   stabile Version des Kernel &2.4, ist ebenfalls verf&uuml;gbar f&uuml;r alle die diese nutzen wollen.
<p>

]]>

           <p>Die Tools zur Paketverwaltung in Debian, apt und dpkg, sind in dieser Release 
	   wesentlich verbessert worden. Nun unterst&uuml;tzt apt das sogenannte "pinning", wo 
	   der Nutzer bestimmte Pakete aus verschiedenen Distributionen installieren kann,
           zB testing oder unstable, w&auml;hrend er weiterhin den Gro&szlig;teil der anderen Pakete
           in der stabilen Distribution  beh&auml;lt. APT l&auml;dt und installiert dabei automagisch alle
           durch Abh&auml;ngigkeiten zus&auml;tzlich ben&ouml;tigten Pakete ebenfalls aus der jeweiligen Distribution.
	   Weitere Informationen zu apt's "pinning"  finden Sie unter 
           <url id="&url-apt-pin-howto;" name='APT "pinning" howto'>.</p>
	
	<p>In dieser Release wurden Build-Dependencies hinzugef&uuml;gt, um das Kompilieren unserer
           Source-Pakete zu erleichtern. Mit dem Befehl "build-dep" l&auml;dt und installiert apt-get alle
           zur Kompilierung eines Paketes ben&ouml;tigten Pakete bevor die Kompilierung gestartet wird.</p>
	
	<p>Um das &auml;ltere, vielfach verschm&auml;hte aber dennoch popul&auml;re 
	   <package>dselect</package> zu ersetzen, wurden in letzter Zeit 
	   zahlreiche apt frontends entwickelt. Interessierte Nutzer sollten
           sich die <package>aptitude</package> Paketinformationen ansehen.</p>

	<p>Diese Release von Debian GNU/Linux beinhaltet die wesentlich 
	   verbesserte Release von XFree86 4.1, welche mehr Hardware unterst&uuml;tzt, &uuml;ber eine bessere Autoerkennung
           und Support f&uuml;r neue Technologien wie Xinerama und 3D Beschleunigung mitbringt.</p>
	
	<p>&debian; 3.0 ist viel sicherer als vorherige Releases. Die Grundinstallation 
	  beinhaltet keine unwichtigen Dienste mehr welche ein Angriffsziel sein k&ouml;nnten.
	  Debian 3.0 beinhaltet viele zus&auml;tzliche sicherheitsorientierten Anwendungen wie 
	  Firewall-Administration, Server-Hardening und Intrusion Detection 
	  (Eindringlingswarnung). Auch das Paket-System wurde verbessert. Nun ist es m&ouml;glich,
	  digitale Signaturen automatisch pr&uuml;fen zu lassen. Wenn es dementsprechend 
	  konfiguriert ist, l&auml;sst es nicht zu, dass Debian-Pakete mit fehlerhafter
	  Signatur installiert werden. Das vermindert das Risiko der Installation von trojanischen Pferden
	  und macht es einfacher und sicherer das System &uuml;ber das Internet zu aktualisieren.
          Last but not least bietet &debian; nun eine ausf&uuml;hrliche 
	  Dokumentation f&uuml;r den sicherheitsbewussten Administrator 
	  (zB <url id="http://www.debian.org/doc/manuals/securing-debian-howto" 
	    name="'Securing Debian Manual'">) aus dem Debian Documentation Project 
	  (auch als Paket verf&uuml;gbar: <package>harden-doc</package> ).</p>
	
	<p>&debian; 3.0 ist noch <url id="http://www.debian.org/international" 
	    name="internationaler"> als das vorhergehende Release, dank der &Uuml;bersetzungsarbeit der 
	  Free-Software-Community. &debian; 3.0 ist in noch mehr Sprachen als die vorherige Release 
	  verf&uuml;gbar. Dasselbe gilt auch f&uuml;r eine Vielzahl von Programmen.
	  Die Boot-Floppy-Installation wurde in verschiedenste Sprachen &uuml;bersetzt. Es gibt einen 
	  umfangreichen Support f&uuml;r franz&ouml;sisch, deutsch, italienisch, japanisch, portugiesisch, 
	  spanisch, catalanisch und d&auml;nisch. Es gibt mehr als f&uuml;nfzehn &Uuml;bersetzungsteams.</p>


	<p>Das allererste Mal beinhaltet GNU/Linux verschiedene freie, "full-featured" graphische
           Webbrowser wie Mozilla, Galeon und Konqueror. Debian beinhaltet das erstemal die KDE Umgebung, in
           der Version 2.2, was zusammen mit dem neuen GNOME 1.4 Release Debian's Benutzbarkeit
           auf Desktopsystemen stark verbessert.</p>
	
	<p>Die offizielle Debian GNU/Linux Distribution besteht aus
           sechs CDs mit Bin&auml;rpaketen und einer &auml;hnlichen Anzahl von
           Source-Medien, ausserdem ist auch eine 
	  DVD-Version der Distribution erh&auml;ltlich.</p>

    </chapt>

    <chapt id="installing">Neuinstallationen

        <p>Wenn Sie eine Neuinstallation von Debian durchf&uuml;hren, so sollten Sie 
	das Installationshandbuch auf der offiziellen CD lesen:
        <example>        
          /dists/&releasename;/main/disks-&architecture;/current/doc/install.txt
          (oder .html)
        
        </example>

        <p>oder im Internet unter: <url id="&url-install-manual;"></p>

      <p>Das Debian Installations-System, genannt <package/boot-floppies/ 
	(obwohl es mehr unterst&uuml;tzt als nur Disketten), wurde weiter 
	verbessert und modernisiert, damit es noch leichter zu handhaben ist.
</p>
      
    </chapt>


    <![ %not-mips [
    <![ %not-mipsel [
    <![ %not-ia64 [
    <![ %not-hppa [
    <![ %not-s390 [

    <chapt id="upgrading">Upgrades von vorherigen Versionen

<!-- For doc-writers' convenience:
Debian Supported
release: architectures:

1.3.1 or less i386
2.0           i386,m68k
2.1	      i386,m68k,alpha,sparc
2.2	      i386,m68k,alpha,sparc,powerpc,arm
3.0	        + hppa s390 mips mipsel ia64
-->

        <sect id="information"><heading>&Auml;nderungen im System</heading>

       	<sect1 id="syntax"><heading>Wichtige &Auml;nderungen bei Programmaufrufen</heading>
	  <p>Debian vermeidet nach M&ouml;glichkeit &Auml;nderungen an Upstream Paketen, daher werden
          solche &Auml;nderungen auch in &debian; erscheinen.</p>
          
	  <p>IM &debian; 2.2 'Potato' Release benutzte <prgn>tar</prgn> die <example>-I</example> Option
          um mit <prgn>bzip</prgn> zu komprimieren, mittlerweile wird daf&uuml;r die Option
          <example>-j</example> benutzt. Sie m&uuml;ssen Ihre Scripte entsprechend anpassen.</p>

       	</sect1>
      </sect>

      <sect id="backup"><heading>Vorbereitungen f&uuml;r die Aktualisierung</heading>

	<p>Bevor Sie Ihr System aktualisieren, ist es empfehlenswert ein Backup Ihrer Daten 
	  oder zumindest jener Daten die nicht verlorengehen d&uuml;rfen zu erstellen. Die 
	  Upgrade-Tools sind sehr verl&auml;&szlig;lich, dennoch k&ouml;nnte ein Hardware-Fehler w&auml;hrend 
	  des Upgrades Ihr System besch&auml;digen.</p>
	
	<p>Die wichtigsten Sachen die Sie sichern sollten, ist der Inhalt von 
          <file>/etc</file>, <file>/var/lib/dpkg</file> und der Output von
          <tt>dpkg --get-selections</tt>.</p>

	<p>Es sollten alle Nutzer von der geplanten Aktualisierung in Kenntniss gesetzt werden,
           auch wenn Nutzer die Ihr System &uuml;ber <prgn/ssh/ nutzen davon nicht viel mitbekommen sollten und
           eventuell weiterarbeiten wollen. Sollten Sie zus&auml;tzliche Sicherungsmassnahmen ergreifen
           wollen, sichern (oder unmounten) sie die Home-Partition (<file>/home</file>) vor der
           Aktualisierung. Ein Reboot ist normalerweise nicht notwendig.</p>

	<p>Ein Upgrade einer Distribution sollten Sie am besten am lokalen Rechner 
	  &uuml;ber die Textkonsole ausf&uuml;hren (bzw. &uuml;ber ein serielles Terminal) oder 
	  remote &uuml;ber eine <prgn/ssh/ Verbindung.</p> 

	<p><em/Wichtig/: Sie sollten f&uuml;r die Aktualisierung <em/nicht/ die Programme
           <prgn/telnet/, <prgn/rlogin/ oder <prgn/rsh/ benutzen. Ausserdem sollten Sie es auch aus keiner
           X Sitzung starten die von <prgn/xdm/ verwaltet wird. Diese Dienste k&ouml;nnen bei einer
           Aktualisierung neugestartet oder gar abgeschaltet werden, was zu einem
           unbenutzbaren, nur halb aktualisiertem System f&uuml;hren kann.</p>

        <sect1>Pr&uuml;fen des Paketstatus

          <p>Unabh&auml;ngig von der Methode, die Sie f&uuml;r Ihr Upgrade verwenden, ist es empfehlenswert,
             als erstes den Status der Pakete zu pr&uuml;fen um sicherzugehen dass alle Pakete in einem
	     update-f&auml;higem Status sind. Der folgende Befehl gibt alle Pakete
             mit dem Status "Half-Installed", "Failed-Config" oder mit Error-Status aus.

          <example>
        
            # dpkg --audit
          
          </example></p>
	  
          <p>Sie k&ouml;nnten auch den Status aller Pakete auf dem System inspizieren, in dem Sie
             das Kommando <prgn/dselect/ aufrufen - oder andere Kommandos wie:

          <example>
         
            # dpkg -l | pager 

          </example></p>

          <p>oder

          <example>
         
            # dpkg --get-selections &gt; ~/curr-pkgs.txt

          </example></p>

          <p>Es ist w&uuml;nschenswert alle Holds vor der Aktualisierung zu entfernen.
	  Sollte eines der Pakete das f&uuml;r das Upgrade wichtig ist 
	  auf Hold sein, w&uuml;rde die Aktualisierung nicht funktionieren.
	  Auf die folgende Art und Weise k&ouml;nnen Sie herausfinden, 
	  ob Pakete auf Hold sind:
 
          <example>
         
            # dpkg --audit
       
          </example></p>

	  <p>Wenn Sie ein Paket lokal ver&auml;ndert und neukompiliert haben und es
	  nicht umnannten oder die Versionsnummer drastisch erh&ouml;hten m&uuml;ssen
	  Sie es auf Hold setzen um eine Aktualisierung zu verhindern. Den
	  Status `hold' kann man im <prgn/dselect/ Programm durch dr&uuml;cken der
	  Taste H einstellen, oder durch folgende Aktionen erreichen:
 
          <example>
        
            dpkg --get-selections &gt; ~/curr-sels.txt
       
          </example>

          <p>&Auml;ndern Sie nun in dieser Datei den Status von "hold" auf 
	  "install" (oder umgekehrt) und f&uuml;hren Sie danach mit Root-Rechten,
          folgendes Kommando aus:

          <example>
         
           dpkg --set-selections &lt; ~/curr-sels.txt
       
          </example></p>
	</sect1>

        <sect1><heading>Spezielle Bemerkungen f&uuml;r SSH-Anwender</heading>

	  <p>Die kommerzielle SSH Version aus dem Paket <package/ssh/ (vor
	  Release 2.2) oder im Paket <package/ssh-nonfree/ (Release 2.2) wurde
	  durch die DFSG freie OpenSSH Variante im Paket <package/ssh/ ersetzt. Die
	  kommerzielle Variante ist nicht mehr verf&uuml;gbar. Das Paket
	  <package/ssh/ enth&auml;lt eine Debconf Frage ob Sie die SSH
	  Konfiguration in eine OpenSSH kompatible wandeln wollen.</p>

          <p>Bitte beachten Sie dass <package/ssh/ in dieser Release root
          logins per default zul&auml;sst (Diese waren in 2.2 abgestellt). Wenn sie
          dieses Feature nicht ben&ouml;tigen stellen Sie sicher dass die
          <tt/PermitRootLogin/ option in <file>/etc/ssh/sshd_config</file> auf
          <tt/no/ gestellt ist. Um sicherzustellen dass dpkg diese Datei
          niemals ver&auml;ndert editieren Sie sie einfach. Das zuf&uuml;gen einer
          Leerzeile ist genug.</p>
	</sect1>

        <sect1><heading>Beachtenswerte Verzeichnisse</heading>

          <p>Es ist wichtig, dass das <file>/etc/rcS.d</file>-Verzeichnis 
	  existiert. Dies ist in erster Linie f&uuml;r das Upgrade wichtig,
	  da die Installation des <package/libc6/ Paketes sonst fehlschlagen w&uuml;rde.
	  </p>
	  
	  <p> Das <file>/usr/share/doc</file> Verzeichnis 
         (wenn es bereits existiert) sollte kein Symlink 
	 (zB auf <file>/usr/doc</file>) sein, da dadurch die Installation einiger 
	 Pakete fehlschlagen k&ouml;nnte. Sie k&ouml;nnen <file>/usr/doc</file>
	 aber auf <file>/usr/share/doc</file> symlinken. 
	 Bitte beachten Sie, dass Sie, wenn Sie einen solchen Symlink
         verwenden, eine Vielzahl von Meldungen &uuml;ber nicht verschiebbare
         Dateien in <file>/usr/doc</file> erhalten werden. Dies ist 
	 normal. Sie k&ouml;nnen diese Meldungen ignorieren.</p>
	</sect1>

      <sect id="upgrade-process"><heading>Vorbereiten der Quellen f&uuml;r APT</heading>

	<p>Die empfohlene Methode das System zu aktualisieren ist die Nutzung
	von <prgn/apt-get/ durch <prgn/dselect/ wie es im folgenden
	beschrieben wird. Die eingebaute Abh&auml;ngigkeitsanalyse erlaubt saubere
	und einfache Aktualisierungen/Installationen.</p>

	<p>Sie sollten <em/keine/ gr&ouml;&szlig;eren Paket-Aktualisierungen mit anderen
	"Access"-Methoden als <prgn/apt/ in <prgn/dselect/ durchf&uuml;hren, da
	diese, anders als die <prgn/apt/ Methode, keine logische Paketordnung
	durchf&uuml;hren und deswegen nicht so verl&auml;&szlig;lich bei der Aktualisierung
	sind. Obendrein sind solche Aktualisierungen nicht gut getestet und
	werden von Debian nicht unterst&uuml;tzt wenn Fehler auftreten.</p>

	<p>Alle Paket-Installations-Operationen m&uuml;ssen mit 
	  Superuser-Rechten ausgef&uuml;hrt werden, entweder als root 
	  oder mit <prgn/sudo/ um zu den notwendigen Rechten 
	  zukommen </p>

	<p>Bevor Sie die Aktualisierung starten, m&uuml;ssen Sie zun&auml;chsts die
	  <package/apt/-Konfiguration f&uuml;r die Paketliste 
	  anpassen. <file>/etc/apt/sources.list</file>.</p>
	
	<p><package/apt/ verwendet alle Pakete, die &uuml;ber jede 
	  "<tt>deb</tt>" Zeile gefunden werden k&ouml;nnen und installiert 
	  die Pakete mit der h&ouml;chsten Versionsnummer, wobei die 
	  Priorit&auml;t in den ersten angef&uuml;hrten Zeilen liegt.
          So k&ouml;nnen Sie z.b. erst ihr Paketverzeichnis auf der Festplatte,
	  dann CD-ROMs und dann HTTP/FTP Server angeben.</p>


<![ %i386 %m68k %sparc %alpha [
	<sect1><heading>Aktualisierung einer Pre-Slink Release</heading>

	<p>Wenn Sie von einer &debian; Release 2.1 oder fr&uuml;her aktualisieren
	wollen ben&ouml;tigen sie die <package/apt/ und <package/dpkg/ Versionen
	die auf <url id="http://http.us.debian.org/debian/dists/potato/main/upgrade-&architecture;/"> 
        zum Download bereitliegen.</p>

<!-- alternatively they're at:
<url id="http://panic.et.tudelft.nl/~costar/potato/">)
-->

	<p>Laden und installieren Sie diese Dateien mit folgenden Befehlen (in
	exakt dieser Reihenfolge):
  
           <example>
           
             dpkg -i dpkg_version_&architecture;.deb
             dpkg -i apt_version_&architecture;.deb

           </example></p>

	<p>Dies sind speziell kompilierte statische Versionen die auf jedem
           Debian Sysem installiert (und benutzt) werden k&ouml;nnen.</p>

<![ %sparc [

	<p>Bevor sie die $arch-title; Architektur aktualisieren k&ouml;nnen,
           ben&ouml;tigen sie einen Linux Kernel der Version 2.2.x, wie in <ref
           id="information"> beschrieben.</p>
]]>
        <sect1><heading>Aktualisierung von Slink mit CD-ROMs</heading>
         
	<p>Wenn Sie die Aktualisierung von &debian; 2.1 ('slink') mit CD-RROMs
	vornehmen wollen, brauchen Sie die statisch kompilierten Versionen der
	Pakete <package>apt</package> und <package>dpkg</package>, verf&uuml;gbar
	auf <url id="http://http.us.debian.org/debian/dists/potato/main/upgrade-&architecture;/">.
	</p>

	<p>Nach dem Download installieren Sie diese mit folgenden Befehlen (in
           genau dieser Reihengfolge):

           <example>
           
             dpkg -i dpkg_version_&architecture;.deb
             dpkg -i apt_version_&architecture;.deb
                      
           </example> </p>

	<p>Wenn Sie von &debian; 2.1 oder sp&auml;ter kommen und &uuml;ber das Netz
	(FTP, HTTP) oder einen lokalen Mirror aktualisieren wollen, dann
	k&ouml;nnen Sie <package/apt/ und <package/dpkg/ benutzen, die mit Ihrem
	Release kamen. Sollte <package/apt/ noch nicht installiert sein m&uuml;ssen
	Sie es nat&uuml;rlich jetzt installieren.</p>

	<p>Es wird empfohlen, dass Sie die <manref name="apt-get" section="8">
	und die <manref name="sources.list" section="5"> man pages jetzt lesen.</p>

	<p>Wenn Sie die statischen Versionen von <package/apt/ und
	<package/dpkg/ installiert haben, k&ouml;nnen Sie diese manpages nur mit
	dem Befehl <tt>man -l /usr/share/man/man8/apt-get.8.gz</tt> lesen bis
	das Paket <package/man-db/ aktualisiert wurde.</p>

</sect1>

]]>


	<sect1 id="network">Angabe von zus&auml;tzlichen APT Internet Quellen

           <p>Die standardm&auml;&szlig;ige Konfiguration ist f&uuml;r die 
	   Installation von den Haupt-Debian-Internet-Servern 
	   ausgerichtet, Sie k&ouml;nnen jedoch nach Belieben in der Datei
	   <file>/etc/apt/sources.list</file> andere Mirror eintragen. 
	   Am besten sind Mirror geeignet, die Ihrem Netzwerk 
	   am n&auml;chsten sind.</p>
	  
	  <p>Die Adressen der HTTP oder FTP Mirror finden Sie unter
           <url id="&url-debian-mirrors;"> (Sie finden sie im Abschnitt 
	   "Full list of mirrors"). HTTP Mirror sind f&uuml;r gew&ouml;hnlich 
	   schneller als FTP Mirror.</p>

	  <p>Nehmen wir zum Beispiel an, Ihr n&auml;chstgelegener Debian 
	   Mirror ist <tt>http://mirrors.kernel.org/debian/</tt>. 
	   Wenn Sie sich diesen Spiegel mit einem Browser oder 
	   einem FTP-Programm genauer ansehen, werden Sie feststellen, 
	   dass die Hauptverzeichnisse auf die folgende Art und 
	   Weise angeordnet sind:

           <example>
           
             http://mirrors.kernel.org/debian/dists/&releasename;/main/binary-&architecture;/...
             http://mirrors.kernel.org/debian/dists/&releasename;/contrib/binary-&architecture;/...
       
           </example></p>

           <p>Um diesen Mirror mit <prgn/apt/ zu verwenden, erg&auml;nzen Sie die Datei
           <file/sources.list/ file mit der folgenden Zeile:

           <example>
           
             deb http://mirrors.kernel.org/debian &releasename; main contrib
 
           </example></p>

           <p>Beachten Sie, dass `<tt>dists</tt>' implizit dazugegeben 
	   wird und die Argumente die nach der Release folgen,
	   verwendet werden um Pfade in mehrere Verzeichnisse zu erstrecken.</p>

	  <p>Wenn der Spiegel auch non-US Abschnitte unter 
           http://mirrors.kernel.org/debian/debian-non-US enth&auml;lt, 
	   so f&uuml;gen Sie zus&auml;tzlich folgende Zeile hinzu:

           <example>

             deb http://mirrors.kernel.org/debian/debian-non-US &releasename;/non-US main contrib

           </example></p>

           <p>Nachdem Sie die neuen Quellen angegeben haben, 
	   deaktivieren Sie die vorherigen "<tt/deb/" Zeilen 
	   in <file/sources.list/, in dem Sie eine Raute (<tt/#/) 
	   am Beginn der Zeile setzen.</p>

	  <p>Jedes Paket, dass f&uuml;r die Installation ben&ouml;tigt wird 
	   und &uuml;ber das Netz geladen wird, wird im Unterverzeichnis
	   <file>/var/cache/apt/archives</file> w&auml;hrend des Downloads 
	   gespeichert. Vergewissern Sie sich daher vor der Aktualisierung 
	   dass Ihnen gen&uuml;gend Platz zur Verf&uuml;gung steht. Bei einer
           durchschnittlichen Installation von Debian 
	   m&uuml;ssen Sie mit zirka 300 MB Downloadvolumen rechnen.
           </p> 

	  <!-- At least, that's what one report said - JAB -->

	  <![ %not-sparc [ 

	  <p>Beachten Sie, wenn Sie die statische Version von <package/apt/
           und <package/dpkg/ verwenden, dass das hostname-lookup kaputt ist 
	   (dies ist ein Grund warum man auch das normale 
	   <package/apt/ verwenden sollte, wenn man &uuml;ber das Netz aktualisiert.
	   Die L&ouml;sung ist einfach. Schreiben Sie die IP-Adresse des Mirrors in
           in die "<tt>deb</tt>" Zeile. (Die IP-Adresse finden Sie mit nslookup: 
	   <tt>nslookup Servername</tt>)</p>
           
]]>	</sect1>

         <sect1 id="localmirror"><heading>Hinzuf&uuml;gen von APT Local Mirror Sources</heading>

           <p>Anstatt HTTP oder FTP Paket-Mirror, k&ouml;nnen Sie, wenn 
	   Sie m&ouml;chten, auch <file>/etc/apt/sources.list</file> &auml;ndern 
	   um einen Spiegel auf der lokalen Festplatte (evtl. NFS-mounted)
           zu verwenden. </p>

	  <p>Nehmen wir an Ihr Paket-Mirror liegt auf 
           <file>/var/ftp/debian/</file>, und hat viele 
	   Hauptverzeichnisse die wie folgt aussehen:

           <example>
           
             /var/ftp/debian/dists/&releasename;/main/binary-&architecture;/...
             /var/ftp/debian/dists/&releasename;/contrib/binary-&architecture;/...
           
           </example>

           <p>Um dies mit <prgn/apt/ zu verwenden, f&uuml;gen Sie folgende Zeile zu 
           <file/sources.list/:

           <example>
             deb file:/var/ftp/debian &releasename; main contrib
           </example>

           <p>Beachten Sie dass `<tt>dists</tt>' implizit hinzugef&uuml;gt 
	   wird, und dass die Argumente die nach der Release stehen 
	   dazu verwendet werden um den Pfad in mehrere Verzeichnisse 
	   zu erweitern.
           </p>

	  <p>Wenn Ihr lokaler Mirror non-US/*-Abschnitte unter
           <file>/var/ftp/debian-non-US</file> enth&auml;lt, so f&uuml;gen Sie die
           folgende Zeile hinzu:

          <example>
            deb file:/var/ftp/debian-non-US &releasename;/non-US main contrib
          </example></p>

          <p>Nachdem Sie neue Quellen hinzugef&uuml;gt haben, deaktivieren Sie die
          vorgehenden "<tt/deb/" Zeilen in dem Sie eine Raute (<tt/#/) an
          den Beginn der Zeile setzen.</p>

        <sect1 id="cdroms"><heading>Hinzuf&uuml;gen von APT CD-ROM Quellen</heading>

<![ %not-sparc [ 

          <p>Installieren Sie bitte, wie oben beschrieben, zuerst die aktuelle
          Version von <package/apt/ und <package/dpkg/.</p>

	  ]]>

          <p> Wenn Sie <em/ausschlie&szlig;lich/ CDs verwenden m&ouml;chten, 
	  kommentieren Sie die bestehenden "<tt/deb/" Zeilen 
	  in <file>/etc/apt/sources.list</file> aus, in dem Sie eine 
          Raute (<tt/#/) an den Beginn der Zeile setzen.</p>

          <p>Vergewissern Sie sich, dass es eine Zeile in der Datei
	  <file>/etc/fstab</file> gibt, die das mounten Ihres CD-ROM-Laufwerks
	  in <file>/cdrom</file> erm&ouml;glicht (der exakte 
	  <file>/cdrom</file>-Mountpoint wird f&uuml;r <prgn/apt-cdrom/ ben&ouml;tigt). 
	  Nehmen wir an, Ihr <file>/dev/hdc</file> sei das CD-ROM-Laufwerk,
	  dann sollte <file>/etc/fstab</file> folgende Zeile beinhalten: 

          <example>
             
             /dev/hdc /cdrom auto defaults,noauto,ro0 0
             
          </example>

          <p>Beachten Sie, hier darf <em/kein Leerzeichen/ zwischen den W&ouml;rtern
          <tt>defaults,noauto,ro</tt> im vierten Feld sein.</p>

          <p>Um sicher zu gehen, dass es funktioniert, legen Sie eine CD ein
             und versuchen Sie diese zu mounten.

          <example>
 
            mount /cdrom (dies mountet die CD am Mount-Point)
            ls -alF /cdrom (dies sollte das Root-Verzeichnis der CD anzeigen)
            umount /cdrom (unmountet die CD)
     
          </example></p>

          <p>und f&uuml;hren Sie danach den folgenden Befehl

          <example>
            apt-cdrom add
          </example></p>

          <p>f&uuml;r jede weitere bin&auml;re Debian CD-ROM aus, um die Daten 
	  &uuml;ber die CD in APT's Datenbank einzuf&uuml;gen. </p>
	</sect1>
      </sect>

        <sect id="dselectupgrade"><heading>Aktualisierung mit dselect</heading>
          
	<p>Die empfohlene Methode auf &debian; &release; zu aktualisieren ist
          die Benutzung von <prgn>dselect</prgn>. Dieses Tool trifft sicherere
          und bessere Entscheidungen &uuml;ber Pakete als <prgn>apt-get</prgn>.</p>

	<p>Wenn <prgn>dselect</prgn> nicht installiert ist installieren Sie es
          bitte jetzt.</p>

          
	<p>Die Methode um auf das Debian Archive zuzugreifen (unter Nutzung
           von APT) wurde bereits konfiguriert, aber Sie k&ouml;nnen diese im
           "[A]ccess" menu von dselect umstellen. Wenn Sie mit Ihren
           Einstellungen zufrieden sind starten Sie den n&auml;chsten Schritt mit
           der Auswahl von "[U]pdate". Dies wird die Paketdatenbank aktualisieren.</p>

	<p>Wenn dabei keine Probleme auftraten w&auml;hlen Sie nun "[S]elect" im
          Men&uuml; und <prgn>dslect</prgn> wird die verf&uuml;gbaren Paketlisten lesen
          und intelligent entscheiden welche Pakete eine Aktualisierung
          ben&ouml;tigen, sowie welche Pakete neuinstalliert werden m&uuml;ssen um die
          Aktualisierung zu vervollst&auml;ndigen. Es wird ausserdem Pakete
          anbieten die gel&ouml;scht werden sollten. Durch Bet&auml;tigen der
          Return-Taste in der Paketauswahl bekommen Sie entweder einen
          Bildschirm zur L&ouml;sung von Abh&auml;ngigkeitsproblemen (wo Sie &Auml;nderungen
          vornehmen k&ouml;nnen und erneut Return dr&uuml;cken) oder Sie landen direkt
          wieder im Menu. Hilfe in der Paketauswahl bekommen Sie durch Dr&uuml;cken
          der Taste "?".</p>

	<p>Nachdem die Paketauswahl getroffen wurde ist es notwendig die neuen
          Paketversionen zu installieren. Um dies zu tun w&auml;hlen Sie
          "[I]nstall" aus dem Menu. Dies wird alle Pakete herunterladen und
          installieren, mit Hilfe von <prgn>apt</prgn>. In der Zwischenzeit
          ist genug Zeit f&uuml;r eine Tasse Tee oder Kaffee.</p>

	<p>Die beiden letzten Schritte sind "[C]onfig" und "[R]emove" welche
	den Aktualisierungsprozess vervollst&auml;ndigen indem neue Pakete
	konfiguriert und redundante Pakete gel&ouml;scht werden.</p>

        <sect id="aptupgrade"><heading>Aktualisierung mit direkter Nutzung von apt-get (nicht empfohlen)</heading>

	<p>Vergessen Sie nicht alle ben&ouml;tigten Partitionen (zB die Root-
          und die <file>/usr</file>-Partitions) read-write zu mounten. Dies
          geht zum Beispiel mit folgendem Kommando:
	
          <example>
            mount -o remount,rw /<var>mountpoint</var>
          </example></p>

          <p>Angenommen Sie haben bereits <package/apt/'s
          <file/sources.list/ wie oben beschrieben konfiguriert.
          F&uuml;hren Sie nun folgendes aus (als root):

          <example>
            apt-get update
          </example></p>

	<p>Dies synchronisiert die Paketlisten aus Ihren Quellen und
          aktualisiert die Informationen &uuml;ber neue und aktualisierte Pakete.</p>

	<p>Es wird dringend empfohlen das Programm
	<prgn>/usr/bin/script</prgn> f&uuml;r die Aufzeichnung eines transcripts
	der Aktualisierung zu benutzen. Sollten irgendwelche Probleme dabei
	auftreten haben Sie ein Log der durchgef&uuml;hrten Aktionen und k&ouml;nnen, so
	ben&ouml;tigt, detaillierte Informationen in einem Bug-Report geben. F&uuml;hren
	Sie daf&uuml;r folgendes Kommando aus

          <example>
            script -a ~/upgrade-to-woody.typescript
          </example></p>

	<p>Lassen Sie das Transcript nicht in ein tempor&auml;res Verzeichnis wie
           <file>/tmp</file> oder <file>/var/tmp</file> schreiben, da diese
           bei der Aktualisierung oder bei einem Neuboot gel&ouml;scht werden k&ouml;nnen.</p>

	<p>Es ist wichtig die Pakete apt, dpkg und debconf zu aktualisieren
	bevor sie den eigentlich Aktualisierungsprozess starten. Apt wurde
	entscheidend weiterentwickelt seit dem letzten Release. Debconf ist
	ein wesentliches tool welches extensiv von den Paketen benutzt wird.
          
          <example>
            apt-get install dpkg apt debconf
          </example></p>

	<p>Dies installiert die neuesten Versionen von  <package/dpkg/,
          <package/apt/ und <package/debconf/, welche f&uuml;r den Rest der
          Aktualisierung ben&ouml;tigt werden. Es aktualisiert ausserdem einige
          notwendige Systembibliotheken zu den neuesten Versionen.</p>

	<p>Wenn debconf nachfragt welchen Typ Fragen es stellen soll, w&auml;hlen
          Sie nicht 'critical' oder sie werden wichtige Fragen verpassen.</p>

<!-- i.e. libc6 and libstdc++ that dpkg and apt depend on - JAB -->


	<p>Einige Leute bevorzugen es zuerst auszuprobieren was bei der
          Aktualisierung passiert. Benutzen Sie dazu

          <example>
            apt-get --fix-broken --show-upgraded --simulate dist-upgrade | pager
          </example></p>

	<p>Dies dauert zwar eine Weile, es kann Sie allerdings vor
	  b&ouml;sen &Uuml;berraschungen bewahren. Es teilt Ihnen mit was mit 
	  Ihrem System nicht in Ordnung ist, und wie Sie dieses 
	  Problem l&ouml;sen k&ouml;nnen. Es teilt Ihnen auch mit, was 
	  w&auml;hrend des Upgrades passiert. Schenken Sie besonders den
	  Paketen, die "REMOVED" werden grosse Aufmerksamkeit. 
	  Keine wichtigen Pakete sollten hier aufgelistet werden. </p>

	<p>Nachdem Sie sichergestellt haben, dass <prgn/apt-get/ gut
          funktioniert starten Sie

          <example>
            apt-get --fix-broken --show-upgraded dist-upgrade
          </example></p>

          <p>Dies f&uuml;hrt eine komplette Aktualisierung Ihres Systems durch. 
	  Es installiert zB die neueste Version aller Pakete und l&ouml;st 
	  m&ouml;gliche Abh&auml;ngigkeits&auml;nderungen zwischen Paketen in 
	  verschiedenen Releases. Wenn es notwendig ist, installiert 
	  es einige neue Pakete (zu meist neue Library-Versionen, 
	  oder es benennt Pakete um) und entfernt obsolete Pakete 
	  die Konflikte verursachen.</p>

	<p>Wenn Sie von CD-ROMs aktualisieren, werden Sie an bestimmten
	  Punkten dazu aufgefordert eine bestimmte CD einzulegen.
          Eventuell m&uuml;ssen Sie dieselbe CD mehrere Male einlegen; da die
          Pakete inter-related und &uuml;ber die gesamten CDs verstreut sind.</p>


	<p>Neue Versionen von derzeit installierten Paketen, die nicht
	  aktualisiert werden k&ouml;nnen ohne den Installations-Status eines
          anderen Pakets zu ver&auml;ndern, bleiben unver&auml;ndert
	  (angezeigt als "held back", also als zur&uuml;ckgehalten). 
          Dadurch kann es notwendig werden mit <prgn/dselect/ oder <prgn/dpkg/
	  einige Pakete zu l&ouml;schen und neuzuinstallieren um alle
	  Abh&auml;ngigkeiten aufzul&ouml;sen. Alternativ kann <tt>apt-get
	  dselect-upgrade</tt> nach einem <tt>apt-get -f dist-upgrade</tt>
	  probiert werden. (Siehe auch <manref name="apt-get" section="8">
	  manpage).</p>

	<p>Die <tt/--fix-broken/ (oder nur <tt/-f/) Option 
	  l&auml;sst <package/apt/ versuchen ein System mit kaputten Abh&auml;ngigkeiten
	  zu reparieren. <package/apt/ versucht kaputte Abh&auml;ngigkeiten
	  im System zu vermeiden.</p>

        <sect1 id="trouble"><heading>M&ouml;gliche Probleme w&auml;hrend oder nach einer Aktualisierung</heading>

          <p>Manchmal ist es notwendig die APT::Force-LoopBreak-Option 
	  in APT zu aktivieren, damit man bei eventuell auftretenden
	  Conflicts/Pre-Depends-Schleifen tempor&auml;r wichtige 
	  Pakete entfernen kann. <prgn/apt-get/ wird sie dar&uuml;ber informieren
	  und die Aktualisierung abbrechen. Sie k&ouml;nnen dass umgehen indem Sie
	  die <tt>-o APT::Force-LoopBreak=1</tt> Option f&uuml;r <prgn/apt-get/
          benutzen.</p>

	  <p>Es ist auch m&ouml;glich, dass die Abh&auml;ngigkeitsstruktur des Systemes 
	  so kaputt ist, dass ein manueller Eingriff notwendig wird. 
	  F&uuml;r gew&ouml;hnlich bedeutet dies dass <prgn/dselect/ verwendet 
	  werden muss oder

          <example>
          
            dpkg --remove <var>packagename</var>
          
          </example></p>

          <p>um einige der kaputten Pakete zu l&ouml;schen, oder

          <example>

            apt-get --fix-broken --show-upgraded install
            dpkg --configure --pending

          </example></p>

          <p>Im Extremfall k&ouml;nnen Sie mit dem folgenden 
	  Befehl eine Re-Installation einleiten:

          <example>

            dpkg --install /path/to/packagename.deb

          </example></p>

          <p>Nachdem dies gekl&auml;rt ist, sollten Sie das Upgrade 
	  fertigstellen k&ouml;nnen, indem Sie
	  das vorhin beschriebene <tt/dist-upgrade/ wiederholen.
          </p>


	  <p>W&auml;hrend der Aktualisierung werden Sie einige Fragen zur
          Konfiguration oder erneuten Konfiguration von Paketen gestellt
          bekommen. Wenn Sie gefragt werden ob eine Datei in den Verzeichnissen
          <file>/etc/init.d</file> oder <file>/etc/terminfo</file>, oder die
          Datei <file>/etc/manpath.config</file> durch die Datei des
          Paket-Maintainers ersetzt werden soll, so ist es normalerweise
          notwendig mit `yes' zu antworten um sicherzustellen dass dass System
          in einem konsistenten Zustand ist. Sie k&ouml;nnen die alte Version immer
          wiederherstellen, da sie mit der Erweiterung <tt/.dpkg-old/
          gesichert wird.</p>

          <p>Wenn Sie sich nicht sicher sind, was Sie tun sollen, 
	  schreiben Sie den Namen des Pakets oder der Datei auf 
	  und k&uuml;mmern Sie sich sp&auml;ter darum. Sie k&ouml;nnen immer 
	  noch in der Transcript-Datei nach der Meldung suchen, 
	  die am Bildschirm w&auml;hrend des Upgrades ausgegeben wurde.</p>
	</sect1>

        <sect1 id="nownownow"><heading>Was Sie vor dem n&auml;chsten Neustart tun sollten</heading>

          <p>Wenn <tt>apt-get dist-upgrade</tt> beendet wurde, ist das
          "formelle" Upgrade fertig, aber es gibt noch ein paar 
	  Kleinigkeiten die man <em/vor/ dem n&auml;chstem Neustart beachten sollte.</p>

	  <p>Am wichtigsten ist, dass die Pakete <package/locales/ und
          <package/util-linux/ eventuell noch installiert werden m&uuml;ssen. Dies
          kann mit folgendem Befehl erledigt werden.

          <example>
            apt-get install locales util-linux
          </example></p>

          <p>Wenn Sie von Debian version 2.0 oder fr&uuml;her kommen, 
	  entfernt dieser Schritt das 
          <package/getty/-Paket, da sich <prgn/getty/ nun im 
	  <package/util-linux/-Paket befindet.</p>

	  <![ %powerpc [ 

          <p> Wenn Sie Debian auf &arch-title;, auf Woody upgraden, wird 
	  ADB auf Linux-Keycodes ge&auml;ndert. Sie werden auf alle F&auml;lle 
	  gewarnt wenn Sie <package/console-data/ aktualisieren. Wenn Sie 
	  weiterhin einen Kernel mit ADB-Keymap verwenden, ist es 
	  notwendig, dass Sie Ihre Boot-Argumente &auml;ndern, damit die 
	  Linux-Keycodes beim Reboot aktiv werden. Genauere 
	  Informationen finden Sie unter <url id="&url-ports;keycodes">.</p>

	  ]]> 

          <p>Es m&uuml;ssen wahrscheinlich mehr Pakete installiert werden als 
	  <prgn/apt-get/ vorschl&auml;gt, da <prgn/apt-get/ nicht automatisch 
	  die Pakete ausw&auml;hlt die von anderen abh&auml;ngen
	  (z.B. alle Pakete in Recommends: and Suggests: fields). Diese 
	  sind aber sehr einfach zu finden.
	  Verwenden Sie daf&uuml;r <prgn/dselect/ oder ein anderes 
	  graphisches Frontend. W&auml;hlen Sie unter <prgn/dselect/ die `apt' Method 
	  mit [A]ccess (wenn Sie dies noch nicht getan haben) und erneuern Sie
	  die Datenbank mit den Paketinformationen indem Sie [U]pdate
	  aufrufen. Danach dr&uuml;cken Sie `o', `o', `v' und Shift-d in [S]elect
          und suchen Sie nach der

          <example>
          
            --- Obsolete and local packages present on system ---
          
          </example></p>

<!-- Some potato examples would be better; maybe I can provide some at
a later time - JAB -->

          <p>header. In diesen Abschnitt werden alle solchen Pakete 
	  angezeigt. Zum Beispiel wurde das alte Paket <package/gimp/ durch
	  <package/gimp1.2/ ersetzt. Sie k&ouml;nnen entweder neue Pakete mit
	  <prgn/dselect/ installieren (welches dann in Aufl&ouml;sung des
	  Konfliktes das alte Paket entfernt) oder mit folgendem Befehl

          <example>
 
            apt-get install gimp1.2

          </example></p>

          <p>die &auml;ltere Version ersetzen (Sie m&uuml;ssen nur best&auml;tigen).
          </p>

          <p>Ein anderes Beispiel das oft nicht gezeigt wird - nicht einmal unter 
          <prgn/dselect/, sind telnet/talk Clients und Server, 
	  sowie die NFS-Server, die von dem alten <package/netstd/-Paket getrennt 
	  wurden. Sie k&ouml;nnen diese durch den folgenden Befehl installieren:

          <example>
            apt-get install telnet telnetd talk talkd nfs-server
          </example></p>

          <p>Das selbe gilt f&uuml;r <package/manpages-dev/, das von 
          <package/manpages/ getrennt wurde.</p>

          <p>Wenn Sie mehr &uuml;ber die Aufsplittung in Pakete erfahren m&ouml;chten,
	  lesen Sie bitte im vorherigen Release-Notes-Dokument nach. Sie 
	  finden dort unter <ref id="renames"> und <ref id="splits">
	  eine Liste der geteilten Pakete.</p>

	  <![ %not-sparc [
	  <![ %not-alpha [

          <p>Wenn Sie von Debian Version 2.0 oder fr&uuml;her aktualisieren <em/und/
	  Sie X Window installiert haben, so geben Sie bitte die folgenden
	  Befehle ein:

         <example>

           apt-get remove xbase
           apt-get install xfonts-base xfonts-75dpi xfonts-100dpi xfonts-scalable

         </example>

	 Wenn Sie <prgn/xdm/ nicht w&auml;hrend des boot-Vorganges starten m&ouml;chten 
	 ("X autostart"), f&uuml;hren Sie bitte folgenden Befehl aus:

         <example>
         
           apt-get remove xdm

         </example></p>

         <p>Weitere Informatitonen finden Sie unter
         <file>/usr/share/doc/xfree86-common/README.Debian-upgrade</file> aber 
	 das waren an und f&uuml;r sich die notwendigen Schritte.
	 </p>

	  <p>Das Konfigurations-System f&uuml;r die Kernel-Module hat sich seit
         &debian; release 2.0 ver&auml;ndert. Wenn Sie von  Debian 2.0 oder fr&uuml;her kommen,
	 so m&uuml;ssen Sie Ihr System vor dem n&auml;chsten Reboot konvertieren. Normalerweise
         sollte das ausf&uuml;hren von <tt>update-modules force</tt> ausreichend sein;
	 es wird Ihnen dennoch nahegelegt die Manual Pages
         <manref name="update-modules" section="8"> durchzulesen.
         </p>
	  ]]>
	  ]]>

	  <![ %i386 [ 

	  <p>Wenn Sie von &debian; Version 1.x (zB niedriger als 2.0) upgraden,
	 so verwendete das alte System `libc5'-Libraries, w&auml;hrend das 
	 aktualisierte System `libc6'-Libraries verwendet. <file/utmp/ and <file/wtmp/ 
	 haben unter `libc6' ein neues Format. Sie k&ouml;nnen dies ausprobieren,
	 indem Sie den <prgn/last/-Befehl ausf&uuml;hren. Zuvor ist allerdings ein 
	 Reboot erforderlich. Vergessen Sie allerdings nicht, zuerst die alten Dateien
	 zu kopieren und existierende Dateien zu leeren. Dies funktioniert
	 mit folgenden Befehl:

         <example>
           
           cd /var/log
           mv wtmp wtmp.libc5
           touch wtmp
           cd /var/run
           cp /dev/null utmp
         
         </example></p>

         <p>Rebooten Sie danach Ihr System (beachten Sie: dieser Schritt ist
	 f&uuml;r Debian Release 2.0 und h&ouml;her <em/nicht/ notwendig). Nachdem 
	 Sie neu gestartet haben korrigiert der <prgn/last/-Befehl die Daten wieder.

]]>

         <p>Beachten Sie, dass der Linux-Kernel <em/nicht/ durch diese Schritte 
	 aktualisiert wird, Sie k&ouml;nnen nun, wenn Sie m&ouml;chten, das <package/kernel-image-*/-Paket selbst
	 installieren oder einen benutzerdefinierten Kernel kompilieren </p>

	  <p>Genie&szlig;en Sie Ihr neues &debian; &release;-System! :-)</p>
	</sect1>
      </sect>
    </chapt>
    ]]>
    ]]>
    ]]>
    ]]>
    ]]>

    <chapt id="errata">

      <heading>Errata</heading>

      <sect id="virusscanners">
        <heading>Hinweise f&uuml;r die Benutzer von Virenscannern</heading>

	<p>Die Benutzer von Virenscannern wie z.B <prgn/amavis/, <prgn/scannerdaemon/
	und <prgn/clamav/ sollten ihre Pakete auf jeden Fall aktuell halten, ansonten
	besteht die M&ouml;glichkeit, da&szlig; ein fehlerhaftes Paket einem Virus
	erm&ouml;glicht, in das System einzudringen oder es zu verlassen, was schlimme
	Konsequenzen haben k&ouml;nnte. Es sollte auch erw&auml;hnt werden, da&szlig;
	die Virendatenbank in woody nun statisch und &uuml;berfl&uuml;ssig ist.
	Eine m&ouml;gliche L&ouml;sung ist die Verwendung des "pinning"-Features
	von <prgn/apt/ f&uuml;r die Antivirus-Pakete aus testing oder unstable.
      </sect>

      <sect id="tz-ee">

        <heading>Estnische Zeitzone</heading>
	
	<p>Die gesetzliche Regelung Nr. 84 (21.02.2002, Estnische Regierung), g&uuml;ltig
	ab dem 01.03.2002, legt fest, da&szlig; ab diesem Jahr (Fr&uuml;hling 2002)
	eine Sommerzeit in Estland eingef&uuml;hrt wird. Diese beginnt am letzten Sonntag
	des Monats M&auml;rz um 01:00 Uhr GMT (03:00 Uhr lokaler Zeit) und endet am
	letzen Sonntag des Monats Oktober, 01:00 Uhr GMT (04:00 Uhr lokaler Zeit).
	Sie sollten in der Lage sein, genau die selbe Konfiguration wie f&uuml;r 
	Helsinki, zu finden in der Datei
	<file>/usr/share/zoneinfo/Europe/Helsinki</file>, zu verwenden.
      </sect>

    </chapt>

    <chapt id="moreinfo">

      <heading>Weitere Informationen &uuml;ber Debian GNU/Linux</heading>

      <sect id="morereading"> <heading>Weiteref&uuml;hrende Informationen</heading>
	<p>
	Informationen &uuml;ber Release-Notes und Installation-Guide hinaus
	finden Sie im Debian Documentation Project (DDP), dessen Ziel es ist, eine
	hoch-qualitative Dokumentation f&uuml;r Debian-User und Entwickler zu 
	erstellen. Die Dokumentation beinhaltet unter anderem einen Debian Guide,
	Debian Maintainers Guide und Debian FAQ, sowie vieles mehr. Sie finden 
	diese Informationen auch im Web unter <url id="http://www.debian.org/doc/ddp"></p>

        <p>Dokumentationen &uuml;ber individuelle Pakete sind unter
        <file>/usr/share/doc/<var>package</var></file> verf&uuml;gbar, 
	dies beinhaltet zumeist Copyright Informationen, Debian spezifische Details
	und Upstream-Dokumentationen.
        </p>
	
      </sect> 
      
      <sect id="gethelp"> 
        <heading>Hilfe erhalten</heading> 
	
        <p> Es gibt viele Hilfe-Quellen, Ratschl&auml;ge und Support f&uuml;r Debian
	Nutzer, aber auf diese sollten Sie erst dann zur&uuml;ckgreifen, wenn 
	die Suche nach den ben&ouml;tigen Informationen in den Dokumentationen
	aller Quellen erfolglos verlief. Dieser Abschnitt bietet eine 
	kurze Einf&uuml;hrung in diese Quellen, die f&uuml;r Debian-Neulinge
	sehr hilfreich sein k&ouml;nnen.</p>
	
	<sect1 id="lists">
	  <heading>Mailinglisten</heading>

	  <p>Die interessanteste Mailingliste f&uuml;r deutsche Debian Nutzer ist
	  debian-user-german, aber auch andere sind interessant. F&uuml;r
	  Informationen &uuml;ber diese Listen besuchen sie <url
	  id="&url-debian-list-archives;">. Bitte suchen Sie im Archiv bevor
	  sie eine Frage an die Liste stellen, ob nicht bereits jemand diese
	  Frage stellte und eine Antwort vorhanden ist. Beachten sie ausserdem
	  die Netiquette.</p>

      </sect1>
	<sect1 id="irc">
	  <heading>Internet Relay Chat</heading> 
	  
	  <p>Debian hat einen IRC-Channel der sich mit Support und Hilfe
	von Debian-User im Open Project IRC Network befasst.  Das
	Open Project IRC Network bietet durch das Teilen von Resourcen
	hilfreiche Informationen. Diesen IRC-Channel k&ouml;nnen Sie mit 
	Ihrem IRC-Client unter irc.openproject.net unter #debian
	erreichen. Ein deutschsprachiger Channel ist #debian.de.
	</p>

	  <p>Bitte halten Sie sich an die Richtlinien des Channels und respektieren
	Sie die anderen User. Weitere Informationen zu Open Projects finden Sie auf 
	deren Webseite: <url id="http://www.openprojects.net" name="OpenProjects.Net">.</p>
	</sect1> 
      </sect>
      <sect id="bugs">
        <heading>Bugs berichten</heading>
        
	<p>Wir versuchen Debian GNU/Linux zu einem Betriebssystem h&ouml;chster
        Qualit&auml;t zu machen, aber dies bedeutet leider nicht dass die Pakete
        die wir anbieten komplett frei von Bugs sind. Als einen Service an
        unsere Nutzer bieten wir alle Informationen &uuml;ber Fehler in unserem
        eigenen "Bug Tracking System" (BTS) an. Sie k&ouml;nnen dieses &uuml;ber <url
        id="&url-bts;" name="bugs.debian.org"> erreichen. Dies geschieht in
        &Uuml;bereinstimmung mit Debians offenem Entwicklungsmodell.</p>

	<p>Wenn Sie einen Bug in der Distribution oder in einem Paket davon
        finden berichten Sie diesen bitte, so das er f&uuml;r die n&auml;chste Release
        behoben werden kann. Um einen Bug zu berichten ben&ouml;tigen Sie eine
        g&uuml;ltige Email Adresse, da die Entwickler so mit der berichtenden
        Person in Kontakt treten k&ouml;nnen wenn Sie weitere Informationen ben&ouml;tigen.</p>

	<p>Sie k&ouml;nnen einen Bericht entweder durch die Nutzung von
	<package>reportbug</package> oder von <package>bug</package>
	(verf&uuml;gbar in entsprechenden Paketen), oder manuell durch Nutzung von
	email einsenden. Sie k&ouml;nnen mehr &uuml;ber das BTS und seine Benutzung erfahren wenn
	Sie die Referenz-Karte (zu finden in
	<file>/usr/share/doc/debian</file> bei einem installierten System)
	oder online im <url id="&url-bts;" name="Bug Tracking
        System"> lesen.</p>

      </sect>

      <sect id="contributing">
        <heading>Zu Debian beitragen</heading>
        
	<p>Sie m&uuml;ssen kein Experte sein um zu Debian beizutragen. Indem Sie
        unseren Nutzern bei Ihren Problemen helfen (siehe <url
        id="&url-debian-list-archives;" name="Mailinglisten">) helfen Sie bereits
        mit. Probleme zu identifizieren (und zu l&ouml;sen) ist ebenfalls sehr
        hilfreich. Um Debians hohe Qualit&auml;t zu erhalten berichten Sie
        <url id="&url-bts;" name="Bugs"> und helfen Sie den Entwicklern diese
        einzukreisen und zu l&ouml;sen. Wenn Sie gut mit Worten umgehen k&ouml;nnen,
        k&ouml;nnen sie durch das Schreiben von <url id="&url-ddp;"
        name="Dokumentation"> oder <url id="&url-debian-i18n;"
        name="&Uuml;bersetzungen"> ebenfalls mithelfen.</p>

	<p>Wenn Sie mehr Freizeit haben k&ouml;nnen Sie ein St&uuml;ck freier Software
	innerhalb Debians verwalten. Sehr hilfreich ist es wenn Pakete
	&uuml;bernommen werden nach denen gefragt wurde. Eine Liste solcher Pakete
	ist in der sogenannten <url id="&url-wnpp;" name="Work Needing
        and Prospective Packages database"> zu finden. Wenn Sie Interesse in
	einer speziellen Entwicklungsrichtung haben, werden sie vielleicht
	Freude daran haben an einem Subproject von Debian teilzunehmen. Diese
	umfassen das portieren von Debian auf neue Architekturen und 
        <url id="&url-debian-jr;" name="Debian Jr."> und 
        <url id="&url-debian-med;" name="Debian Med">.</p>

	<p>Ganz egal, solange Sie auf irgendeine Art in der Free Software
	Community mitarbeiten, sei es als Nutzer, Programmierer, als Verfasser
	von Dokumentationen oder &Uuml;bersetzungen helfen Sie bereits der freien
	Software. Etwas beizutragen ist lohnend und spassig, und es erlaubt
	Ihnen,  neue Leute kennenzulernen. Au&szlig;erdem bekommen Sie dann dieses
        wohlig-warme Gef&uuml;hl in Ihnen, weil Sie was Gutes getan haben.</p>
      </sect>


    </chapt>
    <chapt id="appendix">
      <heading>Appendix</heading>
      <sect id="renames"><heading>Umbenannte Pakete</heading>


	<p>Die folgenden Pakete wurden wie gezeigt umbenannt. In den meisten,
        wenn nicht sogar allen, F&auml;llen wurden entsprechende Conflicts:,
        Replaces: und Provides: Felder (oder sogar dummy Pakete)
        bereitgestellt, so dass die neuen Pakete automatisch installiert
        und/oder die alten ersetzt oder entfernt wurden. Dies gilt auch f&uuml;r
        Pakete die in andere integriert wurden, da dies dasselbe Ergebnis wie
        ein Umbenennen ergibt.

        <example>

          gimp -&gt gimp1.2 (GIMP1.2 release only)
          dict-web1913 -&gt dictgcide
          amcl -&gt gnome-mud
          rstart -&gt xutils
          rstartd -&gt xutils
          xbooks -&gt xspecs
          xfonts-cjk -&gt xfonts-base
          xcontrib -&gt xbase-clients
          xlib6g-static -&gt xlibs-dev
          listar -&gt ecartis
          cln -&gt libcln2
          cln-dev -&gt libcln-dev
          pgp-i, pgp-us -&gt pgp
          cvs-doc -&gt cvs
          acm -&gt acm4
          user-ja -&gt language-env
          expect5.31, expect5.24 -&gt expect
          sgml-tools -&gt linuxdoc-tools
          sgmltools-2 -&gt sgmltools-lite
          bonnie -&gt bonnie++
          c2ps -&gt a2ps
          camlp4 -&gt ocaml
          corel-util -&gt nwutil
          crossfire-sounds -&gt crossfire-client-sounds
          cslatex, csplain, cstexfonts -&gt tetex
          cspsfonts -&gt tetex-extra
          custom-mule -&gt mule2-support
          docbook2x, cygnus-stylesheets -&gt docbook-utils
          db -&gt db2
          dgs -&gt xfree86
          docbook-stylesheets -&gt docbook-dsssl
          genius, drgeo -&gt drgenius
          egcs1.0 -&gt egcs1.1
          emacs19 -&gt emacs20
          f77reorder -&gt g77
          flim1.13 -&gt flim
          gdict -&gt gnome-utils
          libgmp2, gmp, gmp1 -&gt libgmp3
          gnome-users-guide-en -&gt gnome-user-docs
          gnomehack -&gt nethack
          gpasm -&gt gputils
          gsl-ref-pdf -&gt gsl-ref-ps
          gstep-core -&gt gnustep-core
          gstep-extensions -&gt gnustep-extensions
          gstep-guile -&gt gnustep-guile
          gzilla -&gt dillo
          hanterm -&gt hanterm-xf
          imap -&gt uw-imap
          iplogger -&gt ippl
          jgroff -&gt groff
          lib-sax-java, lib-xp-java, lib-xt-java -&gt xalan2, libxt-java
          libansicolor-perl -&gt perl
          libape -&gt libcommonc++
          libgc4 -&gt libgc6
          libgcj -&gt libgcj2
          libid3 -&gt id3lib
          libmalaga1 -&gt malaga
          libmpeg-mp3info-perl -&gt libmp3-info-perl
          libpth -&gt pth
          libv1.22 -&gt libv1.25
          listar -&gt ecartis
          lvm -&gt lvm10
          mdutils -&gt raidtools2
          mutt-ja -&gt mutt
          myodbc2.50.26 -&gt libmyodbc
          oldncurses, ncurses3.4, ncurses4.2 -&gt ncurses (5.2)
          nfs-server -&gt nfs-user-server
          palm-doctoolkit -&gt pyrite-publisher
          pbm2ppa -&gt pnm2ppa
          pcre, pcre2 -&gt pcre3
          puzzle -&gt tree-puzzle
          rt -&gt root-tail
          selfhtml -&gt chaos, t-gnus
          sgmlspm -&gt libsgmls-perl
          synaptics -&gt tpconfig
          tknamazu -&gt namazu2
          typist -&gt gtypist
          umich-ldap -&gt openldap
          wanderlust2 -&gt wl-beta
          wdsetup -&gt nictools-nopci
          wnn6-dev -&gt wnn6-sdk
          wxftp -&gt axyftp
          xacc -&gt gnucash
          xjscal -&gt libjsw
          zope-siteaccess -&gt zope

        </example></p>

          <p>Obwohl wir uns bem&uuml;ht haben, die Liste zu vervollst&auml;ndigen,
	  ist es m&ouml;glich, dass sie noch immer nicht ganz komplett ist.</p>
      </sect>

      <sect id="splits"><heading>Aufgeteilte Pakete</heading>
	
	<p>Zwischen Release 2.2 (`potato') und 3.0 (`woody') wurden zahlreiche 
	  Pakete in zwei oder mehrere Pakete gesplittet. Der allgemeine Grund 
	  f&uuml;r diese Aufteilung ist, dass die originalen Pakete ein Set von 
	  diversen Funktionen angeboten haben und nur einige wenige User - 
	  falls &uuml;berhaupt - diese Funktionen verwendet haben. Einige Pakete 
	  zeigen einen Hinweis w&auml;hrend der Installation, andere erw&auml;hnen 
	  es in der Paketbeschreibung und manche ignorieren es einfach.</p>
	
	<p>Wenn Sie in einem bekannten Paket alte Funktionen vermissen, 
	  pr&uuml;fen Sie die unten angef&uuml;hrte Liste, ob Sie zus&auml;tzliche Pakete 
	  nachinstallieren m&uuml;ssen um die gewohnte Funktionalit&auml;t wiederherzustellen. 
	  Sollte dies fehlschlagen, so &uuml;berpr&uuml;fen Sie das Changelog f&uuml;r die Pakete:
          <file>/usr/share/doc/<var>package</var>/changelog.Debian.gz</file>.</p>
	
	<p>Diese Liste enth&auml;lt gesplittete Pakete (die Liste ist m&ouml;glicherweise nicht komplett)
          

        <example>
         
          isdnutils -&gt ipppd, isdnlog, isdnutils-doc, isdnutils-xtools,
          isdnvboxserver, isdnvboxclient
       
          xpdf -&gt xpdf-reader, xpdf-utils, xpdf-chinese-simplified,
          xpdf-chinese-traditional, xpdf-cyrillic, xpdf-japanese,
          xpdf-korean,xpdf-thai
            
          cupsys -&gt cupsys (CUPS daemon), cupsys-client (CUPS client),
          cupsys-pstoraster (postscript rasterizer)
            
          groff -&gt groff-base, groff, groff-x11
            
          xspectemu -&gt spectemu-common, spectemu-svga, spectemu-x11
            
          ecpg -&gt  libecpg3 (library), postgresql-dev (development files)
            
          postgresql-pl -&gt libpgperl, libpgtcl
            
          netbase -&gt netbase, portmap, ifupdown, ipautofw, ipchains,
          ipfwadm, ipmasqadm, iputils, net-tools, netkit-base
            
          uqwk -&gt uqwk, uqwk-spool
            
          tetex-bin -&gt tetex-bin, texi2html
            
          xproxy -&gt lbxproxy, proxymngr, xfwp
            
          xlib6g -&gt xlibs, libxaw6
          
          xlib6g-dev -&gt libxaw6-dev, xlibs-dev  
            
          xbase-clients, xlib6g-dev, xcontrib -&gt xutils

          xconq -&gt xconq, xconq-common
            
          python-imaging-doc -&gt; python-imaging-doc,
          python-imaging-doc-html, python-imaging-doc-pdf
            
          gnumeric -&gt gnumeric, gnumeric-doc, gnumeric-python
            
          latex2rtf -&gt latex2rtf, latex2rtf-doc
            
          glade -&gt glade, glade-gnome, glade-gnome-db, glade-common,
          glade-doc
            
          apmd -&gt apmd, xapm, libapm1, libapm-dev, powermgmt-base

          uudeview -&gt uudeview, xdeview, libuu-dev
            
          sysklogd -&gt sysklogd, klogd 
           
          xtide -&gt xtide, xtide-data
            
          snack -&gt libsnack2, libsnack2-dev, libsnack2-doc
            
          gnapster -&gt gnapster, gnapster-gtk
            
          proftpd -&gt proftpd, proftpd-common, proftpd-doc, proftpd-ldap,
          proftpd-mysql, proftpd-pgsql
           
          alsaplayer -&gt alsaplayer-common, alsaplayer-gtk, alsaplayer-nas,
          alsaplayer-text, libalsaplayer-dev, libalsaplayer0 
        
        </example> </p>
      </sect>
      <sect id="removed"><heading>Gel&ouml;schte Pakete</heading>
        <sect1 id="nomaintainer">
          <heading>Gel&ouml;schte Pakete wegen fehlendem Maintainer</heading>

	  <p>Diese Pakete wurden gel&ouml;scht weil kein Debian Maintainer
          interessiert daran war diese zu verwalten. Die Nummer des
          entsprechenden Fehlerberichtes ist mit angegeben, da dieser weitere
          Informationen &uuml;ber den Grund der Paketl&ouml;schung enth&auml;lt. Um diese
          Nummer zu nutzen besuchen sie das <url id="&url-bts;" name="Bug Tracking
          System"> und suchen Sie nach der Fehlernummer.</p>

	  <p>Die Angabe "Alternatives" listet Pakete die m&ouml;glicherweise das
          gel&ouml;schte Paket ersetzen k&ouml;nnen.</p>
          
          <p><example>
            
            asclock-gtk
            Alternatives: asclock, gnome-applets
            Bug: #91943

            bridge, bridgex
            Bug: #80926

            bwnfsd
            Bug: #107083

            dialdcost
            Bug: #90361

            dotfile-doc
            Bug: #116545

            dstool
            Bug: #68308

            dstool-doc
            Bug: #68309

            gmasqdialer
            Bug: #127196

            gnats2w
            Bug: #123544

            ical
            Bug: #92286

            ircd-dalnet
            Alternatives: ircd, dancer-ircd
            Bug: #93627

            jaztool
            Bug: #91797

            libggidemos
            Bug: #111965

            libliteclue
            Bug: #95503

            libtclobjc
            Bug: #108187

            mico-2.3.0
            Bug: #91274

            pact
            Bug: #72432

            ppd-gs
            Bug: #68081

            sliplogin
            Bug: #68104

            x48
            Bug: #110944
          </example></p>
        </sect1>
        <sect1 id="no-upstream">
        <heading>Pakete ohne Upstream Maintainer</heading>

	  <p>Die Angabe "Alternatives" listet Pakete die m&ouml;glicherweise das
          gel&ouml;schte Paket ersetzen k&ouml;nnen.</p>

	  <p>Diese Pakete wurden gel&ouml;scht weil Sie keinen Upstream Maintainer
	  mehr haben. Die Nummer des entsprechenden Fehlerberichtes ist mit
          angegeben, da dieser weitere Informationen &uuml;ber den Grund der
          Paketl&ouml;schung enth&auml;lt. Um diese Nummer zu nutzen besuchen sie das
          <url id="&url-bts;" name="Bug Tracking System"> und suchen Sie nach
           der Fehlernummer.</p>

	  <p>Die Angabe "Alternatives" listet Pakete die m&ouml;glicherweise das
          gel&ouml;schte Paket ersetzen k&ouml;nnen.</p>

          <p><example>
            abacus
            Alternatives: gnumeric
            Bug: #89715

            arena
            Alternatives: mozilla, konqueror
            Bug: #83867

            bezerk
            Alternatives: irssi-gtk
            Bug: #86611

            blackjack
            Bug: #110369 110313

            cdwrite
            Alternatives: cdrecord
            Bug: #80353

            dejasearch
            Bug: #114643

            dsc
            Bug: #92576

            dtm
            Bug: #82741

            empire-ptkei
            Bug: #86230

            express
            Bug: #80396

            fakebo
            Bug: #82481

            gnome-napster
            Alternatives: gnapster, gnapster-gtk, lopster
            Bug: #87380

            icl-faq
            Bug: #105385

            libhtml-ep-perl
            Bug: #89376

            libtcl-ldap
            Bug: #113574

            macgate
            Bug: #85261

            maplay3
            Alternatives: madplay, mpg321, xmms
            Bug: #132374

            pyrite
            Bug: #102307

            scwm
            Bug: #115814

            zicq
            Alternatives: vicq, gabber, gaim
            Bug: #117936

          </example></p>
        </sect1>          
        <sect1 id="removed-other">
        <heading>Pakete die aus anderen Gr&uuml;nden gel&ouml;scht wurden</heading>

	  <p>Der Grund f&uuml;r die L&ouml;schung des Paketes ist unter dem Paketnamen
          angegeben. Die Nummer des entsprechenden Fehlerberichtes ist mit
          angegeben, da dieser weitere Informationen &uuml;ber den Grund der
          Paketl&ouml;schung enth&auml;lt. Um diese Nummer zu nutzen besuchen sie
          das <url id="&url-bts;" name="Bug Tracking System"> und suchen Sie
          nach der Fehlernummer.</p>

	  <p>Die Angabe "Alternatives" listet Pakete die m&ouml;glicherweise das
          gel&ouml;schte Paket ersetzen k&ouml;nnen.</p>


          <p><example>
            ae
            Replaced by the more user-friendly editor nano
            Alternatives: nano
            Bug: #110678

            barracuda
            Moved to non-US but never appeared there

            darxite 
            Remotely exploitable buffer overflow. Not easy to fix, would
            require full audit
            Bug: #87406

            dhcpcd
            Buggy, insecure, better alternatives are available
            Alternatives: dhcp-client, udhcpc
            Bug: #81627

            dosemu
            Moved to contrib

            dtlk
            Obsolete, now comes with kernel
            Bug: #97532

            empire-pei
            Out of sync with empire server
            Bug: #82466

            guavac
            Old, obsolete, jikes is better
            Alternatives: jikes
            Bug: #68246

            ldp-ligs, ldp-lkmpg, ldp-sag-it
            License problems
            Bug: #80782

            libdnd
            Old and unused
            Bug: #83565

            nextaw
            No longer works with XFree86 4
            Alternatives: libxaw7
            Bug: #105532

            omirr
            Obsolete; only works with kernel 2.0.11
            Bug: #79833

            povray-manual
            Large, non-free, downloadable from web, non-compliant HTML, non-compliant
            policy
            Bug: #82587

            sharc 
           
            Obsolete, it was providing relay-filtering for sendmail before
            sendmail had this feature.
            Alternatives: sendmail
            Bug: #92655
          </example></p>
        </sect1>
      </sect>

    </chapt>
  </book>
</debiandoc>

<!-- Keep this comment at the end of the file
Local Variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-namecase-general:t
sgml-general-insert-case:lower
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:2
sgml-indent-data:nil
sgml-declaration:nil
sgml-parent-document:nil
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
-->










