Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: In any case, if you obtain a package whose copyright allows redistribution, you should consider making a Debian package of it, and uploading it for the Debian system. Guidelines for becoming a package developer are included in the Debian Policy manual (see <ref id="debiandocs">).
it: In ogni caso, se si ottiene un pacchetto il cui copyright permette la redistribuzione, si dovrebbe considerare di trasformarlo in un pacchetto Debian e caricarlo per il sistema Debian. Le linee guida per diventare uno sviluppatore sono incluse nel manuale Debian Policy (si veda <ref id="debiandocs">).
ru: В любом случае, если вы получили пакет, авторские права на который позволяют его дальнейшее распространение, вам стоило бы подумать о создании из него пакета для Debian и отправке его в систему Debian. О том, как стать разработчиком пакета, читайте в руководстве по политике Debian (см. <ref id="debiandocs">).

source: Why can't I compile programs that require libtermcap?
it: Perché non posso compilare programmi che richiedono libtermcap?
ru: Почему не получается собрать программы, которым нужна библиотека libtermcap?

source: Debian uses the <tt>terminfo</tt> database and the <tt>ncurses</tt> library of terminal interface routes, rather than the <tt>termcap</tt> database and the <tt>termcap</tt> library. Users who are compiling programs that require some knowledge of the terminal interface should replace references to <tt>libtermcap</tt> with references to <tt>libncurses</tt>.
it: Debian usa il database <tt>terminfo</tt> e la libreria di interfaccia a terminale <tt>ncurses</tt>, piuttosto del database <tt>termcap</tt> e della libreria <tt>termcap</tt>. Gli utenti che stanno compilando dei programmi che richiedono alcune conoscenze sulle interfacce dei terminali dovrebbero sostituire i riferimenti a <tt>libtermcap</tt> con i riferimenti a <tt>libncurses</tt>.
ru: Для работы с терминалом в Debian используется база данных <tt>terminfo</tt> и библиотека <tt>ncurses</tt>, а не база данных <tt>termcap</tt> и библиотека <tt>termcap</tt>. Пользователям, собирающим программы, требуются некоторые знания по работе с терминалом для того, чтобы преобразовать вызовы <tt>libtermcap</tt> в вызовы <tt>libncurses</tt>.

source: To support binaries that have already been linked with the <tt>termcap</tt> library, and for which you do not have the source, Debian provides a package called <package>termcap-compat</package>. This provides both <tt>libtermcap.so.2</tt> and <tt>/etc/termcap</tt>. Install this package if the program fails to run with the error message "can't load library 'libtermcap.so.2'", or complains about a missing <tt>/etc/termcap</tt> file.
it: Per supportare i file binari per i quali è stato già fatto il link con la libreria <tt>termcap</tt> e per i quali non si ha il sorgente, Debian fornisce un pacchetto chiamato <package>termcap-compat</package>. Questo fornisce sia <tt>libtermcap.so.2</tt> sia <tt>/etc/termcap</tt>. Installare questo pacchetto se l'esecuzione del programma fallisce con il messaggio d'errore "can't load library 'libtermcap.so.2'", o se reclama la mancanza del file <tt>/etc/termcap</tt>.
ru: Для поддержки двоичных файлов, которые уже скомпонованы с библиотекой <tt>termcap</tt> и для которых нет исходного кода, в Debian предлагается пакет <package>termcap-compat</package>. В нём содержится библиотека <tt>libtermcap.so.2</tt> и файл <tt>/etc/termcap</tt>. Если программа отказывается запускаться с сообщением об ошибке «can't load library 'libtermcap.so.2» или жалуется на отсутствие файла <tt>/etc/termcap</tt>, установите этот пакет.

source: Why can't I install AccelX?
it: Perché non posso installare AccelX?
ru: Почему не получается установить AccelX?

source: AccelX uses the <tt>termcap</tt> library for installation. See <ref id="termcap"> above.
it: AccelX usa la libreria <tt>termcap</tt> per l'installazione. Si veda <ref id="termcap"> più sopra.
ru: Для установки AccelX используется библиотека <tt>termcap</tt>. Смотрите <ref id="termcap">.

source: Software available in the Debian system
it: Software disponibile nel sistema Debian
ru: Программное обеспечение, доступное в системе Debian

source: What types of applications and development software are available for &debian;?
it: Quali tipi di applicazioni e software di sviluppo sono disponibili per &debian;?
ru: Какие виды приложений и средств разработки программ доступны в &debian;?

source: Like most Linux distributions, &debian; provides:
it: Come la maggior parte delle distribuzioni Linux, &debian; fornisce:
ru: Как и многие другие дистрибутивы Linux, &debian; предоставляет:

source: the major GNU applications for software development, file manipulation, and text processing, including gcc, g++, make, texinfo, Emacs, the Bash shell and numerous upgraded Unix utilities,
it: le principali applicazioni GNU per lo sviluppo del software, la manipolazione dei file e l'elaborazione testi, inclusi gcc, g++, make, texinfo, Emacs, la shell Bash e numerose utilità Unix aggiornate;
ru: основные приложения GNU для разработки программного обеспечения, работы с файлами и обработки текстов, включая gcc, g++, make, texinfo, Emacs, оболочку Bash и множество улучшенных утилит Unix;

source: Perl, Python, Tcl/Tk and various related programs, modules and libraries for each of them,
it: Perl, Python, Tcl/Tk e vari programmi correlati, moduli e librerie per ognuno di essi;
ru: Perl, Python, Tcl/Tk и относящиеся к этим языкам модули и библиотеки;

source: TeX (LaTeX) and Lyx, dvips, Ghostscript,
it: TeX(LaTeX) e Lyx, dvips, Ghostscript;
ru: TeX (LaTeX) и Lyx, dvips, Ghostscript;

source: the Xorg windowing system, which provides a networked graphical user interface for Linux, and countless X applications including the GNOME, KDE and Xfce desktop environments.
it: il sistema a finestre Xorg, che fornisce un'interfaccia grafica orientata alla rete per Linux ed innumerevoli applicazioni per X inclusi gli ambienti desktop GNOME, KDE e Xfce;
ru: оконную систему Xorg, которая предоставляет сетевой графический пользовательский интерфейс в Linux и бесчисленные X-приложения, включая окружения рабочих столов GNOME, KDE и Xfce;

source: a full suite of networking applications, including servers for Internet protocols such as HTTP (WWW), FTP, NNTP (news), SMTP and POP (mail) and DNS (name servers); relational databases like PostgreSQL, MySQL; also provided are web browsers including the various Mozilla products <footnote><p>These have been, however, rebranded and are provided with different names due to trademark issues</p></footnote>,
it: una completa suite di applicazioni per la rete, inclusi server per protocolli Internet come HTTP (WWW), FTP, NNTP (news), SMTP e POP (posta) e DNS (server dei nomi); database relazionali come PostgreSQL e MySQL; sono inoltre forniti browser web inclusi i vari prodotti Mozilla<footnote>Questi sono stati tuttavia rimarchiati e sono forniti con nomi diversi a causa di problemi con i marchi registrati</footnote>;
ru: полный набор сетевых приложений, включая серверы для сетевых протоколов Интернета, такие как HTTP (WWW), FTP, NNTP (новости), SMTP и POP (почта) и DNS (серверы имён); реляционные базы данных PostgreSQL, MySQL; также предоставляются веб-браузеры, включая различные продукты Mozilla <footnote><p>Однако с изменённой символикой и под другими именами из-за соглашений по торговым маркам</p></footnote>,

source: a complete set of office applications, including the OpenOffice.org productivity suite, Gnumeric and other spreadsheets, WYSIWYG editors, calendars.
it: un insieme completo di applicazioni per l'ufficio, inclusi la suite di produttività OpenOffice.org, Gnumeric e altri fogli di calcolo, editor WYSIWYG, calendari.
ru: полный комплект офисных приложений, включающий офисный пакет OpenOffice.org, Gnumeric и другие электронные таблицы, WYSIWYG-редакторы, календари.

source: More than &main-pkgs; packages, ranging from news servers and readers to sound support, FAX programs, database and spreadsheet programs, image processing programs, communications, net, and mail utilities, Web servers, and even ham-radio programs are included in the distribution. Another &contrib-nonfree-pkgs; software suites are available as Debian packages, but are not formally part of Debian due to license restrictions.
it: Sono inclusi nella distribuzione più di &main-pkgs; pacchetti che spaziano dai server e lettori per le news al supporto per il suono, programmi per FAX, programmi per database e fogli di calcolo, programmi per l'elaborazione delle immagini, comunicazione, rete e utilità per la posta elettronica, server Web e persino programmi per i radioamatori. Altre &contrib-nonfree-pkgs; suite di software sono disponibili come pacchetti Debian, ma non fanno formalmente parte di Debian a causa di restrizioni delle licenze.
ru: В дистрибутив включено более чем &main-pkgs; пакетов, от новостных служб и программ чтения новостей до поддержки звука, приложений работы с факсами, баз данных и табличных процессоров, программ обработки изображений, связи, сетевых и почтовых утилит, веб-серверов и даже программ любительского радио. Также в Debian доступно ещё &contrib-nonfree-pkgs; пакетов, но формально они не являются частью Debian в связи с лицензионными ограничениями.

source: Who wrote all that software?
it: Chi ha scritto tutto questo software?
ru: Кто написал всё это программное обеспечение?

source: For each package the <em>authors</em> of the program(s) are credited in the file <tt>/usr/share/doc/PACKAGE/copyright</tt>, where PACKAGE is to be substituted with the package's name.
it: Per ogni pacchetto gli <em>autori</em> del programma (o dei programmi) sono menzionati nel file <tt>/usr/doc/PACCHETTO/copyright</tt>, dove PACCHETTO è il nome del pacchetto.
ru: <em>Авторы</em> каждой программы указаны в файле <tt>/usr/share/doc/ПАКЕТ/copyright</tt>, где вместо ПАКЕТ нужно подставить имя пакета.

source: <em>Maintainers</em> who package this software for the &debian; system are listed in the Debian control file (see <ref id="controlfile">) that comes with each package. The Debian changelog, in <tt>/usr/share/doc/PACKAGE/changelog.Debian.gz</tt>, mentions the people who've worked on the Debian packaging too.
it: I <em>manutentori</em> che impacchettano questo software per il sistema &debian; sono elencati nel file di controllo Debian (si veda <ref id="controlfile">) che è fornito con ogni pacchetto. Anche il changelog Debian, in <tt>/usr/share/doc/PACCHETTO/changelog.Debian.gz</tt>, nomina coloro che hanno lavorato alla creazione del pacchetto Debian.
ru: <em>Сопровождающие</em> &mdash; это те, кто создаёт пакеты для системы &debian;; они перечислены в управляющем файле Debian (смотрите <ref id="controlfile">), который имеется в каждом пакете. В файле изменений Debian, <tt>/usr/share/doc/ПАКЕТ/changelog.Debian.gz</tt>, перечислены люди, которые также принимали участие в создании пакета Debian.

source: How can I get a current list of programs that have been packaged for Debian?
it: Come si può ottenere una lista aggiornata dei programmi che sono stati impacchettati per Debian?
ru: Как получить текущий список программ, которые включены в проект Debian?

source: A complete list is available from any of the <url id="http://www.debian.org/distrib/ftplist" name="Debian mirrors">, in the file <tt>indices/Maintainers</tt>. That file includes the package names and the names and e-mails of their respective maintainers.
it: Una lista completa è disponibile in tutti i <url id="http://www.debian.org/distrib/ftplist" name="mirror Debian">, nel file <tt>indices/Maintainers</tt>. Quel file contiene i nomi dei pacchetti e i nomi e gli indirizzi di posta elettronica dei rispettivi manutentori.
ru: Полный список доступен с любого <url id="http://www.debian.org/distrib/ftplist" name="сервера-зеркала Debian"> в файле <tt>indices/Maintainers</tt>. Этот файл содержит имена пакетов, и имена и адреса электронной почты их сопровождающих.

source: The <url id="http://packages.debian.org/" name="WWW interface to the Debian packages"> conveniently summarizes the packages in each of about thirty "sections" of the Debian archive.
it: L'<url id="http://packages.debian.org/" name="interfaccia WWW ai pacchetti Debian"> riassume in modo pratico i pacchetti in ciascuna delle circa trenta "sezioni" dell'archivio Debian.
ru: <url id="http://packages.debian.org/" name="WWW-интерфейс для пакетов Debian "> обеспечивает удобный доступ к пакетам в каждом из тридцати «разделов» архива Debian.

source: How can I install a developer's environment to build packages?
it: Come si può installare un ambiente di sviluppo per compilare pacchetti?
ru: Как установить окружение разработчика для сборки пакетов?

source: If you want to build packages in your Debian system you will need to have a basic development environment, including a C/C++ compiler and some other essential packages. In order to install this environment you just need to install the <package>build-essential</package>. This package is a meta-package or place-holder package which depends on the standard development tools one needs to build a Debian package.
it: Se si desidera compilare pacchetti nel proprio sistema Debian è necessario avere un ambiente di sviluppo base, incluso un compilatore C/C++ ed alcuni altri pacchetti essenziali. Per installare questo ambiente è sufficiente installare il pacchetto <package>build-essential</package>: esso è un metapacchetto o pacchetto segnaposto che dipende dagli strumenti standard di sviluppo che sono necessari per compilare un pacchetto Debian.
ru: Если вы хотите собирать пакеты в системе Debian, то вам нужно иметь минимальное окружение для разработки, включающее компилятор C/C++ и некоторые важные пакеты. Чтобы создать окружение вам нужно просто установить <package>build-essential</package>. Этот пакет является метапакетом; он зависит от стандартных инструментов разработки, которые необходимы для сборки пакета Debian.

source: Some software can, however, need additional software to be rebuilt, including library headers or additional tools such as <prgn>autoconf</prgn> or <prgn>gettext</prgn>. Debian provides many of the tools needed to build other software as Debian packages.
it: È comunque possibile che qualche software possa aver bisogno di software aggiuntivo per essere ricompilato, inclusi header di libreria o strumenti addizionali come <prgn>autoconf</prgn> o <prgn>gettext</prgn>. Debian fornisce molti degli strumenti necessari per compilare ulteriore software in forma di pacchetti Debian.
ru: Однако, для пересборки некоторого ПО могут потребоваться дополнительные программы, включающие заголовочные файлы библиотек или дополнительные инструменты, например, <prgn>autoconf</prgn> или <prgn>gettext</prgn>. Debian предоставляет множество инструментов, необходимых для упаковки другого ПО в пакеты Debian.

source: Finding which software is precisely required can be tricky, however, unless you are planning on rebuilding Debian packages. This last task is rather easy to do, as official packages have to include a list of the additional software (besides the packages in <package>build-essential</package>) needed to build the pacakge, this is known as <tt>Build-Dependencies</tt>. To install all the packages needed to build a given source package and then build said source package you can just run:
it: Scoprire precisamente quale software sia necessario può tuttavia essere problematico, a meno che non si desideri ricompilare pacchetti Debian. Quest'ultimo compito è piuttosto facile, dato che i pacchetti ufficiali devono includere un elenco del software aggiuntivo (oltre ai pacchetti in <package>build-essential</package>) necessario per compilare il pacchetto; questo elenco è noto come <tt>Build-Dependencies</tt> (dipendenze di compilazione). Per installare tutti i pacchetti necessari per compilare un dato pacchetto sorgente e quindi effettivamente compilarlo basta eseguire:
ru: Иногда бывает довольно сложно выяснить, какое именно ПО требуется для сборки, если вы, конечно, не планируете просто пересобирать пакеты Debian. Последнюю задачу легко выполнить, так как официальные пакеты содержат список дополнительного ПО (кроме пакетов из <package>build-essential</package>), необходимого для сборки пакета, перечисленного в так называемых <tt>сборочных зависимостях (Build-Dependencies)</tt>. Для установки всех пакетов, необходимых для сборки определённого пакета исходного кода и затем самой сборки пакета, просто запустите:

source: # apt-get build-dep <var>foo</var> # apt-get source --build <var>foo</var>
it: # apt-get build-dep <var>pippo</var> # apt-get source --build <var>pippo</var>

source: Notice that if you want to build the Linux kernels distributed by Debian you will want to install also the <package>kernel-package</package> package. For more information see <ref id="customkernel">.
it: Si noti che se si desiderano compilare i kernel Linux distribuiti da Debian si dovrà installare anche il pacchetto <package>kernel-package</package>. Per maggiori informazioni si veda <ref id="customkernel">.
ru: Заметим, что если вы хотите собрать ядра Linux, распространяемые Debian, то вам также нужно установить пакет <package>kernel-package</package>. Подробней см. в <ref id="customkernel">.

source: What is missing from &debian;?
it: Cosa manca da &debian;?
ru: Чего нет в &debian;?

source: A list of packages which are still needed to be packaged for Debian exists, the <url id="http://www.debian.org/devel/wnpp/" name="Work-Needing and Prospective Packages list">.
it: Esiste un elenco di pacchetti che sono ancora da impacchettare per Debian, l'<url id="http://www.debian.org/devel/wnpp/" name="elenco Work-Needing and Prospective Packages">.
ru: Пакеты, которые ждут упаковки для Debian, перечислены в <url id="http://www.debian.org/devel/wnpp/" name="списке требующих доработки и будущих пакетов">.

source: For more details about adding the missing things, see <ref id="contrib">.
it: Per maggiori dettagli sull'aggiunta di cose mancanti, si veda <ref id="contrib">.
ru: О том, как добавить отсутствующие пакеты, см. в <ref id="contrib">.

source: Why do I get "ld: cannot find -lfoo" messages when compiling programs? Why aren't there any libfoo.so files in Debian library packages?
it: Perché ricevo il messaggio "ld: cannot find -lpippo" quando compilo i programmi? Perché non c'è alcun file libpippo.so nei pacchetti delle librerie Debian?
ru: Почему иногда выдаются сообщения «ld: cannot find -lfoo» при компиляции программ? Почему не хватает каких-то файлов libfoo.so в пакетах Debian с библиотеками?

source: Debian Policy requires that such symbolic links (to libfoo.so.x.y.z or similar) are placed in separate, development packages. Those packages are usually named libfoo-dev or libfooX-dev (presuming the library package is named libfooX, and X is a whole number).
it: La Debian Policy richiede che tali collegamenti simbolici (a libpippo.so.x.y.z o simile) siano posti in un pacchetto di sviluppo separato. Questi pacchetti di solito si chiamano libpippo-dev o libpippoX-dev (ammettendo che il pacchetto libreria si chiami libpippoX e che X sia un numero intero).
ru: Политика Debian требует, чтобы определённые символьные ссылки (на libfoo.so.x.y.z или подобные) размещались в отдельных пакетах &mdash; пакетах разработки. Эти пакеты, обычно, называются libfoo-dev или libfooX-dev (где библиотечный пакет называется libfooX, а X &mdash; число).

source: (How) Does Debian support Java?
it: Debian supporta Java? (E come?)
ru: Debian поддерживает Java (как)?

source: Several <em>free</em> implementations of Java technology are available as Debian packages, providing both Java Development Kits as well as Runtime Environments. You can write, debug and run Java programs using Debian.
it: Diverse implementazioni <em>libere</em> della tecnologia Java sono disponibili come pacchetti Debian e forniscono sia Java Development Kit sia ambienti Runtime. Usando Debian si possono scrivere programmi Java, eseguirli e farne il debug.
ru: В пакетах Debian доступны некоторые <em>свободные</em> реализации технологии Java, предоставляющие Java Development Kits и Runtime Environments. Вы можете писать, отлаживать и запускать программы Java в системе Debian.

source: Running a Java applet requires a web browser with the capability to recognize and execute them. Several web browsers available in Debian, such as Mozilla or Konqueror, support Java plug-ins that enable running Java applets within them.
it: L'esecuzione di un'applet Java richiede un browser web con la capacità di riconoscerla ed eseguirla. Diversi browser web disponibili in Debian, come Mozilla o Konqueror, supportano i plug-in Java che abilitano l'esecuzione di applet Java al loro interno.
ru: Для запуска апплетов Java требуется веб-браузер с соответствующей поддержкой. Такие веб-браузеры доступны в Debian: например, Mozilla или Konqueror, поддерживают плагины Java, которые позволяют выполнять Java апплеты.

source: Please refer to the <url id="http://www.debian.org/doc/manuals/debian-java-faq/" name="Debian Java FAQ"> for more information.
it: Si faccia riferimento alla <url id="http://www.debian.org/doc/manuals/debian-java-faq/" name="Debian Java FAQ"> per maggiori informazioni.
ru: Подробней об этом написано в <url id="http://www.debian.org/doc/manuals/debian-java-faq/" name="ЧаВо по Debian Java">.

source: How can I check that I am using a Debian system, and what version is it?
it: Come si può verificare di stare usando un sistema Debian e che versione è?
ru: Как узнать, что используется система Debian, и какой версии?

source: In order to make sure that your system has been installed from the real Debian base disks check for the existence of <tt>/etc/debian_version</tt> file, which contains a single one-line entry giving the version number of the release, as defined by the package <tt>base-files</tt>.
it: Per assicurarsi che il proprio sistema sia stato installato da una reale distribuzione di dischi di base Debian si verifichi l'esistenza del file <tt>/etc/debian_version</tt>, che contiene una singola riga che fornisce il numero di versione del rilascio, come definito dal pacchetto <tt>base-files</tt>.
ru: Чтобы проверить, что система установлена с настоящих дисков Debian, проверьте существование файла <tt>/etc/debian_version</tt>, в котором содержится одна строка с версией выпуска (файл принадлежит пакету <tt>base-files</tt>).

source: The existence of the program <tt>dpkg</tt> shows that you should be able to install Debian packages on your system, but as the program has been ported to many other operating systems and architectures, this is no longer a reliable method of determining is a system &debian;.
it: L'esistenza del programma <tt>dpkg</tt> mostra che si dovrebbe essere in grado di installare pacchetti Debian sul proprio sistema, ma siccome sono stati fatti port del programma su molti altri sistemi operativi ed architetture, questo non è più un metodo affidabile per determinare se un sistema è &debian;.
ru: Существование программы <tt>dpkg</tt> показывает, что вы можете устанавливать в систему пакеты Debian, но так как эта программа портирована во многие другие операционные системы и архитектуры, такой способ больше не является правильным для определения того, что система является системой &debian;.
