Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: Instead, create a local package that modifies the configuration files of the "group" of Debian packages of interest. Then <prgn>dpkg</prgn> and the rest of the package management system will see that the files have been modified by the local "sysadmin" and will not try to overwrite them when those packages are upgraded.
it: Piuttosto, si crei un pacchetto locale che modifichi i file di configurazione del "gruppo" di pacchetti Debian che interessano. Allora <prgn>dpkg</prgn> e il resto del sistema di gestione dei pacchetti vedono che i file sono stati modificati dall'"amministratore di sistema" locale e non cercheranno di sovrascriverli quando quei pacchetti verranno aggiornati.
ru: Вместо этого создайте собственный пакет, который правит настроечные файлы «группы» пакетов Debian, как вам необходимо. В последствии <prgn>dpkg</prgn> и другие утилиты системы управления пакетов увидят, что файлы были отредактированы локальным «администратором» и не станут трогать настройки при обновлении этих пакетов.

source: How do I override a file installed by a package, so that a different version can be used instead?
it: Come sovrascrivere un file installato da un pacchetto in modo che ne venga usata una versione differente?
ru: Как заменить программу, установленную каким-либо пакетом, на свою собственную?

source: Suppose a sysadmin or local user wishes to use a program "login-local" rather than the program "login" provided by the Debian <package>login</package> package.
it: Si supponga che l'amministratore o un utente locale desideri usare un programma "login-local" piuttosto del programma "login" fornito dal pacchetto <package>login</package> di Debian.
ru: Предположим, что системный администратор или пользователь хотят использовать программу «login-local» вместо «login» из пакета Debian <package>login</package>.

source: Do <strong>not</strong>:
it: <strong>Non</strong>:
ru: <strong>НЕ</strong> надо:

source: Overwrite <tt>/bin/login</tt> with <tt>login-local</tt>.
it: Sovrascrivere <tt>/bin/login</tt> con <tt>login-local</tt>.
ru: Перезаписывать <tt>/bin/login</tt> программой <tt>login-local</tt>.

source: The package management system will not know about this change, and will simply overwrite your custom <tt>/bin/login</tt> whenever <tt>login</tt> (or any package that provides <tt>/bin/login</tt>) is installed or updated.
it: Il sistema di gestione dei pacchetti non saprà di questo cambiamento e semplicemente sovrascriverà il <tt>/bin/login</tt> personalizzato ogni volta che <tt>login</tt> (o qualsiasi altro pacchetto che fornisce <tt>/bin/login</tt>) verrà installato o aggiornato.
ru: Система управления пакетами не будет знать об этих изменениях и при последующих обновлениях или установках просто заменит ваш изменённый <tt>/bin/login</tt> новым из пакета <tt>login</tt> (или любого другого пакета, предоставляющего <tt>/bin/login</tt>).

source: Rather, do
it: Invece,
ru: Делайте так:

source: Execute:
it: Eseguire:
ru: Выполните:

source: in order to cause all future installations of the Debian <package>login</package> package to write the file <tt>/bin/login</tt> to <tt>/bin/login.debian</tt> instead.
it: in modo che tutte le future installazioni del pacchetto <package>login</package> di Debian scrivano invece il file <tt>/bin/login</tt> in <tt>/bin/login.debian</tt>.
ru: чтобы заставить Debian при последующих обновлениях пакета <package>login</package> записывать файл <tt>/bin/login</tt> в <tt>/bin/login.debian</tt>.

source: Then execute:
it: Poi eseguire:
ru: Затем выполните:

source: to move your own locally-built program into place.
it: per spostare il proprio programma al suo posto.
ru: чтобы перенести вашу локальную программу на нужное место.

source: Run <tt>dpkg-divert --list</tt> to see which diversions are currently active on your system.
it: Eseguire <tt>dpkg-divert --list</tt> per vedere quali deviazioni siano attualmente attive sul proprio sistema.
ru: Запустите <tt>dpkg-divert --list</tt>, чтобы проверить какие отклонения выполняются в системе.

source: Details are given in the manual page <manref section="8" name="dpkg-divert">.
it: I dettagli sono forniti nella pagina di manuale <manref section="8" name="dpkg-divert">.
ru: Дополнительную информацию можно найти в справочной странице <manref section="8" name="dpkg-divert">.

source: How can I have my locally-built package included in the list of available packages that the package management system knows about?
it: Come si può far sì che un pacchetto generato localmente venga incluso nella lista dei pacchetti disponibili che il sistema di gestione dei pacchetti conosce?
ru: Как включить собранный самостоятельно пакет в список доступных пакетов, о которых знает система управления пакетами?

source: Execute the command:
it: Eseguire il comando:
ru: Выполните команду:

source: dpkg-scanpackages BIN_DIR OVERRIDE_FILE [PATHPREFIX] > my_Packages
it: dpkg-scanpackages BIN_DIR OVERRIDE_FILE [PREFISSOPERCORSO] > mio_Packages
ru: dpkg-scanpackages КАТ_ДВОЧН_ФАЙЛОВ ФАЙЛ_OVERRIDE [ПРЕФИКС_ПУТИ] > мой_Packages

source: where:
it: dove:
ru: где:

source: BIN-DIR is a directory where Debian archive files (which usually have an extension of ".deb") are stored.
it: BIN-DIR è la directory dove sono contenuti i file di archivio Debian (che solitamente hanno estensione ".deb").
ru: КАТ_ДВОЧН_ФАЙЛОВ &mdash; это каталог, где находятся архивы файлов Debian (которые обычно имеют расширения «.deb»).

source: OVERRIDE_FILE is a file that is edited by the distribution maintainers and is usually stored on a Debian FTP archive at <tt>indices/override.main.gz</tt> for the Debian packages in the "main" distribution. You can ignore this for local packages.
it: OVERRIDE_FILE è un file che viene modificato dai manutentori della distribuzione ed è solitamente situato, per i pacchetti Debian nella sezione "main" in <tt>indices/override.main.gz</tt> nell'archivio FTP Debian. Può essere ignorato per pacchetti locali.
ru: ФАЙЛ_OVERRIDE &mdash; это файл, который редактируется сопровождающими дистрибутива и обычно хранится в FTP-архиве Debian в файле <tt>indices/override.main.gz</tt> для Debian-пакетов в разделе дистрибутива «main». Вы можете его игнорировать для локальных пакетов.

source: PATHPREFIX is an <em>optional</em> string that can be prepended to the <tt>my_Packages</tt> file being produced.
it: PREFISSOPERCORSO è una stringa <em>opzionale</em> che può essere posta prima del file <tt>mio_Packages</tt> prodotto.
ru: ПРЕФИКС_ПУТИ &mdash; это <em>необязательная</em> строка, которая может предшествовать именам файлов в <tt>my_Packages</tt>.

source: Once you have built the file <tt>my_Packages</tt>, tell the package management system about it by using the command:
it: Una volta che si è creato il file <tt>mio_Packages</tt>, si informi il sistema di gestione dei pacchetti usando il comando:
ru: После создания файла <tt>мой_Packages</tt>, сообщите системе управления пакетами о новых пакетах командой:

source: dpkg --merge-avail my_Packages
it: dpkg --merge-avail mio_Packages
ru: dpkg --merge-avail мой_Packages

source: If you are using APT, you can add the local repository to your <manref section="5" name="sources.list"> file, too.
it: Se si sta usando APT, si può anche aggiungere il repository locale al proprio file <manref section="5" name="sources.list">.
ru: Если вы используете APT, то также можете добавить локальный репозиторий в ваш файл <manref section="5" name="sources.list">.

source: Some users like mawk, others like gawk; some like vim, others like elvis; some like trn, others like tin; how does Debian support diversity?
it: Ad alcuni utenti piace mawk, ad altri gawk; ad alcuni piace vim, ad altri elvis; ad alcuni piace trn, ad altri tin; come supporta Debian le diversità?
ru: Некоторым пользователям нравится mawk, другим gawk; некоторым vim, другим elvis; некоторым trn, другим tin. Как осуществляется поддержка предпочтений в Debian?

source: There are several cases where two packages provide two different versions of a program, both of which provide the same core functionality. Users might prefer one over another out of habit, or because the user interface of one package is somehow more pleasing than the interface of another. Other users on the same system might make a different choice.
it: Ci sono diversi casi in cui due pacchetti forniscono due versioni differenti di un programma, che forniscono entrambe le stesse funzionalità fondamentali. Gli utenti possono preferire l'una rispetto all'altra per abitudine o perché l'interfaccia utente di un pacchetto è in qualche modo più piacevole di quella di un altro. Altri utenti sullo stesso sistema possono fare una scelta differente.
ru: Есть несколько случаев, когда два пакета предоставляют две разные версии программы, которые служат в общем одной цели. Одни пользователи могут предпочитать одну из этих программ другой в силу привычки или более привлекательного интерфейса. Но у других, на этой же машине, может быть иное мнение.

source: Debian uses a "virtual" package system to allow system administrators to choose (or let users choose) their favorite tools when there are two or more that provide the same basic functionality, yet satisfy package dependency requirements without specifying a particular package.
it: Debian usa un sistema di pacchetti "virtuali" per permettere agli amministratori di sistema di scegliere (o lasciare che gli utenti scelgano) i propri strumenti preferiti quando ce ne sono due o più che forniscono la stessa funzionalità di base pur continuando ancora a soddisfare i requisiti in termini di dipendenze dei pacchetti senza specificare un particolare pacchetto.
ru: Debian использует систему «виртуальных» пакетов для того, чтобы системные администраторы (или пользователи) могли выбирать между несколькими пакетами с одинаковой функциональностью более-менее независимо от требований других пакетов.

source: For example, there might exist two different versions of newsreaders on a system. The news server package might 'recommend' that there exist <em>some</em> news reader on the system, but the choice of <tt>tin</tt> or <tt>trn</tt> is left up to the individual user. This is satisfied by having both the <package>tin</package> and <package>trn</package> packages provide the virtual package <package>news-reader</package>. <em>Which</em> program is invoked is determined by a link pointing from a file with the virtual package name <tt>/etc/alternatives/news-reader</tt> to the selected file, e.g., <tt>/usr/bin/trn</tt>.
it: Per esempio, potrebbero esistere due differenti versioni di lettori di newsgroup su un sistema. Il pacchetto del server per newsgroup potrebbe "raccomandare" la presenza di <em>un qualche</em> lettore di newsgroup sul sistema, ma la scelta tra <tt>tin</tt> e <tt>trn</tt> è lasciata all'utente. Ciò è realizzato avendo entrambi i pacchetti <package>tin</package> e <package>trn</package> che forniscono il pacchetto virtuale <package>news-reader</package>. <em>Quale</em> programma venga chiamato è determinato da un collegamento che punta dal file con il nome del pacchetto virtuale <tt>/etc/alternatives/news-reader</tt> al file selezionato, per esempio <tt>/usr/bin/trn</tt>.
ru: Например, в системе может существовать две различные версии программ чтения новостей. Пакет сервера новостей может 'рекомендовать', чтобы в системе была установлена <em>некая</em> программа для чтения новостей, но какая именно &mdash; <tt>tin</tt> или <tt>trn</tt>, предлагается выбрать пользователю. Решается это созданием виртуального пакета <package>news-reader</package>, который предоставляется пакетами <package>tin</package> и <package>trn</package>. <em>Какая</em> из этих программ вызывается, определяется символьной ссылкой файла виртуального пакета <tt>/etc/alternatives/news-reader</tt> на выбранный файл, например, на <tt>/usr/bin/trn</tt>.

source: A single link is insufficient to support full use of an alternate program; normally, manual pages, and possibly other supporting files must be selected as well. The Perl script <tt>update-alternatives</tt> provides a way of ensuring that all the files associated with a specified package are selected as a system default.
it: Un solo collegamento è insufficiente per supportare pienamente l'uso di un programma alternativo; normalmente devono essere selezionate anche le pagine di manuale e possibilmente anche altri file di supporto. Lo script Perl <tt>update-alternatives</tt> fornisce un mezzo per garantire che tutti i file associati con uno specifico pacchetto siano selezionati come i predefiniti di sistema.
ru: Простого создания символьной ссылки недостаточно для полного решения задачи использования альтернативной программы; также должны измениться страницы руководства и возможные вспомогательные программы. Сценарий Perl <tt>update-alternatives</tt> берёт на себя всё, что необходимо сделать для создания необходимых связей между ресурсами системы.

source: For example, to check what executables provide `x-window-manager', run:
it: Per esempio, per verificare quale eseguibile fornisce "x-window-manager", eseguire:
ru: Например, чтобы проверить, какие программы предоставляют «x-window-manager», выполните:

source: If you want to change it, run:
it: Se lo si desidera cambiare, eseguire:
ru: Если вы хотите его изменить:

source: And follow the instructions on the screen (basically, press the number next to the entry you'd like better).
it: e seguire le istruzioni sullo schermo (sostanzialmente premere il numero vicino alla voce che si preferisce).
ru: И следуйте инструкциям на экране (просто укажите номер желаемой программы из списка).

source: If a package doesn't register itself as a window manager for some reason (file a bug if it's in error), or if you use a window manager from /usr/local directory, the selections on screen won't contain your preferred entry. You can update the link through command line options, like this:
it: Se, per qualche ragione, un pacchetto non si registra da solo come un window manager (si segnali il bug se c'è un errore) o se si usa un window manager dalla directory /usr/local, le selezioni sullo schermo non conterranno la propria voce preferita. Si può aggiornare il collegamento attraverso opzioni da riga di comando, così:
ru: Если пакет по каким-либо причинам не зарегистрировал себя как оконный менеджер (сообщите об ошибке), или если вы используете менеджер из каталога /usr/local, тогда на экране вы не увидите предпочитаемой вами программы. Вы можете обновить ссылку командой:

source: The first argument to `--install' option is the symlink that points to /etc/alternatives/NAME, where NAME is the second argument. The third argument is the program to which /etc/alternatives/NAME should point to, and the fourth argument is the priority (larger value means the alternative will more probably get picked automatically).
it: Il primo argomento dell'opzione '--install' è il collegamento simbolico che punta a /etc/alternatives/NOME, dove NOME è il secondo argomento. Il terzo argomento è il programma al quale /etc/alternatives/NOME dovrebbe puntare e il quarto argomento è la priorità (maggiore è il valore maggiore è la probabilità che l'alternativa sia scelta automaticamente).
ru: Значение первого параметра «--install» является символьной ссылкой на /etc/alternatives/NAME, где NAME задан во втором значении. Третье значение указывает программу, на которую должна ссылаться /etc/alternatives/NAME, а четвёртое значение задаёт приоритет (альтернатива с большим значением будет предлагаться при выборе как значение по умолчанию).

source: To remove an alternative you added, simply run:
it: Per rimuovere un'alternativa che si è aggiunta eseguire semplicemente:
ru: Чтобы удалить добавленный вами вариант, просто выполните:

source: Getting support for &debian;
it: Ottenere supporto per &debian;
ru: Поддержка &debian;

source: What other documentation exists on and for a Debian system?
it: Quale altra documentazione esiste su e per un sistema Debian?
ru: Какая документация существует по системе Debian?

source: Installation instructions for the current release: see <url id="http://www.debian.org/releases/stable/installmanual">.
it: Istruzioni per l'installazione per l'attuale rilascio: vedere <url id="http://www.debian.org/releases/stable/installmanual">.
ru: Инструкции по установке текущего выпуска: <url id="http://www.debian.org/releases/stable/installmanual">.

source: The Debian GNU/Linux reference covers many aspects of system administration through shell-command examples. Basic tutorials, tips, and other information are provided for many different topics ranging from system administration to programming.
it: La "Debian GNU/Linux Reference" copre molti aspetti dell'amministrazione di sistema attraverso esempi di comandi di shell. Vengono forniti tutorial di base, suggerimenti ed altre informazioni per molti argomenti diversi che spaziano dall'amministrazione di sistema alla programmazione.
ru: В справочнике по Debian GNU/Linux описывается системное администрирование на примерах команд оболочки командной строки. В нём можно найти простые обучающие пособия, советы и другую информация по множеству тем от системного администрирования до программирования.

source: Get it from the <package>debian-reference</package> package, or at <url id="http://www.debian.org/doc/user-manuals#quick-reference">.
it: La si può ottenere con il pacchetto <package>debian-reference</package> o all'indirizzo <url id="http://www.debian.org/doc/user-manuals#quick-reference">.
ru: Он распространяется в пакете <package>debian-reference</package> и доступен по адресу <url id="http://www.debian.org/doc/user-manuals#quick-reference">.

source: The Debian Policy manual documents the policy requirements for the distribution, i.e. the structure and contents of the Debian archive, several design issues of the operating system etc. It also includes the technical requirements that each package must satisfy to be included in the distribution, and documents the basic technical aspects of Debian binary and source packages.
it: Il manuale "Debian Policy" documenta i requisiti delle linee guida della distribuzione, ovvero la struttura e il contenuto dell'archivio Debian, vari aspetti relativi alla progettazione del sistema operativo, ecc. Include anche i requisiti tecnici che ogni pacchetto deve soddisfare per essere incluso nella distribuzione e documenta gli aspetti tecnici di base dei pacchetti binari e sorgenti di Debian.
ru: Руководство по политике Debian описывает требования, предъявляемые к дистрибутиву, т.е. структуру и содержимое архива Debian, некоторые вопросы дизайна операционной системы. Также в нём описаны технические требования, которым должен удовлетворять каждый пакет, чтобы быть включённым в дистрибутив, и краткое техническое описание двоичных пакетов и пакетов исходных кодов Debian.

source: Get it from the <package>debian-policy</package> package, or at <url id="http://www.debian.org/doc/devel-manuals#policy">.
it: Lo si può ottenere con il pacchetto <package>debian-policy</package> o su <url id="http://www.debian.org/doc/devel-manuals#policy">.
ru: Оно распространяется в пакете <package>debian-policy</package> и доступно по адресу <url id="http://www.debian.org/doc/devel-manuals#policy">.

source: Documentation developed by the Debian Documentation Project. It is available at <url id="http://www.debian.org/doc/"> and includes user guides, administration guides and security guides for the Debian GNU/Linux operating system.
it: La documentazione sviluppata dal progetto Debian Documentation Project. È disponibile su <url id="http://www.debian.org/doc/"> e include guide utente, guide per gli amministratori e guide di sicurezza relative al sistema operativo Debian GNU/Linux.
ru: Документация, написанная проектом документирования Debian. Она доступна по адресу <url id="http://www.debian.org/doc/"> и содержит руководства для пользователей, руководства по администрированию и безопасности операционной системы Debian GNU/Linux.

source: Documentation on installed Debian packages: Most packages have files that are unpacked into <tt>/usr/share/doc/PACKAGE</tt>.
it: La documentazione sui pacchetti Debian installati: la maggior parte dei pacchetti ha dei file che vengono estratti in <tt>/usr/doc/PACCHETTO</tt>.
ru: Документация из установленных пакетов Debian: большинство пакетов содержат файлы, которые распаковываются в каталог <tt>/usr/share/doc/ПАКЕТ</tt>.

source: Documentation on the Linux project: The Debian package <package>doc-linux</package> installs all of the most recent versions of the HOWTOs and mini-HOWTOs from the <url id="http://www.tldp.org/" name="Linux Documentation Project">.
it: La documentazione sul progetto Linux. Il pacchetto Debian <package>doc-linux</package> installa tutte le più recenti versioni degli HOWTO e mini-HOWTO del <url id="http://www.tldp.org/" name="Linux Documentation Project">.
ru: Документация проекта Linux: из Debian-пакета <package>doc-linux</package> устанавливаются все самые новые версии HOWTO и mini-HOWTO <url id="http://www.tldp.org/" name="проекта документации для Linux">.

source: Unix-style `man' pages: Most commands have manual pages written in the style of the original Unix 'man' files. For instance, to see the manual page for the command `ls', execute <tt>man ls</tt>. Execute <tt>man man</tt> for more information on finding and viewing manual pages.
it: Le pagine "man" in stile Unix. La maggior parte dei comandi ha le pagine di manuale scritte nello stile dei file "man" originali di Unix. Per esempio, per vedere la pagina di manuale del comando "ls", eseguire <tt>man ls</tt>. Eseguire <tt>man man</tt> per maggiori informazioni su come trovare e visualizzare le pagine di manuale.
ru: Страницы «man» в стиле Unix: большинство команд имеют справочные страницы, написанные в духе самых первых man-файлов Unix. Например, чтобы посмотреть справочную страницу команды ls, запустите <tt>man ls</tt>. Запуск <tt>man man</tt> выдаст подробную информацию по поиску и просмотру справочных страниц.

source: New Debian users should note that the 'man' pages of many general system commands are not available until they install these packages:
it: I nuovi utenti Debian dovrebbero notare che le pagine "man" di molti comandi generici di sistema non sono disponibili finché non si installano i seguenti pacchetti:
ru: Для новых пользователей Debian заметим, что man-страницы многих основных системных команд недоступны, пока не установлены следующие пакеты:

source: <tt>man-db</tt>, which contains the <tt>man</tt> program itself, and other programs for manipulating the manual pages.
it: <tt>man-db</tt>, che contiene il programma <tt>man</tt> stesso ed altri programmi per manipolare le pagine di manuale.
ru: <tt>man-db</tt>, который содержит саму программу <tt>man</tt>, и другие программы работы с справочными страницами.

source: <tt>manpages</tt>, which contains the system manual pages. (see <ref id="nonenglish">).
it: <tt>manpages</tt>, che contiene le pagine di manuale di sistema. (Si veda <ref id="nonenglish">.)
ru: <tt>manpages</tt>, который содержит системные справочные страницы. (См. <ref id="nonenglish">).
