Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: <strong>Extra</strong>: packages that either conflict with others with higher priorities, are only likely to be useful if you already know what they are, or have specialized requirements that make them unsuitable for "Optional".
it: <strong>Extra</strong>: pacchetti che o entrano in conflitto con altri di priorità più alta, probabilmente utili se già si sa a cosa servono, oppure hanno requisiti speciali che li rendono non adatti come "Optional".
ru: <strong>Дополнительный (Extra)</strong>: пакеты, которые конфликтуют с другими пакетами, имеющими более высокий приоритет, или полезны только тогда, когда вы знаете, что это такое, либо имеющие специфичные требования, по которым им нельзя дать приоритет «Необязательный».

source: If you do a default Debian installation all the packages of priority <strong>Standard</strong> or higher will be installed in your system. If you select pre-defined tasks you will get lower priority packages too.
it: Se si fa un'installazione Debian predefinita verranno installati sul sistema tutti i pacchetti di priorità <strong>Standard</strong> o maggiore. Se si selezionano attività predefinite si otterranno anche pacchetti con priorità più bassa.
ru: Если вы выполните установку Debian по умолчанию, то будут установлены все пакеты с приоритетом <strong>Стандартный</strong> или выше. Если вы выберете какие-то определённые задачи, то также будут установлены и пакеты с более низким приоритетом.

source: Additionally, some packages are marked as <strong>Essential</strong> since they are absolutely necessary for the proper functioning of the system. The package management tools will refuse to remove these.
it: In aggiunta, alcuni pacchetti sono marcati come <strong>Essential (Essenziali)</strong> dato che sono assolutamente necessari per il corretto funzionamento del sistema. Gli strumenti di gestione dei pacchetti si rifiuteranno di rimuoverli.
ru: Также, некоторые пакеты классифицированы как <strong>Значимые</strong> (Essential), так как они абсолютно необходимы для правильной работы системы. Инструменты управления пакетами не допустят их удаления.

source: What is a Virtual Package?
it: Cos'è un pacchetto virtuale?
ru: Что такое виртуальный пакет?

source: A virtual package is a generic name that applies to any one of a group of packages, all of which provide similar basic functionality. For example, both the <tt>tin</tt> and <tt>trn</tt> programs are news readers, and should therefore satisfy any dependency of a program that required a news reader on a system, in order to work or to be useful. They are therefore both said to provide the "virtual package" called <tt>news-reader</tt>.
it: Un pacchetto virtuale è un nome generico che si applica ad ognuno dei componenti di un gruppo di pacchetti, che forniscono funzionalità di base simili. Per esempio, entrambi i programmi <tt>tin</tt> e <tt>trn</tt> sono newsreader e dovrebbero quindi soddisfare qualsiasi dipendenza di un programma che richiede un newsreader sul sistema, per poter funzionare o essere utile. Si dice quindi che entrambi forniscono il "pacchetto virtuale" chiamato <tt>news-reader</tt>.
ru: Виртуальный пакет &mdash; это общее имя, применимое к любому из группы пакетов, каждый из которых предоставляет одинаковую возможность. Например, программы <tt>tin</tt> и <tt>trn</tt> являются программами для чтения новостей и удовлетворят зависимость программы, которая для своей работы (или небесполезности) требует наличия в системе программы чтения новостей. Поэтому про них говорится, что они обе предоставляют «виртуальный пакет» с именем <tt>news-reader</tt>.

source: Similarly, <tt>smail</tt> and <tt>sendmail</tt> both provide the functionality of a mail transport agent. They are therefore said to provide the virtual package, "mail transport agent". If either one is installed, then any program depending on the installation of a <tt>mail-transport-agent</tt> will be satisfied by the existence of this virtual package.
it: Similmente, <tt>smail</tt> e <tt>sendmail</tt> forniscono entrambi la funzionalità di agente di trasporto posta. Si dice quindi che fornisco il pacchetto virtuale "mail transport agent". Se uno qualsiasi dei due è installato, allora ogni pacchetto che dipende dall'installazione di un <tt>mail-transport-agent</tt> vedrà le proprie dipendenze soddisfatte dall'esistenza di questo pacchetto virtuale.
ru: Аналогично, <tt>smail</tt> и <tt>sendmail</tt> обеспечивают функции агента пересылки сообщений. Поэтому они предоставляют виртуальный пакет «mail transport agent». Если один из них установлен, то любая программа, зависящая от пакета <tt>mail-transport-agent</tt>, будет удовлетворена наличием данного виртуального пакета.

source: Debian provides a mechanism so that, if more than one package which provide the same virtual package is installed on a system, then system administrators can set one as the preferred package. The relevant command is <tt>update-alternatives</tt>, and is described further in <ref id="diverse">.
it: Debian fornisce un meccanismo in modo che, se più di un pacchetto che fornisce lo stesso pacchetto virtuale è installato su di un sistema, l'amministratore di sistema può allora impostarne uno come pacchetto preferito. Il relativo comando è <tt>update-alternatives</tt> ed è descritto più in dettaglio in <ref id="diverse">.
ru: Кроме того, если в системе установлено более одного пакета, предоставляющего определённый виртуальный пакет, то Debian обеспечивает системного администратора механизмом, позволяющим указать предпочтительный. Для этого служит команда <tt>update-alternatives</tt>, см. <ref id="diverse">.

source: What is meant by saying that a package <em>Depends</em>, <em>Recommends</em>, <em>Suggests</em>, <em>Conflicts</em>, <em>Replaces</em>, <em>Breaks</em> or <em>Provides</em> another package?
it: Cosa significa dire che un pacchetto <em>Dipende</em> da, <em>Raccomanda</em>, <em>Suggerisce</em>, <em>Va in conflitto</em> con, <em>Sostituisce</em>, <em>Rompe</em> o <em>Fornisce</em> un altro pacchetto?
ru: Что имеется в виду, когда говорят, что пакет <em>Зависит</em>, <em>Рекомендует</em>, <em>Предполагает</em>, <em>Конфликтует</em>, <em>Заменяет</em>, <em>Ломает</em>или <em>Предоставляет</em> (Depends/Recommends/Suggests/Conflicts/Replaces/Breaks/Provides) другой пакет?

source: The Debian package system has a range of package "dependencies" which are designed to indicate (in a single flag) the level at which Program A can operate independently of the existence of Program B on a given system:
it: Il sistema dei pacchetti Debian ha una serie di "dipendenze" dei pacchetti che sono pensate per indicare (con un singolo termine) il livello a cui, su un dato sistema, un determinato Programma A può funzionare indipendentemente dall'esistenza di un Programma B.
ru: В системе пакетов Debian есть несколько типов «зависимостей» между пакетами, которые нужны, чтобы показать, насколько работа Программы А не зависит от существования Программы Б в данной системе:

source: Package A <em>depends</em> on Package B if B absolutely must be installed in order to run A. In some cases, A depends not only on B, but on a version of B. In this case, the version dependency is usually a lower limit, in the sense that A depends on any version of B more recent than some specified version.
it: Il pacchetto A <em>dipende</em> dal Pacchetto B se B deve essere assolutamente installato per eseguire A. In alcuni casi, A dipende non solo da B, ma da una versione di B. In questo caso la dipendenza dalla versione è solitamente un limite inferiore, nel senso che A dipende da qualsiasi versione di B più recente di quella specificata.
ru: Пакет A <em>зависит</em> от пакета Б, если Б абсолютно необходим для работы A. В некоторых случаях, A не просто зависит от Б, но дополнительно требует определённую версию Б. В этом случае, обычно, накладывается требование, чтобы версия Б была не ниже заданной.

source: Package A <em>recommends</em> Package B, if the package maintainer judges that most users would not want A without also having the functionality provided by B.
it: Il pacchetto A <em>raccomanda</em> il Pacchetto B se il manutentore del pacchetto giudica che la maggior parte degli utenti non vorrebbe A senza le funzionalità fornite da B.
ru: Пакет A <em>рекомендует</em> пакет Б, если сопровождающий пакета считает, что большинство пользователей не захотят пользоваться A не имея функциональности, предоставляемой пакетом Б.

source: Package A <em>suggests</em> Package B if B contains files that are related to (and usually enhance) the functionality of A.
it: Il pacchetto A <em>suggerisce</em> il Pacchetto B se B contiene file attinenti alle funzioni di A (e che solitamente le migliorano).
ru: Пакет A <em>предполагает</em> наличие пакета Б, если Б содержит файлы, относящиеся (и обычно расширяющие их) к возможностям пакета A.

source: Package A <em>conflicts</em> with Package B when A will not operate if B is installed on the system. Most often, conflicts are cases where A contains files which are an improvement over those in B. "Conflicts" are often combined with "replaces".
it: Il pacchetto A <em>va in conflitto</em> con il Pacchetto B quando A non è in grado di funzionare se B è installato sul sistema. Molto spesso i conflitti si hanno quando A contiene dei file che rappresentano dei miglioramenti di quelli in B. Spesso "va in conflitto" è associato a "sostituisce".
ru: Пакет A <em>конфликтует</em> с пакетом Б, когда A не может работать, если установлен пакет Б. Наиболее часто конфликты возникают, когда A содержит файлы, заменяющие аналогичные, но содержащиеся в Б. «Конфликты» часто решаются «заменой».

source: Package A <em>replaces</em> Package B when files installed by B are removed and (in some cases) over-written by files in A.
it: Il pacchetto A <em>sostituisce</em> il Pacchetto B quando i file installati da B vengono rimossi e (in alcuni casi) sovrascritti dai file di A.
ru: Пакет A <em>заменяет</em> пакет Б, когда файлы установленные пакетом Б, удаляются и (в некоторых случаях) замещаются файлами пакета A.

source: Package A <em>breaks</em> Package B when both cannot packages cannot be simultaneously configured in a system. The package management system will refuse to install one if the other one is already installed and configured in the system.
it: Il pacchetto A <em>rompe</em> il pacchetto B quando non è possibile configurare simultaneamente entrambi i pacchetti su un sistema. Il sistema di gestione dei pacchetti si rifiuta di installare uno se l'altro è già installato e configurato sul sistema.
ru: Пакет А <em>ломает</em> пакет Б, когда оба пакет не могут быть одновременно настроены в системе. Система управления пакетами предотвратит установку одного, если в системе уже установлен и настроен другой.

source: Package A <em>provides</em> Package B when all of the files and functionality of B are incorporated into A. This mechanism provides a way for users with constrained disk space to get only that part of package A which they really need.
it: Il pacchetto A <em>fornisce</em> il Pacchetto B quando tutti i file e le funzionalità di B sono incorporate in A. Questo meccanismo permette agli utenti con limitato spazio su disco rigido di avere solo la parte del pacchetto A realmente necessaria per loro.
ru: Пакет A <em>предоставляет</em> пакет Б, когда все файлы и функциональность Б обеспечиваются A. Этот механизм позволяет пользователям с ограниченным дисковым пространством взять только часть пакета А, которая действительно требуется.

source: More detailed information on the use of each these terms can be found in the Debian Policy manual, section 7.2, "Binary Dependencies", see <ref id="debiandocs">.
it: Informazioni più dettagliate sull'utilizzo di ognuno di questi termini possono essere trovate nel manuale Policy, sezione 7.2 "Binary Dependencies" (vedere <ref id="debiandocs">).
ru: Более подробная информация об использовании этих терминов может быть найдена в Руководстве по политике Debian, разделе 7.2, "Двоичные зависимости", см. <ref id="debiandocs">.

source: What is meant by Pre-Depends?
it: Cosa significa Pre-Depends?
ru: Что обозначают словом Pre-Depends (Пред-зависимости)?

source: "Pre-Depends" is a special dependency. In the case of most packages, <tt>dpkg</tt> will unpack its archive file (i.e., its <tt>.deb</tt> file) independently of whether or not the files on which it depends exist on the system. Simplistically, unpacking means that <tt>dpkg</tt> will extract the files from the archive file that were meant to be installed on your file system, and put them in place. If those packages <em>depend</em> on the existence of some other packages on your system, <tt>dpkg</tt> will refuse to complete the installation (by executing its "configure" action) until the other packages are installed.
it: "Pre-Depends" è una dipendenza speciale. Per la maggior parte dei pacchetti, <tt>dpkg</tt> spacchetta il loro file di archivio (ovvero il loro file <tt>.deb</tt>) indipendentemente dal fatto che i file da cui dipendono siano o meno sul sistema. Semplificando, spacchettare vuol dire che <tt>dpkg</tt> estrae i file da installare dall'archivio e li mette al loro posto nel file system. Se quei pacchetti <em>dipendono</em> dall'esistenza di qualche altro pacchetto sul sistema, <tt>dpkg</tt> si rifiuta di completare l'installazione (eseguendo l'azione "configura"), finché gli altri pacchetti non sono installati.
ru: «Pre-Depends» &mdash; это специальный тип зависимости. Большинство пакетов будут извлечены <tt>dpkg</tt> из архивных файлов (то есть файлов <tt>.deb</tt>) независимо от того, существуют ли файлы в системе, от которых они зависят или нет. Проще говоря, <tt>dpkg</tt> извлекает файлы из файла архива и помещает их на положенные места в файловой системе. Если пакет <em>зависит</em> от существования других пакетов в системе, то <tt>dpkg</tt> откажется завершать установку (то есть выполнять «настройку») до установки других пакетов.

source: However, for some packages, <tt>dpkg</tt> will refuse even to unpack them until certain dependencies are resolved. Such packages are said to "Pre-depend" on the presence of some other packages. The Debian project provided this mechanism to support the safe upgrading of systems from <tt>a.out</tt> format to <tt>ELF</tt> format, where the <em>order</em> in which packages were unpacked was critical. There are other large upgrade situations where this method is useful, e.g. the packages with the required priority and their LibC dependency.
it: Tuttavia, per alcuni pacchetti, <tt>dpkg</tt> si rifiuta persino di spacchettarli finché certe dipendenze non vengono risolte. Tali pacchetti si dice che "Pre-dipendono" dalla presenza di altri pacchetti. Il progetto Debian aveva fornito questo meccanismo per supportare un aggiornamento sicuro di sistemi dal formato <tt>a.out</tt> al formato <tt>ELF</tt>, dove l'<tt>ordine</tt> in cui i pacchetti venivano spacchettati era critico. Esistono altre situazioni di aggiornamenti estesi in cui questo metodo è utile, per esempio pacchetti con priorità richiesta e la loro dipendenza da libC.
ru: Однако, некоторые пакеты <tt>dpkg</tt> даже не будет распаковывать, пока не будут разрешены некоторые зависимости. Про такие пакеты говорят, что они имеют «предварительную зависимость» (Pre-depend) от некоторых других пакетов. Проект Debian предоставляет этот механизм для поддержки безопасного перехода в системах с формата <tt>a.out</tt> на формат <tt>ELF</tt>, где критичен <em>порядок</em>, в котором распаковываются пакеты. Есть много других ситуаций, где этот метод также полезен, например для пакетов с требуемым приоритетом и зависимостью от LibC.

source: As before, more detailed information about this can be found in the Policy manual.
it: Come sopra, informazioni più dettagliate al riguardo possono essere reperite nel manuale Debian Policy.
ru: Опять же, более подробная информация об этом дана в руководстве по политике.

source: What is meant by <em>unknown</em>, <em>install</em>, <em>remove</em>, <em>purge</em> and <em>hold</em> in the package status?
it: Cosa significano <em>sconosciuto</em>, <em>installa</em>, <em>rimuovi</em>, <em>elimina</em> e <em>blocca</em> nello stato di un pacchetto?
ru: Что означают слова <em>неизвестно</em>, <em>установить</em>, <em>удалить</em>, <em>вычистить</em>, <em>зафиксировать</em> (unknown/install/remove/purge/hold) в строке состояния пакета?

source: These "want" flags tell what the user wanted to do with a package (as indicated either by the user's actions in the "Select" section of <tt>dselect</tt>, or by the user's direct invocations of <tt>dpkg</tt>).
it: Queste etichette dei "desiderata" indicano il volere dell'utente riguardo ad un pacchett (come indicato dalle azioni dell'utente nella sezione "Seleziona" di <tt>dselect</tt> o dall'invocazione diretta di <tt>dpkg</tt>).
ru: Эти флаги определяют, что пользователь «хочет» сделать с пакетом (что определяется либо действиями пользователя при работе в разделе «Выбор» (Select) программы <tt>dselect</tt>, либо непосредственным запуском <tt>dpkg</tt>).

source: Their meanings are:
it: I loro significati sono:
ru: Их значения:

source: unknown - the user has never indicated whether he wants the package
it: sconosciuto: l'utente non ha mai indicato se vuole il pacchetto;
ru: неизвестно (unknown) &mdash; пользователь никогда не проявлял интереса к пакету

source: install - the user wants the package installed or upgraded
it: installa: l'utente vuole che il pacchetto sia installato o aggiornato;
ru: установить (install) &mdash; пользователь хочет установить или обновить пакет

source: remove - the user wants the package removed, but does not want to remove any existing configuration files.
it: rimuovi: l'utente vuole che sia rimosso il pacchetto, ma non i file di configurazione esistenti;
ru: удалить (remove) &mdash; пользователь хочет удалить пакет, но не хочет удалять его файлы настройки

source: purge - the user wants the package to be removed completely, including its configuration files.
it: elimina: l'utente vuole che il pacchetto sia completamente rimosso, compresi i file di configurazione;
ru: вычистить (purge) &mdash; пользователь хочет удалить пакет полностью, включая его файлы настройки

source: hold - the user wants this package not to be processed, i.e., he wants to keep the current version with the current status whatever that is.
it: blocca: l'utente non vuole che il pacchetto sia processato, ovvero vuole mantenere la versione attuale con lo stato attuale, qualunque essi siano.
ru: зафиксировать (hold) &mdash; пользователь хочет, чтобы над пакетом не совершалось никаких действий, т.е. он хочет сохранить текущую версию пакета

source: How do I put a package on hold?
it: Come si blocca un pacchetto?
ru: Как зафиксировать (hold) пакет?

source: There are three ways of holding back packages, with dpkg, aptitude or with dselect.
it: Esistono tre modi per bloccare (hold) pacchetti, con dpkg, aptitude o dselect.
ru: Есть три способа перевода пакета в зафиксированное состояние: при помощи dpkg, aptitude или dselect.

source: With dpkg, you have to export the list of package selections, with:
it: Con dpkg, si deve solo esportare la lista delle selezioni dei pacchetti con:
ru: С помощью dpkg, вы экспортируете список выбранных пакетов:

source: dpkg --get-selections \* > selections.txt
it: dpkg --get-selections \* > selezione.txt

source: Then edit the resulting file <file>selections.txt</file>, change the line containing the package you wish to hold, e.g. <package>libc6</package>, from this:
it: Poi modificare il file risultante <file>selezione.txt</file>, cambiando la riga contenente il pacchetto che si desidera bloccare, per esempio <package>libc6</package>, da questo:
ru: Затем редактируете полученный файл <file>selections.txt</file>, заменяя строку, содержащую выбранный вами фиксируемый пакет, например <package>libc6</package>, с:

source: to this:
it: a questo:
ru: на:

source: Save the file, and reload it into dpkg database with:
it: Salvare il file e ricaricarlo nel database di dpkg con:
ru: Сохраняете файл и загружаете его в базу данных dpkg:

source: dpkg --set-selections < selections.txt
it: dpkg --set-selections < selezione.txt

source: With aptitude, you can hold a package using
it: Con aptitude, si può bloccare un pacchetto usando
ru: С помощью aptitude, можно зафиксировать пакет командой

source: aptitude hold package_name
it: aptitude hold nome_pacchetto
ru: aptitude hold имя_пакета

source: and remove the hold with
it: e rimuovere il blocco con
ru: а снять фиксацию с помощью

source: aptitude unhold package_name
it: aptitude unhold nome_pacchetto
ru: aptitude unhold имя_пакета

source: With dselect, you have to enter the [S]elect screen, find the package you wish to hold in its present state, and press the `=' key (or `H'). The changes will go live immediately after you exit the [S]elect screen.
it: Con dselect, si deve entrare nella schermata [S]eleziona, trovare il pacchetto che si desidera bloccare nel suo stato attuale e premere il tasto "=" (o "H"). Le modifiche diverranno attive immediatamente dopo che si è usciti dalla schermata [S]eleziona.
ru: В dselect, вы переходите в меню Выбор (Select), находите нужный пакет и нажимаете клавишу «=» (или «H»). Изменения вступят в силу сразу же после выхода из режима Выбор.

source: How do I install a source package?
it: Come si installa un pacchetto sorgente?
ru: Как установить пакет исходного кода?

source: Debian source packages can't actually be "installed", they are just unpacked in whatever directory you want to build the binary packages they produce.
it: I pacchetti sorgente Debian non possono realmente venire "installati", vengono solo spacchettati in qualsiasi directory in cui si vogliano compilare i pacchetti binari che producono.
ru: Пакеты исходного кода Debian не могут быть «установлены», они просто распаковываются в том каталоге, в котором вы хотите собрать двоичный пакет.

source: Source packages are distributed on most of the same mirrors where you can obtain the binary packages. If you set up your APT's <manref section="5" name="sources.list"> to include the appropriate "deb-src" lines, you'll be able to easily download any source packages by running
it: I pacchetti sorgente sono distribuiti sulla maggior parte dei mirror dove si possono ottenere i pacchetti binari. Se si imposta il proprio <manref section="5" name="sources.list"> di APT per includere le righe "deb-src" appropriate, si sarà in grado di scaricare facilmente qualsiasi pacchetto sorgente eseguendo
ru: Пакеты с исходным кодом распространяются с почти всех тех же серверов-зеркал, что и двоичные пакеты. Если вы включите в APT файл <manref section="5" name="sources.list"> соответствующие строки «deb-src», то сможете легко скачивать пакеты с исходным кодом с помощью команды

source: apt-get source foo
it: apt-get source pippo
ru: apt-get source имя_пакета

source: To help you in actually building the source package, Debian source package provide the so-called build-dependencies mechanism. This means that the source package maintainer keeps a list of other packages that are required to build their package. To see how this is useful, run
it: Per aiutare nella reale compilazione del pacchetto sorgente, i pacchetti sorgente Debian forniscono il cosiddetto meccanismo di dipendenze di compilazione. Significa che il manutentore del pacchetto sorgente mantiene una lista di altri pacchetti che sono richiesti per compilare il suo pacchetto. Per vedere come questo sia utile, si esegua
ru: Для помощи в сборки пакета, пакет с исходным кодом Debian предоставляет так называемый механизм сборочных зависимостей. Это означает, что сопровождающий пакета с исходным кодом ведёт список других пакетов, которые требуются для сборки его пакета. Чтобы увидеть насколько это полезно, выполните
