Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: Sometimes, a package might not be installable through package management tools. Sometimes, a package might not be available at all, maybe it was (temporarily) removed due to bugs or unmet dependencies. Sometimes, a package installs but does not behave in the proper way.
it: A volte, un pacchetto può non essere installabile tramite gli strumenti di gestione dei pacchetti. Altre volte, un pacchetto può proprio non essere disponibile: forse è stato (temporaneamente) rimosso a causa di bug o di dipendenze non soddisfatte. Altre volte ancora, un pacchetto si installa ma non si comporta nel modo corretto.
ru: Бывает, что пакет невозможно установить с помощью системы управления пакетами. Иногда пакет может быть недоступен совсем, может быть (временно) удалён из-за ошибок или неудовлетворённых зависимостей. Иногда пакет устанавливается, но работает неправильно.

source: When these things happen, the distribution is said to be broken (at least for this package).
it: Quando ciò avviene, si dice che la distribuzione è rotta (almeno per quel che riguarda il pacchetto in questione).
ru: Когда такое случается, говорят, что дистрибутив сломан (по крайней мере, применительно к этому пакету).

source: Why is it that testing could be broken for months? Wont the fixes introduced in unstable flow directly down into testing?
it: Come mai testing può essere rotta per mesi? Le soluzioni introdotte in unstable non passano direttamente in testing?
ru: Почему тестируемый дистрибутив может быть сломанным несколько месяцев? Разве исправления из нестабильного дистрибутива не попадают сразу в тестируемый?

source: The bug fixes and improvements introduced in the unstable distribution trickle down to testing after a certain number of days. Let's say this threshold is 10 days. The packages in unstable go into testing only when there are no RC-bugs reported against them. If there is a RC-bug filed against a package in unstable, it will not go into testing after the 10 days.
it: Le soluzioni dei bug e le migliorie introdotte nella distribuzione unstable passano in testing dopo un certo numero di giorni. Diciamo che la soglia è di 10 giorni. I pacchetti in unstable passano in testing solo quando non ci sono segnalazioni di bug critici per il rilascio che li riguardano. Se viene segnalato un bug critico per il rilascio riguardante un pacchetto in unstable, questo non passa a testing allo scadere dei 10 giorni.
ru: Исправления ошибок и улучшения, появившиеся в нестабильном дистрибутиве, попадают в тестируемый только через несколько дней. Скажем, дней через 10. Пакет из нестабильного переходит в тестируемый, только если в нём нет RC-ошибок (ошибок, тормозящих выпуск). Если в пакете есть RC-ошибка, он не попадёт в тестируемый дистрибутив и по прошествии 10 дней.

source: The idea is that, if the package has any problems, it would be discovered by people using unstable and will be fixed before it enters testing. This keeps the testing in an usable state for most period of the time. Overall a brilliant concept, if you ask me. But things are alwasy not so simple. Consider the following situation:
it: L'idea è che, se il pacchetto ha dei problemi, questi vengono scoperti da coloro che usano unstable e vengono risolti prima che il pacchetto entri in testing. Ciò mantiene testing in uno stato usabile per la maggior parte del tempo. Nel suo insieme il concetto è impeccabile, a mio parere. Ma le cose non sono sempre così semplici. Prendiamo per esempio la situazione seguente:
ru: Идея в том, что, если какие-то проблемы с пакетом, пусть они будут обнаружены людьми, использующими нестабильный дистрибутив, и исправлены до того, как он попадёт в тестируемый. Это сохраняет тестируемый дистрибутив в рабочем состоянии большую часть времени. Слишком идеальная теория, скажу я вам. Но вещи не так просты, как кажутся. Рассмотрим следующую ситуацию:

source: Imagine you are interested in package XYZ.
it: Immaginiamo di essere interessati al pacchetto XYZ.
ru: Предположим, что вам нужен пакет XYZ.

source: Let's assume that on June 10, the version in testing is XYZ-3.6 and in unstable it is XYZ-3.7
it: Ipotizziamo che al 10 giugno la versione in testing sia XYZ-3.6 e quella in unstable sia XYZ-3.7.
ru: Также представим, что на 10 июня его версия в тестируемом дистрибутиве XYZ-3.6, а в нестабильном XYZ-3.7.

source: After 10 days, XYZ-3.7 from unstable migrates into testing.
it: Dopo 10 giorni, XYZ-3.7 da unstable migra in testing.
ru: Прошло 10 дней, XYZ-3.7 из нестабильного перешёл в тестируемый.

source: So on June 20, both testing and unstable have XYZ-3.7 in their repositories.
it: Perciò il 20 giugno entrambe testing e unstable hanno nei loro repository XYZ-3.7.
ru: Итак, на 20 июня в тестируемом и нестабильном одинаковая версия XYZ-3.7.

source: Let's say, The user of testing distribution sees that a new XYZ package is available and updates his XYZ-3.6 to XYZ-3.7
it: Diciamo che un utente della distribuzione testing vede che è disponibile un nuovo pacchetto XYZ e aggiorna la propria versione XYZ-3.6 a XYZ-3.7.
ru: Пользователь тестируемого дистрибутива видит, что для пакета XYZ есть обновление, и он устанавливает его, переходя с XYZ-3.6 на XYZ-3.7.

source: Now on June 25, someone using testing or unstable discovers an RC bug in XYZ-3.7 and files it in the BTS.
it: Ora diciamo che il 25 giugno qualche utente di testing o unstable scopre che c'è un bug critico per il rilascio in XYZ-3.7 e lo segnala nel BTS.
ru: Теперь, 25 июня кто-то использующий тестируемый или нестабильный дистрибутив обнаруживает RC-ошибку в XYZ-3.7 и пишет письмо об этом в BTS.

source: The maintainer of XYZ fixes this bug and uploads it to unstable say on June 30. Here it is assumed that it takes 5 days for the maintainer to fix the bug and upload the new version. The number 5 should not be taken literally. It could be less or more, depending upon the severity of the RC-bug at hand.
it: Il manutentore di XYZ corregge il bug e carica la versione corretta in unstable, diciamo il 30 giugno. Qui è stato ipotizzato che ci vogliano 5 giorni prima che il manutentore corregga il bug e carichi la nuova versione. Il numero 5 non deve essere preso letteralmente: potrebbe essere di più o di meno a seconda del grado di severità del baco critico in questione.
ru: Сопровождающий XYZ исправляет эту ошибку и загружает исправленную версию в нестабильный дистрибутив, скажем, 30 июня. Здесь предполагается, что потребовалось 5 дней, чтобы сопровождающий исправил ошибку и закачал новую версию. Число 5 не следует воспринимать как постоянную величину. Оно может быть меньше или больше, в зависимости от сложности имеющейся RC-ошибки.

source: This new version in unstable, XYZ-3.8 is scheduled to enter testing on July 10th.
it: L'entrata in testing di questa versione nuova in unstable, XYZ-3.8, è pianificata per il 10 luglio.
ru: Планируется, что новая версия из нестабильного дистрибутива, XYZ-3.8, войдёт в тестируемый 10 июля.

source: But on July 5th some other person, discovers another RC-bug in XYZ-3.8
it: Ma il 5 luglio qualcun altro scopre un altro bug critico per il rilascio in XYZ-3.8.
ru: Но 5 июля другой человек обнаруживает другую RC-ошибку в XYZ-3.8.

source: Let's say the maintainer of XYZ fixes this new RC-bug and uploads new version of XYZ after 5 days.
it: Diciamo che il manutentore di XYZ risolve questo nuovo bug critico e carica la nuova versione di XYZ dop 5 giorni.
ru: Предположим, что сопровождающий XYZ исправил эту новую RC-ошибку и закачал новую версию XYZ через 5 дней.

source: So on July 10, testing has XYZ-3.7 while unstable has XYZ-3.9
it: Perciò il 10 luglio testing ha XYZ-3.7, mentre unstable ha XYZ-3.9.
ru: Итак, 10 июля в тестируемом дистрибутиве содержится XYZ-3.7, а в нестабильном XYZ-3.9.

source: This new version XYZ-3.9 is now rescheduled to enter testing on July 20th.
it: L'entrata in testing di questa versione nuova, XYZ-3.9, è ora pianificata per il 20 luglio.
ru: Планируется, что новая версия XYZ-3.9 попадёт в тестируемый дистрибутив 20 июля.

source: Now since you are running testing, and since XYZ-3.7 is buggy, you could probably use XYZ only after July 20th. That is you essentially ended up with a broken XYZ for about one month.
it: Dato che si usa testing e dato che XYZ-3.7 è affetta da un bug, sarà probabilmente possibile usare XYZ solo dopo il 20 luglio. Cioè, fondamentalmente ci si è ritrovati con una versione guasta di XYZ per circa un mese.
ru: Так как вы используете тестируемый дистрибутив, а версия XYZ-3.7 имеет ошибки, то вы, вероятно, сможете использовать XYZ только после 20 июля. То есть фактически целый месяц у вас стояла нерабочая версия XYZ.

source: The situation can get much more complicated, if say, XYZ depends on 4 other packages. This could in turn lead to unusable testing distribution for months. The above scenario which is artificially created by me, can occur in the real life. But such occurrences are rare.
it: La situazione può complicarsi ulteriormente se, per esempio, XYZ dipende da 4 altri pacchetti. Ciò potrebbe risultare in una distribuzione testing inutilizzabile per mesi. Lo scenario dipinto sopra, inventato dall'autore, può avverarsi nella vita reale. Ma ciò è raro.
ru: Ситуация может существенно осложниться, если, скажем, XYZ зависит от 4 других пакетов. Это может приводить к неработоспособности тестируемого дистрибутива на несколько месяцев. Приведённый выше вымышленный сценарий вполне может произойти и в жизни. Но такое случается редко.

source: From an administrator's point of view, Which distribution requires more attention?
it: Dal punto di vista di un amministratore, quale distribuzione richiede più attenzioni?
ru: С точки зрения администратора, какой дистрибутив требует большего внимания?

source: One of the main reasons many people chose Debian over other Linux distributions is that it requires very little administration. People want a system that just works. In general one can say that, stable requires very little maintenance while testing and unstable require constant maintenance from the administrator. If you are running stable, all you need to worry about is, keeping track of security updates. If you are running either testing or unstable it is a good idea to be aware of the new bugs discovered in the installed packages, new bugfixes/features introduced etc.
it: Una delle ragioni principali per cui molte persone scelgono Debian invece di altre distribuzioni Linux è il fatto che richiede molto poca amministrazione. Le persone vogliono un sistema che semplicemente funzioni. In generale si può dire che stable richiede molto poca manutenzione mentre testing e unstable richiedono una manutenzione costante da parte dell'amministratore. Se si usa stable, tutto ciò di cui ci si deve preoccupare è il tenere traccia degli aggiornamenti di sicurezza. Se si usa testing o unstable è una buona idea tenersi al corrente dei nuovi bug scoperti nei pacchetti installati, delle nuove risoluzioni di bug, delle funzionalità introdotte, ecc.
ru: Одной из основных причин, по которой многие люди выбирают Debian среди других дистрибутивов Linux, является то, что он не отнимает много времени на администрирование. Люди хотят систему, которая просто работает. В общем, можно сказать, что стабильный дистрибутив не требует много усилий для поддержания работоспособности, а тестируемый и нестабильный требуют постоянного внимания администратора. Если вы работаете со стабильным дистрибутивом, то всё, что вам нужно, &mdash; это следить за обновлениями безопасности. При использовании тестируемого или нестабильного лучше быть в курсе новых обнаруженных ошибок в установленных пакетах, новых исправлений/возможностей и т.д.

source: What happens when a new release is made?
it: Cosa succede quando viene fatto un nuovo rilascio?
ru: Что происходит при выходе новой версии дистрибутива?

source: This question will not help you in choosing a Debian distribution. But sooner or later you will face this question.
it: Questa domanda non aiuta a scegliere una distribuzione Debian, ma prima o poi verrà fatto di porsela.
ru: Этот вопрос не поможет вам в выборе дистрибутива Debian. Но рано или поздно он встанет перед вами.

source: The stable distribution is currently &releasename;; The next stable distribution will be called as &testingreleasename;. Let's consider the particular case as to what happens when &testingreleasename; is released as the new stable version.
it: La distribuzione stable è attualmente &releasename;; la prossima versione stable si chiamerà &testingreleasename;. Consideriamo il caso particolare di ciò che avverrà quando &testingreleasename; verrà rilasciata come nuova versione stable.
ru: В настоящее время стабильным дистрибутивом является &releasename;; следующий стабильный дистрибутив будет называться &testingreleasename;. Рассмотрим что случится, когда &testingreleasename; станет новой стабильной версией.

source: Unstable is always referred to as sid irrespective of whether a release is made or not.
it: Ci si riferisce ad unstable sempre come a sid indipendentemente dal fatto che venga fatto o meno un rilascio.
ru: Нестабильный всегда указывает на sid, независимо от того, вышла ли новая версия или нет.

source: packages constantly migrate from sid to testing (i.e. &testingreleasename;). But packages in stable (i.e. &releasename;) remain the same except for security updates.
it: I pacchetti migrano continuamente da sid a testing (cioè &testingreleasename;). I pacchetti in stable (cioè &releasename;) però rimangono gli stessi tranne che per gli aggiornamenti di sicurezza.
ru: Пакеты постоянно переносятся из sid в тестируемый (то есть в &testingreleasename;). А пакеты в стабильном (то есть в &releasename;) не меняются (за исключением обновлений безопасности).

source: after sometime testing becomes frozen. But it will still be called testing. At this point no new packages from unstable can migrate to testing unless they include release-critical (RC) bug fixes.
it: Dopo un certo periodo testing viene congelata nello stato di freeze; ma continuerà ad essere chiamata testing. A questo punto nessun pacchetto nuovo può migrare da unstable a testing a meno che non contenga la soluzione ad un bug critico per il rilascio (RC).
ru: По прошествии какого-то времени тестируемый замораживают. Но он всё равно пока будет называться тестируемым. В этот период никакие новые пакеты из нестабильного дистрибутива в тестируемый перемещаться не могут, за исключением лишь тех, что содержат исправления ошибок, критических для выпуска (release-critical &mdash; RC).

source: When testing is frozen, all the new bugfixes introduced, have to be manualy checked by the members of the release team. This is done to ensure that there wont be any unknown severe problems in the frozen testing.
it: Quando testing è in freeze, tutte le nuove risoluzioni dei bug introdotte devono essere controllate manualmente dai membri del team per il rilascio. Ciò viene fatto per assicurare che non vi sarà alcun problema serio sconosciuto nella versione testing congelata.
ru: Когда тестируемый заморожен, каждое из этих новых исправлений вручную проверяется членами выпускающей команды. Это делается для того, чтобы не добавить каких-нибудь неизвестных серьёзных проблем.

source: RC bugs in 'frozen testing' are reduced to zero.
it: I bug RC nella "testing congelata" vengono ridotti a zero.
ru: Полностью исправляются все RC-ошибки в «замороженном тестируемом» дистрибутиве.

source: The 'frozen testing' with no rc-bugs will be released as the new stable version. In our example, this new stable release will be called as &testingreleasename;.
it: La "testing congelata" senza bachi RC viene rilasciata come nuova versione stable. Nel nostro esempio, questo nuovo rilascio stable sarà chiamato &testingreleasename;.
ru: «Замороженный тестируемый» без RC-ошибок выпускается как новая стабильная версия. В нашем примере новый стабильный выпуск будет называться &testingreleasename;.

source: At this stage oldstable = &releasename;, stable = &testingreleasename;. The contents of stable and 'frozen testing' are same at this point.
it: A questo punto si avrà oldstable = &releasename;, stable = &testingreleasename;. Il contenuto di stable e della "testing congelata" è a questo punto lo stesso.
ru: На этой стадии старый стабильный = &releasename;, стабильный = &testingreleasename;. Содержимое стабильного и «замороженного тестируемого» в этот момент одинаково.

source: A new testing is forked from the current unstable.
it: Viene fatto il fork di una nuova testing dalla stable attuale.
ru: Новым тестируемым дистрибутивом становится копия текущего нестабильного.

source: Packages start coming down from sid to testing and the Debian community will be working towards making the next stable release.
it: I pacchetti iniziano ad arrivare da sid in testing e la comunità Debian lavora ora per fare il prossimo rilascio stable.
ru: Пакеты начинают поступать из sid в тестируемый, и сообщество Debian начинает работать над следующим стабильным выпуском.

source: I have a working Desktop/cluster with Debian installed. How do I know which distribution I am running?
it: Ho un desktop/cluster in funzione con installata Debian. Come fare a sapere quale distribuzione è in esecuzione?
ru: У меня на настольном компьютере/кластере установлен Debian. Как узнать, какой дистрибутив используется?

source: In most situations it is very easy to figure this out. Take a look at the <file>/etc/apt/sources.list</file> file. There will be an entry similar to this:
it: Nella maggior parte dei casi scoprirlo è molto semplice. Guardare il file <file>/etc/apt/sources.list</file>. Ci sarà una voce simile alla seguente:
ru: В большинстве случаев это очень легко сделать. Посмотрите файл <file>/etc/apt/sources.list</file>. Там будет строка, подобная этой:

source: The third field ('unstable' in the above example) indicates the Debian distribution the system is currently tracking.
it: Il terzo campo ("unstable" nell'esempio precedente) indica la distribuzione Debian a cui il sistema sta attualmente facendo riferimento.
ru: Третье поле («unstable» в вышеприведённом примере) указывает на отслеживаемый дистрибутив Debian, установленный в системе.

source: You can also use <prgn>lsb_release</prgn> (available in the <package>lsb-release</package> package). If you run this program in an unstable system you will get:
it: Si può anche usare <prgn>lsb_release</prgn> (disponibile nel pacchetto <package>lsb-release</package>). Se si esegue tale programma in un sistema unstable si ottiene:
ru: Также вы можете использовать команду <prgn>lsb_release</prgn> (из пакета <package>lsb-release</package>). Если вы запустите эту программу на компьютере с нестабильной системой, то получите:

source: However, this is always not that easy. Some systems might have <file>sources.list</file> files with multiple entries corresponding to different distributions. This could happen if the administrator is tracking different packages from different Debian distributions. This is frequently referred to as apt-pinning. These systems might run a mixture of distributions.
it: Tuttavia non è sempre così facile. Alcuni sistemi possono avere file <file>sources.list</file> con voci multiple che corrispondono a distribuzioni diverse. Ciò può accadere se l'amministratore tiene traccia di pacchetti diversi da distribuzioni Debian diverse. Questa azione viene spesso chiamata apt-pinning. Questi sistemi possono avere in esecuzione un mix di distribuzioni.
ru: Однако, это не всегда так легко. В некоторых системах могут быть файлы <file>sources.list</file> с несколькими строками, указывающими на различные дистрибутивы. Так бывает, когда администратор следит за различными пакетами из различных дистрибутивов Debian. Это часто называется apt-pinning. На таких компьютерах может использоваться смесь дистрибутивов.

source: I am currently tracking stable. Can I change to testing or unstable? If so, How?
it: Al momento sto usando stable. Posso passare a testing o unstable? Se sì, come?
ru: Я отслеживаю изменения в стабильном дистрибутиве. Можно ли заменить его на тестируемый или нестабильный? Если да, то как?

source: If you are currently running stable, then in the <file>/etc/apt/sources.list</file> file the third field will be either &releasename; or stable. You need to change this to the distribution you want to run. If you want to run testing, then change the third field of <file>/etc/apt/sources.list</file> to testing. If you want to run unstable, then change the third field to unstable.
it: Se si sta attualmente usando stable, allora nel file <file>/etc/apt/sources.list</file> il terzo campo sarà o &releasename; o stable. È necessario cambiarlo e mettere la distribuzione che si vuole usare. Se si vuole usare testing, allora modificare il terzo campo di <file>/etc/apt/sources.list</file> in testing. Se si vuole usare unstable, allora modificare il terzo campo in unstable.
ru: Если вы используете стабильный дистрибутив, то третье поле в файле <file>/etc/apt/sources.list</file> будет содержать &releasename; или stable. Вам нужно изменить это значение на название того дистрибутива, который вы хотите использовать. Если вам нужен тестируемый дистрибутив, то замените значение третьего поля в <file>/etc/apt/sources.list</file> на testing. Если нужен нестабильный, замените на unstable.

source: Currently testing is called &testingreleasename;. So, if you change the third field of <file>/etc/apt/sources.list</file> to &testingreleasename;, then also you will be running testing. But when &testingreleasename; becomes stable, you will still be tracking &testingreleasename;.
it: Attualmente testing si chiama &testingreleasename;. Perciò, se si cambia il terzo campo di <file>/etc/apt/sources.list</file> in &testingreleasename;, si userà anche in questo caso testing. Quando &testingreleasename; diventerà stable, però, si continuerà ad usare &testingreleasename;.
ru: В настоящее время тестируемый называется &testingreleasename;. Поэтому, если вы измените значение третьего поля в <file>/etc/apt/sources.list</file> на &testingreleasename;, то также переключитесь на работу с тестируемым дистрибутивом. Но когда &testingreleasename; станет стабильным, у вас всё ещё будет продолжаться отслеживаться &testingreleasename;.

source: Unstable is always called Sid. So if you change the third field of <file>/etc/apt/sources.list</file> to sid, then you will be tracking unstable.
it: Unstable si chiama sempre Sid. Perciò se si cambia il terzo campo di <file>/etc/apt/sources.list</file> in sid, si userà unstable.
ru: Нестабильный всегда называется Sid. Поэтому, если вы измените значение третьего поля в <file>/etc/apt/sources.list</file> на sid, то у вас будет отслеживаться нестабильный дистрибутив.

source: Currently Debian offers security updates for testing but not for unstable, as fixes in unstable are directly made to the main archive. So if you are running unstable make sure that you remove the lines relating to security updates in <file>/etc/apt/sources.list</file>.
it: Attualmente Debian offre aggiornamenti di sicurezza per testing ma non per unstable, dato che le risoluzioni dei problemi in unstable vengono direttamente fatte all'archivio principale. Perciò se si usa unstable assicurarsi di rimuovere dal file <file>/etc/apt/sources.list</file> le righe relative agli aggiornamenti di sicurezza .
ru: В настоящее время, Debian предлагает обновления безопасности для тестируемого дистрибутива, но не для нестабильного, так как исправления в нестабильном дистрибутиве сразу же попадают в главный архив. Поэтому, если вы используете нестабильный дистрибутив, проверьте, что удалили из <file>/etc/apt/sources.list</file> строки, касающиеся обновлений безопасности.
