Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: Packages can be deleted two ways:
it: i pacchetti possono essere cancellati in due modi:
ru: Пакеты можно удалить двумя способами.

source: removed: this removes most of the files associated with the package, but preserves the files listed as configuration files (see <ref id="conffile">) and package configuration information. This is done by pressing the `-' key.
it: rimossi: questo rimuove la maggior parte dei file associati al pacchetto, ma preserva i file elencati come file di configurazione (si veda <ref id="conffile">) e le informazioni di configurazione del pacchetto. Questo viene fatto premendo il tasto "-".
ru: Удалить (remove): эта команда удаляет большинство файлов принадлежащих пакету, но оставляет файлы, помеченные как настроечные (см. <ref id="conffile">) и информацию о настройке пакета. Выполняется нажатием клавиши «-».

source: purged: this removes <em>every</em> file that is part of the package. This is done by pressing the `_' key.
it: eliminati: questo rimuove <em>ogni</em> file che è parte del pacchetto. Questo viene fatto premendo il tasto "_".
ru: Вычистить (purged): команда удаляет <em>все</em> файлы пакета. Выполняется нажатием клавиши «_».

source: Note that it's not possible to remove "All Packages". If you try that, your system will instead be reduced to the initial installed base packages.
it: Si noti che non è possibile rimuovere "Tutti i pacchetti" ("All Packages"). Se si prova, il proprio sistema viene invece ridotto ai pacchetti base dell'installazione iniziale.
ru: Заметим, что невозможно удалить «все пакеты». Если вы попытаетесь это сделать, то система будет сокращена до первоначально установленных базовых пакетов.

source: to be put "on hold"
it: Da bloccare ("hold")
ru: для «фиксации»

source: This is done by pressing `=', and it effectively tells <prgn>dselect</prgn> not to upgrade a package even if the version currently installed on your system is not as recent as the version that is available in the Debian repository you are using (this was specified when you set the <strong>Access Method</strong>, and acquired when you used <strong>Update</strong>).
it: Questo viene fatto premendo "=" e dice effettivamente a <prgn>dselect</prgn> di non aggiornare un pacchetto nemmeno se la versione attualmente installata sul sistema non è recente come la versione disponibile nel repository Debian che si sta usando (e che è stato specificato quando si è impostato il <strong>Metodo d'accesso</strong> e ottenuto quando si è usato <strong>Aggiorna</strong>).
ru: Фиксация выполняется нажатием «=», и указывает <prgn>dselect</prgn> не выполнять обновление пакета, даже если установленная версия устарела по сравнению с той, что имеется в используемом вами хранилище пакетов Debian (указанное через <strong>метод доступа (Access Method)</strong>, и инициализируется при выполнении <strong>обновления (Update)</strong>).

source: Just like you can put a package on hold, you can reverse such setting by pressing `:'. That tells <prgn>dselect</prgn> that the package(s) may be upgraded if a newer version is available. This is the default setting.
it: Così come si può bloccare un pacchetto, si può annullare questa impostazione premendo ":". Questo dice a <prgn>dselect</prgn> che il pacchetto può essere aggiornato se è disponibile una versione più recente. Questa è l'impostazione predefinita.
ru: Если пакет зафиксирован, то вернуть его в нормальное состояние можно нажав «:». Это указывает <prgn>dselect</prgn>, что пакет может быть обновлён, если доступна более новая версия. Это является установкой по умолчанию.

source: You can select a different order in which the packages are presented, by using the `o' key to cycle between various options for sorting the packages. The default order is to present packages by Priority; within each priority, packages are presented in order of the directory (a.k.a. section) of the archive in which they are stored. Given this sort order, some packages in section A (say) may be presented first, followed by some packages in section B, followed by more packages (of lower priority) in section A.
it: Si può selezionare un ordine differente in cui presentare i pacchetti usando il tasto "o" per passare in modo ciclico a varie opzioni di ordinamento dei pacchetti. L'ordine predefinito presenta i pacchetti in base alla priorità; all'interno di ogni priorità i pacchetti vengono presentati in ordine di directory (alias sezioni) dell'archivio nel quale sono memorizzati. In base a quest'ordine, alcuni pacchetti nella sezione A (per esempio) possono essere presentati per primi, seguiti da alcuni pacchetti nella sezione B, seguiti da altri pacchetti (con priorità più bassa) nella sezione A.
ru: Вы можете выбирать различный порядок показа пакетов, используя клавишу «o» для переключения между режимами сортировки. Изначально пакеты отсортированы по приоритету; в пределах каждого приоритета пакеты представлены в порядке появления в каталоге (также называемого разделом), в котором они хранятся. При задании такого порядка сортировки, сначала могут отображаться пакеты из раздела A (как пример), потом какие-то из раздела B, а за ними ещё пакеты (с меньшим приоритетом) из раздела A.

source: You can also expand meanings of the labels at the top of the screen, by using the `v' (verbose) key. This action pushes much of the text that formerly fit onto the display off to the right. To see it, press the right arrow; to scroll back to the left, press the left arrow.
it: Si possono anche espandere le etichette in cima alla schermata, usando il tasto "v" (verbose, prolisso). Questa azione spinge sulla destra molto del testo che precedentemente veniva visualizzato nella schermata. Per vederlo si prema la freccia a destra; per scorrere di nuovo a sinistra si prema la freccia a sinistra.
ru: Также можно получить описание значений меток в верхней части экрана, нажав клавишу «v». Данное действие увеличивает объём выводимого текста, и он выходит за правую границу экрана. Для прокрутки текста можно пользоваться клавишами со стрелками вправо и влево.

source: If you select a package for installation or removal, e.g., <package>foo.deb</package>, and that package depends on (or recommends) another package, e.g., <package>blurf.deb</package>, then <prgn>dselect</prgn> will place the you in a sub-screen of the main selection screen. There you can choose among the related packages, accepting the suggested actions (to install or not), or rejecting them. To do the latter, press Shift-D; to return to the former, press Shift-U. In any case, you can save your selections and return to the main selection screen by pressing Shift-Q.
it: Se si seleziona un pacchetto per l'installazione o la rimozione, per esempio <package>pippo.deb</package>, e quel pacchetto dipende da (o raccomanda) un altro pacchetto, per esempio <package>ciccio.deb</package>, allora <prgn>dselect</prgn> porta l'utente in una sottoschermata della schermata di selezione principale. Lì si può scegliere tra i pacchetti correlati, accettando le azioni suggerite (installare o meno) o rifiutandole. Per fare quest'ultima azione, si prema Maiusc-D; per tornare alla prima si prema Maiusc-U. In ogni caso, si possono salvare le proprie selezioni e ritornare alla schermata principale di selezione premendo Maiusc-Q.
ru: Если вы выбрали пакет для установки или удаления, например, <package>package/foo.deb</package>, и этот пакет зависит от (или рекомендует) других пакетов, например, <package>package/blurf.deb</package>, то <prgn>dselect</prgn> выведет дополнительный экран, подобный основному экрану выбора. Там вы сможете выбрать среди пакетов, относящихся к данному те, которые следует установить. Вы можете принять предлагаемый вариант или отказаться от него. В последнем случае следует нажать Shift-D; для возврата к предлагаемому варианту, нажмите Shift-U. В любом случае, вы можете сохранить свой выбор нажатием Shift-Q.

source: Users returning to the main menu can then select the "Install" menu item to unpack and configure the selected packages. Alternatively, users wishing to remove files can choose the "Remove" menu item. At any point, users can choose "Quit" to exit dselect; users' selections are preserved by <prgn>dselect</prgn>.
it: Gli utenti che ritornano al menu principale possono poi selezionare la voce di menu "Installa" ("Install") per spacchettare e configurare i pacchetti selezionati. In alternativa, gli utenti che desiderano rimuovere file possono scegliere la voce di menu "Rimuovi". In ogni momento, gli utenti possono scegliere "Termina" ("Quit") per uscire da dselect; le selezioni sono preservate da <prgn>dselect</prgn>.
ru: После выбора пакетов вы возвращаетесь в главное меню установки. Там вы можете выбрать «Установить» (Install) для установки и настройки выбранных пакетов. Если вы отметили пакеты для удаления, то можете выбрать пункт «Удалить» (Remove). В любой момент времени можно выбрать пункт «Выход» (Quit) для выхода из dselect; при этом выбор пакетов, отмеченных для установки и удаления, <prgn>dselect</prgn> сохранит.

source: This program manipulates Debian archive(<tt>.deb</tt>) files. Some common uses are:
it: Questo programma manipola i file archivio Debian (<tt>.deb</tt>). Quelli che seguono sono alcuni degli usi comuni.
ru: Данная программа позволяет манипулировать файлами архивов Debian (<tt>.deb</tt> файлами). Часто используемые команды:

source: Find out all the options: <tt>dpkg-deb --help</tt>.
it: Scoprire tutte le opzioni: <tt>dpkg-deb --help</tt>.
ru: Вывести список допустимых параметров: <tt>dpkg-deb --help</tt>

source: Determine what files are contained in a Debian archive file: <tt>dpkg-deb --contents foo_VVV-RRR.deb</tt>)
it: Determinare quali file sono contenuti in un file archivio Debian: <tt>dpkg-deb --contents pippo_VVV-RRR.deb</tt>
ru: Определить, какие файлы содержатся в архивном файле Debian: <tt>dpkg-deb --contents foo_VVV-RRR.deb</tt>)

source: Extract the files contained in a named Debian archive into a user specified directory: <tt>dpkg-deb --extract foo_VVV-RRR.deb tmp</tt> extracts each of the files in <tt>foo_VVV-RRR.deb</tt> into the directory <tt>tmp/</tt>. This is convenient for examining the contents of a package in a localized directory, without installing the package into the root file system.
it: Estrarre i file contenuti in un archivio Debian dentro una directory specificata dall'utente: <tt>dpkg-deb --extract pippo_VVV-RRR.deb tmp</tt> estrae ognuno dei file in <tt>pippo_VVV-RRR.deb</tt> nella directory <tt>tmp/</tt>. Questo è comodo per esaminare il contenuto di un pacchetto in una directory localizzata, senza installare il pacchetto nel file system root.
ru: Извлечь файлы, содержащиеся в архиве Debian, в указанный пользователем каталог: <tt>dpkg-deb --extract foo_VVV-RRR.deb tmp</tt> извлечёт все файлы из <tt>foo_VVV-RRR.deb</tt> в каталог <tt>tmp/</tt>. Это удобно для просмотра содержимого пакета в отдельном каталоге без его установки в основное дерево каталогов

source: Extract the control information files from a package: <tt>dpkg-deb --control foo_VVV-RRR.deb tmp</tt>.
it: Estrarre i file delle informazioni di controllo da un pacchetto: <tt>dpkg-deb --control pippo_VVV-RRR.deb tmp</tt>
ru: Извлечь файлы с управляющей информацией из пакета: <tt>dpkg-deb --control foo_VVV-RRR.deb tmp</tt>

source: Note that any packages that were merely unpacked using <tt>dpkg-deb --extract</tt> will be incorrectly installed, you should use <tt>dpkg --install</tt> instead.
it: Si noti che ogni pacchetto che è stato semplicemente spacchettato usando <tt>dpkg-deb --extract</tt> non sarà installato correttamente, si dovrebbe invece usare <tt>dpkg --install</tt>.
ru: Заметим, что любые пакеты, просто распакованные командой <tt>dpkg-deb --extract</tt>, будут установлены некорректно, для установки следует использовать <tt>dpkg --install</tt>.

source: More information is given in the manual page <manref section="1" name="dpkg-deb">.
it: Maggiori informazioni sono fornite nella pagina di manuale <manref section="1" name="dpkg-deb">.
ru: Дополнительную информацию можно найти в справочной странице <manref section="1" name="dpkg-deb">.

source: This program splits large package into smaller files (e.g., for writing onto a set of floppy disks), and can also be used to merge a set of split files back into a single file. It can only be used on a Debian system (i.e. a system containing the <package>dpkg</package> package), since it calls the program <tt>dpkg-deb</tt> to parse the debian package file into its component records.
it: Questo programma divide un grosso pacchetto in file più piccoli (ad esempio per la scrittura su una serie di floppy disk) e può anche essere usato per riunire una serie di file divisi in un file singolo. Può venire usato solo su di un sistema Debian (cioè un sistema contenente il pacchetto <package>dpkg</package>), perché chiama il programma <tt>dpkg-deb</tt> per analizzare il pacchetto debian nei suoi componenti.
ru: Эта программа делит большие пакеты на файлы меньшего размера (например, для записи на дискеты), а также может использоваться для объединения набора разделённых файлов обратно в один файл. Она может использоваться только в системах Debian (т.е. в системах, содержащих пакет <package>dpkg</package>), т.к. вызывает программу <tt>dpkg-deb</tt> для разделения файла пакета на отдельные компоненты.

source: For example, to split a big .deb file into N parts,
it: Per esempio, per dividere un grosso file .deb in N parti:
ru: Например, для того, чтобы разделить большой .deb файл на N частей нужно:

source: Execute the command <tt>dpkg-split --split foo.deb</tt>. This will produce N files each of approximately 460 KBytes long in the current directory.
it: Si esegua il comando <tt>dpkg-split --split pippo.deb</tt>. Questo produrrà N file ognuno approssimativamente lungo 460 KByte nella directory attuale.
ru: Выполнить команду <tt>dpkg-split --split foo.deb</tt>. В результате в текущем каталоге получится N файлов, приблизительно по 460 Кбайт каждый.

source: Copy those N files to floppy disks.
it: Si copino gli N file su dei floppy disk.
ru: Скопировать эти N файлов на дискеты.

source: Copy the contents of the floppy disks onto the hard disk of your choice on the other machine.
it: Si copi il contenuto dei floppy disk sull'hard disk prescelto su un'altra macchina.
ru: Скопировать содержимое дискет на жёсткий диск другой машины.

source: Join those part-files together using <tt>dpkg-split --join "foo*"</tt>.
it: Si uniscano le parti dei file insieme usando <tt>dpkg-split --join "pippo*"</tt>.
ru: Объединить эти части файлов вместе командой <tt>dpkg-split --join "foo*"</tt>.

source: Debian claims to be able to update a running program; how is this accomplished?
it: Debian afferma di essere in grado di aggiornare un programma in esecuzione; come viene fatto?
ru: Debian утверждает, что способен обновить работающую программу; как это делается?

source: The kernel (file system) in &debian; systems supports replacing files even while they're being used.
it: Il kernel (file system) nei sistemi &debian; supporta la sostituzione dei file anche quando sono in uso.
ru: Ядро (файловая система) в системах &debian; поддерживает замену файлов, даже когда они используются.

source: We also provide a program called <prgn>start-stop-daemon</prgn> which is used to start daemons at boot time or to stop daemons when the runlevel is changed (e.g., from multi-user to single-user or to halt). The same program is used by installation scripts when a new package containing a daemon is installed, to stop running daemons, and restart them as necessary.
it: È fornito anche un programma chiamato <prgn>start-stop-daemon</prgn> che viene usato per avviare i demoni all'avvio o fermarli quando il runlevel cambia (per esempio, da multiutente a singolo utente o all'arresto). Lo stesso programma viene usato dagli script di installazione quando viene installato un nuovo pacchetto contenente un demone, per fermare i demoni in esecuzione e riavviarli se necessario.
ru: Мы также предоставляем программу <prgn>start-stop-daemon</prgn>, которая используется для запуска служб при загрузке компьютера или их останова при изменении уровня выполнения (например, из многопользовательского в однопользовательский или для выключения компьютера). Эта же программа используется сценариями установки при установке нового пакета со службой, для остановки работающей службы и её перезапуска при необходимости.

source: How can I tell what packages are already installed on a Debian system?
it: Come si può sapere quali pacchetti sono già installati su un sistema Debian?
ru: Как узнать, какие пакеты установлены в системе Debian?

source: To learn the status of all the packages installed on a Debian system, execute the command
it: Per conoscere lo stato di tutti i pacchetti installati su di un sistema Debian, si esegua il comando
ru: Чтобы получить список всех установленных пакетов, выполните команду

source: This prints out a one-line summary for each package, giving a 2-letter status symbol (explained in the header), the package name, the version which is <em>installed</em>, and a brief description.
it: Questo stampa un riassunto di una riga per ogni pacchetto, dando un simbolo di stato di due lettere (spiegato nell'intestazione), il nome del pacchetto, la versione <em>installata</em> e una breve descrizione.
ru: Эта команда выведет для каждого пакета строчку с двумя символами состояния (обозначения раскрыты в заголовке), имя пакета, <em>установленную</em> версию и краткое описание.

source: To learn the status of packages whose names match the string any pattern beginning with "foo" by executing the command:
it: Per sapere lo stato dei pacchetti i cui nomi corrispondono a qualsiasi modello di stringa iniziante con "pippo" si esegua il comando:
ru: Чтобы узнать состояние пакетов, имена которых начинаются с «foo», выполните команду:

source: dpkg --list 'foo*'
it: dpkg --list 'pippo*'

source: To get a more verbose report for a particular package, execute the command:
it: Per ottenere un rapporto più prolisso per un particolare pacchetto si esegua il comando:
ru: Чтобы получить более подробный отчёт о состоянии определённого пакета, выполните команду:

source: dpkg --status packagename
it: dpkg --status nomepacchetto
ru: dpkg --status имя_пакета

source: How to display the files of a package installed?
it: Come mostrare i file installati da un pacchetto?
ru: Как посмотреть список файлов установленного пакета?

source: To list all the files provided by the installed package <tt>foo</tt> execute the command
it: Per elencare tutti i file forniti dal pacchetto <tt>pippo</tt> installato si esegua il comando
ru: Чтобы вывести список файлов, предоставляемых установленным пакетом <tt>foo</tt>, выполните команду

source: dpkg --listfiles foo
it: dpkg --listfiles pippo

source: Note that the files created by the installation scripts aren't displayed.
it: Notare che i file creati dagli script di installazione non vengono mostrati.
ru: Заметим, что файлы, созданные сценариями установки, не отображаются.

source: How can I find out what package produced a particular file?
it: Come posso scoprire quale pacchetto ha prodotto un particolare file?
ru: Как определить пакет, которому принадлежит определённый файл?

source: To identify the package that produced the file named <tt>foo</tt> execute either:
it: Per identificare il pacchetto che ha prodotto il file chiamato <tt>pippo</tt> si esegua uno dei comandi:
ru: Чтобы определить, в каком пакете содержится файл с именем <tt>foo</tt>, выполните одну из следующих команд:

source: <tt>dpkg --search filename</tt>
it: <tt>dpkg --search nomefile</tt>
ru: <tt>dpkg --search имя_файла</tt>

source: This searches for <tt>filename</tt> in installed packages. (This is (currently) equivalent to searching all of the files having the file extension of <tt>.list</tt> in the directory <tt>/var/lib/dpkg/info/</tt>, and adjusting the output to print the names of all the packages containing it, and diversions.)
it: Questo cerca <tt>nomefile</tt> nei pacchetti installati. (È (attualmente) equivalente a cercare nella directory <tt>/var/lib/dpkg/info/</tt> tutti i file aventi l'estensione <tt>.list</tt> e a sistemare l'output per stampare i nomi di tutti i pacchetti e le deviazioni che lo contengono.)
ru: Эта команда ищет <tt>имя_файла</tt> в установленных пакетах. (Это, в настоящий момент, эквивалентно поиску всех файлов с расширением <tt>.list</tt> в каталоге <tt>/var/lib/dpkg/info/</tt>, и выводу имён всех пакетов, которые содержат заданное имя файла и отклонения (diversions).)

source: A faster alternative to this is the <prgn>dlocate</prgn> tool.
it: Un'alternativa più veloce è lo strumento <prgn>dlocate</prgn>.
ru: Более быстрая альтернатива этому &mdash; программа <prgn>dlocate</prgn>.

source: dlocate -S filename
it: dlocate -S nomefile
ru: dlocate -S имя_файла

source: <tt>zgrep foo Contents-ARCH.gz</tt>
it: <tt>zgrep pippo Contents-ARCH.gz</tt>

source: This searches for files which contain the substring <tt>foo</tt> in their full path names. The files <tt>Contents-ARCH.gz</tt> (where ARCH represents the wanted architecture) reside in the major package directories (main, non-free, contrib) at a Debian FTP site (i.e. under <tt>/debian/dists/&releasename;</tt>). A <tt>Contents</tt> file refers only to the packages in the subdirectory tree where it resides. Therefore, a user might have to search more than one <tt>Contents</tt> files to find the package containing the file <tt>foo</tt>.
it: Questo cerca i file contenenti la sottostringa <tt>pippo</tt> nel loro nome di percorso completo. I file <tt>Contents-ARCH.gz</tt> (dove ARCH rappresenta l'architettura desiderata) risiedono nelle directory principali dei pacchetti (main, non-free, contrib) sui siti FTP Debian (cioè in <tt>/debian/dists/&releasename;</tt>). Un file <tt>Contents</tt> si riferisce solo ai pacchetti nell'albero delle sottodirectory dove esso risiede. Quindi, un utente potrebbe dover cercare in più file <tt>Contents</tt> per trovare il pacchetto contenente il file <tt>pippo</tt>.
ru: Эта команда ищет файлы, в которых содержится подстрока <tt>foo</tt> в их полных именах путей. Файлы <tt>Contents-ARCH.gz</tt> (где ARCH представляет нужную архитектуру) расположены в основных каталогах пакетов (main, non-free, contrib) на FTP-машине Debian (то есть, в <tt>/debian/dists/&releasename;</tt>). Файл <tt>Contents</tt> относится только к пакетам, которые располагаются в подкаталогах дерева, находящихся рядом с ним. Поэтому, чтобы найти пакет, содержащий файл <tt>foo</tt>, пользователю нужно искать более чем в одном файле <tt>Contents</tt>.

source: This method has the advantage over <tt>dpkg --search</tt> in that it will find files in packages that are not currently installed on your system.
it: Questo metodo ha il vantaggio rispetto a <tt>dpkg --search</tt> di trovare i file nei pacchetti che non sono attualmente installati sul proprio sistema.
ru: Этот метод имеет преимущество над <tt>dpkg --search</tt> в том, что он ищет файлы в пакетах, которые могут быть не установлены в вашей системе.

source: <tt>apt-file search <var>foo</var></tt>
it: <tt>apt-file search <var>pippo</var></tt>
