Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: If there is a release notes document available for the distribution you are upgrading to (even though it has not yet been released) it would be wise to review it, as it might provide information on how you should upgrade to it.
it: Se è disponibile un documento con le note di rilascio per la distribuzione a cui si sta per fare l'aggiornamento (anche se non ne è ancora stato fatto il rilascio) sarebbe saggio leggerlo, dato che potrebbe fornire informazioni su come fare l'aggiornamento.
ru: Если для дистрибутива, до которого выполняется обновление, доступна информация о выпуске (даже если официально он ещё не вышел), разумно будет её просмотреть, так как в ней может содержаться информация о том, как проводить обновление.

source: Nevertheless, once you make the above changes, you can run <file>aptitude update</file> and then install the packages that you want. Notice that installing a package from a different distribution might automatically upgrade half of your system. If you install individual packages you will end up with a system running mixed distributions.
it: Ciò nonostante, una volta fatti i cambiamenti detti sopra si può eseguire <file>aptitude update</file> e poi installare i pacchetti desiderati. Notare che l'installazione di un pacchetto da una distribuzione diversa può aggiornare automaticamente metà del sistema. Se si installano pacchetti specifici si finirà per avere in esecuzione un sistema con un mix di distribuzioni.
ru: Тем не менее, после того как были произведены вышеуказанные изменения, вы можете запустить <file>aptitude update</file> и затем устанавливать нужные вам пакеты. Заметим, что установка пакетов от другого дистрибутива может привести к обновлению половины системы. Если вы устанавливаете отдельные пакеты, то получите систему, работающую на смеси дистрибутивов.

source: It might be best in some situations to just fully upgrade to the new distribution running <prgn>apt-get dist-upgrade</prgn>, <prgn>aptitude safe-upgrade</prgn> or <prgn>aptitude full-upgrade</prgn>. Read apt's and aptitude's manual pages for more information.
it: Potrebbe essere meglio in alcune situazioni aggiornare semplicemente l'intero sistema alla nuova distribuzione eseguendo <prgn>apt-get dist-upgrade</prgn>, <prgn>aptitude safe-upgrade</prgn> o <prgn>aptitude full-upgrade</prgn>. Per maggiori informazioni, leggere le pagine di manuale di apt e aptitude.
ru: В некоторых ситуациях лучше выполнить полное обновление до нового дистрибутива, запустив <prgn>apt-get dist-upgrade</prgn>, <prgn>aptitude safe-upgrade</prgn> или <prgn>aptitude full-upgrade</prgn>. Подробней об этом можно узнать из справочных страниц по apt и aptitude.

source: I am currently tracking testing (&testingreleasename;). What will happen when a release is made? Will I still be tracking testing or will my machine be running the new stable distribution?
it: Attualmente sto usando testing (&testingreleasename;). Cosa succederà quando verrà fatto un rilascio? Continuerò ad usare testing o la macchina userà la nuova distribuzione stabile?
ru: Сейчас я использую тестируемый дистрибутив (&testingreleasename;). Что произойдёт после выпуска следующей версии? У меня по-прежнему будет отслеживаться тестируемый дистрибутив, или на моей машине будет новый стабильный дистрибутив?

source: It depends on the entries in the <file>/etc/apt/sources.list</file> file. If you are currently tracking testing, these entries are similar to either:
it: Dipende dalle voci nel file <file>/etc/apt/sources.list</file>. Se si sta attualmente usando testing, tali voci saranno simili a una di queste due:
ru: Это зависит от записей в файле <file>/etc/apt/sources.list</file>. Если сейчас у вас отслеживается тестируемый дистрибутив, то там будут строки вида:

source: or
it: o
ru: или

source: If the third field in <file>/etc/apt/sources.list</file> is 'testing' then you will be tracking testing even after a release is made. So after &testingreleasename; is released, you will be running a new Debian distribution which will have a different codename. Changes might not be apparent at first but will be evident as soon as new packages from unstable go over to the testing distribution.
it: Se nel terzo campo in <file>/etc/apt/sources.list</file> c'è "testing" allora si continuerà ad usare testing anche dopo un avvenuto rilascio. Perciò dopo che &testingreleasename; sarà rilasciata, si starà usando una nuova distribuzione Debian che avrà un nome in codice diverso. I cambiamenti potrebbero non essere evidenti all'inizio, ma lo diverranno non appena nuovi pacchetti passeranno dalla distribuzione unstable a testing.
ru: Если в третьем поле файла <file>/etc/apt/sources.list</file> стоит «testing», то даже после выхода нового выпуска у вас будет отслеживаться тестируемый дистрибутив. Поэтому после выхода &testingreleasename; вы будете работать на новом дистрибутиве Debian с другим кодовым названием. Сначала изменения будут незаметны, но они проявятся, как только новые пакеты начнут переходить из нестабильного дистрибутива в тестируемый.

source: But if the third field contains '&testingreleasename;' then you will be tracking stable (since &testingreleasename; will then be the new stable distribution).
it: Se però il terzo campo contiene "&testingreleasename;" allora si userà stable (dato che &testingreleasename; sarà allora la nuova distribuzione stable).
ru: Но если третье поле содержит «&testingreleasename;», то вы перейдёте на стабильный дистрибутив (так как &testingreleasename; станет новым стабильным дистрибутивом).

source: I am still confused. What did you say I should install?
it: Sono ancora confuso. Cosa hai detto che devo installare?
ru: Всё равно непонятно. Так что же нужно устанавливать?

source: If unsure, the best bet would be stable distribution.
it: Se non si è sicuri, la scelta migliore sarebbe la distribuzione stabile.
ru: Если не знаете, что выбрать, устанавливайте стабильный дистрибутив.

source: But what about Knoppix, Linex, Ubuntu, and others?
it: E per quanto riguarda Knoppix, Linex, Ubuntu e altre?
ru: Но ещё есть Knoppix, Linex, Ubuntu и другие?

source: They are not Debian; they are <em>Debian based</em>. Though there are many similarities and commonalities between them, there are also crucial differences.
it: Non sono Debian; sono <em>basate su Debian</em>. Benché ci siano molte somiglianze e cose in comune tra di esse, vi sono anche differenze fondamentali.
ru: Это не дистрибутивы Debian, это дистрибутивы, <em>построенные на основе Debian</em>. Хотя в них есть много общего и похожего, но есть также и принципиальные различия.

source: All these distributions have their own merits and are suited to some specific set of users. For more information, read the information of <url id="http://www.debian.org/misc/children-distros" name="software distributions based on Debian"> available at the Debian website.
it: Tutte queste distribuzioni hanno i propri meriti e sono adatte a particolari tipi di utenti. Per maggiori informazioni, consultare la pagina sulle <url id="http://www.debian.org/misc/children-distros" name="distribuzioni software basate su Debian"> disponibile sul sito web di Debian.
ru: У каждого из этих дистрибутивов есть свои достоинства, и они очень подходят под определённые задачи. Подробнее об этом можно узнать на странице <url id="http://www.debian.org/misc/children-distros" name="Дистрибутивы GNU/Linux, основанные на Debian"> на сайте Debian.

source: I know that Knoppix/Linex/Ubuntu/... is Debian-based. So after installing it on the hard disk, can I use 'apt' package tools on it?
it: So che Knoppix/Linex/Ubuntu/... è basata su Debian. Perciò dopo l'installazione sull'hard disk, posso usare con essa gli strumenti "apt" per i pacchetti?
ru: Я знаю, что Knoppix/Linex/Ubuntu/… сделан на основе Debian. Смогу ли я после установки его на жёсткий диск использовать для него утилиты управления пакетами apt?

source: These distributions are Debian based. But they are not Debian. You will be still able to use apt package tools by pointing the <file>/etc/apt/sources.list</file> file to these distributions' repositories. But then you are not running Debian, you are running a different distribution. They are not the same.
it: Queste distribuzioni sono basate su Debian. Ma non sono Debian. Sarà comunque possibile usare gli strumenti apt per i pacchetti facendo puntare il file <file>/etc/apt/sources.list</file> agli archivi di queste distribuzioni. Ma non si starà in quel caso usando Debian, si starà usando una distribuzione diversa. Non sono la stessa cosa.
ru: Эти дистрибутивы сделаны на основе Debian. Но это не Debian. Да, вы можете заставить инструменты управления пакетами apt использовать репозитории этих дистрибутивов, указав их в файле <file>/etc/apt/sources.list</file>. Но тогда у вас будет не Debian, а другой дистрибутив. Они не тождественны друг другу.

source: In most situations if you stick with one distribution you should use that and not mix packages from other distributions. Many common breakages arise due to people running a distribution and trying to install Debian packages from other distributions. The fact that they use the same formatting and name (.deb) does not make them inmediately compatible.
it: Nella maggior parte delle situazioni, se si usa una distribuzione si dovrebbe rimanere legati ad essa e non mescolare pacchetti da altre distribuzioni. Molti problemi di funzionamento comuni derivano dall'uso di una distribuzione insieme al tentativo di installare pacchetti Debian da altre distribuzioni. Il fatto che usino lo stesso tipo di formato e lo stesso nome (.deb) non significa che siano automaticamente compatibili.
ru: В большинстве случаев, если вы начали использовать определённый дистрибутив, то должны использовать только его пакеты и не устанавливать пакеты из других дистрибутивов. Очень часто происходят поломки в работе из-за того, что люди пытаются установить в Debian пакеты из других дистрибутивов. Тот факт, что они используют одинаковый формат и расширение (.deb), не делает их совместимыми между собой.

source: For example, Knoppix is a Linux distribution designed to be booted as a live CD where as Debian is designed to be installed on hard-disk. Knoppix is great if you want to know whether a particular hardware works, or if you want to experience how a linux system 'feels' etc., Knoppix is good for demonstration purposes while Debian is designed to run 24/7. Moreover the number of packages available, the number of architectures supported by Debian are far more greater than that of Knoppix.
it: Knoppix, ad esempio, è una distribuzione Linux progettata per essere avviata da un CD Live mentre Debian è progettata per essere installata sull'hard disk. Knoppix è molto bella se si desidera sapere se un particolare hardware funziona o se si vuole provare a vedere come è un sistema Linux, ecc.; Knoppix è adatta a scopi dimostrativi mentre Debian è progettata per essere in funzione 24 ore al giorno, 7 giorni su 7. In più sia il numero dei pacchetti disponibili, sia il numero di architetture supportate di Debian sono estremamente più grandi di quelli di Knoppix.
ru: Например, Knoppix &mdash; это дистрибутив Linux, разработанный для запуска с CD (live-CD), а Debian разрабатывался для установки на жёсткий диск. Knoppix очень полезен, если вы хотите узнать, заработает ли определённое аппаратное обеспечение, или если вы просто хотите узнать, что такое Linux. Knoppix замечательно подходит для демонстрационных целей, в то время как Debian предназначен для работы 24 часа в сутки 7 дней в неделю. Более того, по числу доступных пакетов и поддерживаемых архитектур Debian значительно превосходит Knoppix.

source: If you want Debian, it is best to install Debian from the get-go. Although it is possible to install Debian through other distributions, such as Knoppix, the procedure calls for expertise. If you are reading this FAQ, I would assume that you are new to both Debian and Knoppix. In that case, save yourself a lot of trouble later and install Debian right at the beginning.
it: Se si desidera Debian, la cosa migliore è installare Debian sin dall'inizio. Anche se è possibile installare Debian passando per altre distribuzioni, come Knoppix, la procedura richiede esperienza. Se si sta leggendo questa FAQ è lecito ipotizzare che si è alle prime armi sia con Debian sia con Knoppix. In questo caso, ci si risparmierà un sacco di problemi futuri se si installerà subito Debian.
ru: Если вам нужен Debian, то лучше всего и ставить сразу Debian. Хотя и возможно установить Debian через другие дистрибутивы, такие как Knoppix, такая процедура требует опыта. Если вы читаете эти ЧаВо, то я предполагаю, что вы новичок в Debian и Knoppix. В таком случае, не создавайте сами себе проблем, и устанавливайте сразу Debian.

source: I installed Knoppix/Linex/Ubuntu/... on my hard disk. Now I have a problem. What should I do?
it: Ho installato Knoppix/Linex/Ubuntu/... sul mio hard disk. Ora ho un problema. Cosa devo fare?
ru: Я установил Knoppix/Linex/Ubuntu/… на жёсткий диск. У меня возникла проблема. Что делать?

source: You are advised not to use the Debian forums (either mailing lists or IRC) for help as people might advise you thinking that you are running a Debian system and the "fixes" they provide might not be suited to what you are running. They might even worsen the problem you are facing.
it: È sconsigliato usare i forum Debian (mailing list o IRC) per chiedere aiuto perché le persone daranno suggerimenti pensando che si stia usando un sistema Debian e le "soluzioni" fornite potrebbero non essere adatte alla distribuzione che si sta usando; potrebbero persino peggiorare il problema.
ru: Советуем вам не просить о помощи на форумах Debian (или в списках рассылки, или по IRC), так как люди могут подумать, что вы используете Debian, и их «исправления» могут не подойти для вашего дистрибутива. Это даже может нанести ещё больший вред.

source: Use the forums of the specific distribution you are using first. If you do not get help or the help you get does not fix your problem you might want to try asking in Debian forums, but keep the advise of the previous paragraph in mind.
it: Usare prima i forum della distribuzione specifica che si sta usando. Se non si ottiene aiuto o l'aiuto ottenuto non risolve il problema, si può provare a chiedere nei forum Debian, ma tenere a mente l'avvertimento dato nel paragrafo precedente.
ru: Сперва воспользуйтесь форумами по установленному дистрибутиву. Если там не помогут решить проблему, то можете попытаться спросить в форумах по Debian, но не забудьте, о чём говорилось в предыдущем параграфе.

source: I'm using Knoppix/Linex/Ubuntu/... and now I want to use Debian. How do I migrate?
it: Sto usando Knoppix/Linex/Ubuntu/... e ora voglio usare Debian. Come migro a Debian?
ru: Я использую Knoppix/Linex/Ubuntu/... и теперь хочу поставить Debian. Как бы мне переехать?

source: Consider the change from a Debian-based distribution to Debian just like a change from one operating system to another one. You should make a backup of all your data and reinstall the operating system from scratch. You should not attempt to "upgrade" to Debian using the package management tools as you might end up with an unusable system.
it: Considerare il passaggio da una distribuzione basata su Debian a Debian come qualsiasi altro passaggio da un sistema operativo ad un altro. Si dovrebbe fare il backup di tutti i dati e reinstallare il sistema operativo da zero. Non si deve cercare di "aggiornare" a Debian usando gli strumenti di gestione dei pacchetti dato che ci si potrebbe ritrovare con un sistema non funzionante.
ru: Считайте смену дистрибутива на основе Debian сменой одной операционной системы на другую. Вам нужно сделать резервную копию всех данных и переустановить операционную систему с нуля. Не пытайтесь выполнить «обновление» до Debian с помощью программ управления пакетами, так как это может привести к неработоспособности системы.

source: If all your user data (i.e. your <file>/home</file>) is under a separate partition migrating to Debian is actually quite simple, you just have to tell the installation system to mount (but not reformat) that partition when reinstalling. Making backups of your data, as well as your previous system's configuration (i.e. <file>/etc/</file> and, maybe, <file>/var/</file>) is still encouraged.
it: Se tutti i propri dati utente (cioè la propria <file>/home</file>) sono in una partizione separata la migrazione a Debian è in realtà piuttosto semplice, basta semplicemente dire al sistema di installazione di montare (ma non riformattare) quella partizione al momento della reinstallazione. È sempre caldamente consigliato fare il backup di tutti i propri dati oltre che della configurazione del sistema precedente (cioè <file>/etc/</file> e, forse, <file>/var/</file>).
ru: Если пользовательские данные (то есть <file>/home</file>) расположены на отдельном разделе, то перейти на Debian очень просто, вам нужно просто указать системе установки смонтировать (но без форматирования) этот раздел при переустановке. Не забудьте сделать резервную копию данных, а также файлов настроек предыдущей системы (то есть <file>/etc/</file> и, может быть, <file>/var/</file>).

source: Compatibility issues
it: Problemi di compatibilità
ru: Проблемы совместимости

source: On what hardware architectures/systems does &debian; run?
it: Su quali architetture o sistemi hardware funziona Debian?
ru: На каких архитектурах/системах работает &debian;?

source: &debian; includes complete source-code for all of the included programs, so it should work on all systems which are supported by the Linux kernel; see the <url id="http://en.tldp.org/FAQ/Linux-FAQ/intro.html#DOES-LINUX-RUN-ON-MY-COMPUTER" name="Linux FAQ"> for details.
it: &debian; include il codice sorgente completo per tutti i programmi inclusi, così dovrebbe funzionare su tutti i sistemi che sono supportati dal kernel Linux; si veda la <url id="http://en.tldp.org/FAQ/Linux-FAQ/intro.html#DOES-LINUX-RUN-ON-MY-COMPUTER" name="FAQ Linux"> per i dettagli.
ru: &debian; содержит исходный код всех входящих в него программ, поэтому он должен работать на всех системах, которые поддерживаются ядром Linux. Подробности см. в <url id="http://en.tldp.org/FAQ/Linux-FAQ/intro.html#DOES-LINUX-RUN-ON-MY-COMPUTER" name="Linux FAQ">.

source: The current &debian; release, &release;, contains a complete, binary distribution for the following architectures:
it: L'attuale rilascio &release; di &debian; contiene una distribuzione binaria completa per le seguenti architetture:
ru: Текущий выпуск &debian; &release; содержит двоичный код для следующих архитектур:

source: <em>amd64</em>: this covers systems based on AMD 64bit CPUs with AMD64 extension and all Intel CPUs with EM64T extension, and a common 64bit userspace.
it: <em>amd64</em>: questa copre i sistemi basati su CPU AMD a 64bit con estensione AMD64 e tutte le CPU Intel con estensione EM64T ed uno spazio utente a 64bit comune.
ru: <em>amd64</em>: системы с 64-битными процессорами AMD с расширением AMD64 и любыми процессорами Intel с расширением EM64T, и 64-битным пользовательским окружением;

source: <em>armel</em>: little-endian ARM machines.
it: <em>armel</em>: macchine ARM little-endian.
ru: <em>armel</em>: машины ARM с процессором с обратным порядком байт;

source: <em>i386</em>: this covers systems based on Intel and compatible processors, including Intel's 386, 486, Pentium, Pentium Pro, Pentium II (both Klamath and Celeron), and Pentium III, and most compatible processors by AMD, Cyrix and others.
it: <em>i386</em>: questa copre i sistemi basati su processori Intel e compatibili, inclusi gli Intel 386, 486, Pentium, Pentium Pro, Pentium II (sia Klamath che Celeron) e Pentium III e la maggior parte dei processori compatibili di AMD, Cyryx ed altri.
ru: <em>i386</em>: ПК с процессорами Intel и совместимыми с ними, включая Intel 386, 486, Pentium, Pentium Pro, Pentium II (Klamath и Celeron), Pentium III и почти все совместимые процессоры от AMD, Cyrix и другие;

source: <em>ia64</em>: Intel IA-64 ("Itanium") computers.
it: <em>ia64</em>: computer Intel IA-64 ("Itanium").
ru: <em>ia64</em>: компьютеры Intel IA-64 («Itanium»);

source: <em>mips</em>: SGI's big-endian MIPS systems, Indy and Indigo2; <em>mipsel</em>: little-endian MIPS machines, Digital DECstations.
it: <em>mips</em>: sistemi MIPS big-endian della SGI, Indy e Indigo2; <em>mipsel</em>: macchine MIPS little-endian, DECstation Digital.
ru: <em>mips</em>:MIPS системы от SGI с прямым порядком байт &mdash; Indy и Indigo2; <em>mipsel</em>: MIPS системы с обратным порядком байт &mdash; Digital DECstation;

source: <em>powerpc</em>: this covers some IBM/Motorola PowerPC machines, including the Apple Macintosh PowerMac models, and the CHRP and PReP open architecture machines.
it: <em>powerpc</em>: questa copre alcune macchine PowerPC IBM/Motorola, incluse i modelli PowerMac di Apple Macintosh e le macchine CHRP e PReP a architettura aperta.
ru: <em>powerpc</em>: некоторые машины IBM/Motorola PowerPC, включая модели PowerMac Apple Macintosh и машины с открытой архитектурой CHRP и PReP;

source: <em>s390</em>: IBM S/390 mainframe systems.
it: <em>s390</em>: sistemi mainframe IBM S/390.
ru: <em>s390</em>: мэйнфреймы IBM S/390;

source: <em>sparc</em>: this covers Sun's SPARC and most UltraSPARC systems, and some of their successors in the sun4 architectures
it: <em>sparc</em>: questa copre i sistemi SPARC della Sun, la maggior parte dei sistemi UltraSPARC e alcuni dei loro successori nell'architettura sun4.
ru: <em>sparc</em>: SPARC от Sun и большинство систем UltraSPARC, а также некоторые выросшие из них системы на базе архитектуры sun4.

source: The development of binary distributions of Debian for <em>armhf</em> (for ARM boards and devices with a floating-point unit), <em>arv32</em> (for Atmel's 32-bit RISC architecture), <em>m32</em> (for 32-bit RISC microprocessor of Renesas Technology), <em>s390x</em> (for the 64-bit userland for IBM System z mainframes), and <em>sh</em> (for Hitachi SuperH processors) is currently underway.
it: Lo sviluppo di distribuzioni binarie di Debian per architetture <em>armhf</em> (per schede ARM e dispositivi con un'unità a virgola mobile), <em>arv32</em> (per l'architettura RISC a 32 bit di Atmel), <em>m32</em> (per il microprocessore RISC a 32 bit di Renesas Technology), <em>s390x</em> (per i mainframe IBM System z a 64 bit in spazio utente) e <em>sh</em> (per i processori SuperH Hitachi) è attualmente in corso.
ru: В настоящее время ведётся разработка дистрибутивов двоичных пакетов Debian для <em>armhf</em> (платы и устройства ARM с блоком вычисления чисел с плавающей запятой), <em>arv32</em> (32-битные процессоры Atmel на основе архитектуры RISC), <em>m32</em> (32-битные процессоры Renesas Technology на основе архитектуры RISC), <em>s390x</em> (64-битное пользовательское окружение для мэйнфреймов IBM System z) и <em>sh</em> (процессоры Hitachi SuperH).
