Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: For more information, install the <package>apt</package> package and read <manref section="8" name="apt-get">, <manref section="5" name="sources.list"> and install the <package>apt-doc</package> package and read <file>/usr/share/doc/apt-doc/guide.html/index.html</file>.
it: Per maggiori informazioni, si installi il pacchetto <package>apt</package> e si leggano <manref section="8" name="apt-get">, <manref section="5" name="sources.list"> e si installi il pacchetto <package>apt-doc</package> e si legga <file>/usr/share/doc/apt-doc/guide.html/index.html</file>.
ru: Дополнительную информацию можно найти в справочных страницах <manref section="8" name="apt-get">, <manref section="5" name="sources.list"> из пакета <package>apt</package> и в файле <file>/usr/share/doc/apt-doc/guide.html/index.html</file> из пакета <package>apt-doc</package>.

source: <prgn>aptitude</prgn> is a package manager for &debian; systems that provides a frontend to the apt package management infrastructure. <prgn>aptitude</prgn> is a text-based interface using the curses library, it can be used to perform management tasks in a fast and easy way.
it: <prgn>aptitude</prgn> è un gestore di pacchetti per sistemi &debian; che fornisce un frontend per l'infrastruttura di gestione dei pacchetti apt. <prgn>aptitude</prgn> è un'interfaccia testuale che usa la libreria curses; può essere usata per effettuare compiti di gestione in modo facile e veloce.
ru: <prgn>aptitude</prgn> &mdash; это пакетный менеджер для систем &debian;, предоставляет пользовательский интерфейс к инфраструктуре управления пакетами apt. <prgn>aptitude</prgn> имеет текстовый интерфейс, написанный с использованием библиотеки curses, позволяет удобно и быстро выполнять задачи управления пакетами.

source: <prgn>aptitude</prgn> provides the functionality of <prgn>dselect</prgn> and <prgn>apt-get</prgn>, as well as many additional features not found in either program:
it: <prgn>aptitude</prgn> fornisce le funzionalità di <prgn>dselect</prgn> e <prgn>apt-get</prgn>, oltre a molte funzionalità aggiuntive che non si trovano in nessuno degli altri due programmi:
ru: <prgn>aptitude</prgn> предоставляет функции <prgn>dselect</prgn> и <prgn>apt-get</prgn>, а также много других дополнительных возможностей, которых нет ни в одной из этих программ:

source: <prgn>aptitude</prgn> offers easy access to all versions of a package.
it: <prgn>aptitude</prgn> offre un facile accesso a tutte le versioni di un pacchetto;
ru: Обеспечивает лёгкий доступ ко всем версиям пакета.

source: <prgn>aptitude</prgn> makes it easy to keep track of obsolete software by listing it under "Obsolete and Locally Created Packages".
it: <prgn>aptitude</prgn> rende facile tenere traccia del software obsoleto elencandolo in "Pacchetti obsoleti e creati localmente";
ru: Позволяет легко отслеживать устаревшее ПО, занося его в «список устаревших и пакетов, созданных локально».

source: <prgn>aptitude</prgn> includes a fairly powerful system for searching particular packages and limiting the package display. Users familiar with <prgn>mutt</prgn> will pick up quickly, as <prgn>mutt</prgn> was the inspiration for the expression syntax.
it: <prgn>aptitude</prgn> include un sistema piuttosto potente per cercare particolari pacchetti e limitare i pacchetti visualizzati. Gli utenti che hanno familiarità con <prgn>mutt</prgn> impareranno presto ad usarlo, dato che la sintassi per le espressioni regolari è stata ispirata da quella di <prgn>mutt</prgn>.
ru: Включает достаточно мощную систему поиска и ограничения отображаемых пакетов. Пользователи, знакомые с <prgn>mutt</prgn>, быстро освоятся, так как используется очень похожий синтаксис регулярных выражений

source: <prgn>aptitude</prgn> can be used to install the predefined tasks available. For more information see <ref id="tasksel">.
it: <prgn>aptitude</prgn> può essere usato per installare le attività predefinite disponibili. Per maggiori informazioni si veda <ref id="tasksel">.
ru: Можно использовать для установки заранее сформированных задач. Подробней смотрите <ref id="tasksel">.

source: <prgn>aptitude</prgn> in full screen mode has <prgn>su</prgn> functionality embedded and can be run by a normal user. It will call <prgn>su</prgn> (and ask for the root password, if any) when you really need administrative privileges
it: <prgn>aptitude</prgn> in modalità a schermo intero ha una funzionalità <prgn>su</prgn> incorporata e può essere eseguito da un utente normale. Richiama <prgn>su</prgn> (e chiederà la password di root, se esiste) quando sono veramente necessari i privilegi di amministrazione.
ru: Поддерживает возможности команды <prgn>su</prgn> в полноэкранном режиме и может запускаться от обычного пользователя. Будет вызвана <prgn>su</prgn> (и запрошен пароль суперпользователя, если нужно), когда действительно потребуются администраторские права

source: You can use <prgn>aptitude</prgn> through a visual interface (simply run <tt>aptitude</tt>) or directly from the command line. The command line syntax used is very similar to the one used in <prgn>apt-get</prgn>. For example, to install the <var>foo</var> package, you can run <tt>aptitude install <var>foo</var></tt>.
it: Si può usare <prgn>aptitude</prgn> attraverso un'interfaccia visiva (si esegua semplicemente <tt>aptitude</tt>) o direttamente dalla riga di comando. La sintassi usata per la riga di comando è molto simile a quella usata con <prgn>apt-get</prgn>. Per esempio, per installare il pacchetto <var>pippo</var>, si può eseguire <tt>aptitude install <var>pippo</var></tt>.
ru: Вы можете работать с <prgn>aptitude</prgn> через визуальный интерфейс (просто запустите <tt>aptitude</tt>) или непосредственно из командной строки. Используемый синтаксис командной строки очень похож на синтаксис <prgn>apt-get</prgn>. Например, чтобы установить пакет <var>foo</var>, вы можете выполнить <tt>aptitude install <var>foo</var></tt>.

source: Note that <prgn>aptitude</prgn> is the preferred program for daily package management from console.
it: Si noti che <prgn>aptitude</prgn> è il programma consigliato per la gestione quotidiana dei pacchetti dalla console.
ru: Заметим, что <prgn>aptitude</prgn> является предпочтительной программой для ежедневного управления пакетами из консоли.

source: For more informations, read the manual page <manref section="8" name="aptitude"> and install the <package>aptitude-doc</package> package.
it: Per maggiori informazioni, si legga la pagina di manuale <manref section="8" name="aptitude"> e si installi il pacchetto <package>aptitude-doc</package>.
ru: Подробная информация дана в справочной странице <manref section="8" name="aptitude"> и в пакете <package>aptitude-doc</package>.

source: <prgn>synaptic</prgn> is a graphical package manager. It enables you to install, upgrade and remove software packages in a user friendly way. Next to all features offered by aptitude, it also has a feature for editing the list of used repositories, and supports browsing all available documentation related to a package. See the <url id="http://www.nongnu.org/synaptic/" name="Synaptic Website"> for more information.
it: <prgn>synaptic</prgn> è un gestore di pacchetti grafico. Permette di installare, aggiornare e rimuovere pacchetti software in modo amichevole. Oltre a tutte le funzionalità offerte da aptitude, ha anche una funzionalità per modificare l'elenco dei repository usati e supporta la navigazione di tutta la documentazione disponibile relativa ad un pacchetto. Si veda il <url id="http://www.nongnu.org/synaptic/" name="sito web di synaptic"> per maggiori informazioni.
ru: <prgn>synaptic</prgn> &mdash; это менеджер пакетов с графическим интерфейсом. Он позволяет устанавливать, обновлять и удалять пакеты ПО через дружественный интерфейс. Помимо всех возможностей aptitude, также он позволяет редактировать список используемых репозиториев, и поддерживает обзор всей доступной документации по пакету. Подробней см. на <url id="http://www.nongnu.org/synaptic/" name="веб-сайте Synaptic">.

source: When you want to perform a specific task it might be difficult to find the appropiate suite of packages that fill your need. The Debian developers have defined <tt>tasks</tt>, a task is a collection of several individual Debian packages all related to a specific activity. Tasks can be installed through the <prgn>tasksel</prgn> program or through <prgn>aptitude</prgn>.
it: Quando si desidera fare una specifica attività può essere difficile trovare l'insieme appropriato di pacchetti che soddisfano le proprie necessità. Gli sviluppatori Debian hanno definito delle <tt>attività</tt> (task): un'attività è una raccolta di diversi pacchetti Debian individuali tutti relativi ad una specifica attività. Le attività possono essere installate tramite il programma <prgn>tasksel</prgn> o con <prgn>aptitude</prgn>.
ru: Когда нужно выполнить определённую задачу, иногда бывает трудно найти подходящий комплект пакетов. Разработчики Debian создали комплекты по <tt>задачам</tt>; задача &mdash; набор из нескольких пакетов Debian, которые помогают достичь определённой цели. Задачи могут быть установлены с помощью программы <prgn>tasksel</prgn> или <prgn>aptitude</prgn>.

source: The Debian installer will typically install automaticaly the task associated with a standard system and a desktop environment. The specific desktop environment installed will depend on the CD/DVD media used, most commonly it will be the GNOME desktop (<tt>gnome-desktop</tt> task). Also, depending on your selections throughout the installation process, tasks might be automatically installed in your system. For example, if you selected a language, the task associated with it will be installed automatically too and if you are running in a laptop system the installer recognises the <tt>laptop</tt> task will be installed too.
it: L'installatore Debian tipicamente installa automaticamente le attività associate con un sistema standard ed un ambiente desktop. L'ambiente desktop specifico installato dipende dal supporto CD/DVD usato, solitamente è il desktop GNOME (attività <tt>gnome-desktop</tt>). Inoltre, a seconda delle selezioni dell'utente durante il processo di installazione, possono essere installate automaticamente delle attività. Per esempio, se si è selezionata una lingua, anche l'attività associata viene automaticamente installata sul sistema e se si usa un sistema laptop riconosciuto dall'installatore viene installata anche l'attività <tt>laptop</tt>.
ru: Программа установки Debian обычно автоматически устанавливает задачу создания стандартной системы и окружения рабочего стола. Тип устанавливаемого окружения рабочего стола зависит от используемого носителя CD/DVD, как правило это рабочий стол GNOME (задача <tt>gnome-desktop</tt>). Также, в зависимости от ваших ответов во время установки, могут быть автоматически установлены другие задачи. Например, если вы выбрали язык, то также автоматически будет установлена задача, связанная с ним, и если программа установки обнаруживает, что установка происходит на переносном компьютере, то также автоматически будет установлена задача <tt>для ноутбука</tt>.

source: Other package management tools
it: Altri strumenti per la gestione dei pacchetti
ru: Другие инструменты управления пакетами

source: This program is a menu-driven interface to the Debian package management system. For woody and earlier releases, this was the main package management interface for for first-time installations, but currently users are encouraged to use <prgn>aptitude</prgn> instead. Some users might feel more comfortable using <prgn>aptitude</prgn> and it is also recommended over <prgn>dselect</prgn> for large-scale upgrades. For more information on <prgn>aptitude</prgn> please see <ref id="aptitude">.
it: Questo programma è un'interfaccia a menu per il sistema di gestione dei pacchetti Debian. Per Woody e rilasci precedenti, era l'interfaccia principale di gestione dei pacchetti per l'installazione iniziale, ma attualmente gli utenti sono incoraggiati ad usare invece <prgn>aptitude</prgn>. Alcuni utenti possono sentirsi più a loro agio usando <prgn>aptitude</prgn> che è anche raccomandato al posto di <prgn>dselect</prgn> per aggiornamenti su larga scala. Per maggiori informazioni su <prgn>aptitude</prgn> si veda <ref id="aptitude">.
ru: Данная программа предоставляет меню-ориентированный интерфейс к системе управления пакетами Debian. Для woody и более ранних выпусков она была основным интерфейсом управления для новых установок, но сейчас пользователям вместо неё предлагается использовать <prgn>aptitude</prgn>. Некоторые пользователи чувствуют большее удобство в работе, когда используют <prgn>aptitude</prgn>, а также это рекомендованная замена <prgn>dselect</prgn> при масштабных обновлениях. Подробней о <prgn>aptitude</prgn> см. <ref id="aptitude">.

source: <prgn>dselect</prgn> can:
it: <prgn>dselect</prgn> può:
ru: Основные возможности <prgn>dselect</prgn>:

source: guide the user as he/she chooses among packages to install or remove, ensuring that no packages are installed that conflict with one another, and that all packages required to make each package work properly are installed;
it: guidare l'utente nella scelta dei pacchetti da installare o rimuovere, assicurandosi che non vengano installati pacchetti in conflitto unon con l'altro e che vengano installati tutti i pacchetti necessari per far funzionare ciascun pacchetto in modo corretto;
ru: Помогает пользователю выбрать пакеты для удаления или установки, проверяет, что устанавливаемые пакеты не конфликтуют с другими, и что установятся все необходимые по зависимостям пакеты

source: warn the user about inconsistencies or incompatibilities in their selections;
it: avvisare l'utente delle incoerenze o incompatibilità nelle proprie selezioni;
ru: Предупреждает пользователя о несогласованности или несовместимости их выбора

source: determine the order in which the packages must be installed;
it: determinare l'ordine nel quale i pacchetti devono essere installati;
ru: Определяет порядок, в котором пакеты должны устанавливаться

source: automatically perform the installation or removal; and
it: effettuare automaticamente l'installazione o la rimozione e
ru: Автоматически выполняет установку или удаление

source: guide the user through whatever configuration process are required for each package.
it: guidare l'utente attraverso qualsiasi processo di configurazione richiesto da ciascun pacchetto.
ru: Помогает пользователю пройти через все процессы настройки, требуемые каждым пакетом

source: <prgn>dselect</prgn> begins by presenting the user with a menu of 7 items, each of which is a specific action. The user can select one of the actions by using the arrow keys to move the highlighter bar, then pressing the <em>&lt;enter&gt;</em> key to select the highlighted action.
it: <prgn>dselect</prgn> presenta inizialmente un menu di 7 voci, ognuna delle quali rappresenta una specifica azione. L'utente può selezionare una delle azioni usando i tasti freccia per muovere la barra di evidenziazione e premendo poi il tasto <em>&lt;Invio&gt;</em> per selezionare l'azione evidenziata.
ru: После запуска <prgn>dselect</prgn> показывает пользователю меню из 7 пунктов, каждый из которых выполняет определённое действие. Пользователь может выбрать одно из действий, перемещая с помощью клавиш со стрелками полосу подсветки, а затем нажав клавишу <em>&lt;enter&gt;</em> для выбора выделенного действия.

source: What the user sees next depends on the action he selected. If he selects any option but <tt>Access</tt> or <tt>Select</tt>, then <prgn>dselect</prgn> will simply proceed to execute the specified action: e.g., if the user selected the action <tt>Remove</tt>, then dselect would proceed to remove all of the files selected for removal when the user last chose the <tt>Select</tt> action.
it: Cosa vede l'utente dopo dipende dall'azione che ha selezionato. Se ha selezionato qualsiasi opzione tranne <tt>Metodo</tt> (Access) e <tt>Seleziona</tt> (Select), allora <prgn>dselect</prgn> procederà semplicemente nell'esecuzione dell'azione specificata: per esempio, se l'utente ha selezionato l'azione <tt>Rimuovi</tt> (Remove), allora dselect procederà nella rimozione di tutti i file selezionati per la rimozione l'ultima volta che l'utente ha usato l'azione <tt>Seleziona</tt>.
ru: Что пользователь увидит далее, зависит от выбранного действия. Если он выбрал какое-то действие, но не <tt>Метод (Access)</tt> или <tt>Выбрать (Select)</tt>, то <prgn>dselect</prgn> просто продолжит выполнение указанного действия. Например, если пользователь выбрал действие <tt>Удалить (Remove)</tt>, то dselect выполнит удаление всех файлов, помеченных на удаление пользователем, которые он выбрал в меню <tt>Выбрать (Select)</tt> ранее.

source: Both the <tt>Access</tt> menu item and the <tt>Select</tt> menu item lead to additional menus. In both cases, the menus are presented as split screens; the top screen gives a scrollable list of choices, while the bottom screen gives a brief explanation ("info") for each choice.
it: Sia la voce di menu <tt>Metodo</tt> che la voce di menu <tt>Seleziona</tt> portano a menu aggiuntivi. In entrambi i casi, i menu vengono presentati come schermate divise; la schermata superiore fornisce un elenco di scelte che è possibile scorrere, mentre la schermata inferiore fornisce una breve spiegazione ("info") per ogni scelta.
ru: Пункты меню <tt>Метод (Access)</tt> и <tt>Выбрать (Select)</tt> позволяют войти в дополнительные меню. В обоих случаях, меню представляют собой экран, разделённый надвое; в верхней части представлен список выбираемых пунктов, в нижней части выводится описание («справка») по каждому пункту.

source: Extensive on-line help is available, use the '?' key to get to a help screen at any time.
it: È disponibile un aiuto esaustivo in linea: si usi il tasto "?" per avere una schermata d'aiuto in qualsiasi momento.
ru: Доступна подробная справка; к ней можно обратиться в любой момент, нажав клавишу «?».

source: The order in which the actions are presented in the first <prgn>dselect</prgn> menu represents the order in which a user would normally choose <prgn>dselect</prgn> to install packages. However, a user can pick any of the main menu choices as often as needed (including not at all, depending on what one wants to do).
it: L'ordine nel quale le azioni sono presentate nel primo menu di <prgn>dselect</prgn> rappresenta l'ordine che un utente sceglierebbe normalmente per far installare pacchetti a <prgn>dselect</prgn>. Comunque, un utente può selezionare qualsiasi voce del menu principale quanto spesso vuole (anche non tutte, a seconda di cosa vuole fare).
ru: Порядок, в котором в первом меню <prgn>dselect</prgn> представлены действия, соответствует порядку, в котором пользователь обычно выполняет действия в <prgn>dselect</prgn> для установки пакетов. Однако пользователь может выбирать любое действие из главного меню как угодно часто (или совсем не выбирать &mdash; в зависимости от того, что он хочет сделать).

source: Begin by choosing an <strong>Access Method</strong>. This is the method by which the user plans on accessing Debian packages; e.g., some users have Debian packages available on CD-ROM, while others plan to fetch them using anonymous FTP. The selected "Access Method" is stored after <prgn>dselect</prgn> exits, so if it does not change, then this option need not be invoked again.
it: Si inizi scegliendo un <strong>Metodo d'accesso</strong>. Questo è il metodo con cui un utente ha intenzione di accedere ai pacchetti Debian; per esempio, alcuni utenti hanno pacchetti Debian disponibili su CD-ROM, mentre altri intendono scaricarli usando FTP anonimo. Il "Metodo d'accesso" selezionato viene memorizzato all'uscita da <prgn>dselect</prgn>, così, se non cambia, questa opzione non necessita di essere richiamata nuovamente.
ru: Начните с выбора <strong>метода доступа (Access Method)</strong>. Здесь выбирается способ, с помощью которого пользователь получает доступ к пакетам Debian; например, у некоторых есть компакт-диски с пакетами Debian, другие же скачивают эти пакеты по FTP. Выбранный «метод доступа» сохраняется после выхода из <prgn>dselect</prgn>, поэтому, если он не изменился, то нет необходимости вызывать этот пункт меню каждый раз.

source: Then <strong>Update</strong> the list of available packages. To do this, <prgn>dselect</prgn> reads the file "Packages.gz" which should be included in the top level of the directory where the Debian packages to be installed are stored. (But if it is not there, <prgn>dselect</prgn> will offer to make it for you.)
it: Si aggiorni poi con <strong>Aggiorna</strong> (Update) l'elenco dei pacchetti disponibili. Per fare questo, <prgn>dselect</prgn> legge il file "Packages.gz" che dovrebbe essere incluso nel livello più alto della directory dove sono archiviati i pacchetti Debian da installare. (Ma se non è là, <prgn>dselect</prgn> si offre di crearlo.)
ru: Затем <strong>обновите (Update)</strong> список доступных пакетов. Для этого <prgn>dselect</prgn> читает файл «Packages.gz», который находится в верхнем уровне дерева каталогов, в котором хранятся пакеты Debian (если его там нет, <prgn>dselect</prgn> предложит его создать).

source: <strong>Select</strong> specific packages for installation on his system. After choosing this menu item, the user is first presented with a full screen of help (unless the `--expert' command line option was used). Once the user exits the Help screen, he sees the split-screen menu for choosing packages to install (or remove).
it: Si selezionino con <strong>Seleziona</strong> i pacchetti specifici da installare sul proprio sistema. Dopo aver scelto questa voce di menu, all'utente viene prima presentata una schermata completa di aiuto (a meno che non sia stata usata l'opzione da riga di comando "--expert"). Una volta che l'utente esce dalla schermata di aiuto, vede il menu a schermata divisa per la scelta dei pacchetti da installare (o rimuovere).
ru: <strong>Выберите (Select)</strong> нужные пакеты для установки в систему. После выбора данного пункта меню, пользователю показывается экран помощи (если в командной строке не указан параметр «--expert»). После выхода из экрана помощи, будет показано разделённое меню для выбора устанавливаемых пакетов (или удаляемых).

source: The top part of the screen is a relatively narrow window into the list of Debian's &all-pkgs; packages; the bottom part of the screen contains description of the package or group of packages which are highlighted above.
it: La parte superiore della schermata è una finestra relativamente stretta sull'elenco dei &all-pkgs; pacchetti Debian; la parte inferiore della schermata contiene una descrizione del pacchetto o del gruppo di pacchetti evidenziati nella parte superiore.
ru: Верхняя часть экрана представляет собой относительно узкое окно со списком &all-pkgs; пакетов Debian; нижняя часть экрана содержит описание пакета или группы пакетов, которая выделена выше.

source: One can specify which packages should be operated on by highlighting a package name or the label for a group of packages. After that, you can select packages:
it: Si può specificare su quali pacchetti si debba operare evidenziando un nome di pacchetto o un'etichetta di un gruppo di pacchetti. Dopo di ciò, si possono selezionare i pacchetti:
ru: Для указания пакета или группы, над которым будет совершаться операция, следует навести подсветку на название пакета или метку группы. После этого можно выбрать требуемую операцию;

source: to be installed:
it: Da installare:
ru: Для установки:

source: This is accomplished by pressing the `+' key.
it: questo viene fatto premendo il tasto "+".
ru: Нажмите клавишу «+».

source: to be deleted:
it: Da cancellare:
ru: Для удаления:
