Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: Yes. Apart from CD or DVD, you can install Debian GNU/Linux by booting from floppy disks, USB memory stick, directly from hard disk, or using TFTP net booting. For installing on multiple computers it's possible to do fully automatic installations. NB: not all methods are supported by all computer architectures. Once the installer has booted, the rest of the system can be downloaded over the network, or installed from local media. See the <url id="http://www.debian.org/releases/stable/installmanual" name="Debian GNU/Linux Installation Guide"> for more information.
it: Sì. Oltre che da CD o DVD, si può installare Debian GNU/Linux avviando da dischetti floppy, penne USB, direttamente da hard disk o usando l'avvio di rete TFTP. Per l'installazione su più computer è possibile fare installazioni completamente automatiche. N.B.: non tutti i metodi sono supportati da tutte le architetture. Una volta avviato l'installatore, il resto del sistema può essere scaricato dalla rete o installato da supporti locali. Per maggiori informazioni si veda la <url id="http://www.debian.org/releases/stable/installmanual" name="Guida all'installazione di Debian GNU/Linux">.
ru: Да. Помимо CD или DVD, Debian GNU/Linux можно установить, загрузившись с дискет, USB-накопителя, прямо с жёсткого диска, или используя TFTP &mdash; протокол загрузки по сети. Установка на несколько компьютеров может быть полностью автоматизирована. Замечание: не на всех компьютерных архитектурах поддерживаются все эти методы установки. После того как программа установки запустится, оставшуюся часть системы можно скачать из сети, или загрузить с локальных носителей. Подробней об этом читайте в <url id="http://www.debian.org/releases/stable/installmanual" name="руководстве по установке Debian GNU/Linux">.

source: Choosing a Debian distribution
it: Scegliere una distribuzione Debian
ru: Выбор дистрибутива Debian

source: There are many different Debian distributions. Choosing the proper Debian distribution is an important decision. This section covers some information useful for users that want to make the choice best suited for their system and also answers possible questions that might be arising during the process. It does not deal with "why you should choose Debian" but rather "which distribution of Debian".
it: Ci sono molte diverse distribuzioni Debian. Scegliere la distribuzione Debian adatta è una decisione importante. Questa sezione fornisce alcune informazioni utili per gli utenti che desiderano fare la scelta più adatta per il loro sistema e inoltre risponde ad alcune possibili domande che potrebbero nascere al momento della scelta. Non parla del "perché si dovrebbe scegliere Debian" ma piuttosto di "quale distribuzione di Debian scegliere".
ru: Существует несколько различных дистрибутивов Debian. И очень важно сделать правильный выбор. В этой главе приводится информация, полезная для тех пользователей, которые хотят выбрать дистрибутив, наиболее подходящий для своей системы, а также рассматриваются ответы на вопросы, которые могут возникнуть в этом случае. Здесь речь идёт не о том, «почему лучше выбрать Debian», а о том, «какой из дистрибутивов Debian больше вам подходит».

source: For more information on the available distributions read <ref id="dists">.
it: Per maggiori informazioni sulle distribuzioni disponibili si veda <ref id="dists">.
ru: Подробней о доступных дистрибутивах смотрите <ref id="dists">.

source: Which Debian distribution (stable/testing/unstable) is better for me?
it: Quale distribuzione Debian (stable/testing/unstable) è meglio per me?
ru: Какой дистрибутив Debian (стабильный/тестируемый/нестабильный) лучше всего мне подойдёт?

source: The answer is a bit complicated. It really depends on what you intend to do. One solution would be to ask a friend who runs Debian. But that does not mean that you cannot make an independent decision. In fact, you should be able to decide once you complete reading this chapter.
it: La risposta è piuttosto complessa. Dipende veramente da cosa si ha in mente di fare. Una soluzione potrebbe essere chiedere ad un amico che usa Debian. Ma ciò non significa che non è possibile prendere una decisione in modo autonomo. Di fatto, si dovrebbe essere in grado di fare una scelta una volta completata la lettura di questo capitolo.
ru: Ответить на этот вопрос не так-то просто. На самом деле это зависит от того, для чего он вам нужен. Лучше всего было бы спросить друга, который уже знаком с Debian. Но это не значит, что решение нельзя принять самостоятельно. Фактически, вы сможете принять решение после прочтения этой главы.

source: If security or stability are at all important for you: install stable. period. This is the most preferred way.
it: Se la sicurezza o la stabilità sono aspetti di una qualche importanza: installare stable. Punto. Questa è la scelta consigliata.
ru: Если для вас очень важна безопасность или стабильность &mdash; устанавливайте стабильный. Точка. Это самый лучший вариант достичь желаемого.

source: If you are a new user installing to a desktop machine, start with stable. Some of the software is quite old, but it's the least buggy environment to work in. You can easily switch to the more modern unstable once you are a little more confident.
it: Se si è un nuovo utente che deve installare su una macchina desktop, iniziare con stable. Parte del software è piuttosto vecchio, ma è l'ambiente di lavoro con meno bug. Si potrà facilmente passare alla più moderna unstable una volta che si è più sicuri di sé.
ru: Если вы новичок, и подбираете дистрибутив для настольного компьютера, &mdash; начните со стабильного. Некоторые программы в нём довольно сильно устарели, но зато вы получите рабочее окружение, наименее подверженное ошибкам. Вы сможете легко переключиться на нестабильный, как только почувствуете себя немного увереннее.

source: If you are a desktop user with some experience in Linux and does not mind facing the odd bug now and then, use unstable. It has all the latest and greatest software, and bugs are usually fixed swiftly.
it: Se si è un utente desktop con un po' di esperienza in Linux e che non ha problemi ad affrontare un bug sporadico una volta ogni tanto, usare unstable. Ha tutto il software più recente e all'avanguardia ed i bug sono solitamente risolti prontamente.
ru: Если у вас есть некоторый опыт работы в Linux, и вас мало волнуют то и дело возникающие ошибки, &mdash; ставьте нестабильный. В нём есть всевозможные наиновейшие и наилучшие программы, а ошибки обычно быстро исправляются.

source: If you are running a server, especially one that has strong stability requirements or is exposed to the Internet, install stable. This is by far the strongest and safest choice.
it: Se si gestisce un server, specialmente uno per cui la stabilità è un requisito importante o che è esposto ad Internet, installare stable. Questa è di gran lunga la scelta più sicura e affidabile.
ru: Если вы настраиваете сервер, особенно такой, требования к стабильности которого довольно серьёзны, или если он доступен из сети Интернет, то устанавливайте стабильный. Это, безусловно, самый правильный и безопасный выбор.

source: The following questions (hopefully) provide more detail on these choices. After reading this whole FAQ, if you still could not make a decision, stick with the stable distribution.
it: Le domande che seguono forniscono, si spera, ulteriori dettagli su queste scelte. Dopo aver letto tutte queste FAQ, se ancora non si è in grado di prendere una decisione, optare per la distribuzione stable.
ru: Надеемся, что ответы на дальнейшие вопросы больше прояснят ситуацию. Если после прочтения всех ЧаВо вам всё ещё трудно принять решение, остановитесь на стабильном дистрибутиве.

source: You asked me to install stable, but in stable so and so hardware is not detected/working. What should I do?
it: È stato suggerito di installare stable, ma in essa l'hardware pincopallino non viene rilevato o non funziona. Cosa fare?
ru: Вы предлагаете установить стабильный дистрибутив, но при его использовании не обнаруживается или не работает такое-то аппаратное обеспечение. Что делать?

source: Try to search the web using a search engine and see if someone else is able to get it working in stable. Most of the hardware should work fine with stable. But if you have some state-of-the-art, cutting edge hardware, it might not work with stable. If this is the case, you might want to install/upgrade to unstable.
it: Provare a cercare nel web usando un motore di ricerca e vedere se qualcun altro è stato in grado di farlo funzionare in stable. La maggior parte dell'hardware dovrebbe funzionare senza problemi in stable. Se però si ha dell'hardware recentissimo e all'avanguardia, questo potrebbe non funzionare con stable. Se questa è la situazione, si può installare unstable o aggiornare il sistema ad essa.
ru: Попробуйте поискать в каком-нибудь поисковике в Интернет, может быть кто-то заставил работать это аппаратное обеспечение в стабильном дистрибутиве. Большинство аппаратуры будет работать. Но если у вас современные, самые последние модели аппаратуры, они могут и не заработать. В этом случае вам может потребоваться установка/обновление до нестабильного дистрибутива.

source: For laptops, <url id="http://www.linux-on-laptops.com/"> is a very good website to see if someone else is able to get it to work under Linux. The website is not specific to Debian, but is nevertheless a tremendous resource. I am not aware of any such website for desktops.
it: Per i portatili, <url id="http://www.linux-on-laptops.com/"> è un sito web molto buono per vedere se qualcun altro è stato in grado di farli funzionare con Linux. Il sito non è specifico per Debian, ma ciò nonostante è una risorsa preziosissima. Non conosco un sito web simile per i desktop.
ru: Список работающих в Linux ноутбуков можно найти на <url id="http://www.linux-on-laptops.com/" name="этом"> замечательном сайте. Там не описывается работоспособность именно в Debian, но это потрясающий ресурс. Для настольных компьютеров такого сайта не найти.

source: Another option would be to ask in the debian-user mailing list by sending an email to debian-user@lists.debian.org . Messages can be posted to the list even without subscribing. The archives can be read through <url id="http://lists.debian.org/debian-user/"> Information regarding subscribing to the list can be found at the location of archives. You are strongly encourage to post your questions on the mailing-list than on <url id="http://www.debian.org/support" name="irc">. The mailing-list messages are archived, so solution to your problem can help others with the same issue.
it: Un'altra opzione sarebbe chiedere nella mailing list debian-user inviando un messaggio di posta elettronica a debian-user@lists.debian.org . È possibile inviare messaggi alla lista anche senza essere iscritti. Gli archivi possono essere letti via <url id="http://lists.debian.org/debian-user/">. Informazioni relative all'iscrizione alla lista sono reperibili all'indirizzo degli archivi. È caldamente consigliato porre le proprie domande sulla mailing-list piuttosto che su <url id="http://www.debian.org/support" name="IRC">; i messaggi della mailing-list sono archiviati perciò la soluzione ai propri problemi potrà aiutare altri nella stessa situazione.
ru: Ещё один вариант &mdash; спросить в списке рассылки debian-user, отправив письмо на адрес debian-user@lists.debian.org. Сообщения в список рассылки можно отправлять, не подписываясь на него. Архивы списка рассылки можно посмотреть <url id="http://lists.debian.org/debian-user/" name="здесь">. Инструкция о том, как подписаться на список рассылки, находится там же. С вопросами лучше всего обращаться именно в список, а не в <url id="http://www.debian.org/support" name="IRC">. Сообщения списка рассылки архивируются, поэтому решение вашего вопроса может помочь и другим пользователям с такими же проблемами.

source: Will there be different versions of packages in different distributions?
it: Nelle differenti distribuzioni ci sono versioni diverse dei pacchetti?
ru: Есть ли разница между версиями пакетов в различных дистрибутивах?

source: Yes. Unstable has the most recent (latest) versions. But the packages in unstable are not well tested and might have bugs.
it: Sì. Unstable ha le versioni più recenti, ma i suoi pacchetti non sono ben testati e potrebbero avere dei bug.
ru: Да. В нестабильном дистрибутиве находятся самые новые (последние) версии. Но пакеты в нём недостаточно хорошо протестированы и могут содержать ошибки.

source: On the other hand, stable contains old versions of packages. But this package is well tested and is less likely to have any bugs.
it: D'altro canto, stable contiene versioni vecchie dei pacchetti, ma esse sono ben testate ed è meno probabile che abbiano un qualche bug.
ru: С другой стороны, стабильный дистрибутив содержит старые версии пакетов. Но пакеты в нём были хорошо протестированы и, по всей вероятности, не содержат неизвестных ошибок.

source: The packages in testing fall between these two extremes.
it: I pacchetti in testing sono una via di mezzo tra questi due estremi.
ru: Пакеты в тестируемом дистрибутиве &mdash; что-то среднее между двумя этими крайностями.

source: The stable distributions really contains outdated packages. Just look at Kde, Gnome, Xorg or even the kernel. They are very old. Why is it so?
it: Le distribuzioni stable contengono pacchetti veramente datati. Basta guardare Kde, Gnome, Xorg o persino il kernel: sono molto vecchi. Perché?
ru: В стабильных дистрибутивах содержатся устаревшие версии программ. Только взгляните на Kde, Gnome, Xorg или даже ядро. Они очень старые. Почему?

source: Well, you might be correct. The age of the packages at stable depends on when the last release was made. Since there is typically over 1 year between releases you might find that stable contains old versions of packages. However, they have been tested in and out. One can confidently say that the packages do not have any known severe bugs, security holes etc., in them. The packages in stable integrate seamlessly with other stable packages. These characteristics are very important for production servers which have to work 24 hours a day, 7 days a week.
it: Beh, questo può essere vero. L'età dei pacchetti in stable dipende da quando è stato fatto l'ultimo rilascio. Dato che di solito trascorre più di 1 anno da un rilascio all'altro, stable potrebbe contenere versioni vecchie dei pacchetti. Tuttavia sono state testate per diritto e per rovescio. Si può dire a ragion veduta che i pacchetti non hanno alcun bug importante noto, falle di sicurezza, ecc. I pacchetti in stable si integrano perfettamente gli uni con gli altri. Queste caratteristiche sono molto importanti per server di produzione che devono essere in funzione 24 ore al giorno, 7 giorni alla settimana.
ru: Да, в общем вы правы. Возраст пакетов в стабильном дистрибутиве зависит от времени выпуска. Так как, обычно, между выпусками проходит больше года, отсюда и получаются старые версии пакетов. Однако, они были хорошо протестированы на момент выпуска и работают даже сейчас. Можно уверенно сказать, что в пакетах нет неизвестных серьёзных ошибок, проблем с безопасностью и т.д. Пакеты в стабильном дистрибутиве очень тесно подогнаны друг к другу. Все перечисленные плюсы очень важны для рабочих серверов, которые функционируют 24 часа в день, 7 дней в неделю.

source: On the other hand, packages in testing or unstable can have hidden bugs, security holes etc., Moreover, some packages in testing and unstable might not be working as intended. Usually people working on a single desktop prefer having the latest and most modern set of packages. Unstable is the solution for this group of people.
it: I pacchetti in testing o unstable, d'altra parte, possono avere bug nascosti, falle di sicurezza, ecc. Inoltre alcuni pacchetti in testing e unstable potrebbero non funzionare come atteso. Di solito le persone che lavorano su una singola macchina desktop preferiscono avere l'insieme di pacchetti più recente e moderno. Unstable è la soluzione adatta per loro.
ru: С другой стороны, в пакетах тестируемого и нестабильного дистрибутивов могут быть скрытые ошибки, проблемы с безопасностью и т.д. Кроме того, некоторые пакеты могут работать не так, как предполагалось. Обычно люди, работающие за обычным настольным компьютером, предпочитают использовать самые новые версии пакетов. Нестабильный дистрибутив &mdash; это то, что им нужно.

source: As you can see, stability and novelty are two opposing ends of the spectrum. If stability is required: install stable distribution. If you want to work with the latest packages, then install unstable.
it: Come si può vedere, la stabilità e l'estrema modernità sono ai capi opposti dello spettro. Se è necessaria la stabilità, installare la distribuzione stable. Se si vuole lavorare con i pacchetti più recenti, allora installare unstable.
ru: Как видите, стабильность и новизна находятся на разных концах спектра. Если нужна стабильность, устанавливайте стабильный дистрибутив. Если хотите работать с самыми новыми версиями пакетов, ставьте нестабильный.

source: If I were to decide to change to another distribution, Can I do that?
it: Se si decidesse di passare ad un'altra distribuzione, sarebbe possibile farlo?
ru: Возможно ли позже перейти на другой дистрибутив и как это сделать?

source: Yes, but it is a one way process. You can go from stable --&gt; testing --&gt; unstable. But the reverse direction is not "possible". So better be sure if you are planning to install/upgrade to unstable.
it: Sì, ma è un processo unidirezionale. Si può fare il passaggio stable --&gt; testing --&gt; unstable. La direzione inversa invece non è "possibile". Perciò è bene essere sicuri se si ha intenzione di installare unstable o di aggiornare il sistema ad essa.
ru: Да, но это односторонний процесс. Вы можете перейти со стабильного на тестируемый, а затем на нестабильный. Но обратно вернуться невозможно. Лучше дважды подумать, прежде чем устанавливать/переходить на нестабильный дистрибутив.

source: Actually, if you are an expert and if you are willing to spend some time and if you are real careful and if you know what you are doing, then it might be possible to go from unstable to testing and then to stable. The installer scripts are not designed to do that. So in the process, your configuration files might be lost and....
it: In realtà, se si è esperti, si è disposti a spenderci del tempo, si è molto cauti e si sa quello che si sta facendo, allora potrebbe essere possibile passare da unstable a testing e successivamente a stable. Gli script di installazione non sono pensati per fare questo; perciò, nel farlo, i propri file di configurazione potrebbero andar perduti e...
ru: На самом деле, если вы опытный пользователь, и у вас есть немного времени, и если вы действительно осторожны, и если вы знаете что делаете, то может быть получится перейти обратно на тестируемый дистрибутив, а потом и на стабильный. Но сценарии программы установки на это не рассчитаны. Так что в процессе некоторые файлы настроек можно потерять …

source: Could you tell me whether to install testing or unstable?
it: Potete dirmi se installare testing o unstable?
ru: Что выбрать &mdash; тестируемый или нестабильный дистрибутив?

source: This is a rather subjective issue. There is no perfect answer but only a "wise guess" could be made while deciding between unstable and testing. My personal order of preference is Stable, Unstable and Testing. The issue is like this:
it: Questa è una questione piuttosto soggettiva. Quando si deve decidere tra unstable e testing non esiste una risposta perfetta, ma solo una ipotesi ragionata. Il mio personale ordine di preferenza è Stable, Unstable e Testing. La questione è in questi termini:
ru: Здесь нужен индивидуальный подход. Точный ответ дать нельзя, можно только указать правильное направление. Мой (эта глава изначально была отдельным документом, написанным одним человеком, &mdash; прим. пер.) выбор в порядке предпочтения: стабильный, нестабильный и тестируемый. На такой выбор повлияло следующее:

source: Stable is rock solid. It does not break.
it: Stable è solida come una roccia. Non si rompe.
ru: Стабильный надёжен. Он никогда не ломается.

source: Testing breaks less often than Unstable. But when it breaks, it takes a long time for things to get rectified. Sometimes this could be days and it could be months at times.
it: Testing si rompe meno di frequente di Unstable, ma quando lo fa ci vuole parecchio tempo prima che le cose vengano aggiustate. A volte possono volerci giorni e a volte mesi.
ru: Тестируемый ломают не так часто, как нестабильный. Но когда это происходит, проходит немало времени, прежде чем его починят. Иногда это могут быть дни, а иногда и месяцы.

source: Unstable changes a lot, and it can break at any point. However, fixes get rectified in many occasions in a couple of days and it always has the latest releases of software packaged for Debian.
it: Unstable cambia molto e si può rompere in qualunque momento. Tuttavia, le cose vengono risolte spesso in un paio di giorni ed ha sempre le ultime versioni dei pacchetti software per Debian.
ru: Нестабильный часто изменяется и может в любой момент сломаться. Однако, это быстро исправляют, чаще всего за пару дней, и в нём всегда самые последние версии пакетов программ для Debian.

source: But there are times when tracking testing would be beneficial as opposed to unstable. The author such situation due to the gcc transition from gcc3 to gcc4. He was trying to install the <package>labplot</package> package on a machine tracking unstable and it could not be installed in unstable as some of its dependencies have undergone gcc4 transition and some have not. But the package in testing was installable on a testing machine as the gcc4 transitioned packages had not "trickled down" to testing.
it: Ci sono però situazioni in cui sarebbe meglio seguire testing invece di unstable. L'autore si è trovato in una di queste situazioni a causa della transizione di gcc da gcc3 a gcc4. Stava cercando di installare il pacchetto <package>labplot</package> su una macchina con unstable e l'installazione non era lì possibile perché alcune delle dipendenze avevano già fatto il passaggio a gcc4 ed alcune no. Il pacchetto in testing però era installabile su una macchina testing dato che i pacchetti che aveveno fatto la transizione a gcc4 non avevano ancora raggiunto testing.
ru: Но иногда тестируемый предпочтительнее нестабильного. Автор этих строк испытал на себе переход с gcc3 на gcc4. Он пытался установить пакет <package>labplot</package> на машину с нестабильным дистрибутивом и не смог этого сделать, так как некоторые его зависимости уже перешли на использование gcc4, а некоторые нет. А пакеты из тестируемого дистрибутива можно было бы установить, так как уже перешедшие на gcc4 пакеты ещё бы не успели в него попасть.

source: You are talking about testing being broken. What do you mean by that?
it: È stato detto che testing si può rompere. Cosa significa?
ru: Вы упомянули, что тестируемый дистрибутив иногда ломается. Что имеется в виду?
