Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: apt-get build-dep foo
it: apt-get build-dep pippo
ru: apt-get build-dep имя_пакета

source: before building the source.
it: prima di compilare il sorgente.
ru: перед сборкой пакета.

source: How do I build binary packages from a source package?
it: Come si compilano pacchetti binari da un pacchetto sorgente?
ru: Как собрать двоичный пакет из исходного?

source: The preferred way to do this is by using various wrapper tools. We'll show how it's done using the <tt>devscripts</tt> tools. Install this package if you haven't done so already.
it: Il metodo consigliato è usare vari strumenti wrapper. Verrà mostrato come farlo usando gli strumenti <tt>devscripts</tt>. Installare questo pacchetto se non è ancora stato fatto.
ru: Лучше всего это делать с помощью различных вспомогательных инструментов. Мы покажем как использовать инструменты <tt>devscripts</tt>. Установите этот пакет, если это ещё не сделано.

source: Now, first get the source package:
it: Ora, come prima cosa recuperare il pacchetto sorgente:
ru: Сначала получите пакет с исходным кодом:

source: and change to the source tree:
it: e spostarsi nell'albero dei sorgenti:
ru: и перейдите в дерево исходников:

source: cd foo-*
it: cd pippo-*
ru: cd имя_пакета-*

source: Then install needed build-dependencies (if any):
it: Poi installare le dipendenze di compilazione necessarie (se ce ne sono):
ru: Затем установите необходимые сборочные зависимости (если есть):

source: sudo apt-get build-dep foo
it: sudo apt-get build-dep pippo
ru: sudo apt-get build-dep имя_пакета

source: Then create a dedicated version of your own build (so that you won't get confused later when Debian itself releases a new version)
it: Creare quindi una versione dedicata della propria compilazione (in modo da non confondersi successivamente quando Debian stessa rilascerà una nuova versione)
ru: После этого создайте отдельную версию вашей сборки (для того, чтобы позже не удивляться, когда Debian тоже выпустит новую версию)

source: dch -l local 'Blah blah blah'
it: dch -l local 'Bla bla bla'

source: And finally build your package
it: Da ultimo compilare il proprio pacchetto
ru: И, наконец, соберите пакет

source: If everything worked out fine, you should now be able to install your package by running
it: Se tutto ha funzionato a dovere, dovrebbe essere ora possibile installare il proprio pacchetto eseguendo
ru: Если всё прошло хорошо, то вы сможете установить ваш пакет, запустив

source: If you prefer to do things manually, and don't want to use <tt>devscripts</tt>, follow this procedure:
it: Se si preferisce fare le cose a mano, e non si vuole usare <tt>devscripts</tt>, seguire la procedura seguente:
ru: Если вы предпочитаете делать всё вручную и не хотите использовать <tt>devscripts</tt>, то делайте так:

source: You will need all of foo_*.dsc, foo_*.tar.gz and foo_*.diff.gz to compile the source (note: there is no .diff.gz for some packages that are native to Debian).
it: Si avrà bisogno di tutti i file pippo_*.dsc, pippo_*.tar.gz e pippo_*.diff.gz per compilare i sorgenti (nota: non c'è nessun .diff.gz per alcuni pacchetti che sono nativi di Debian).
ru: Вам необходимы файлы имя_пакета_*.dsc, имя_пакета_*.tar.gz и имя_пакета_*.diff.gz для компиляции исходного кода (для родных пакетов Debian файла .diff.gz нет).

source: Once you have them (<ref id="sourcepkgs">), if you have the <package>dpkg-dev</package> package installed, the following command:
it: Una volta che li si ha (<ref id="sourcepkgs">), se si ha il pacchetto <package>dpkg-dev</package> installato, il seguente comando
ru: Если у вас есть эти файлы (см. <ref id="sourcepkgs">) и установлен пакет <package>dpkg-dev</package>, то следующая команда:

source: dpkg-source -x foo_version-revision.dsc
it: dpkg-source -x pippo_versione-revisione.dsc
ru: dpkg-source -x имя_пакета_версия-ревизия.dsc

source: will extract the package into a directory called <tt>foo-version</tt>.
it: estrarrà il pacchetto in una directory chiamata <tt>pippo-versione</tt>.
ru: извлечёт пакет в каталог с именем <tt>имя_пакета-версия</tt>.

source: If you want just to compile the package, you may cd into <tt>foo-version</tt> directory and issue the command
it: Se si vuole solo compilare il pacchetto, si può entrare nella directory <tt>pippo-versione</tt> e lanciare il comando
ru: Если вы хотите только скомпилировать пакет, то перейдите в каталог <tt>имя_пакета-version</tt> и выполните команду

source: to build the package (note that this also requires the <package>fakeroot</package> package), and then
it: per compilare il pacchetto (si noti che questo richiede anche il pacchetto <package>fakeroot</package>), e poi
ru: для сборки пакета (заметим, что для этого также требуется пакет <package>fakeroot</package>), и затем

source: dpkg -i ../foo_version-revision_arch.deb
it: dpkg -i ../pippo_versione-revisione_arch.deb
ru: dpkg -i ../имя_пакета_версия-ревизия_архитектура.deb

source: to install the newly-built package(s).
it: per installare il pacchetto appena compilato.
ru: для установки только что собранного пакета.

source: How do I create Debian packages myself?
it: Come ci si creano pacchetti Debian da sé?
ru: Как самому создать пакет Debian?

source: For a more detailed description on this, read the New Maintainers' Guide, available in the <package>maint-guide</package> package, or at <url id="http://www.debian.org/doc/devel-manuals#maint-guide">.
it: Per maggiori dettagli al riguardo si legga la New Maintainers' Guide, disponibile nel pacchetto <package>maint-guide</package> o su<url id="http://www.debian.org/doc/devel-manuals#maint-guide">.
ru: Детальное описание этого процесса содержится в "руководстве нового сопровождающего Debian" из пакета <package>maint-guide</package> или по ссылке <url id="http://www.debian.org/doc/devel-manuals#maint-guide">.

source: The Debian package management tools
it: Gli strumenti di gestione dei pacchetti Debian
ru: Инструменты управления пакетами Debian

source: What programs does Debian provide for managing its packages?
it: Quali programmi fornisce Debian per gestire i suoi pacchetti?
ru: Какие программы для управления пакетами имеются в Debian?

source: There are multiple tools that are used to manage Debian packages, from graphic or text-based interfaces to the low level tools used to install packages. All the available tools rely on the lower level tools to properly work and are presented here in decreasing complexity level.
it: Esistono diversi strumenti che vengono usati per gestire i pacchetti Debian, dalle interfacce grafiche o testuali agli strumenti a basso livello usati per installare i pacchetti. Tutti gli strumenti disponibili, per funzionare correttamente, si appoggiano sugli strumenti di più basso livello e vengono elencati qui in ordine di complessità decrescente.
ru: Есть много инструментов, которые используются для управления пакетами Debian, от имеющих графические и текстовые интерфейсы до низкоуровневых утилит, используемых для установки пакетов. Для корректной работы все доступные инструменты используют низкоуровневые утилиты и представлены здесь в порядке уменьшения уровня сложности.

source: It is important to understand that the higher level package management tools such as <prgn>aptitude</prgn> or <prgn>dselect</prgn> rely on <prgn>apt</prgn> which, itself, relies on <prgn>dpkg</prgn> to manage the packages in the system.
it: È importante capire che gli strumenti di gestione dei pacchetti di più alto livello, come <prgn>aptitude</prgn> o <prgn>dselect</prgn> si appoggiano su <prgn>apt</prgn> che si appoggia, a sua volta, su <prgn>dpkg</prgn> per gestire i pacchetti nel sistema.
ru: Важно понимать, что высокоуровневые инструменты управления пакетами, такие как <prgn>aptitude</prgn> или <prgn>dselect</prgn>, для управления пакетами используют <prgn>apt</prgn>, который, в свою очередь, использует <prgn>dpkg</prgn>.

source: See <url id="http://www.debian.org/doc/manuals/debian-reference/ch02.en.html" name="Chapter 2. Debian package management"> of the <url id="http://www.debian.org/doc/manuals/debian-reference/" name="Debian reference"> for more information about the Debian package management utilities. This document is available in various languages and formats, see <url id="http://www.debian.org/doc/user-manuals#quick-reference" name="the Debian Reference entry on the DDP Users' Manuals overview">.
it: Si veda il <url id="http://www.debian.org/doc/manuals/debian-reference/ch02.en.html" name="Capitolo 2. Gestione dei pacchetti Debian"> della <url id="http://www.debian.org/doc/manuals/debian-reference/" name="Debian reference"> per maggiori informazioni sulle utilità di gestione dei pacchetti di Debian. Tale documento è disponibile in diverse lingue e formati; si veda la <url id="http://www.debian.org/doc/user-manuals#quick-reference" name="voce nella Debian Reference sulla panoramica dei manuali utenti del DDP">.
ru: Подробней об инструментах управления пакетами Debian написано в <url id="http://www.debian.org/doc/manuals/debian-reference/ch02.en.html" name="Chapter 2. Debian package management"> <url id="http://www.debian.org/doc/manuals/debian-reference/" name="справочнике Debian">Этот документ доступен на различных языках и в разных форматах, смотрите <url id="http://www.debian.org/doc/user-manuals#quick-reference" name="пункт Debian Reference в описании руководств пользователя DDP">.

source: This is the main package management program. <prgn>dpkg</prgn> can be invoked with many options. Some common uses are:
it: Questo è il principale programma di gestione dei pacchetti. <prgn>dpkg</prgn> può essere invocato con molte opzioni. Quelli che seguono sono alcuni degli usi comuni.
ru: Это основная программа управления пакетами. <prgn>dpkg</prgn> может вызываться с многими параметрами. Самые используемые из них:

source: Find out all the options: <tt>dpkg --help</tt>.
it: Scoprire tutte le opzioni: <tt>dpkg --help</tt>.
ru: Показать список всех параметров: <tt>dpkg --help</tt>

source: Print out the control file (and other information) for a specified package: <tt>dpkg --info foo_VVV-RRR.deb</tt>
it: Stampare il file di controllo (ed altre informazioni) di un specifico pacchetto: <tt>dpkg --info pippo_VVV-RRR.deb</tt>
ru: Показать управляющий файл (и другую информацию) указанного пакета: <tt>dpkg --info foo_VVV-RRR.deb</tt>

source: Install a package (including unpacking and configuring) onto the file system of the hard disk: <tt>dpkg --install foo_VVV-RRR.deb</tt>.
it: Installare un pacchetto (incluso lo spacchettamento e la configurazione) nel file system dell'hard disk: <tt>dpkg --install pippo_VVV-RRR.deb</tt>.
ru: Установить пакет (т.е. распаковать и настроить) на жёсткий диск: <tt>dpkg --install foo_VVV-RRR.deb</tt>

source: Unpack (but do not configure) a Debian archive into the file system of the hard disk: <tt>dpkg --unpack foo_VVV-RRR.deb</tt>. Note that this operation does <em>not</em> necessarily leave the package in a usable state; some files may need further customization to run properly. This command removes any already-installed version of the program and runs the preinst (see <ref id="maintscripts">) script associated with the package.
it: Spacchettare (ma non configurare) un archivio Debian sul file system dell'hard disk: <tt>dpkg --unpack pippo_VVV-RRR.deb</tt>. Si noti che questa operazione <em>non</em> lascia necessariamente il pacchetto in uno stato utilizzabile; alcuni file possono necessitare di ulteriori adattamenti per funzionare correttamente. Questo comando rimuove qualsiasi versione già installata del programma ed esegue lo script preinst (si veda <ref id="maintscripts">) associato al pacchetto.
ru: Распаковать (но не настраивать) архив Debian на жёсткий диск: <tt>dpkg --unpack foo_VVV-RRR.deb</tt>. Заметим, что данная операция <em>не</em> обязательно приводит пакет в рабочее состояние; некоторые файлы могут требовать внесения изменений для правильной работы. Данная команда удаляет любую ранее установленную версию программы и запускает сценарий preinst (см. <ref id="maintscripts">), связанный с пакетом

source: Configure a package that already has been unpacked: <tt>dpkg --configure foo</tt>. Among other things, this action runs the postinst (see <ref id="maintscripts">) script associated with the package. It also updates the files listed in the <tt>conffiles</tt> for this package. Notice that the 'configure' operation takes as its argument a package name (e.g., foo), <em>not</em> the name of a Debian archive file (e.g., foo_VVV-RRR.deb).
it: Configurare un pacchetto che è già stato spacchettato: <tt>dpkg --configure pippo</tt>. Tra le altre cose, questa azione esegue lo script postinst (si veda <ref id="maintscripts">) associato al pacchetto. Aggiorna inoltre i file elencati in <tt>conffiles</tt> per questo pacchetto. Si faccia attenzione che l'operazione "configure" prende come argomento il nome del pacchetto (ad esempio, pippo), <em>non</em> il nome del file archivio Debian (ad esempio, pippo_VVV-RRR.deb).
ru: Настроить пакет, который ранее был распакован: <tt>dpkg --configure foo</tt>. Кроме всего прочего, эта команда запускает сценарий postinst (см. <ref id="maintscripts">), связанный с пакетом. Она также обновляет файлы, перечисленные в <tt>conffiles</tt>. Заметим, что с параметром configure передаётся имя пакета (т.е. foo), а <em>не</em> имя файла архива Debian (т.е. foo_VVV-RRR.deb)

source: Extract a single file named "blurf" (or a group of files named "blurf*" from a Debian archive: <tt>dpkg --fsys-tarfile foo_VVV-RRR.deb | tar -xf - blurf*</tt>
it: Estrarre un unico file chiamato "ciccia" (o un gruppo di file chiamati "ciccia*" da un archivio Debian: <tt>dpkg --fsys-tarfile pippo_VVV-RRR.deb | tar -xf - ciccia*</tt>
ru: Извлечь единственный файл с именем «blurf» (или группу файлов с именами по шаблону «blurf*») из архива Debian: <tt>dpkg --fsys-tarfile foo_VVV-RRR.deb | tar -xf - blurf*</tt>

source: Remove a package (but not its configuration files): <tt>dpkg --remove foo</tt>.
it: Rimuovere un pacchetto (ma non i suoi file di configurazione): <tt>dpkg --remove pippo</tt>.
ru: Удалить пакет (но не его файлы настройки): <tt>dpkg --remove foo</tt>

source: Remove a package (including its configuration files): <tt>dpkg --purge foo</tt>.
it: Rimuovere un pacchetto (inclusi i suoi file di configurazione): <tt>dpkg --purge pippo</tt>.
ru: Удалить пакет (вместе с файлами настройки): <tt>dpkg --purge foo</tt>

source: List the installation status of packages containing the string (or regular expression) "foo*": <tt>dpkg --list 'foo*'</tt>.
it: Elencare lo stato d'installazione dei pacchetti contenenti la stringa (o l'espressione regolare) "pippo*": <tt>dpkg --list 'pippo*'</tt>.
ru: Вывести состояние установки пакетов, содержащих в имени строку (или регулярное выражение) «foo*»: <tt>dpkg --list 'foo*'</tt>

source: APT is the <em>Advanced Package Tool</em> and provides the <prgn>apt-get</prgn> program. <prgn>apt-get</prgn> provides a simple way to retrieve and install packages from multiple sources using the command line. Unlike <prgn>dpkg</prgn>, <prgn>apt-get</prgn> does not understand .deb files, it works with the packages proper name and can only install .deb archives from a source specified in <file>/etc/apt/sources.list</file>. <prgn>apt-get</prgn> will call <prgn>dpkg</prgn> directly after downloading the .deb archives<footnote><p>Notice that there are ports that make this tool available with other package management systems, like Red Hat package manager, also known as <prgn>rpm</prgn></p></footnote> from the configured sources.
it: APT è lo <em>strumento avanzato per i pacchetti (Advanced Package Tool)</em> e fornisce il programma <prgn>apt-get</prgn>. <prgn>apt-get</prgn> fornisce un metodo semplice per recuperare e installare i pacchetti da fonti multiple usando la riga di comando. A differenza di <prgn>dpkg</prgn>, <prgn>apt-get</prgn> non capisce i file .deb, funziona con i nomi appropriati dei pacchetti e può solo installare gli archivi .deb da una fonte specificata in <file>/etc/apt/sources.list</file>. <prgn>apt-get</prgn> chiama <prgn>dpkg</prgn> direttamente dopo aver scaricato gli archivi .deb<footnote><p>Si noti che ci sono port che rendono disponibile questo strumento con altri sistemi di gestione dei pacchetti, come il gestore dei pacchetti di Red Hat, noto anche come <prgn>rpm</prgn>.</footnote> dalle fonti configurate.
ru: APT &mdash; это <em>улучшенный инструмент управления пакетами</em>, он предоставляет программу <prgn>apt-get</prgn>. Программа <prgn>apt-get</prgn> позволяет легко получать и устанавливать пакеты из разных источников с помощью командной строки. В отличие от <prgn>dpkg</prgn>, <prgn>apt-get</prgn> не понимает файлы .deb, она работает с именами пакетов, и может устанавливать архивы .deb только из источников, указанных в файле <file>/etc/apt/sources.list</file>. Команда <prgn>apt-get</prgn> запускает <prgn>dpkg</prgn> после скачивания архивов .deb<footnote><p>Заметим, что есть переносы, которые позволяют работать с помощью этого инструмента с другими системами управления пакетами, например Red Hat package manager, также известного как <prgn>rpm</prgn></p></footnote>.

source: Some common ways to use <prgn>apt-get</prgn> are:
it: Quelli che seguono sono alcuni dei modi comuni di usare <prgn>apt-get</prgn>.
ru: Часто используемые команды <prgn>apt-get</prgn>:

source: To update the list of package known by your system, you can run:
it: Per aggiornare l'elenco dei pacchetti conosciuti dal sistema, si può eseguire:
ru: Обновить список пакетов, имеющихся в источниках:

source: (you should execute this regularly to update your package lists)
it: (lo si dovrebbe eseguire regolarmente per aggiornare il proprio elenco di pacchetti)
ru: (вы должны регулярно запускать эту команду для обновления списка пакетов)

source: To upgrade all the packages on your system (without installing extra packages or removing packages), run:
it: Per aggiornare tutti i pacchetti sul sistema (senza installare pacchetti aggiuntivi o rimuovere pacchetti), si esegua:
ru: Обновить все пакеты в системе (без установки дополнительных пакетов или удаления пакетов):

source: To install the <var>foo</var> package and all its dependencies, run:
it: Per installare il pacchetto <var>pippo</var> e tutte le sue dipendenze, si esegua:
ru: Установить пакет <var>foo</var> и все его зависимости:

source: apt-get install foo
it: apt-get install pippo

source: To remove the foo package from your system, run:
it: Per rimuovere il pacchetto pippo dal sistema, si esegua:
ru: Удалить пакет из системы:

source: apt-get remove foo
it: apt-get remove pippo

source: To remove the foo package and its configuration files from your system, run:
it: Per rimuovere il pacchetto pippo e i suoi file di configurazione dal sistema, si esegua:
ru: Удалить пакет из системы и все его файлы настройки:

source: apt-get --purge remove foo
it: apt-get --purge remove pippo

source: To upgrade all the packages on your system, and, if needed for a package upgrade, installing extra packages or removing packages, run:
it: Per aggiornare tutti i pacchetti sul sistema e, se necessario per l'aggiornamento di un pacchetto, installare pacchetti aggiuntivi o rimuovere pacchetti, si esegua:
ru: Обновить все установленные в системе пакеты и, если потребуется, установить или удалить другие пакеты:

source: (The command <tt>upgrade</tt> keeps a package at its installed obsolete version if upgrading would need an extra package to be installed, for a new dependency to be satisfied. The <tt>dist-upgrade</tt> command is less conservative.)
it: (Il comando <tt>upgrade</tt> mantiene un pacchetto nella sua versione installata obsoleta se l'aggiornamento necessita dell'installazione di un pacchetto aggiuntivo per soddisfare una nuova dipendenza. Il comando <tt>dist-upgrade</tt> è meno conservativo.)
ru: (Команда <tt>upgrade</tt> оставит установленной устаревшую версию, если для обновления нужно установить дополнительные пакеты, чтобы разрешить новые зависимости. Команда <tt>dist-upgrade</tt> менее консервативна.)

source: Note that you must be logged in as root to perform any commands that modify the system packages.
it: Si noti che si deve aver fatto il login come root per eseguire qualsiasi comando che modifichi i pacchetti di sistema.
ru: Заметим, что вам нужно иметь права суперпользователя, чтобы выполнять все эти команды по изменению пакетов системы.

source: Note that <prgn>apt-get</prgn> now installs recommended packages as default and is the preferred program for package management from console to perform system installation and major system upgrades for its robustness.
it: Si noti che <prgn>apt-get</prgn> ora installa in modo predefinito i pacchetti raccomandati ed è, per la sua solidità, il programma consigliato per la gestione dei pacchetti dalla console, per eseguire installazioni sul sistema e per aggiornamenti principali del sistema.
ru: Заметим, что <prgn>apt-get</prgn> сейчас является рекомендуемой программой для управления пакетами из консоли для установки пакетов или обновления системы.

source: The apt tool suite also includes the <prgn>apt-cache</prgn> tool to query the package lists. You can use it to find packages providing specific functionality through simple text or regular expression queries and through queries of dependencies in the package management system. Some common ways to use <prgn>apt-cache</prgn> are:
it: La suite di strumenti apt include anche lo strumento <prgn>apt-cache</prgn> per interrogare l'elenco dei pacchetti. Lo si può usare per trovare i pacchetti che forniscono una funzionalità specifica, attraverso l'uso di interrogazioni con testo semplice o espressioni regolari e con interrogazioni sulle dipendenze nel sistema di gestione dei pacchetti. Alcuni dei modi comuni di usare <prgn>apt-cache</prgn> sono i seguenti.
ru: Комплект инструментов apt также содержит программу <prgn>apt-cache</prgn>, которая выполняет запросы к списку пакетов. Вы можете использовать её для поиска пакетов, предоставляющих определённые возможности, с помощью простых текстовых запросов или регулярных выражений, а также для получения списка зависимостей из системы управления пакетами. Часто используемые команды <prgn>apt-cache</prgn>:

source: To find packages whose description contain <var>word</var>:
it: Per trovare pacchetti la cui descrizione contiene <var>parola</var>:
ru: Найти пакеты, в чьих описаниях содержится <var>слово</var>:

source: apt-cache search <var>word</var>
it: apt-cache search <var>parola</var>
ru: apt-cache search <var>слово</var>

source: To print the detailed information of a package:
it: Per stampare le informazioni dettagliate su un pacchetto:
ru: Показать подробную информацию о пакете:

source: apt-cache show <var>package</var>
it: apt-cache show <var>pacchetto</var>
ru: apt-cache show <var>пакет</var>

source: To print the packages a given package depends on:
it: Per stampare i pacchetti da cui dipende un dato pacchetto:
ru: Показать зависимости пакета:

source: apt-cache depends <var>package</var>
it: apt-cache depends <var>pacchetto</var>
ru: apt-cache depends <var>пакет</var>

source: To print detailed information of the versions available for a package and the packages that reverse-depends on it:
it: Per stampare informazioni dettagliate sulle versioni disponibili di un pacchetto e le sue dipendenze inverse:
ru: Показать подробную информацию о доступной версии пакета и пакеты, которые зависят от данного пакета (обратные зависимости):

source: apt-cache showpkg <var>package</var>
it: apt-cache showpkg <var>pacchetto</var>
ru: apt-cache showpkg <var>пакет</var>
