Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: You can use the package <package>reportbug</package> that will guide you through the reporting process and mail the message to the proper address, with some extra details about your system added automatically. It will also show you a list of bugs already reported to the package you are reporting against in case your bug has been reported previously, so that you can add additional information to the existing bug report.
it: Si può usare il pacchetto <package>reportbug</package> che guida l'utente attraverso il processo di segnalazione ed invia il messaggio all'indirizzo corretto, aggiungendo automaticamente alcuni dettagli aggiuntivi sul sistema. Mostra anche un elenco di bug già segnalati per il pacchetto interessato dalla segnalazione in corso, in modo che, nel caso che il bug sia già stato segnalato in precedenza, si possono aggiungere ulteriori informazioni alla segnalazione esistente.
ru: Вы можете воспользоваться пакетом <package>reportbug</package>, который проведёт вас через процесс заполнения сообщения и отправит почту на соответствующий адрес с дополнительными подробностями о вашей системе, которые добавятся автоматически. Он также покажет список уже имеющихся ошибок в пакете, и если ошибка подобна вашей, то вы можете отправить дополнительную информацию по данной проблеме.

source: Expect to get an automatic acknowledgement of your bug report. It will also be automatically given a bug tracking number, entered into the bug log and forwarded to the debian-bugs-dist mailing list.
it: Ci si aspetti di ricevere un messaggio automatico di conferma della propria segnalazione. A questa verrà anche assegnato un numero di tracciamento bug, verrà immessa nel registro dei bug ed inoltrata alla mailing-list debian-bugs-dist.
ru: Дождитесь автоматического подтверждения о получении вашего сообщения об ошибке. Также, автоматически ей будет присвоен контрольный номер, сделана запись в журнале об ошибках и письмо перешлётся в список рассылки debian-bugs-dist.

source: Contributing to the Debian Project
it: Contribuire al Progetto Debian
ru: Сотрудничество в проекте Debian

source: <url id="&debian-donation;" name="Donations"> of time (to develop new packages, maintain existing packages, or provide user support), resources (to mirror the FTP and WWW archives), and money (to pay for new testbeds as well as hardware for the archives) can help the project.
it: <url id="&debian-donation;" name="Donazioni"> di tempo (sviluppare nuovi pacchetti, mantenere pacchetti esistenti o fornire supporto agli utenti), risorse (fare da mirror agli archivi FTP e WWW) e denaro (pagare per nuove piattaforme di test come pure hardware per gli archivi) possono aiutare il progetto.
ru: Ваша помощь может заключаться в <url id="&debian-donation;" name="уделении времени"> (для разработки новых пакетов, сопровождения существующих пакетов и предоставления пользовательской поддержки), выделении ресурсов (для размещения зеркал FTP и WWW архивов) и финансов (на оплату тестового оборудования и аппаратного обеспечения архивов).

source: How can I become a Debian software developer?
it: Come si può diventare uno sviluppatore di software Debian?
ru: Как стать разработчиком программного обеспечения Debian?

source: The development of Debian is open to all, and new users with the right skills and/or the willingness to learn are needed to maintain existing packages which have been "orphaned" by their previous maintainers, to develop new packages, and to provide user support.
it: Lo sviluppo di Debian è aperto a tutti e i nuovi utenti con le giuste capacità o con la volontà di imparare sono necessari per mantenere pacchetti già esistenti resi "orfani" dai loro precedenti manutentori, per sviluppare nuovi pacchetti e fornire supporto agli utenti.
ru: Участие в процессе разработке Debian открыто для всех, и всегда есть необходимость в новых грамотных и/или желающих учиться пользователях, которые могли бы заняться сопровождением существующих пакетов (которые были оставлены их предыдущими сопровождающими), разработкой новых пакетов и предоставлением пользовательской поддержки.

source: The description of becoming a Debian developer can be found at the <url id="http://www.debian.org/devel/join/newmaint" name="New Member's Corner"> at the Debian web site.
it: La descrizione su come diventare sviluppatore Debian può essere trovata all'<url id="http://www.debian.org/devel/join/newmaint" name="Angolo del nuovo membro"> sul sito web Debian.
ru: О том, как стать разработчиком Debian подробно описано на странице <url id="http://www.debian.org/devel/join/newmaint" name="Уголок нового сопровождающего">.

source: How can I contribute resources to the Debian project?
it: Come si possono fornire risorse al progetto Debian?
ru: Как помочь проекту Debian своими ресурсами?

source: Since the project aims to make a substantial body of software rapidly and easily accessible throughout the globe, mirrors are urgently needed. It is desirable but not absolutely necessary to mirror all of the archive. Please visit the <url id="http://www.debian.org/mirror/size" name="Debian mirror size"> page for information on the disk space requirements.
it: Dato che il progetto mira a creare un corpo esaustivo di software accessibile rapidamente e facilmente da tutto il mondo, i mirror sono enormemente necessari. È desiderabile, ma non assolutamente necessario, fare il mirror di tutto l'archivio. Si visiti la pagina <url id="http://www.debian.org/mirror/size" name="Dimensione del mirror Debian"> per informazioni sui requisiti di spazio su disco.
ru: Так как проект нацелен на создание основы программного обеспечения, быстро и легко получаемой из любой точки земного шара, то крайне необходимы серверы-зеркала. Желательно, но не абсолютно необходимо иметь копии всех архивов. Пожалуйста, посетите страницу <url id="http://www.debian.org/mirror/size" name="Размеры зеркала Debian">, где описаны требования к дисковому пространству.

source: Most of the mirroring is accomplished entirely automatically by scripts, without any interaction. However, the occasional glitch or system change occurs which requires human intervention.
it: La maggior parte del lavoro di mirror è realizzata interamente in modo automatico da degli script senza alcuna interazione. Comunque, accadono occasionali errori o modifiche di sistema che richiedono l'intervento umano.
ru: Большинство действий по зеркалированию полностью автоматизированы и выполняются без какого-либо вмешательства человека. Однако при случайных сбоях или изменениях в системе может потребоваться вмешательство человека.

source: If you have a high-speed connection to the Internet, the resources to mirror all or part of the distribution, and are willing to take the time (or find someone) who can provide regular maintenance of the system, then please contact <email>debian-admin@lists.debian.org</email>.
it: Se si possiedono una connessione ad Internet ad alta velocità, i mezzi per fare il mirror di tutta o di parte della distribuzione e si è disposti a dedicare tempo (o a trovare qualcuno) per poter fornire una regolare manutenzione al sistema, allora contattare <email>debian-admin@lists.debian.org</email>.
ru: Если у вас есть высокоскоростной доступ к Интернет, ресурсы для зеркала всего дистрибутива или его части, и вы можете выделить своё время, или найти кого-то, кто может регулярно сопровождать систему, то, пожалуйста, свяжитесь с нами по адресу <email>debian-admin@lists.debian.org</email>.

source: How can I contribute financially to the Debian project?
it: Come si può contribuire finanziariamente al progetto Debian?
ru: Как оказать финансовую помощь проекту Debian?

source: One can make individual donations to one of two organizations that are critical to the development of the Debian project.
it: Si possono fare donazioni individuali ad una tra due organizzazioni che che sono fondamentali per lo sviluppo del progetto Debian.
ru: Каждый может отправить пожертвования одной из двух организаций, которые принимают непосредственное участие в разработке проекта Debian.

source: Software in the Public Interest (SPI) is an IRS 501(c)(3) non-profit organization, formed when FSF withdrew their sponsorship of Debian. The purpose of the organization is to develop and distribute free software.
it: Software in the Public Interest (SPI) è un'organizzazione IRS 501(c)(3) senza fini di lucro, formata quando la FSF ritirò il proprio appoggio a Debian. Lo scopo dell'organizzazione è quello di sviluppare e distribuire software libero.
ru: Software in the Public Interest (SPI) &mdash; это IRS 501(c)(3) некоммерческая организация созданная после того, как FSF перестала спонсировать Debian. Эта организация разрабатывает и распространяет свободное программное обеспечение.

source: Our goals are very much like those of FSF, and we encourage programmers to use the GNU General Public License on their programs. However, we have a slightly different focus in that we are building and distributing a Linux system that diverges in many technical details from the GNU system as originally planned by FSF. We still communicate with FSF, and we cooperate in sending them changes to GNU software and in asking our users to donate to FSF and the GNU project.
it: I nostri obiettivi sono molto simili a quelli della FSF e incoraggiamo i programmatori a usare la licenza GNU General Public License per i loro programmi. Comunque, abbiamo un obiettivo leggermente differente in quanto stiamo realizzando e distribuendo un sistema Linux che differisce in molti dettagli tecnici dal sistema GNU originariamente progettato dalla FSF. Comunichiamo ancora con la FSF e cooperiamo con loro inviando cambiamenti apportati al software GNU e chiedendo ai nostri utenti di fare donazioni alla FSF e al progetto GNU.
ru: Наши цели очень близки к целям FSF, и мы призываем программистов использовать для своих программ Универсальную Общественную Лицензию GNU. Однако наши взгляды по построению и распространению системы Linux несколько расходятся по множеству технических вопросов от планируемой FSF системы GNU. Мы продолжаем контактировать с FSF, и мы взаимодействуем в отправке изменений в ПО GNU и призываем наших пользователей помогать FSF и проекту GNU.

source: SPI can be reached at: <url id="http://www.spi-inc.org/">.
it: SPI può essere raggiunta su: <url id="http://www.spi-inc.org/">.
ru: С SPI можно войти в контакт через: <url id="http://www.spi-inc.org/">.

source: At this time there is no formal connection between Debian and the Free Software Foundation. However, the Free Software Foundation is responsible for some of the most important software components in Debian, including the GNU C compiler, GNU Emacs, and much of the C run-time library that is used by all programs on the system. FSF pioneered much of what free software is today: they wrote the General Public License that is used on much of the Debian software, and they invented the "GNU" project to create an entirely free Unix system. Debian should be considered a descendent of the GNU system.
it: In questo momento non c'è nessuna connessione formale tra Debian e la Free Software Foundation. Comunque, la Free Software Foundation è responsabile di alcuni dei più importanti componenti software in Debian, inclusi il compilatore C di GNU, GNU Emacs e gran parte della libreria run-time C che è usata da tutti i programmi sul sistema. La FSF è stata pioniera di molto di quello che il software libero è oggi: ha scritto la General Public License che è usata su gran parte del software Debian ed ha inventato il progetto "GNU" per creare un sistema Unix interamente libero. Debian dovrebbe essere considerata come una discendente del sistema GNU.
ru: В настоящее время формальной связи между Debian и Free Software Foundation нет. Однако Free Software Foundation несёт ответственность за наиболее важные компоненты ПО в Debian, включая компилятор GNU C, GNU Emacs и множество библиотек времени выполнения языка C, используемых всеми программами системы. FSF сделала очень много для сегодняшнего свободного программного обеспечения: она написала Универсальную Общественную Лицензию (General Public License), которая используется большинством ПО, включённого в Debian, и они запустили проект «GNU» по созданию полностью свободной системы Unix. Debian должен рассматриваться как потомок системы GNU.

source: FSF can be reached at: <url id="http://www.fsf.org/">.
it: FSF può essere raggiunta su: <url id="http://www.fsf.org/">.
ru: Информацию о FSF можно найти по адресу: <url id="http://www.fsf.org/">.

source: Redistributing &debian; in a commercial product
it: Ridistribuire &debian; in un prodotto commerciale
ru: Распространение &debian; в коммерческом продукте

source: Can I make and sell Debian CDs?
it: Si possono creare e vendere CD Debian?
ru: Можно ли штамповать CD-диски Debian и продавать их?

source: Go ahead. You do not need permission to distribute anything we have <em>released</em>, so that you can master your CD as soon as the beta-test ends. You do not have to pay us anything. Of course, all CD manufacturers must honor the licenses of the programs in Debian. For example, many of the programs are licensed under the GPL, which requires you to distribute their source code.
it: Certamente. Non è necessario il permesso per distribuire qualcosa che abbiamo <em>rilasciato</em>, quindi si può masterizzare il proprio CD appena finisce il beta-test. Non si deve pagare niente. Ovvio che tutti i produttori di CD devono rispettare le licenze dei programmi in Debian. Per esempio, molti dei programmi sono sotto licenza GPL, che richiede che si redistribuisca il loro codice sorgente.
ru: Запросто! Вам не нужно разрешение на распространение всего, что мы <em>выпустили</em>, так что вы можете штамповать CD-диски как только окончится этап бета-тестирования. Вы не должны нам платить. Конечно, все производители CD-дисков должны следовать положениям лицензий программ Debian. Например, многие программы лицензированы под GPL, которая требует от вас распространять их исходный код.

source: Also, we will publish a list of CD manufacturers who donate money, software, and time to the Debian project, and we will encourage users to buy from manufacturers who donate, so it is good advertising to make donations.
it: Inoltre, viene pubblicato un elenco dei produttori di CD che donano denaro, software e tempo al progetto Debian, e gli utenti sono incoraggiati a comperare dai produttori che donano, quindi fare donazioni è una buona pubblicità.
ru: Также мы публикуем список производителей CD-дисков, которые жертвуют свои деньги, ПО и время для проекта Debian, и мы будем советовать пользователям приобретать продукцию этих производителей в качестве компенсации этих пожертвований.

source: Can Debian be packaged with non-free software?
it: Si può impacchettare Debian con software non libero?
ru: Можно ли укомплектовать Debian несвободным ПО?

source: Yes. While all the main components of Debian are free software, we provide a non-free directory for programs that are not freely redistributable.
it: Sì. Sebbene tutti i componenti principali di Debian siano software libero, è fornita una directory non-free per programmi che non sono liberamente redistribuibili.
ru: Да. В то время как все основные компоненты Debian являются свободным ПО, мы предоставляем каталог non-free для программ, которые не распространяются свободно.

source: CD manufacturers <em>may</em> be able to distribute the programs we have placed in that directory, depending on the license terms or their private arrangements with the authors of those software packages. CD manufacturers can also distribute the non-free software they get from other sources on the same CD. This is nothing new: free and commercial software are distributed on the same CD by many manufacturers now. Of course we still encourage software authors to release the programs they write as free software.
it: I produttori di CD <em>potrebbero</em> essere in grado di distribuire i programmi che sono stati collocati in quella directory, a seconda dei termini delle licenze o dei loro accordi privati con gli autori di quei pacchetti software. I produttori di CD possono inoltre distribuire il software non-libero che ricevono da altre fonti sullo stesso CD. Non è niente di nuovo: software libero e commerciale sono ora distribuiti sullo stesso CD da molti produttori. Ovvio che incoraggiamo sempre gli autori del software a rilasciare i programmi che scrivono come software libero.
ru: Производители CD-дисков <em>могут</em> распространять программы, которые помещены в этот каталог, в зависимости от положений их лицензии или собственных пожеланий авторов этих пакетов программ. Производители CD-дисков также могут помещать несвободные программы, которые они получают из других источников, на эти же CD. В этом нет ничего нового: многие производители распространяют свободные и несвободные программы на одном CD-диске. Конечно, мы приветствуем желание авторов программ выпускать их продукты как свободное ПО.

source: I am making a special Linux distribution for a "vertical market". Can I use &debian; for the guts of a Linux system and add my own applications on top of it?
it: Sto creando una speciale distribuzione Linux per un "mercato verticale". Posso usare &debian; come nucleo di un sistema Linux e aggiungere le mie applicazioni su di esso?
ru: Я делаю специальный дистрибутив Linux для «вертикального маркетинга». Могу я использовать &debian; как основу этой системы и добавлять мои собственные приложения поверх него?

source: Yes. Debian-derived distributions are being created both in close cooperation with the Debian project itself and by external parties. One can use the <url id="http://cdd.alioth.debian.org/" name="Custom Debian Distributions"> framework to work together with Debian; <url id="http://www.skolelinux.org/" name="Skolelinux"> is one such project.
it: Sì. Distribuzioni derivate da Debian vengono attualmente create sia in stretta collaborazione con il progetto Debian stesso, sia da terze parti. Si può usare l'infrastruttura <url id="http://cdd.alioth.debian.org/" name="Custom Debian Distributions"> per lavorare insieme a Debian; <url id="http://www.skolelinux.org/" name="Skolelinux"> è un progetto di questo tipo.
ru: Да. Дистрибутивы, основанные на Debian, создаются в тесном сотрудничестве с проектом Debian или отдельно. Для этого можно использовать каркас <url id="http://cdd.alioth.debian.org/" name="специализированных дистрибутивов Debian"> для совместной работы с Debian; <url id="http://www.skolelinux.org/" name="Skolelinux"> является одним из таких проектов.

source: There are several other Debian-derived distributions already on the market, such as Progeny Debian, Linspire, Knoppix and Ubuntu, that are targeted at a different kind of audience than the original &debian; is, but use most of our components in their product.
it: Ci sono diverse altre distribuzioni derivate da Debian già sul mercato, come Progeny Debian, Linspire, Knoppix e Ubuntu, che sono indirizzate ad un differente tipo di pubblico rispetto all'originale &debian;, ma usano la maggior parte dei nostri componenti nei loro prodotti.
ru: На рынке есть уже несколько основанных на Debian дистрибутивов, например, Progeny Debian, Linspire, Knoppix и Ubuntu, которые рассчитаны на определённые категории пользователей, но которые используют большую часть наших компонентов в своих продуктах.

source: Debian also provides a mechanism to allow developers and system administrators to install local versions of selected files in such a way that they will not be overwritten when other packages are upgraded. This is discussed further in the question on <ref id="divert">.
it: Debian fornisce inoltre un meccanismo che permette agli sviluppatori e agli amministratori di sistema di installare versioni locali di file specifici in modo che non vengano sovrascritti quando altri pacchetti vengono aggiornati. Questo è discusso meglio nella domanda su <ref id="divert">.
ru: Debian также предлагает механизм, который позволяет разработчикам и системным администраторам устанавливать локальные версии определённых файлов таким образом, что они не будут перезаписываться при обновлении пакетов. См. <ref id="divert">.

source: Can I put my commercial program in a Debian "package" so that it installs effortlessly on any Debian system?
it: È possibile mettere un proprio programma commerciale in un "pacchetto" Debian cosicché si possa installare senza fatica su ogni sistema Debian?
ru: Можно ли создать «пакет» Debian из коммерческой программы, чтобы её можно было без проблем установить в любой системе Debian?

source: Go right ahead. The package tool is free software; the packages may or may not be free software, it can install them all.
it: Certamente. Lo strumento per i pacchetti è software libero; i pacchetti possono essere o meno software libero, li può installare tutti.
ru: Да, это возможно. Инструментарий пакетов &mdash; это свободное программное обеспечение; пакеты могут содержать свободное или несвободное ПО, можно устанавливать любое из них.

source: Changes expected in the next major release of Debian
it: Cambiamenti attesi nel prossimo rilascio principale di Debian
ru: Изменения, которые ожидаются в следующем выпуске Debian

source: Extended support for non-English users
it: Supporto esteso per gli utenti non-inglesi
ru: Расширенная поддержка не-англоговорящих пользователей

source: Debian already has very good support for non-English users, see <ref id="nonenglish">.
it: Debian ha già un ottimo supporto per utenti non-inglesi, si veda <ref id="nonenglish">.
ru: В Debian уже имеется очень хорошая поддержка не-англоговорящих пользователей, см. <ref id="nonenglish">.

source: We hope to find people who will provide support for even more languages, and translate. Some programs already support internationalization, so we need message catalogs translators. Many programs still remain to be properly internationalized.
it: Ci si augura di trovare persone che forniscano supporto per ancora più lingue e che traducano. Alcuni programmi supportano già l'internazionalizzazione, così abbiamo bisogno di traduttori dei cataloghi dei messaggi. Rimangono ancora molti programmi che devono essere correttamente internazionalizzati.
ru: Мы надеемся, что найдутся люди, которые добавят поддержку ещё большего количества языков и переводов. Некоторые программы уже имеют поддержку интернационализации, поэтому нам требуются только перевод каталогов сообщений. Многие программы ещё требуется интернационализовать.

source: The GNU Translation Project <url id="ftp://ftp.gnu.org/pub/gnu/ABOUT-NLS"> works on internationalizing the GNU programs.
it: Il progetto GNU di traduzione (GNU Translation Project) <url id="ftp://ftp.gnu.org/pub/gnu/ABOUT-NLS"> lavora sull'internazionalizzazione dei programmi GNU.
ru: Проект переводов GNU <url id="ftp://ftp.gnu.org/pub/gnu/ABOUT-NLS"> работает над интернационализацией программ GNU.

source: Specifically for Debian lenny, we're working on things like the following:
it: Specificamente per Debian Lenny stiamo lavorando su cose come quelle che seguono:
ru: В частности, в Debian lenny мы работаем над следующими вещами:

source: I18n support in all debconf-using packages: Packages using the Debian configuration management must allow for translation of all messages displayed to the user during package configuration.
it: Supporto i18n in tutti i pacchetti che usano debconf: i pacchetti che usano la gestione Debian della configurazione devono permettere la traduzione di tutti i messaggi presentati all'utente durante la configurazione del pacchetto.
ru: Поддержка интернационализации во всех пакетах, использующих debconf: пакеты, использующих управление настройками Debian, должны позволять перевод всех видимых пользователем сообщений во время настройки пакета.
