Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: More than &developers; volunteer package maintainers are working on over &all-pkgs; packages and improving &debian;. The Debian developers contribute to the project not by writing new applications (in most cases), but by packaging existing software according to the standards of the project, by communicating bug reports to upstream developers, and by providing user support. See also additional information on how to become a contributor in <ref id="contrib">.
it: Più di &developers; volontari che mantengono i pacchetti stanno lavorando su più di &all-pkgs; pacchetti migliorando &debian;. Gli sviluppatori Debian contribuiscono al progetto non scrivendo nuove applicazioni (nella maggior parte dei casi), ma impacchettando software già esistente in accordo con gli standard del progetto, comunicando segnalazioni sui bug agli sviluppatori originali e fornendo supporto agli utenti. Si vedano anche le informazioni aggiuntive su come diventare un contributore in <ref id="contrib">.
ru: Более &developers; сопровождающих, действующих по собственной инициативе, работают над более чем &all-pkgs; пакетами и улучшением &debian;. В большинстве случаев разработчики Debian помогают проекту не написанием новых приложений, а пакетированием существующего ПО в соответствии со стандартами проекта, отправкой сообщений о найденных ошибках первоначальным авторам программ и предоставлением поддержки пользователям. О том, как стать таким сотрудником, см. <ref id="contrib">.

source: The Universal Operating System:
it: Il Sistema Operativo Universale:
ru: Универсальная операционная система

source: Debian comes with <url id="http://packages.debian.org/stable/" name="more than &all-pkgs; packages"> and runs on <url id="http://www.debian.org/ports/" name="&archs; architectures">. This is far more than is available for any other GNU/Linux distribution. See <ref id="apps"> for an overview of the provided software and see <ref id="arches"> for a description of the supported hardware platforms.
it: Debian viene fornita con <url id="http://packages.debian.org/stable/" name="più di &all-pkgs; pacchetti"> e gira su <url id="http://www.debian.org/ports/" name="&archs; architetture">. Ciò è molto più di quello che è disponibile per le altre distribuzioni GNU/Linux. Si veda <ref id="apps"> per una panoramica del software fornito e <ref id="arches"> per una descrizione delle piattaforme hardware supportate.
ru: В Debian входит <url id="http://packages.debian.org/stable/" name="более &all-pkgs; пакетов">, он работает на <url id="http://www.debian.org/ports/" name="&archs; компьютерных архитектурах">. Это гораздо больше, чем для любого другого дистрибутива GNU/Linux. <ref id="apps"> описывает имеющееся ПО, а <ref id="arches"> &mdash; поддерживаемые аппаратные платформы.

source: The Bug Tracking System:
it: Il BTS (Sistema di tracciamento dei bug):
ru: Система отслеживания ошибок

source: The geographical dispersion of the Debian developers required sophisticated tools and quick communication of bugs and bug-fixes to accelerate the development of the system. Users are encouraged to send bugs in a formal style, which are quickly accessible by WWW archives or via e-mail. See additional information in this FAQ on the management of the bug log in <ref id="buglogs">.
it: La dispersione geografica degli sviluppatori Debian ha richiesto degli strumenti sofisticati ed una comunicazione rapida dei bug e delle soluzioni per accelerare lo sviluppo del sistema. Gli utenti sono incoraggiati a segnalare i bug in uno stile formale, che sia rapidamente accessibile attraverso gli archivi WWW o via posta elettronica. Si vedano le informazioni aggiuntive in questa FAQ sulla gestione dei log dei bug in <ref id="buglogs">.
ru: В связи с территориальной рассредоточенностью разработчиков Debian для ускорения разработки системы и быстрого исправления ошибок им требуется подходящий инструментарий. Пользователи присылают сообщения об обнаруженных ошибках в специальном формате, которые становятся доступны через WWW-архивы и электронную почту. Для дополнительной информации о ведении журнала ошибок см. <ref id="buglogs">.

source: The Debian Policy:
it: La Debian Policy:
ru: Политика Debian

source: Debian has an extensive specification of our standards of quality, the Debian Policy. This document defines the qualities and standards to which we hold Debian packages.
it: Debian ha un'esauriente specifica dei propri standard di qualità, la Debian Policy. Questo documento definisce la qualità e gli standard che sono richiesti ai pacchetti Debian.
ru: В Debian есть всестороннее описание стандартов качества &mdash; политика Debian (Debian Policy). Этот документ определяет качества и стандарты, согласно которым мы разрабатываем пакеты Debian.

source: For additional information about this, please see our web page about <url id="http://www.debian.org/intro/why_debian" name="reasons to choose Debian">.
it: Per ulteriori informazioni su questo, si veda la pagina web sulle <url id="http://www.debian.org/intro/why_debian" name="ragioni per scegliere Debian">.
ru: Дополнительную информацию об этом можно найти на странице <url id="http://www.debian.org/intro/why_debian" name="причин выбора Debian">.

source: How does the Debian project fit in or compare with the Free Software Foundation's GNU project?
it: Come si rapporta il progetto Debian con il progetto GNU della Free Software Foundation?
ru: Как соотносятся проект Debian и проект GNU Free Software Foundation?

source: The Debian system builds on the ideals of free software first championed by the <url id="http://www.gnu.org/" name="Free Software Foundation"> and in particular by <url id="http://www.stallman.org/" name="Richard Stallman">. FSF's powerful system development tools, utilities, and applications are also a key part of the Debian system.
it: Il sistema Debian è costruito sugli ideali del software libero fortemente sostenuto in origine dalla <url id="http://www.gnu.org/" name="Free Software Foundation"> ed in particolare da <url id="http://www.stallman.org/" name="Richard Stallman">. I potenti strumenti, utilità e applicazioni per lo sviluppo del sistema della FSF rappresentano anche una parte chiave del sistema Debian.
ru: Система Debian построена на идеалах свободного ПО, впервые выдвинутых <url id="http://www.gnu.org/" name="Free Software Foundation"> и, в частности, <url id="http://www.stallman.org/" name="Ричардом Столлманом (Richard Stallman)">. Мощные средства системной разработки, утилиты и приложения FSF также являются ключевой частью системы Debian.

source: The Debian Project is a separate entity from the FSF, however we communicate regularly and cooperate on various projects. The FSF explicitly requested that we call our system "&debian;", and we are happy to comply with that request.
it: Il Progetto Debian è un'entità separata dalla FSF, comunque i due comunicano regolarmente e cooperano su vari progetti. La FSF ha richiesto esplicitamente che il nostro sistema venisse chiamato "&debian;" e siamo felici di soddisfare questa richiesta.
ru: Проект Debian не является частью FSF, однако мы регулярно общаемся и совместно работаем над различными проектами. FSF попросила, чтобы мы называли нашу систему «&debian;», и мы счастливы были выполнить их просьбу.

source: The FSF's long-standing objective is to develop a new operating system called GNU, based on <url id="http://www.gnu.org/software/hurd/" name="Hurd">. Debian is working with FSF on this system, called <url id="http://www.debian.org/ports/hurd/" name="Debian GNU/Hurd">.
it: L'obiettivo di sempre della FSF è stato quello di sviluppare un nuovo sistema operativo chiamato GNU basato su <url id="http://www.gnu.org/software/hurd/" name="Hurd">. Debian sta lavorando con la FSF su questo sistema, chiamato <url id="http://www.debian.org/ports/hurd/" name="Debian GNU/Hurd">.
ru: Давняя цель FSF &mdash; разработка новой операционной системы, называемой GNU, на основе ядра <url id="http://www.gnu.org/software/hurd/" name="Hurd">. Debian работает вместе с FSF над этой системой, называемой <url id="http://www.debian.org/ports/hurd/" name="Debian GNU/Hurd">.

source: How does one pronounce Debian and what does this word mean?
it: Come si pronuncia Debian e cosa significa questa parola?
ru: Как произносится слово Debian и что оно означает?

source: The project name is pronounced Deb'-ee-en, with a short e in Deb, and emphasis on the first syllable. This word is a contraction of the names of Debra and Ian Murdock, who founded the project. (Dictionaries seem to offer some ambiguity in the pronunciation of Ian (!), but Ian prefers ee'-en.)
it: Il nome del progetto si pronuncia Deb'-i-en, con una e breve in Deb e con l'accento sulla prima sillaba. Questa parola è la contrazione dei nomi di Debra e Ian Murdock, che fondarono il progetto.(I dizionari sembrano essere ambigui sulla pronuncia di Ian (!), ma Ian preferisce i'-en.)
ru: Имя проекта произносится как Дебиан, с коротким е и ударением на первом слоге. Это слово образовано из имён Debra и Ian Murdock, которые основали проект. (Кажется, словари дают несколько двусмысленную транскрипцию слова Ian (!), но Ян предпочитает транскрипцию ee'-en.)

source: Getting and installing &debian;
it: Ottenere e installare &debian;
ru: Получение и установка &debian;

source: The official document giving installation instructions is the <url id="http://www.debian.org/releases/stable/installmanual" name="Debian GNU/Linux Installation Guide">. We'll give some additional notes about getting and installing &debian; here.
it: La documentazione ufficiale con le istruzioni per l'installazione è la <url id="http://www.debian.org/releases/stable/installmanual" name="Guida all'installazione di Debian GNU/Linux">. Qui vengono fornite alcune note aggiuntive su come ottenere ed installare &debian;.
ru: Официальным документом с инструкциями по установке является <url id="http://www.debian.org/releases/stable/installmanual" name="руководство по установке Debian GNU/Linux">. Здесь мы представим дополнительную информацию о получении и установке &debian;.

source: What is the latest version of Debian?
it: Qual è la versione più recente di Debian?
ru: Какая версия Debian является последней?

source: Currently there are three versions of &debian;:
it: Attualmente ci sono tre versioni di &debian;:
ru: В настоящее время существует три версии &debian;:

source: <em>release &release;, a.k.a. the `stable' distribution or &releasename;</em>
it: <em>il rilascio &release;, alias la distribuzione "stabile" o &releasename;</em>
ru: <em>выпуск &release;, также известен как «стабильный (stable)» дистрибутив или &releasename;</em>

source: This is stable and well tested software, it changes if major security or usability fixes are incorporated.
it: Questo è software stabile e ben testato, cambia se vengono incorporate soluzioni importanti a problemi di sicurezza e usabilità.
ru: Это стабильное и хорошо протестированное ПО, которое изменяется, если в него включаются существенные исправления, касающиеся безопасности или удобства использования.

source: <em>the `testing' distribution, currently called &testingreleasename;</em>
it: <em>la distribuzione "testing", attualmente chiamata &testingreleasename;</em>
ru: <em>«тестируемый» (testing) дистрибутив, в настоящий момент называется &testingreleasename;</em>

source: This is where packages that will be released as the next `stable' are placed; they've had some testing in unstable but they may not be completely fit for release yet. This distribution is updated more often than `stable', but not more often than `unstable'.
it: Qui è dove vengono messi i pacchetti che saranno rilasciati come prossima "stable"; sono stati testati un po' in unstable ma possono non essere ancora completamente adatti ad essere rilasciati. Questa distribuzione è aggiornata più frequentemente della "stable", ma non della "unstable".
ru: Он включает пакеты, которые войдут в следующую «стабильную» версию; эти пакеты прошли некоторое тестирование в нестабильной версии, но для выпуска пока не готовы. Данная версия обновляется намного чаще, чем «стабильная», но не так часто, как «нестабильная».

source: <em>the `unstable' distribution</em>
it: <em>la distribuzione "unstable"</em>
ru: <em>нестабильный дистрибутив</em>

source: This is the version currently under development; it is updated continuously. You can retrieve packages from the `unstable' archive on any Debian FTP site and use them to upgrade your system at any time, but you may not expect the system to be as usable or as stable as before - that's why it's called `<strong>unstable</strong>'!
it: Questa è la versione attualmente in fase di sviluppo; è aggiornata continuamente. Si possono recuperare i pacchetti dall'archivio "unstable" su ogni sito FTP Debian e usarli per aggiornare il proprio sistema in ogni momento, ma non bisogna aspettarsi che il sistema sia utilizzabile o stabile come prima: ecco perché è chiamata "<strong>unstable</strong> (instabile)"!
ru: Это разрабатываемая версия дистрибутива, она непрерывно обновляется. Вы можете получить пакеты из архива «нестабильной» версии с любого FTP-сервера Debian и использовать их для обновления своей системы в любое время, но не ждите, что система останется стабильной как прежде &mdash; эта версия всё же называется «<strong>нестабильной</strong>»!

source: Please see <ref id="dists"> for more information.
it: Si veda <ref id="dists"> per maggiori informazioni.
ru: Более подробную информацию смотрите в <ref id="dists">.

source: Are there package upgrades in `stable'?
it: Esistono aggiornamenti dei pacchetti in "stable"?
ru: Обновляются ли пакеты в «stable»?

source: No new functionality is added to the stable release. Once a Debian version is released and tagged `stable' it will only get security updates. That is, only packages for which a security vulnerability has been found after the release will be upgraded. All the security updates are served through <url id="ftp://security.debian.org" name="security.debian.org">.
it: Nessuna nuova funzionalità viene aggiunta al rilascio stabile. Una volta che una versione di Debian viene rilasciata ed etichettata come "stable", avrà solo gli aggiornamenti di sicurezza. Cioè saranno aggiornati solo i pacchetti in cui è stata trovata dopo il rilascio una vulnerabilità in termini di sicurezza. Tutti gli aggiornamenti di sicurezza vengono forniti attraverso <url id="ftp://security.debian.org" name="security.debian.org">.
ru: В стабильный выпуск новые возможности не добавляются. После того как версия Debian была выпущена и помечена как «стабильная», в неё поступают только обновления безопасности. То есть обновления получат только те пакеты, в которых была найдена какая-то уязвимость. Все обновления безопасности поступают с <url id="ftp://security.debian.org" name="security.debian.org">.

source: Security updates serve one purpose: to supply a fix for a security vulnerability. They are not a method for sneaking additional changes into the stable release without going through normal point release procedure. Consequently, fixes for packages with security issues will not upgrade the software. The Debian Security Team will backport the necessary fixes to the version of the software distributed in `stable' instead.
it: Gli aggiornamenti di sicurezza servono ad un solo scopo: fornire soluzioni per vulnerabilità nella sicurezza. Non sono un metodo per infiltrare cambiamenti ulteriori nel rilascio stabile senza passare dalla normale procedura dei rilasci minori. Di conseguenza, le soluzioni per i pacchetti con problemi di sicurezza non aggiornano il software. Il Team per la sicurezza di Debian farà invece il backport delle soluzioni necessarie nella versione del software distribuita in "stable".
ru: Обновления безопасности служат одной цели: исправить уязвимость. Это не какой-то хитрый способ протащить изменения в стабильный выпуск в обход обычной процедуры выпуска. Поэтому исправление проблем безопасности в пакетах не приводит к обновлению ПО. Команда безопасности Debian переносит изменения для исправления уязвимости именно в ту версию, которая входит в «стабильный» выпуск.

source: For more information related to security support please read the <url id="http://www.debian.org/security/faq" name="Security FAQ"> or the <url id="http://www.debian.org/doc/manuals/securing-debian-howto/" name="Debian Security Manual">.
it: Per maggiori informazioni sul supporto per la sicurezza si legga la <url id="http://www.debian.org/security/faq" name="Security FAQ"> o il <url id="http://www.debian.org/doc/manuals/securing-debian-howto/" name="Debian Security Manual">.
ru: Более полная информация о поддержке безопасности дана в <url id="http://www.debian.org/security/faq" name="ЧаВо по безопасности в Debian"> или в <url id="http://www.debian.org/doc/manuals/securing-debian-howto/" name="руководстве по безопасности Debian">.

source: Where/how can I get the Debian installation disks?
it: Dove/Come si possono ottenere i dischi di installazione di Debian?
ru: Где и как получить установочные диски Debian?

source: You can get the installation disks by downloading the appropriate files from one of the <url id="http://www.debian.org/mirror/list" name="Debian mirrors">.
it: Si possono ottenere i dischi d'installazione scaricando i file appropriati da uno dei<url id="http://www.debian.org/mirror/list" name="mirror Debian">.
ru: Вы можете получить установочные диски, просто скачав соответствующие файлы с одного из <url id="http://www.debian.org/mirror/list" name="серверов-зеркал Debian">.

source: Please refer to <url id="http://www.debian.org/CD" name="Debian GNU/Linux on CDs"> for more information about CD (and DVD) images.
it: Per maggiori informazioni su immagini di CD (e DVD) si faccia riferimento a <url id="http://www.debian.org/CD" name="Debian GNU/Linux su CD">.
ru: Более подробная информация об образах CD (и DVD) представлена на странице <url id="http://www.debian.org/CD" name="Debian GNU/Linux на компакт-дисках">.

source: How do I install the Debian from CD-ROMs?
it: Come si installa Debian da CD-ROM?
ru: Как установить Debian с компакт-дисков?

source: Installing Debian from CD is straightforward: configure your system for booting off a CD, insert your CD, and reboot. Your system will now be running the Debian Installer. See the <url id="http://www.debian.org/releases/stable/installmanual" name="Debian GNU/Linux Installation Guide"> for more information.
it: Installare Debian da CD è semplicissimo: configurare il proprio sistema in modo che si avvii da CD, inserire il CD e riavviare. Il sistema avrà allora in esecuzione l'installatore Debian. Per maggiori informazioni si veda la <url id="http://www.debian.org/releases/stable/installmanual" name="Guida all'installazione di Debian GNU/Linux">.
ru: Установка Debian с CD проста: настройте систему на загрузку с CD, вставьте CD и перезагрузитесь. Ваш компьютер запустит программу установки Debian. Её описание можно найти в <url id="http://www.debian.org/releases/stable/installmanual" name="руководстве по установке Debian GNU/Linux">.

source: Why does the official stable released CD-ROM contain symlinks for `frozen' and `unstable'? I thought this CD contains just `stable'!
it: Perché il CD-ROM ufficiale del rilascio "stable" contiene collegamenti simbolici "frozen" e "unstable"? Questo CD doveva contenere solo "stable"!
ru: Зачем на CD официального стабильного дистрибутива нужны символьные ссылки «frozen» и «unstable»? Я думал, что на этих CD только стабильный дистрибутив!

source: Official Debian CD images indeed contain symlinks like:
it: Le immagini dei CD ufficiali di Debian contengono effettivamente collegamenti simbolici quali:
ru: На официальных образах Debian CD действительно есть символьные ссылки

source: so that they work when your sources.list has an entry like
it: in modo da poter funzionare quando il file sources.list ha voci come
ru: Они нужны для того, чтобы эти диски работали, если в sources.list есть запись типа

source: deb cdrom:[&lt;name as on cd label&gt;]/ unstable main [...]
it: deb cdrom:[&lt;nome come sulla etichetta del CD&gt;]/ unstable main [...]
ru: deb cdrom:[&lt;имя как на метке cd&gt;]/ unstable main […]

source: The fact these symlinks are present does <em>not</em> mean the image is `unstable' or `testing' or anything. Read the CD label in <file>/.disk/info</file> to find out which Debian version it contains. This information is also present in <file>/README.txt</file> on the CD.
it: Il fatto che siano presenti questi collegamenti simbolici <em>non</em> significa che l'immagine è di "unstable" o "testing" o altro. Si legga l'etichetta del CD in <file>/.disk/info</file> per scoprire quale versione di Debian esso contenga. Questa informazione è presente anche nel file <file>/README.txt</file> sul CD.
ru: Наличие этих символьных ссылок вовсе <em>не</em> означает, что это «нестабильный», «тестируемый» или какой-то другой дистрибутив. Чтобы узнать, какой дистрибутив Debian на нём записан, прочтите метку CD-диска в файле <file>/.disk/info</file>. Эта информация есть и на CD в файле <file>/README.txt</file>.

source: Read <url id="http://www.debian.org/releases/"> to find out what the current `stable' and `testing' releases are.
it: Si legga <url id="http://www.debian.org/releases/"> per scoprire quali siano gli attuali rilasci "stable" e "testig".
ru: О том, какой дистрибутив сейчас считается стабильным, а какой тестируемым, можно узнать <url id="http://www.debian.org/releases/" name="здесь">.

source: Can I get and install Debian directly from a remote Internet site?
it: È possibile ottenere e installare Debian direttamente da un sito Internet remoto?
ru: Можно ли установить Debian прямо с Интернет-сайта?

source: Yes. You can boot the Debian installation system from a set of files you can download from our FTP site and its mirrors.
it: Sì. Si può avviare il sistema di installazione Debian da un insieme di file scaricabili dal nostro sito FTP e dai suoi mirror.
ru: Да. Вы можете загрузить систему установки Debian с помощью набора файлов, которые можно скачать с нашего FTP-сервера и его зеркал.

source: You can download a small CD image file, create a bootable CD from it, install the basic system from it and the rest over the network. For more information please see <url id="http://www.debian.org/CD/netinst/">.
it: Si può scaricare una piccola immagine di CD, creare da essa un CD avviabile, installare il sistema di base con esso ed il resto dalla rete. Per maggiori informazioni si veda <url id="http://www.debian.org/CD/netinst/">.
ru: Можно скачать маленький файл CD-образа, создать из него загрузочный CD, установить с него базовую систему, а оставшуюся часть установить из сети. Подробней об этом написано <url id="http://www.debian.org/CD/netinst/" name="здесь">.

source: You can also download even smaller floppy disk image files, create bootable diskettes from them, start the installation procedure and get the rest of Debian over the network.
it: Si possono anche scaricare dei file immagine di floppy disk ancora più piccoli, creare da essi dei dischetti avviabili, avviare la procedura di installazione ed ottenere il resto di Debian dalla rete.
ru: Можно также скачать файлы образов дискет ещё меньшего размера, создать загрузочные дискеты, запустить процедуру установки и получить оставшуюся часть Debian из сети.

source: Are there any alternative strategies for booting the system installer?
it: Esistono strategie alternative per avviare l'installatore di sistema?
ru: Есть ли другие способы запуска программы установки системы?
