Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: If you install the <package>apt-file</package>, similar to the above, it searches files which contain the substring or regular expression <tt>foo</tt> in their full path names. The advantage over the sample above is that there is no need to retrieve the <tt>Contents-ARCH.gz</tt> files as it will do this automatically for all the sources defined in <file>/etc/apt/sources.list</file> when you run (as root) <tt>apt-file update</tt>.
it: Se si installa il pacchetto <package>apt-file</package>, simile al precedente, esso cerca i file che contengono nel loro nome di percorso completo la sottostringa o l'espressione regolare <tt>pippo</tt>. Il vantaggio rispetto all'esempio precedente è che non c'è bisogno di recuperare i file <tt>Contents-ARCH.gz</tt> dato che ciò viene fatto automaticamente per tutti le fonti definite in <file>/etc/apt/sources.list</file> quando viene eseguito (come root) <tt>apt-file update</tt>.
ru: Если вы установите пакет <package>apt-file</package>, то приведённая выше команда выполнит поиск файлов, которые содержат подстроку или регулярное выражение <tt>foo</tt> в своих полных путях. Преимущество этой команды над данными ранее в том, что вам не нужно получать файлы <tt>Contents-ARCH.gz</tt>, так как это будет сделано автоматически для всех источников, описанных в <file>/etc/apt/sources.list</file>, при запуске (с правами суперпользователя) команды <tt>apt-file update</tt>.

source: Why doesn't get `foo-data' removed when I uninstall `foo'? How do I make sure old unused library-packages get purged?
it: Perchè "pippo-data" non viene rimosso quando viene disinstallato "pippo"? Come ci si può assicurare che vengano eliminati i vecchi pacchetti di librerie non utilizzati?
ru: Почему не удаляется «foo-data» при удалении «foo»? Как вычистить старые неиспользуемые пакеты с библиотеками?

source: Some packages are split in program (`foo') and data (`foo-data') (or in `foo' and `foo-doc'). This is true for many games, multimedia applications and dictionaries in Debian and has been introduced since some users might want to access the raw data without installing the program or because the program can be run without the data itself, making it optional.
it: Alcuni pacchetti sono suddivisi nel programma ("pippo") e nei dati ("pippo-data") (o in "pippo" e "pippo-doc"). Questo sistema vale in Debian per molti giochi, applicazioni multimediali e dizionari ed è stato introdotto dato che alcuni utenti possono voler accedere ai dati grezzi senza installare il programma o perché il programma può essere eseguito senza i dati rendendoli così opzionali.
ru: Некоторые пакеты разделены на программы («foo») и данные («foo-data») (или на «foo» и «foo-doc»). Так в Debian сделано для многих игр, приложений мультимедиа и словарей, и объясняется тем, что некоторые пользователи могут хотеть иметь только данные без установленных программ, или программы могут работать без данных, что делает их необязательными к установке.

source: Similar situations occur when dealing with libraries: generally these get installed since packages containing applications depend on them. When the application-package is purged, the library-package might stay on the system. Or: when the application-package no longer depends upon e.g. libdb4.2, but upon libdb4.3, the libdb4.2 package might stay when the application-package is upgraded.
it: Situazioni simili si verificano quando si ha a che fare con le librerie: generalmente vengono installate dato che i pacchetti che contengono applicazioni dipendono da esse. Quando il pacchetto dell'applicazione viene completamente eliminato, il pacchetto di libreria può rimanere sul sitema. Oppure, quando il pacchetto dell'applicazione non dipende più da libdb4.2, ad esempio, ma da libdb4.3, il pacchetto libdb4.2 può rimanere quando il pacchetto dell'applicazione viene aggiornato.
ru: Подобное относится и к библиотекам: обычно они устанавливаются, так как пакеты с приложениями зависят от них. Когда пакет с приложением вычищается, пакет с библиотекой может остаться в системе. Или когда пакет с приложением больше не зависит от, например, libdb4.2, а зависит от libdb4.3, то пакет libdb4.2 может остаться в системе при обновлении пакета с приложением.

source: In these cases, `foo-data' doesn't depend on `foo', so when you remove the `foo' package it will not get automatically removed by most package management tools. The same holds true for the library packages. This is necessary to avoid circular dependencies. If you use <prgn>aptitude</prgn> (see <ref id="aptitude">) as your package management tool it will, however, track automatically installed packages and remove them when no packages remain that need them in your system.
it: In questi casi, "pippo-data" non dipende da "pippo", perciò la maggior parte degli strumenti di gestione dei pacchetti non lo rimuove automaticamente quando viene rimosso il pacchetto "pippo". La stessa cosa si verifica per i pacchetti di libreria. Ciò è necessario per evitare dipendenze cicliche. Se però si usa <prgn>aptitude</prgn> (si veda <ref id="aptitude">) come strumento di gestione dei pacchetti, esso tiene traccia automaticamente dei pacchetti installati e li rimuove quando sul sistema non rimane alcun pacchetto che ne abbia bisogno.
ru: В этих случаях «foo-data» не зависит от «foo», поэтому при удалении пакета «foo», он не будет автоматически удалён большинством инструментов управления пакетами. Это же относится и к пакетам с библиотеками. Это необходимо для избежания циклических зависимостей. Если вы используете <prgn>aptitude</prgn> (см. <ref id="aptitude">) для управления пакетами, то он, однако, отслеживает автоматически устанавливаемые пакеты и удаляет их, когда в системе не остаётся пакетов, от них зависящих.

source: Keeping your Debian system up-to-date
it: Mantenere il sistema Debian aggiornato
ru: Поддержание обновлений системы Debian

source: A Debian goal is to provide a consistent upgrade path and a secure upgrade process. We always do our best to make upgrading to new releases a smooth procedure. In case there's some important note to add to the upgrade process, the packages will alert the user, and often provide a solution to a possible problem.
it: Uno degli scopi di Debian è quello di fornire un coerente percorso di aggiornamento ed un sicuro processo di aggiornamento. Viene sempre fatto tutto il possibile per rendere semplice l'aggiornamento a nuovi rilasci. Nel caso ci siano note importanti da aggiungere al processo di aggiornamento, i pacchetti avvisano l'utente e spesso forniscono una soluzione ad un possibile problema.
ru: Одной из целей Debian является предоставление процесса согласованных и безопасных обновлений. Мы всегда стараемся как можно больше сгладить переход со старых версий на новые. Если появляются какие-то важные замечания во время процесса обновления, то пакет уведомляет пользователя, и часто предлагает решение возможных проблем.

source: You should also read the Release Notes document that describes the details of specific upgrades. It is available on the Debian website at <url id="http://www.debian.org/releases/stable/releasenotes"> and is also shipped on the Debian CDs, DVDs and Blu-Ray discs
it: Si dovrebbero inoltre leggere le Note di rilascio (Release Notes), documento che descrive i dettagli degli specifici aggiornamenti. È disponibile sul sito web Debian all'indirizzo <url id="http://www.debian.org/releases/stable/releasenotes"> e viene anche fornito sui CD, DVD e dischi Blu-Ray Debian.
ru: Вы также должны прочитать информацию о выпуске &mdash; документ, описывающий детали некоторых обновлений. Он имеется на сайте Debian <url id="http://www.debian.org/releases/stable/releasenotes">, а также на Debian CD, DVD и дисках Blu-Ray.

source: How can I keep my Debian system current?
it: Come si può mantenere il proprio sistema Debian aggiornato?
ru: Как поддерживать систему Debian в актуальном состоянии?

source: One could simply execute an anonymous ftp call to a Debian archive, then peruse the directories until one finds the desired file, and then fetch it, and finally install it using <tt>dpkg</tt>. Note that <tt>dpkg</tt> will install upgrade files in place, even on a running system. Sometimes, a revised package will require the installation of a newly revised version of another package, in which case the installation will fail until/unless the other package is installed.
it: Si può eseguire semplicemente un ftp anonimo ad un archivio Debian, poi esplorare le directory fino a quando si trova il file desiderato, scaricarlo e finalmente installarlo usando <tt>dpkg</tt>. Si noti che <tt>dpkg</tt> installa i file aggiornati al volo, anche su un sistema in esecuzione. Qualche volta, un pacchetto revisionato richiede l'installazione di una rinnovata versione di un altro pacchetto, in questo caso l'installazione fallisce fino a quando/a meno che l'altro pacchetto non venga installato.
ru: Можно просто подключиться к анонимному ftp с архивом Debian, затем внимательно просмотреть каталоги, пока не будет найден желаемый файл, а затем скачать и установить его с помощью <tt>dpkg</tt>. Заметим, что <tt>dpkg</tt> установит обновлённые файлы даже при работающей системе. Иногда, обновляемый пакет может потребовать установки новой версии другого пакета, в этом случае установка прерывается, пока не будет установлен нужный пакет.

source: Many people find this approach much too time-consuming, since Debian evolves so quickly -- typically, a dozen or more new packages are uploaded every week. This number is larger just before a new major release. To deal with this avalanche, many people prefer to use a more automated method. Several different packages are available for this purpose:
it: Molte persone trovano questo approccio troppo dispendioso in termini di tempo, dato che Debian si evolve molto rapidamente: tipicamente, sono caricati ogni settimana una dozzina o più di nuovi pacchetti. Questo numero aumenta appena prima di un nuovo rilascio principale. Per gestire questa valanga, molte persone preferiscono usare un metodo più automatico. Sono disponibili diversi pacchetti a questo scopo:
ru: Многие люди сочтут предлагаемый способ отнимающим много времени, т.к. Debian развивается слишком быстро &mdash; обычно, каждую неделю обновляется где-то дюжина и более пакетов. Это число увеличивается по мере приближения в новому основному выпуску. Чтобы справиться с такой лавиной, многие люди предпочитают использовать более автоматизированный способ. Для этих целей существует несколько различных пакетов.

source: APT is an advanced interface to the Debian packaging system. It features complete installation ordering, multiple source capability and several other unique features, see the User's Guide in <tt>/usr/share/doc/apt-doc/guide.html/index.html</tt> (you will have to install the <tt>apt-doc</tt> package).
it: APT è un'interfaccia avanzata per il sistema di gestione dei pacchetti di Debian. Ha un completo sistema di ordinamento delle installazioni, capacità di gestire più fonti e molte altre funzionalità uniche; si veda la Guida utente in <tt>/usr/share/doc/apt-doc/guide.html/index.html</tt> (è necessario installare il pacchetto <tt>apt-doc</tt>).
ru: APT &mdash; это усовершенствованный интерфейс к системе управления пакетами Debian. Он устанавливает пакеты в нужном порядке, может получать их из нескольких источников и имеет другие уникальные возможности, см. руководство пользователя <tt>/usr/share/doc/apt-doc/guide.html/index.html</tt> (нужно установить пакет <tt>apt-doc</tt>).

source: <prgn>aptitude</prgn> is the recommended package manager for &debian; systems. It is a text-based interface to APT using the curses library, and can be used to perform management tasks in a fast and easy way.
it: <prgn>aptitude</prgn> è il gestore di pacchetti raccomandato per i sistemi &debian;. È un'interfaccia testuale ad APT che usa la libreria curses e che può essere usata per eseguire compiti di gestione in modo veloce e semplice.
ru: <prgn>aptitude</prgn> является рекомендуемым средством управления пакетами в системах &debian;. Он представляет собой текстовый интерфейс к APT на основе библиотеки curses, и позволяет выполнять задачи управления легко и быстро.

source: Before you can use <prgn>aptitude</prgn>, you'll have to edit the <tt>/etc/apt/sources.list</tt> file to set it up. If you wish to upgrade to the latest stable version of Debian, you'll probably want to use a source like this one:
it: Prima di poter usare <prgn>aptitude</prgn>, è necessario modificare il file <tt>/etc/apt/sources.list</tt> per configurarlo. Se si desidera aggiornare all'ultima versione stabile di Debian, probabilmente si vorrà usare una fonte simile a quella seguente:
ru: Перед тем как использовать <prgn>aptitude</prgn>, вам нужно отредактировать файл <tt>/etc/apt/sources.list</tt>. Если вы хотите выполнить обновление до последней стабильной версии Debian, то, вероятно, будете использовать, например, такой источник пакетов:

source: You can replace ftp.us.debian.org with the name of a faster Debian mirror near you. See the mirror list at <url id="http://www.debian.org/mirror/list"> for more information.
it: Si può sostituire ftp.us.debian.org con il nome di un mirror Debian più veloce e più vicino. Per maggiori informazioni si veda l'elenco dei mirror su <url id="http://www.debian.org/mirror/list">.
ru: Вы можете заменить ftp.us.debian.org на более быстрый и близкий к вам сервер-зеркало Debian. Список зеркал можно найти <url id="http://www.debian.org/mirror/list" name="здесь">.

source: More details on this can be found in the <manref section="8" name="sources.list"> manual page.
it: Ulteriori dettagli a questo proposito possono essere trovati nella pagina di manuale di <manref section="8" name="sources.list">.
ru: Более подробно об этом можно прочитать в справочной странице <manref section="8" name="sources.list">.

source: To update your system, run
it: Per aggiornare il proprio sistema, eseguire
ru: Для обновления списка запустите

source: followed by
it: seguito da
ru: а после

source: Answer any questions that might come up, and your system will be upgraded. See also <ref id="aptitude">.
it: Rispondere a tutte le domande eventualmente poste e il sistema sarà aggiornato. Vedere anche <ref id="aptitude">.
ru: Ответьте на все возникающие вопросы, и система будет обновлена. См. также <ref id="aptitude">.

source: apt-get, dselect and apt-cdrom
it: apt-get, dselect e apt-cdrom
ru: apt-get, dselect и apt-cdrom

source: <prgn>apt-get</prgn> is an APT-based command-line tool for handling packages, and the APT dselect method is an interface to APT through <prgn>dselect</prgn>. Both of these provide a simple, safe way to install and upgrade packages.
it: <prgn>apt-get</prgn> è uno strumento a riga di comando basato su APT per gestire i pacchetti, ed il metodo APT di dselect è un'interfaccia ad APT attraverso <prgn>dselect</prgn>. Entrambi forniscono un metodo semplice e sicuro per installare ed aggiornare pacchetti.
ru: <prgn>apt-get</prgn> &mdash; это утилита командной строки к APT для управления пакетами, а метод APT dselect &mdash; это интерфейс к APT через <prgn>dselect</prgn>. Они предоставляют простой, безопасный путь установки и обновления пакетов.

source: To use <prgn>apt-get</prgn>, install the <package>apt</package> package, and edit the <tt>/etc/apt/sources.list</tt> file to set it up, just as for <ref id="aptitude-upgrade">.
it: Per usare <prgn>apt-get</prgn>, installare il pacchetto <package>apt</package> e modificare il file <tt>/etc/apt/sources.list</tt> per configurarlo, proprio come per <ref id="aptitude-upgrade">.
ru: Чтобы использовать <prgn>apt-get</prgn>, установите пакет <package>apt</package> и отредактируйте файл <tt>/etc/apt/sources.list</tt> (см. <ref id="aptitude-upgrade">).

source: Then run
it: Poi eseguire
ru: Затем выполните

source: Answer any questions that might come up, and your system will be upgraded. See also the <manref section="8" name="apt-get"> manual page, as well as <ref id="apt-get">.
it: Rispondere a tutte le domande eventualmente poste e il sistema sarà aggiornato. Vedere anche la pagina di manuale di <manref section="8" name="apt-get">, oltre a <ref id="apt-get">.
ru: Ответьте на все возникающие вопросы, и система будет обновлена. Посмотрите справочную страницу <manref section="8" name="apt-get">, а также <ref id="apt-get">.

source: To use APT with <prgn>dselect</prgn>, choose the APT access method in dselect's method selection screen (option 0) and then specify the sources that should be used. The configuration file is <file>/etc/apt/sources.list</file>. See also <ref id="dselect">.
it: Per usare APT con <prgn>dselect</prgn>, scegliere il metodo di accesso APT nella schermata di selezione dei metodi di dselect (opzione 0) e poi specificare le fonti da usare. Il file di configurazione è <file>/etc/apt/sources.list</file>. Vedere anche <ref id="dselect">.
ru: Чтобы использовать APT в <prgn>dselect</prgn>, выберите метод доступа APT в выборе методов dselect (пункт 0), а затем укажите источники, которые нужно использовать. Файлом настройки является <file>/etc/apt/sources.list</file>. См. также <ref id="dselect">.

source: If you want to use CDs to install packages, you can use <prgn>apt-cdrom</prgn>. For details, please see the Release Notes, section "Setting up for an upgrade from a local mirror".
it: Se si vogliono usare dei CD per installare i pacchetti, si può usare <prgn>apt-cdrom</prgn>. Per dettagli, vedere nelle Note di rilascio (Release Notes) la sezione sull'impostazione di un aggiornamento da un mirror locale.
ru: Если для установки пакетов вы хотите использовать CD-диски, то можете воспользоваться <prgn>apt-cdrom</prgn>. Подробней об этом написано в информации о выпуске, в разделе про подготовку к обновлению с локального зеркала.

source: Please note that when you get and install the packages, you'll still have them kept in your /var directory hierarchy. To keep your partition from overflowing, remember to delete extra files using <tt>apt-get clean</tt> and <tt>apt-get autoclean</tt>, or to move them someplace else (hint: use <package>apt-move</package>).
it: Notare che quando si ottengono e si installano i pacchetti, li si ha ancora nella gerarchia di directory in /var. Per evitare che la propria partizione strabordi, ricordarsi di eliminare i file in più usando <tt>apt-get clean</tt> e <tt>apt-get autoclean</tt>, oppure di spostarli in qualche altro posto (consiglio: si usi <package>apt-move</package>).
ru: Заметим, что когда вы получаете и устанавливаете пакеты, эти файлы остаются храниться в одном из подкаталогов /var. Чтобы не истратить всё свободное место раздела, не забывайте удалять лишние файлы с помощью команд <tt>apt-get clean</tt> и <tt>apt-get autoclean</tt>, или перемещать в другое место (подсказка: воспользуйтесь <package>apt-move</package>).

source: <prgn>aptitude</prgn> is a text-based interface to the Debian package system. It allows the user to view the list of packages and to perform package management tasks such as installing, upgrading, and removing packages (see <ref id="aptitude">). Actions may be performed from a visual interface or from the command-line.
it: <prgn>aptitude</prgn> è un'interfaccia testuale al sistema di gestione dei pacchetti di Debian. Permette all'utente di visualizzare l'elenco dei pacchetti e di eseguire compiti di gestione dei pacchetti come installazioni, aggiornamenti e rimozioni (si veda <ref id="aptitude">). Le azioni possono essere effettuate da un'interfaccia visuale o dalla riga di comando.
ru: <prgn>aptitude</prgn> &mdash; это пакетный менеджер с текстовым интерфейсом для систем Debian. Он позволяет пользователям просматривать список пакетов и выполнять задачи управления, например, установку, обновление и удаление пакетов (см. <ref id="aptitude">). Действия могут выполняться через текстовую оболочку или из командной строки.

source: In command line, the actions are similar to that of APT, so to upgrade your system run
it: Nella riga di comando le azioni sono simili a quelle di APT, perciò per aggiornare il proprio sistema eseguire
ru: В командной строке параметры похожи на используемые в APT, поэтому для обновления системы выполните

source: Note that <prgn>aptitude</prgn> is not the recommended tool for doing upgrades from one &debian; release to another. For upgrades between releases you should read the <url id="http://www.debian.org/releases/stable/releasenotes" name="Release Notes">. This document describes in detail the recommended steps for upgrades from previous releases as well as known issues you should consider before upgrading.
it: Notare che <prgn>aptitude</prgn> non è lo strumento raccomandato per aggiornare da un rilascio di &debian; ad un altro. Per gli aggiornamenti tra i rilasci si dovrebbero leggere le <url id="http://www.debian.org/releases/stable/releasenotes" name="Note di rilascio">. Tale documento descrive in dettaglio i passi raccomandati per aggiornare da rilasci precedenti, così come problemi conosciuti che devono essere presi in considerazione prima dell'aggiornamento.
ru: Заметим, что <prgn>aptitude</prgn> не является рекомендуемым инструментом для обновления с одного выпуска &debian; до другого. О том, как выполнять обновление, читайте <url id="http://www.debian.org/releases/stable/releasenotes" name="замечания к выпуску">. В этом документе подробно описаны рекомендуемые шаги обновления с предыдущих выпусков, а также известные проблемы, которые нужно учесть до обновления.

source: For details, see the manual page <manref section="8" name="aptitude">, and the file <file>/usr/share/aptitude/README</file>
it: Per i dettagli, vedere la pagina di manuale <manref section="8" name="aptitude"> e il file <file>/usr/share/aptitude/README</file>.
ru: Дополнительная информация приведена в справочной странице <manref section="8" name="aptitude"> и файле <file>/usr/share/aptitude/README</file>.

source: This Perl script, and its (optional) manager program called <prgn>mirror-master</prgn>, can be used to fetch user-specified parts of a directory tree from a specified host <em>via</em> anonymous FTP.
it: Questo script in Perl, e il suo (opzionale) programma di gestione chiamato <prgn>mirror-master</prgn>, può essere usato per prelevare parti di alberi di directory specificate dall'utente da uno specifico host <em>via</em> FTP anonimo.
ru: Данный сценарий на Perl и его (необязательная) программа управления, называемая <prgn>mirror-master</prgn>, может использоваться для выборки указанной пользователем части дерева каталога с заданного узла <em>посредством</em> анонимного FTP.

source: <prgn>mirror</prgn> is particularly useful for downloading large volumes of software. After the first time files have been downloaded from a site, a file called <tt>.mirrorinfo</tt> is stored on the local host. Changes to the remote file system are tracked automatically by <prgn>mirror</prgn>, which compares this file to a similar file on the remote system and downloads only changed files.
it: <prgn>mirror</prgn> è particolarmente utile per scaricare grandi quantità di software. Dopo che i file sono stati scaricati da un sito per la prima volta, viene memorizzato nell'host locale un file chiamato <tt>.mirrorinfo</tt>. <prgn>mirror</prgn> tiene automaticamente traccia dei cambiamenti al file system remoto, paragonando questo file ad un file simile sul sistema remoto e scarica solo i file cambiati.
ru: <prgn>mirror</prgn> особенно полезен при скачивании ПО в большом количестве. После первоначального скачивания файлов с сайта на локальной машине сохраняется файл, называемый <tt>.mirrorinfo</tt>. <prgn>mirror</prgn> автоматически отслеживает изменения на удалённой файловой системе, сравнивая этот файл с подобным файлом на удалённой системе, и скачивает изменившиеся файлы.
