Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: Users should be aware, however, that the Debian system consists of many parts, each of which can be updated (almost) independently. Each Debian "release" contains well defined and unchanging contents. Updates are separately available. For a one-line description of the installation status of package <tt>foo</tt>, use the command <tt>dpkg --list foo</tt>. To view versions of all installed packages, run:
it: Gli utenti dovrebbero comunque essere consci del fatto che il sistema Debian consiste di molte parti, ognuna delle quali può essere aggiornata (quasi) indipendentemente. Ogni "rilascio" Debian è formato da un contenuto ben definito e invariato. Gli aggiornamenti sono disponibili separatamente. Per una descrizione su un'unica riga dello stato di installazione del pacchetto <tt>pippo</tt>, si usi il comando <tt>dpkg --list pippo</tt>. Per vedere la versione di tutti i pacchetti installati, si esegua:
ru: Однако пользователи должны понимать, что система Debian состоит из многих частей, каждая из которых может обновляться независимо от других (почти). Каждый «выпуск» Debian содержит строго определённое и неизменяемое содержимое. Обновления доступны отдельно. Чтобы получить состояние установки пакета <tt>foo</tt>, используйте команду <tt>dpkg --list foo</tt>. Чтобы посмотреть версии установленных пакетов, запустите:

source: For a more verbose description, use:
it: Per una descrizione più dettagliata, si usi:
ru: Более подробное описание можно получить по команде:

source: dpkg --status foo
it: dpkg --status pippo

source: How does Debian support non-English languages?
it: Come supporta Debian le lingue diverse dall'inglese?
ru: Как в Debian поддерживаются языки, отличные от английского?

source: &debian; is distributed with keymaps for nearly two dozen keyboards, and with utilities (in the <tt>kbd</tt> package) to install, view, and modify the tables.
it: &debian; è distribuita con mappe di tastiera per quasi due dozzine di tastiere e con utilità (nel pacchetto <tt>kbd</tt>) per installare, vedere e modificare le tabelle.
ru: &debian; распространяется с большим количеством клавиатурных раскладок для множества типов клавиатур и с утилитами (в пакете <tt>kbd</tt>), которые позволяют устанавливать, просматривать и редактировать таблицы клавиатурных раскладок.

source: The installation prompts the user to specify the keyboard he will use.
it: L'installazione chiede all'utente di specificare la tastiera che usa.
ru: При установке пользователь может указать нужную раскладку.

source: Vast majority of the software we packaged supports entering non-US-ASCII characters used in other Latin languages (e.g. ISO-8859-1 or ISO-8859-2), and a number of programs support multi-byte languages such as Japanese or Chinese.
it: La grande maggioranza del software impacchettato supporta interamente i caratteri non-US-ASCII usati in altri linguaggi Latin (ad esempio ISO-8859-1 o ISO-8859-2) ed un certo numero di programmi supporta linguaggi multi-byte come il giapponese o il cinese.
ru: Огромное количество упакованного программного обеспечения поддерживает ввод не-US-ASCII символов, используемых другими латинскими языками (например, ISO-8859-1 или ISO-8859-2), а также множество программ поддерживают многобайтовые языки, такие как японский или китайский.

source: Currently, support for German-, Spanish-, Finnish-, French-, Hungarian-, Italian-, Japanese-, Korean-, Dutch-, Polish-, Portuguese-, Russian-, Turkish-, and Chinese-language manual pages is provided through the <tt>manpages-LANG</tt> packages (where LANG is the two-letter ISO country code). To access an NLS manual page, the user must set the shell LC_MESSAGES variable to the appropriate string.
it: Attualmente è disponibile il supporto per le pagine di manuale nelle lingue tedesco, spagnolo, finlandese, francese, ungherese, italiano, giapponese, coreano, olandese, polacco, portoghese, russo, turco e cinese attraverso i pacchetti <tt>manpages-LANG</tt> (dove LANG è il codice ISO a due lettere della nazione). Per accedere alla pagina di un manuale NLS, l'utente deve impostare la variabile LC_MESSAGES della shell alla stringa appropriata.
ru: В настоящий момент, поддержка справочных страниц на немецком, испанском, финском, французском, венгерском, итальянском, японском, корейском, польском, португальском, русском, турецком и китайском языках осуществляется через пакеты <tt>manpages-ЯЗЫК</tt>, где ЯЗЫК &mdash; двухбуквенный ISO-код страны). Чтобы получить доступ к справочной странице на нужном языке, пользователь должен установить переменную оболочки LC_MESSAGES в соответствующее значение.

source: For example, in the case of the Italian-language manual pages, LC_MESSAGES needs to be set to 'italian'. The <prgn>man</prgn> program will then search for Italian manual pages under <tt>/usr/share/man/it/</tt>.
it: Per esempio, nel caso delle pagine di manuale in lingua italiana, LC_MESSAGES deve essere impostato a "italian". Il programma <prgn>man</prgn> cercherà poi le pagine di manuale in italiano sotto la directory <tt>/usr/share/man/it/</tt>.
ru: Например, в случае итальянского языка, LC_MESSAGES нужно установить в 'italian'. Программа <prgn>man</prgn> будет искать справочные страницы на итальянском языке в каталоге <tt>/usr/share/man/it/</tt>.

source: Where is pine?
it: Dove è pine?
ru: Где pine?

source: Due to its restrictive license, it's in the non-free area. Moreover, since license does not even allow modified binaries to be distributed, you have to compile it yourself from the source and the Debian patches.
it: A causa della sua licenza restrittiva, è nell'area non-free. Inoltre, poiché la licenza non permette nemmeno ai binari modificati di essere distribuiti, si deve compilarlo da soli dai sorgenti e dalle patch Debian.
ru: Из-за своей лицензии он вместе с несвободными программами. Более того, поскольку лицензия не позволяет распространять изменённые двоичные файлы, вам придётся компилировать его из исходного кода и заплат Debian самостоятельно.

source: The source package name is <package>pine</package>. You can use the <package>pine-tracker</package> package to be notified about when you need to upgrade.
it: Il nome del pacchetto dei sorgenti è <package>pine</package>. Si può usare il pacchetto <package>pine-tracker</package> per essere avvisati quando sarà necessario aggiornare.
ru: Пакет с исходным кодом называется <package>pine</package>. Для слежения за обновлениями можно использовать пакет <package>pine-tracker</package>.

source: Note that there are many replacements for both pine and pico, such as <package>mutt</package> and <package>nano</package>, that are located in the main section.
it: Si noti che ci sono molti sostituti sia per pine che per pico, come <package>mutt</package> e <package>nano</package>, che si trovano nella sezione main.
ru: Обратите внимание, что существует множество замен и для pine, и для pico, например, <package>mutt</package> и <package>nano</package>, которые представлены в разделе main.

source: Where is qmail/ezmlm/djbdns?
it: Dove è qmail/ezmlm/djbdns?
ru: Где qmail/ezmlm/djbdns?

source: Dan J. Bernstein used to distribute <url id="http://cr.yp.to/software.html" name="all software he has written"> with a restrictive license which does not allow modified binaries to be distributed. In november 2007 however, Bernstein said "[...] i have decided to put all of my future and [...] past software into the public domain". See <url id="http://cr.yp.to/distributors.html" name="FAQ from distributors"> for his distribution terms.
it: Una volta Dan J. Bernstein distribuiva <url id="http://cr.yp.to/software.html" name="tutto il software che ha scritto"> con una licenza restrittiva che non permetteva di distribuire i binari modificati. Tuttavia, nel novembre 2007, Bernstein ha detto "[...] ho deciso di rendere tutto il mio software a venire e [...] tutto quello passato di pubbico dominio". Si veda <url id="http://cr.yp.to/distributors.html" name="FAQ dai distributori"> per i suoi termini di distribuzione.
ru: Даниэл Бернстайн (Daniel J. Bernstein) использует для распространения <url id="http://cr.yp.to/software.html" name="всего своего ПО"> ограничивающую лицензию, которая не позволяет распространять изменённые двоичные файлы. Однако в ноябре 2007 Бернстайн сказал: «[…] я решил сделать всё написанное мной ПО и то, которое ещё напишу, общественным достоянием.» Смотрите. <url id="http://cr.yp.to/distributors.html" name="ЧаВо от распространителей"> по поводу его условий распространения.

source: As of 2008-09, <package>daemontools</package>, <package>djbdns</package> and <package>ucspi-tcp</package> are shipped with Debian lenny (in main). As of this writing (2008-09), <package>qmail</package> nor <package>ezmlm</package> is shipped with Debian main; see <url id="http://bugs.debian.org/457318" name="Bug #457318 (ITP qmail)"> and <url id="http://bugs.debian.org/469193" name="Bug #469193 (ITP ezmlm-idx)"> for the current status.
it: La situazione nel settembre 2008 vedeva <package>daemontools</package>, <package>djbdns</package> e <package>ucspi-tcp</package> forniti con Debian lenny (nella sezione main). Al momento della stesura di questo paragrafo (09-2008), né <package>qmail</package> né <package>ezmlm</package> è fornito con la sezione main di Debian; si veda il <url id="http://bugs.debian.org/457318" name="Bug #457318 (ITP qmail)"> e il <url id="http://bugs.debian.org/469193" name="Bug #469193 (ITP ezmlm-idx)"> per la situazione attuale.
ru: По состоянию на сентябрь 2008 года <package>daemontools</package>, <package>djbdns</package> и <package>ucspi-tcp</package> вошли в Debian lenny (в раздел main). На момент написания этих строк (сентябрь 2008 года), <package>qmail</package> и <package>ezmlm</package> ещё не попали в Debian main; текущее состояние смотрите в <url id="http://bugs.debian.org/457318" name="Bug #457318 (ITP qmail)"> и <url id="http://bugs.debian.org/469193" name="Bug #469193 (ITP ezmlm-idx)">.

source: As of 2008-09, <tt>publicfile</tt> was still not free software.
it: Nel settembre 2008, <tt>publicfile</tt> non era ancora software libero.
ru: По состоянию на сентябрь 2008 года <tt>publicfile</tt> по-прежнему является несвободным ПО.

source: Where is a player for Flash (SWF)?
it: Dove è un riproduttore per Flash (SWF)?
ru: Где проигрыватель Flash (SWF)?

source: Debian ships both <package>gnash</package> and <package>swfdec</package>: two free SWF movie players.
it: Debian fornisce sia <package>gnash</package> sia <package>swfdec</package>: due riproduttori liberi per filmati SWF.
ru: В Debian есть <package>gnash</package> и <package>swfdec</package> &mdash; два свободных проигрывателя видео в формате SWF.

source: Where is Google Earth?
it: Dove è Google Earth?
ru: Где Google Earth?

source: Google Earth is available for GNU/Linux from Google's web site, but is not only not Free Software, but is completely undistributable by a third party. However, <package>googleearth-package</package> (in the contrib-section) might be helpful in using this software.
it: Google Earth è disponibile per GNU/Linux dal sito web di Google ma, non solo non è software libero, è assolutamente non distribuibile da terze parti. <package>googleearth-package</package> (nella sezione contrib) può tuttavia essere d'aiuto nell'uso di questo software.
ru: Google Earth доступен для GNU/Linux с веб-сайта Google, но он не только не является свободным ПО, его даже никому не разрешено распространять кроме разработчика. Однако, для работы с этим ПО может помочь пакет <package>googleearth-package</package> (в разделе contrib-section).

source: Where is VoIP software?
it: Dove è il software VoIP?
ru: Где ПО для VoIP?

source: Two main open protocols are used for Voice Over IP: SIP and H.323. Both are implemented by a wide variety of software in Debian main. <package>ekiga</package> is one of the popular clients.
it: Per il Voice Over IP vengono usati principalmente due protocolli aperti: SIP e H.323. Entrambi sono implementati da una grande varietà di software presente nella sezione main di Debian. <package>ekiga</package> è uno dei client più popolari.
ru: Для передачи голоса через IP используются два открытых протокола: SIP и H.323. Оба реализованы во многом различном ПО из раздела Debian main. Одним из популярных клиентов является <package>ekiga</package>.

source: I have a wireless network card which doesn't work with Linux. What should I do?
it: Ho una scheda di rete wirelesse che non funziona con Linux. Cosa fare?
ru: У меня есть беспроводная сетевая карта, которая не работает в Linux. Что делать?

source: Buy one which does :)
it: Comprarne una che funzioni :)
ru: Купить ту, которая работает :)

source: Alternatively, use <package>ndiswrapper</package> to use a driver for Windows (if you have one) on your Linux system. See the <url id="http://wiki.debian.org/NdisWrapper" name="Debian Wiki ndiswrapper page"> for more information.
it: In alternativa, usare <package>ndiswrapper</package> per usare un driver per Windows (se lo si ha) sul proprio sistema Linux. Si veda la <url id="http://wiki.debian.org/NdisWrapper" name="pagina su ndiswapper nel Debian Wiki"> per maggiori informazioni.
ru: Также, можно использовать <package>ndiswrapper</package> для работы через драйвер Windows (если он у вас есть). Подробней смотрите <url id="http://wiki.debian.org/NdisWrapper" name="на вики-странице Debian ndiswapper">.

source: The Debian FTP archives
it: Gli archivi FTP Debian
ru: FTP-архивы Debian

source: How many Debian distributions are there?
it: Quante distribuzioni di Debian ci sono?
ru: Сколько существует дистрибутивов Debian?

source: There are three major distributions: the "stable" distribution, the "testing" distribution, and the "unstable" distribution. The "testing" distribution is sometimes `frozen' (see <ref id="frozen">). Next to these, there is the "oldstable" distribution (that's just the one from before "stable"), and the "experimental" distribution.
it: Esistono tre distribuzioni principali: la distribuzione "stable" (stabile), la distribuzione "testing" (in test) e la distribuzione "unstable" (instabile). La distribuzione "testing" è a volte congelata, "frozen" (si veda <ref id="frozen">). Oltre a queste c'è la distribuzione "oldstable" (che è semplicemente quella che ha preceduto "stable") e quella "experimental".
ru: Есть три основных дистрибутива: стабильный («stable»), тестируемый («testing») и нестабильный («unstable»). Тестируемый дистрибутив иногда «замораживается» (смотрите <ref id="frozen">). Кроме этого, есть ещё старый стабильный дистрибутив («oldstable») (т.е. тот, который был стабильным ранее) и экспериментальный дистрибутив («experimental»).

source: Experimental is used for packages which are still being developed, and with a high risk of breaking your system. It's used by developers who'd like to study and test bleeding edge software. Users shouldn't be using packages from here, because they can be dangerous and harmful even for the most experienced people.
it: Experimental è usata per i pacchetti che sono ancora in fase di sviluppo e con un alto rischio di danneggiamento del sistema. Viene usata da sviluppatori che vogliono studiare e testare software recentissimo. Gli utenti non dovrebbero usare pacchetti provienienti da lì perché questi possono essere pericolosi e creare danni anche per le persone più esperte.
ru: Экспериментальный дистрибутив используется для пакетов, которые пока ещё разрабатываются и могут сломать систему. Он используется разработчиками, которым нравится изучать и тестировать самое новое ПО. Обычные пользователи не должны использовать пакеты из его состава, так как они могут быть опасны и вредны даже для опытных пользователей.

source: See <ref id="choosing"> for help when choosing a Debian distribution.
it: Per un aiuto al momento di scegliere una distribuzione Debian, si veda <ref id="choosing">.
ru: Чтобы определиться с выбором дистрибутива Debian, см. <ref id="choosing">.

source: What are all those names like etch, lenny, etc.?
it: Cosa sono tutti quei nomi come etch, lenny, ecc.?
ru: Что означают названия вроде etch, lenny и т.д.?

source: They are just "codenames". When a Debian distribution is in the development stage, it has no version number but a codename. The purpose of these codenames is to make easier the mirroring of the Debian distributions (if a real directory like <tt>unstable</tt> suddenly changed its name to <tt>stable</tt>, a lot of stuff would have to be needlessly downloaded again).
it: Sono solo "nomi in codice". Quando una distribuzione Debian è in fase di sviluppo non ha un numero di versione ma un nome in codice. Lo scopo di questi nomi in codice è di rendere più semplice la creazione di mirror delle distribuzioni Debian (se una directory reale come <tt>unstable</tt> cambiasse improvvisamente il nome in <tt>stable</tt>, moltissima roba dovrebbe essere inutilmente scaricata di nuovo).
ru: Это всего лишь «условные имена». Когда дистрибутив Debian находится в состоянии разработки, ему присваивается не номер версии, а условное имя. Имена облегчают зеркалирование дистрибутивов Debian (когда имя каталога, например <tt>unstable</tt>, в итоге поменяется на <tt>stable</tt> пришлось бы всё скачивать заново).

source: Currently, <tt>stable</tt> is a symbolic link to <tt>&releasename;</tt> (i.e. &debian; &release;) and <tt>testing</tt> is a symbolic link to <tt>&testingreleasename;</tt>. This means that <tt>&releasename;</tt> is the current stable distribution and <tt>&testingreleasename;</tt> is the current testing distribution.
it: Attualmente, <tt>stable</tt> è un collegamento simbolico a <tt>&releasename;</tt> (ovvero &debian; &release;) e <tt>testing</tt> è un collegamento simbolico a <tt>&testingreleasename;</tt>. Questo significa che <tt>&releasename;</tt> è la distribuzione stable attuale e che <tt>&testingreleasename;</tt> è la distribuzione testing attuale.
ru: Сейчас <tt>stable</tt> &mdash; это символьная ссылка на <tt>&releasename;</tt> (т.е. на &debian; &release;), а <tt>testing</tt> &mdash; это символьная ссылка на <tt>&testingreleasename;</tt>. Это означает, что <tt>&releasename;</tt> сейчас является стабильным дистрибутивом, а <tt>&testingreleasename;</tt> &mdash; текущим тестируемым.

source: <tt>unstable</tt> is a permanent symbolic link to <tt>sid</tt>, as <tt>sid</tt> is always the unstable distribution (see <ref id="sid">).
it: <tt>unstable</tt> è un collegamento simbolico permanente a <tt>sid</tt>, dato che <tt>sid</tt> è sempre la distribuzione unstable (si veda <ref id="sid">).
ru: <tt>unstable</tt> &mdash; это постоянная символьные ссылка на <tt>sid</tt>, так как имя <tt>sid</tt> навсегда закреплено за нестабильным дистрибутивом(смотрите <ref id="sid">).

source: Which other codenames have been used in the past?
it: Quali altri nomi in codice sono stati usati in passato?
ru: Какие условные имена уже использовались?

source: Other codenames that have been already used are: <tt>buzz</tt> for release 1.1, <tt>rex</tt> for release 1.2, <tt>bo</tt> for releases 1.3.x, <tt>hamm</tt> for release 2.0, <tt>slink</tt> for release 2.1, <tt>potato</tt> for release 2.2, <tt>woody</tt> for release 3.0, <tt>sarge</tt> for release 3.1, <tt>etch</tt> for release 4.0, and <tt>lenny</tt> for release 5.0, and <tt>squeeze</tt> for release 6.0.
it: Altri nomi in codice che sono già stati usati sono: <tt>buzz</tt> per il rilascio 1.1, <tt>rex</tt> per il rilascio 1.2, <tt>bo</tt> per il rilascio 1.3.x, <tt>hamm</tt> per il rilascio 2.0, <tt>slink</tt> per il rilascio 2.1, <tt>potato</tt> per il rilascio 2.2, <tt>woody</tt> per il rilascio 3.0, <tt>sarge</tt> per il rilascio 3.1, <tt>etch</tt> per il rilascio 4.0, <tt>lenny</tt> per il rilascio 5.0 e <tt>squeeze</tt> per il rilascio 6.0.
ru: Уже использовались следующие условные имена: <tt>buzz</tt> для выпуска 1.1, <tt>rex</tt> для выпуска 1.2, <tt>bo</tt> для выпусков 1.3.x, <tt>hamm</tt> для выпуска 2.0, <tt>slink</tt> для выпуска 2.1, <tt>potato</tt> для выпуска 2.2, <tt>woody</tt> для выпуска 3.0, <tt>sarge</tt> для выпуска 3.1, <tt>etch</tt> для выпуска 4.0, <tt>lenny</tt> для выпуска 5.0 и <tt>squeeze</tt> для выпуска 6.0.

source: Where do these codenames come from?
it: Da dove derivano questi nomi in codice?
ru: Откуда берутся условные имена?

source: So far they have been characters taken from the "Toy Story" (R) movies by Pixar.
it: Finora sono stati presi dai nomi dei personaggi del film "Toy Story" della Pixar.
ru: Уже давно они выбираются из имён героев мультфильма «История игрушек» (Toy Story (R)) компании Pixar.

source: <em>buzz</em> (Buzz Lightyear) was the spaceman,
it: <em>buzz</em> (Buzz Lightyear) era l'astronauta,
ru: <em>buzz</em> (Buzz Lightyear) &mdash; это космонавт,

source: <em>rex</em> was the tyrannosaurus,
it: <em>rex</em> era il tirannosauro,
ru: <em>rex</em> &mdash; это тиранозавр,

source: <em>bo</em> (Bo Peep) was the girl who took care of the sheep,
it: <em>bo</em> (Bo Peep) era la bambina che si prese cura della pecora,
ru: <em>bo</em> (Bo Peep) &mdash; это девочка, которая пасла овечку,

source: <em>hamm</em> was the piggy bank,
it: <em>hamm</em> era il salvadanaio a forma di maialino,
ru: <em>hamm</em> &mdash; это свинья копилка,

source: <em>slink</em> (Slinky Dog (R)) was the toy dog,
it: <em>slink</em> (Slinky Dog (R)) era il cane giocattolo,
ru: <em>slink</em> (Slinky Dog (R)) &mdash; это игрушечная собака,

source: <em>potato</em> was, of course, Mr. Potato (R),
it: <em>potato</em> era ovviamente Mr. Potato (R),
ru: <em>potato</em> &mdash; это, естественно, Мистер Картошка (Mr. Potato (R)),

source: <em>woody</em> was the cowboy,
it: <em>woody</em> era il cowboy,
ru: <em>woody</em> &mdash; это ковбой,

source: <em>sarge</em> was the sergeant of the Green Plastic Army Men,
it: <em>sarge</em> era il sergente dell'Armata Verde,
ru: <em>sarge</em> &mdash; это сержант зелёной пластмассовой армии,

source: <em>etch</em> was the toy blackboard (Etch-a-Sketch (R)),
it: <em>etch</em> era la lavagna giocattolo (Etch-a-Sketch (R)),
ru: <em>etch</em> &mdash; это доска для рисования (Etch-a-Sketch (R)),

source: <em>lenny</em> was the toy binoculars.
it: <em>lenny</em> era il binocolo giocattolo,
ru: <em>lenny</em> &mdash; это бинокль.

source: <em>squeeze</em> was the name for the three-eyed aliens.
it: <em>squeeze</em> era il nome degli alieni con tre occhi,
ru: <em>squeeze</em> &mdash; это имя трёхглазого инопланетянина.

source: <em>wheezy</em> was the name of the rubber toy penguin with a red bow tie.
it: <em>wheezy</em> era il pinguino di gomma con un farfallino rosso,
ru: <em>wheezy</em> &mdash; это имя резинового пингвина с красным галстуком-бабочкой.

source: <em>sid</em> was the boy next door who destroyed toys.
it: <em>sid</em> era il bambino della casa accanto che distruggeva i giocattoli.
ru: <em>sid</em> &mdash; это соседский мальчишка, который ломает игрушки.

source: What about "sid"?
it: Cosa dire a proposito di "sid"?
ru: Что такое «sid»?
