Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: Source code is included for everything in the Debian system. Moreover, the license terms of most programs in the system <em>require</em> that source code be distributed along with the programs, or that an offer to provide the source code accompany the programs.
it: Viene fornito il codice sorgente per tutto ciò che è nel sistema Debian. Inoltre, i termini di licenza della maggior parte dei programmi <em>richiedono</em> che il codice venga distribuito insieme ai programmi o che un'offerta di fornire il codice sorgente li accompagni.
ru: Исходные коды поставляются с каждой системой Debian. Более того, лицензия большинства программ системы <em>требует</em>, чтобы исходные коды распространялись вместе с программами или предлагалось получение исходного кода программ.

source: The source code is distributed in the <tt>pool</tt> directory (see <ref id="pools">) together with all the architecture-specific binary directories. To retrieve the source code without having to be familiar with the structure of the FTP archive, try a command like <tt>apt-get source mypackagename</tt>.
it: Il codice sorgente viene distribuito nella directory <tt>pool</tt> (si veda <ref id="pools">) insieme con tutte le directory dei binari specifiche per le architetture. Per ottenere il codice sorgente senza la necessità di avere familiarità con la struttura dell'archivio FTP Debian, si provi un comando come <tt>apt-get source nomedelmiopacchetto</tt>.
ru: Исходные коды находятся в каталоге <tt>pool</tt> (смотрите <ref id="pools">) вместе со всеми зависящими от архитектуры каталогами двоичных файлов. Для получения исходного кода необязательно знать структуру FTP-архива, достаточно выполнить команду <tt>apt-get source имя_пакета</tt>.

source: Some packages are only distributed as source code due to the restrictions in their licenses. Notably, one such package is <tt>pine</tt>, see <ref id="pine"> for more information.
it: Alcuni pacchetti sono distribuiti solo come codice sorgente a causa di restrizioni nelle loro licenze. In particolare, uno di questi pacchetti è <tt>pine</tt>, si veda <ref id="pine"> per maggiori informazioni.
ru: Некоторые пакеты распространяются только в виде исходных кодов согласно требованиям их лицензий. Например, это касается пакета <tt>pine</tt>, подробней смотрите в <ref id="pine">.

source: Source code may or may not be available for packages in the "contrib" and "non-free" directories, which are not formally part of the Debian system.
it: Per i pacchetti nelle directory "contrib" e "non-free", che non sono formalmente parte del sistema Debian, il codice sorgente può essere disponibile o no.
ru: Для пакетов из каталогов «contrib» и «non-free» исходного кода может не быть, данные каталоги формально не являются частью системы Debian.

source: What's in the <tt>pool</tt> directory?
it: Cosa c'è nella directory <tt>pool</tt>?
ru: Что находится в каталоге <tt>pool</tt>?

source: Packages are kept in a large `pool', structured according to the name of the source package. To make this manageable, the pool is subdivided by section (`main', `contrib' and `non-free') and by the first letter of the source package name. These directories contain several files: the binary packages for each architecture, and the source packages from which the binary packages were generated.
it: I pacchetti vengono tenuti in un grosso "pool", strutturato in base ai nomi dei pacchetti sorgente. Per rendere il tutto usabile, il pool è suddiviso in sezioni ("main", "contrib" e "non-free") e in base alla prima lettera del nome dei pacchetti sorgente. Queste directory contengono diversi file: i pacchetti binari per ciascuna architettura e i pacchetti sorgente da cui sono stati generati i pacchetti binari.
ru: Пакеты содержатся в огромном «пуле», структурированном по именам пакетов с исходным кодом. Для большей управляемости, пул разделён на разделы («main», «contrib» и «non-free») и по первой букве имени пакета с исходным кодом. Эти каталоги содержат несколько файлов: двоичные пакеты для каждой архитектуры и пакеты с исходным кодом, из которых были собраны двоичные пакеты.

source: You can find out where each package is placed by executing a command like <tt>apt-cache showsrc mypackagename</tt> and looking at the `Directory:' line. For example, the <tt>apache</tt> packages are stored in <tt>pool/main/a/apache/</tt>.
it: Si può scoprire dove ciascun pacchetto è situato eseguendo un comando come <tt>apt-cache showsrc nomedelmiopacchetto</tt> e guardando la riga "Directory:". Per esempio, i pacchetti <tt>apache</tt> sono immagazzinati in <tt>pool/main/a/apache/</tt>.
ru: Чтобы выяснить, где находится определённый пакет, можно воспользоваться командой <tt>apt-cache showsrc имя_пакета</tt> и посмотреть на строку «Directory:». Например, пакеты <tt>apache</tt> находятся в <tt>pool/main/a/apache/</tt>.

source: Additionally, since there are so many <tt>lib*</tt> packages, these are treated specially: for instance, libpaper packages are stored in <tt>pool/main/libp/libpaper/</tt>.
it: Inoltre, poiché ci sono così tanti pacchetti <tt>lib*</tt>, questi vengono trattati in maniera particolare: per esempio, i pacchetti libpaper sono immagazzinati in <tt>pool/main/libp/libpaper/</tt>.
ru: Также, из-за того, что пакетов, начинающихся с <tt>lib*</tt>, слишком много, они распределены чуть по-другому: например, пакеты libpaper находятся в <tt>pool/main/libp/libpaper/</tt>.

source: <footnote><p>Historically, packages were kept in the subdirectory of <tt>dists</tt> corresponding to which distribution contained them. This turned out to cause various problems, such as large bandwidth consumption on mirrors when major changes were made. This was fixed with the introduction of the package pool. </p><p>The <tt>dists</tt> directories are still used for the index files used by programs like <tt>apt</tt>.</p></footnote>
it: <footnote><p>Storicamente, i pacchetti erano tenuti nella sottodirectory di <tt>dists</tt> corrispondente alla distribuzione di cui facevano parte. Questo si è rivelato fonte di vari problemi, come un grosso consumo di banda dei mirror ogni volta che venivano fatti dei cambiamenti di grossa portata; la cosa è stata risolta con l'introduzione dei pool di pacchetti. </p><p>Le directory <tt>dists</tt> vengono ancora utilizzate per i file indice usati da programmi come <tt>apt</tt>.</p></footnote>
ru: <footnote><p>Раньше, пакеты хранились в подкаталогах каталога <tt>dists</tt>, согласно названию дистрибутива. Это вызывало различные проблемы, например, огромное потребление полосы пропускания канала на серверах-зеркалах при выполнении больших изменений. Это было исправлено с вводом пула пакетов. </p><p>Каталоги <tt>dists</tt> всё ещё используются для хранения индексных файлов, которые используются программами подобными <tt>apt</tt>.</p></footnote>

source: What is "incoming"?
it: Cos'è "incoming"?
ru: Для чего нужен каталог «incoming»?

source: After a developer uploads a package, it stays for a short while in the "incoming" directory before it is checked that it's genuine and allowed into the archive.
it: Dopo che uno sviluppatore carica un pacchetto, questo resta per un po' nella directory "incoming" prima che ne venga controllata la genuinità e che venga accettato nell'archivio.
ru: После того, как разработчик закачал пакет, он какое-то время хранится в каталоге «incoming», перед тем как будет проверен на подлинность и ему будет разрешено попасть в архив.

source: Usually nobody should install things from this place. However, in some rare cases of emergency, the incoming directory is available at <url id="http://incoming.debian.org/">. You can manually fetch packages, check the GPG signature and MD5sums in the .changes and .dsc files, and then install them.
it: Normalmente nessuno dovrebbe installare cose da questo posto. Comunque, per alcuni rari casi di emergenza, la directory incoming è disponibile su <url id="http://incoming.debian.org/">. Si possono scaricare i pacchetti manualmente, controllare la firma GPG e i codici di controllo MD5 nei file .changes e .dsc, e poi installarli.
ru: Обычно, никто не должен устанавливать пакеты из этого каталога. Однако, в некоторых экстремальных ситуациях, каталог incoming доступен <url id="http://incoming.debian.org/" name="здесь">. Вы можете вручную достать оттуда пакеты, проверить подпись GPG и MD5sums в файлах .changes и .dsc, и установить их.

source: How do I set up my own apt-able repository?
it: Come impostare un proprio repository usabile con apt?
ru: Как создать свой собственный apt-репозиторий?

source: If you have built some private Debian packages which you'd like to install using the standard Debian package management tools, you can set up your own apt-able package archive. This is also useful if you'd like to share your Debian packages while these are not distributed by the Debian project. Instructions on how to do this are given in the <url id="http://www.debian.org/doc/manuals/repository-howto/repository-howto" name="Debian Repository HOWTO">.
it: Se si sono compilati alcuni pacchetti Debian privati che si desiderano installare usando gli strumenti standard per la gestione dei pacchetti Debian, si può impostare un proprio archivio di pacchetti usabile con apt. Questo è utile anche se si desiderano condividere i propri pacchetti Debian quando questi non sono distribuiti dal progetto Debian. Le istruzioni per farlo sono contenute nel <url id="http://www.debian.org/doc/manuals/repository-howto/repository-howto" name="Debian Repository HOWTO">.
ru: Если вы собираете пакеты Debian для себя, и вам хотелось бы устанавливать их с помощью стандартных утилит управления пакетами Debian, то вы можете создать свой apt-архив пакетов. Также, это полезно, если вы хотите поделиться своими пакетами, которых нет в проекте Debian. О том, как это сделать, можно узнать в <url id="http://www.debian.org/doc/manuals/repository-howto/repository-howto" name="Debian Repository HOWTO">.

source: Basics of the Debian package management system
it: Fondamenti sul sistema di gestione dei pacchetti Debian
ru: Основы системы управления пакетами Debian

source: This chapter touches on some lower level internals of Debian package management. If you're interested mainly in <em>usage</em> of the relevant tools, skip to chapters <ref id="pkgtools"> and/or <ref id="uptodate">.
it: Questo capitolo tratta alcuni aspetti dettagliati a basso livello della gestione dei pacchetti di Debian. Se si è principalmente interessati nell'<em>uso</em> degli strumenti relativi, si salti ai capitoli <ref id="pkgtools"> e <ref id="uptodate">.
ru: В этой главе частично описывается управление пакетами Debian на низком уровне. Если вам, в основном, интересно только как <em>использовать</em> соответствующие инструменты, то переходите сразу к <ref id="pkgtools"> и/или <ref id="uptodate">.

source: What is a Debian package?
it: Cosa è un pacchetto Debian?
ru: Что такое пакет Debian?

source: Packages generally contain all of the files necessary to implement a set of related commands or features. There are two types of Debian packages:
it: I pacchetti generalmente contengono tutti quei file necessari a implementare una serie di comandi o funzionalità correlate. Ci sono due tipi di pacchetti Debian:
ru: Пакеты, обычно, содержат все файлы, необходимые для выполнения определённого набора команд или реализации свойств. Есть два типа пакетов Debian:

source: <em>Binary packages</em>, which contain executables, configuration files, man/info pages, copyright information, and other documentation. These packages are distributed in a Debian-specific archive format (see <ref id="deb-format">); they are usually distinguished by having a '.deb' file extension. Binary packages can be unpacked using the Debian utility <tt>dpkg</tt> (possibly via a frontend like <prgn>aptitude</prgn>); details are given in its manual page.
it: <em>Pacchetti binari</em>, che contengono eseguibili, file di configurazione, pagine man/info, informazioni sul copyright ed altra documentazione. Questi pacchetti sono distribuiti in un formato archivio specifico di Debian (si veda <ref id="deb-format">); sono solitamente caratterizzati dall'estensione ".deb". I pacchetti binari possono essere spacchettati usando l'utilità Debian <tt>dpkg</tt> (opzionalmente tramite un frontend come <prgn>aptitude</prgn>); i dettagli sono forniti nella sua pagina di manuale.
ru: <em>Двоичные (Binary) пакеты</em>. Содержат выполняемые файлы, файлы настройки, страницы man/info, информацию об авторских правах и другую документацию. Эти пакеты распространяются в архивах Debian специального формата (см. <ref id="deb-format">); их, обычно, можно отличить по расширению '.deb'. Двоичные пакеты могут быть распакованы при помощи утилиты Debian <tt>dpkg</tt> (возможно, через пользовательский интерфейс типа <prgn>aptitude</prgn>); см. подробнее в справочной странице.

source: <em>Source packages</em>, which consist of a <tt>.dsc</tt> file describing the source package (including the names of the following files), a <tt>.orig.tar.gz</tt> file that contains the original unmodified source in gzip-compressed tar format and usually a <tt>.diff.gz</tt> file that contains the Debian-specific changes to the original source. The utility <tt>dpkg-source</tt> packs and unpacks Debian source archives; details are provided in its manual page. (The program <prgn>apt-get</prgn> can get used a frontend for <tt>dpkg-source</tt>.)
it: <em>Pacchetti sorgente</em>, che consistono in un file <tt>.dsc</tt> che descrive il pacchetto sorgente (inclusi i nomi dei file seguenti), un file <tt>.orig.tar.gz</tt> che contiene il sorgente originale non modificato nel formato tar compresso con gzip e solitamente un file <tt>.diff.gz</tt> che contiene le modifiche specifiche di Debian fatte al sorgente originale. L'utilità <tt>dpkg-source</tt> pacchetta e spacchetta gli archivi sorgente Debian; i dettagli sono forniti nella sua pagina di manuale. (Il programma <prgn>apt-get</prgn> può essere usato come frontend per <tt>dpkg-source</tt>.)
ru: <em>Пакеты с исходным кодом (Source)</em>. Состоят из <tt>.dsc</tt> файла, описывающего пакет с исходным кодом (включая имена перечисленных далее файлов), <tt>.orig.tar.gz</tt> файла, содержащего оригинальный сжатый с помощью gzip исходный код программы в архивном формате tar.gz и, обычно, <tt>.diff.gz</tt> файл, содержащий специфические для Debian изменения к оригинальному исходному коду. Утилита <tt>dpkg-source</tt> запаковывает и распаковывает архивы Debian с исходным кодом; подробности есть в справочной странице. (В качестве пользовательского интерфейса к <tt>dpkg-source</tt> можно использовать программу <prgn>apt-get</prgn>.)

source: Installation of software by the package system uses "dependencies" which are carefully designed by the package maintainers. These dependencies are documented in the <tt>control</tt> file associated with each package. For example, the package containing the GNU C compiler (<package>gcc</package>) "depends" on the package <package>binutils</package> which includes the linker and assembler. If a user attempts to install <package>gcc</package> without having first installed <package>binutils</package>, the package management system (dpkg) will send an error message that it also needs <package>binutils</package>, and stop installing <package>gcc</package>. (However, this facility can be overridden by the insistent user, see <manref section="8" name="dpkg">.) See more in <ref id="depends"> below.
it: L'installazione di software attraverso il sistema dei pacchetti usa "dipendenze" che vengono progettate con cura dai manutentori dei pacchetti. Queste dipendenze sono documentate nel file <tt>control</tt> associato ad ogni pacchetto. Per esempio, il pacchetto contenente il compilatore C GNU (<package>gcc</package>) "dipende" dal pacchetto <package>binutils</package> che include il linker e l'assemblatore. Se un utente tenta di installare <package>gcc</package> senza avere prima installato <package>binutils</package>, il sistema di gestione dei pacchetti (dpkg) invia un messaggio di errore avvertendo che necessita anche di <package>binutils</package>, e ferma l'installazione di <package>gcc</package>. (Questa funzione può essere tuttavia aggirata dall'utente tenace, si veda <manref section="8" name="dpkg">.) Per maggiori informazioni, si veda <ref id="depends"> più sotto.
ru: При установке программного обеспечения система управления пакетами использует «зависимости» (dependencies), которые тщательно подобраны сопровождающим пакета. Эти зависимости указаны в файле <tt>control</tt>, имеющемся в каждом пакете. Например, пакет, содержащий GNU компилятор C (<package>gcc</package>), зависит от пакета <package>binutils</package>, в котором содержатся компоновщик и ассемблер. Если пользователь попытается установить <package>gcc</package> до того как установит <package>binutils</package>, то система управления пакетами (dpkg) выдаст сообщение об ошибке, содержащее указание на необходимость установить <package>binutils</package>, и прервёт установку пакета <package>gcc</package> (однако, эта возможность может быть отключена настойчивым пользователем, смотрите <manref section="8" name="dpkg">). Более подробно смотрите ниже в <ref id="depends">.

source: Debian's packaging tools can be used to:
it: Gli strumenti Debian per i pacchetti possono essere usati per:
ru: Инструменты управления пакетами Debian могут использоваться для:

source: manipulate and manage packages or parts of packages,
it: manipolare e gestire pacchetti o parti di pacchetti,
ru: манипуляций и управления пакетами и частями пакетов,

source: administer local overrides of files in a package,
it: amministrare le deviazioni locali dei file in un pacchetto,
ru: управления локальными заменами файлов пакета,

source: aid developers in the construction of package archives, and
it: aiutare gli sviluppatori nella costruzione degli archivi dei pacchetti e
ru: сборки пакетов разработчиком,

source: aid users in the installation of packages which reside on a remote FTP site.
it: aiutare gli utenti nell'installazione di pacchetti che sono in un sito FTP remoto.
ru: помощи пользователю в установке пакетов с удалённого FTP-сервера.

source: What is the format of a Debian binary package?
it: Qual è il formato di un pacchetto binario Debian?
ru: Какой формат у двоичных пакетов Debian?

source: A Debian "package", or a Debian archive file, contains the executable files, libraries, and documentation associated with a particular suite of program or set of related programs. Normally, a Debian archive file has a filename that ends in <tt>.deb</tt>.
it: Un "pacchetto" Debian, o un file archivio Debian, contiene i file eseguibili, le librerie e la documentazione associati ad una particolare suite di programmi o ad un particolare gruppo di programmi correlati. Normalmente, un file archivio Debian ha un nome che termina in <tt>.deb</tt>.
ru: «Пакет» Debian или файл архива Debian, содержит выполняемые файлы, файлы настройки, библиотеки и документацию некоего определённого программного комплекта или набора программ. Обычно, имя архивного файла Debian заканчивается расширением <tt>.deb</tt>.

source: The internals of this Debian binary packages format are described in the <manref section="5" name="deb"> manual page. This internal format is subject to change (between major releases of &debian;), therefore please always use <manref section="1" name="dpkg-deb"> if you need to do lowlevel manipulations on <tt>.deb</tt> files.
it: I dettagli di questo formato per i pacchetti binari Debian sono descritti nella pagina di manuale <manref section="5" name="deb">. Questo formato interno è soggetto a modifiche (tra diversi rilasci principali di &debian;), quindi usare sempre <manref section="1" name="dpkg-deb"> se si devono effettuare manipolazioni a basso livello di file <tt>.deb</tt>.
ru: Внутренняя структура данного типа двоичных пакетов Debian описана в справочной странице <manref section="5" name="deb">. Этот внутренний формат может меняться (между основными выпусками &debian;), поэтому всегда используйте <manref section="1" name="dpkg-deb">, если вам требуется работать с файлами <tt>.deb</tt> на низком уровне.

source: Why are Debian package file names so long?
it: Perché i nomi dei pacchetti Debian sono così lunghi?
ru: Почему у имён файлов пакетов Debian такие длинные имена?

source: The Debian binary package file names conform to the following convention: &lt;foo&gt;_&lt;VersionNumber&gt;-&lt;DebianRevisionNumber&gt;_&lt;DebianArchitecture&gt;.deb
it: Il nome dei pacchetti binari Debian segue la seguente convenzione: &lt;pippo&gt;_&lt;NumeroVersione&gt;-&lt;NumeroRevisioneDebian&gt;_&lt;ArchitetturaDebian&gt;.deb
ru: Именование файлов двоичных пакетов Debian соответствует следующему формату: &lt;foo&gt;_&lt;НомерВерсии&gt;-&lt;НомерРевизииDebian&gt;_&lt;АрхитектураDebian&gt;.deb

source: Note that <tt>foo</tt> is supposed to be the package name. As a check, one can learn the package name associated with a particular Debian archive file (.deb file) in one of these ways:
it: Si noti che <tt>pippo</tt> dovrebbe essere il nome del pacchetto. Come verifica, si può conoscere il nome del pacchetto associato ad un particolare file di archivio Debian (file.deb) in uno dei modi seguenti.
ru: Заметим, что <tt>foo</tt> является именем пакета. Чтобы выяснить, какое имя пакета у архивного файла Debian (.deb файла), можно воспользоваться следующими методами:

source: inspect the "Packages" file in the directory where it was stored at a Debian FTP archive site. This file contains a stanza describing each package; the first field in each stanza is the formal package name.
it: Esaminando il file "Packages" nella directory dove era stato archiviato su un archivio FTP Debian. Questo file contiene una sezione che descrive ogni pacchetto; il primo campo in ogni sezione è il nome formale del pacchetto.
ru: изучить файл «Packages» в каталоге, который хранится на FTP-сайте архива Debian. Этот файл содержит строфы, описывающие каждый пакет; первое поле каждой строфы является официальным именем пакета.

source: use the command <tt>dpkg --info foo_VVV-RRR_AAA.deb</tt> (where VVV, RRR and AAA are the version, revision and architecture of the package in question, respectively). This displays, among other things, the package name corresponding to the archive file being unpacked.
it: Utilizzando il comando <tt>dpkg --info pippo_VVV-RRR_AAA.deb</tt> (dove VVV, RRR e AAA sono rispettivamente la versione, la revisione e l'architettura del pacchetto in questione). Questo mostra, tra le altre cose, il nome del pacchetto corrispondente al file archivio spacchettato.
ru: воспользоваться командой <tt>dpkg --info foo_VVV-RRR_AAA.deb</tt> (где VVV, RRR и AAA -- это версия, ревизия и архитектура пакета в запросе, соответственно). В результате, помимо прочего, будет указано имя пакета, которое соответствует распакованному архивному файлу.

source: The <tt>VVV</tt> component is the version number specified by the upstream developer. There are no standards in place here, so the version number may have formats as different as "19990513" and "1.3.8pre1".
it: La parte <tt>VVV</tt> è il numero di versione specificato dallo sviluppatore originale. Qui non ci sono standard, per cui il numero di versione può avere formati differenti come "19990513" e "1.3.8pre1".
ru: Компонент <tt>VVV</tt> определяет номер версии, заданный разработчиком программы. Его формат не стандартизован, поэтому номер версии может быть любым, например «19990513» или «1.3.8pre1».
