Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: I18n support for package descriptions: Update package management frontends to use the translated descriptions of packages.
it: Supporto i18n per le descrizioni dei pacchetti: aggiornare le interfacce alla gestione dei pacchetti in modo che usino le descrizioni tradotte dei pacchetti.
ru: Поддержка интернационализации описаний пакетов: обновить программы управления пакетами так, чтобы они использовали перевод описаний пакетов.

source: UTF-8 debian/changelog and debian/control. This way, e.g. names of people from asian countries can get typeset the right way in changelogs.
it: debian/changelog e debian/control UTF-8. In questo modo è possibile, per esempio, stampare correttamente nei changelog i nomi delle persone provenienti dai paesi asiatici.
ru: Использовать кодировку UTF-8 для файлов debian/changelog и debian/control. Это позволит, например, правильно отображать имена людей из азиатских стран в файлах журналов.

source: Faster booting: Dependency based boot sequence
it: Avvio più veloce: sequenza di avvio basata su dipendenze
ru: Ускорение загрузки ОС: зависимости в загрузочных последовательностях

source: Work is being done on <url id="http://wiki.debian.org/LSBInitScripts/DependencyBasedBoot" name="converting the Debian boot sequence"> to use dynamic and dependency based ordering instead of hardcoded sequence numbers. Once that's finished, Debian systems will boot much faster.
it: Si sta lavorando sulla <url id="http://wiki.debian.org/LSBInitScripts/DependencyBasedBoot" name="conversione della sequenza di avvio di Debian"> in modo da usare un ordine dinamico e basato sulle dipendenze invece di numeri di sequenza prefissati. Una volta che ciò sarà stato fatto, i sistemi Debian si avvieranno in modo molto più veloce.
ru: Ведётся работа по <url id="http://wiki.debian.org/LSBInitScripts/DependencyBasedBoot" name="переходу последовательности загрузки Debian"> к использованию динамического и основанного на зависимостях порядка, вместо жёстко заданной последовательности номеров. После того, как это будет сделано, системы Debian будут загружаться намного быстрее.

source: Improvements in the Debian Installer
it: Miglioramenti nell'installatore Debian
ru: Улучшения в программе установки Debian

source: Lots of work has been done on the Debian Installer, resulting in major improvements. We'll mention just two of them here.
it: È stato fatto molto lavoro sull'installatore Debian che ha portato a grandi miglioramenti. Ne citeremo qui solo due.
ru: Большая работа была проделана над программой установки Debian, что привело к значительным улучшениям. Хотелось бы упомянуть два из них.

source: Starting the installer from Microsoft Windows: It is now possible to start the installer directly from Microsoft Windows without the need to change BIOS settings. Upon insertion of a CD-ROM, DVD-ROM or USB stick, an autorun program will be started, offering a step-by-step process to start the Debian Installer.
it: Avvio dell'installatore da Microsoft Windows: è ora possibile avviare l'installatore direttamente da Microsoft Windows senza bisogno di modificare le impostazioni del BIOS. All'inserimento di un CD-ROM, DVD-ROM o pennina USB, un programma eseguito automaticamente verrà avviato, offrendo una procedura passo-passo per avviare l'installatore Debian.
ru: Запуск программы установки из Microsoft Windows: теперь возможно запустить программу установки прямо из Microsoft Windows без необходимости изменения настроек BIOS. Достаточно вставить CD-ROM, DVD-ROM или USB-накопитель, и запустится программа автозапуска, предлагающая пошаговый процесс запуска программы установки Debian.

source: The debian-installer now includes experimental support for installing Debian on systems with Serial ATA RAID.
it: L'installatore Debian include ora il supporto sperimentale per l'installazione di Debian su sistemi con Serial ATA RAID.
ru: В debian-installer теперь включена экспериментальная поддержка установки Debian на системы с Serial ATA RAID.

source: More architectures
it: Più architetture
ru: Ещё больше архитектур

source: Complete Debian system on other architectures such as <url id="http://wiki.debian.org/ArmEabiPort" name="ARM EABI"> (referred to as "armel") (next to the old "arm") will likely get supported with lenny. Support for <url id="http://wiki.debian.org/SHPort" name="SuperH"> is expected soon. Notice that even though some architectures are dropped for a given the release there still might be a way to install and upgrade using the latest <tt>sid</tt>.
it: Un sistema Debian completo su altre architetture come <url id="http://wiki.debian.org/ArmEabiPort" name="ARM EABI"> (chiamata "armel") (affianco alla vecchia "arm") sarà probabilmente supportato in Lenny. Il supporto per <url id="http://wiki.debian.org/SHPort" name="SuperH"> è atteso presto. Si noti che benché alcune architetture vengano dismesse per un dato rilascio, ci potrebbe comunque essere un modo per installarle e aggiornarle usando la più recente <tt>sid</tt>.
ru: Возможно, в lenny будет поддерживаться архитектура <url id="http://wiki.debian.org/ArmEabiPort" name="ARM EABI"> (называемая «armel») (вместе со старым «arm»). Также скоро ожидается поддержка <url id="http://wiki.debian.org/SHPort" name="SuperH">. Заметим, что хотя некоторые архитектуры исключены из данного выпуска, их всё ещё можно установить или обновить с помощью последней версии <tt>sid</tt>.

source: More kernels
it: Più kernel
ru: Больше ядер

source: In addition to Debian GNU/Hurd, Debian is being ported also to BSD kernels, namely to <url id="http://www.debian.org/ports/kfreebsd-gnu/" name="FreeBSD">. This port runs on both AMD64 ("kfreebsd-amd64") and traditional Intel ("kfreebsd-i386").
it: In aggiunta a Debian GNU/Hurd, Debian sta facendo il port anche per i kernel BSD, in particolare per <url id="http://www.debian.org/ports/kfreebsd-gnu/" name="FreeBSD">. Questo port gira sia su macchine AMD64 ("kfreebsd-amd64") sia su Intel tradizionali ("kfreebsd-i386").
ru: В дополнении к Debian GNU/Hurd, Debian также переносится на ядра BSD, а именно <url id="http://www.debian.org/ports/kfreebsd-gnu/" name="FreeBSD">. Этот перенос работает на AMD64 («kfreebsd-amd64») и обычном Intel («kfreebsd-i386»).

source: General information about the FAQ
it: Informazioni generali su questa FAQ
ru: Общая информация о ЧаВо

source: Authors
it: Autori
ru: Авторы

source: The first edition of this FAQ was made and maintained by J.H.M. Dassen (Ray) and Chuck Stickelman. Authors of the rewritten &debian; FAQ are Susan G. Kleinmann and Sven Rudolph. After them, the FAQ was maintained by Santiago Vila and, later, by Josip Rodin. The current maintainer is Javier Fernandez-Sanguino.
it: La prima edizione di questa FAQ è stata fatta ed era mantenuta da J.H.M. Dassen (Ray) e Chuck Stickelman. Gli autori della &debian; FAQ riscritta sono Susan G. Kleinmann e Sven Rudolph. Dopo di loro, la FAQ è stata mantenuta da Santiago Vila e, in seguito, da Josip Rodin. L'attuale manutentore è Javier Fernandez-Sanguino.
ru: Первая редакция этих ЧаВо (FAQ) была написана и сопровождалась Д.Х.М. Дассеном (J.H.M. Dassen (Ray)) и Чаком Стикельманом (Chuck Stickelman). Сьюзан Г. Клейман (Susan G. Kleinmann) и Свен Рудольф (Sven Rudolph) переписали &debian; FAQ. Затем, ЧаВо сопровождались Сантьяго Вилой (Santiago Vila) и, позднее, Иосипом Родиным (Josip Rodin). Текущим сопровождающим является Хавьер Фернандес-Сангвино (Javier Fernandez-Sanguino).

source: Parts of the information came from:
it: Parti delle informazioni provengono da:
ru: Откуда бралась информация:

source: The Linux FAQ, by <url id="http://www.chiark.greenend.org.uk/~ijackson/" name="Ian Jackson">.
it: le Linux FAQ di <url id="http://www.chiark.greenend.org.uk/~ijackson/" name="Ian Jackson">;
ru: ЧаВо по Linux, написанные <url id="http://www.chiark.greenend.org.uk/~ijackson/" name="Яном Джексоном (Ian Jackson)">.

source: <url id="http://lists.debian.org/" name="Debian Mailing Lists Archives">,
it: gli <url id="http://lists.debian.org/" name="archivi delle mailing-list Debian">;
ru: <url id="http://lists.debian.org/" name="Архивы списков рассылки Debian">,

source: the dpkg programmers' manual and the Debian Policy manual (see <ref id="debiandocs">)
it: il manuale per programmatori di dpkg e il manuale Debian Policy (si veda <ref id="debiandocs">);
ru: Руководство программиста dpkg и Руководство по политике Debian (см. <ref id="debiandocs">)

source: many developers, volunteers, and beta testers, and
it: molti sviluppatori, volontari e beta tester e
ru: От многих разработчиков, добровольцев и бета-тестеров и

source: the flaky memories of its authors. :-)
it: la memoria traballante dei suoi autori :-)
ru: Чудных воспоминаний его авторов. :-)

source: Kamaraju Kusumanchi's <url id="http://people.cornell.edu/pages/kk288/debian_choosing_distribution.html" name="Choosing a Debian distribution FAQ">, who graciously made it GPL so I could include it as a new chapter (see <ref id="choosing">)
it: inoltre la <url id="http://people.cornell.edu/pages/kk288/debian_choosing_distribution.html" name="Choosing a Debian distribution FAQ"> di Kamaraju Kusumanchi, che la ha gentilmente resa GPL in modo che potesse essere inclusa come un nuovo capitolo (si veda <ref id="choosing">).
ru: Со страницы <url id="http://people.cornell.edu/pages/kk288/debian_choosing_distribution.html" name="Choosing a Debian distribution FAQ">, написанной Камараджи Кусуманчи (Kamaraju Kusumanchi), и лицензированной под GPL, чтобы я мог включить это в виде новой главы (см. <ref id="choosing">)

source: The authors would like to thank all those who helped make this document possible.
it: Gli autori desiderano ringraziare tutti coloro che hanno aiutato a rendere possibile questo documento.
ru: Авторы хотели бы поблагодарить всех, кто сделал появление этого документа возможным.

source: All warranties are disclaimed. All trademarks are property of their respective trademark owners.
it: Non esistono garanzie. Tutti i marchi registrati appartengono ai rispettivi proprietari.
ru: Никаких гарантий. Все торговые марки являются собственностью их владельцев.

source: Comments and additions to this document are always welcome. Please send e-mail to <email>doc-debian@packages.debian.org</email>, or submit a wishlist bug report against the <package><url id="http://bugs.debian.org/debian-faq" name="debian-faq"></package> package.
it: Commenti ed aggiunte a questo documento sono sempre i benvenuti. Mandate un messaggio di posta elettronica a <email>doc-debian@packages.debian.org</email> o inviate una segnalazione di bug di tipo wishlist sul pacchetto <package><url id="http://bugs.debian.org/debian-faq" name="debian-faq"></package>.
ru: Комментарии и дополнения к этому документу всегда приветствуются. Отправляйте их электронной почтой на адрес <email>doc-debian@packages.debian.org</email>, или в виде сообщения об ошибке в пакете <package><url id="http://bugs.debian.org/debian-faq" name="debian-faq"></package>.

source: Availability
it: Reperibilità
ru: Где взять

source: The latest version of this document can be viewed on the Debian WWW pages at <url id="http://www.debian.org/doc/FAQ/">.
it: La versione più recente di questo documento può essere letta sulle pagine WWW di Debian all'indirizzo <url id="http://www.debian.org/doc/FAQ/">.
ru: Последнюю версию этого документа можно посмотреть на WWW странице Debian по адресу <url id="http://www.debian.org/doc/FAQ/">.

source: It is also available for download in plain text, HTML, PostScript and PDF formats at <url id="http://www.debian.org/doc/user-manuals#faq">. Also, there are several translations there.
it: È anche disponibile per essere scaricata nei formati testo puro, HTML, PostScript e PDF all'indirizzo <url id="http://www.debian.org/doc/user-manuals#faq">. Inoltre, ci sono lì anche diverse traduzioni.
ru: Также её можно скачать в виде простого текста, в HTML и PostScript форматах с <url id="http://www.debian.org/doc/user-manuals#faq">. Там же есть переводы на несколько языков.

source: This document is available in the <package>debian-faq</package> package. Translations are available in <package>debian-faq-de</package>, <package>debian-faq-fr</package> and other packages.
it: Questo documento è disponibile nel pacchetto <package>debian-faq</package>. Traduzioni sono disponibili in <package>debian-faq-de</package>, <package>debian-faq-fr</package> e altri pacchetti.
ru: Этот документ доступен в пакете <package>debian-faq</package>. Переводы доступны в пакетах <package>debian-faq-ru</package>, <package>debian-faq-fr</package> и других.

source: The original SGML files used to create this document are also available in <package>debian-faq</package>'s source package, or in SVN at: <tt>svn://svn.debian.org/svn/ddp/manuals/trunk/debian-faq</tt> and <url id="http://svn.debian.org/viewsvn/ddp/manuals/trunk/debian-faq/">.
it: I file SGML originali usati per creare questo documento sono inoltre disponibili nel pacchetto sorgente <package>debian-faq</package> o nel SVN agli indirizzi: <tt>svn://svn.debian.org/svn/ddp/manuals/trunk/debian-faq</tt> e <url id="http://svn.debian.org/viewsvn/ddp/manuals/trunk/debian-faq/">.
ru: Исходные файлы SGML, использовавшиеся при создании этого документа, также доступны в виде пакета с исходным кодом <package>debian-faq</package>, или в SVN: <tt>svn://svn.debian.org/svn/ddp/manuals/trunk/debian-faq</tt> и <url id="http://svn.debian.org/viewsvn/ddp/manuals/trunk/debian-faq/">.

source: Document format
it: Formato del documento
ru: Формат документа

source: This document was written using the DebianDoc SGML DTD (rewritten from LinuxDoc SGML). DebianDoc SGML systems enables us to create files in a variety of formats from one source, e.g. this document can be viewed as HTML, plain text, TeX DVI, PostScript, PDF, or GNU info.
it: Questo documento è stato scritto usando il DTD SGML DebianDoc (riscritto da LinuxDoc SGML). I sistemi SGML DebianDoc permettono di creare file in una varietà di formati da un unico sorgente, per esempio questo documento può essere visto come HTML, testo puro, TeX DVI, PostScript, PDF e GNU info.
ru: В этом документе используется DebianDoc SGML DTD (переписан из LinuxDoc SGML). Система DebianDoc SGML позволяет создавать файлы в различных форматах из одного исходного текста, например, этот документ можно посмотреть как HTML, простой текст, TeX DVI, PostScript, PDF или GNU info.

source: Conversion utilities for DebianDoc SGML are available in Debian package <package>debiandoc-sgml</package>.
it: Le utilità di conversione per l'SGML DebianDoc sono disponibili nel pacchetto Debian <package>debiandoc-sgml</package>.
ru: Утилиты преобразования DebianDoc SGML находятся в пакете Debian <package>debiandoc-sgml</package>.

source: The &debian; FAQ
ru: Часто задаваемые вопросы о &debian;

source: oldstable = &oldreleasename;; stable = &releasename;; testing = &testingreleasename;; unstable = sid
ru: Старый стабильный (oldstable) = &oldreleasename;; стабильный (stable) = &releasename;; тестируемый (testing) = &testingreleasename;; нестабильный (unstable) = sid

source: Wiki
ru: Вики

source: The Debian-1.1 release announcement, by <url id="http://www.perens.com/" name="Bruce Perens">.
ru: Объявление о выпуске Debian-1.1, написанное <url id="http://www.perens.com/" name="Брюсом Перенсом (Bruce Perens)">.

source: Feedback
ru: Обратная связь
