Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: The <tt>RRR</tt> component is the Debian revision number, and is specified by the Debian developer (or an individual user if he chooses to build the package himself). This number corresponds to the revision level of the Debian package, thus, a new revision level usually signifies changes in the Debian Makefile (<tt>debian/rules</tt>), the Debian control file (<tt>debian/control</tt>), the installation or removal scripts (<tt>debian/p*</tt>), or in the configuration files used with the package.
it: La parte <tt>RRR</tt> è il numero di revisione Debian e viene specificata dallo sviluppatore Debian (o il singolo utente se sceglie di crearsi il pacchetto da sé). Questo numero corrisponde al livello di revisione del pacchetto Debian, quindi un nuovo livello di revisione significa solitamente modifiche nel Makefile Debian (<tt>debian/rules</tt>), nel file di controllo Debian (<tt>debian/control</tt>), negli script di installazione o rimozione (<tt>debian/p*</tt>) oppure nei file di configurazione utilizzati con il pacchetto.
ru: Компонент <tt>RRR</tt> определяет номер ревизии Debian, и задаётся разработчиком Debian (или простым пользователем, если он решит собрать пакет самостоятельно). Этот номер соответствует степени ревизии пакета Debian, то есть, новая степень ревизии обычно указывает на изменения в Debian Makefile (<tt>debian/rules</tt>), файле Debian control (<tt>debian/control</tt>), сценариях установки или удаления (<tt>debian/p*</tt>) или в файлах настройки, используемых с пакетом.

source: The <tt>AAA</tt> component identifies the processor for which the package was built. This is commonly <tt>i386</tt>, which refers to chips compatible to Intel's 386 or later versions. For other possibilities review Debian's FTP directory structure at <ref id="dirtree">. For details, see the description of "Debian architecture" in the manual page <manref section="1" name="dpkg-architecture">.
it: La parte <tt>AAA</tt> identifica il processore per cui è stato compilato il pacchetto. È solitamente <tt>i386</tt>, che si riferisce ai chip compatibili con Intel 386 o versioni successive. Per altre possibilità si veda la struttura delle directory dei siti FTP di Debian in <ref id="dirtree">. Per dettagli, si veda la descrizione delle "architetture Debian" nella pagina di manuale <manref section="1" name="dpkg-architecture">.
ru: Компонент <tt>AAA</tt> определяет тип процессора, для которого собран пакет. Как правило &mdash; это <tt>i386</tt>, что указывает на процессоры, совместимыми с Intel 386 или более новыми моделями. Другие возможные типы можно увидеть в структуре каталогов Debian FTP (<ref id="dirtree">). Подробней об этом смотрите в справочной странице по архитектуре Debian <manref section="1" name="dpkg-architecture">.

source: What is a Debian control file?
it: Cos'è un file di controllo Debian?
ru: Зачем нужен управляющий (control) файл Debian?

source: Specifics regarding the contents of a Debian control file are provided in the Debian Policy Manual, section 5, see <ref id="debiandocs">.
it: Le specifiche riguardanti il contenuto di un file di controllo Debian sono fornite nel manuale Debian Policy, sezione 5, si veda <ref id="debiandocs">.
ru: Спецификации содержимого управляющего файла Debian приводятся в "Руководстве по политике Debian" (Debian Policy Manual), раздел 5 (<ref id="debiandocs">).

source: Briefly, a sample control file is shown below for the Debian package hello:
it: Brevemente, un esempio di file di controllo è mostrato di seguito per il pacchetto Debian hello:
ru: Короткий пример файла control для пакета Debian hello приведён ниже:

source: Package: hello Priority: optional Section: devel Installed-Size: 45 Maintainer: Adam Heath &lt;doogie@debian.org&gt; Architecture: i386 Version: 1.3-16 Depends: libc6 (>= 2.1) Description: The classic greeting, and a good example The GNU hello program produces a familiar, friendly greeting. It allows nonprogrammers to use a classic computer science tool which would otherwise be unavailable to them. . Seriously, though: this is an example of how to do a Debian package. It is the Debian version of the GNU Project's `hello world' program (which is itself an example for the GNU Project).
it: Package: hello Priority: optional Section: devel Installed-Size: 45 Maintainer: Adam Heath &lt;doogie@debian.org&gt; Architecture: i386 Version: 1.3-16 Depends: libc6 (>= 2.1) Description: il classico saluto e un buon esempio Il programma GNU hello produce un familiare e amichevole saluto. Consente ai non programmatori di usare un classico strumento informatico che altrimenti non sarebbe disponibile per loro. . A parte gli scherzi, questo è un esempio di come creare un pacchetto Debian. È la versione Debian del programma "hello world" del progetto GNU (che è esso stesso un esempio per il progetto GNU).

source: The Package field gives the package name. This is the name by which the package can be manipulated by the package tools, and usually similar to but not necessarily the same as the first component string in the Debian archive file name.
it: Il campo Package fornisce il nome del pacchetto. Questo è il nome attraverso il quale il pacchetto può essere manipolato con gli strumenti per i pacchetti ed è solitamente simile, ma non necessariamente identico, alla prima parte della stringa del nome del file archivio Debian.
ru: Поле Package содержит имя пакета. Это имя, по которому инструменты управления пакетами будут его опознавать. Обычно оно совпадает (но не обязательно) с первым компонентом имени файла архива Debian.

source: The Version field gives both the upstream developer's version number and (in the last component) the revision level of the Debian package of this program as explained in <ref id="pkgname">.
it: Il campo Version fornisce sia il numero della versione dello sviluppatore originale, sia (nell'ultima parte) il livello di revisione del pacchetto Debian di questo programma, come spiegato in <ref id="pkgname">.
ru: Поле Version содержит версию разработчика и (в последнем компоненте) номер ревизии пакета Debian этой программы, см. <ref id="pkgname">.

source: The Architecture field specifies the chip for which this particular binary was compiled.
it: Il campo Architecture specifica il chip per il quale questo particolare binario è stato compilato.
ru: Поле Architecture определяет тип процессора, для которого были скомпилированы двоичные файлы в данном пакете.

source: The Depends field gives a list of packages that have to be installed in order to install this package successfully.
it: Il campo Depends fornisce una lista di pacchetti che devono essere installati per poter installare questo pacchetto con successo.
ru: Поле Depends содержит список пакетов, которые должны быть установлены для успешной установки данного пакета.

source: The Installed-Size indicates how much disk space the installed package will consume. This is intended to be used by installation front-ends in order to show whether there is enough disk space available to install the program.
it: Installed-Size indica quanto spazio su disco occuperà il pacchetto installato. È pensato per essere usato dai frontend di installazione in modo da poter mostrare se c'è abbastanza spazio disponibile su disco per installare il programma.
ru: Installed-Size показывает сколько дискового пространства займёт установленный пакет. Этот параметр может использоваться программами установки для проверки достаточности дискового пространства перед установкой пакета.

source: The Section line gives the "section" where this Debian package is stored at the Debian FTP sites.
it: La riga Section fornisce la "sezione" in cui questo pacchetto Debian è archiviato presso i siti FTP Debian.
ru: Строка Section определяет «раздел», в котором хранится пакет Debian на FTP-серверах.

source: The Priority indicates how important is this package for installation, so that semi-intelligent software like dselect or aptitude can sort the package into a category of e.g. packages optionally installed. See <ref id="priority">.
it: Priority indica quanto è importante questo pacchetto per l'installazione, così che i software semi-intelligenti come dselect o aptitude possano ordinare il pacchetto dentro una categoria di, ad esempio, pacchetti installati in modo opzionale. Si veda <ref id="priority">.
ru: Поле Priority показывает насколько важным является пакет для установки; некоторые программы, например, dselect или aptitude, могут сортировать пакеты по категориям, см. <ref id="priority">.

source: The Maintainer field gives the e-mail address of the person who is currently responsible for maintaining this package.
it: Il campo Maintainer fornisce l'indirizzo di posta elettronica della persona che è attualmente responsabile della manutenzione di questo pacchetto.
ru: В поле Maintainer указан адрес электронной почты человека, ответственного за поддержку данного пакета.

source: The Description field gives a brief summary of the package's features.
it: Il campo Description fornisce un breve riassunto delle funzionalità del pacchetto.
ru: В поле Description даётся краткое описание возможностей, предоставляемых пакетом.

source: For more information about all possible fields a package can have, please see the Debian Policy Manual, section 5, "Control files and their fields", see <ref id="debiandocs">.
it: Per ulteriori informazioni riguardo tutti i campi possibili che può avere un pacchetto, si veda il manuale Debian Policy, sezione 5, "Control files and their fields" (vedere <ref id="debiandocs">).
ru: Более подробную информацию о всех возможных полях, которые может иметь пакет, смотрите в «Руководстве по политике Debian» (Debian Policy Manual), разделе 5 — «Управляющие файлы и их поля», <ref id="debiandocs">.

source: What is a Debian conffile?
it: Cos'è un conffile Debian?
ru: Зачем нужен Debian файл conffile?

source: Conffiles is a list of configuration files (usually placed in <tt>/etc</tt>) that the package management system will not overwrite when the package is upgraded. This ensures that local values for the contents of these files will be preserved, and is a critical feature enabling the in-place upgrade of packages on a running system.
it: Conffiles è una lista di file di configurazione (solitamente situati in <tt>/etc</tt>) che il sistema di gestione dei pacchetti non sovrascriverà quando il pacchetto viene aggiornato. Questo assicura che i valori locali per il contenuto di questi file vengano preservati, ed è una caratteristica critica che permette l'aggiornamento in loco di pacchetti su un sistema in esecuzione.
ru: Conffile содержит список файлов настройки (обычно помещаемых в <tt>/etc</tt>), которые система управления пакетами не будет перезаписывать при обновлении пакета. Это гарантирует, что содержимое файлов настройки будет сохранено, и позволяет обновлять пакеты не прерывая работу системы.

source: To determine exactly which files are preserved during an upgrade, run:
it: Per determinare esattamente quali file sono preservati durante un aggiornamento, si esegua:
ru: Чтобы точно определить, какие файлы сохраняются при обновлении, запустите:

source: dpkg --status package
it: dpkg --status pacchetto
ru: dpkg --status пакет

source: And look under "Conffiles:".
it: e si guardi alla voce "Conffiles:".
ru: и смотрите в строке «Conffiles:».

source: What is a Debian preinst, postinst, prerm, and postrm script?
it: Cosa sono gli script preinst, postinst, prerm e postrm di Debian?
ru: Зачем нужны Debian сценарии preinst, postinst, prerm и postrm?

source: These files are executable scripts which are automatically run before or after a package is installed. Along with a file named <tt>control</tt>, all of these files are part of the "control" section of a Debian archive file.
it: Questi file sono script eseguibili che vengono automaticamente eseguiti prima o dopo l'installazione di un pacchetto. Insieme ad un file chiamato <tt>control</tt>, tutti questi file sono parte della sezione "control" di un file archivio Debian.
ru: Это выполняемые сценарии, которые автоматически запускаются перед или после установки пакета. Вместе с файлом <tt>control</tt>, эти файлы являются частью «управляющего» раздела архивного файла Debian.

source: The individual files are:
it: I singoli file sono:
ru: Более подробно:

source: This script executes before that package will be unpacked from its Debian archive (".deb") file. Many 'preinst' scripts stop services for packages which are being upgraded until their installation or upgrade is completed (following the successful execution of the 'postinst' script).
it: Questo script viene eseguito prima che il pacchetto venga spacchettato dall'archivio Debian (".deb"). Molti script "preinst" interrompono i servizi per i pacchetti che devono essere aggiornati fino a che la loro installazione o aggiornamento non sono completati (a seguito dell'esecuzione con successo dello script "postinst").
ru: Данный сценарий выполняется перед тем, как пакет будет распакован из файла архива Debian (.deb). Многие сценарии «preinst» останавливают службы, которые будут обновлены пакетом, до завершения их установки или обновления (успешного выполнения сценария «postinst»).

source: This script typically completes any required configuration of the package <tt>foo</tt> once <tt>foo</tt> has been unpacked from its Debian archive (".deb") file. Often, 'postinst' scripts ask the user for input, and/or warn the user that if he accepts default values, he should remember to go back and re-configure that package as the situation warrants. Many 'postinst' scripts then execute any commands necessary to start or restart a service once a new package has been installed or upgraded.
it: Questo script tipicamente completa ogni configurazione richiesta dal pacchetto <tt>pippo</tt> una volta che <tt>pippo</tt> è stato spacchettato dal suo archivio Debian (".deb"). Spesso gli script "postinst" richiedono all'utente degli input o lo avvertono che se accetta le impostazioni predefinite deve ricordarsi di tornare indietro e riconfigurare il pacchetto se la situazione lo richiede. Molti script "postinst" eseguono poi tutti i comandi necessari ad avviare o riavviare un servizio una volta che il pacchetto è stato installato o aggiornato.
ru: Этот сценарий, обычно, завершает требуемую настройку пакета <tt>foo</tt> после того, как <tt>foo</tt> был распакован из файла архива Debian (.deb). Часто, сценарий «postinst» запрашивает у пользователя различные параметры и/или предупреждает пользователя, что если он примет значения по умолчанию, то позже можно перенастроить пакет согласно ситуации. Многие сценарии «postinst» затем выполняют команды, необходимые для запуска или перезапуска служб после установки или обновления пакета.

source: This script typically stops any daemons which are associated with a package. It is executed before the removal of files associated with the package.
it: Questo script tipicamente ferma tutti i demoni associati ad un pacchetto. Viene eseguito prima della rimozione di file associati al pacchetto.
ru: Этот сценарий, обычно, останавливает выполнение всех служб, связанных с пакетом. Он выполняется перед удалением файлов, связанных с пакетом.

source: This script typically modifies links or other files associated with <tt>foo</tt>, and/or removes files created by the package. (Also see <ref id="virtual">.)
it: Questo script tipicamente modifica i collegamenti o altri file associati a <tt>pippo</tt>, o rimuove i file creati da quel pacchetto. (Si veda anche <ref id="virtual">.)
ru: Этот сценарий, обычно, изменяет ссылки или другие файлы, связанные с пакетом <tt>foo</tt>, и/или удаляет файлы, созданные пакетом. (См. также <ref id="virtual">.)

source: Currently all of the control files can be found in directory <tt>/var/lib/dpkg/info</tt>. The files relevant to package <tt>foo</tt> begin with the name "foo" and have file extensions of "preinst", "postinst", etc., as appropriate. The file <tt>foo.list</tt> in that directory lists all of the files that were installed with the package <tt>foo</tt>. (Note that the location of these files is a dpkg internal; you should not rely on it.)
it: Attualmente tutti i file di controllo si possono trovare nella directory <tt>/var/lib/dpkg/info</tt>. I file attinenti al pacchetto <tt>pippo</tt> iniziano con il nome "pippo" ed hanno le estensioni "preinst", "postinst", ecc., a seconda della funzione. Il file <tt>pippo.list</tt> nella stessa directory elenca tutti i file installati con il pacchetto <tt>pippo</tt>. (Si noti che la localizzazione di questi file è un dato tecnico interno di dpkg; non ci si dovrebbe fare affidamento.)
ru: В настоящее время, все управляющие файлы находятся в каталоге <tt>/var/lib/dpkg/info</tt>. Файлы, относящиеся к пакету <tt>foo</tt>, начинаются с имени «foo» и имеют расширения «preinst», «postinst» и т.д., соответственно. Файл <tt>foo.list</tt> в этом каталоге содержит список всех файлов, установленных с пакетом <tt>foo</tt> (заметим, что местонахождение файлов определяется dpkg; вам не следует полагаться на упомянутый каталог).

source: What is an <em>Essential</em>, <em>Required</em>, <em>Important</em>, <em>Standard</em>, <em>Optional</em>, or <em>Extra</em> package?
it: Cosa sono i pacchetti <em>Essential</em>, <em>Required</em>, <em>Important</em>, <em>Standard</em>, <em>Optional</em> o <em>Extra</em>?
ru: Что такое <em>Значимый</em>, <em>Требуемый</em>, <em>Важный</em>, <em>Стандартный</em>, <em>Необязательный</em> или <em>Дополнительный</em> (<em>Essential</em>, <em>Required</em>, <em>Important</em>, <em>Standard</em>, <em>Optional</em>, <em>Extra</em>) пакет?

source: Each Debian package is assigned a <em>priority</em> by the distribution maintainers, as an aid to the package management system. The priorities are:
it: Ad ogni pacchetto Debian viene assegnata una <em>priorità</em> dai manutentori della distribuzione, come aiuto al sistema di gestione dei pacchetti. Le priorità sono:
ru: Чтобы помочь системе управления пакетами, каждому пакету в Debian сопровождающими дистрибутива назначен <em>приоритет</em>. Возможные приоритеты:

source: <strong>Required</strong>: packages that are necessary for the proper functioning of the system.
it: <strong>Required (Richiesto)</strong>: pacchetti necessari al corretto funzionamento del sistema.
ru: <strong>Требуемый (Required)</strong>: пакеты, необходимые для правильного функционирования системы.

source: This includes all tools that are necessary to repair system defects. You must not remove these packages or your system may become totally broken and you may probably not even be able to use dpkg to put things back. Systems with only the Required packages are probably unusable, but they do have enough functionality to allow the sysadmin to boot and install more software.
it: Comprendono tutti gli strumenti che sono necessari per riparare i difetti di sistema. Questi pacchetti non devono essere rimossi o il proprio sistema potrebbe diventare completamente non funzionante e probabilmente non si riuscirebbe nemmeno ad usare dpkg per rimettere le cose a posto. I sistemi con solo i pacchetti Required sono probabilmente inutilizzabili, ma hanno abbastanza funzionalità per permettere all'amministratore di sistema di avviare ed installare altri programmi.
ru: Сюда включены все инструменты, необходимые для устранения неполадок в системе. Вам не следует удалять эти пакеты, иначе ваша система может перестать работать, и вы, что не исключено, даже не сможете использовать dpkg для того, чтобы вернуть всё назад. Функциональность системы, в которой установлены только Требуемые пакеты, не слишком высока, но достаточна для того, чтобы позволить системному администратору загрузить её и установить больше программного обеспечения.

source: <strong>Important</strong> packages should be found on any Unix-like system.
it: <strong>Important (Importante)</strong>: pacchetti che si dovrebbero trovare su tutti i sistemi *nix.
ru: <strong>Важный (Important)</strong>: пакеты, которые должны быть в любой Unix-системе.

source: Other packages which the system will not run well or be usable without will be here. This does <em>NOT</em> include Emacs or X or TeX or any other large applications. These packages only constitute the bare infrastructure.
it: Comprendono altri pacchetti senza i quali il sistema non funziona bene o non sarebbe utilizzabile. Tra questi <em>NON</em> sono inclusi Emacs o X o TeX o qualsiasi altra grossa applicazione. Questi pacchetti costituiscono solo l'infrastruttura di base.
ru: Без этих программ не смогут работать или не будут обладать полной функциональностью другие пакеты. К ним <em>НЕ</em> относятся Emacs, X, Tex или любое другое большое приложение. Это пакеты, образующие базовую структуру.

source: <strong>Standard</strong> packages are standard on any Linux system, including a reasonably small but not too limited character-mode system. Tools are included to be able to browse the web (using w3m), send e-mail (with mutt) and download files from FTP servers.
it: <strong>Standard</strong>: pacchetti comuni su qualsiasi sistema Linux, compreso un ragionevolmente piccolo ma nemmeno troppo limitato sistema a caratteri. Sono inclusi strumenti per poter navigare nel web (usando w3m), inviare posta elettronica (con mutt) e scaricare file da server FTP.
ru: <strong>Стандартный (Standard)</strong>: пакеты, которые есть в любой Linux системе, даже сравнительно небольшой, но не слишком ограниченной системе, работающей только в текстовом режиме. Сюда входят: программа для просмотра веб (с помощью w3m), отправки почты (mutt) и программа для скачивания файлов с FTP-серверов.

source: This is what will install by default if users do not select anything else. It does not include many large applications, but it does include the Python interpreter and some server software like OpenSSH (for remote administration), Exim (for mail delivery, although it can be configured for local delivery only), an identd server (pidentd) and the RPC portmapper (<tt>portmap</tt>). It also includes some common generic documentation that most users will find helpful.
it: Questo è ciò che viene installato di base se l'utente non seleziona nient'altro. Non include molte grosse applicazioni, ma include l'interprete Python e qualche software server come OpenSSH (per amministrazione da remoto), Exim (per la consegna della posta, anche se può essere configurato solo per la consegna locale), un server identd (pidentd) e lo strumento portmap RPC (<tt>portmap</tt>). Include anche della documentazione generica comune che può essere utile per la maggior parte degli utenti.
ru: Это то, что будет установлено по умолчанию, если пользователь не выберет чего-либо ещё. Сюда не входят многие большие приложения, но есть интерпретатор Python и некоторое серверное ПО типа OpenSSH (для удалённого управления), Exim (для доставки почты, хотя он может быть настроен только на локальную доставку), сервер identd (pidentd) и RPC зеркало портов (<tt>portmap</tt>).

source: <strong>Optional</strong> packages include all those that you might reasonably want to install if you did not know what it was, or do not have specialized requirements.
it: <strong>Optional (Opzionale)</strong>: pacchetti che comprendono tutto quello che si può voler installare senza nemmeno sapere cos'è, o se non si hanno delle necessità particolari.
ru: <strong>Необязательный (Optional)</strong>: пакеты, которые вы, как правило, можете захотеть установить, если не вполне осознаете свои потребности.

source: This includes X, a full TeX distribution, and lots of applications.
it: Comprendono X, una distribuzione completa di TeX e molte applicazioni.
ru: Сюда входят X, полный дистрибутив TeX и множество других приложений.
