Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: The <prgn>mirror</prgn> program is generally useful for updating local copies of remote directory trees. The files fetched need not be Debian files. (Since <prgn>mirror</prgn> is a Perl script, it can also run on non-Unix systems.) Though the <prgn>mirror</prgn> program provides mechanisms for excluding files names of which match user-specified strings, this program is most useful when the objective is to download whole directory trees, rather than selected packages.
it: Il programma <prgn>mirror</prgn> è generalmente utile per aggiornare copie locali di alberi di directory remoti. I file prelevati non devono necessariamente essere file Debian. (Dato che <prgn>mirror</prgn> è uno script in Perl, può anche essere eseguito su sistemi non Unix.) Sebbene il programma <prgn>mirror</prgn> fornisca meccanismi per escludere nomi di file che corrispondono a stringhe definite dall'utente, questo programma è più utile quando l'obiettivo è scaricare interi alberi di directory, piuttosto che pacchetti selezionati.
ru: Обычно, программа <prgn>mirror</prgn> полезна для обновления локальных копий удалённых деревьев каталогов. Обновляемые файлы не обязательно должны быть файлами Debian. (Так как <prgn>mirror</prgn> &mdash; Perl-сценарий, он может работать не только на Unix системах.) Хотя программа <prgn>mirror</prgn> и предоставляет механизмы для исключения имён файлов с помощью указываемых пользователем строк, она наиболее полезна при скачивании всего дерева каталогов, а не выборочных пакетов.

source: dpkg-mountable adds an access method called `mountable' to dselect's list, which allows you to install from any file system specified in /etc/fstab. For example, the archive could be a normal hard disk partition or an NFS server, which it will automatically mount and umount for you if necessary.
it: dpkg-mountable aggiunge un metodo di accesso chiamato "mountable" alla lista di dselect, che permette di installare da qualsiasi filesystem specificato in /etc/fstab. Per esempio, l'archivio potrebbe essere una normale partizione di un hard disk o un server NFS che vengono, se necessario, montati e smontati automaticamente.
ru: dpkg-mountable добавляет метод доступа, называемый «mountable» в список dselect, который позволяет устанавливать файлы из любой файловой системы, указанной в /etc/fstab (например, обычного раздела жёсткого диска или NFS-сервера), и при необходимости, самостоятельно монтирует и размонтирует файловые системы.

source: It also has some extra features not found in the standard dselect methods, such as provision for a local file tree (either parallel to the main distribution or totally separate), and only getting packages which are required, rather than the time-consuming recursive directory scan, as well as logging of all dpkg actions in the install method.
it: Possiede anche alcune caratteristiche aggiuntive non presenti nei metodi standard di dselect, come la possibilità di un albero locale di file (sia parallelo alla distribuzione principale sia totalmente separato), e il recupero dei soli pacchetti richiesti, piuttosto di una scansione ricorsiva delle directory dispendiosa in termini di tempo, così come la registrazione di tutte le azioni di dpkg nel metodo di installazione.
ru: Также, он имеет некоторые дополнительные возможности, отсутствующие у стандартных методов dselect, например подготовка локального дерева файлов (или параллельно с главным дистрибутивом или полностью отдельно), что позволяет не тратить время на рекурсивное сканирование каталогов для получении только требуемых пакетов, а также протоколирование всех действий dpkg по установке.

source: Must I go into single user mode in order to upgrade a package?
it: È necessario entrare in modalità singolo-utente per aggiornare un pacchetto?
ru: Нужно ли переходить в однопользовательский режим, чтобы обновить пакет?

source: No. Packages can be upgraded in place, even in running systems. Debian has a <tt>start-stop-daemon</tt> program that is invoked to stop, then restart running process if necessary during a package upgrade.
it: No. I pacchetti possono essere aggiornati al volo, anche su sistemi in esecuzione. Debian ha un programma <tt>start-stop-daemon</tt> che viene invocato per fermare e poi riavviare i processi in esecuzione, se necessario, durante l'aggiornamento di un pacchetto.
ru: Нет. Пакеты можно обновлять сразу, даже при работающей системе. Если во время обновления пакета требуется остановка процесса, то на этот случай в Debian есть программа <tt>start-stop-daemon</tt>, которая останавливает, а затем перезапускает работавший ранее процесс.

source: Do I have to keep all those .deb archive files on my disk?
it: È necessario tenere tutti questi file di archivio .deb sul disco?
ru: Нужно ли хранить на диске все архивные файлы .deb?

source: No. If you have downloaded the files to your disk then after you have installed the packages, you can remove them from your system, e.g. by running <tt>aptitude clean</tt>.
it: No. Se i file sono stati scaricati nel proprio disco, allora possono essere rimossi dal sistema dopo l'installazione dei pacchetti; lo si può fare ad esempio eseguendo <tt>aptitude clean</tt>.
ru: Нет. Если вы скачали файлы на диск, то после установки пакетов вы можете удалить их из системы, например с помощью команды <tt>aptitude clean</tt>.

source: How can I keep a log of the packages I added to the system? I'd like to know when which package upgrades and removals have occured!
it: Come si può tenere un registro dei pacchetti che sono stati aggiunti al sistema? Vorrei sapere quali aggiornamenti e rimozioni di pacchetti sono stati fatti!
ru: Как сохранить журнал пакетов, которые я добавил в систему? Хотелось бы знать, какие пакеты обновлялись и удалялись!

source: Passing the <tt>--log</tt>-option to <prgn>dpkg</prgn> makes <prgn>dpkg</prgn> log status change updates and actions. It logs both the <prgn>dpkg</prgn>-invokation (e.g.
it: Passare l'opzione <tt>--log</tt> a <prgn>dpkg</prgn> fa sì che <prgn>dpkg</prgn> registri i cambiamenti di stato, gli aggiornamenti e le azioni. Registra sia l'invocazione di <prgn>dpkg</prgn> (ad esempio
ru: Параметром <tt>--log</tt> можно заставить <prgn>dpkg</prgn> вести журнал изменений и выполняемых действий. Протоколируются все вызовы <prgn>dpkg</prgn> (например

source: ) and the results (e.g.
it: ) sia il risultato (ad esempio
ru: ) и результаты (например

source: ) If you'd like to log all your <prgn>dpkg</prgn> invokations (even those done using frontends like <prgn>aptitude</prgn>), you could add
it: ). Se si desidera tenere un registro di tutte le proprie invocazioni di <prgn>dpkg</prgn> (anche quelle fatte attraverso frontend come <prgn>aptitude</prgn>), si può aggiungere
ru: ). Если вы хотите протоколировать все вызовы <prgn>dpkg</prgn> (даже те, которые выполняются другими программами, например <prgn>aptitude</prgn>), то добавьте

source: to your <file>/etc/dpkg/dpkg.cfg</file>. Be sure the created logfile gets rotated periodically. If you're using <prgn>logrotate</prgn>, this can be achieved by creating a file <file>/etc/logrotate.d/dpkg</file> with contents
it: al proprio <file>/etc/dpkg/dpkg.cfg</file>. Assicurarsi che il file di registro creato venga periodicamente ruotato. Se si usa <prgn>logrotate</prgn>, questo può essere fatto creando un file <file>/etc/logrotate.d/dpkg</file> che contenga
ru: в <file>/etc/dpkg/dpkg.cfg</file>. Убедитесь, что файл журнала периодически ротируется. Если вы используете <prgn>logrotate</prgn>, то можно создать файл <file>/etc/logrotate.d/dpkg</file> с содержимым

source: More details on <prgn>dpkg</prgn> logging can be found in the <manref section="1" name="dpkg"> manual page.
it: Si possono trovare ulteriori dettagli sul registro di <prgn>dpkg</prgn> nella pagina di manuale <manref section="1" name="dpkg">.
ru: Подробней о протоколировании <prgn>dpkg</prgn> можно прочитать в справочной странице <manref section="1" name="dpkg">.

source: <prgn>aptitude</prgn> logs the package installations, removals, and upgrades that it intends to perform to <file>/var/log/aptitude</file>. Note that the <em>results</em> of those actions are not recorded in this file!
it: <prgn>aptitude</prgn> tiene un registro delle installazioni, rimozioni e degli aggiornamenti di pacchetti che intende effettuare in <file>/var/log/aptitude</file>. Notare che in questo file non sono registrati i <em>risultati</em> di queste azioni.
ru: <prgn>aptitude</prgn> протоколирует намерение установить, удалить и обновить пакеты в файл <file>/var/log/aptitude</file>. Заметим, что <em>результаты</em> этих действий в этом файле не сохраняются!

source: Another way to record your actions is to run your package management session within the <manref section="1" name="script"> program.
it: Un altro modo di registrare le proprie azioni è di eseguire la propria sessione all'interno del programma <manref section="1" name="script">.
ru: Ещё один способ протоколирования действий &mdash; запускать сеанс управления пакетами внутри программы <manref section="1" name="script">.

source: Can I automatically update the system?
it: È possibile aggiornare automaticamente il sistema?
ru: Возможно автоматическое обновление системы?

source: Yes. You can use <prgn>cron-apt</prgn>, this tool updates the system at regular interval by using a cron job. By default it just updates the package list and download new packages without installing.
it: Sì. Si può usare <prgn>cron-apt</prgn>; questo strumento aggiorna il sistema ad intervalli regolari usando un compito cron. In modo predefinito aggiorna solamente l'elenco dei pacchetti e scarica i nuovi pacchetti senza installarli.
ru: Да. Вы можете использовать <prgn>cron-apt</prgn>; этот инструмент обновляет систему через равные промежутки времени с помощью задания cron. По умолчанию, выполняется только обновление списка и скачивание новых пакетов без установки.

source: Note: Automatic upgrade of packages is <strong>NOT</strong> recommended in <em>testing</em> or <em>unstable</em> systems as this might bring unexpected behaviour and remove packages without notice.
it: Nota bene: l'aggiornamento automatico di pacchetti <strong>NON</strong> è raccomandato nei sistemi <em>testing</em> o <em>unstable</em> dato che potrebbe portare a comportamenti inattesi e rimuovere pacchetti senza preavviso.
ru: Замечание: автоматическое обновление пакетов выполнять <strong>НЕ</strong> рекомендуется в <em>тестовых</em> или <em>нестабильных</em> системах, так как это может привести к неожиданному поведению и удалению пакетов без уведомления.

source: I have several machines how can I download the updates only one time?
it: Se si hanno svariate macchine come è possibile scaricare gli aggiornamenti una volta sola?
ru: Есть несколько машин, как скачивать для них обновления только один раз?

source: If you have more than one Debian machine on your network, it is useful to use <prgn>apt-proxy</prgn> to keep all of your Debian systems up-to-date.
it: Se si ha più di una macchina Debian nella propria rete, è utile usare <prgn>apt-proxy</prgn> per mantenere aggiornati tutti i propri sistemi Debian.
ru: Если у вас более одной машины Debian в сети, то для поддержания систем Debian в актуальном состоянии можно использовать <prgn>apt-proxy</prgn>.

source: <prgn>apt-proxy</prgn> reduces the bandwidth requirements of Debian mirrors by restricting the frequency of Packages, Releases and Sources file updates from the back end and only doing a single fetch for any file, independently of the actual request it from the proxy. <prgn>apt-proxy</prgn> automatically builds a Debian HTTP mirror based on requests which pass through the proxy.
it: <prgn>apt-proxy</prgn> riduce i requisiti in termini di banda per i mirror Debian, riducendo la frequenza degli aggiornamenti dei file Packages, Releases e Sources dal backend e scaricando ogni file una singola volta, indipendentemente dalle effettive richieste per esso al proxy. <prgn>apt-proxy</prgn> genera automaticamente un mirror HTTP Debian in base alle richieste che passano per il proxy.
ru: <prgn>apt-proxy</prgn> сокращает затраты полосы пропускания серверов Debian, ограничивая частоту обновлений файлов Packages, Releases и Sources и выполняет только однократное получения любого файла, независимо от фактического запроса к прокси. <prgn>apt-proxy</prgn> автоматически строит HTTP-зеркало Debian HTTP, основываясь на запросах, которые проходят через прокси.

source: For more details, see the apt-proxy homepage at <url id="http://apt-proxy.sourceforge.net/">
it: Per maggiori dettagli si veda la pagina web di apt-proxy all'indirizzo <url id="http://apt-proxy.sourceforge.net/">.
ru: Подробности смотрите на домашней странице <url id="http://apt-proxy.sourceforge.net/" name="apt-proxy">.

source: Of course, you can get the same benefit if you are already using a standard caching proxy and all your systems are configured to use it.
it: Naturalmente si possono ottenere gli stessi benefici se si sta già usando un proxy standard con cache e se tutti i propri sistemi sono configurati per farne uso.
ru: Естественно, вы можете получить такое же преимущество, если уже используете стандартный кэширующий прокси, и все системы настроены на его использование.

source: Debian and the kernel
it: Debian e il kernel
ru: Debian и ядро

source: Can I install and compile a kernel without some Debian-specific tweaking?
it: Si può installare e compilare un kernel senza alcun adattamento specifico per Debian?
ru: Можно ли установить и собрать ядро без некоторых специфичных для Debian настроек?

source: Yes.
it: Sì.
ru: Да.

source: There's only one common catch: the Debian C libraries are built with the most recent <em>stable</em> releases of the <strong>kernel</strong> headers. If you happen to need to compile a program with kernel headers newer than the ones from the stable branch, then you should either upgrade the package containing the headers (<package>libc6-dev</package>), or use the new headers from an unpacked tree of the newer kernel. That is, if the kernel sources are in <file>/usr/src/linux</file>, then you should add <tt>-I/usr/src/linux/include/</tt> to your command line when compiling.
it: C'è solo una trappola: le librerie C di Debian sono compilate con il più recente rilascio <em>stabile</em> degli header del <strong>kernel</strong>. Se si ha bisogno di compilare un programma con gli header del kernel più nuovi rispetto a quelli nel ramo stabile allora si dovrebbe aggiornare il pacchetto contenente gli header (<package>libc6-dev</package>) oppure usare i nuovi header da un albero di directory del kernel più recente. Cioè, se i sorgenti del kernel sono in <file>/usr/src/linux</file>, si dovrebbe aggiungere <tt>-I/usr/src/linux/include/</tt> alla propria riga di comando quando si compila.
ru: Есть только одно общее правило: библиотеки языка C в Debian собираются на самых свежих заголовочных файлах <strong>ядра</strong> из <em>стабильных</em> выпусков. Если вам нужно собрать программу с заголовочными файлами ядра, которые новее, чем те, что находятся в стабильном выпуске, то вы должны обновить пакет, содержащий заголовочные файлы (<package>libc6-dev</package>), или использовать заголовочные файлы из распакованного дерева более нового ядра. То есть, если исходные коды ядра находятся в <file>/usr/src/linux</file>, то вы должны добавить <tt>-I/usr/src/linux/include/</tt> в командную строку компиляции.

source: What tools does Debian provide to build custom kernels?
it: Quali strumenti fornisce Debian per costruire kernel personalizzati?
ru: Какие инструменты для самостоятельной сборки ядра есть в Debian?

source: Users who wish to (or must) build a custom kernel are encouraged to download the package <package>kernel-package</package>. This package contains the script to build the kernel package, and provides the capability to create a Debian <package>linux-image-<var>version</var></package> package just by running the command
it: Gli utenti che desiderano (o devono) compilare un kernel personalizzato sono incoraggiati a scaricare il pacchetto <package>kernel-package</package>. Questo pacchetto contiene lo script per compilare un pacchetto kernel e fornisce la possibilità di creare un pacchetto Debian <package>linux-image-<var>versione</var></package> semplicemente eseguendo il comando
ru: Пользователям, которые хотят (или должны) собрать собственное ядро, будет полезен пакет <package>kernel-package</package>. Он содержит сценарий для построения пакета ядра и позволяет создавать пакеты Debian <package>linux-image-<var>версия</var></package> одной командой

source: in the top-level kernel source directory. Help is available by executing the command
it: nella directory dei sorgenti del kernel di livello più alto. L'aiuto è disponibile eseguendo il comando
ru: запущенной в корневом каталоге дерева исходных кодов ядра. Справку можно получить по команде

source: and through the manual page <manref section="1" name="make-kpkg">.
it: e attraverso la pagina di manuale <manref section="1" name="make-kpkg">.
ru: и в справочной странице <manref section="1" name="make-kpkg">.

source: Users must separately download the source code for the most recent kernel (or the kernel of their choice) from their favorite Linux archive site, unless a <package>linux-source-<var>version</var></package> package is available (where <var>version</var> stands for the kernel version).
it: Gli utenti devono scaricare separatamente il codice sorgente per il kernel più recente (o un kernel a propria scelta) dall'archivio del proprio sito Linux preferito, a meno che non sia disponibile un pacchetto <package>linux-source-<var>versione</var></package> (dove <var>versione</var> rappresenta la versione del kernel).
ru: Пользователи должны отдельно скачивать последнюю версию исходного кода ядра (или нужную им версию ядра) со своего любимого Linux-архива, если у них нет пакета <package>linux-source-<var>версия</var></package> (где <var>версия</var> означает версию ядра).

source: Detailed instructions for using the <package>kernel-package</package> package are given in the file <file>/usr/share/doc/kernel-package/README.gz</file>.
it: Istruzioni dettagliate sull'uso del pacchetto <package>kernel-package</package> sono fornite nel file <file>/usr/share/doc/kernel-package/README.gz</file>.
ru: Подробные инструкции по использованию пакета <package>kernel-package</package> даны в файле <file>/usr/share/doc/kernel-package/README.gz</file>.

source: How can I make a custom boot floppy?
it: Come posso creare un floppy di avvio personalizzato?
ru: Как сделать собственную загрузочную дискету?

source: This task is greatly aided by the Debian package <package>boot-floppies</package>, normally found in the <tt>admin</tt> section of the Debian FTP archive. Shell scripts in this package produce boot floppies in the <tt>SYSLINUX</tt> format. These are <tt>MS-DOS</tt> formatted floppies whose master boot records have been altered so that they boot Linux directly (or whatever other operating system has been defined in the <file>syslinux.cfg</file> file on the floppy). Other scripts in this package produce emergency root disks and can even reproduce the base disks.
it: Questo compito è molto semplificato dal pacchetto Debian <package>boot-floppies</package>, che si trova normalmente nella sezione <tt>admin</tt> dell'archivio FTP Debian. Gli script di shell in questo pacchetto producono floppy di avvio nel formato <tt>SYSLINUX</tt>. Questi sono floppy formattati <tt>MS-DOS</tt> i cui master boot record sono stati alterati così che possano avviare direttamente Linux (o qualsiasi altro sistema operativo sia stato definito nel file <file>syslinux.cfg</file> sul floppy). Altri script in questo pacchetto producono dischi di root di emergenza e possono anche riprodurre i dischi base.
ru: С этой задачей должен справляться Debian пакет <package>boot-floppies</package>, который можно найти в разделе <tt>admin</tt> FTP-архива Debian. Сценарии оболочки в этом пакете создают загрузочные дискеты в формате <tt>SYSLINUX</tt>. Это отформатированные под систему <tt>MS-DOS</tt> дискеты, в которых основная загрузочная запись напрямую загружает Linux (или другую операционную систему, которая указана в файле <file>syslinux.cfg</file> на дискете). Другие сценарии этого пакета создают дискеты восстановления с корневой файловой системой и даже создают дискеты для базовой установки.

source: You will find more information about this in the <file>/usr/share/doc/boot-floppies/README</file> file after installing the <package>boot-floppies</package> package.
it: Maggiori informazioni su questo argomento si trovano nel file <file>/usr/share/doc/boot-floppies/README</file> dopo aver installato il pacchetto <package>boot-floppies</package>.
ru: Подробней об этом можно прочесть в файле <file>/usr/share/doc/boot-floppies/README</file> после установки пакета <package>boot-floppies</package>.

source: What special provisions does Debian provide to deal with modules?
it: Quali strumenti speciali fornisce Debian per lavorare con i moduli?
ru: Есть какие-то особенности при работе с модулями в Debian?

source: Debian's <package>modconf</package> package provides a shell script (<file>/usr/sbin/modconf</file>) which can be used to customize the configuration of modules. This script presents a menu-based interface, prompting the user for particulars on the loadable device drivers in his system. The responses are used to customize the file <file>/etc/modules.conf</file> (which lists aliases, and other arguments that must be used in conjunction with various modules) through files in <file>/etc/modutils/</file>, and <file>/etc/modules</file> (which lists the modules that must be loaded at boot time).
it: Il pacchetto <package>modconf</package> di Debian fornisce uno script di shell (<file>/usr/sbin/modconf</file>) che può essere usato per personalizzare la configurazione dei moduli. Questo script presenta un'interfaccia basata su menu che chiede all'utente dettagli sui driver di device caricabili nel suo sistema. Le risposte sono usate per personalizzare il file <file>/etc/modules.conf</file> (che elenca gli alias e altri argomenti che devono essere usati in congiunzione con i vari moduli) attraverso i file in <file>/etc/modutils/</file> e <file>/etc/modules</file> (che elenca i moduli che devono essere caricati all'avvio).
ru: В Debian есть пакет <package>modconf</package>, содержащий сценарий оболочки (<file>/usr/sbin/modconf</file>), который может использоваться для настройки модулей. Этот сценарий имеет интерфейс на основе меню, с помощью которого пользователь может определить, какие драйверы устройств нужно загружать в системе. Указания пользователя будут отражены в файле <file>/etc/modules.conf</file> (содержит список псевдонимов и параметров, используемых различными модулями) совместно с файлами в каталоге <file>/etc/modutils/</file> и файлом <file>/etc/modules</file> (содержит список модулей, которые должны быть загружены во время запуска системы).
