Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: <em>sid</em> or <em>unstable</em> is the place where most of the packages are initially uploaded. It will never be released directly, because packages which are to be released will first have to be included in <em>testing</em>, in order to be released in <em>stable</em> later on. sid contains packages for both released and unreleased architectures.
it: <em>sid</em> o <em>unstable</em> è il posto in cui la maggior parte dei pacchetti viene inizialmente caricata. Non sarà mai direttamente rilasciata, perché i pacchetti che devono essere rilasciati devono prima essere inclusi in <em>testing</em>, per poter essere rilasciati in <em>stable</em> più tardi. sid contiene pacchetti sia per architetture rilasciate che non.
ru: <em>sid</em> или <em>unstable</em> &mdash; это место, куда попадает большая часть пакетов при первоначальной закачке. Он никогда не будет выпущен, так как пакет сначала должен быть включён в <em>testing</em>, а позже в <em>stable</em>. sid содержит пакеты для выпускаемых и невыпускаемых архитектур.

source: The name "sid" also comes from the "Toy Story" animated motion picture: Sid was the boy next door who destroyed toys :-)
it: Anche il nome "sid" proviene dal film d'animazione "Toy Story": Sid era il bambino della porta accanto che distruggeva i giocattoli :-)
ru: Имя «sid» также взято из мультфильма «История Игрушек»: там Sid &mdash; это соседский мальчишка, который ломает игрушки :-)

source: <footnote><p>When the present-day sid did not exist, the FTP site organization had one major flaw: there was an assumption that when an architecture is created in the current unstable, it will be released when that distribution becomes the new stable. For many architectures that isn't the case, with the result that those directories had to be moved at release time. This was impractical because the move would chew up lots of bandwidth. </p><p>The archive administrators worked around this problem for several years by placing binaries for unreleased architectures in a special directory called "sid". For those architectures not yet released, the first time they were released there was a link from the current stable to sid, and from then on they were created inside the unstable tree as normal. This layout was somewhat confusing to users. </p><p>With the advent of package pools (see <ref id="pools">), binary packages began to be stored in a canonical location in the pool, regardless of the distribution, so releasing a distribution no longer causes large bandwidth consumption on the mirrors (there is, however, a lot of gradual bandwidth consumption throughout the development process).</p></footnote>
it: <footnote><p>Quando l'attuale sid non esisteva, l'organizzazione del sito FTP aveva un grande difetto: c'era l'assunto che quando un'architettura veniva creata nell'attuale unstable, sarebbe stata rilasciata quando quella distribuzione diventava la nuova stable. Per molte architetture questo non è vero, con il risultato che quelle directory dovevano essere spostate al momento del rilascio. Ciò era poco pratico, poiché lo spostamento avrebbe divorato grosse quantità di banda. </p><p>Gli amministratori dell'archivio hanno aggirato questo problema per diversi anni collocando i binari delle architetture non rilasciate in una directory speciale chiamata "sid". Per quelle architetture non ancora rilasciate, al primo rilascio c'era un collegamento da stable a sid e da quel momento in poi venivano create all'interno dell'albero unstable come di norma. Tutto ciò era motivo di confusione per gli utenti. </p><p>Con l'avvento dei pool di pacchetti (si veda <ref id="pools">), i pacchetti binari cominciarono ad essere immagazzinati in una posizione canonica nel pool, indipendentemente dalla distribuzione, così il rilascio di una distribuzione non determina più grande dispendio di banda sui mirror (c'è, ovviamente, un notevole graduale consumo di banda durante la fase di sviluppo). </p></footnote>
ru: <footnote><p> Когда sid ещё не существовал, в организации FTP-сайта был один существенный изъян: подразумевалось, что когда архитектура создаётся в текущем нестабильном дистрибутиве, она будет выпущена, когда этот дистрибутив станет новым стабильным. Для многих архитектур этого не происходит, и эти каталоги будут перемещены во время выпуска. Это непрактично, так как для перемещения требуется занять большую полосу пропускания в канале. </p><p> Несколько лет администраторы архивов обходили эту проблему помещая двоичные файлы для невыпущенных архитектур в специальный каталог, называемый «sid». Для невыпущенных архитектур при их первом выпуске создавалась ссылка из текущего стабильного дистрибутива на sid, и затем оттуда на них создавались ссылки из нестабильного дерева как обычно. Такое расположение путало пользователей. </p><p>С появлением пула пакетов (смотрите <ref id="pools">), двоичные пакеты стали храниться в алфавитном порядке в пуле, независимо от дистрибутива, поэтому выпуск больше не приводит к огромному потреблению полосы пропускания канала на серверах-зеркалах (однако, есть постепенное нарастание потребления полосы в процессе разработки).</p></footnote>

source: What does the stable directory contain?
it: Cosa contiene la directory stable?
ru: Что содержится в каталоге stable?

source: stable/main/: This directory contains the packages which formally constitute the most recent release of the &debian; system.
it: stable/main/: questa directory contiene i pacchetti che costituiscono formalmente il rilascio più recente del sistema &debian;.
ru: stable/main/: Этот каталог содержит пакеты, которые формально определяют последний выпуск системы &debian;.

source: These packages all comply with the <url id="http://www.debian.org/social_contract#guidelines" name="Debian Free Software Guidelines">, and are all freely usable and distributable.
it: Tutti questi pacchetti sono conformi alle <url id="http://www.debian.org/social_contract#guidelines" name="DFSG - Linee guida Debian per il software libero"> e sono tutti liberamente utilizzabili e distribuibili.
ru: Эти пакеты соответствуют <url id="http://www.debian.org/social_contract#guidelines" name="критериям Debian по определению Свободного ПО (DFSG)">, и свободны во всём при использовании и распространении.

source: stable/non-free/: This directory contains packages distribution of which is restricted in a way that requires that distributors take careful account of the specified copyright requirements.
it: stable/non-free/: questa directory contiene i pacchetti la cui distribuzione è limitata in modo tale da richiedere che i distributori prendano attentamente in considerazione i loro requisiti specifici relativi al copyright.
ru: stable/non-free/: Этот каталог содержит пакеты дистрибутива, имеющие лицензионные ограничения для распространителей.

source: For example, some packages have licenses which prohibit commercial distribution. Others can be redistributed but are in fact shareware and not free software. The licenses of each of these packages must be studied, and possibly negotiated, before the packages are included in any redistribution (e.g., in a CD-ROM).
it: Per esempio, alcuni pacchetti hanno licenze che ne vietano la distribuzione commerciale. Altri possono essere redistribuiti, ma sono di fatto shareware e non software libero. Le licenze di ognuno di questi pacchetti devono essere studiate e possibilmente negoziate prima che tali pacchetti possano essere inclusi in qualsiasi redistribuzione (per esempio, in un CD-ROM).
ru: Например, некоторые пакеты имеют лицензии, которые запрещают коммерческое распространение. Другие пакеты можно распространять третьим лицам, но только как условно-бесплатное и несвободное ПО. Перед тем, как включать пакеты в другие дистрибутивы (например, на CD-диск) лицензии каждого из таких пакетов должны быть изучены и, возможно, не приняты.

source: stable/contrib/: This directory contains packages which are DFSG-free and <em>freely distributable</em> themselves, but somehow depend on a package that is <em>not</em> freely distributable and thus available only in the non-free section.
it: stable/contrib/: questa directory contiene i pacchetti che sono di per sé liberi in base alle DFSG e <em>liberamente distribuibili</em>, ma dipendono in qualche modo da un pacchetto che <em>non</em> è liberamente distribuibile ed è quindi disponibile solo nella sezione non-free.
ru: stable/contrib/: Этот каталог содержит пакеты, которые DFSG-свободны и сами по себе <em>распространяются свободно</em>, однако зависят от <em>НЕ</em> свободных продуктов из раздела non-free.

source: What does the testing distribution contain?
it: Cosa contiene la distribuzione testing?
ru: Что содержится в тестируемом дистрибутиве?

source: Packages are installed into the `testing' directory after they have undergone some degree of testing in <qref id="unstable">unstable</qref>.
it: I pacchetti vengono inseriti nella directory "testing" dopo aver subito un periodo di test in <qref id="unstable">unstable</qref>.
ru: Пакеты попадают в каталог «testing» после того, как пройдут часть проверок в <qref id="unstable">unstable</qref>.

source: They must be in sync on all architectures where they have been built and mustn't have dependencies that make them uninstallable; they also have to have fewer release-critical bugs than the versions currently in testing. This way, we hope that `testing' is always close to being a release candidate.
it: Devono essere sincronizzati in tutte le architetture per le quali sono stati compilati e non devono avere dipendenze tali da renderli non installabili; devono inoltre avere meno bug critici per il rilascio delle versioni attualmente in testing. In questo modo, si auspica che "testing" sia sempre vicina ad essere una candidata al rilascio.
ru: Они должны быть синхронизированы для всех архитектур, на которых они собираются и не должны иметь зависимостей, из-за которых их нельзя удалить из системы; также они должны иметь меньше ошибок, критических для выпуска, чем версии находящиеся в «testing». Таким образом, мы надеемся, что «testing» всегда близок к состоянию кандидата на выпуск.

source: More information about the status of "testing" in general and the individual packages is available at <url id="http://www.debian.org/devel/testing">.
it: Maggiori informazioni sullo stato di "testing" in generale e dei singoli pacchetti sono disponibili su <url id="http://www.debian.org/devel/testing">.
ru: Более подробную информацию о «testing» в общем и об отдельных пакетах можно найти <url id="http://www.debian.org/devel/testing" name="здесь">.

source: What about "testing"? How is it `frozen'?
it: Cosa dire di "testing"? Come viene "congelata"?
ru: Что происходит «testing»? Как её «замораживают»?

source: When the "testing" distribution is mature enough, the release manager starts `freezing' it. The normal propagation delays are increased to ensure that as little as possible new bugs from "unstable" enter "testing".
it: Quando la distribuzione "testing" è abbastanza matura, il responsabile del rilascio inizia a "congelarla". I normali ritardi di diffusione vengono aumentati per assicurare che entri da "unstable" in "testing" il minor numero di bug possibile.
ru: Когда дистрибутив «testing» почти готов, ответственный за выпуск «замораживает» его. Обычное продвижение новых версий пакетов задерживается для того, чтобы как можно меньше новых ошибок попало из «unstable» в «testing».

source: After a while, the "testing" distribution becomes truly `frozen'. This means that all new packages that are to propagate to the "testing" are held back, unless they include release-critical bug fixes. The "testing" distribution can also remain in such a deep freeze during the so-called `test cycles', when the release is imminent.
it: Dopo un po', la distribuzione "testing" diventa realmente "congelata" (frozen). Ciò significa che tutti i nuovi pacchetti da mettere in "testing" sono trattenuti, a meno che non contengano le soluzioni a bug critici per il rilascio. La distribuzione "testing" può anche rimanere in questo stato di "surgelamento" durante i cosiddetti "cicli di test", quando il rilascio è imminente.
ru: Спустя какое-то время дистрибутив «testing» становится по-настоящему «замороженным». Это означает, что для всех пакетов, попавших в «testing», больше не выпускаются новые версии (исключение делается только для версий, исправляющих критические для выпуска ошибки). Дистрибутив «testing» может также остаться в таком состоянии глубокой заморозки на время так называемых «тестовых циклов», наступающих перед выпуском.

source: We keep a record of bugs in the "testing" distribution that can hold off a package from being released, or bugs that can hold back the whole release. For details, please see <url id="http://www.debian.org/releases/testing/" name="current testing release information">.
it: Viene tenuto un registro dei bug nella distribuzione "testing" che possono impedire ad un pacchetto di essere rilasciato, o dei bug che possono impedire l'intero rilascio. Per i dettagli si vedano le <url id="http://www.debian.org/releases/testing/" name="informazioni sull'attuale rilascio testing">.
ru: Мы ведём учёт ошибок в дистрибутиве «testing», которые могут отложить попадание пакета в выпуск, а также ошибки, которые могут задержать весь выпуск. Подробности даны в описании <url id="http://www.debian.org/releases/testing/" name="текущего состояния тестируемого выпуска">.

source: Once that bug count lowers to maximum acceptable values, the frozen "testing" distribution is declared "stable" and released with a version number.
it: Una volta che il numero dei bug si abbassa sotto i valori massimi accettabili, la distribuzione "congelata" viene dichiarata "stable" e rilasciata con un proprio numero di versione.
ru: Как только количество ошибок понижается до минимально приемлемого значения, замороженный дистрибутив «testing» объявляется стабильным и выпускается, получая номер версии.

source: With each new release, the previous "stable" distribution becomes obsolete and moves to the archive. For more information please see <url id="http://www.debian.org/distrib/archive" name="Debian archive">.
it: Ad ogni nuovo rilascio, la precedente distribuzione "stable" diventa obsoleta e viene spostata in archivio. Per maggiori informazioni si veda l'<url id="http://www.debian.org/distrib/archive" name="archivio Debian">.
ru: С каждым новым выпуском предыдущий дистрибутив «stable» становится устаревшим и перемещается в архив. Подробней об этом написано на странице <url id="http://www.debian.org/distrib/archive" name="архива Debian">.

source: What does the unstable distribution contain?
it: Cosa contiene la distribuzione unstable?
ru: Что содержится в нестабильном дистрибутиве?

source: The `unstable' directory contains a snapshot of the current development system. Users are welcome to use and test these packages, but are warned about their state of readiness. The advantage of using the unstable distribution is that you are always up-to-date with the latest in GNU/Linux software industry, but if it breaks: you get to keep both parts :-)
it: La directory "unstable" contiene un'istantanea del sistema attualmente in via di sviluppo. Gli utenti sono i benvenuti ad usare e testare questi pacchetti, ma sono avvisati riguardo il loro stato di preparazione. Il vantaggio di usare la distribuzione "unstable" è che si è sempre aggiornati con la più recente produzione di software in GNU/Linux, ma se si rompe, i cocci sono vostri :-)
ru: Каталог «unstable» содержит «снимок» текущей разрабатываемой системы. Пользователи могут использовать и тестировать его пакеты, но понимая их состояние неготовности. Преимущество использования нестабильного дистрибутива в том, что вы всегда работаете с самым новым ПО GNU/Linux, но если оно сломается, то получите целых две половинки :-)

source: There are also main, contrib and non-free subdirectories in `unstable', separated on the same criteria as in `stable'.
it: Anche in "unstable" ci sono le sottodirectory main, contrib e non-free, separate con lo stesso criterio adottato in "stable".
ru: В «unstable» тоже есть подкаталоги main, contrib и non-free, содержащие пакеты, разделённые по тем же признакам что и в «stable».

source: What are all those directories at the Debian FTP archives?
it: Cosa sono tutte quelle directory negli archivi FTP Debian?
ru: Что содержат каталоги в FTP-архивах Debian?

source: The software that has been packaged for &debian; is available in one of several directory trees on each Debian mirror site.
it: Il software che è stato impacchettato per &debian; è disponibile in uno dei diversi alberi di directory in ogni sito mirror Debian.
ru: На каждом сервере-зеркале Debian всё ПО, которое было упаковано для &debian;, распределено по нескольким каталогам.

source: The <tt>dists</tt> directory is short for "distributions", and it is the canonical way to access the currently available Debian releases (and pre-releases).
it: La directory <tt>dists</tt> è l'abbreviazione di "distribuzioni" ed è il percorso canonico per accedere ai rilasci (e pre-rilasci) Debian attualmente disponibili.
ru: Каталог <tt>dists</tt> &mdash; это сокращённое название «distributions» (дистрибутивы); он предоставляет канонический путь получения доступных в данный момент выпусков Debian (и предварительных выпусков).

source: The <tt>pool</tt> directory contains the actual packages, see <ref id="pools">.
it: La directory <tt>pool</tt> contiene i pacchetti effettivi, si veda <ref id="pools">.
ru: Каталог <tt>pool</tt> содержит актуальные версии пакетов, см. <ref id="pools">.

source: There are the following supplementary directories:
it: Ci sono queste directory aggiuntive:
ru: Есть несколько вспомогательных каталогов:

source: DOS utilities for creating boot disks, partitioning your disk drive, compressing/decompressing files, and booting Linux.
it: utilità DOS per creare dischi di avvio, partizionare il proprio disco, comprimere/decomprimere file e avviare Linux.
ru: Утилиты DOS для создания загрузочных дискет, разметки жёсткого диска, сжатия/распаковки файлов и загрузки Linux.

source: The basic Debian documentation, such as this FAQ, the bug reporting system instructions, etc.
it: la documentazione di base di Debian, come queste FAQ, le istruzioni del sistema di segnalazione dei bug, ecc.
ru: Основная документация Debian, например ЧаВо по Debian, инструкции по отправке сообщений об ошибках и т.д.

source: various indices of the site (the Maintainers file and the override files).
it: vari indici del sito (il file Maintainers e i file override).
ru: Различные индексные файлы (файл Maintainers и файлы переназначений).

source: mostly developer-only materials and some miscellaneous files.
it: per la maggior parte materiale solo per gli sviluppatori e file vari.
ru: В основном, материалы для разработчиков и некоторые другие файлы.

source: What are all those directories inside <tt>dists/stable/main</tt>?
it: Cosa sono tutte quelle directory dentro a <tt>dists/stable/main</tt>?
ru: Что находится в каталогах внутри <tt>dists/stable/main</tt>?

source: Within each of the major directory trees<footnote><p><tt>dists/stable/main</tt>, <tt>dists/stable/contrib</tt>, <tt>dists/stable/non-free</tt>, and <tt>dists/unstable/main/</tt>, etc.</p></footnote>, there are three sets of subdirectories containing index files.
it: All'interno di ciascuno degli alberi di directory principali<footnote><p><tt>dists/stable/main</tt>, <tt>dists/stable/contrib</tt>, <tt>dists/stable/non-free</tt> e <tt>dists/unstable/main/</tt>, ecc.</footnote>, ci sono tre insiemi di sottodirectory contenenti file indice.
ru: Внутри каждого основного каталога<footnote><p><tt>dists/stable/main</tt>, <tt>dists/stable/contrib</tt>, <tt>dists/stable/non-free</tt> и <tt>dists/unstable/main/</tt> и т.д.</p></footnote> есть три набора подкаталогов, содержащих индексные файлы.

source: There's one set of <tt>binary-<var>something</var></tt> subdirectories which contain index files for binary packages of each available computer architecture, for example <tt>binary-i386</tt> for packages which execute on Intel x86 PC machines or <tt>binary-sparc</tt> for packages which execute on Sun SPARCStations.
it: C'è un gruppo di sottodirectory <tt>binary-<var>qualcosa</var></tt> che contengono i file indice per i pacchetti binari di ciascuna architettura disponibile, per esempio <tt/binary-i386/ per i pacchetti che si possono eseguire su macchine PC Intel x86 o <tt>binary-sparc</tt> per i pacchetti da eseguire su SPARCStation Sun.
ru: Один набор подкаталогов <tt>binary-<var>что-то</var></tt> содержит индексные файлы двоичных пакетов для каждой доступной компьютерной архитектуры, например <tt>binary-i386</tt> нужен для пакетов, которые выполняются на ПК Intel x86, а <tt>binary-sparc</tt> нужен для пакетов, которые выполняются на машинах Sun SPARCStation.

source: The complete list of available architectures for each release is available at <url id="http://www.debian.org/releases/" name="the release's web page">. For the current release, please see <ref id="arches">.
it: L'elenco completo delle architetture disponibili per ciascun rilascio è disponibile alla <url id="http://www.debian.org/releases/" name="pagina web dei rilasci">. Per il rilascio attuale, si veda <ref id="arches">.
ru: Полный список доступных архитектур для каждого выпуска есть на <url id="http://www.debian.org/releases/" name="веб-странице выпуска">. Для списка текущего выпуска см. <ref id="arches">.

source: The index files in binary-* are called Packages(.gz, .bz2) and they include a summary of each binary package that is included in that distribution. The actual binary packages reside in the top level <qref id="pools"><tt>pool</tt> directory</qref>.
it: I file indice in binary-* si chiamano Packages(.gz, .bz2) e contengono un riassunto di ciascun pacchetto binario che è incluso in quella distribuzione. I pacchetti binari effettivi risiedono nella directory <qref id="pools"><tt>pool</tt></qref> di livello più alto.
ru: Индексные файлы в binary-* называются Packages(.gz, .bz2) и включают сводку по каждому двоичному пакету, вошедшему в дистрибутив. Реальные файлы двоичных пакетов находятся на самом верхнем уровне дерева в <qref id="pools">каталоге <tt>pool</tt></qref>.

source: Furthermore, there's a subdirectory called source/ which contains index files for source packages included in the distribution. The index file is called Sources(.gz, .bz2).
it: Inoltre esiste una sottodirectory chiamata source/ che contiene i file indice dei pacchetti sorgenti inclusi nella distribuzione. Il file indice si chiama Sources(.gz, .bz2).
ru: Кроме этого, есть подкаталог с именем source/, который содержит индексные файлы пакетов с исходными кодами, которые вошли в дистрибутив. Индексный файл называется Sources(.gz, .bz2).

source: Last but not least, there's a set of subdirectories meant for the installation system index files, they are at <tt>debian-installer/binary-<var>architecture</var></tt>.
it: Da ultimo, ma non per importanza, c'è un gruppo di sottodirectory pensate per i file indice del sistema di installazione: sono in <tt>debian-installer/binary-<var>architettura</var></tt>.
ru: И последнее, но не менее важное, есть набор подкаталогов, предназначенных для индексных файлов системы установки, они называются <tt>debian-installer/binary-<var>архитектура</var></tt>.

source: Where is the source code?
it: Dove è il codice sorgente?
ru: Где находятся исходные коды?
