Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: Like the (new) <file>Configure.help</file> files that are now available to support the construction of custom kernels, the <package>modconf</package> package comes with a series of help files (in <file>/usr/lib/modules_help/</file>) which provide detailed information on appropriate arguments for each of the modules.
it: Come i (nuovi) file <file>Configure.help</file> che sono ora disponibili per supportare la creazione di kernel personalizzati, il pacchetto <package>modconf</package> viene fornito con una serie di file di aiuto (in <file>/usr/lib/modules_help/</file>) che forniscono informazioni dettagliate sugli argomenti appropriati per ognuno dei moduli.
ru: Аналогично (новым) файлам <file>Configure.help</file>, которые используются при построении ядер с пользовательской настройкой, пакет <package>modconf</package> содержит набор файлов справки (в каталоге <file>/usr/lib/modules_help/</file>), которые подробно описывают соответствующие параметры для каждого модуля.

source: Can I safely de-install an old kernel package, and if so, how?
it: Si può disinstallare in sicurezza un vecchio pacchetto kernel e, se sì, come?
ru: Можно ли безопасно удалить пакет со старой версией ядра и как это сделать?

source: Yes. The <prgn>linux-image-<var>NNN</var>.prerm</prgn> script checks to see whether the kernel you are currently running is the same as the kernel you are trying to de-install. Therefore you can remove unwanted kernel image packages using this command:
it: Sì. Lo script <prgn>linux-image-<var>NNN</var>.prerm</prgn> verifica se il kernel che si sta attualmente usando è lo stesso che si sta tentando di disinstallare. Quindi si possono rimuovere i pacchetti delle immagini del kernel non desiderate usando questo comando:
ru: Да. Сценарий <prgn>linux-image-<var>NNN</var>.prerm</prgn> проверяет, не пытаетесь ли вы удалить работающее ядро. Поэтому вы можете удалить ненужные пакеты с образами ядра командой:

source: (replace <var>NNN</var> with your kernel version and revision number, of course)
it: (ovviamente sostituire <var>NNN</var> con il proprio numero di versione e revisione).
ru: (конечно же, нужно заменить <var>NNN</var> на правильный номер версии и редакции ядра)

source: Customizing your installation of &debian;
it: Personalizzare la propria installazione di &debian;
ru: Пользовательская настройка установленного &debian;

source: How can I ensure that all programs use the same paper size?
it: Come ci si può assicurare che tutti i programmi usino lo stesso formato per la carta?
ru: Как убедиться, что все программы используют одинаковый формат бумаги?

source: Install the <package>libpaper1</package> package, and it will ask you for a system-wide default paper size. This setting will be kept in the file <tt>/etc/papersize</tt>.
it: Si installi il pacchetto <package>libpaper1</package> che chiederà il formato carta predefinito per tutto il sistema. Questa impostazione sarà memorizzata nel file <tt>/etc/papersize</tt>.
ru: Установите пакет <package>libpaper1</package>, и вас попросят указать формат бумаги по умолчанию для всей системы. Настройка будет сохранена в файле <tt>/etc/papersize</tt>.

source: Users can override the paper size setting using the <tt>PAPERSIZE</tt> environment variable. For details, see the manual page <manref section="5" name="papersize">.
it: Gli utenti possono sovrascrivere l'impostazione del formato carta usando la variabile d'ambiente <tt>PAPERSIZE</tt>. Per i dettagli, vedere la pagina di manuale <manref section="5" name="papersize">.
ru: Пользователи могут изменять формат бумаги через переменную окружения <tt>PAPERSIZE</tt>. Дополнительную информацию ищите в справочной странице <manref section="5" name="papersize">.

source: How can I provide access to hardware peripherals, without compromising security?
it: Come si può fornire accesso alle periferiche hardware senza compromettere la sicurezza?
ru: Как обеспечить доступ к файлам устройств без нарушения защиты системы?

source: Many device files in the <tt>/dev</tt> directory belong to some predefined groups. For example, <tt>/dev/fd0</tt> belongs to the <tt>floppy</tt> group, and <tt>/dev/dsp</tt> belongs to the <tt>audio</tt> group.
it: Molti file di device nella directory <tt>/dev</tt> appartengono a gruppi predefiniti. Per esempio, <tt>/dev/fd0</tt> appartiene al gruppo <tt>floppy</tt> e <tt>/dev/dsp</tt> appartiene al gruppo <tt>audio</tt>.
ru: Многие файлы в каталоге <tt>/dev</tt> принадлежат предопределённым группам. Например, <tt>/dev/fd0</tt> принадлежит группе <tt>floppy</tt>, а <tt>/dev/dsp</tt> принадлежит группе <tt>audio</tt>.

source: If you want a certain user to have access to one of these devices, just add the user to the group the device belongs to, i.e. do:
it: Se si vuole che un certo utente abbia accesso ad uno di questi device, aggiungere l'utente al gruppo a cui appartiene il device, usare cioè:
ru: Если вы хотите предоставить конкретному пользователю доступ к устройству, то включите пользователя в группу, которой принадлежит устройство, т.е. сделайте:

source: adduser user group
it: adduser utente gruppo
ru: adduser пользователь группа

source: This way you won't have to change the file permissions on the device.
it: In questo modo non si dovranno cambiare i permessi dei file di device.
ru: Благодаря этому, вам не нужно изменять права доступа на сами файлы устройств.

source: If you do this from within a user's shell or a GUI environment you have to logout and login again to become an effective member of that group. To check which groups you belong to run <tt>groups</tt>.
it: Se lo si fa dall'interno di una shell utente o di un ambiente con interfaccia grafica si deve fare il logout e nuovamente il login per poter diventare un membro effettivo del gruppo specificato. Per controllare a quali gruppi si appartiene eseguire <tt>groups</tt>.
ru: Если вы выполняли это из оболочки командной строки или графического окружения этого пользователя, то вам нужно выйти из системы и войти снова, чтобы стать членом этой группы. Чтобы посмотреть в какие группы вы выходите, введите команду <tt>groups</tt>.

source: Notice that, since the introduction of <tt>udev</tt> if you change the permissions of a hardware peripheral they might be be adjusted for some devices when the system starts, if this happens to the hardware peripherals you are instered in you will have to adjust the rules at <tt>/etc/udev</tt>.
it: Si noti che, a partire dall'introduzione di <tt>udev</tt>, se si cambiano i permessi di una periferica hardware questi potrebbero essere modificati all'avvio per alcuni device; se ciò accade alle periferiche hardware a cui si è interessati, sarà necessario modificare in modo appropriato le regole in <tt>/etc/udev</tt>.
ru: Заметим, что при использовании <tt>udev</tt> права доступа к оборудованию назначаются при обнаружении устройства в системе. Если вам нужно изменить права доступа, отредактируйте файлы правил в каталоге <tt>/etc/udev</tt>.

source: How do I load a console font on startup the Debian way?
it: Come caricare un tipo di carattere per la console all'avvio nella maniera Debian?
ru: Как по правилам Debian при запуске системы изменить консольный шрифт?

source: The <package>kbd</package> and <package>console-tools</package> packages support this, edit <tt>/etc/kbd/config</tt> or <tt>/etc/console-tools/config</tt> files.
it: I pacchetti <package>kbd</package> e <package>console-tools</package> lo supportano: modificare il file <tt>/etc/kbd/config</tt> o <tt>/etc/console-tools/config</tt>.
ru: Для этой задачи существуют пакеты <package>kbd</package> и <package>console-tools</package>. Для настройки используется файл <tt>/etc/kbd/config</tt> или <tt>/etc/console-tools/config</tt>.

source: How can I configure an X11 program's application defaults?
it: Come si possono configurare le impostazioni predefinite per l'applicazione di un programma X11?
ru: Как настроить параметры по умолчанию для приложений X11?

source: Debian's X programs will install their application resource data in the <tt>/etc/X11/app-defaults/</tt> directory. If you want to customize X applications globally, put your customizations in those files. They are marked as configuration files, so their contents will be preserved during upgrades.
it: I programmi X di Debian installano i loro dati di risorsa dell'applicazione nella directory <tt>/etc/X11/app-defaults/</tt>. Se si vogliono personalizzare globalmente le applicazioni X, si mettano le proprie personalizzazioni in questi file. Sono marcati come file di configurazione, quindi il loro contenuto sarà preservato durante gli aggiornamenti.
ru: В Debian файлы ресурсов программ X11 устанавливаются в каталог <tt>/etc/X11/app-defaults/</tt>. Если вы хотите глобально изменить настройки приложений X, то отредактируйте файлы настройки из этого каталога. Эти файлы считаются настроечными, так что их содержимое будет сохранено при обновлениях системы.

source: Every distribution seems to have a different boot-up method. Tell me about Debian's.
it: Ogni distribuzione sembra avere un metodo di avvio differente. Cosa dire di quello di Debian?
ru: Кажется, каждый дистрибутив имеет собственный порядок загрузки. Расскажите, как это устроено в Debian.

source: Like all Unices, Debian boots up by executing the program <tt>init</tt>. The configuration file for <tt>init</tt> (which is <tt>/etc/inittab</tt>) specifies that the first script to be executed should be <tt>/etc/init.d/rcS</tt>. This script runs all of the scripts in <tt>/etc/rcS.d/</tt> by sourcing or forking subprocess depending on their file extension to perform initialization such as to check and to mount file systems, to load modules, to start the network services, to set the clock, and to perform other initialization. Then, for compatibility, it runs the files (except those with a `.'in the filename) in <tt>/etc/rc.boot/</tt> too. Any scripts in the latter directory are usually reserved for system administrator use, and using them in packages is deprecated.
it: Come tutti gli Unix, Debian si avvia eseguendo il programma <tt>init</tt>. Il file di configurazione per <tt>init</tt> (che è <tt>/etc/inittab</tt>) specifica che il primo script da eseguire dovrebbe essere <tt>/etc/init.d/rcS</tt>. Questo script esegue tutti gli script in <tt>/etc/rcS.d/</tt> usando il comando source o generando un sottoprocesso, a seconda della loro estensione, per effettuare un'inizializzazione come verificare e montare i file system, caricare moduli, avviare i servizi di rete, impostare l'orologio ed effettuare altre inizializzazioni. Poi, per compatibilità, esegue anche i file (eccetto quelli con un '.' nel nome del file) in <tt>/etc/rc.boot/</tt>. Ogni script in quest'ultima directory è solitamente riservato all'uso da parte degli amministratori di sistema e il loro uso all'interno di pacchetti è deprecato.
ru: Как и все Uniх-ы, Debian загружается выполнением программы <tt>init</tt>. В настроечном файле для <tt>init</tt> (который называется <tt>/etc/inittab</tt>) указывается, что первым должен выполняться сценарий <tt>/etc/init.d/rcS</tt>. Этот сценарий запускает все сценарии из каталога <tt>/etc/rcS.d/</tt> (в своём или отдельном процессе, в зависимости от расширения файла), которые проверяют и монтируют файловые системы, загружают модули, запускают сетевые службы, настраивают часы и производят прочие начальные действия. Затем, в целях совместимости, он запускает файлы (исключая те, что имеют «.» в имени файла) в каталоге <tt>/etc/rc.boot/</tt>. Сценарии в последнем каталоге, обычно, зарезервированы для администраторских задач, и не допускается их установка из пакетов.

source: After completing the boot process, <tt>init</tt> executes all start scripts in a directory specified by the default runlevel (this runlevel is given by the entry for <tt>id</tt> in <tt>/etc/inittab</tt>). Like most System V compatible Unices, Linux has 7 runlevels:
it: Dopo aver completato il processo di avvio, <tt>init</tt> esegue tutti gli script di avvio dentro una directory specificata dal livello di esecuzione (runlevel) predefinito (questo runlevel è dato dalla voce <tt>id</tt> in <tt>/etc/inittab</tt>). Come la maggior parte degli Uni* compatibili con il System V, Linux ha 7 runlevel:
ru: По окончании процесса загрузки <tt>init</tt> выполняет все начальные сценарии в каталоге, соответствующем уровню запуска по умолчанию (этот уровень запуска задаётся записью <tt>id</tt> в <tt>/etc/inittab</tt>). Подобно большинству Uniх-ов, совместимых с System V, в Linux имеется 7 уровней запуска:

source: 0 (halt the system),
it: 0 (ferma il sistema),
ru: 0 (останов системы),

source: 1 (single-user mode),
it: 1 (modalità singolo-utente),
ru: 1 (однопользовательский режим),

source: 2 through 5 (various multi-user modes), and
it: da 2 a 5 (varie modalità multi-utente) e
ru: с 2 по 5 (различные многопользовательские режимы), и

source: 6 (reboot the system).
it: 6 (riavvia il sistema).
ru: 6 (перезагрузка системы).

source: Debian systems come with id=2, which indicates that the default runlevel will be '2' when the multi-user state is entered, and the scripts in <tt>/etc/rc2.d/</tt> will be run.
it: I sistemi Debian vengono forniti con id=2, che indica che il runlevel predefinito sarà "2" quando si entra nello stato multiutente, e che verranno eseguiti gli script in <tt>/etc/rc2.d/</tt>.
ru: В системах Debian id=2, что означает, что по умолчанию уровень запуска будет '2' (вход в многопользовательский режим), и будут запущены сценарии из каталога <tt>/etc/rc2.d/</tt>.

source: In fact, the scripts in any of the directories, <tt>/etc/rcN.d/</tt> are just symbolic links back to scripts in <tt>/etc/init.d/</tt>. However, the <em>names</em> of the files in each of the <tt>/etc/rcN.d/</tt> directories are selected to indicate the <em>way</em> the scripts in <tt>/etc/init.d/</tt> will be run. Specifically, before entering any runlevel, all the scripts beginning with 'K' are run; these scripts kill services. Then all the scripts beginning with 'S' are run; these scripts start services. The two-digit number following the 'K' or 'S' indicates the order in which the script is run. Lower numbered scripts are executed first.
it: Di fatto, gli script in ognuna delle directory <tt>/etc/rcN.d/</tt> sono solo collegamenti simbolici agli script in <tt>/etc/init.d/</tt>. Comunque, i <em>nomi</em> dei file in ognuna delle directory <tt>/etc/rcN.d/</tt> sono selezionati per indicare il <em>modo</em> in cui gli script in <tt>/etc/init.d/</tt> vengono eseguiti. Specificatamente, prima di entrare in qualsiasi runlevel, sono eseguiti tutti gli script che iniziano con "K"; questi script uccidono i servizi. Poi vengono eseguiti tutti gli script che iniziano con "S"; questi script avviano i servizi. Il numero a due cifre che segue la 'K' o la 'S' indica l'ordine in cui lo script sarà eseguito. Gli script con un numero minore sono eseguiti prima.
ru: В действительности, сценарии в любом из каталогов <tt>/etc/rcN.d/</tt> &mdash; это только символьные ссылки на сценарии в <tt>/etc/init.d/</tt>. Однако, <em>имена</em> файлов в каждом каталоге <tt>/etc/rcN.d/</tt> выбраны так, чтобы задавать <em>порядок</em> выполнения сценариев из <tt>/etc/init.d/</tt>. А именно, перед переходом на уровень запуска, запускаются все сценарии, начинающиеся с 'K'; эти сценарии останавливают службы. Затем начинается выполнение сценариев с именами, начинающимися с буквы 'S'; эти сценарии запускают службы. Двузначное число после 'K' или 'S' указывает порядок, в котором запускается сценарий. Первыми выполняются сценарии с меньшими номерами.

source: This approach works because the scripts in <tt>/etc/init.d/</tt> all take an argument which can be either `start', `stop', `reload', `restart' or `force-reload' and will then do the task indicated by the argument. These scripts can be used even after a system has been booted, to control various processes.
it: Questo approccio funziona perché tutti gli script in <tt>/etc/init.d/</tt> accettano un argomento che può essere "start", "stop", "reload", "restart" o "force-reload" e svolgeranno poi il compito indicato dall'argomento. Questi script possono essere usati anche dopo che un sistema è stato avviato, per controllare vari processi.
ru: Для поддержки этого метода все сценарии в каталоге <tt>/etc/init.d/</tt> принимают один из параметров: «start», «stop», «reload», «restart» или «force-reload» и затем выполняют задачу, определяемую этим параметром. Эти сценарии можно использовать даже после окончания процесса загрузки системы для управления различными процессами.

source: For example, with the argument `reload' the command
it: Per esempio, con l'argomento "reload" il comando
ru: Например, при параметре «reload» команда

source: sends the sendmail daemon a signal to reread its configuration file. (BTW, Debian supplies <prgn>invoke-rc.d</prgn> as a wrapper for invoking the scripts in <tt>/etc/init.d/</tt>.)
it: invia al demone sendmail un segnale di rileggere il suo file di configurazione. (A questo proposito Debian fornisce <prgn>invoke-rc.d</prgn> come wrapper per invocare gli script in <tt>/etc/init.d/</tt>.)
ru: посылает службе sendmail указание повторить чтение файла настроек. (Кстати, в Debian есть команда <prgn>invoke-rc.d</prgn> для запуска сценариев из <tt>/etc/init.d/</tt>.)

source: It looks as if Debian does not use <tt>rc.local</tt> to customize the boot process; what facilities are provided?
it: Sembra che Debian non usi <tt>rc.local</tt> per personalizzare il processo di avvio; che facilitazioni vengono fornite?
ru: Похоже, что Debian не использует <tt>rc.local</tt> для донастройки процесса загрузки; что используется вместо неё?

source: Suppose a system needs to execute script <tt>foo</tt> on start-up, or on entry to a particular (System V) runlevel. Then the system administrator should:
it: Si supponga che un sistema necessiti di eseguire lo script <tt>pippo</tt> all'avvio o all'ingresso ad un particolare runlevel (System V). Allora l'amministratore di sistema dovrebbe:
ru: Допустим, системе нужно выполнять сценарий <tt>foo</tt> при загрузке, или при переключении в какой-либо уровень запуска (System V). В этом случае действия системного администратора такие:

source: Enter the script <tt>foo</tt> into the directory <tt>/etc/init.d/</tt>.
it: Mettere lo script <tt>pippo</tt> nella directory <tt>/etc/init.d/</tt>.
ru: Поместить сценарий <tt>foo</tt> в каталог <tt>/etc/init.d/</tt>.

source: Run the Debian command <tt>update-rc.d</tt> with appropriate arguments, to specify which runlevels should start the service, and which runlevels should stop the service.
it: Eseguire il comando Debian <tt>update-rc.d</tt> con gli argomenti appropriati, per specificare quali runlevel devono avviare il servizio e quali devono fermarlo.
ru: Запустить команду Debian <tt>update-rc.d</tt> с соответствующими параметрами, чтобы указать на каких уровнях должна запускаться и останавливаться служба.

source: Consider rebooting the system to check that the service starts correctly (assuming that you've asked for it to be started in the default runlevel). Otherwise, manually start it by running `<tt>/etc/init.d/foo start</tt>'.
it: Considerare l'opportunità di riavviare il sistema per controllare che il servizio venga avviato correttamente (nell'ipotesi che si sia impostato il suo avvio nel runlevel predefinito). Altrimenti avviarlo manualmente eseguendo "<tt>/etc/init.d/pippo start</tt>".
ru: Попробовать перезагрузить систему для проверки, что служба запускается правильно (предполагается, что вы хотите запускать службу в уровне запуска по умолчанию). Или же вручную запустить службу с помощью команды «<tt>/etc/init.d/foo start</tt>».

source: One might, for example, cause the script <tt>foo</tt> to execute at boot-up, by putting it in <tt>/etc/init.d/</tt> and running <tt>update-rc.d foo defaults 19</tt>. The argument `<tt>defaults</tt>' refers to the default runlevels, which means (at least in absence of any LSB comment block to the contrary) to start the service in runlevels 2 through 5, and to stop the service in runlevels 0, 1 and 6. (Any LSB Default-Start and Default-Stop directives in <tt>foo</tt> take precedence when using the sysv-rc version of update-rc.d, but are ignored by the current (v0.8.10) file-rc version of update-rc.d.) The argument `<tt>19</tt>' ensures that <tt>foo</tt> is called after all scripts whose number is less than 19 have completed, and before all scripts whose number is 20 or greater.
it: Si può, per esempio, fare in modo che lo script <tt>pippo</tt> venga eseguito all'avvio, mettendolo in <tt>/etc/init.d/</tt> ed eseguendo <tt>update-rc.d pippo defaults 19</tt>. L'argomento "defaults" fa riferimento ai runlevel predefiniti, il che significa (almeno in assenza di blocchi di commento LSB che specifichino diversamente) che il servizio viene avviato nei runlevel dal 2 al 5 e che viene fermato nei runlevel 0, 1 e 6. (Quasiasi direttiva LSB Default-Start e Default-Stop in <tt>pippo</tt> ha la precedenza quando si usa la versione sysv-rc di update-rc.d, ma viene ignorata dalla versione attuale (v0.8.10) di file-rc di update-rc.d.) L'argomento "19" assicura che <tt>pippo</tt> venga chiamato dopo che siano stati completati tutti gli script il cui numero è minore di 19 e prima di tutti gli script con numero uguale o maggiore di 20.
ru: Например, можно выполнять сценарий <tt>foo</tt> при загрузке, поместив его в <tt>/etc/init.d/</tt> и установив необходимые ссылки командой <tt>update-rc.d foo defaults 19</tt>. Параметр «<tt>defaults</tt>» задаёт уровни запуска по умолчанию, то есть служба будет запускаться (по крайней мере, при отсутствии блока комментария LSB, указывающем этого не делать) в уровнях запуска со 2 по 5, и останавливаться в уровнях запуска 0, 1 и 6. (Любая из директив LSB Default-Start и Default-Stop в <tt>foo</tt> имеет приоритет при использовании sysv-rc версии update-rc.d, но игнорируется текущей (v0.8.10) file-rc версией update-rc.d.) Параметр «<tt>19</tt>» гарантирует, что <tt>foo</tt> запустится после завершения выполнения всех сценариев, чьи номера меньше 19, и раньше всех сценариев, чьи номера равны 20 или более.

source: How does the package management system deal with packages that contain configuration files for other packages?
it: Come si comporta il sistema di manutenzione dei pacchetti nel caso di pacchetti che contengono file di configurazione per altri pacchetti?
ru: Как система управления пакетами обрабатывает случаи, когда пакеты содержат настроечные файлы для других пакетов?

source: Some users wish to create, for example, a new server by installing a group of Debian packages and a locally generated package consisting of configuration files. This is not generally a good idea, because <prgn>dpkg</prgn> will not know about those configuration files if they are in a different package, and may write conflicting configurations when one of the initial "group" of packages is upgraded.
it: Alcuni utenti desiderano creare, per esempio, un nuovo server installando un gruppo di pacchetti Debian ed un pacchetto generato localmente che consiste di file di configurazione. Questa non è generalmente una buona idea, perché <prgn>dpkg</prgn> non saprà nulla di quei file di configurazione se sono in un pacchetto differente, e potrebbe scrivere configurazioni in conflitto quando uno dei paccheti del "gruppo" iniziale viene aggiornato.
ru: Предположим, некоторые пользователи хотят настроить новый сервер, устанавливая группу пакетов Debian и собственный пакет, состоящий из настроечных файлов. Вообще, это не очень хорошо, поскольку <prgn>dpkg</prgn> не будет знать о файлах настроек, если они находятся в другом пакете, и может затереть эти файлы при обновлении другого пакета.
