Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: GNU-style `info' pages: User documentation for many commands, particularly GNU tools, is available not in `man' pages, but in `info' files which can be read by the GNU tool <tt>info</tt>, by running <tt>M-x info</tt> within GNU Emacs, or with some other Info page viewer.
it: Le pagine "info" in stile GNU. La documentazione utente per molti comandi, in particolare per gli strumenti GNU, non è disponibile in forma di pagine di manuale, ma in file "info" che possono essere letti dallo strumento GNU <tt>info</tt>, eseguendo <tt>M-x info</tt> all'interno di GNU Emacs o con qualche altro visualizzatore di pagine Info.
ru: Страницы «info» в стиле GNU: пользовательская документация многих команд, особенно инструментов GNU, доступна не в man-страницах, а в info-файлах, которые можно читать с помощью GNU программы <tt>info</tt>, набрав <tt>M-x info</tt> в GNU Emacs, или с помощью другой программы просмотра страниц Info.

source: Its main advantage over the original `man' pages are that it is a hypertext system. It does <em>not</em> require the WWW, however; <tt>info</tt> can be run from a plain text console. It was designed by Richard Stallman and preceded the WWW.
it: Il principale vantaggio rispetto alle originali pagine di manuale è che viene usato un sistema ad ipertesto. Comunque, <em>non</em> richiede il WWW; <tt>info</tt> può essere eseguito da una semplice console testuale. È stato progettato da Richard Stallman ed ha preceduto il WWW.
ru: Основное преимущество по сравнению с обычными man-страницами заключается в том, что Info является гипертекстовой системой. Однако, ей <em>не</em> требуется для этого WWW; <tt>info</tt> может работать в обычной текстовой консоли. Она была разработана Ричардом Столлманом (Richard Stallman) и появилась раньше WWW.

source: Note that you may access a lot of documentation on your system by using a WWW browser, through `dwww', `dhelp' or `doccentral' commands, found in respective packages, or by using `yelp'.
it: Si noti che si può accedere a molta documentazione presente nel proprio sistema utilizzando un browser WWW, attraverso i comandi "dwww", "dhelp" o "doccentral", che si trovano nei rispettivi pacchetti opppure usando "yelp".
ru: Заметим, что вы можете получить доступ ко всей документации системы с помощью веб-браузера с помощью команд «dwww», «dhelp» или «doccentral», которые находятся в соответствующих пакетах или с помощью «yelp».

source: Are there any on-line resources for discussing Debian?
it: Ci sono risorse on-line dove discutere su Debian?
ru: Есть ли какие-нибудь он-лайн ресурсы для обсуждения Debian?

source: Yes. In fact, the main method of support Debian provides to our users is by the way of e-mail. We'll give some details on that, and mention some other useful resources. Even more resources are listed at the <url id="http://www.debian.org/support" name="Debian Support webpage">.
it: Sì. Infatti, il metodo principale con cui Debian fornisce supporto ai propri utenti è via posta elettronica. Verranno qui forniti alcuni dettagli e nominate alcune altre utili fonti di informazioni. Ulteriori risorse sono elencate nella <url id="http://www.debian.org/support" name="pagina web Debian sul supporto">.
ru: Да. Фактически, основным способом поддержки пользователей в Debian является электронная почта. Мы расскажем об этом и приведём список других полезных ресурсов. Дополнительные ресурсы представлены на странице <url id="http://www.debian.org/support" name="поддержки Debian">.

source: Mailing lists
it: Mailing-list
ru: Списки рассылки

source: There are a lot of <url id="http://www.debian.org/MailingLists/" name="Debian-related mailing lists">.
it: Ci sono molte <url id="http://www.debian.org/MailingLists/" name="mailing-list correlate a Debian">.
ru: Существует большое количество <url id="http://www.debian.org/MailingLists/" name="списков рассылки по Debian">.

source: On a system with the <package>doc-debian</package> package installed there is a complete list of mailing lists in <file>/usr/share/doc/debian/mailing-lists.txt</file>.
it: <p>Su di un sistema con il pacchetto <package>doc-debian</package> installato c'è un elenco completo delle mailing-list in <file>/usr/share/doc/debian/mailing-lists.txt</file>.
ru: В системе с установленным пакетом <package>doc-debian</package> все имена списков рассылки можно найти в файле <file>/usr/share/doc/debian/mailing-lists.txt</file>.

source: Debian mailing lists are named following the pattern debian-<var>list-subject</var>. Examples are debian-announce, debian-user, debian-news. To subscribe to any list debian-<var>list-subject</var>, send mail to debian-<var>list-subject</var>-request@lists.debian.org with the word "subscribe" in the Subject: header. Be sure to remember to add <em>-request</em> to the e-mail address when using this method to subscribe or unsubscribe. Otherwise your e-mail will go to the list itself, which could be embarrassing or annoying, depending on your point of view.
it: Le mailing-list Debian sono denominate seguendo il modello debian-<var>argomento-lista</var>. Esempi sono debian-announce, debian-user, debian-news. Per iscriversi a una qualsiasi delle liste debian-<var>argomento-lista</var>, inviare un messaggio di posta a debian-<var>argomento-lista</var>-request@lists.debian.org con la parola "subscribe" nell'intestazione Subject:. Ci si assicuri di aver aggiunto <em>-request</em> all'indirizzo di posta elettronica quando si utilizza questo metodo per iscriversi o disiscriversi. In caso contrario il messaggio di posta va alla lista stessa, il che potrebbe essere imbarazzante o fastidioso, a seconda del punto di vista.
ru: Имена списков рассылки Debian придерживаются следующего формата: debian-<var>тема-рассылки</var>. Например: debian-announce, debian-user, debian-news. Чтобы подписаться на какой-нибудь список debian-<var>тема-рассылки</var>, отправьте письмо на адрес debian-<var>тема-рассылки</var>-request@lists.debian.org со словом «subscribe» в Теме письма. Проверьте, что добавили <em>-request</em> к адресу электронной почты при подписке или отписки. Иначе ваше письмо попадёт в сам список, что сбивает с толку или раздражает, в зависимости от вашей точки зрения.

source: You can subscribe to mailing lists using the <url id="http://www.debian.org/MailingLists/subscribe" name="WWW form">. You can also un-subscribe using a <url id="http://www.debian.org/MailingLists/unsubscribe" name="WWW form">.
it: Ci si può iscrivere alle mailing-list utilizzando il <url id="http://www.debian.org/MailingLists/subscribe" name="modulo WWW">. Ci si può anche disiscrivere utilizzando un <url id="http://www.debian.org/MailingLists/unsubscribe" name="modulo WWW">.
ru: Вы можете подписаться на списки рассылки через <url id="http://www.debian.org/MailingLists/subscribe" name="эту WWW форму">. Также, вы можете отписаться через <url id="http://www.debian.org/MailingLists/unsubscribe" name="эту WWW форму">.

source: The list manager's e-mail address is <email>listmaster@lists.debian.org</email>, in case you have any trouble.
it: L'indirizzo di posta elettronica dell'amministratore delle mailing-list è <email>listmaster@lists.debian.org</email>, nel caso si abbia qualsiasi problema.
ru: Если у вас возникли проблемы, вот адрес электронной почты менеджера списков рассылки: <email>listmaster@lists.debian.org</email>.

source: The mailing lists are public forums. All e-mails sent to the lists are also copied to the public archive, for anybody (even non-subscribers) to browse or search. Please make sure you never send any confidential or unlicensed material to the lists. This includes things like e-mail addresses. Of particular note is the fact that spammers have been known to abuse e-mail addresses posted to our mailing lists. See the <url id="http://www.debian.org/MailingLists/#disclaimer" name="Mailing Lists Privacy policy"> for more information.
it: Le mailing-list sono luoghi di discussione pubblici. Tutti i messaggi inviati alle liste vengono anche copiati nell'archivio pubblico dove tutti (compreso chi non è iscritto) possono sfogliarli o fare ricerche. Assicurarsi di non inviare mai alle liste materiale confidenziale o per il quale non si hanno i diritti. Sono incluse cose come gli indirizzi di posta elettronica; è degno di attenzione particolare il fatto che le fonti di spam sono note per abusare degli indirizzi di posta elettronica inviati alle mailing-list Debian. Si veda la <url id="http://www.debian.org/MailingLists/#disclaimer" name="politica sulla privacy delle mailing-list"> per maggiori informazioni.
ru: Списки рассылки &mdash; это публичные дискуссии. Все электронные письма, отправленные в рассылку, также копируются в публичный архив, доступный для всех (даже не подписчиков) для просмотра и поиска. Убедитесь, что вы не посылаете никакой конфиденциальной или лицензированной информации в списки рассылки. Это относится даже к адресам электронной почты. Стоит отметить, были случаи злоупотребления спамерами адресами электронной почты, полученными из наших списков рассылки. Подробней смотрите <url id="http://www.debian.org/MailingLists/#disclaimer" name="политику в области приватности">.

source: Archives of the Debian mailing lists are available via WWW at <url id="http://lists.debian.org/">.
it: Gli archivi delle mailing-list Debian sono disponibili via WWW all'indirizzo <url id="http://lists.debian.org/">.
ru: Архивы списков рассылки Debian доступны через WWW по адресу <url id="http://lists.debian.org/">.

source: What is the code of conduct for the mailing lists?
it: Qual è il codice di condotta per le mailing-list?
ru: Как вести себя в списках рассылки?

source: When using the Debian mailing lists, please follow these rules:
it: Quando si usano le mailing-list Debian, seguire queste regole:
ru: При использовании списков рассылки Debian, пожалуйста, соблюдайте следующие правила:

source: Do not send spam. See the <url id="http://www.debian.org/MailingLists/#ads" name="Debian mailing list advertising policy">.
it: Non inviare spam. Si veda la <url id="http://www.debian.org/MailingLists/#ads" name="Politica Debian per la pubblicità sulle mailing-list">.
ru: Не посылайте спам. Об <url id="http://www.debian.org/MailingLists/#ads" name="отношении к рекламе в списках рассылки Debian">.

source: Do not flame; it is not polite. The people developing Debian are all volunteers, donating their time, energy and money in an attempt to bring the Debian project together.
it: Evitare i flame; non è educato. Le persone che sviluppano Debian sono tutti volontari, che donano il proprio tempo, energia e denaro nel tentativo di portare avanti il progetto Debian insieme.
ru: Не болтайте попусту. Люди добровольно работают над Debian, тратя своё время, энергию и деньги.

source: Do not use foul language; besides, some people receive the lists via packet radio, where swearing is illegal.
it: Non usare un linguaggio volgare; inoltre alcune persone ricevono le liste tramite pacchetti radio, dove imprecare è illegale.
ru: Избегайте непристойностей; помимо всего прочего, некоторые люди получают списки рассылки с помощью пакетной радиосвязи, где ругательства запрещены.

source: Make sure that you are using the proper list. <em>Never</em> post your (un)subscription requests to the mailing list itself<footnote><p>Use the debian-<var>list-subject</var>-REQUEST@lists.debian.org address for that.</p></footnote>
it: Assicurarsi di utilizzare la lista corretta. <em>Mai</em> inviare la propria richiesta di (dis)iscrizione alla mailing-list stessa. <footnote>Utilizzare l'indirizzo debian-<var>argomento-lista</var>-REQUEST@lists.debian.org per quello.</p></footnote>
ru: Удостоверьтесь, что вы используете нужный список. <em>Никогда</em> не посылайте запросов на (от)подписку в сам список рассылки<footnote><p>Пользуйтесь для этого адресом debian-<var>тема-рассылки</var>-REQUEST@lists.debian.org.</p></footnote>

source: See section <ref id="bugreport"> for notes on reporting bugs.
it: Vedere la sezione <ref id="bugreport"> per indicazioni sulla segnalazione di bug.
ru: Смотрите в <ref id="bugreport"> замечания по отправке сообщений об ошибках.

source: Web forums
it: Forum web
ru: Веб-форумы

source: <url id="http://debianhelp.org/" name="debianHELP"> and <url id="http://forums.debian.net/" name="Debian User Forums"> are web forums on which you can submit questions about Debian and have them answered by other users. (These are not officially part of the Debian project.)
it: <url id="http://debianhelp.org/" name="debianHELP"> e <url id="http://forums.debian.net/" name="Debian User Forums"> sono forum web in cui si possono porre domande su Debian e ottenere risposte da altri utenti. (Non fanno ufficialmente parte del progetto Debian.)
ru: <url id="http://debianhelp.org/" name="debianHELP"> и <url id="http://forums.debian.net/" name="форумы пользователей Debian"> &mdash; это веб-форумы, на которых вы можете задать вопросы о Debian и получить ответы от других пользователей. (Эти форумы не являются частью проекта Debian.)

source: Solutions to common problems, howto's, guides, tips and other documentation can be found at the constantly changing <url id="http://wiki.debian.org/" name="Debian Wiki">.
it: Le soluzioni a problemi comuni, HOWTO, guide, suggerimenti e altra documentazione possono essere trovati nel <url id="http://wiki.debian.org/" name="Wiki Debian"> in costante evoluzione.
ru: Решения частых проблем, howto, руководства, советы и другую документацию можно найти на постоянно дополняемом <url id="http://wiki.debian.org/" name="Debian вики">.

source: Maintainers
it: Manutentori
ru: Сопровождающие

source: Users can address questions to individual package maintainers using e-mail. To reach a maintainer of a package called xyz, send e-mail to <em>xyz@packages.debian.org</em>.
it: Gli utenti possono rivolgere domande ai manutentori dei singoli pacchetti usando la posta elettronica. Per raggiungere un manutentore di un pacchetto chiamato xyz, si invii un messaggio a <em>xyz@packages.debian.org</em>.
ru: Пользователи могут задавать вопросы по определённым пакетам сопровождающим по электронной почте. Например, чтобы написать сопровождающему пакета xyz, отправьте письмо на адрес <em>xyz@packages.debian.org</em>.

source: Usenet newsgroups
it: Gruppi di discussione (newsgroup) Usenet
ru: Группы новостей Usenet

source: Users should post non-Debian-specific questions to one of the Linux USENET groups, which are named comp.os.linux.* or linux.*. There are several lists of Linux Usenet newsgroups and other related resources on the WWW, e.g. on the <url id="http://www.linux.org/docs/usenet.html" name="Linux Online"> and <url id="http://www.linuxjournal.com/helpdesk.php" name="LinuxJournal"> sites.
it: Gli utenti dovrebbero rivolgere le domande non specifiche per Debian in uno dei gruppi USENET Linux, che si chiamano comp.os.linux.* o linux.* [NdT: in italiano esistono i gruppi it.comp.os.linux.*]. Ci sono diversi elenchi di gruppi di discussione Usenet Linux ed altre risorse correlate sul WWW, ad esempio sui siti <url id="http://www.linux.org/docs/usenet.html" name="Linux Online"> e <url id="http://www.linuxjournal.com/helpdesk.php" name="LinuxJournal">.
ru: Пользователи могут отправлять вопросы, не относящиеся к Debian, в одну из групп Linux USENET comp.os.linux.* или linux.*. Через веб можно найти несколько списков новостных групп Linux Usenet и другие ресурсы, например, на сайте <url id="http://www.linux.org/docs/usenet.html" name="Linux Online"> и <url id="http://www.linuxjournal.com/helpdesk.php" name="LinuxJournal">.

source: Is there a quick way to search for information on &debian;?
it: Esiste un modo rapido per cercare informazioni su &debian;?
ru: Как быстро найти информацию по &debian;?

source: There is a variety of search engines that serve documentation related to Debian:
it: Ci sono svariati motori di ricerca che forniscono documentazione relativa a Debian:
ru: Существуют различные поисковые системы, с помощью которых можно получить информацию по Debian:

source: <url id="http://search.debian.org/" name="Debian WWW search site">.
it: <url id="http://search.debian.org/" name="sito WWW di ricerca Debian">.
ru: <url id="http://search.debian.org/" name="Поиск по Debian WWW">.

source: <url id="http://groups.google.com/" name="Google Groups">: a search engine for newsgroups.
it: <url id="http://groups.google.com/" name="Google Groups">: un motore di ricerca per gruppi di discussione.
ru: <url id="http://groups.google.com/" name="Группы Google">: поисковый движок по группам новостей.

source: For example, to find out what experiences people have had with finding drivers for Promise controllers under Debian, try searching on the phrase <tt>Promise Linux driver</tt>. This will show you all the postings that contain these strings, i.e. those where people discussed these topics. If you add <tt>Debian</tt> to those search strings, you'll also get the postings specifically related to Debian.
it: Per esempio, per cercare che esperienza ha avuto la gente nel trovare dei driver per i controller Promise sotto Debian, si provi a cercare l'espressione <tt>Promise Linux driver</tt>. Questo mostrerà tutti i messaggi che contengono queste stringhe, ovvero quelli dove la gente ha discusso questi argomenti. Se si aggiunge <tt>Debian</tt> a quella stringa di ricerca, si avranno inoltre i messaggi attinenti specificatamente a Debian.
ru: Например, чтобы выяснить, что удалось людям, которые искали драйверы для контроллеров Promise под Debian, попробуйте поискать по такой фразе: <tt>Promise Linux driver</tt>. По этому запросу будут выведены все сообщения, содержащие эти строки, то есть те, в которых люди обсуждали данную тему. Если вы добавите к строке поиска <tt>Debian</tt>, то получите сообщения, относящиеся ещё и к Debian.

source: Any of the common web spidering engines, such as <url id="http://www.altavista.com/" name="AltaVista"> or <url id="http://www.google.com/" name="Google">, as long as you use the right search terms.
it: Tutti i comuni motori di ricerca del web, come <url id="http://www.altavista.com/" name="AltaVista"> o <url id="http://www.google.com/" name="Google">, purché si usino i termini di ricerca corretti.
ru: Для поиска в веб подойдёт любая из систем глобального поиска, например <url id="http://www.altavista.com/" name="AltaVista"> или <url id="http://www.google.com/" name="Google">, надо только правильно подбирать слова.

source: For example, searching on the string "cgi-perl" gives a more detailed explanation of this package than the brief description field in its control file.
it: Per esempio, cercare la stringa "cgi-perl" fornisce una spiegazione più dettagliata di questo pacchetto rispetto alla breve descrizione nel suo control file.
ru: Например, поиск по строке «cgi-perl» даёт более подробное объяснение об этом пакете, чем поле краткого описания в его управляющем файле.

source: Are there logs of known bugs?
it: Ci sono registri dei bug conosciuti?
ru: Существуют ли журналы известных ошибок?

source: Reports on unsolved (and closed) issues are publicly available: Debian promissed to do so by stating "We will not hide problems" in the <url id="http://www.debian.org/social_contract" name="Debian Social Contract">.
it: I rapporti sui problemi irrisolti (e su quelli chiusi) sono disponibili pubblicamente: Debian ha promesso di fare così dichiarando nel <url id="http://www.debian.org/social_contract" name="Contratto Sociale Debian"> "Noi non nasconderemo i problemi".
ru: Сообщения о нерешённых (и закрытых) проблемах доступны всем: в <url id="http://www.debian.org/social_contract" name="общественном договоре Debian"> даётся обещание, что никакие проблемы скрыты не будут.

source: The &debian; distribution has a bug tracking system (BTS) which files details of bugs reported by users and developers. Each bug is given a number, and is kept on file. Once it has been dealt with, it is marked as such.
it: La distribuzione &debian; ha un sistema di tracciamento dei bug (BTS, bug tracking system) che registra i dettagli dei bug riportati da utenti e sviluppatori. Ad ogni bug viene assegnato un numero e viene archiviato. Una volta che è stato risolto, viene segnato come tale.
ru: Дистрибутив &debian; имеет систему отслеживания ошибок (BTS), в файлах которой подробно описываются ошибки, присланные пользователями и разработчиками. Каждой ошибке присваивается номер, и она хранится в файле, пока не будет помечена как исправленная.

source: Copies of this information are available at <url id="http://www.debian.org/Bugs/">.
it: Copie di queste informazioni sono disponibili su <url id="http://www.debian.org/Bugs/">.
ru: Копия информации об ошибках доступна по адресу: <url id="http://www.debian.org/Bugs/">.

source: A mail server provides access to the bug tracking system database via e-mail. In order to get the instructions, send an e-mail to request@bugs.debian.org with "help" in the body.
it: Un server di posta fornisce accesso al database del sistema di tracciamento dei bug via posta elettronica. Per ottenere le istruzioni si invii un messaggio a request@bugs.debian.org con "help" nel corpo del messaggio.
ru: Почтовый сервер предоставляет доступ к базе данных системы отслеживания ошибок через электронную почту. Чтобы получить инструкции, пошлите письмо по адресу request@bugs.debian.org с словом «help» в теле сообщения.

source: How do I report a bug in Debian?
it: Come si segnala un bug in Debian?
ru: Как сообщить об ошибке в Debian?

source: If you have found a bug in Debian, please read the instructions for reporting a bug in Debian. These instructions can be obtained in one of several ways:
it: Se si è trovato un bug in Debian si leggano le istruzioni per la segnalazione di un bug. Queste istruzioni possono essere ottenute in uno di vari modi.
ru: Если вы обнаружили ошибку в Debian, пожалуйста прочтите инструкции по отправке ошибок в Debian. Эти инструкции можно получить одним из следующих способов:

source: From the WWW. A copy of the instructions is shown at <url id="http://www.debian.org/Bugs/Reporting">.
it: Dal WWW. Una copia delle istruzioni è mostrata in <url id="http://www.debian.org/Bugs/Reporting">.
ru: Через WWW. Копию инструкций можно посмотреть здесь <url id="http://www.debian.org/Bugs/Reporting">.

source: On any Debian system with the <package>doc-debian</package> package installed. The instructions are in the file <file>/usr/share/doc/debian/bug-reporting.txt</file>.
it: Su qualsiasi sistema Debian con installato il pacchetto <package>doc-debian</package>. Le istruzioni sono nel file <file>/usr/share/doc/debian/bug-reporting.txt</file>.
ru: В любой системе Debian с установленным пакетом <package>doc-debian</package>. Инструкции находятся в файле <file>/usr/share/doc/debian/bug-reporting.txt</file>.

source: By anonymous FTP. Debian mirror sites contain the instructions in the file <tt>doc/bug-reporting.txt</tt>.
it: Via FTP anonimo. I siti mirror Debian contengono le istruzioni nel file <tt>doc/bug-reporting.txt</tt>.
ru: Через анонимный FTP. Зеркала сайта Debian содержат инструкции в файле <tt>doc/bug-reporting.txt</tt>.
