Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: 6 March 2012
it: 6 marzo 2012
ru: 6 марта 2012 года

source: <name>Authors are listed at <qref id="authors">Debian FAQ Authors</qref></name>
it: <name>Gli autori sono elencati in <qref id="authors">Autori delle FAQ di Debian</qref></name>
ru: <name>Список авторов можно найти в <qref id="authors">ЧаВо о Debian: Авторы</qref></name>

source: version &docversion;, &docdate;
it: versione &docversion;, &docdate;
ru: версия &docversion; от &docdate;

source: This document answers questions frequently asked about &debian;.
it: Questo documento risponde alle domande fatte spesso su &debian;.
ru: В этом документе содержатся ответы на часто задаваемые вопросы о &debian;.

source: Definitions and overview
it: Definizioni e introduzione
ru: Определения и краткий обзор

source: What is this FAQ?
it: Cosa sono queste FAQ?
ru: О чём данные ЧаВо?

source: This document gives frequently asked questions (with their answers!) about the Debian distribution (&debian; and others) and about the Debian project. If applicable, pointers to other documentation will be given: we won't quote large parts of external documentation in this document. You'll find out that some answers assume some knowledge of Unix-like operating systems. We'll try to assume as little prior knowledge as possible: answers to general beginners questions will be kept simple.
it: Questo documento contiene domande frequenti (e le risposte!) sulla distribuzione Debian (&debian; e altre) e sul progetto Debian. Se possibile vengono forniti riferimenti ad altra documentazione: in questo testo non vengono citati grossi brani di documentazione esterna. Si potrà notare che alcune risposte danno per scontata una certa conoscenza dei sistemi operativi *nix. Si è cercato di dare per scontata una quantità di conoscenze più piccola possibile: le risposte a domande generiche dei principianti sono mantenute semplici.
ru: Здесь собраны вопросы (с ответами!) о дистрибутиве Debian (&debian; и других) и о проекте Debian. Там, где есть другая документация по определённому вопросу, даётся ссылка: мы не хотим цитировать здесь большие части сторонней документации. В ряде ответов предполагается наличие некоторых знаний по Unix-подобным операционным системам. Однако допуская, что знаний у читателя может быть совсем немного, мы постараемся отвечать на общие вопросы новичков как можно проще.

source: If you can't find what you're looking for in this FAQ, be sure to check out <ref id="debiandocs">. If even that doesn't help, refer to <ref id="feedback">.
it: Se non si trova ciò che si sta cercando in queste FAQ, assicurarsi di controllare <ref id="debiandocs">. Se anche ciò non aiuta, fare riferimento a <ref id="feedback">.
ru: Если в этих ЧаВо вы не нашли то, что искали, см. <ref id="debiandocs">. Если даже это не помогло, см. <ref id="feedback">.

source: What is &debian;?
it: Cosa è &debian;?
ru: Что такое &debian;?

source: &debian; is a particular <em>distribution</em> of the Linux operating system, and numerous packages that run on it.
it: &debian; è una particolare <em>distribuzione</em> del sistema operativo Linux e di numerosi pacchetti funzionanti su di essa.
ru: &debian; &mdash; это один из <em>дистрибутивов</em> операционной системы Linux с большим количеством пакетов.

source: &debian; is:
it: &debian; è:
ru: &debian;:

source: <strong>full featured</strong>: Debian includes more than &all-pkgs; software packages at present. Users can select which packages to install; Debian provides a tool for this purpose. You can find a list and descriptions of the packages currently available in Debian at any of the Debian <url id="http://www.debian.org/distrib/ftplist" name="mirror sites">.
it: <strong>completa</strong>: Debian include attualmente più di &all-pkgs; pacchetti software. Gli utenti possono scegliere quali pacchetti installare; Debian fornisce uno strumento a questo scopo. Si può trovare un elenco con la descrizione dei pacchetti attualmente disponibili in Debian in uno qualsiasi dei <url id="http://www.debian.org/distrib/ftplist" name="siti mirror"> di Debian.
ru: <strong>самодостаточен</strong>: сейчас в Debian входит более &all-pkgs; пакетов программ. Пользователи могут выбирать нужные пакеты для установки; для этого в Debian есть специальный инструмент. Список и описания входящих в Debian пакетов можно найти на любом из <url id="http://www.debian.org/distrib/ftplist" name="серверов-зеркал"> Debian.

source: <strong>free to use and redistribute</strong>: There is no consortium membership or payment required to participate in its distribution and development. All packages that are formally part of &debian; are free to redistribute, usually under terms specified by the GNU General Public License.
it: <strong>liberamente utilizzabile e ridistribuibile</strong>: non è necessaria l'affiliazione a nessuna associazione né alcun pagamento per partecipare alla sua distribuzione e al suo sviluppo. Tutti i pacchetti che sono formalmente parte di &debian; sono liberamente ridistribuibili, di solito nei termini specificati dalla licenza GNU GPL (GNU General Public License).
ru: <strong>свободен для использования и дальнейшего распространения</strong>: для участия в его распространении и разработке не требуется членства или оплаты. Все пакеты, которые формально являются частью &debian;, свободны для дальнейшего распространения обычно на условиях универсальной общественной лицензии GNU (GNU General Public License).

source: The Debian FTP archives also carry approximately &contrib-nonfree-pkgs; software packages (in the <tt>non-free</tt> and <tt>contrib</tt> sections), which are distributable under specific terms included with each package.
it: Gli archivi FTP Debian contengono anche approssimativamente &contrib-nonfree-pkgs; pacchetti software (nelle sezioni <tt>non-free</tt> e <tt>contrib</tt>), che sono distribuibili nei termini specifici indicati in ciascun pacchetto.
ru: В FTP-архивах Debian содержится ещё приблизительно &contrib-nonfree-pkgs; пакетов программ (в разделах <tt>non-free</tt> и <tt>contrib</tt>), которые распространяются на специальных условиях, определённых в каждом пакете.

source: <strong>dynamic</strong>: With about &developers; volunteers constantly contributing new and improved code, Debian is evolving rapidly. The FTP archives are updated twice every day.
it: <strong>dinamica</strong>: con circa &developers; volontari che contribuiscono costantemente con codice nuovo e migliorato, Debian è in rapida evoluzione. Gli archivi FTP vengono aggiornati due volte al giorno.
ru: <strong>динамичен</strong>: благодаря усилиям примерно &developers; добровольцев, постоянно работающих над улучшением существующего и над добавлением нового кода, Debian быстро развивается. FTP-архивы обновляются дважды в день.

source: Most Linux users run a specific <em>distribution</em> of Linux, like &debian;. However, in principle, users could obtain the Linux kernel via the Internet or from elsewhere, and compile it themselves. They could then obtain source code for many applications in the same way, compile the programs, then install them into their systems. For complicated programs, this process can be not only time-consuming but error-prone. To avoid it, users often choose to obtain the operating system and the application packages from one of the Linux distributors. What distinguishes the various Linux distributors are the software, protocols, and practices they use for packaging, installing, and tracking applications packages on users' systems, combined with installation and maintenance tools, documentation, and other services.
it: La maggior parte degli utenti Linux usa una particolare <em>distribuzione</em> di Linux, come &debian;. In via di principio, però, gli utenti possono ottenere il kernel Linux da Internet o da qualche altra parte e compilarlo loro stessi. Poi, nello stesso modo, possono ottenere il codice sorgente di molte applicazioni, compilare i programmi e installarli nel proprio sistema. Per programmi complessi questo processo può essere non solo un dispendio di tempo, ma può anche comportare degli errori. Per evitare tutto ciò, gli utenti spesso scelgono di ottenere il sistema operativo ed i pacchetti delle applicazioni da uno dei distributori Linux. Quello che distingue i vari distributori Linux è il software, i protocolli ed i procedimenti usati per impacchettare, installare e tenere traccia dei pacchetti applicativi sui sistemi degli utenti, e inoltre gli strumenti di installazione e manutenzione, documentazione ed altri servizi.
ru: Большинство пользователей Linux работают с одним из <em>дистрибутивов</em> Linux, таким же как и &debian;. В принципе, пользователь может взять ядро Linux из Интернет или ещё откуда-нибудь и собрать его сам. Таким же образом он может найти исходный код многих приложений, собрать программы и установить их на своей системе. В случае сложных приложений это не только может отнять много времени, но и чревато ошибками. Чтобы избежать этого, пользователи часто используют операционную систему и пакеты приложений, предлагаемые одним из распространителей Linux. Разные распространители (дистрибьюторы) Linux предлагают разный набор программного обеспечения (ПО), протоколы и методы упаковки, установки и сопровождения пакетов приложений в пользовательских системах, включая инструментарий для установки и управления, документацию и другие вещи.

source: &debian; is the result of a volunteer effort to create a free, high-quality Unix-compatible operating system, complete with a suite of applications. The idea of a free Unix-like system originates from the GNU project, and many of the applications that make &debian; so useful were developed by the GNU project.
it: &debian; è il risultato di uno sforzo di volontari per creare un sistema operativo compatibile con Unix, di alta qualità, libero, completato da un insieme di applicazioni. L'idea di un sistema operativo *nix libero ha avuto origine dal progetto GNU e molte applicazioni che rendono &debian; così utile sono state sviluppate dal progetto GNU.
ru: &debian; &mdash; это результат усилий добровольцев по созданию свободной, высококачественной Unix-совместимой операционной системы с полным набором приложений. Идея свободной Unix-подобной системы исходит от проекта GNU, и многие приложения &debian;, сделавшие дистрибутив таким удобным, были разработаны в рамках проекта GNU.

source: For Debian, free has the GNUish meaning (see the <url id="http://www.debian.org/social_contract#guidelines" name="Debian Free Software Guidelines">). When we speak of free software, we are referring to freedom, not price. Free software means that you have the freedom to distribute copies of free software, that you receive source code or can get it if you want it, that you can change the software or use pieces of it in new free programs; and that you know you can do these things.
it: Per Debian, libero ha il significato del mondo GNU (si vedano le <url id="http://www.debian.org/social_contract#guidelines" name="Linee Guida Debian per il Software Libero">). Quando parliamo di software libero, ci riferiamo alla libertà, non al prezzo. Software libero significa che si ha la libertà di distribuire copie di software libero, che si riceve il codice sorgente o lo si può ottenere se lo si desidera, che si può cambiare il software o usare parte di esso in nuovi programmi liberi e che si è a conoscenza di poter fare queste cose.
ru: Для Debian свобода имеет тот же смысл, как и в определении GNU (см. <url id="http://www.debian.org/social_contract#guidelines" name="Критерии Debian по определению Свободного ПО">). Когда мы говорим о свободном ПО, мы говорим именно о свободе, а не о цене. Свободное ПО означает, что вы свободны распространять его копии, что вам доступен его исходный код или при желании его можно получить, что вы можете изменять это ПО или использовать его части в новых свободных программах; и что вы знаете, что вы можете всё это делать.

source: The Debian Project was created by Ian Murdock in 1993, initially under the sponsorship of the Free Software Foundation's GNU project. Today, Debian's developers think of it as a direct descendent of the GNU project.
it: Il Progetto Debian è stato creato da Ian Murdock nel 1993, inizialmente sotto la sponsorizzazione del progetto GNU della Free Software Foundation. Oggi, gli sviluppatori Debian lo vedono come un diretto discendente del progetto GNU.
ru: Проект Debian был создан Яном Мердоком (Ian Murdock) в 1993 году при спонсорском участии проекта GNU Free Software Foundation. Сегодня, разработчики Debian считают его прямым наследником проекта GNU.

source: Although &debian; itself is free software, it is a base upon which value-added Linux distributions can be built. By providing a reliable, full-featured base system, Debian provides Linux users with increased compatibility, and allows Linux distribution creators to eliminate duplication of effort and focus on the things that make their distribution special. See <ref id="childistro"> for more information.
it: Tuttavia anche se &debian; in sé è software libero, rappresenta una base su cui possono essere costruite distribuzioni di Linux dal valore aggiunto. Fornendo un sistema di base sicuro e completo di funzionalità, Debian fornisce agli utenti Linux una compatibilità crescente e permette ai creatori di distribuzioni Linux di eliminare sforzi duplicati e di concentrarsi sulle caratteristiche che rendono speciale la propria distribuzione. Vedere <ref id="childistro"> per maggiori informazioni.
ru: Хотя &debian; и сам по себе является свободным ПО, на его основе можно строить и другие дистрибутивы Linux. Предлагая надёжную, самодостаточную основу системы, Debian предоставляет пользователям Linux улучшенную совместимость, и позволяет создателям дистрибутивов Linux избежать двойной работы и сфокусироваться на вещах, отличающих их собственные дистрибутивы от прочих. Подробней об этом см. <ref id="childistro">.

source: OK, now I know what Debian is... what is Linux?!
it: OK, ora so cosa è Debian... cosa è Linux?!
ru: Я понял, что такое Debian, а что такое Linux?!

source: In short, Linux is the kernel of a Unix-like operating system. It was originally designed for 386 (and better) PCs; today Linux also runs on a dozen of other systems. Linux is written by Linus Torvalds and many computer scientists around the world.
it: In breve, Linux è il kernel di un sistema operativo *nix. È stato originariamente progettato per PC 386 (e superiori); ora può girare anche su dozzine di altri sistemi. Linux è stato scritto da Linus Torvalds e molti altri informatici di tutto il mondo.
ru: В двух словах, Linux &mdash; это ядро Unix-подобной операционной системы. Исходно оно разрабатывалось для машин с процессорами 386 (и более новых), а сейчас может работать и на десятке других архитектур. Ядро Linux было написано Линусом Торвальдсом (Linus Torvalds) и многими компьютерщиками со всего мира.

source: Besides its kernel, a "Linux" system usually has:
it: Oltre al suo kernel, un sistema "Linux" di solito ha:
ru: Кроме ядра, в «Linux»-систему обычно входит:

source: a file system that follows the Linux Filesystem Hierarchy Standard <url id="http://www.pathname.com/fhs/">.
it: un file system che segue il Linux Filesystem Hierarchy Standard <url id="http://www.pathname.com/fhs/">;
ru: файловая система, соответствующая стандарту иерархии файловой системы Linux (Linux Filesystem Hierarchy Standard), <url id="http://www.pathname.com/fhs/">.

source: a wide range of Unix utilities, many of which have been developed by the GNU project and the Free Software Foundation.
it: una vasta gamma di utilità Unix, molte delle quali sono state sviluppate dal progetto GNU e dalla Free Software Foundation.
ru: разнообразные Unix-утилиты, многие из которых были разработаны проектом GNU и Free Software Foundation.

source: The combination of the Linux kernel, the file system, the GNU and FSF utilities, and the other utilities are designed to achieve compliance with the POSIX (IEEE 1003.1) standard; see <ref id="otherunices">.
it: La combinazione del kernel Linux, del file system, delle utilità GNU, di quelle FSF e delle altre utilità è stata progettata per raggiungere la compatibilità con lo standard POSIX (IEEE 1003.1); si veda <ref id="otherunices">.
ru: Ядро Linux, файловая система, утилиты GNU, FSF и другие разрабатываются в соответствии со стандартом POSIX (IEEE 1003.1), см. <ref id="otherunices">.

source: For more information about Linux, see <url id="http://www.linux.org/info/" name="What is Linux"> by <url id="http://www.linux.org/" name="Linux Online">.
it: Per maggiori informazioni su Linux, vedere <url id="http://www.linux.org/info/" name="Cosa è Linux"> di <url id="http://www.linux.org/" name="Linux Online">.
ru: Более подробную информацию о Linux смотрите <url id="http://www.linux.org/info/" name="Что такое Linux"> на сайте <url id="http://www.linux.org/" name="Linux Online">.

source: Does Debian just do GNU/Linux?
it: Debian fa solo GNU/Linux?
ru: Debian работает только с GNU/Linux?

source: Currently, Debian is only available for Linux, but with Debian GNU/Hurd and Debian on BSD kernels, we have started to offer non-Linux-based OSes as a development, server and desktop platform, too. However, these non-linux ports are not officially released yet.
it: Attualmente, Debian è disponibile solo per Linux, ma con Debian GNU/Hurd e Debian su kernel BSD si è iniziato ad offrire come piattaforme di sviluppo, server e desktop anche altri sistemi operativi non basati su Linux. Questi port non-Linux tuttavia non sono ancora rilasciati ufficialmente.
ru: В настоящий момент, Debian доступен только с ядром Linux, но мы уже начали предлагать ОС Debian на ядрах GNU/Hurd и BSD для разработки, серверов и рабочих станций. Однако, эти не-linux переносы пока официально не выпускались.

source: The oldest porting effort is Debian GNU/Hurd.
it: Il primo port su cui si è lavorato è Debian GNU/Hurd.
ru: Первой попыткой переноса является Debian GNU/Hurd.

source: The Hurd is a set of servers running on top of the GNU Mach microkernel. Together they build the base for the GNU operating system.
it: Hurd è un insieme di servizi che funzionano sul microkernel Mach GNU. Insieme costituiscono la base del sistema operativo GNU.
ru: Hurd &mdash; это набор серверов, запущенных поверх микроядра GNU Mach. Эта комбинация составляет основу операционной системы GNU.

source: Please see <url id="http://www.gnu.org/software/hurd/"> for more information about the GNU/Hurd in general, and <url id="http://www.debian.org/ports/hurd/"> for more information about Debian GNU/Hurd.
it: Si veda <url id="http://www.gnu.org/software/hurd/"> per maggiori informazioni su GNU/Hurd in generale e <url id="http://www.debian.org/ports/hurd/"> per maggiori informazioni su Debian GNU/Hurd.
ru: Дополнительную информацию о GNU/Hurd вообще можно найти на <url id="http://www.gnu.org/software/hurd/">, а о Debian GNU/Hurd &mdash; на <url id="http://www.debian.org/ports/hurd/">.

source: A second effort is the port to a BSD kernel. People are working with both the NetBSD and the FreeBSD kernels.
it: Un secondo sforzo è stato quello di fare il port per il kernel BSD. Persone stanno lavorando sia al kernel NetBSD sia a quello FreeBSD.
ru: Второй стала попытка переноса системы на ядро BSD. Работа ведётся как над ядром NetBSD, так и над FreeBSD.

source: See <url id="http://www.debian.org/ports/#nonlinux"> for more information about these non-linux ports.
it: Si veda <url id="http://www.debian.org/ports/#nonlinux"> per maggiori informazioni su questi port non-Linux.
ru: Подробней о не-linux переносах см. <url id="http://www.debian.org/ports/#nonlinux">.

source: What is the difference between &debian; and other Linux distributions? Why should I choose Debian over some other distribution?
it: Qual è la differenza tra &debian; e le altre distribuzioni Linux? Perché scegliere Debian invece di qualche altra distribuzione?
ru: Чем &debian; отличается от других дистрибутивов Linux? Почему я должен отдать предпочтение Debian, а не какому-то другому дистрибутиву?

source: These key features distinguish Debian from other Linux distributions:
it: Queste caratteristiche chiave distinguono Debian dalle altre distribuzioni Linux:
ru: Вот ключевые возможности, отличающие Debian от других дистрибутивов Linux:

source: Freedom:
it: Libertà:
ru: Свобода

source: As stated in the <url id="http://www.debian.org/social_contract" name="Debian Social Contract">, Debian will remain 100% free. Debian is very strict about shipping truly free software. The guidelines used to determine if a work is "free" are provided in <url id="http://www.debian.org/social_contract#guidelines" name="The Debian Free Software">.
it: Come indicato nel <url id="http://www.debian.org/social_contract" name="Contratto sociale Debian">, Debian rimarrà libera al 100%. Debian è molto rigorosa per ciò che riguarda la distribuzione di software veramente libero. Le linee guida usate per determinare se un lavoro è "libero" sono fornite nelle <url id="http://www.debian.org/social_contract#guidelines" name="Linee guida Debian per il Software Libero">.
ru: Как заявлено в <url id="http://www.debian.org/social_contract" name="общественном договоре">, Debian будет всегда свободным на 100%. В Debian распространяется только действительно свободное программное обеспечение. Такое ПО отвечает <url id="http://www.debian.org/social_contract#guidelines" name="критериям Debian по определению свободного ПО">.

source: The Debian package maintenance system:
it: Il sistema di manutenzione dei pacchetti Debian:
ru: Система управления пакетами Debian

source: The entire system, or any individual component of it, can be upgraded in place without reformatting, without losing custom configuration files, and (in most cases) without rebooting the system. Most Linux distributions available today have some kind of package maintenance system; the Debian package maintenance system is unique and particularly robust (see <ref id="pkg_basics">).
it: L'intero sistema, o qualsiasi sua componente individuale, può essere aggiornato in situ senza riformattare, senza perdere i file di configurazione personalizzati e, nella maggior parte dei casi, senza riavviare il sistema. La maggior parte delle distribuzioni Linux disponibili attualmente ha qualche tipo di sistema di manutenzione dei pacchetti; il sistema di manutenzione dei pacchetti Debian è unico e particolarmente robusto (si veda <ref id="pkg_basics">).
ru: Система в целом или любая её часть может быть обновлена без переформатирования, без потери пользовательских настроек и (в большинстве случаев) без перезагрузки системы. В большинстве современных дистрибутивов Linux тоже есть свои системы управления пакетами; система управления пакетами Debian уникальна и хорошо продумана (см. <ref id="pkg_basics">).

source: Open development:
it: Sviluppo aperto:
ru: Открытая модель разработки

source: Whereas other Linux distributions are developed by individuals, small, closed groups, or commercial vendors, Debian is the only major Linux distribution that is being developed cooperatively by many individuals through the Internet, in the same spirit as Linux and other free software.
it: Mentre altre distribuzioni Linux sono sviluppate da singoli, gruppi piccoli, chiusi o produttori commerciali, Debian è l'unica grande distribuzione Linux che è sviluppata in modo cooperativo da molti individui attraverso Internet, nello stesso spirito di Linux e di altro software libero.
ru: В то время как другие дистрибутивы Linux разрабатываются индивидуально, маленькими, закрытыми группами или коммерческими фирмами, Debian &mdash; это единственный дистрибутив Linux, который разрабатывается совместно многими людьми через Интернет в духе Linux и другого свободного программного обеспечения.
