Repository: lurdan/trans-ddp
Catalog: debian-faq/po4a/po/*.po
Languages: it, ru

source: Support for the <em>m68k</em> architecture was dropped in the Etch (Debian 4.0) release, because it did not meet the criteria set by the Debian Release Managers. This architecture covers Amigas and ATARIs having a Motorola 680x0 processor for x>=2; with MMU. However, the port is still active and available for installation even if not a part of this official stable release and might be reactivated for future releases.
it: Il supporto per l'architettura <em>m68k</em> è stato abbandonato nel rilascio Etch (Debian 4.0) perché non soddisfaceva i criteri definiti dai Debian Release Manager. Questa architettura copre macchine Amiga e ATARI con processore Motorola 680x0, dove x>=2, con MMU. Tuttavia il port è ancora attivo e disponibile per l'installazione anche se non fa parte del rilascio stable ufficiale e potrebbe essere riattivato nei rilasci futuri.
ru: Поддержка архитектуры <em>m68k</em> была прекращена в выпуске Etch (Debian 4.0), так как она не удовлетворяла требованиям ответственных за выпуск Debian. К данной архитектуре относятся машины Amiga и ATARI с процессорами Motorola 680x0, где x>=2 означает встроенный модуль MMU. Однако, даже не будучи частью официального стабильного выпуска, данный перенос всё ещё остаётся активным и доступен для установки, и может быть возвращён в число действующих в будущих выпусках.

source: Support for the <em>hppa</em> (Hewlett-Packard's PA-RISC machines) and <em>alpha</em> (Compaq/Digital's Alpha systems) were dropped in the Squeeze (Debian 6.0) release for similar reasons. The <em>arm</em> was dropped too in this release, as it was superceded by the <em>armel</em> arquitecture.
it: Il supporto per <em>hppa</em> (macchine PA-RISC della Hewlett-Packard) e <em>alpha</em> (sistemi Alpha Compaq/Digital) è stato abbandonato nel rilascio Squeeze (Debian 6.0) per ragioni simili. Anche <em>arm</em> è stato abbandonato in questo rilascio, dato che è stato reso obsoleto dall'architettura <em>armel</em>.
ru: Поддержка <em>hppa</em> (машины Hewlett-Packard с архитектурой PA-RISC ) и <em>alpha</em> (системы Compaq/Digital с архитектурой Alpha) была прекращена в выпуске Squeeze (Debian 6.0) по схожим причинам. Также в этом выпуске прекращена поддержка архитектуры <em>arm</em>, вследствие перехода на поддержку <em>armel</em>.

source: For more information on the available ports see the <url id="http://www.debian.org/ports/" name="ports pages at the website">.
it: Per ulteriori informazioni sui port disponibili vedere le <url id="http://www.debian.org/ports/" name="pagine dei port sul sito web">.
ru: Подробности см. на <url id="http://www.debian.org/ports/" name="странице переносов">.

source: For further information on booting, partitioning your drive, enabling PCMCIA (PC Card) devices and similar issues please follow the instructions given in the Installation Manual, which is available from our WWW site at <url id="http://www.debian.org/releases/stable/installmanual">.
it: Per ulteriori informazioni su come fare l'avvio, partizionare le proprie unità, abilitare i dispositivi PCMCIA (PC Card) e per questioni simili si seguano le istruzioni date nel manuale di installazione, che è disponibile dal sito WWW di Debian all'indirizzo <url id="http://www.debian.org/releases/stable/installmanual">.
ru: Информация о загрузке, разметке диска, включении устройств PCMCIA (PC Card) и о прочих вопросах такого рода приведена в <url id="http://www.debian.org/releases/stable/installmanual" name="руководстве по установке">.

source: What kernels does &debian; run?
it: Quali kernel può eseguire &debian;?
ru: На каких ядрах работает &debian;?

source: Debian provides a complete, binary distribution for the following operating system kernels:
it: Debian fornisce una distribuzione binaria completa per i seguenti kernel per sistemi operativi:
ru: Debian предлагает полные дистрибутивы двоичных пакетов для следующих ядер операционных систем:

source: FreeBSD: provided through the <em>kfreebsd-amd64</em> and <em>kfreebsd-i386</em> ports, for 64-bit PCs and 32-bit PCs respectively. These ports were first released in Debian 6.0 Squeeze as a <em>technology preview</em>.
it: FreeBSD: fornito attraverso i port <em>kfreebsd-amd64</em> e <em>kfreebsd-i386</em>, per i PC a 64 bit e 32 bit rispettivamente. Questi port sono stati rilasciati per la prima volta in Debian 6.0 Squeeze come <em>anteprima tecnologica</em>.
ru: FreeBSD: предоставляется посредством переносов <em>kfreebsd-amd64</em> и <em>kfreebsd-i386</em> для 64-битных и 32-битных ПК, соответственно. Данные переносы впервые появились в Debian 6.0 Squeeze как <em>технологические пробы</em>.

source: In addittion to these, work is in progress of a <em>hurd-i386</em> port for 32-bit PC. This port will use GNU Hurd, the new operating system being put together by the GNU group.
it: In aggiunta ad essi, è in fase di lavorazione il port di <em>hurd-i386</em> per PC a 32 bit. Questo port userà GNU Hurd, il nuovo sistema operativo che il gruppo GNU sta sviluppando.
ru: В дополнение к ним, ведётся работа над переносом <em>hurd-i386</em> для 32-битных ПК. В данном переносе будет использована GNU Hurd — новая операционная система, собираемая группой GNU.

source: There were attempts to port the distribution to the NetBSD kernel, providing <em>netbsd-i386</em> (for 32-bit PCs) and <em>netbsd-alpha</em> (for Alpha machines) but these ports were never released and are currently abandoned.
it: Ci sono stati tentativi di fare il port della distribuzione per il kernel NetBSD, fornendo <em>netbsd-i386</em> (per PC a 32 bit) e <em>netbsd-alpha</em> (per macchine Alpha) ma questi port non sono mai stati rilasciati e sono al momento abbandonati.
ru: Были попытки переноса дистрибутива на ядро NetBSD, где предоставлялись ядра <em>netbsd-i386</em> (для 32-битных ПК) и <em>netbsd-alpha</em> (для машин Alpha), но эти переносы никогда не выпускались, и в данный момент работа над ними свёрнута.

source: How compatible is Debian with other distributions of Linux?
it: Quanto è compatibile Debian con le altre distribuzioni Linux?
ru: Насколько Debian совместим с другими дистрибутивами Linux?

source: Debian developers communicate with other Linux distribution creators in an effort to maintain binary compatibility across Linux distributions. Most commercial Linux products run as well under Debian as they do on the system upon which they were built.
it: Gli sviluppatori Debian comunicano con i produttori delle altre distribuzioni Linux nel tentativo di mantenere la compatibilità binaria tra le varie distribuzioni Linux. La maggior parte dei prodotti commerciali per Linux funziona bene sotto Debian come sul sistema su cui è stata compilata.
ru: Разработчики Debian ведут диалог с создателями других дистрибутивов Linux с целью достижения двоичной совместимости между разными дистрибутивами Linux. Большинство коммерческих продуктов для Linux также хорошо работает в Debian, как и на тех системах, где они были собраны.

source: &debian; adheres to the <url id="http://www.pathname.com/fhs/" name="Linux Filesystem Hierarchy Standard">. However, there is room for interpretation in some of the rules within this standard, so there may be slight differences between a Debian system and other Linux systems.
it: &debian; aderisce al <url name="Linux Filesystem Hierarchy Standard" id="http://www.pathname.com/fhs/"> (Standard per la gerarchia del file system Linux). Comunque, c'è spazio per interpretazioni diverse di alcune regole all'interno di questo standard, così ci possono essere piccole differenze tra un sistema Debian e altri sistemi Linux.
ru: &debian; соблюдает <url id="http://www.pathname.com/fhs/" name="Стандарт Иерархии Файловой Системы">. Однако, в правилах стандарта остались места, интерпретация которых может несколько различаться между системой Debian и другими системами Linux.

source: &debian; supports software developed for the <url id="http://www.linuxbase.org/" name="Linux Standard Base">. The LSB is a specification for allowing the same binary package to be used on multiple distributions. The Debian Etch release is Certified for LSB Release 3.1, see the <url id="https://www.linux-foundation.org/lsb-cert/productdir.php" name="Linux Foundation Certification webpage">. Discussion and coordination of efforts towards ensuring Debian meets the requirements of the Linux Standard Base is taking place on the <url id="http://lists.debian.org/debian-lsb/" name="debian-lsb mailing list">.
it: &debian; supporta il software sviluppato per la <url id="http://www.linuxbase.org/" name="Linux Standard Base">. La LSB è una specifica per permettere allo stesso pacchetto binario di essere usato su diverse distribuzioni. Il rilascio Debian Etch è certificato in base alla LSB Release 3.1, vedere la <url id="https://www.linux-foundation.org/lsb-cert/productdir.php" name="pagina web della Linux Foundation Certification">. La discussione e il coordinamento degli sforzi fatti per assicurare che Debian soddisfi i requisiti della Linux Standard Base avvengono sulla <url id="http://lists.debian.org/debian-lsb/" name="mailing list debian-lsb">.
ru: В &debian; есть поддержка ПО, разработанного в соответствии с <url id="http://www.linuxbase.org/" name="Linux Standard Base">. LSB &mdash; это спецификация, позволяющая использовать один двоичный пакет сразу в нескольких дистрибутивах. Выпуск Debian Etch сертифицирован по LSB Release 3.1, см. <url id="https://www.linux-foundation.org/lsb-cert/productdir.php" name="страницу Linux Foundation Certification">. Обсуждение и координирование усилий по улучшению Debian в плане соблюдения требований Linux Standard Base проходит в <url id="http://lists.debian.org/debian-lsb/" name="списке рассылки debian-lsb">.

source: How source code compatible is Debian with other Unix systems?
it: Quanto è compatibile Debian con altri sistemi Unix a livello di codice sorgente?
ru: Насколько исходный код Debian совместим с другими системами Unix?

source: For most applications Linux source code is compatible with other Unix systems. It supports almost everything that is available in System V Unix systems and the free and commercial BSD-derived systems. However in the Unix business such claim has nearly no value because there is no way to prove it. In the software development area complete compatibility is required instead of compatibility in "about most" cases. So years ago the need for standards arose, and nowadays POSIX.1 (IEEE Standard 1003.1-1990) is one of the major standards for source code compatibility in Unix-like operating systems.
it: Per la maggior parte delle applicazioni il codice sorgente di Linux è compatibile con altri sistemi Unix. Supporta quasi tutto ciò che è disponibile per i sistemi Unix basati su System V ed i sistemi liberi e commerciali derivati da BSD. Tuttavia nel mondo Unix una tale affermazione non ha quasi nessun valore perché non c'è modo di provarla. Nell'area di sviluppo del software è richiesta una completa compatibilità piuttosto della compatibilità nella "maggioranza" dei casi. Così, anni fa, è sorta la necessità della presenza di standard e al giorno d'oggi POSIX.1 (IEEE Standard 1003.1-1990) è uno dei principali standard per la compatibilità del codice sorgente nei sistemi operativi simil-Unix.
ru: Исходный код большинства приложений Linux совместим с другими системами Unix. Поддерживается почти всё, что есть в системах Unix System V, а также в свободных и коммерческих системах, происходящих от BSD. Однако, для бизнеса такое утверждение о Unix почти не имеет значения, потому что доказать это никак нельзя. В области разработки программного обеспечения необходима полная совместимость, а не совместимость «в большинстве случаев». Поэтому несколько лет тому назад назрела необходимость в стандартах, и теперь POSIX.1 (IEEE Стандарт 1003.1-1990) является одним из основных стандартов по совместимости исходного кода для Unix-подобных операционных систем.

source: Linux is intended to adhere to POSIX.1, but the POSIX standards cost real money and the POSIX.1 (and FIPS 151-2) certification is quite expensive; this made it more difficult for the Linux developers to work on complete POSIX conformance. The certification costs make it unlikely that Debian will get an official conformance certification even if it completely passed the validation suite. (The validation suite is now freely available, so it is expected that more people will work on POSIX.1 issues.)
it: Linux si propone di aderire al POSIX.1, ma gli standard POSIX hanno un costo elevato e la certificazione di POSIX.1 (e FIPS 151-2) è abbastanza onerosa; questo ha reso più difficile agli sviluppatori Linux il lavorare per una completa conformità a POSIX. Il costo della certificazione rende improbabile che Debian ottenga una certificazione di conformità ufficiale anche se passasse completamente la suite di validazione. (La suite di validazione è ora liberamente disponibile, così è previsto che più persone lavoreranno sui problemi relativi a POSIX.1.)
ru: ОС Linux ориентирована на соответствие POSIX.1, но стандарты POSIX стоят настоящих денег, а сертификация POSIX.1 (и FIPS 151-2) довольно дорога; это ещё более усложняет разработчикам Linux работу по достижению полного соответствия POSIX. Ввиду высокой стоимости сертификации маловероятно, что Debian получит официальное подтверждение о соответствии, даже если он полностью пройдёт аттестационный пакет. (Аттестационный пакет теперь свободно доступен, так что ожидается, что ещё больше людей будет работать над вопросами соответствия POSIX.1).

source: Unifix GmbH (Braunschweig, Germany) developed a Linux system that has been certified to conform to FIPS 151-2 (a superset of POSIX.1). This technology was available in Unifix' own distribution called Unifix Linux 2.0 and in Lasermoon's Linux-FT.
it: L'Unifix GmbH (Braunschweig, Germania) ha sviluppato un sistema Linux che è stato certificato come conforme a FIPS 151-2 (un sovrainsieme di POSIX.1). Questa tecnologia era disponibile nella distribuzione di Unifix chiamata Unifix Linux 2.0 e nel Linux-FT della Lasermoon.
ru: В Unifix GmbH (Брауншвейг, Германия) была разработана Linux-система, которая была сертифицирована как удовлетворяющая FIPS 151-2 (расширенный набор POSIX.1). Эта технология была доступна в собственном дистрибутиве Unifix, названном Unifix Linux 2.0, и в Lasermoon Linux-FT.

source: Can I use Debian packages (".deb" files) on my Red Hat/Slackware/... Linux system? Can I use Red Hat packages (".rpm" files) on my &debian; system?
it: Si possono usare i pacchetti Debian (file ".deb") sul proprio sistema Linux RedHat/Slackware/...? Si possono usare i pacchetti RedHat (file ".rpm") sul proprio sistema &debian;?
ru: Можно ли использовать пакеты Debian (файлы «.deb») в системе RedHat/Slackware/… Linux? Можно ли использовать пакеты RedHat (файлы «.rpm») в системе &debian;?

source: Different Linux distributions use different package formats and different package management programs.
it: Differenti distribuzioni Linux usano differenti formati dei pacchetti e differenti programmi di gestione dei pacchetti.
ru: В различных дистрибутивах Linux используются различные форматы пакетов и различные программы управления пакетами.

source: <strong>You probably can:</strong>
it: <strong>Probabilmente si può:</strong>
ru: <strong>То, что вы, вероятно, сможете сделать</strong>

source: A program to unpack a Debian package onto a Linux host that is been built from a `foreign' distribution is available, and will generally work, in the sense that files will be unpacked. The converse is probably also true, that is, a program to unpack a Red Hat or Slackware package on a host that is based on &debian; will probably succeed in unpacking the package and placing most files in their intended directories. This is largely a consequence of the existence (and broad adherence to) the Linux Filesystem Hierarchy Standard. The <url id="http://packages.debian.org/alien" name="Alien"> package is used to convert between different package formats.
it: È disponibile un programma per spacchettare un pacchetto Debian su un sistema Linux che è sato creato da una distribuzione "straniera", e generalmente funziona, nel senso che quei file verranno spacchettati. Anche l'inverso è probabilmente vero, cioè un programma che apre un pacchetto RedHat o Slackware su di un sistema basato su &debian; probabilmente riuscirà a spacchettare il pacchetto e a mettere la maggior parte dei file nelle directory di destinazione appropriate. Questo è in gran parte una conseguenza dell'esistenza dello standard Linux Filesystem Hierarchy (e della diffusa conformità ad esso). Il pacchetto <url id="http://packages.debian.org/alien" name="Alien"> viene usato per fare conversioni tra i diversi formati dei pacchetti.
ru: Существует программа для распаковки пакета Debian на Linux-машине, работающей под «чужим» дистрибутивом, и она, в общем, работает, в том смысле, что файлы будут распакованы. Вариант наоборот, скорее всего, тоже будет работать, т.е. программа сможет распаковать пакет для RedHat или Slackware на машине, работающей под &debian;, и разместить большинство файлов по нужным каталогам. Это, в значительной степени, стало возможным благодаря существованию (и строгому соблюдению) Стандарта Иерархии Файловой Системы Linux. Для преобразования различных форматов пакетов друг в друга используется программа <url id="http://packages.debian.org/alien" name="Alien">.

source: <strong>You probably do not want to:</strong>
it: <strong>Probabilmente non si vuole:</strong>
ru: <strong>То, что вы, скорее всего, делать не захотите</strong>

source: Most package managers write administrative files when they are used to unpack an archive. These administrative files are generally not standardized. Therefore, the effect of unpacking a Debian package on a `foreign' host will have unpredictable (certainly not useful) effects on the package manager on that system. Likewise, utilities from other distributions might succeed in unpacking their archives on Debian systems, but will probably cause the Debian package management system to fail when the time comes to upgrade or remove some packages, or even simply to report exactly what packages are present on a system.
it: La maggior parte dei gestori dei pacchetti scrive alcuni file di amministrazione quando viene usata per spacchettare un archivio. Questi file di amministrazione sono generalmente non standardizzati. Quindi, aprire un pacchetto Debian su un sistema "straniero" avrà effetti imprevedibili (certamente non utili) sul gestore dei pacchetti di quel sistema. Similmente, le utilità di un'altra distribuzione possono riuscire ad aprire i loro archivi su sistemi Debian, ma probabilmente causeranno dei guasti al sistema di gestione dei pacchetti Debian al momento di aggiornare o rimuovere alcuni pacchetti, o anche semplicemente nel riportare esattamente quali pacchetti sono presenti sul sistema.
ru: Большинство программ управления пакетами при распаковке архива сохраняют какие-то управляющие файлы. Эти файлы обычно не стандартизированы. Поэтому, распаковка пакета Debian на «чужой» машине может непредсказуемым (и навряд ли положительным) образом повлиять на программу управления пакетами этой системы. Таким же образом и архивы других дистрибутивов могут быть успешно распакованы их утилитами в системе Debian, но это может привести к сбоям системы управления пакетами Debian, когда придёт время обновления или удаления каких-нибудь пакетов, или даже просто при выводе списка пакетов, установленных в системе.

source: <strong>A better way:</strong>
it: <strong>Un metodo migliore:</strong>
ru: <strong>Лучший способ:</strong>

source: The Linux File System Standard (and therefore &debian;) requires that subdirectories under <tt>/usr/local/</tt> be entirely under the user's discretion. Therefore, users can unpack `foreign' packages into this directory, and then manage their configuration, upgrade and removal individually.
it: Il Linux File System Standard (e quindi &debian;) richiede che le sottodirectory che si trovano sotto <tt>/usr/local/</tt> siano interamente sottoposte alla discrezione dell'utente. Quindi, gli utenti possono spacchettare pacchetti "stranieri" dentro queste directory e poi possono gestire individualmente la loro configurazione, aggiornamento e rimozione.
ru: Стандарт Файловой Системы Linux (а, следовательно, и &debian;) требует, чтобы подкаталоги в <tt>/usr/local/</tt> полностью находились в распоряжении пользователей. Поэтому, пользователи могут распаковывать «чужие» пакеты в этот каталог, а затем лично управлять их настройкой, обновлением и удалением.

source: How should I install a non-Debian program?
it: Come installare un programma non-Debian?
ru: Как установить не-Debian программу?

source: Files under the directory <tt>/usr/local/</tt> are not under the control of the Debian package management system. Therefore, it is good practice to place the source code for your program in /usr/local/src/. For example, you might extract the files for a package named "foo.tar" into the directory <tt>/usr/local/src/foo</tt>. After you compile them, place the binaries in <tt>/usr/local/bin/</tt>, the libraries in <tt>/usr/local/lib/</tt>, and the configuration files in <tt>/usr/local/etc/</tt>.
it: I file sotto la directory <tt>/usr/local/</tt> non sono sotto il controllo del sistema di gestione dei pacchetti Debian. Quindi è buona abitudine mettere il codice sorgente del proprio programma in /usr/local/src/. Per esempio, si potrebbero estrarre i file da un pacchetto che si chiama "pippo.tar" dentro la directory <tt>/usr/local/src/pippo</tt>. Dopo averli compilati, si mettano i file binari in <tt>/usr/local/bin/</tt>, le librerie in <tt>/usr/local/lib/</tt> e i file di configurazione in <tt>/usr/local/etc/</tt>.
ru: Файлы в каталоге <tt>/usr/local/</tt> не контролируются системой управления пакетами Debian. Поэтому, хорошим вариантом будет размещение исходного кода нужных вам программ в каталоге /usr/local/src/. Например, файлы из пакета «foo.tar» можно распаковать в каталог <tt>/usr/local/src/foo</tt>. После сборки поместите двоичные файлы в <tt>/usr/local/bin/</tt>, библиотеки в <tt>/usr/local/lib/</tt>, а файлы настройки в <tt>/usr/local/etc/</tt>.

source: If your programs and/or files really must be placed in some other directory, you could still store them in <tt>/usr/local/</tt>, and build the appropriate symbolic links from the required location to its location in <tt>/usr/local/</tt>, e.g., you could make the link
it: Se i propri programmi o i file devono essere realmente messi in altre directory, si potrebbe sempre memorizzarli in <tt>/usr/local/</tt> e creare i collegamenti simbolici appropriati dalla posizione richiesta alla loro collocazione in <tt>/usr/local/</tt>; per esempio, si potrebbe creare il collegamento
ru: Если ваша программа и/или файлы на самом деле должны находиться в каком-то другом каталоге, их всё равно можно сохранить в <tt>/usr/local/</tt>, а в нужных местах создать соответствующие символьные ссылки на файлы из <tt>/usr/local/</tt>. Можно, например, сделать так:

source: ln -s /usr/local/bin/foo /usr/bin/foo
it: ln -s /usr/local/bin/pippo /usr/bin/pippo
