Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: The short descriptions that are given above only serve to introduce you to what each package does. Before continuing please thoroughly read the documentation of each program, at least, for the standard usage. It may seem like heavy going now, but later on you'll be <emphasis>very</emphasis> glad you read it.
ca: Les descripcions anteriors només són un resum de la funcionalitat de cada paquet. Abans de continuar, si us plau, llegeix la documentació de cada programa, al menys pel que fa a la seva funcionalitat bàsica. Pot semblar una mica pesat, però et farà <emphasis>molt profit</emphasis> aquesta lectura.
es: Las breves descripciones dadas anteriormente sólo sirven para introducirte a lo que hace cada paquete. Antes de continuar, por favor, lee la documentación de cada programa, al menos para su uso normal. Puede parecerte algo duro ahora, pero más adelante estarás <emphasis>muy</emphasis> contento de haberla leído.
fr: Les courtes descriptions données ci-dessus ne servent que d'introduction à ce que fait chaque paquet. Avant de continuer, veuillez lire attentivement la documentation de chaque programme, au moins l'utilisation standard. Cela peut vous sembler fastidieux maintenant, mais plus tard vous serez <emphasis>très</emphasis> content de l'avoir fait.
it: Le brevi note elencate qui sopra servono solo ad accennare lo scopo di ogni pacchetto. Prima di continuare, è opportuno leggere in modo approfondito la documentazione di ogni programma, almeno per un utilizzo di base. Può sembrare molto pesante farlo adesso, ma in seguito ci si renderà conto che sarà stato <emphasis>utilissimo</emphasis>.

source: Basic terminology
ca: Terminologia bàsica.
es: Terminología básica
fr: Terminologie fondamentale
it: Terminologia di base

source: There are two types of packages.
ca: Hi ha dos tipus de paquets.
es: Hay dos tipos de paquetes.
fr: Deux sortes de paquets existent :
it: Ci sono due tipi di pacchetti.

source: <emphasis role="strong">source package</emphasis>: A source package is a set of files which contain code and data which you can compile and process into execution programs and formatted documents. It usually comes as a combination of <filename>*.orig.tar.gz</filename>, <filename>*.debian.tar.gz</filename> (or <filename>*.diff.gz</filename>), and <filename>*.dsc</filename>. Some other archive and compression methods may be used, too.
ca: <emphasis role="strong">paquet de codi original</emphasis>: un paquet de codi original («source package») proporciona els fitxers de codi original i dades que es poden compilar i processar per construir programes executables o documentes amb format. En general, un paquet és un conjunt de fitxers amb extensió <filename>*.orig.tar.gz</filename>, <filename>*.debian.tar.gz</filename> (o <filename>*.diff.gz</filename>) i <filename>*.dsc</filename>. També hi pot haver altres formats d'arxiu i/o formats de compressió.
es: <emphasis role="strong">paquete fuente</emphasis>: un paquete de fuentes es un conjunto de archivos de código y datos que se pueden compilar y procesar obteniéndose programas ejecutables o documentos formateados. El paquete está formado por archivos con extensión <filename>*.orig.tar.gz</filename>, <filename>*.debian.tar.gz</filename> (o <filename>*.diff.gz</filename>), y <filename>*.dsc</filename>. También pueden estar formados por otros tipos de archivos y/o formatos de compresión.
fr: <emphasis role="strong">paquet source</emphasis> : un paquet source est un ensemble de fichiers contenant le code et les données à compiler et transformer en programmes exécutables et documents formatés. Il est généralement distribué sous forme d'une association des fichiers <filename>*.orig.tar.gz</filename>, <filename>*.debian.tar.gz</filename> (ou <filename>*.diff.gz</filename>), et <filename>*.dsc</filename>. D'autres archives et formats de compression peuvent également être utilisés ;
it: <emphasis role="strong">pacchetto sorgente</emphasis>: Un pacchetto sorgente è composto da una serie di file che contengono codice sorgente e dati, che possono essere compilati ed elaborati per diventare programmi e documenti formattati. Di solito viene distribuito in una combinazione di <filename>*.orig.tar.gz</filename>, <filename>*.debian.tar.gz</filename> (oppure <filename>*.diff.gz</filename>), e <filename>*.dsc</filename>. Possono essere utilizzati anche altri tipi di archivio e metodi di compressione.

source: <emphasis role="strong">binary package</emphasis>: A binary package contains execution programs and formatted documents. It usually comes as <filename>*.deb</filename> for the normal Debian system and as <filename>*.udeb</filename> for the Debian Installer.
ca: <emphasis role="strong">paquets binaris</emphasis>: un paquet binari proporciona directament fitxers executables (ja compilats) i documents amb format. Generalment són fitxers d'extensió <filename>*.deb</filename> per fer servir en sistemes Debian i fitxers <filename>*.udeb</filename> per fer servir en el programa instal·lador de Debian.
es: <emphasis role="strong">paquetes binarios</emphasis>: un paquete binario contiene archivos ejecutables (ya compilados) y documentos formateados. Generalmente están formados por archivos con extensión <filename>*.deb</filename> de uso en instalaciones de Debian y archivos <filename>*.udeb</filename> para el instalador de Debian.
fr: <emphasis role="strong">paquet binaire</emphasis> : un paquet binaire contient les programmes exécutables et documents formatés. Il est généralement distribué sous la forme d'un fichier <filename>*.deb</filename> pour le système Debian normal et <filename>*.udeb</filename> pour l'installateur Debian.
it: <emphasis role="strong">pacchetto binario</emphasis>: Un pacchetto binario contiene il programma già compilato e la documentazione formattata. Di solito viene distribuito come <filename>*.deb</filename> per i normali pacchetti Debian, e come <filename>*.udeb</filename> per quelli del Debian Installer.

source: Don't mix terms like source of the program and the source package of the program!
ca: Cal no confondre les expressions «codi original d'un programa» i «paquet original d'un programa».
es: ¡No confundas los términos «fuentes de un programa» y «paquete fuente de un programa»!
fr: Ne mélangez pas les termes comme source du programme et paquet source du programme !
it: Attenzione a non confondere termini come: sorgente di un programma e pacchetto sorgente del programma!

source: There are several role names used around Debian.
ca: En el desenvolupament i manteniment de Debian, es fan servir les següents expressions per ﻿referir-se a les persones implicades en la construcció i manteniment dels programes i paquets:
es: Se utilizan distintos nombres para referirse a los roles dentro de Debian.
fr: Plusieurs noms de rôle sont utilisés au sein de Debian :
it: Nel mondo Debian sono previsti diversi ruoli.

source: <emphasis role="strong">upstream author</emphasis>: The person who made the original program.
ca: <emphasis role="strong">autor original</emphasis> («upstream author»): és la persona que ha escrit el codi original del programa (o l'original del document en el cas de paquets de documentació).
es: <emphasis role="strong">autor original</emphasis> («upstream author»): para referirse a la persona que ha escrito el código original del programa (o la documentación original en el caso de paquetes de documentación).
fr: <emphasis role="strong">auteur amont</emphasis> : la personne qui a créé le programme à l'origine ;
it: <emphasis role="strong">autore originale (upstream author)</emphasis>: La persona che ha iniziato lo sviluppo del programma.

source: <emphasis role="strong">upstream maintainer</emphasis>: The person who currently maintains the program.
ca: <emphasis role="strong">desenvolupador original</emphasis> («upstream maintainer»): la persona actualment responsable del manteniment del codi original.
es: <emphasis role="strong">desarrollador original</emphasis> («upstream maintainer»): la persona que se encarga de mantener el programa (el código fuente) en la actualidad.
fr: <emphasis role="strong">responsable amont</emphasis> : la personne qui maintient actuellement le programme ;
it: <emphasis role="strong">responsabile del programma (upstream maintainer)</emphasis>: La persona che attualmente sviluppa il programma.

source: <emphasis role="strong">maintainer</emphasis>: The person who makes Debian package of the program.
ca: <emphasis role="strong">empaquetador (desenvolupador)</emphasis> («maintainer»): la persona encarregada de la construcció i actualització dels paquets per a Debian.
es: <emphasis role="strong">empaquetador (desarrollador)</emphasis> («maintainer»): la persona que se encarga de construir y mantener actualizados paquetes para Debian &tagopen_footnote;N. del t.: hay una cierta ambigüedad en la traducción de «maintainer» por desarrollador puesto que se puede confundir con la traducción de «Debian Developer», desarrollador que pertenece al proyecto, y de «upstream maintainer», desarrollador del programa original&tagclose_footnote;.
fr: <emphasis role="strong">responsable</emphasis> : la personne qui maintient le paquet Debian du programme ;
it: <emphasis role="strong">responsabile del pacchetto (maintainer)</emphasis>: La persona che ha creato il pacchetto Debian del programma.

source: <emphasis role="strong">sponsor</emphasis>: The person who helps maintainers to upload packages to the official Debian Package Archive after checking their contents.
ca: <emphasis role="strong">patrocinador</emphasis> («sponsor»): la persona (cal que sigui un DD o DM) que transfereix els paquets construïts pels desenvolupadors al repositori de Debian després de comprovar que el paquet s'ajusta a las normes de Debian.
es: <emphasis role="strong">patrocinador</emphasis> («sponsor»): la persona (que debe ser un DD o DM, véase más adelante) que transfiere los paquetes elaborados por el desarrollador al archivo de paquetes de Debian (al repositorio de Debian) después de comprobar que el paquete cumple los requisitos exigidos.
fr: <emphasis role="strong">parrain</emphasis> : la personne qui aide les responsables à envoyer des paquets dans l'archive officielle de paquets Debian après en avoir vérifié le contenu ;
it: <emphasis role="strong">sponsor</emphasis>: La persona che aiuta i responsabili dei pacchetti a verificarne la correttezza dei contenuti e a depositarli nell'archivio Debian ufficiale.

source: <emphasis role="strong">mentor</emphasis>: The person who helps novice maintainers on packaging etc.
ca: <emphasis role="strong">mentor</emphasis>: la persona que ajuda als desenvolupadors principiants a iniciar-se en la construcció i manteniment del paquet.
es: <emphasis role="strong">mentor</emphasis>: la persona que ayuda a los desarrolladores principiantes a iniciarse en la construcción y mantenimiento de paquetes.
fr: <emphasis role="strong">mentor</emphasis> : la personne qui aide les responsables débutants pour l'empaquetage, etc.
it: <emphasis role="strong">mentore</emphasis>: La persona che aiuta i responsabili dei pacchetti alle prime armi nelle operazioni di creazione del pacchetto, ecc.

source: <emphasis role="strong">Debian Developer</emphasis> (DD): The person who is a member of Debian. He has full upload right to the official Debian Package Archive.
ca: <emphasis role="strong">desenvolupador de Debian (DD)</emphasis> («Debian Developer»): la persona que es membre de Debian. Té autorització (sense limitacions) per transferir paquets al repositori oficial de Debian.
es: <emphasis role="strong">desarrollador de Debian (DD)</emphasis> («Debian Developer»): la persona que es miembro de Debian. Tiene permiso total para transferir paquetes al repositorio oficial de Debian.
fr: <emphasis role="strong">développeur Debian</emphasis> (DD) : la personne qui est membre de Debian. Elle a tous les droits d'envoi vers l'archive officielle de paquets Debian ;
it: <emphasis role="strong">sviluppatore Debian (Debian Developer)</emphasis> (DD): membro del progetto Debian. Questa persona ha la possibilità di depositare i pacchetti all'interno dell'archivio Debian ufficiale.

source: <emphasis role="strong">Debian Maintainer</emphasis> (DM): The person who has limited upload right to the official Debian Package Archive.
ca: <emphasis role="strong">empaquetador/responsable de Debian (DM)</emphasis>(«Debian Maintainer»): la persona amb autorització limitada per transferir paquets al repositori oficial de Debian.
es: <emphasis role="strong">Empaquetador de Debian (DM)</emphasis> («Debian Maintainer»): la persona que tiene permiso limitado para transferir paquetes al repositorio oficial de Debian.
fr: <emphasis role="strong">responsable Debian</emphasis> (DM) : la personne qui a des droits d'envoi limités vers l'archive officielle de paquets Debian.
it: <emphasis role="strong">responsabile Debian (Debian Maintainer)</emphasis> (DM): Questa persona con diritti limitati di accesso all'archivio ufficiale dei pacchetti di Debian.

source: There are several version names used around Debian.
es: Dentro de Debian se utiliza la siguiente terminología para referirse a las distintas versiones:
fr: Plusieurs noms de version sont utilisés dans Debian :

source: <emphasis role="strong">upstream source version</emphasis>: The upstream source version is referred as <literal><replaceable>version</replaceable></literal>.
ca: <emphasis role="strong">versió del codi original</emphasis> («upstream source version»): es fa servir l'expressió <literal><replaceable>versió</replaceable></literal>.
es: <emphasis role="strong">versión de las fuentes originales</emphasis> («upstream source version»): se utiliza el término <literal><replaceable>versión</replaceable></literal>.
fr: <emphasis role="strong">version source amont</emphasis> : soit la version source amont <literal><replaceable>version</replaceable></literal> ;
it: <emphasis role="strong">versione originale del sorgente (upstream source version)</emphasis>: La versione originale del sorgente è indicata con <literal><replaceable>version</replaceable></literal>.

source: <emphasis role="strong">Debian revision</emphasis>: The revision by Debian on package is referred as <literal><replaceable>revision</replaceable></literal>.
ca: <emphasis role="strong">revisió Debian</emphasis> («Debian revision»): es fa servir l'expressió <literal><replaceable>revisió</replaceable></literal>.
es: <emphasis role="strong">revisión Debian</emphasis> («Debian revision»): para la revisión del paquete Debian se utiliza el término <literal><replaceable>revisión</replaceable></literal>.
fr: <emphasis role="strong">révision Debian</emphasis> : soit la révision par Debian d'un paquet <literal><replaceable>revision</replaceable></literal> ;
it: <emphasis role="strong">Revisione Debian (Debian revision)</emphasis>: La revisione di Debian del pacchetto è indicata con <literal><replaceable>revision</replaceable></literal>.

source: <emphasis role="strong">Debian package version</emphasis>: The Debian package version is referred as the following.
ca: <emphasis role="strong">versió del paquet Debian</emphasis> («Debian package version»): es fan servir les següents expressions:
es: <emphasis role="strong">versión del paquete Debian</emphasis> («Debian package version»): para referirse a la versión del paquete Debian se utiliza la nomenclatura que se indica a continuación.
fr: <emphasis role="strong">version de paquet Debian</emphasis> : la version de paquet Debian est mentionnée comme suit :
it: <emphasis role="strong">Versione del pacchetto Debian (Debian package version)</emphasis>: La versione del pacchetto Debian è composta come segue.

source: <literal><replaceable>version</replaceable></literal> for the native Debian binary package and for the Debian source package.
ca: <literal><replaceable>versió</replaceable></literal> per als paquets binaris ﻿nadius de Debian i pels paquets del codi original.
es: <literal><replaceable>versión</replaceable></literal> para los paquetes binarios nativos de Debian y para los paquetes de código fuente.
fr: <literal><replaceable>version</replaceable></literal> pour un paquet binaire Debian natif et pour un paquet source Debian ;
it: <literal><replaceable>version</replaceable></literal> per i pacchetti binari e sorgenti nativi Debian.

source: <literal><replaceable>version</replaceable>-<replaceable>revision</replaceable></literal> for the non-native Debian binary package.
ca: <literal><replaceable>versió</replaceable>-<replaceable>revisió</replaceable></literal> per als paquets binaris que no són ﻿nadius de Debian.
es: <literal><replaceable>versión</replaceable>-<replaceable>revisión</replaceable></literal> para los paquetes binarios de Debian no nativos.
fr: <literal><replaceable>version</replaceable>-<replaceable>revision</replaceable></literal> pour un paquet binaire Debian non natif.
it: <literal><replaceable>version</replaceable>-<replaceable>revision</replaceable></literal> per i pacchetti binari non-nativi Debian (esempio quelli di terze parti).

source: Please read the other manuals if you need more details on terminology.
es: Para más detalles de la terminología, se aconseja leer los otros manuales de Debian.
fr: Veuillez lire les autres manuels pour plus de détail sur la terminologie.

source: Official Debian Developer
ca: Desenvolupador oficial de Debian.
es: Desarrollador oficial de Debian
fr: Développeur Debian officiel
it: Sviluppatore ufficiale Debian

source: You can not become an official <emphasis role="strong">Debian Developer</emphasis> (DD) over night because it takes more than technical skill. Please do not be discouraged by this. If it is useful to others, you can still upload your package either as a <emphasis role="strong">maintainer</emphasis> through a <emphasis role="strong">sponsor</emphasis> or as a <emphasis role="strong">Debian Maintainer</emphasis>. See <ulink url="&nm-join;">Debian New Maintainers</ulink> for more.
fr: Il n'est pas possible de devenir <emphasis role="strong">développeur Debian</emphasis> (DD) en une nuit car il ne suffit pas de compétences techniques. Veuillez ne pas vous décourager. Si c'est utile à d'autres, vous pouvez toujours envoyer vos paquets soit en tant que <emphasis role="strong">responsable</emphasis> via un <emphasis role="strong">parrain</emphasis> ou comme un <emphasis role="strong">responsable Debian</emphasis>. Voir le <ulink url="&nm-join;">coin du nouveau responsable Debian</ulink> pour plus d'informations.

source: Please note that you do not need to create any new package to become an official Debian Developer. Contributing to the existing packages can provide a path to become an official Debian Developer too. There are many packages waiting for good maintainers (see <xref linkend="choose"/> ).
ca: No és necessari construir un nou paquet per ésser desenvolupador oficial de Debian. Una opció és contribuir en el manteniment d'algun dels paquets de la distribució. Hi ha molts paquets pendents d'algú que s'en faci càrrec (consulta <xref linkend="choose"/> ).
es: Ten en cuenta que no es necesario construir un paquete nuevo para poder convertirte en desarrollador oficial de Debian. Una opción para ser desarrollador oficial es contribuir al mantenimiento de los paquetes ya existentes en la distribución. Hay muchos paquetes esperando un buen responsable (véase <xref linkend="choose"/> ).
fr: Remarquez qu'il n'est pas nécessaire de créer de nouveau paquet pour devenir un développeur Debian officiel. Contribuer aux paquets existants peut aussi fournir une voie pour devenir un développeur Debian. Beaucoup de paquets sont en attente de bons responsables (voir <xref linkend="choose"/> ).

source: Where to ask for help
ca: On demanar ajuda.
es: Dónde pedir ayuda
fr: Où demander de l'aide
it: Dove trovare aiuto
ja: 相談するには

source: Making a small test package is good way to learn details of packaging. Inspecting existing well maintained packages is the best way to learn how other people make packages.
ca: Començar a treballar en un paquet petit és una bona opció per aprendre els detalls de la creació de paquets. Inspeccionar els paquets mantinguts per altres persones és una excel·lent manera d'aprendre.
es: Construir un paquete pequeño es una buena forma de aprender los detalles del empaquetamiento. Inspeccionar paquetes bien mantenidos es la mejor forma de aprender cómo otros mantienen paquetes.
fr: Faire un petit paquet de test est une bonne façon d'apprendre les particularités de l'empaquetage. Examiner les paquets bien maintenus est le meilleur moyen d'apprendre comment les autres font leurs paquets.
it: Creare un piccolo pacchetto di test è un ottimo metodo per imparare i dettagli della pacchettizzazione. Analizzare dei pacchetti già esistenti e ben manutenuti, è invece, il metodo migliore per capire come creano i pacchetti le altre persone.

source: If you still have questions about packaging that you couldn't find answers to in the available documentation and web resources, you can ask them on the Debian Mentors' mailing list at <ulink url="&debian-mentors-ldo;">debian-mentors@lists.debian.org</ulink>. The more experienced Debian developers will gladly help you, but do read at least some of the documentation before asking a question!
fr: Si vous avez encore des questions sur la création de paquets pour lesquelles vous n'avez pas pu trouver de réponse dans la documentation, vous pouvez les poser sur la liste de diffusion des mentors Debian en <ulink url="&debian-mentors-ldo;">debian-mentors@lists.debian.org</ulink>. Les responsables Debian les plus expérimentés seront heureux de vous aider, mais au moins lisez une partie de la documentation avant de poser une question !

source: See <ulink url="&debian-mentors-ldo;">&debian-mentors-ldo;</ulink> for more information about this mailing list.
fr: Consultez <ulink url="&debian-mentors-ldo;">&debian-mentors-ldo;</ulink> pour plus d'informations sur cette liste de diffusion.

source: When you receive a bug report (yes, actual bug reports!), you will know that it is time for you to dig into the <ulink url="&bts;">Debian Bug Tracking System</ulink> and read the documentation there, to be able to deal with the reports efficiently. I highly recommend reading the <ulink url="&devref-bug-handling;">Developer's Reference, 5.8. 'Handling bugs'</ulink>.
fr: Quand vous recevrez un rapport de bogue (oui, un vrai rapport de bogue !) vous saurez qu'il est temps de vous plonger dans le <ulink url="&bts;">système de suivi de bogues Debian</ulink> et de lire la documentation, pour être à même de gérer les rapports efficacement. La lecture de la <ulink url="&devref-bug-handling;">référence du développeur, chapitre 5.8 « Manipulation des bogues »</ulink> est fortement recommandée.

source: If you still have questions, ask on the Debian Developers' mailing list at <ulink url="&debian-devel-ldo;">debian-devel@lists.debian.org</ulink>. See <ulink url="&debian-devel-ldo;">&debian-devel-ldo;</ulink> for more information about this mailing list.
fr: Si vous avez encore des questions, posez-les sur la liste de diffusion des développeurs Debian en <ulink url="&debian-devel-ldo;">debian-devel@lists.debian.org</ulink>. Consultez <ulink url="&debian-devel-ldo;">&debian-devel-ldo;</ulink> pour plus d'informations sur cette liste de diffusion.
