Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: The second step of Autotools work flow is usually that the user obtains this distributed source and runs <literal>./configure &amp;&amp; make</literal> in the source to compile program into a <command><replaceable>binary</replaceable></command>.
ca: La segona etapa és l'execució de <literal>./configure &amp;&amp; make</literal> en el directori del codi font per compilar el programa generant el fitxer <command><replaceable>binari</replaceable></command>.
es: El segundo paso en el uso de «Autotools« es la ejecución de «<literal>./configure &amp;&amp; make</literal>» en el directorio del código fuente para compilar el programa generando un archivo <command><replaceable>binary</replaceable></command>.
fr: La deuxième étape du travail des Autotools est habituellement que les utilisateurs se procurent ces sources et exécutent « <literal>./configure &amp;&amp; make</literal> » dans les sources pour compiler le programme en un <command><replaceable>binaire</replaceable></command>.
it: Il passo successivo da compiere con Autotools, di solito, consiste nel procurarsi il sorgente del programma e nel compilarlo nella directory <command><replaceable>binary</replaceable></command> tramite l'esecuzione dei comandi <literal>./configure &amp;&amp; make</literal> all'interno della directory dei sorgenti stessi.

source: Makefile.in -----+ +-&gt; Makefile -----+-&gt; make -&gt; <replaceable>binary</replaceable> src/Makefile.in -+-&gt; ./configure -+-&gt; src/Makefile -+ config.h.in -----+ +-&gt; config.h -----+ | config.status -+ config.guess --+
ca: Makefile.in -----+ +-&gt; Makefile -----+-&gt; make -&gt; <replaceable>binari</replaceable> src/Makefile.in -+-&gt; ./configure -+-&gt; src/Makefile -+ config.h.in -----+ +-&gt; config.h -----+ | config.status -+ config.guess --+
fr: Makefile.in -----+ +-&gt; Makefile -----+-&gt; make -&gt; <replaceable>binaire</replaceable> src/Makefile.in -+-&gt; ./configure -+-&gt; src/Makefile -+ config.h.in -----+ +-&gt; config.h -----+ | config.status -+ config.guess --+

source: You can change many things in the <filename>Makefile</filename> file such as the default file install location using the command option, e.g. <command>./configure --prefix=/usr</command>.
es: Puedes hacer cambios en el archivo <filename>Makefile</filename> como el directorio de instalación predeterminado usando las opciones de la orden, p.ej: <command>./configure --prefix=/usr</command>.
fr: Vous pouvez modifier plein de choses dans le fichier <filename>Makefile</filename> comme le répertoire d'installation par défaut en utilisant une option de commande, par exemple « <command>./configure --prefix=/usr</command> ».
it: Si possono modificare molte cose nel file <filename>Makefile</filename>, come la posizione predefinita di installazione dei file utilizzando l'opzione, ad es. <command>./configure --prefix=/usr</command>.

source: Although it is not required, updating the <filename>configure</filename> and other files with <literal>autoreconf -i -f</literal> as the user may improve the compatibility of the source.
es: Aunque no es necesario, la actualización del archivo <filename>configure</filename> y de otros archivos con la orden <literal>autoreconf -i -f</literal> es la mejor manera para mejorar la compatibilidad del código fuente.
fr: Bien que ce ne soit pas nécessaire, mettre à jour <filename>configure</filename> et les autres fichiers avec « <literal>autoreconf -i -f</literal> » en tant qu'utilisateur peut améliorer la compatibilité des sources.

source: <ulink url="&cxx;Make">CMake</ulink> is an alternative build system. You can notice such sources by the <filename>CMakeLists.txt</filename> file.
fr: <ulink url="http://fr.wikipedia.org/wiki/CMake">CMake</ulink> est un système de construction alternatif. De telles sources peuvent être remarquées avec le fichier <filename>CMakeLists.txt</filename>.

source: Package name and version
ca: Nom del paquet i versió.
es: Nombre del paquete y versión
fr: Nom et version de paquet
it: Nome e versione del pacchetto
ja: パッケージ名とバージョン

source: You should start packaging with a completely clean (pristine) source directory, or simply with freshly unpacked sources.
ca: Per començar la construcció del paquet, cal fer-ho amb el directori del codi font «net», o simplement només amb els fitxers de l'arxiu comprimit del codi font.
es: Deberías empezar a construir tu paquete en un directorio de fuentes completamente limpio, o simplemente con las fuentes recién desempaquetadas.
fr: Vous devriez commencer la création du paquet avec un répertoire source complètement propre (originel), ou simplement avec les sources fraîchement décompressées.
it: Si dovrebbe iniziare la fase di pacchettizzazione con la directory dei sorgenti completamente ripulita, o semplicemente partendo da una nuova estrazione dall'archivio dei sorgenti.
ja: パッケージ化の作業は完全にクリーンな (オリジナルのままの) ソースディレクトリ、簡単に言えば新しく展開したソースから始めるべきです。

source: For the package to be built correctly, you must make the program's original name lowercase (if it isn't already), and you should move the source directory to <filename><replaceable>packagename</replaceable>-<replaceable>version</replaceable></filename>.
ca: Cal començar per canviar el nom original del programa fent servir lletres minúscules i el nom del directori amb el codi font com <filename><replaceable>nom_del_paquet</replaceable>-<replaceable>versió</replaceable></filename>.
es: Para construir correctamente el paquete, debes cambiar el nombre original del programa a letras minúsculas (si no lo está ya), y deberías renombrar el directorio de fuentes a <filename><replaceable>nombre_de_paquete</replaceable>-<replaceable>versión</replaceable></filename>.
fr: Pour que le paquet soit correctement construit, vous devez changer le nom du programme en minuscule (si ce n'est déjà fait), et vous devriez changer le répertoire source en <filename><replaceable>nomdepaquet</replaceable>-<replaceable>version</replaceable></filename>.
it: Per costruire correttamente il pacchetto, si deve convertire in minuscolo il nome del programma originale (se non lo fosse), e rinominare la directory dei sorgenti in <filename><replaceable>pacchetto</replaceable>-<replaceable>versione</replaceable></filename>.

source: If the program name consists of more than one word, contract them to one word, or make an abbreviation. For example, program John's little editor for X package would be named <systemitem role="package">johnledx</systemitem>, or <systemitem role="package">jle4x</systemitem>, or whatever you decide, as long as it's under some reasonable limit, e.g. 20 characters.
fr: Si le nom du programme est constitué de plusieurs mots, réduisez-le à un mot, ou faites une abréviation. Par exemple, le paquet du programme « John's little editor for X » pourrait s'appeler <systemitem role="package">johnledx</systemitem>, ou <systemitem role="package">jle4x</systemitem>, ou ce que vous préférez, tant qu'il reste sous une limite raisonnable, comme vingt caractères.
it: Se il nome del programma è formato da più di una parola, si deve contrarlo in una sola parola, o abbreviarlo. Per esempio, il pacchetto del programma John's little editor for X potrebbe essere chiamato <systemitem role="package">johnledx</systemitem>, o <systemitem role="package">jle4x</systemitem>, o qualsiasi altra cosa attinente, che riesca a stare sotto un numero ragionevole di caratteri, ad esempio 20.

source: Version string can be compared by <literal>dpkg --compare-versions <replaceable>ver1</replaceable> <replaceable>op</replaceable> <replaceable>ver2</replaceable></literal>. See <citerefentry> <refentrytitle>dpkg</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> manpage.
ca: Pots comparar la versió del programa executant en el terminal <literal>dpkg --compare-versions <replaceable>versió-1</replaceable> <replaceable>op</replaceable> <replaceable>versió-2</replaceable></literal>. Consulta <citerefentry> <refentrytitle>dpkg</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> manpage.
fr: Les versions peuvent être comparée avec « <literal>dpkg --compare-versions <replaceable>ver1</replaceable> <replaceable>op</replaceable> <replaceable>ver2</replaceable></literal> ». Voir <citerefentry> <refentrytitle>dpkg</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
it: La stringa della versione può essere confrontata con <literal>dpkg --compare-versions <replaceable>ver1</replaceable> <replaceable>op</replaceable> <replaceable>ver2</replaceable></literal>. Vedere <citerefentry> <refentrytitle>dpkg</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> manpage.

source: Also check for the exact version of the program (to be included in the package version). If that piece of software is not numbered with versions like <literal>X.Y.Z</literal>, but with some kind of date, feel free to use that date as the version number, as long as newer version numbers will look larger. While it is best to use the same version number as what upstream uses, if it is in the format of <literal>09Oct23</literal> you may need to convert it to <literal>YYYYMMDD</literal> format, which would be <literal>20091023</literal>, to ensure proper order for upgrade with the <command>dpkg</command> program.<placeholder type="footnote" id="0"/>
ca: Comprova la versió del programa (amb la qual es construirà el paquet). Si el programa no està numerat, amb número de versió de l'estil <literal>X.Y.Z</literal>, però si amb una data, ets lliure de fer servir la data com a número de versió, precedida per «0.0» (per tal de preveure que els autors alliberin una nova versió del tipus 1.0). Si la data del codi original és <literal>09Oct23</literal>, pots convertirla al format <literal>YYYYMMDD</literal> i fer servir la cadena <literal>20091023</literal> (amb el format de data ISO 8601) com a número de versió. D'aquesta manera es garanteix el bon funcionament de les actualitzacions amb el programa <command>dpkg</command> <placeholder type="footnote" id="0"/>.
fr: Vérifiez aussi la version exacte du programme (à inclure dans la version du paquet). Si ce logiciel n'est pas numéroté avec un numéro de version comme <literal>X.Y.Z</literal>, mais avec une date de distribution, vous pouvez utiliser cette date comme numéro de version, tant que les numéros de version futurs apparaîtront plus grand. Bien qu'il soit préférable d'utiliser le même numéro de version qu'en amont, si la version ressemble à <literal>09Oct23</literal>, vous pourriez avoir besoin de la convertir au format <literal>AAAAMMJJ</literal>, pour la transformer en <literal>20091023</literal>, afin de garantir un ordre approprié pour les mises à jour avec le programme <command>dpkg</command>. <placeholder type="footnote" id="0"/>
it: Bisogna controllare inoltre l'esatta versione del programma (che deve essere inclusa nella versione del pacchetto). Se il programma non usa una numerazione delle versioni tipo <literal>X.Y.Z</literal>, ma qualche tipo di data, si può utilizzare tale data come numero di versione, a condizione che la numerazione vada ad aumentare. Anche se è meglio utilizzare lo stesso numero di versione usato dal programma, se il formato è <literal>09Oct23</literal> potrebbe essere necessario convertirlo nel formato <literal>YYYYMMDD</literal>, la data di prima quindi diventerebbe <literal>20091023</literal>, questo è utile per garantire il corretto ordine di aggiornamento con il programma <command>dpkg</command>. <placeholder type="footnote" id="0"/>

source: Some programs won't be numbered at all, in which case you should contact the upstream maintainer to see if they've got some other revision-tracking method.
ca: Tot i així, alguns programes no fan servir cap tipus de codificació per diferenciar les versions: en aquest cas caldrà contactar amb l'autor original per saber si fa servir algun altre sistema de control de versions.
es: Aún así habrá algunos programas que ni siquiera estén numerados, en cuyo caso deberás contactar con el autor original para ver si tiene algún otro sistema de seguimiento de revisiones.
fr: Certains programmes ne seront pas numérotés du tout, auquel cas vous devriez contacter le responsable amont pour voir s'il a une autre méthode de suivi des révisions.
it: Alcuni programmi non usano alcun tipo di numerazione, in questo caso si dovrebbe contattare l'autore del programma, per controllare se viene usato qualche altro metodo di revisione.

source: Initial Debian package
ca: Paquet Debian inicial.
es: «Debianización» inicial
fr: Paquet Debian initial
it: Il primo pacchetto Debian
ja: 最初の Debian パッケージ

source: The following text assumes you are using Bash as your login shell. If you use other login shells such as Z shell, use their pertinent configuration files instead of <filename>~/.bashrc</filename>.
ca: El text mostrat a continuaci dona per suposat que fas servir Bash com a intérpret d'ordres. Si fas sevir altres interprets, com és ara Z shell, hauràs de fer servir els seus arxius de configuració en lloc de <filename>~/.bashrc</filename>.
es: El texto mostrado a continuación da por supuesto que estás ejecutando Bash como tu intérprete de línea de órdenes. Si utilizas otros intérpretes, como Z shell, deberás utilizar sus correspondientes ficheros de configuración en lugar de <filename>~/.bashrc</filename>.
fr: Le texte qui suit présupposé que l'interpréteur de commandes que vous utilisez à la connexion est Bash. Si vous utilisez un autre interpréteur de commandes, par exemple zsh, il est nécessaire d'utiliser le fichier de configuration approprié à la place de <filename>~/.bashrc</filename>.
it: Il seguente testo assume che stiate utilizzando Bash come shell di login. Se si utilizza un'altra shell di login, come la Z shell, bisognerà usare i suoi file di configurazione al posto di <filename>~/.bashrc</filename>.

source: Let's set up the shell environment variable <literal>$DEBEMAIL</literal> and <literal>$DEBFULLNAME</literal> so many Debian maintenance tools recognize your name and email address to use for packages as follows.<placeholder type="footnote" id="0"/>.
ca: Comença per configurar les variables d'entorn del shell Bash <literal>$DEBEMAIL</literal> i <literal>$DEBFULLNAME</literal> que faran servir les eines de manteniment de Debian per tal d'obtenir el teu nom i adreça electrònica com s'indica a continuació<placeholder type="footnote" id="0"/>.
es: Primero debes configurar las variables de entorno Bash shell <literal>$DEBEMAIL</literal> y <literal>$DEBFULLNAME</literal> que son utilizadas por varias herramientas de mantenimiento de Debian para obtener tu nombre y correo electrónico como se indica a continuación<placeholder type="footnote" id="0"/>.
fr: Configurez les variables d'environnement de l'interpréteur de commandes Bash <literal>$DEBEMAIL</literal> et <literal>$DEBFULLNAME</literal> de tel sorte que les nombreux outils de maintenance Debian identifient vos nom et adresse électronique comme suit :<placeholder type="footnote" id="0"/>.
it: Una delle prime cose da fare è impostare le variabili d'ambiente della shell <literal>$DEBEMAIL</literal> e <literal>$DEBFULLNAME</literal> visto che molti strumenti di gestione di Debian usano queste variabili per recuperare il nome e l'email da utilizzare nei pacchetti, come viene mostrato di seguito.<placeholder type="footnote" id="0"/>.

source: $ cat &gt;&gt;~/.bashrc &lt;&lt;EOF DEBEMAIL=your.email.address@example.org DEBFULLNAME=Firstname Lastname export DEBEMAIL DEBFULLNAME EOF
ca: $ cat &gt;&gt;~/.bashrc &lt;&lt;EOF DEBEMAIL=la.teva.adreça.electrònica@exemple.org DEBFULLNAME=el teu nom i llinatge export DEBEMAIL DEBFULLNAME EOF
es: $ cat &gt;&gt;~/.bashrc &lt;&lt;EOF DEBEMAIL=tu.dirección@ejemplo.org DEBFULLNAME=tu nombre y apellido export DEBEMAIL DEBFULLNAME EOF
fr: $ cat &gt;&gt;~/.bashrc &lt;&lt;EOF DEBEMAIL=votre.adresse.mail@example.org DEBFULLNAME=Prénom Nom export DEBEMAIL DEBFULLNAME EOF
it: $ cat &gt;&gt;~/.bashrc &lt;&lt;EOF DEBEMAIL=il.vostro.indirizzo.email@example.org DEBFULLNAME=Nome Cognome export DEBEMAIL DEBFULLNAME EOF

source: Let's make an initial Debian package by issuing the <command>dh_make</command> command as follows.
ca: Ara ja pots començar la construcció del paquet Debian executant l'ordre <command>dh_make</command>:
es: Ahora puedes iniciar la construcción del paquete Debian ejecutando la orden <command>dh_make</command> como se describe a continuación.
fr: Préparez le paquet Debian initial en invoquant la commande <command>dh_make</command> comme suit :
it: Adesso si può iniziare la costruzione del pacchetto Debian eseguendo il programma <command>dh_make</command> come segue:

source: If the upstream source provides the <filename>debian</filename> directory and its contents, run the <command>dh_make</command> command with the <literal>--addmissing</literal> option, instead. The new source <literal>3.0 (quilt)</literal> format is quite robust not to break even for these packages. You may need to update contents provided by the upstream for your Debian package.
ca: Si el fitxer amb el codi font ja té un directori <filename>debian</filename> amb fitxers, executa l'ordre <command>dh_make</command> amb l'opció <literal>--addmissing</literal>. El nou format de paquet <literal>3.0 (quilt)</literal> és molt robust i traballarà be amb aquests paquets. Així s'actualitzarà el contingut dels fitxers de l'autor original per al teu paquet Debian.
es: Si el archivo del código fuente original ya contiene un directorio <filename>debian</filename> con su contenido, ejecuta la orden <command>dh_make</command> con la opción <literal>--addmissing</literal>. El nuevo formato <literal>3.0 (quilt)</literal> es lo bastante robusto para no romper ni esos paquetes. Así se actualizará el contenido aportado por el autor para tu paquete Debian.
fr: Si les sources amont fournissent le répertoire <filename>debian</filename> et son contenu, exécutez plutôt la commande <command>dh_make</command> avec l'option <literal>--addmissing</literal>. Le nouveau format source <literal>3.0 (quilt)</literal> est assez robuste pour ne pas casser même avec ces paquets. Vous pourriez avoir besoin de mettre à jour le contenu fourni en amont pour votre paquet Debian.
it: Se i sorgenti originali forniscono la directory <filename>debian</filename> e il suo contenuto, si deve eseguire il comando <command>dh_make</command> con l'opzione <literal>--addmissing</literal>. Il nuovo formato dei sorgenti <literal>3.0 (quilt)</literal> è abbastanza maturo da non danneggiare questi pacchetti. Potrebbe essere necessario aggiornare i contenuti forniti nei sorgenti originali per il pacchetto debian.

source: Of course, replace the filename with the name of your original source archive. <placeholder type="footnote" id="0"/> See <citerefentry> <refentrytitle>dh_make</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> for details.
ca: Caldrà canviar el nom del fitxer amb el codi font <placeholder type="footnote" id="0"/>. Consulta <citerefentry> <refentrytitle>dh_make</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> per a una descripció més detallada.
es: Deberás cambiar el nombre del archivo por el correspondiente a tus fuentes <placeholder type="footnote" id="0"/>. Véase <citerefentry> <refentrytitle>dh_make</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> para una descripción más detallada.
fr: Bien sûr, remplacez le nom de fichier par celui de votre archive source d'origine. <placeholder type="footnote" id="0"/> Voir <citerefentry> <refentrytitle>dh_make</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> pour plus de détails.
it: Ovviamente, si deve sostituire il nome del file con il nome dell'archivio dei sorgenti originali. <placeholder type="footnote" id="0"/> Vedere <citerefentry> <refentrytitle>dh_make</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> per i dettagli.
ja: 当然ですが、ファイル名はあなたのオリジナルのソースアーカイブの名前と置き換えてください。<placeholder type="footnote" id="0"/> 詳細は、<citerefentry> <refentrytitle>dh_make</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> を参照してください。

source: There are few choices here: <literal>s</literal> for Single binary, <literal>i</literal> for Arch-Independent, <literal>m</literal> for Multiple binary, <literal>l</literal> for Library, <literal>k</literal> for Kernel module, <literal>n</literal> for Kernel patch and <literal>b</literal> for <systemitem role="package">cdbs</systemitem>. This document focuses on the use of the <systemitem role="package">debhelper</systemitem> package with the <command>dh</command> command. This document focuses on the use of the new <command>dh</command> command for Single binary and touches on it for Arch-Independent and Multiple binary. The <systemitem role="package">cdbs</systemitem> package offers alternative package script infrastructure to the <command>dh</command> command and outside of the scope of this document.
fr: Il y a peu de choix à ce moment : « <literal>s</literal> » pour « binaire simple », « <literal>i</literal> » pour « binaire indépendant de l'architecture », « <literal>m</literal> » pour « binaires multiples », « <literal>l</literal> » pour « bibliothèque », « <literal>k</literal> » pour « module de noyau », « <literal>n</literal> » pour « correctif de noyau » et « <literal>b</literal> » pour « <systemitem role="package">cdbs</systemitem> ». Ce document se concentre sur l'utilisation du paquet <systemitem role="package">debhelper</systemitem> avec la commande <command>dh</command>. Ce document se concentre sur l'utilisation de la nouvelle commande <command>dh</command> pour un « binaire simple » et l'effleure pour un « binaire indépendant de l'architecture » et un « binaire multiple ». Le paquet <systemitem role="package">cdbs</systemitem> propose une autre infrastructure de scripts de paquets que la commande <command>dh</command> et sort du cadre de ce document.
it: Ecco le varie opzioni: <literal>s</literal> che sta per binario Singolo, <literal>i</literal> per Indipendente dall'architettura, <literal>m</literal> per binario Multiplo, <literal>l</literal> per Libreria, <literal>k</literal> per modulo del Kernel, <literal>n</literal> per patch del kernel e <literal>b</literal> per <systemitem role="package">cdbs</systemitem>. Questo documento si focalizza sull'uso del pacchetto <systemitem role="package">debhelper</systemitem> con il comando <command>dh</command>. Verrà trattato l'utilizzo del nuovo programma <command>dh</command> per i binari Singoli e tratta brevemente quelli Indipendenti dall'architettura e i binari Multipli. Il pacchetto <systemitem role="package">cdbs</systemitem> offre un'infrastruttura di script alternativa al comando <command>dh</command> e non rientra nell'ambito di questo documento.
