Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: <filename>cron.daily</filename> - Installed as <filename>/etc/cron.daily/<replaceable>package</replaceable></filename>: run once a day, usually early morning.
ca: <filename>cron.daily</filename> - instal·lats com <filename>/etc/cron.daily/<replaceable>nom_paquet</replaceable></filename>: s'executen cada dia, habitualment a primera hora del matí.
es: <filename>cron.daily</filename> - instalados como <filename>/etc/cron.daily/<replaceable>nombre_del_paquete</replaceable></filename>: se ejecutan cada día, habitualmente por la mañana temprano.
fr: <filename>cron.daily</filename> — installé comme <filename>/etc/cron.daily/<replaceable>paquet</replaceable></filename> : exécuté une fois par jour, normalement tôt le matin ;
it: <filename>cron.daily</filename> - Installato as <filename>/etc/cron.daily/<replaceable>pacchetto</replaceable></filename>: viene eseguito una volta al giorno, di solito ogni mattino.
ja: <filename>cron.daily</filename> - <filename>/etc/cron.daily/<replaceable>package</replaceable></filename>としてインストール: 1日に1度実行。普通は早朝に実行する。

source: <filename>cron.weekly</filename> - Installed as <filename>/etc/cron.weekly/<replaceable>package</replaceable></filename>: run once a week, usually early Sunday morning.
ca: <filename>cron.weekly</filename> - instal·lats com <filename>/etc/cron.weekly/<replaceable>nom_paquet</replaceable></filename>: s'executen cada setmana, habitualment ﻿en el matí del diumenge.
es: <filename>cron.weekly</filename> - instalados como <filename>/etc/cron.weekly/<replaceable>nombre_del_paquete</replaceable></filename>: se ejecutan cada semana, habitualmente en la mañana del domingo.
fr: <filename>cron.weekly</filename> — installé comme <filename>/etc/cron.weekly/<replaceable>paquet</replaceable></filename> : exécuté une fois par semaine, normalement tôt le dimanche matin ;
it: <filename>cron.weekly</filename> - Installato come <filename>/etc/cron.weekly/<replaceable>pacchetto</replaceable></filename>: viene eseguito una volta a settimana, di solito ogni mattino di Domenica.
ja: <filename>cron.weekly</filename> - <filename>/etc/cron.weekly/<replaceable>package</replaceable></filename>としてインストール: 1週間に1度実行。普通は日曜の早朝に実行する。

source: <filename>cron.monthly</filename> - Installed as <filename>/etc/cron.monthly/<replaceable>package</replaceable></filename>: run once a month, usually early morning on the first of the month.
ca: <filename>cron.monthly</filename> - instal·lats com <filename>/etc/cron.monthly/<replaceable>nom_paquet</replaceable></filename>: s'executen cada mes, habitualment ﻿en el matí del primer dia del mes.
es: <filename>cron.monthly</filename> - instalados como <filename>/etc/cron.monthly/<replaceable>nombre_del_paquete</replaceable></filename>: se ejecutan cada mes, habitualmente por la mañana del primer día del mes.
fr: <filename>cron.monthly</filename> — installé comme <filename>/etc/cron.monthly/<replaceable>paquet</replaceable></filename> : exécuté une fois par mois, normalement tôt le matin du premier du mois ;
it: <filename>cron.monthly</filename> - Installato come <filename>/etc/cron.monthly/<replaceable>pacchetto</replaceable></filename>: viene eseguito una volta al mese, di solito ogni mattino del primo del mese.
ja: <filename>cron.monthly</filename> - <filename>/etc/cron.monthly/<replaceable>package</replaceable></filename>としてインストール: 1ヶ月に1度実行。普通は1日の早朝に実行する。

source: <filename>cron.d</filename> - Installed as <filename>/etc/cron.d/<replaceable>package</replaceable></filename>: for any other time
ca: <filename>cron.d</filename> - instal·lats com <filename>/etc/cron.d/<replaceable>nom_paquet</replaceable></filename>: per a qualsevol altre període de temps.
es: <filename>cron.d</filename> - instalados como <filename>/etc/cron.d/<replaceable>package</replaceable></filename>: para cualquier otro período de tiempo.
fr: <filename>cron.d</filename> — installé comme <filename>/etc/cron.d/<replaceable>paquet</replaceable></filename> : exécuté à tout autre moment ;
it: <filename>cron.d</filename> - Installato come <filename>/etc/cron.d/<replaceable>pacchetto</replaceable></filename>: per qualsiasi altro periodo
ja: <filename>cron.d</filename> - <filename>/etc/cron.d/<replaceable>package</replaceable></filename>としてインストール: 上記以外のどの時間でも指定可能。

source: For the named files, the format of them is the shell script. The different one is <filename><replaceable>package</replaceable>.cron.d</filename> which follows the format of <citerefentry> <refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
ca: Els fitxers tenen el format de guions shell. Amb l'excepció dels fitxers <filename><replaceable>nom_paquet</replaceable>.cron.d</filename> que s'ajustaran al format descrit a <citerefentry> <refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
es: Para los archivos mencionados, su formato es el de guiones shell. La única excepción son los archivos <filename><replaceable>nombre_del_paquete</replaceable>.cron.d</filename> que deben ajustarse al formato descrito en <citerefentry> <refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
fr: Ces fichiers sont des scripts shell, à l'exception de <filename><replaceable>paquet</replaceable>.cron.d</filename> dont le format est celui de <citerefentry> <refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
it: Il formato dei file qui presentati è lo script di shell. L'unico che differisce dagli altri è <filename><replaceable>pacchetto</replaceable>.cron.d</filename> che segue il formato di <citerefentry> <refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
ja: 上記のファイルの書式はシェルスクリプトです。<filename><replaceable>package</replaceable>.cron.d</filename>は違い、<citerefentry> <refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>の書式になります。

source: Note that this doesn't include log rotation; for that, see <citerefentry> <refentrytitle>dh_installlogrotate</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> and <citerefentry> <refentrytitle>logrotate</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>.
ca: Això no inclou la rotació de fitxers de registre, per aquest cas consulta <citerefentry> <refentrytitle>dh_installlogrotate</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> i <citerefentry> <refentrytitle>logrotate</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. Elimina aquest arxiu si no s'ha de fer servir amb el teu paquet.
es: Ten en cuenta que ésto no incluye la rotación de archivos de registro, para hacer eso consulta <citerefentry> <refentrytitle>dh_installlogrotate</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> y <citerefentry> <refentrytitle>logrotate</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. Elimina el fichero si el paquete no utiliza dichas tareas.
fr: Ceci n'inclut pas la rotation des journaux ; pour cela, voyez <citerefentry> <refentrytitle>dh_installlogrotate</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> et <citerefentry> <refentrytitle>logrotate</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>.
it: Si noti che qui non è stata illustrata la rotazione dei log; a questo proposito si veda <citerefentry> <refentrytitle>dh_installlogrotate</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> e <citerefentry> <refentrytitle>logrotate</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>.
ja: ここではログのローテーションは扱いません。ログローテーションについては<citerefentry> <refentrytitle>dh_installlogrotate</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> および <citerefentry> <refentrytitle>logrotate</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>を参照してください。

source: <filename>dirs</filename> file
ca: Fitxer <filename>dirs</filename>.
es: Archivo <filename>dirs</filename>
fr: Fichier <filename>dirs</filename>
it: Il file <filename>dirs</filename>
ja: <filename>dirs</filename>ファイル

source: This file specifies the directories which we need but the normal installation procedure (<literal>make install DESTDIR=...</literal> invoked by <literal>dh_auto_install</literal>) somehow doesn't create. This generally means there is a problem with the <filename>Makefile</filename>.
ca: Aquest arxiu especifica els directoris necessaris però que per alguna raó no s'han creat en el procés d'instal·lació normal (<literal>make install DESTDIR=...</literal> executat per <literal>dh_auto_install</literal>). Generalment això és degut a un problema en el fitxer <filename>Makefile</filename>.
es: Este fichero especifica los directorios que se necesitan pero que por alguna razón no se crean en un proceso de instalación normal (<literal>make install DESTDIR=...</literal> invocado por <literal>dh_auto_install</literal>). Generalmente es debido a un problema con el archivo <filename>Makefile</filename>.
fr: Ce fichier indique les répertoires nécessaires mais que la procédure d'installation normale (« <literal>make install DESTDIR=...</literal> » invoquée par « <literal>dh_auto_install</literal> ») ne crée pas. C'est souvent dû à un problème avec le <filename>Makefile</filename>.
it: Questo file specifica le directory di cui si ha bisogno ma che la normale procedura di installazione (<literal>make install DESTDIR=...</literal> chiamata da <literal>dh_auto_install</literal>) non crea. Questo generalmente indica la presenza di un problema nel <filename>Makefile</filename>.
ja: このファイルにはパッケージが必要としているのに、なぜか通常のインストール手順(<literal>dh_auto_install</literal>によって呼び出される<literal>make install DESTDIR=...</literal>)では作成されないディレクトリを指定します。通常、これは<filename>Makefile</filename>に問題があることを示唆しています。

source: Files listed in the <filename>install</filename> file doesn't need the directories created first. See <xref linkend="install"/> .
ca: Els fitxers llistats en el fitxer <filename>install</filename> no requereixen la creació prèvia dels directoris. Consulta <xref linkend="install"/> .
es: Los archivos listados en el archivo <filename>install</filename> no requieren la construcción previa de los directorios. Véase <xref linkend="install"/> .
fr: Les fichiers énumérés dans le fichier <filename>install</filename> n'ont pas besoin que les répertoires soient créés avant, cf. <xref linkend="install"/> .

source: It is best to first try to run the installation first and only use this if you run into trouble. There is no preceding slash on the directory names.
es: Es recomendable ejecutar en primer lugar la instalación y solo hacer uso de este archivo si se produce algún problema. No debe ponerse la barra inicial en los nombres de los directorios.
fr: Il est préférable d'essayer d'exécuter d'abord l'installation, et d'utiliser seulement ce recours si vous avez des problèmes. Il n'y a pas de barre oblique (« / ») au début des noms de répertoire.

source: <filename><replaceable>package</replaceable>.doc-base</filename> file
ca: Fitxer <filename><replaceable>nom_paquet</replaceable>.doc-base</filename>.
es: Archivo <filename><replaceable>nombre_del_paquete</replaceable>.doc-base</filename>
fr: Fichier <filename><replaceable>paquet</replaceable>.doc-base</filename>
it: Il file <filename><replaceable>pacchetto</replaceable>.doc-base</filename>
ja: <filename><replaceable>package</replaceable>.doc-base</filename> ファイル

source: If your package has documentation other than manual pages and info docs, you should use the <systemitem role="package">doc-base</systemitem> file to register it, so the user can find it with e.g. <citerefentry> <refentrytitle>dhelp</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>dwww</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> or <citerefentry> <refentrytitle>doccentral</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ca: Si el teu paquet té documentació a més de les pàgines de manual i d'informació, pots fer servir el fitxer <systemitem role="package">doc-base</systemitem> per a registrar-la i així l'usuari la trobarà més fàcilment amb <citerefentry> <refentrytitle>dhelp</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>dwww</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> o <citerefentry> <refentrytitle>doccentral</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
es: Si tu paquete tiene documentación además de las páginas de manual y de información, puedes utilizar el archivo <systemitem role="package">doc-base</systemitem> para registrarla de modo que el usuario pueda encontrar esta documentación suplementaria con <citerefentry> <refentrytitle>dhelp</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>dwww</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> o <citerefentry> <refentrytitle>doccentral</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
fr: Si votre paquet est fournit avec une autre documentation que des pages de manuel et des documents info, vous devriez utiliser le fichier <systemitem role="package">doc-base</systemitem> pour l'enregistrer, de sorte que l'utilisateur puisse la trouver avec par exemple <citerefentry> <refentrytitle>dhelp</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>dwww</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> ou <citerefentry> <refentrytitle>doccentral</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
it: Se il pacchetto generato ha altra documentazione oltre alle pagine del manuale e documenti informativi, dovrebbe essere utilizzato il file <systemitem role="package">doc-base</systemitem> per segnalarla in modo che l'utente possa trovarla con, ad esempio <citerefentry> <refentrytitle>dhelp</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>dwww</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> o <citerefentry> <refentrytitle>doccentral</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ja: もしあなたのパッケージがマニュアルページや info 形式の文書以外に付属文書を含む場合、 <systemitem role="package">doc-base</systemitem> ファイルを使ってそれらを登録し、ユーザがそれらの付属文書を、例えば<citerefentry> <refentrytitle>dhelp</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> や <citerefentry> <refentrytitle>dwww</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>、あるいは <citerefentry> <refentrytitle>doccentral</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>コマンドなどで参照できるようにしましょう。

source: This is how <systemitem role="package">gentoo</systemitem>'s doc-base file <filename>gentoo.doc-base</filename> looks like:
ca: Aquest és el contingut del fitxer <filename>gentoo.doc-base</filename> de <systemitem role="package">gentoo</systemitem>:
es: A continuación se muestra cómo es el fichero doc-base de <systemitem role="package">gentoo</systemitem>, <filename>gentoo.doc-base</filename>:
fr: Voici ce à quoi le fichier <filename>gentoo.doc-base</filename> de <systemitem role="package">gentoo</systemitem> ressemble :
it: Questo è il modo in cui il file doc-base di <systemitem role="package">gentoo</systemitem>, <filename>gentoo.doc-base</filename>, appare:
ja: 例えば、<systemitem role="package">gentoo</systemitem>の<filename>gentoo.doc-base</filename>ファイルは次のようになります:

source: For information on the file format, see <citerefentry> <refentrytitle>install-docs</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> and the <systemitem role="package">doc-base</systemitem> manual, in <filename>/usr/share/doc/doc-base/doc-base.html/</filename>.
es: Para más información sobre el formato del archivo véase <citerefentry> <refentrytitle>install-docs</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> y el manual <systemitem role="package">doc-base</systemitem>, en <filename>/usr/share/doc/doc-base/doc-base.html/</filename>.
fr: Pour plus d'informations sur le format de ce fichier, voir <citerefentry> <refentrytitle>install-docs</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> et le manuel de <systemitem role="package">doc-base</systemitem>, en <filename>/usr/share/doc/doc-base/doc-base.html/index.html</filename>.

source: For more details on installing additional documentation, look in <xref linkend="destdir"/> .
ca: Per a més detalls sobre la instal·lació de documentació addicional, consulta <xref linkend="destdir"/> .
es: Para más detalles sobre la instalación de documentación adicional, lee <xref linkend="destdir"/> .
fr: Pour plus d'informations sur l'installation de documentation supplémentaire, voir <xref linkend="destdir"/> .

source: <filename>docs</filename> file
ca: Fitxer <filename>docs</filename>.
es: Archivo <filename>docs</filename>
fr: Fichier <filename>docs</filename>
it: Il file <filename>docs</filename>
ja: <filename>docs</filename>ファイル

source: This file specifies the file names of documentation files we can have <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> install into the temporary directory for us.
ca: Aquest arxiu especifica els noms dels fitxers de documentació que <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> instal·larà en el directori temporal.
es: Este fichero especifica los nombres de los ficheros de documentación que <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> instalará en el directorio temporal.
fr: Ce fichier spécifie les noms des fichiers de documentation que <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> peut installer pour vous dans le répertoire temporaire.
it: Questo file specifica il nome dei file di documentazione che si possono avere <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> li installa nella directory temporanea automaticamente.
ja: このファイルには、<citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>を使ってパッケージ生成用の一時的なディレクトリにインストールするために、パッケージに付属する資料のファイル名を指定してください。

source: By default, it will include all existing files in the top-level source directory that are called <filename>BUGS</filename>, <filename>README*</filename>, <filename>TODO</filename> etc.
ca: L'opció predeterminada inclourà tots els fitxers existents en els directoris del nivell més alt del codi amb els noms <filename>BUGS</filename>, <filename>README*</filename>, <filename>TODO</filename> etc.
es: Por omisión, se incluirán todos los archivos existentes en los directorios de más alto nivel del código que con los nombres <filename>BUGS</filename>, <filename>README*</filename>, <filename>TODO</filename> etc.
fr: Par défaut, il inclut tous les fichiers, existant dans le répertoire racine des sources, qui sont nommés « <filename>BUGS</filename> », « <filename>README*</filename> », « <filename>TODO</filename> », etc.
it: Normalmente, questo file includerà tutti i file esistenti nella directory dei sorgenti di più alto livello che sono chiamati <filename>BUGS</filename>, <filename>README*</filename>, <filename>TODO</filename> ecc.
ja: デフォルトでは、ソースディレクトリのトップレベルに存在する <filename>BUGS</filename>、 <filename>README*</filename>、 <filename>TODO</filename> などの名前を持つファイル全てを含みます。

source: For <systemitem role="package">gentoo</systemitem>, I also included some other files:
ca: També n'inclouré alguns d'altres per a <systemitem role="package">gentoo</systemitem>:
es: También incluiré algunos otros para <systemitem role="package">gentoo</systemitem>:
fr: Pour<systemitem role="package">gentoo</systemitem>, sont aussi inclus :
it: Per il pacchetto <systemitem role="package">gentoo</systemitem>, nell'esempio, sono stati inclusi anche altri files:
ja: では、<systemitem role="package">gentoo</systemitem>に付属文書をいくつか指定してみましょう。

source: <filename>emacsen-*</filename> file
ca: Fitxer <filename>emacsen-*</filename>.
es: Archivo <filename>emacsen-*</filename>
fr: Fichier <filename>emacsen-*</filename>
it: Il file <filename>emacsen-*</filename>
ja: <filename>emacsen-*</filename> ファイル

source: If your package supplies Emacs files that can be bytecompiled at package installation time, you can use these files to set it up.
ca: Si el teu paquet proporciona fitxers Emacs que es poden compilar a bytes en el moment de la instal·lació, pots fer servir aquests fitxers.
es: Si tu paquete proporciona ficheros Emacs que pueden ser compilados a bytes («bytescompile») en el momento de la instalación, puedes usar estos ficheros.
fr: Si votre paquet fournit des fichiers Emacs qui peuvent être byte-compilés au moment de l'installation, vous pouvez utiliser ces fichiers pour les configurer.
it: Se il pacchetto generato contiene file Emacs che possono essere compilati al momento dell'installazione, i file emacsen-* possono essere usati per impostarne la compilazione
ja: パッケージをインストールする際にバイトコンパイル可能な Emacs ファイルがあなたのパッケージに含まれている場合、これらの emacsen-* ファイルを利用してそれを設定することができます。

source: They are installed into the temporary directory by <citerefentry> <refentrytitle>dh_installemacsen</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ca: Aquests fitxers seran instal·lats en el directori temporal per <citerefentry> <refentrytitle>dh_installemacsen</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
es: El programa <citerefentry> <refentrytitle>dh_installemacsen</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> instalará estos archivos en el directorio temporal .
fr: Ils sont installés dans le répertoire temporaire par <citerefentry> <refentrytitle>dh_installemacsen</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
it: Tali file sono installati nella directory temporanea con <citerefentry> <refentrytitle>dh_installemacsen</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ja: これらのファイルは<citerefentry> <refentrytitle>dh_installemacsen</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>によってパッケージ作成用の一時的なディレクトリにインストールされます。

source: If you don't need these, remove them.
ca: ﻿Elimina'ls si no els necessites.
es: Elimínalos si no los necesitas.
fr: Si vous n'en avez pas besoin, effacez-les.
it: Se non se ne ha bisogno, possono essere eliminati.
ja: 不要ならこのファイルを削除してください。

source: <filename><replaceable>package</replaceable>.examples</filename> file
ca: Fitxer <filename><replaceable>nom_paquet</replaceable>.examples</filename>.
es: Archivo <filename><replaceable>nombre_del_paquete</replaceable>.examples</filename>
fr: Fichier <filename><replaceable>paquet</replaceable>.examples</filename>
it: <filename>Il file <replaceable>pacchetto</replaceable>.examples</filename>
ja: <filename><replaceable>package</replaceable>.examples</filename>ファイル

source: The <citerefentry> <refentrytitle>dh_installexamples</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> command installs files and directories listed in this file as example files.
ca: L'ordre <citerefentry> <refentrytitle>dh_installexamples</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> instal·la els fitxers i directoris llistats en aquest arxiu com a fitxers d'exemple.
es: La orden <citerefentry> <refentrytitle>dh_installexamples</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> instala los archivos y directorios listados en este archivo como archivos de ejemplos.
fr: La commande <citerefentry> <refentrytitle>dh_installexamples</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> installe les fichiers et répertoires énumérés ici comme des fichiers d'exemple.
it: Il comando <citerefentry> <refentrytitle>dh_installexamples</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> installa i file e le directory elencati al suo interno come file di esempio.
ja: <citerefentry> <refentrytitle>dh_installexamples</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>コマンドはこのディレクトリに列挙されたファイルを例としてインストールします。
