Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: Of course, these things are just safety measures, and intended to save you from raging users if you do something wrong in some setuid daemon... When you gain some more experience in packaging, you'll be able to do such packages, but even the experienced developers consult the <ulink url="&debian-mentors-ldo;">debian-mentors@lists.debian.org</ulink> mailing list when they are in doubt. And people there will gladly help.
fr: Bien sûr, toutes ces remarques ne sont que des mesures de sécurité, et ont pour but de vous préserver d'utilisateurs fous de rage si vous faites une erreur dans un démon setuid... Quand vous aurez plus d'expérience dans la création de paquets, vous pourrez faire de tels paquets, mais même les développeurs les plus expérimentés consultent la liste de discussion <ulink url="&debian-mentors-ldo;">debian-mentors@lists.debian.org</ulink> en cas de doute. Les personnes présentes seront heureuses de vous aider.

source: For more help about these, check in <ulink url="&developers-reference;">Debian Developer's Reference</ulink>.
fr: Pour plus d'informations à ce sujet, consultez la <ulink url="&developers-reference;">référence du Développeur Debian</ulink>.

source: Get the program, and try it out
ca: ﻿Aconsegueix el programa i prova'l.
es: Obtén el programa y pruébalo
fr: Obtenir le programme, et l'essayer
it: Prendere il programma e provarlo
ja: プログラムの入手と検証

source: So the first thing to do is to find and download the original source code. I presume that you already have the source file that you picked up at the author's homepage. Sources for free Unix programs usually come in <command>tar</command>+<command>gzip</command> format with extension <filename>.tar.gz</filename>, or <command>tar</command>+<command>bzip2</command> format with extension <filename>.tar.bz2</filename>. These usually contain the subdirectory called <filename><replaceable>programname</replaceable>-<replaceable>version</replaceable></filename> in them and all the sources under it.
ca: La primera passa és trobar i descarregar el codi font original del programa. Les fonts dels programes lliures de GNU/Linux és habitual que es distribueixin en fitxers amb format <command>tar</command>+<command>gzip</command>, amb extensió <filename>.tar.gz</filename> o amb format <command>tar</command>+<command>bzip2</command> amb extensió <filename>.tar.bz2</filename>, i generalment tenen un directori amb el nom <filename><replaceable>programa</replaceable>-<replaceable>versió</replaceable></filename> amb tots els fitxers del codi font.
es: Lo primero que debes hacer es encontrar y descargar el código fuente original. A partir de este punto se da por supuesto que ya tienes el código fuente que obtuviste de la página del autor. Las fuentes de los programas libres de Unix (y GNU/Linux) generalmente vienen en formato <command>tar</command>+<command>gzip</command>, con extensión <filename>.tar.gz</filename> o en formato <command>tar</command>+<command>bzip2</command> con extensión <filename>.tar.bz2</filename>, y generalmente contienen un subdirectorio llamado <filename><replaceable>programa</replaceable>-<replaceable>versión</replaceable></filename> con todas las fuentes en él.
fr: La première chose à faire est de trouver et télécharger le code source d'origine. Supposons que vous ayez déjà le fichier source pris sur la page web de l'auteur. Les sources pour les logiciels Unix libres sont d'habitude distribués au format <command>tar</command>+<command>gzip</command> avec l'extension <filename>.tar.gz</filename>, ou au format <command>tar</command>+<command>bzip2</command> avec l'extension <filename>.tar.bz2</filename>. Elles contiennent normalement un sous-répertoire nommé <filename><replaceable>nom_du_programme</replaceable>-<replaceable>version</replaceable></filename> avec toutes les sources dedans.
it: La prima cosa da fare è trovare e scaricare il codice sorgente del programma. Supponendo che si è recuperato il file dal sito web dell'autore. Generalmente il codice sorgente di programmi liberi per Unix e derivati sono in formato <command>tar</command>+<command>gzip</command> con estensione <filename>.tar.gz</filename>, oppure in formato <command>tar</command>+<command>bzip2</command> con estensione <filename>.tar.bz2</filename>. Di solito, questi file, contengono la sottodirectory dal nome <filename><replaceable>programma</replaceable>-<replaceable>versione</replaceable></filename> con tutti i sorgenti.

source: If the latest version of such sources are available through VCS such as Git, Subversion, or CVS repository, you need to get it with <literal>git clone</literal>, <literal>cvs co</literal>, or <literal>svn co</literal> and repack it into <command>tar</command>+<command>gzip</command> format by yourself using the <literal>--exclude-vcs</literal> option.
es: Si la última versión del código fuente se puede obtener de un sistema VCS del tipo Git, Subversion o un repositorio CVS, puedes descargarlo ejecutando «<literal>git clone</literal>», «<literal>cvs co</literal>» o «<literal>svn co</literal>» y, a continuación comprimiéndolo en un archivo con formato <command>tar</command>+<command>gzip</command> ejecutando la opción «<literal>--exclude-vcs</literal>».
fr: Si la dernière version des sources est disponible dans un dépôt de gestion de version tel que Git, Subversion ou CVS, vous devez la prendre avec « <literal>git clone</literal> », « <literal>cvs co</literal> », ou « <literal>svn co</literal> » et la compresser vous-même au format <command>tar</command>+<command>gzip</command> avec l'option « <literal>--exclude-vcs</literal> ».

source: You can identify the archive format using the <command>file</command> command when the file extension is not enough.
ca: Pots identificar el format de l'arxius fent servir l'ordre <command>file</command>.
es: Puedes identificar el formato de archivo utilizando la herramienta <command>file</command> cuando no es suficiente con la extensión de fichero.
fr: Vous pouvez identifier le format de l'archive en utilisant la commande <command>file</command> si l'extension du fichier ne suffit pas.
it: si può utilizzare il comando <command>file</command> per scoprire il formato di archiviazione
ja: ファイルの拡張子で足りなければ、<command>file</command> コマンドを使ってアーカイブ形式を判別することができます。

source: If your program's source comes as some other sort of archive (for instance, the filename ends in <filename>.Z</filename> or <filename>.zip</filename><placeholder type="footnote" id="0"/>), unpack it with appropriate tools and repack it, too.
ca: Si el programa està disponible en una altre format (pot ésser un arxiu acabat en <filename>.Z</filename> o <filename>.zip</filename><placeholder type="footnote" id="0"/>), ho descomprimeixes amb l'eina adequada i el tornes a empaquetar adequadament.
es: Si tu programa viene en otro tipo de archivo (por ejemplo, el fichero termina en <filename>.Z</filename> o <filename>.zip</filename><placeholder type="footnote" id="0"/>), descomprímelo con las herramientas adecuadas y reempaquétalo de nuevo.
fr: Si les sources du programme sont disponibles dans un autre format d'archive (par exemple, le programme se termine par <filename>.Z</filename> ou <filename>.zip</filename> <placeholder type="footnote" id="0"/>), décompressez-le avec les outils adéquats et compressez-le de nouveau.
it: Se il codice sorgente è in qualche altro formato di archiviazione (per esempio, con estensione <filename>.Z</filename> o <filename>.zip</filename><placeholder type="footnote" id="0"/>), scompattarlo con i programmi appropriati, e comprimerlo di nuovo.

source: This program is already packaged. Current version 0.15.3 has changed substantially from the version 0.9.12 in the following examples.
es: Ten en cuenta que el programa ya ha sido empaquetado previamente. La versión actual 0.19.8 ha cambiado sustancialmente de la versión 0.9.12 que se utiliza en los ejemplos mostrados a continuación.
fr: Ce programme est déjà empaqueté. La version actuelle 0.15.3 a changé substantiellement depuis la version 0.9.12 des exemples suivants.

source: As an example, I'll use a program called <command>gentoo</command>, an X GTK+ file manager.<placeholder type="footnote" id="0"/>
es: Como ejemplo, usaré el programa conocido como <command>gentoo</command>, un gestor de ficheros de X11 en GTK+<placeholder type="footnote" id="0"/>.
fr: Comme exemple, le programme nommé <command>gentoo</command> (un gestionnaire de fichiers pour X utilisant GTK+) sera utilisé. <placeholder type="footnote" id="0"/>

source: Create a subdirectory under your home directory named <filename>debian</filename> or <filename>deb</filename> or anything you find appropriate (e.g. just <filename>~/gentoo</filename> would do fine in this case). Place the downloaded archive in it, and extract it (with <literal>tar xzf gentoo-0.9.12.tar.gz</literal>). Make sure there are no errors, even some <emphasis>irrelevant</emphasis> ones, because there will most probably be problems unpacking on other people's systems, whose unpacking tools may or may not ignore those anomalies. On your console screen, you should see the following.
ca: Fes un nou directori al teu directori d'usuari amb el nom <filename>debian</filename> o <filename>deb</filename> o el que trobis més adequat (p.e. <filename>~/gentoo/</filename> és molt adequat). Copia en aquest nou directori el fitxer del codi font i extreu el seu contingut executant <literal>tar xzf gentoo-0.9.12.tar.gz</literal>. Comprova que no hi ha hagut errors, fins i tot els més <emphasis>irrellevants</emphasis>, degut a què és possible que hi hagi errors en desempaquetar-ho en sistemes d'altres persones que no ignorin aquestes errades. En el terminal hauràs fet el següent:
es: Crea un subdirectorio bajo tu directorio personal llamado <filename>debian</filename> o <filename>deb</filename> o lo que creas apropiado (por ejemplo <filename>~/gentoo/</filename> estaría bien en este caso). Mueve a él el archivo que has descargado, y descomprímelo de la siguiente forma: <literal>tar xzf gentoo-0.9.12.tar.gz</literal>. Asegúrate de que no hay errores, incluso errores <emphasis>irrelevantes</emphasis>, porque es muy probable que haya problemas al desempaquetarlo en sistemas de otras personas, cuyas herramientas de desempaquetado puede que no ignoren estas anomalías. En el terminal de órdenes, debería ver el mensaje mostrado a continuación.
fr: Créez un sous-répertoire dans votre répertoire personnel nommé <filename>debian</filename> ou <filename>deb</filename> ou quoi que ce soit d'adéquat (par exemple le nom du programme, <filename>~/gentoo</filename>, ferait l'affaire dans ce cas). Placez l'archive téléchargée dedans, et décompressez-la avec « <literal>tar xzf gentoo-0.9.12.tar.gz</literal> ». Assurez-vous qu'aucune erreur ne se produit, même <emphasis>sans importance</emphasis>, sinon des problèmes surviendront sans doute lors de la décompression sur les systèmes d'autres personnes, dont les outils pourraient ne pas gérer ces erreurs. Sur la console, vous devriez voir ce qui suit :
it: È buona regola creare una sottodirectory nella directory home e nominarla <filename>debian</filename> o <filename>deb</filename> o qualsiasi altro nome appropriato (ad es. in questo caso <filename>~/gentoo</filename> andrebbe più che bene). Scaricare l'archivio e scompattarlo (con il comando <literal>tar xzf gentoo-0.9.12.tar.gz</literal>). Bisogna assicurarsi che non ci siano errori, per quanto in apparenza <emphasis>irrilevanti</emphasis>, perché potrebbero causare problemi nell'estrazione dell'archivio sul sistema di altre persone, alcuni strumenti di estrazione a volte ignorano queste anomalie. Nella console dovrebbe esserci quanto segue.

source: Now you have another subdirectory, called <filename>gentoo-0.9.12</filename>. Change to that directory and <emphasis>thoroughly</emphasis> read the provided documentation. Usually there are files named <filename>README*</filename>, <filename>INSTALL*</filename>, <filename>*.lsm</filename> or <filename>*.html</filename>. You must find instructions on how to correctly compile and install the program (most probably they'll assume you want to install to <filename>/usr/local/bin</filename> directory; you won't be doing that, but more on that later in <xref linkend="destdir"/> ).
ca: Ara tens un nou directori amb el nom <filename>gentoo-0.9.12</filename>. Accedeix en aquest directori i llegeix <emphasis>atentament</emphasis> la documentació del programa, normalment en fitxers amb el nom <filename>README*</filename>, <filename>INSTALL*</filename>, <filename>*.lsm</filename> o <filename>*.html</filename>. Hi haurà instruccions per a la compilació i instal·lació del programa (probablement la instal·lació es farà a <filename>/usr/local/bin</filename>, però veurem a <xref linkend="destdir"/> que no és la destinació correcta).
fr: Maintenant vous avez un autre sous-répertoire, nommé <filename>gentoo-0.9.12</filename>. Allez dans ce répertoire et lisez <emphasis>attentivement</emphasis> la documentation fournie. Il s'agit généralement de fichiers nommés <filename>README*</filename>, <filename>INSTALL*</filename>, <filename>*.lsm</filename> ou <filename>*.html</filename>. Vous devez trouver les instructions pour compiler et installer correctement le programme (elles supposent très probablement que vous voulez l'installer dans le répertoire<filename>/usr/local/bin</filename> ; ce n'est pas le cas, mais ce point sera traité plus tard en <xref linkend="destdir"/> ).

source: Simple programs come with a <filename>Makefile</filename> file in them and can be compiled simply with <literal>make</literal>. Some of them support <literal>make check</literal>, which runs included self-checks. Installation to the destination directories is usually done with <literal>make install</literal>.
es: Los programa sencillos incluyen un fichero <filename>Makefile</filename> y pueden generalmente compilarse con «<literal>make</literal>. Algunos de ellos soportan <literal>make check</literal>, esta orden ejecuta las comprobaciones automáticas que estén definidas. Generalmente se instalarán en sus directorios de destino ejecutando <literal>make install</literal>.
fr: Des programmes simples sont fournis avec un fichier <filename>Makefile</filename> et peuvent être compilés simplement avec « <literal>make</literal> ». Certains d'entre eux gèrent « <literal>make check</literal> », qui exécute des vérifications internes. L'installation dans les répertoires de destination se fait normalement avec « <literal>make install</literal> ».

source: Now try to compile and run your program, to make sure it works properly and doesn't break something else while it's installing or running.
ca: Una vegada s'ha compilat el programa, prova'l i comprova que tot funciona correctament i que no es genera cap errada en el sistema en l'execució i/o instal·lació.
es: Ahora intenta compilar, y ejecutar el programa, para asegurarte que funciona bien y de que no genera ningún error en el sistema mientras está instalándose o ejecutándose.
fr: Maintenant, essayez de compiler et d'exécuter le programme, pour vous assurer qu'il fonctionne correctement et ne casse rien d'autre quand il est installé ou utilisé.
it: Adesso si provi a compilare ed eseguire il programma, assicurandosi che funzioni correttamente e che niente sia andato storto durante l'installazione o l'esecuzione.
ja: さあ、試しにプログラムをコンパイルし、実行してみましょう。 インストールや実行の際にちゃんと動作するかどうか、そして他の何かを壊してしまっていないかを確認してください。

source: Also, you can usually run <literal>make clean</literal> (or better <literal>make distclean</literal>) to clean up the build directory. Sometimes there's even a <literal>make uninstall</literal> which can be used to remove all the installed files.
ca: L'execució de l'ordre <literal>make clean</literal> (o <literal>make distclean</literal>) eliminarà del directori els fitxers generats per a la compilació i que són innecessaris. Habitualment, serà possible desinstal·lar el programa amb l'ordre <literal>make uninstall</literal>.
es: También, generalmente, puedes ejecutar <literal>make clean</literal> (o mejor <literal>make distclean</literal>) para limpiar el directorio donde se compila el programa. A veces hay incluso un <literal>make uninstall</literal> que se puede utilizar para borrar todos los archivos instalados.
fr: Sachez aussi que vous pouvez généralement utiliser « <literal>make clean</literal> » (ou mieux, « <literal>make distclean</literal> ») pour nettoyer le répertoire de compilation. Parfois, « <literal>make uninstall</literal> » peut être utilisé pour retirer tous les fichiers installés.
it: Di solito, per ripulire la directory di compilazione, si usa il comando <literal>make clean</literal> (o meglio ancora <literal>make distclean</literal>). Talvolta c'è anche il comando <literal>make uninstall</literal> che serve a rimuovere tutti i file installati.
ja: それから、たいていの場合は <literal>make clean</literal> ( <literal>make distclean</literal> を使えるならそのほうが良いです) を実行すると、ビルド用のディレクトリをきれいにしてくれます。さらに <literal>make uninstall</literal> を実行すると、インストールされたファイルをすべて削除できることさえもあります。

source: Free portable programs
ca: Programari lliure portable.
es: Programas libres portables
fr: Programmes libres portables
it: Programmi portabili liberi

source: A lot of Free programs are written in the <ulink url="&cxx;_(programming_language)">C</ulink> and <ulink url="&cxx;++">C++</ulink> languages. Many of these use Autotools or CMake to make them portable across different platforms. These tools are used to generate <filename>Makefile</filename> and other required source files. Then, such programs are built with usual <literal>make; make install</literal>.
fr: De nombreux programmes libres sont écrits en <ulink url="http://fr.wikipedia.org/wiki/C_(langage)">C</ulink> et <ulink url="http://fr.wikipedia.org/wiki/C++">C++</ulink>. Beaucoup d'entre-eux utilisent les Autotools ou CMake pour les rendre portables sur différentes architectures. Ces outils sont utilisés pour créer <filename>Makefile</filename> et d'autres fichiers sources nécessaires. Ensuite, de tels programmes sont construits avec l'habituel « <literal>make; make install</literal> ».

source: See <ulink url="&autotools-tutorial;">Autotools Tutorial</ulink> and <filename>/usr/share/doc/autotools-dev/README.Debian.gz</filename>.
fr: Voir le <ulink url="&autotools-tutorial;">tutoriel des Autotools</ulink> et <filename>/usr/share/doc/autotools-dev/README.Debian.gz</filename>.

source: <ulink url="&gnu-build-system;">Autotools</ulink> are the GNU build system comprising <ulink url="&autoconf;">Autoconf</ulink>, <ulink url="&automake;">Automake</ulink>, <ulink url="&libtool;">Libtool</ulink>, and <ulink url="&gettext;">gettext</ulink>. You can notice such sources by the <filename>configure.ac</filename>, <filename>Makefile.am</filename>, and <filename>Makefile.in</filename> files. <placeholder type="footnote" id="0"/>
ca: <ulink url="http://es.wikipedia.org/wiki/Autotools">Les «Autotools»</ulink> (en el moment de fer aquesta traducció, aquesta entrada no existeix a la Viquipèdia en català) són el sistema de compilació GNU i inclouen <ulink url="http://ca.wikipedia.org/wiki/GNU_Autoconf">Autoconf</ulink>, <ulink url="http://es.wikipedia.org/wiki/GNU_Automake">Automake</ulink>,<ulink url="http://es.wikipedia.org/wiki/GNU_Libtool">Libtool</ulink> i <ulink url="http://ca.wikipedia.org/wiki/Gettext">gettext</ulink>. Confirmaràs que el teu programa fa servir les «autotools» per la presència, a les fonts, dels fitxers <filename>configure.ac</filename>, <filename>Makefile.am</filename>, i <filename>Makefile.in</filename> <placeholder type="footnote" id="0"/>.
fr: Les <ulink url="http://fr.wikipedia.org/wiki/Autotools">Autotools</ulink> sont les outils de construction GNU, et comprennent <ulink url="http://fr.wikipedia.org/wiki/Autoconf">Autoconf</ulink>, <ulink url="http://fr.wikipedia.org/wiki/Automake">Automake</ulink>, <ulink url="http://fr.wikipedia.org/wiki/Libtool">Libtool</ulink> et <ulink url="http://fr.wikipedia.org/wiki/GNU_gettext">gettext</ulink>. Vous pouvez remarquer de telles sources à l'aide des fichiers <filename>configure.ac</filename>, <filename>Makefile.am</filename> et <filename>Makefile.in</filename>. <placeholder type="footnote" id="0"/>
it: <ulink url="&gnu-build-system;">Autotools</ulink> è il sistema di compilazione della GNU, che compendre <ulink url="&autoconf;">Autoconf</ulink>, <ulink url="&automake;">Automake</ulink>, <ulink url="&libtool;">Libtool</ulink>, e <ulink url="&gettext;">gettext</ulink>. Per capire meglio ciò che avviene, si possono leggere i seguenti file sorgenti: <filename>configure.ac</filename>, <filename>Makefile.am</filename>, e <filename>Makefile.in</filename>. <placeholder type="footnote" id="0"/>

source: The first step of Autotools work flow is usually that the upstream runs <literal>autoreconf -i -f</literal> in the source and distributes this source with generated files.
ca: La primera etapa en l'ús de les «Autotools» és l'execució de l'ordre (per l'autor del codi font) <literal>autoreconf -i -f</literal> amb la qual es generen, fent servir el fitxers font (a l'esquerra del diagrama) els fitxers (a la dreta del diagrama) que després farà servir l'ordre «configure» .
es: El primer paso en el uso de «Autotools» es la ejecución por parte del autor de la orden <literal>autoreconf -i -f</literal> la cual genera, a partir de los archivos fuente (a la izquierda del gráfico) los archivos que utilizará la orden «configure» (a la derecha del gráfico).
fr: La première étape du travail des Autotools est généralement que les auteurs amont exécutent « <literal>autoreconf -i -f</literal> » dans les sources avant de les distribuer avec les fichiers générés.
it: Il primo passo del processo di lavorazione degli Autotools consiste solitamente nell'esecuzione del comando <literal>autoreconf -i -f</literal> per i sorgenti che verranno successivamente distribuiti insieme ai file generati.

source: Editing <filename>configure.ac</filename> and <filename>Makefile.am</filename> files requires some knowledge of <command>autoconf</command> and <command>automake</command>. See <literal>info autoconf</literal> and <literal>info automake</literal>.
ca: Per a l'edició dels fitxers <filename>configure.ac</filename> i <filename>Makefile.am</filename> cal conèixer el funcionament de <command>autoconf</command> i <command>automake</command>. Consulta <literal>info autoconf</literal> i <literal>info automake</literal> (executant les ordres en el terminal).
es: La edición de los archivos <filename>configure.ac</filename> y <filename>Makefile.am</filename> requiere conocer el funcionamiento de <command>autoconf</command> y <command>automake</command>. Véase «<literal>info autoconf</literal>» y «<literal>info automake</literal>» (ejecutando las órdenes en el terminal).
fr: Modifier les fichiers <filename>configure.ac</filename> et <filename>Makefile.am</filename> nécessite un peu de connaissance de <command>autoconf</command> et <command>automake</command>. Voir « <literal>info autoconf</literal> » et « <literal>info automake</literal> ».
it: La modifica dei file <filename>configure.ac</filename> e <filename>Makefile.am</filename> richiede una minima conoscenza di <command>autoconf</command> e <command>automake</command>. Vedere<literal>info autoconf</literal> e <literal>info automake</literal>.
ja: <filename>configure.ac</filename> や <filename>Makefile.am</filename> ファイルを編集するには、<command>autoconf</command> と <command>automake</command> についての知識が少々必要になります。<literal>info autoconf</literal> と <literal>info automake</literal> を参照してください。
