Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: 1 Source: gentoo 2 Section: unknown 3 Priority: extra 4 Maintainer: Josip Rodin &lt;joy-mg@debian.org&gt; 5 Build-Depends: debhelper (&gt;= 7.0.50~) 6 Standards-Version: 3.8.4 7 Homepage: &lt;insert the upstream URL, if relevant&gt; 8 9 Package: gentoo 10 Architecture: any 11 Depends: ${shlibs:Depends}, ${misc:Depends} 12 Description: &lt;insert up to 60 chars description&gt; 13 &lt;insert long description, indented with spaces&gt;
ca: 1 Source: gentoo 2 Section: unknown 3 Priority: extra 4 Maintainer: Josip Rodin &lt;joy-mg@debian.org&gt; 5 Build-Depends: debhelper (&gt;= 7.0.50~) 6 Standards-Version: 3.8.4 7 Homepage: &lt;aquí l'URL de l'autor original &gt; 8 9 Package: gentoo 10 Architecture: any 11 Depends: ${shlibs:Depends}, ${misc:Depends} 12 Description: &lt;descripció de fins a 60 caràcters&gt; 13 &lt;descripció llarga, ﻿cada línia amb un espai inicial.&gt;
es: 1 Source: gentoo 2 Section: unknown 3 Priority: extra 4 Maintainer: Josip Rodin &lt;joy-mg@debian.org&gt; 5 Build-Depends: debhelper (&gt;= 7.0.50~) 6 Standards-Version: 3.8.4 7 Homepage: &lt;introduce aquí la URL del autor original &gt; 8 9 Package: gentoo 10 Architecture: any 11 Depends: ${shlibs:Depends}, ${misc:Depends} 12 Description: &lt;insertar hasta 60 caracteres de descripción&gt; 13 &lt;inserta una descripción larga, indentada con espacios.&gt;
fr: 1 Source: gentoo 2 Section: unknown 3 Priority: extra 4 Maintainer: Prénom Nom &lt;votre.adresse.mail@example.org&gt; 5 Build-Depends: debhelper (&gt;= 7.0.50~) 6 Standards-Version: 3.8.4 7 Homepage: &lt;URL amont, si pertinente&gt; 8 9 Package: gentoo 10 Architecture: any 11 Depends: ${shlibs:Depends}, ${misc:Depends} 12 Description: &lt;description courte de 60 caractères au maximum&gt; 13 &lt;description longue, indentée par des espaces&gt;

source: (I've added the line numbers.)
ca: (S'han afegit els números de les línies).
es: (He añadido los números de línea)
fr: (Les numéros de ligne ont été ajoutés.)
it: (Sono stati aggiunti i numeri di riga.)
ja: (行番号は筆者による)

source: Lines 1-6 are the control information for the source package.
es: Las líneas 1 a 6 son la información de control para el paquete fuente.
fr: Les lignes 1 à 6 sont les informations de contrôle pour le paquet source.

source: Line 1 is the name of the source package.
ca: La línia 1 és el nom del paquet font.
es: La línea 1 es el nombre del paquete fuente.
fr: La ligne 1 est le nom du paquet source.
it: La riga 1 contiene il nome del pacchetto sorgente.
ja: 1 行目は、ソースパッケージ名です。

source: Line 2 is the section of the distribution the source package goes into.
ca: La línia 2 és la secció de la distribució a la qual s'assignarà el paquet.
es: La línea 2 es la sección de la distribución dentro de la que estará este paquete.
fr: La ligne 2 est la section de la distribution à laquelle ce paquet appartient.
it: La riga 2 indica la sezione della distribuzione in cui il pacchetto sorgente dovrà andare.
ja: 2 行目は、パッケージが所属するディストリビューション内のセクションです。

source: Let's change it then to x11. (A <literal>main/</literal> prefix is implied so we can omit it.)
fr: Changez la section en x11 (le préfixe <literal>main/</literal> est implicite, et peut donc être omis).
it: Si può quindi cambiare il valore alla seconda riga in x11. (Il prefisso <literal>main/</literal> è implicito e può essere omesso.)
ja: ここではx11に変更してみましょう。(省略時は<literal>main/</literal>がデフォルトとして設定されます)

source: Line 3 describes how important it is that the user installs this package. See the <ulink url="&policy-priorities;">Debian Policy Manual, 2.5 'Priorities'</ulink> for the guidance.
fr: La ligne 3 décrit l'importance pour l'utilisateur d'installer ce paquet. Lisez la <ulink url="&policy-priorities;">Charte Debian, 2.5 « Priorités »</ulink> pour des informations sur ces valeurs :

source: The <literal>optional</literal> priority will usually work for new packages that do not conflict with others with <literal>required</literal>, <literal>important</literal> or <literal>standard</literal> priorities.
ca: La prioritat <literal>optional</literal> es fa servir per a paquets nous que no tenen conflictes amb altres paquets amb prioritat <literal>required</literal>, <literal>important</literal> o <literal>standard</literal>.
es: La prioridad <literal>optional</literal> se utiliza para paquetes nuevos que no entran en conflicto con otros de prioridad <literal>required</literal>, <literal>important</literal> o <literal>standard</literal>.
fr: la priorité <literal>optional</literal> fonctionne habituellement pour les nouveaux paquets qui ne sont pas en conflit avec d'autres de priorité <literal>required</literal>, <literal>important</literal> ou <literal>standard</literal> ;
it: La priorità <literal>optional</literal> solitamente viene usata per i nuovi pacchetti che non vanno in conflitto con altri pacchetti con priorità <literal>required</literal>, <literal>important</literal> o <literal>standard</literal>.
ja: <literal>required</literal>、 <literal>important</literal>、<literal>standard</literal>のパッケージと競合しない新規のパッケージの場合は、<literal>optional</literal>で問題ないでしょう。

source: The <literal>extra</literal> priority will usually work for new packages that conflict with others with non-<literal>extra</literal> priorities.
ca: La prioritat <literal>extra</literal> es fa servir per als nous paquets que tenen conflictes amb altres paquets que no tenguin la prioritat <literal>extra</literal>
es: La prioridad <literal>extra</literal> se utiliza para nuevos paquetes que entran en conflicto con otros que no tienen la prioridad <literal>extra</literal>.
fr: la priorité <literal>extra</literal> fonctionne habituellement pour les nouveaux paquets qui sont en conflit avec d'autres de priorité non <literal>extra</literal>.
ja: <literal>extra</literal>以外のパッケージと競合する可能性のある、新規パッケージの場合は、<literal>extra</literal>とすると大抵うまくいきます。

source: Section and priority are used by the frontends like <command>aptitude</command> when they sort packages and select defaults. Once you upload the package to Debian, the value of these two fields can be overridden by the archive maintainers, in which case you will be notified by email.
ca: «Section» i «Priority» es fan servir per les ﻿interfícies com <command>dselect</command> quan ordenen els paquets i seleccionen els predeterminats. Una vegada el teu paquet s'afegeixi a Debian, el contingut d'aquests camps pot ésser canviat per les persones responsables del repositori, que t'informaran per correu electrònic.
es: «Section» y «Priority» se usan en las interfaces como <command>aptitude</command> cuando ordenan los paquetes y seleccionan los predeterminados. Una vez que envíes el paquete a Debian, el valor de estos dos campos puede no ser aceptado por los responsables del archivo, en cuyo caso te lo notificarán por correo electrónico.
fr: Les sections et les priorités sont utilisées par des interfaces comme <command>aptitude</command> quand elles trient les paquets et sélectionnent les valeurs par défaut. Quand vous enverrez le paquet dans Debian, les valeurs de ces deux champs peuvent être modifiées par les responsables des archives, auquel cas vous serez notifié par courrier.
it: Le sezioni e le priorità vengono solitamente utilizzate da interfacce come <command>aptitude</command> in cui i pacchetti vengono suddivisi e vengono selezionati quelli predefiniti. Una volta caricato il pacchetto in Debian, il valore di ciascuno di questi due campi può essere sovrascritto dai manutentori dell'archivio, in tal caso si verrà avvertiti via mail.
ja: セクション(Section)と優先度(Priority)は<command>aptitude</command>のようなフロントエンドがパッケージをソートする際と、デフォルトを選択する際に利用されます。Debianにアップロードしたパッケージのこれらの値は、アーカイブメンテナによって上書きされることがありますが、その場合は電子メールによって通知されます。

source: As this is a normal priority package and doesn't conflict with anything else, we will change the priority to <literal>optional</literal>.
ca: Com és un paquet de prioritat normal i no té conflictes amb cap altre paquet, deixarem la prioritat a <literal>optional</literal> (opcional).
es: Como es un paquete de prioridad normal y no tiene conflictos con ningún otro, lo dejaremos con prioridad <literal>optional</literal> (opcional).
fr: Comme c'est un paquet de priorité normale et qu'il n'entre pas en conflit avec quoi que ce soit, il suffit de laisser la priorité à « <literal>optional</literal> ».
it: Dal momento che il pacchetto trattato ha una priorità normale e non va in conflitto con altri, si cambierà la priorità a <literal>optional</literal>.
ja: このパッケージは通常の優先度で、競合もないので、 <literal>optional</literal>にしましょう。

source: Line 4 is the name and email address of the maintainer. Make sure that this field includes a valid <literal>To</literal> header for an email, because after you upload it, the bug tracking system will use it to deliver bug emails to you. Avoid using commas, ampersands and parenthesis.
ca: A la línia 4 hi ha el nom i l'adreça electrònica del desenvolupador. Assegura't que l'adreça electrònica és vàlida per al camp <literal>A</literal> : el sistema de seguiment d'errades («Bug Tracking System») la farà servir per enviar-te els missatges de les errades del paquet. No facis servir «», el signe «&amp;» i ﻿parèntesi.
es: La línea 4 es el nombre y correo electrónico del desarrollador. Asegúrate de que este campo incluye una cabecera válida <literal>To</literal> («A:»), para una dirección de correo electrónico, porque después de que envíes el paquete, el sistema de seguimiento de errores («Bug Tracking System») utilizará esta dirección para enviarte los mensajes de los bugs. Evita usar comas, el signo «&amp;» y paréntesis.
fr: La ligne 4 est le nom et l'adresse électronique du responsable. Assurez-vous que ce champ contient un en-tête « <literal>To</literal> » valable pour un courrier électronique, car après l'envoi du paquet, le système de suivi des bogues l'utilisera pour vous délivrer les courriers relatifs aux bogues. Évitez d'utiliser des virgules, esperluettes (« &amp; ») ou parenthèses.
it: La riga 4 indica il nome e l'indirizzo email del manutentore. Ci si assicuri che questo campo includa una testata <literal>To</literal> valida per un indirizzo mail, perché una volta caricato il pacchetto, il sistema di rilevazione bug la userà per inviare le mail contenenti i bug. Si eviti di utilizzare virgole, 'e' commerciali e parentesi.
ja: 4行目は、メンテナの名前と電子メールアドレスです。バグ追跡システムは、このフィールドに記載された宛先へユーザーからのバグ報告を送信するので、このフィールドは有効な電子メールの <literal>To</literal> ヘッダーを含むようにしましょう。コンマ ,、アンド記号 &amp;、括弧 ()は使用しないでください。

source: The 5th line includes the list of packages required to build your package as the <literal>Build-Depends</literal> field. You can also have the <literal>Build-Depends-Indep</literal> field as an additional line, here. (see the <ulink url="&policy-relationships;#s-sourcebinarydeps">Debian Policy Manual, 7.7 'Relationships between source and binary packages - Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep'</ulink>). Some packages like <systemitem role="package">gcc</systemitem> and <systemitem role="package">make</systemitem> which are required by the <systemitem role="package">build-essential</systemitem> package are implied. If you need to have other tools to build your package, you should add them to these fields. Multiple entries are separated with commas; read on for the explanation of binary dependencies to find out more about the syntax of these lines.
fr: La cinquième ligne contient la liste des paquets nécessaires pour construire le paquet dans le champ <literal>Build-Depends</literal>. Le champ <literal>Build-Depends-Indep</literal> peut-être ajouté dans une ligne supplémentaire (voir la <ulink url="&policy-relationships;#s-sourcebinarydeps">Charte Debian, 7.7 « Relations entre paquets sources et binaires — Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep »</ulink>). Certains paquets comme <systemitem role="package">gcc</systemitem> ou <systemitem role="package">make</systemitem> sont implicites, puisqu'ils dépendent de <systemitem role="package">build-essential</systemitem>. Si d'autres outils sont nécessaires pour construire le paquet, vous devez les ajouter à ces champs. Les multiples éléments sont séparées par des virgules ; lisez ci-après les explications sur les dépendances entre binaires pour mieux comprendre la syntaxe de ces lignes :

source: For all packages packaged with the <command>dh</command> command in the <filename>debian/rules</filename> file, you must have <literal>debhelper (&gt;=7.0.50~)</literal> in the <literal>Build-Depends</literal> field to satisfy the Debian Policy requirement for the <literal>clean</literal> target.
ca: A tots els paquets construïts amb l'ordre <command>dh</command> en el fitxer <filename>debian/rules</filename>, caldrà posar <literal>debhelper (&gt;=7.0.50~)</literal> en el camp <literal>Build-Depends</literal> per seguir les normes Debian respecte a l'objectiu <literal>clean</literal>.
es: Para todos los paquetes construidos con la orden <command>dh</command> en el archivo <filename>debian/rules</filename>, estará <literal>debhelper (&gt;=7.0.50~)</literal> en el campo <literal>Build-Depends</literal> para ajustarse a las normas de Debian respecto al objetivo <literal>clean</literal>.
fr: pour tous les paquets empaquetés avec la commande <command>dh</command> dans le fichier <filename>debian/rules</filename>, « <literal>debhelper (&gt;=7.0.50~)</literal> » doit faire partie du champ <literal>Build-Depends</literal> pour être conforme à la Charte Debian au sujet de la cible <literal>clean</literal> ;
it: Per tutti i pacchetti creati utilizzando il comando <command>dh</command> nel file <filename>debian/rules</filename>, è necessario avere <literal>debhelper (&gt;=7.0.50~)</literal> nel campo <literal>Build-Depends</literal>, per aderire alle policy di Debian che richiedono per l'obiettivo <literal>clean</literal>.
ja: <filename>debian/rules</filename>を使用し、<command>dh</command>コマンドでパッケージングされたパッケージは、<literal>clean</literal>ターゲットに関するDebian ポリシーを満たすために、<literal>Build-Depends</literal>フィールドに<literal>debhelper (&gt;=7.0.50~)</literal> を記載しなければなりません。

source: For source packages which have some binary packages with <literal>Architecture: any</literal>, they are rebuild by the autobuilder. Since this autobuilder procedure runs <literal>debian/rules build</literal> in it while installing only packages listed in the <literal>Build-Depends</literal> field (see <xref linkend="autobuilder"/> ), the <literal>Build-Depends</literal> field needs to list practically all the required packages and the <literal>Build-Depends-indep</literal> is rarely used.
ca: Els paquets de fonts amb més d'un binari amb el camp <literal>Architecture: any</literal> fan servir «autobuilder». Des de que el procediment «autobuilder» executa l'objectiu <literal>debian/rules build</literal>, que s'encarrega d'instal·lar els paquets llistats en el camp <literal>Build-Depends</literal> (consulta <xref linkend="autobuilder"/> ), el camp <literal>Build-Depends</literal> normalment llista tots els paquets necessaris i per això, el camp <literal>Build-Depends-indep</literal> es fa servir poc.
fr: les paquets sources de certains paquets binaires avec « <literal>Architecture: any</literal> » sont reconstruits par les empaqueteurs automatiques (« autobuilder »). Puisque la procédure des serveurs d'empaquetage automatique exécute « <literal>debian/rules build</literal> » en installant seulement les paquets indiqués dans le champ <literal>Build-Depends</literal> (voir <xref linkend="autobuilder"/> ), ce champ <literal>Build-Depends</literal> doit indiquer pratiquement tous les paquets nécessaires et <literal>Build-Depends-indep</literal> est rarement utilisé ;

source: For source packages which have binary packages only with <literal>Architecture: all</literal>, the <literal>Build-Depends-Indep</literal> field may list all the required packages unless they are already listed in the <literal>Build-Depends</literal> field to satisfy the Debian Policy requirement for the <literal>clean</literal> target.
ca: Els paquets de fonts amb binaris del tipus <literal>Architecture: all</literal>, el camp <literal>Build-Depends-Indep</literal> inclourà tots els paquets necessaris amb excepció dels llistats en el camp <literal>Build-Depends</literal> per tal de seguir els requeriments de les normes Debian respecte a l'objectiu <literal>clean</literal>.
es: En el caso de los paquetes de fuentes que incluyen paquetes binarios únicamente del tipo <literal>Architecture: all</literal>, el campo <literal>Build-Depends-Indep</literal> debe listar todos los paquetes excepto los listados en el campo <literal>Build-Depends</literal> para satisfacer los requerimientos de las normas de Debian respecto al objetivo <literal>clean</literal>.
fr: pour les paquets sources des seuls paquets binaires avec « <literal>Architecture: all</literal> », le champ <literal>Build-Depends-Indep</literal> peut indiquer tous les paquets nécessaires à moins qu'ils soient déjà indiqués dans le champ <literal>Build-Depends</literal> pour être conforme à la Charte Debian au sujet de la cible <literal>clean</literal>.
it: Per i soli sorgenti dei pacchetti che hanno come pacchetti binari <literal>Architecture: all</literal>, il campo <literal>Build-Depends-Indep</literal> elenca tutti i pacchetti necessari, se non sono già elencati nel campo <literal>Build-Depends</literal>, per essere conforme alle linee guida di Debian riguardanti il target <literal>clean</literal>.
ja: <literal>Architecture: all</literal>のバイナリパッケージのみのソースパッケージは、<literal>clean</literal>ターゲットに関するDebianポリシーを満たすために、<literal>Build-Depends</literal>フィールドに記載されていない要求パッケージを<literal>Build-Depends-Indep</literal>フィールドに記載することもできます。

source: This somewhat strange situation is a feature well documented in the <ulink url="&policy-build-depends-indep;">Debian Policy Manual, Footnotes 48</ulink>. This is not due to the use of the <command>dh</command> command in the <filename>debian/rules</filename> file but due to how the <command>dpkg-buildpackage</command> works. The same situation applies to the <ulink url="https://bugs.launchpad.net/launchpad-buildd/+bug/238141">auto build system for Ubuntu</ulink>.
ca: Consulta <ulink url="&policy-build-depends-indep;">«Debian Policy Manual, Footnotes 48»</ulink>. En tot cas, això és degut al funcionament de <command>dpkg-buildpackage</command>, no pel fet de fer servir l'ordre <command>dh</command> en el fitxer <filename>debian/rules</filename>. Tot això també s'explica a <ulink url="https://bugs.launchpad.net/launchpad-buildd/+bug/238141">«auto build system for Ubuntu»</ulink>.
fr: Cette situation quelque peu étrange est une fonctionnalité bien expliquée dans la <ulink url="&policy-build-depends-indep;">Charte Debian, note de bas de page 48</ulink>. Ce n'est pas lié à l'utilisation de la commande <command>dh</command> dans le fichier <filename>debian/rules</filename> mais au fonctionnement de <command>dpkg-buildpackage</command>. La même situation s'applique au <ulink url="https://bugs.launchpad.net/launchpad-buildd/+bug/238141">système de construction automatique pour Ubuntu</ulink>.
it: Questa strana situazione è ben documentata in <ulink url="&policy-build-depends-indep;">Debian Policy Manual, Footnotes 48</ulink>. Questo non è dovuto all'uso del comando <command>dh</command> nel file <filename>debian/rules</filename>, ma bensì al funzionamento di <command>dpkg-buildpackage</command>.La stessa situazione si presenta per il <ulink url="https://bugs.launchpad.net/launchpad-buildd/+bug/238141">sistema automatico di compilazione di Ubuntu</ulink>.
ja: この、少し変わった状況は<ulink url="&policy-build-depends-indep;">Debian Policy Manual, Footnotes 48</ulink>で詳しく説明されている機能です。これは、 <filename>debian/rules</filename>ファイル内の<command>dh</command>コマンドではなく、<command>dpkg-buildpackage</command>に起因します。同様の状況は<ulink url="https://bugs.launchpad.net/launchpad-buildd/+bug/238141">auto build system for Ubuntu</ulink>にも当てはまります。

source: If you are not sure which one should be used, use the <literal>Build-Depends</literal> field to be on the safe side. <placeholder type="footnote" id="0"/>
ca: Si tens dubtes, fes servir el camp <literal>Build-Depends</literal> <placeholder type="footnote" id="0"/>.
es: En caso de duda, utiliza el campo <literal>Build-Depends</literal> <placeholder type="footnote" id="0"/>.
fr: En cas de doute, utilisez le champ <literal>Build-Depends</literal> pour être sûr. <placeholder type="footnote" id="0"/>
it: Se non si è sicuri sul campo da utilizzare, si può scegliere il campo <literal>Build-Depends</literal>.<placeholder type="footnote" id="0"/>
ja: どちらのフィールドを使えうべきかわからなければ、<literal>Build-Depends</literal>にしておきましょう。<placeholder type="footnote" id="0"/>

source: To find out what packages your package needs to be built run the command:
ca: Si vols saber quins paquets són necessaris per compilar el teu programa, executa l'ordre (si el programa fa servir «configure» per compilar-se):
es: Para saber qué paquetes son necesarios para compilar el tuyo ejecuta esta orden:
fr: Pour déterminer les paquets nécessaires à la construction, exécutez la commande :
it: Per scoprire di quali pacchetti si ha bisogno per la compilazione si può eseguire il comando:
ja: 以下のコマンドを使えば、新規のパッケージをビルドするためにどのパッケージが必要かを調べることができます。

source: To manually find exact build dependency for <command><replaceable>/usr/bin/foo</replaceable></command>, you execute
ca: Si vols saber les dependències de compilació d'un paquet <command><replaceable>/usr/bin/nom_paquet</replaceable></command>, executa:
es: Para buscar manualmente las dependencias de compilación para el paquete <command><replaceable>/usr/bin/nombre_del_paquete</replaceable></command>, deberías ejecutar:
fr: Pour déterminer manuellement les dépendances de construction exactes pour <command><replaceable>/usr/bin/toto</replaceable></command>, exécutez :
it: Per scoprire manualmente le esatte dipendenze per <command><replaceable>/usr/bin/foo</replaceable></command>, si esegue
ja: <command><replaceable>/usr/bin/foo</replaceable></command>の依存パッケージを手動でみつけるには、

source: $ objdump -p <replaceable>/usr/bin/foo</replaceable> | grep NEEDED
ca: $ objdump -p <replaceable>/usr/bin/nom_del_paquet</replaceable> | grep NEEDED
es: $ objdump -p <replaceable>/usr/bin/nombre_del_paquete</replaceable> | grep NEEDED
fr: $ objdump -p <replaceable>/usr/bin/toto</replaceable> | grep NEEDED

source: and for each library listed, e.g., <command>libfoo.so.6</command>, execute
ca: i per a cada una de les biblioteques llistades per l'ordre anterior (a l'exemple es fa amb <command>libfoo.so.6</command>) executa:
es: y para cada biblioteca listada por la orden anterior (en el ejemplo se hace para <command>libfoo.so.6</command>) ejecuta
fr: et pour chaque bibliothèque affichée, par exemple <command>libtoto.so.6</command>, exécutez
it: e per ogni libreria elencata, ad esempio, <command>libfoo.so.6</command>, si esegue
ja: を実行し、表示された各ライブラリ（例えば<command>libfoo.so.6</command>の場合）について、

source: $ dpkg -S libfoo.so.6
fr: $ dpkg -S libtoto.so.6
