Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: There are packages which <emphasis>automate</emphasis> building of packages under VCS managed source tree for advanced audiences. I will not explain them in this tutorial. <placeholder type="footnote" id="0"/>
ja: 上級者向けに VCS で管理されたソースツリーから直接パッケージをビルドするのを<emphasis>自動化</emphasis>するパッケージがあります。このチュートリアルでは説明しません。<placeholder type="footnote" id="0"/>

source: All <emphasis>maintainer scripts</emphasis>, i.e., <filename>preinst</filename>, <filename>prerm</filename>, <filename>postinst</filename>, and <filename>postrm</filename> files, are non-trivial unless they are auto-generated by the <systemitem role="package">debhelper</systemitem> programs. So do not use them if you are a novice maintainer (see <xref linkend="maintscripts"/>).
ja: 全ての<emphasis>メンテナスクリプト</emphasis>、すなわち <filename>preinst</filename>、<filename>prerm</filename>、<filename>postinst</filename> そして <filename>postrm</filename> ファイルは、それが <systemitem role="package">debhelper</systemitem>プログラムで自動生成されたのでない場合は、非常に重要です。あなたが新米メンテナならばこれらは使わないで下さい(<xref linkend="maintscripts"/> を参照して下さい)。

source: You do not need to provide the <command>lintian</command> option <literal>-i -I --show-overrides</literal> if you customized <filename>/etc/devscripts.conf</filename> or <filename>~/.devscripts</filename> as described in <xref linkend="debuild"/>.
ja: <filename>/etc/devscripts.conf</filename> や <filename>~/.devscripts</filename> において <xref linkend="debuild"/> で述べた設定をしている場合には、<command>lintian</command> に <literal>-i -I --show-overrides</literal> オプションを指定する必要はありません。

source: For warnings, tune the package to avoid them or verify that the warnings are spurious. If spurious, set the <filename>lintian-overrides</filename> files as described in <xref linkend="lintian"/>.
ja: 警告が出た場合には、パッケージを調整するか、その警告が不当であることを確認するして下さい。もし警告が不当である場合には <xref linkend="lintian"/> で述べた <filename>lintian-overrides</filename> を作成して下さい。

source: The new <literal>3.0</literal> source format stores changes in multiple patch files as described in <xref linkend="patches"/>. You can trace changes of each <filename>debian/patches/*</filename> file using <command>interdiff</command>, too.
ja: 新規の <literal>3.0</literal> ソースフォーマットは <xref linkend="patches"/> で説明したように複数のパッチファイル中に変更を保存します。各々の <filename>debian/patches/*</filename> ファイルの変化も <command>interdiff</command> を使って追いかけられます。

source: Now that you have tested your new package thoroughly, you want to release it to a public archive to share it.
ja: あなたの新しいパッケージは徹底的にテストできたので、あなたはそれを共有すべく公開アーカイブにリリースしたいでしょう。

source: There are publicly accessible archives such as <ulink url="&mentors-dn;"/> which work almost the same way as Debian archive and provide upload area for the non-DD. You can set up an equivalent archive by yourself using tools listed at <ulink url="&deb-archive;"/>. So this section is useful for the non-DD, too.
ja: Debian アーカイブとほぼ同様に機能し、非-DDに対してアップロードエリアを提供する <ulink url="&mentors-dn;"/> のような公開アーカイブがあります。<ulink url="&deb-archive;"/> に列記されているツールを使い自分自身で同様のアーカイブを設定することも出来ます。だからこのセクションは非-DD にも有用です。

source: Once you become an official developer, <placeholder type="footnote" id="0"/> you can upload the package to the Debian archive. <placeholder type="footnote" id="1"/> You can do this manually, but it's easier to use the existing automated tools, like <citerefentry> <refentrytitle>dupload</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> or <citerefentry> <refentrytitle>dput</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. We'll describe how it's done with <command>dupload</command>. <placeholder type="footnote" id="2"/>
ja: 正規デベロッパー<placeholder type="footnote" id="0"/>になると、パッケージを Debian アーカイブにアップロードできます。<placeholder type="footnote" id="1"/> 手動でもできますが、 <citerefentry> <refentrytitle>dupload</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> や <citerefentry> <refentrytitle>dput</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> 等の既存の自動化ツールを用いる方が楽です。ここでは <command>dupload</command> を使ってどうするかを説明します。<placeholder type="footnote" id="2"/>

source: See <ulink url="&devref-upload;">Debian Developer's Reference 5.6. 'Uploading a package'</ulink>.
ja: <ulink url="&devref-upload;">Debian Developer's Reference 5.6. 'Uploading a package'</ulink> を参照下さい。

source: The <literal>$default_host</literal> option determines which of the upload queues will be used by default. <literal>anonymous-ftp-master</literal> is the primary one, but it's possible that you will want to use another one. <placeholder type="footnote" id="0"/>
ja: <literal>$default_host</literal> オプションはデフォルトで利用されるアップロードキューを指定します。<literal>anonymous-ftp-master</literal>がメインのアップロードキューですが、別のアップロードキューを利用したいこともあるでしょう。<placeholder type="footnote" id="0"/>

source: See <ulink url="&uploadqueue-readme;"/>. Alternatively, you may use <command>dcut</command> command from the <systemitem role="package">dput</systemitem> package.
ja: <ulink url="&uploadqueue;README">&uploadqueue;README</ulink> を参照下さい。<systemitem role="package">dput</systemitem> パッケージ中にある <command>dcut</command> コマンドをこれに代わる方法として用いることもできます。

source: If you encounter an upload problem at <ulink url="&uploadqueue;"/>, you can fix this by manually uploading GPG signed <filename>*.commands</filename> file to there with <command>ftp</command>. <placeholder type="footnote" id="0"/> For example, use <filename>hello.commands</filename>:
ja: <ulink url="&uploadqueue;">&uploadqueue;</ulink>へのアップロードで問題があった場合には、GPG サインした <filename>*.commands</filename> ファイルを <command>ftp</command> を用いて<command>ftp</command>で手動アップロードすることで修正出来ます。 <placeholder type="footnote" id="0"/> 例えば、<filename>hello.commands</filename> を使います:

source: <literal>dquilt new <replaceable>bugname.patch</replaceable></literal> to set patch name;
ja: <literal>dquilt new <replaceable>bugname.patch</replaceable></literal> としてパッチ名を設定します。

source: <literal>dquilt add <replaceable>buggy-file</replaceable></literal> to declare file to be modified;
ja: <literal>dquilt add <replaceable>buggy-file</replaceable></literal> として変更されるファイルを宣言します。

source: <literal>dquilt refresh</literal> to record to <filename><replaceable>bugname.patch</replaceable></filename>;
ja: <literal>dquilt refresh</literal> として <filename><replaceable>bugname.patch</replaceable></filename> に記録します。

source: <literal>dquilt header -e</literal> to add its description;
ja: <literal>dquilt header -e</literal> としてその内容記述を追加します。

source: <literal>dquilt pop <replaceable>foo.patch</replaceable></literal> to recall existing <filename><replaceable>foo.patch</replaceable></filename>;
ja: <literal>dquilt pop <replaceable>foo.patch</replaceable></literal> として既存の <filename><replaceable>foo.patch</replaceable></filename> を呼び出します。

source: <literal>dquilt refresh</literal> to update <filename><replaceable>foo.patch</replaceable></filename>;
ja: <literal>dquilt refresh</literal> として <filename><replaceable>foo.patch</replaceable></filename> を更新します。

source: <literal>dquilt header -e</literal> to update its description;
ja: <literal>dquilt header -e</literal> としてその内容記述を更新します。

source: <literal>while dquilt push; do dquilt refresh; done</literal> to apply all patches while removing <emphasis>fuzz</emphasis>;
ja: <literal>while dquilt push; do dquilt refresh; done</literal> として <emphasis>fuzz</emphasis> を削除しながら全てのパッチを適用します。

source: Repeat what you did in <xref linkend="completebuild"/>, <xref linkend="checkit"/>, and <xref linkend="upload"/>. The difference is that this time, the original source archive won't be included, as it hasn't been changed and it already exists in the Debian archive.
ja: これまで <xref linkend="completebuild"/> 、<xref linkend="checkit"/> 、 <xref linkend="upload"/> の中で実行してきたことを再度繰り返します。 今までと違うのは、今回の場合オリジナルソースアーカイブには 変更が無く、同じものが既に Debian アーカイブ中に存在しているため、 upload するファイルにはこのファイルが含まれないという点だけです。

source: Add an entry with <literal>New upstream release</literal>.
ja: <literal>New upstream release</literal> という項目を追加します。

source: Describe concisely the changes <emphasis>in the new upstream release</emphasis> that fix reported bugs and close those bugs by adding <literal>Closes: #<replaceable>bug_number</replaceable></literal>.
ja: 報告のあったバグを修正する<emphasis>新規アップストリームリリース中の</emphasis>変更点に関して簡潔に記載しバグを <literal>Closes: #<replaceable>バグ番号</replaceable></literal> と追記してクローズします。

source: Describe concisely the changes <emphasis>to the new upstream release</emphasis> by the maintainer that fix reported bugs and close those bugs by adding <literal>Closes: #<replaceable>bug_number</replaceable></literal>.
ja: 報告のあったバグを修正する、メンテナによる<emphasis>新規アップストリームリリースへの</emphasis>の変更点に関して簡潔に記載しバグを <literal>Closes: #<replaceable>バグ番号</replaceable></literal> と追記しクローズします。

source: <literal>while dquilt push; do dquilt refresh; done</literal> to apply all patches while removing <emphasis>fuzz</emphasis>.
ja: <literal>while dquilt push; do dquilt refresh; done</literal> として <emphasis>fuzz</emphasis> を削除しながら全てのパッチを適用します。

source: <literal>dquilt delete</literal> to remove it.
ja: <literal>dquilt delete</literal> として削除します。

source: <literal>dquilt push -f</literal> to apply old patches while forcing rejects as <filename><replaceable>baz</replaceable>.rej</filename>.
ja: <literal>dquilt push -f</literal> として <filename><replaceable>baz</replaceable>.rej</filename> としてリジェクトを強制しながら古いパッチを適用します。

source: <literal>dquilt refresh</literal> to update the patch.
ja: <literal>dquilt refresh</literal> としてパッチを更新します。

source: Continue back to <literal>while dquilt push; do dquilt refresh; done</literal>.
ja: <literal>while dquilt push; do dquilt refresh; done</literal> まで戻り継続します。

source: If you set up a <filename>debian/watch</filename> file as described in <xref linkend="watch"/>, you can skip the <command>wget</command> command. You simply run <citerefentry> <refentrytitle>uscan</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> in the <filename><replaceable>foo</replaceable>-<replaceable>oldversion</replaceable></filename> directory instead of the <command>uupdate</command> command. This will <emphasis>automagically</emphasis> look for the updated source, download it, and run the <command>uupdate</command> command. <placeholder type="footnote" id="0"/>
ja: <filename>debian/watch</filename> ファイルを<xref linkend="watch"/> に記載されたように設定していれば、 <command>wget</command> コマンドをスキップすることが出来ます。<filename><replaceable>foo</replaceable>-<replaceable>oldversion</replaceable></filename> ディレクトリ中で <command>uupdate</command> コマンドを実行する代わりに、単に <citerefentry> <refentrytitle>uscan</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> コマンドを実行します。こうすると<emphasis>魔法のように</emphasis>更新されたソースを見つけ、それをダウンロードし、<command>uupdate</command> コマンドを実行します。<placeholder type="footnote" id="0"/>

source: You can release this updated source by repeating what you did in <xref linkend="completebuild"/>, <xref linkend="checkit"/>, and <xref linkend="upload"/>.
ja: 今まで <xref linkend="completebuild"/> 、 <xref linkend="checkit"/> 、<xref linkend="upload"/> の中で実行してきたことを繰り返し、更新したソースをリリースできます。

source: If you want to update the <filename>rules</filename> file created with the <filename>Makefile</filename> inclusion mechanism of the Common Debian Build System (<systemitem role="package">cdbs</systemitem>) to the <command>dh</command> syntax, see <ulink url="&cdbs-doc;">cdbs-doc.pdf.gz</ulink> and understand its <literal>DEB_*</literal> configuration variables. <placeholder type="footnote" id="0"/>
ja: Common Debian Build System (<systemitem role="package">cdbs</systemitem>) という <filename>Makefile</filename> 包含メカニズムを使い作成された <filename>rules</filename> から <command>dh</command> シンタックスへと更新したい場合には、<ulink url="&cdbs-doc;">cdbs-doc.pdf.gz</ulink> を参照し、その <literal>DEB_*</literal> 設定変数を理解しましょう。<placeholder type="footnote" id="0"/>

source: If it was packaged with another patch system such as <systemitem role="package">dpatch</systemitem>, <systemitem role="package">dbs</systemitem>, or <systemitem role="package">cdbs</systemitem> with <literal>-p0</literal>, <literal>-p1</literal>, or <literal>-p2</literal>, convert it to the <systemitem role="package">quilt</systemitem> command using <filename>deb3</filename> at <ulink url="&deb3;"/>.
ja: <literal>-p0</literal> や <literal>-p1</literal> や <literal>-p2</literal> を使う <systemitem role="package">dpatch</systemitem> や <systemitem role="package">dbs</systemitem> や <systemitem role="package">cdbs</systemitem> のような他のパッチシステムを用いてパッケージされ得ている場合には、<ulink url="&deb3;">&deb3;</ulink>にある <filename>deb3</filename> を用いて <systemitem role="package">quilt</systemitem> コマンドに変換します。

source: You need to do other tasks described in <xref linkend="newupstream"/>, too.
ja: <xref linkend="newupstream"/> に記載された他の作業も行う必要があります。

source: Line 10 can be uncommented to set <literal>DH_VERBOSE</literal> variable to 1. Then, the <command>dh</command> command will output which <command>dh_*</command> commands are executed by the <command>dh</command> command. You can also add <literal>export DH_OPTIONS=-v</literal> line here. Then each <command>dh_*</command> command will output which commands are executed by each <command>dh_*</command> command. This helps you to understand what exactly is going on behind this simple <filename>rules</filename> file and to debug its problems. This new <command>dh</command> is a core part of the <systemitem role="package">debhelper</systemitem> tools and does not hide anything from you.
ca: Cal eliminar la marca de comentari a la línia 10 per assignar el valor 1 a la variable <literal>DH_VERBOSE</literal>. En aquest cas, l'ordre <command>dh</command> escriurà les ordres <command>dh_*</command> en el terminal així com siguin executades per <command>dh</command>. Pots ﻿afegir la línia <literal>export DH_OPTIONS=-v</literal> aquí. Aixó farà que cada ordre <command>dh_*</command> escrigui la sortida de cada ordre <command>dh_*</command> i solucionar els problemes que es produeixin. Això t'ajudarà a entendre com funciona el fitxer <filename>rules</filename> i a solucionar errades. La nova ordre <command>dh</command> és part fonamental de les eines <systemitem role="package">debhelper</systemitem> i no t'amaguen res.

source: $ dpkg-buildpackage
ca: dpkg-buildpackage -rfakeroot

source: $ debuild
ca: debuild clean debuild
