Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: The <literal>$default_host</literal> option determines which of the upload queues will be used by default. <literal>anonymous-ftp-master</literal> is the primary one, but it's possible that you will want to use another one.
es: La opción <literal>$default_host</literal> es la más problemática; determina cuál de las colas de envíos se usará por omisión. «<literal>anonymous-ftp-master</literal>» es la primaria, pero es posible que quieras usar otra más rápida.
fr: L'option <literal>$default_host</literal> détermine la queue de téléchargement qui sera utilisée par défaut. <literal>anonymous-ftp-master</literal> est la principale, mais il est possible que vous souhaitiez en utiliser une autre.

source: While connected to the Internet, you can upload your package by the following:
ca: Comprova que tens connexió a internet i executa l'ordre:
es: Ahora asegúrate que tienes conexión a internet y ejecuta la orden:
fr: Une fois connecté à Internet, vous pouvez envoyer le paquet :
it: Se si è connessi ad internet, si può caricare il proprio pacchetto con il comando:
ja: インターネットにつながった状態で、以下のようにすればあなたのパッケージをアップロード出来ます。

source: <command>dupload</command> checks that the MD5/SHA1/SHA256 checksums of the files match those from the <filename>.changes</filename> file. If they do not match, it will warn you to rebuild it as described in <xref linkend="completebuild"/> so it can be properly uploaded.
ca: <command>dupload</command> comprova que les sumes MD5/SHA1/SHA256 dels fitxers transferits coincideixen amb els llistats en el fitxer <filename>.changes</filename>, en cas contrari t'avisarà i hauràs de reconstruir el paquet com s'explica a <xref linkend="completebuild"/> per poder enviar-ho correctament.
es: <command>dupload</command> comprueba que las sumas MD5/SHA1/SHA256 de los archivos transferidos coinciden con las listadas en el fichero <filename>.changes</filename>, si no coinciden te avisará para que reconstruyas el paquete como se describe en <xref linkend="completebuild"/> para poder enviarlo correctamente.
fr: <command>dupload</command> vérifie que les sommes MD5, SHA1 et SHA256 des fichiers sont identiques à celles du fichier <filename>.changes</filename>. Dans le cas contraire, un avertissement proposera de le reconstruire comme décrit en <xref linkend="completebuild"/> pour pouvoir charger le fichier correctement.
it: <command>dupload</command> controlla che i checksum MD5/SHA1/SHA256 dei file corrispondano con quelli del file <filename>.changes</filename>. Se non dovessero corrispondereiti si verrà avvertiti di ricostruire il pacchetto come descritto in <xref linkend="completebuild"/> per poi poterlo ricaricare.
ja: <command>dupload</command> は各ファイルの MD5/SHA1/SHA256 チェックサムを計算し、 <filename>.changes</filename> ファイルの中の情報と照合します。 もしそれらが一致しない場合には、適正にアップロードされるように<xref linkend="completebuild"/> の説明に従って最初から再構築をするよう警告します。

source: See <ulink url="&mentors-dn;cgi-bin/welcome">mentors.debian.net</ulink> for publically accessible upload area for non-DD.
fr: Voyez <ulink url="&mentors-dn;cgi-bin/welcome">mentors.debian.net</ulink> pour un espace d'envoi accessible publiquement aux non-DD (développeurs Debian).

source: See <ulink url="&debref-archive;">Debian Reference, 2.7.12. 'Small public package archive'</ulink> for an example for creating a small public package archive compatible with the modern secure APT system.
fr: Voyez la <ulink url="http://www.debian.org/doc/manuals/debian-reference/ch02.fr.html#_small_public_package_archive">référence Debian, 2.7.12 « Petite archive publique de paquets »</ulink> pour un exemple de création de petite archive publique de paquets compatible avec le système APT moderne et sécurisé.

source: Skipped uploads
ca: Enviaments discontinuats.
es: Envíos discontinuados
fr: Versions non envoyées
it: Aggiornamenti scartati
ja: スキップされたアップロード

source: If you created multiple entries in <filename>debian/changelog</filename> by skipping uploads, you must create a proper <filename>*_.changes</filename> file which includes all changes from the last upload.
ca: Si en el fitxer <filename>debian/changelog</filename> hi ha diverses entrades corresponents a diferents versions del paquet, però alguna d'elles no s'ha enviat al repositori, hauràs de generar correctament un arxiu <filename>*_.changes</filename> que inclogui totes les modificacions des de la darrera versió present en el repositori.
es: Si en el archivo <filename>debian/changelog</filename> hay diversas entradas correspondientes a diferentes versiones del paquete, pero alguna de ellas no se ha enviado al repositorio, deberás generar correctamente un archivo <filename>*_.changes</filename> que incluya todas las modificaciones desde la última versión presente en el repositorio.
fr: Si plusieurs éléments (relatifs à plusieurs révisions) sont ajoutés à <filename>debian/changelog</filename>, mais que des envois sont sautés, il faut créer un fichier <filename>*_.changes</filename> correct incluant toutes les modifications depuis le dernier envoi.
it: Se si creano più voci nel file <filename>debian/changelog</filename> tralasciando gli aggiornamenti, è necessario creare un vero e proprio file <filename>*_.changes</filename> che include tutte le modifiche dall'ultimo caricamento.
ja: アップロードをスキップすることで <filename>debian/changelog</filename> 中に複数のエントリーを作成した場合は、前回アップロード以来の全ての変更を含む適切な <filename>*_.changes</filename> ファイルを作成しなければいけません。

source: This can be done by specifying <literal>-v</literal> option to the package building programs such as <command>dpkg-buildpackage</command>, <command>debuild</command>, <command>pdebuild</command>, etc.
ca: Pots fer això afegint l'opció <literal>-v</literal> en l'execució de les ordres <command>dpkg-buildpackage</command>, <command>debuild</command>, <command>pdebuild</command>, etc en la construcció del paquet.
es: Puedes hacer esto añadiendo la opción <literal>-v</literal> en la ejecución de las órdenes <command>dpkg-buildpackage</command>, <command>debuild</command>, <command>pdebuild</command>, etc en la construcción del paquete.
fr: Ce peut être réalisé en précisant l'option <literal>-v</literal> lors de la construction du paquet avec <command>dpkg-buildpackage</command>, <command>debuild</command>, <command>pdebuild</command>, etc.
it: Questo può essere fatto specificando l'opzione <literal>-v</literal> ai programmi per la creazione dei pacchetti come <command>dpkg-buildpackage</command>, <command>debuild</command>, <command>pdebuild</command>, ecc.
ja: <command>dpkg-buildpackage</command> や <command>debuild</command> や <command>pdebuild</command> 等のパッケージ作成プログラムに <literal>-v</literal> オプションを指定することで出来ます。

source: Updating the package
ca: Actualitzar el paquet.
es: Actualizar el paquete
fr: Mise à jour de paquet
it: Aggiornamento del pacchetto
ja: パッケージの更新

source: Once you release a package, you need to update it soon.
ca: Després del llançament del paquet, és possible que hagis d'actualitzar-ho aviat.
es: Después del lanzamiento del paquete, es posible que debas actualizarlo pronto.
fr: Une fois un paquet publié, il sera nécessaire de le mettre à jour assez vite.
it: Una volta rilasciato un pacchetto, ci sarà presto bisogno di aggiornarlo.
ja: パッケージをリリースしたなら、間もなくそれを更新する必要があります。

source: New Debian revision
ca: Nova revisió Debian del paquet.
es: Nueva revisión Debian del paquete
fr: Nouvelle révision Debian
it: Nuova revisione Debian
ja: Debian リビジョンの更新

source: Let's say that a bug report was filed against your package as <literal>#54321</literal>, and it describes a problem that you can solve. To create a new Debian revision of the package, you need to:
ca: Suposem que s'ha creat un informe d'error del teu paquet amb el número <literal>#54321</literal>, i que descriu un problema que pots solucionar. Per construir una nova revisió del paquet, necessites:
es: Supongamos que se ha creado un informe de fallo en tu paquete con el número <literal>#54321</literal>, y que describe un problema que puedes solucionar. Para construir una nueva revisión del paquete, necesitas:
fr: Soit un rapport de bogue numéroté <literal>#54321</literal>, concernant votre paquet et décrivant un problème que vous pouvez résoudre. Pour créer une nouvelle révision du paquet, vous devez :
it: Si supponga che sia stato compilato il bug report <literal>#54321</literal> per il pacchetto creato, e che questo descriva un problema che si può risolvere. Per creare una nuova revisione del pacchetto Debian, si proceda come qui di seguito descritto:
ja: 例えば仮に、<literal>#54321</literal> という番号のバグレポートがあなたのパッケージ に対してファイルされ、解決可能な問題が記述されていたとしましょう。 パッケージの新しい Debian リビジョンを作成するには、以下を実行する 必要があります。

source: If this is to be recorded as a new patch, do the following.
ca: Si cal aplicar una nova modificació, executa:
es: Si debes aplicar una modificación nueva, ejecuta:
fr: pour un nouveau correctif :
it: Se la modifica deve essere registrata come una nuova patch, si seguano queste istruzioni.
ja: もしこれが新規のパッチとして記録される場合には、以下のようにします。

source: <literal>quilt new <replaceable>bugname.patch</replaceable></literal> to set patch name;
es: <literal>quilt new <replaceable>nombre_modificación.patch</replaceable></literal> para establecer el nombre de la modificación;
fr: configurer le nom du correctif : « <literal>quilt new <replaceable>nomdubogue.patch</replaceable></literal> » ;

source: <literal>quilt add <replaceable>buggy-file</replaceable></literal> to declare file to be modified;
es: <literal>quilt add <replaceable>archivo_a_modificar</replaceable></literal> para establecer el fichero al cual se aplicará la modificación.
fr: déclarer le fichier à modifier : « <literal>quilt add <replaceable>fichier-bogué</replaceable></literal> » ;

source: Correct the problem in the package source for the upstream bug;
ca: Corregir el problema en el paquet de fonts degut a un error de l'autor.
es: Corregir el problema en el archivo original.
fr: corriger le problème dans le paquet source pour le bogue amont ;
it: Correggere il problema evidenziato dal bug report nel pacchetto sorgente.
ja: アップストリームバグに関してパッケージソース中の問題を修正します。

source: <literal>quilt refresh</literal> to record to <filename><replaceable>bugname.patch</replaceable></filename>;
es: <literal>quilt refresh</literal> para guardar los cambios realizados en el archivo del parche <filename><replaceable>nombre_modificación.patch</replaceable></filename>.
fr: l'enregistrer en <filename><replaceable>nomdubogue.patch</replaceable></filename> : « <literal>quilt refresh</literal> » ;

source: <literal>quilt header -e</literal> to add its description;
es: <literal>quilt header -e</literal> para añadir la descripción (breve) del cambio realizado;
fr: ajouter sa description : « <literal>quilt header -e</literal> » ;

source: If this is to update an existing patch, do the following.
ca: Si cal actualitzar una modificació ja existent, executa:
es: Si debes actualizar una modificación ya existente, ejecuta:
fr: pour la mise à jour d'un correctif :
it: Se la modifica è un aggiornamento ad una patch esistente, si seguano queste istruzioni.
ja: もし既存のパッチをアップデートする場合には、以下のようにします。

source: <literal>quilt pop <replaceable>foo.patch</replaceable></literal> to recall existing <filename><replaceable>foo.patch</replaceable></filename>;
es: <literal>quilt pop <replaceable>nombre_modificación.patch</replaceable></literal> para deshacer el parche <filename><replaceable>nombre_modificación.patch</replaceable></filename> que debes actualizar (puesto que se habrá ejecutado y se supone que es necesario modificarlo).
fr: rappeler le correctif <filename><replaceable>toto.patch</replaceable></filename> existant : « <literal>quilt pop <replaceable>toto.patch</replaceable></literal> » ;

source: Correct the problem in the old <filename><replaceable>foo.patch</replaceable></filename>;
ca: Corregir el problema existent en la versió incorrecta del fitxer del pegat <filename><replaceable>nom_modificació.patch</replaceable></filename>.
es: Corregir el problema existente en la versión incorrecta del archivo de parche <filename><replaceable>nombre_modificación.patch</replaceable></filename>.
fr: corriger le problème dans l'ancien <filename><replaceable>toto.patch</replaceable></filename> ;
it: Correggere il problema nella vecchia patch <filename><replaceable>foo.patch</replaceable></filename>.
ja: 古い <filename><replaceable>foo.patch</replaceable></filename> 中の問題を修正します。

source: <literal>quilt refresh</literal> to update <filename><replaceable>foo.patch</replaceable></filename>;
es: <literal>quilt refresh</literal> para actualizar <filename><replaceable>nombre_modificación.patch</replaceable></filename>.
fr: mettre à jour <filename><replaceable>toto.patch</replaceable></filename> : « <literal>quilt refresh</literal> » ;

source: <literal>quilt header -e</literal> to update its description;
es: <literal>quilt header -e</literal> para actualizar la descripción en la cabecera del archivo del parche.
fr: mettre à jour sa description : « <literal>quilt header -e</literal> » ;

source: <literal>while quilt push; do quilt refresh; done</literal> to apply all patches while removing <emphasis>fuzz</emphasis>;
es: <literal>while quilt push; do quilt refresh; done</literal> para aplicar todos los parches eliminando <emphasis>cosas innecesarias</emphasis>;
fr: appliquer tous les correctifs en enlevant les approximations (« <emphasis>fuzz</emphasis> ») : « <literal>while quilt push; do quilt refresh; done</literal> » ;

source: To get the date in the required format, use <literal>LANG=C date -R</literal>.
ca: Per escriure la data i hora en el format correcte, cal fer servir <literal>LANG=C date -R</literal>.
es: Para escribir la fecha y hora en el formato requerido, debes utilizar <literal>LANG=C date -R</literal>.
fr: Pour obtenir la date au format voulu, utilisez « <literal>LANG=C date -R</literal> ».
it: Per impostare la data nel formato corretto, si usi <literal>LANG=C date -R</literal>.
ja: 日付を要求されるフォーマットで入力するには、<literal>LANG=C date -R</literal>を使います。

source: Add a new revision at the top of the Debian <filename>changelog</filename> file, for example with <literal>dch -i</literal>, or explicitly with <literal>dch -v <replaceable>version</replaceable>-<replaceable>revision</replaceable></literal> and then insert the comments using your preferred editor. <placeholder type="footnote" id="0"/>
ca: Afegir la informació de la revisió a l'inici del fitxer <filename>changelog</filename> (del directori «Debian»), p. ex. executant <literal>dch -i</literal> o explícitament indicant el número de versió i revisió executant <literal>dch -v <replaceable>versió</replaceable>-<replaceable>revisió</replaceable></literal>, i a continuació detallar els canvis realitzats amb un editor <placeholder type="footnote" id="0"/>.
es: Añadir la información de la revisión en el inicio del archivo <filename>changelog</filename> (del directorio «Debian»), por ejemplo ejecutando <literal>dch -i</literal> o explícitamente indicando el número de versión y revisión ejecutando <literal>dch -v <replaceable>versión</replaceable>-<replaceable>revisión</replaceable></literal>, y a continuación detallar los cambios realizados utilizando un editor <placeholder type="footnote" id="0"/>.
fr: ajouter une nouvelle révision au début du fichier <filename>changelog</filename> Debian, par exemple avec « <literal>dch -i</literal> », ou explicitement avec « <literal>dch -v <replaceable>version</replaceable>-<replaceable>revision</replaceable></literal> », et ajoutez ensuite les commentaires en utilisant votre éditeur favori ;<placeholder type="footnote" id="0"/>
it: Aggiungere una nuova revisione in cima al file di <filename>changelog</filename> Debian, per esempio con <literal>dch -i</literal>, o esplicitamente con <literal>dch -v <replaceable>version</replaceable>-<replaceable>revision</replaceable></literal> e poi inserire i commenti utilizzando l'editor preferito. <placeholder type="footnote" id="0"/>
ja: 次に Debian <filename>changelog</filename> ファイルの先頭に新しいリビジョンを 追加します。例えば「<literal>dch -i</literal>」を実行するか、またはバージョンを 明示したい場合なら「<literal>dch -v <replaceable>version</replaceable>-<replaceable>revision</replaceable></literal>」 を実行してあなたの好きなエディタで説明を記入すると楽にできます。<placeholder type="footnote" id="0"/>

source: Repeat what you did in the above to fix more bugs while updating the Debian <filename>changelog</filename> file with <literal>dch</literal> as needed.
ca: Repeteix els passos anteriors per a cada una de les modificacions realitzades actualitzant l'arxiu Debian <filename>changelog</filename> amb <literal>dch</literal> si és necessari.
es: Deberás repetir los pasos anteriores para cada una de las modificaciones realizadas en la actualización del paquete, a la par que actualizas el fichero <filename>changelog</filename> de Debian mediante <literal>dch</literal>.
fr: répéter les opérations précédentes pour corriger plus de bogues tout en mettant à jour le fichier <filename>changelog</filename> avec « <literal>dch</literal> » selon votre besoin ;
it: Si ripetano questi passaggi per risolvere ulteriori problemi e si ricordi nel frattempo di aggiornare il file Debian di <filename>changelog</filename> con <literal>dch</literal> a seconda della necessità.
ja: 上記であなたがしたことを繰り返し、必要に応じて Debian <filename>changelog</filename> ファイルを <literal>dch</literal> で更新しながら、更なるバグ修正を行います。

source: Repeat what you did in <xref linkend="completebuild"/> , <xref linkend="checkit"/> , and <xref linkend="upload"/> . The difference is that this time, the original source archive won't be included, as it hasn't been changed and it already exists in the Debian archive.
ca: Finalment, reconstrueix el paquet amb les modificacions seguint l'explicació de <xref linkend="completebuild"/> , <xref linkend="checkit"/> , i <xref linkend="upload"/> . La diferència amb el procediment anterior és que el fitxer de les fonts originals no s'inclourà (degut a que no les ha modificat l'autor original) en carregar el paquet al repositori.
es: Ahora debes reconstruir el paquete con las modificaciones según se ha descrito en <xref linkend="completebuild"/> , <xref linkend="checkit"/> , y <xref linkend="upload"/> . La diferencia con el procedimiento anterior es que el archivo de las fuentes originales no se incluirá (puesto que no se ha sido modificadas por el autor) en el envío al repositorio.
fr: recommencer ce que vous aviez fait dans <xref linkend="completebuild"/> , <xref linkend="checkit"/> , et <xref linkend="upload"/> . La différence est que cette fois, l'archive des sources originales ne sera pas incluse, car elle n'a pas été changée et est déjà dans l'archive Debian.

source: Inspection of the new upstream release
ca: Inspecció d'una nova versió de l'autor.
es: Inspección de una nueva versión del autor
fr: Examen d'une nouvelle version amont
it: Controllo della nuova distribuzione
ja: 新規のアップストリームリリースの検査

source: When preparing packages of the new upstream release for the Debian archive, you must check the new upstream release, first.
ca: Quan l'autor original allibera una nova versió de les fonts, cal que comencis per revisar la nova versió original.
es: Para la actualización de un paquete cuando el autor original libera una nueva versión de las fuentes, debes empezar por revisar la nueva versión original.
fr: Lors de la préparation de paquets d'une nouvelle version amont pour l'archive Debian, vous devez commencer par vérifier la nouvelle version amont.
it: Quando si stanno preparando i pacchetti della nuova distribuzione per l'archivio Debian, bisogna innanzitutto effettuare dei controlli.
ja: Debian アーカイブ用の新しい上流リリースパッケージの準備ができたら、まず、上流リリースをチェックしなければなりません。

source: You start this by reading the upstream <filename>changelog</filename>, <filename>NEWS</filename>, and whatever other documentations they may have released with the new version.
ca: Comença per llegir els fitxers <filename>changelog</filename>, <filename>NEWS</filename> i qualsevol altre documentació on l'autor original expliqui els canvis realitzats en la nova versió.
es: Empieza por leer los archivos <filename>changelog</filename>, <filename>NEWS</filename> y cualquier otra documentación donde el autor original describa los cambios de la nueva versión.
fr: Commencez par lire les <filename>changelog</filename> et <filename>NEWS</filename> amonts, ainsi que toute autre documentation distribuée avec la nouvelle version.
it: Si comincia leggendo i file originali <filename>changelog</filename>, <filename>NEWS</filename>, e qualsiasi altra documentazione che possa essere stata rilasciata con la nuova versione.
ja: 上流の <filename>changelog</filename> や <filename>NEWS</filename>、その他新しいバージョンでリリースされたドキュメントを読むことから始めてください

source: You then inspect changes between the old and new upstream sources as follow to watch out for anything suspicious.
ca: Pots comprovar els canvis entre les fonts originals de la nova versió i de l'anterior per detectar qualsevol canvi sospitós de produir errors executant:
es: Puedes comprobar los cambios entre las fuentes originales de la nueva versión y de la anterior para detectar cualquier cambio sospechoso de producir errores ejecutando:
fr: Examinez ensuite les modifications entre les anciennes et nouvelles sources amont, pour guetter tout changement suspect :
it: Successivamente si controllano i cambiamenti tra i sorgenti originali e quelli nuovi, come mostrato in seguito, alla ricerca di qualsiasi modifica sospetta.
ja: 以下のようにすれば新旧のアップストリームソース間の変更を検査を何かおかしな事が無いかに注意しつつできます。

source: $ diff -urN <replaceable>foo</replaceable>-<replaceable>oldversion</replaceable> <replaceable>foo</replaceable>-<replaceable>newversion</replaceable>
ca: $ diff -urN <replaceable>nom_arxiu</replaceable>-<replaceable>versió_anterior</replaceable> <replaceable>nom_arxiu</replaceable>-<replaceable>nova_versió</replaceable>
es: $ diff -urN <replaceable>nombre_archivo</replaceable>-<replaceable>versión_anterior</replaceable> <replaceable>nombre_archivo</replaceable>-<replaceable>nueva_versión</replaceable>
fr: $ diff -urN <replaceable>toto</replaceable>-<replaceable>ancienneversion</replaceable> <replaceable>toto</replaceable>-<replaceable>nouvelleversion</replaceable>
