Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: 1 Format-Specification: http://svn.debian.org/wsvn/dep/web/deps/dep5.mdwn?op=file&amp;rev=135 2 Name: gentoo 3 Maintainer: Josip Rodin &lt;joy-mg@debian.org&gt; 4 Source: http://sourceforge.net/projects/gentoo/files/ 5 6 Copyright: 1998-2010 Emil Brink &lt;emil@obsession.se&gt; 7 License: GPL-2+ 8 9 Files: icons/* 10 Copyright: 1998 Johan Hanson &lt;johan@tiq.com&gt; 11 License: GPL-2+ 12 13 Files: debian/* 14 Copyright: 1998-2010 Josip Rodin &lt;joy-mg@debian.org&gt; 15 License: GPL-2+ 16 17 License: GPL-2+ 18 This program is free software; you can redistribute it and/or modify 19 it under the terms of the GNU General Public License as published by 20 the Free Software Foundation; either version 2 of the License, or 21 (at your option) any later version. 22 . 23 This program is distributed in the hope that it will be useful, 24 but WITHOUT ANY WARRANTY; without even the implied warranty of 25 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 26 GNU General Public License for more details. 27 . 28 You should have received a copy of the GNU General Public License along 29 with this program; if not, write to the Free Software Foundation, Inc., 30 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA. 31 . 32 On Debian systems, the full text of the GNU General Public 33 License version 2 can be found in the file 34 `/usr/share/common-licenses/GPL-2'.
fr: 1 Format-Specification: http://svn.debian.org/wsvn/dep/web/deps/dep5.mdwn?op=file&amp;rev=135 2 Name: gentoo 3 Maintainer: Prénom Nom &lt;votre.adresse.mail@example.org&gt; 4 Source: http://sourceforge.net/projects/gentoo/files/ 5 6 Copyright: 1998-2010 Emil Brink &lt;emil@obsession.se&gt; 7 License: GPL-2+ 8 9 Files: icons/* 10 Copyright: 1998 Johan Hanson &lt;johan@tiq.com&gt; 11 License: GPL-2+ 12 13 Files: debian/* 14 Copyright: 2010 Prénom Nom &lt;votre.adresse.mail@example.org&gt; 15 License: GPL-2+ 16 17 License: GPL-2+ 18 This program is free software; you can redistribute it and/or modify 19 it under the terms of the GNU General Public License as published by 20 the Free Software Foundation; either version 2 of the License, or 21 (at your option) any later version. 22 . 23 This program is distributed in the hope that it will be useful, 24 but WITHOUT ANY WARRANTY; without even the implied warranty of 25 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 26 GNU General Public License for more details. 27 . 28 You should have received a copy of the GNU General Public License along 29 with this program; if not, write to the Free Software Foundation, Inc., 30 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA. 31 . 32 On Debian systems, the full text of the GNU General Public 33 License version 2 can be found in the file 34 `/usr/share/common-licenses/GPL-2'.

source: Please follow the HOWTO provided by ftpmasters and sent to debian-devel-announce: <ulink url="&debian-devel-announce-ldo;2006/03/msg00023.html">&debian-devel-announce-ldo;2006/03/msg00023.html</ulink>.
fr: Veuillez suivre les indications fournies par les responsables de l'archive et envoyées sur la liste debian-devel-announce : <ulink url="&debian-devel-announce-ldo;2006/03/msg00023.html">&debian-devel-announce-ldo;2006/03/msg00023.html</ulink>.

source: <filename>changelog</filename> file
ca: El fitxer <filename>changelog</filename>.
es: El archivo <filename>changelog</filename>
fr: Fichier <filename>changelog</filename>
it: Il file <filename>changelog</filename>
ja: <filename>changelog</filename>ファイル

source: This is a required file, which has a special format described in the <ulink url="&policy-dpkgchangelog;">Debian Policy Manual, 4.4 'debian/changelog'</ulink>. This format is used by <command>dpkg</command> and other programs to obtain the version number, revision, distribution and urgency of your package.
fr: C'est un fichier obligatoire, avec un format spécifique décrit dans la <ulink url="&policy-dpkgchangelog;">Charte Debian, 4.4 « debian/changelog »</ulink>. Ce format est utilisé par <command>dpkg</command> et d'autres programmes pour obtenir le numéro de version, de révision, de distribution et l'urgence de votre paquet.
it: Questo è un file obbligatorio, che ha un formato speciale descritto nel <ulink url="&policy-dpkgchangelog;">Manuale delle policy di Debian, 4.4 'debian/changelog'</ulink>. Questo formato è utilizzato da <command>dpkg</command> ed altri programmi per ottenere il numero di versione, revisione, distribuzione ed urgenza del pacchetto.
ja: 必須のファイルです。このファイルの特別な書式は<ulink url="&policy-dpkgchangelog;">Debian Policy Manual, 4.4 'debian/changelog'</ulink>で既定されています。この書式は、<command>dpkg</command>やその他のプログラムによってパッケージの バージョン番号、レビジョン、ディストリビューション、それに緊急度 (urgency) を識別するために利用されます。

source: For you, it is also important, since it is good to have documented all changes you have done. It will help people downloading your package to see whether there are issues with the package that they should know about. It will be saved as <filename>/usr/share/doc/gentoo/changelog.Debian.gz</filename> in the binary package.
ca: També és important aquest arxiu: facilita la documentació dels canvis fets en la construcció del paquet. El fitxer informarà als usuaris que descarreguin el paquet sobre els problemes que pugui tenir el paquet i que ells hagin de saber. El fitxer es conserva com <filename>/usr/share/doc/gentoo/changelog.Debian.gz</filename> en el paquet.
es: Para ti es también importante, ya que es bueno tener documentados todos los cambios que hayas hecho. Esto ayudará a las personas que se descarguen tu paquete para ver si hay temas pendientes en el paquete que deberían conocer de forma inmediata. Se guardará como <filename>/usr/share/doc/gentoo/changelog.Debian.gz</filename> en el paquete binario.
fr: Pour vous, il est également important, puisqu'il est bon de documenter toutes les modifications effectuées. Cela permettra aux personnes qui téléchargent le paquet de voir s'il y a des problèmes à connaître. Il sera conservé en <filename>/usr/share/doc/gentoo/changelog.Debian.gz</filename> dans le paquet binaire.
it: Tale file è anche utile allo scopo di aver documentato tutti i cambiamenti che sono stati fatti. Sarà inoltre d'aiuto agli utenti che scaricano il pacchetto per vedere se ci sono problemi di cui dovrebbero essere al corrente. Il file verrà salvato come <filename>/usr/share/doc/gentoo/changelog.Debian.gz</filename> nel pacchetto binario.
ja: あなたが行なったすべての変更をきちんと記載しておくことは良いことであり、その意味でこのファイルはまた、パッケージメンテナであるあなたにとっても重要なものです。パッケージをダウンロードした人は、 このファイルを見ることで、このパッケージに関する未解決の問題があるかどうかを知ることができます。このファイルはバイナリパッケージ中に<filename>/usr/share/doc/gentoo/changelog.Debian.gz</filename>として保存されます。

source: <command>dh_make</command> created a default one, and this is how it looks like:
ca: <command>dh_make</command> construeix un arxiu predeterminat amb el següent text:
es: <command>dh_make</command> genera uno predeterminado, el cual es como sigue:
fr: <command>dh_make</command> en crée un par défaut, et il ressemble à ceci :
it: <command>dh_make</command> ne crea uno predefinito, ecco come appare:
ja: <command>dh_make</command>がデフォルトとして生成するchangelogはこんな感じです。

source: 1 gentoo (0.9.12-1) unstable; urgency=low 2 3 * Initial release (Closes: #<replaceable>nnnn</replaceable>) &lt;<replaceable>nnnn</replaceable> is the bug number of your ITP&gt; 4 5 -- Josip Rodin &lt;joy-mg@debian.org&gt; Mon, 22 Mar 2010 00:37:31 +0100 6
fr: 1 gentoo (0.9.12-1) unstable; urgency=low 2 3 * Initial release (Closes: #<replaceable>nnnn</replaceable>) &lt;<replaceable>nnnn</replaceable> est le numéro de bogue de votre ITP&gt; 4 5 -- Prénom Nom &lt;votre.adresse.mail@example.org&gt; Mon, 22 Mar 2010 00:37:31 +0100 6

source: You will end up with something like this:
ca: Aquest serà el contingut del fitxer:
es: Terminarás con algo así:
fr: Vous obtiendrez quelque chose comme :
it: Alla fine si avrà qualcosa del genere:
ja: 最終的にこんなふうになります。

source: 1 gentoo (0.9.12-1) unstable; urgency=low 2 3 * Initial Release. Closes: #12345 4 * This is my first Debian package. 5 * Adjusted the Makefile to fix $(DESTDIR) problems. 6 7 -- Josip Rodin &lt;joy-mg@debian.org&gt; Mon, 22 Mar 2010 00:37:31 +0100 8
fr: 1 gentoo (0.9.12-1) unstable; urgency=low 2 3 * Initial Release. Closes: #12345 4 * This is my first Debian package. 5 * Adjusted the Makefile to fix $(DESTDIR) problems. 6 7 -- Prénom Nom &lt;votre.adresse.mail@example.org&gt; Mon, 22 Mar 2010 00:37:31 +0100 8

source: You can read more about updating the <filename>changelog</filename> file later in <xref linkend="update"/> .
ca: A la secció <xref linkend="update"/> s'explicaran alguns aspectes més de l'actualització del fitxer <filename>changelog</filename>.
fr: Vous pouvez en apprendre plus sur la mise à jour du fichier <filename>changelog</filename> plus loin en <xref linkend="update"/> .

source: <filename>rules</filename> file
ca: El fitxer <filename>rules</filename>.
es: El archivo <filename>rules</filename>
fr: Fichier <filename>rules</filename>
it: Il file <filename>rules</filename>
ja: <filename>rules</filename>ファイル

source: Now we need to take a look at the exact rules which <citerefentry> <refentrytitle>dpkg-buildpackage</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> will use to actually create the package. This file is actually another <filename>Makefile</filename>, but different from the one(s) in the upstream source. Unlike other files in <filename>debian</filename>, this one is marked as executable.
ca: Ara mirarem quines són les regles que farà servir <citerefentry> <refentrytitle>dpkg-buildpackage</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> per a la construcció del paquet. Aquest arxiu és un tipus de <filename>Makefile</filename>, però diferent dels que hi ha al codi font. En contra dels altres arxius del directori <filename>debian</filename> és un guió executable i cal que tengui aquesta propietat.
es: Ahora necesitamos mirar las reglas exactas que <citerefentry> <refentrytitle>dpkg-buildpackage</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> utilizará para construir el paquete. Este fichero es en realidad otro <filename>Makefile</filename>, pero diferente al que viene en las fuentes originales. A diferencia de otros ficheros en <filename>debian</filename>, éste debe ser un fichero ejecutable.
fr: Il faut maintenant examiner les règles utilisées par <citerefentry> <refentrytitle>dpkg-buildpackage</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> pour créer vraiment le paquet. Ce fichier est en fait un autre <filename>Makefile</filename>, mais différent de ceux des sources amont. Contrairement aux autres fichiers de <filename>debian</filename>, celui-ci est marqué comme exécutable.
it: Ora si darà uno sguardo alle regole esatte che <citerefentry> <refentrytitle>dpkg-buildpackage</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> userà per creare il pacchetto. In realtà questo file non è che un altro <filename>Makefile</filename>, ma diverso da quelli della sorgente originale. Differentemente dagli altri file sotto <filename>debian</filename>, questo qui è marcato come eseguibile.
ja: さて、今度は <citerefentry> <refentrytitle>dpkg-buildpackage</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> が実際にパッケージを作成するために使うルールについて見ていきましょう。このファイルは、もうひとつの <filename>Makefile</filename> といった存在ですが、上流ソースに含まれるそれとは違います。<filename>debian</filename> ディレクトリに含まれる他のファイルとは異なり、 このファイルには実行属性が付けられています。

source: Targets of <filename>rules</filename> file
ca: Objectius del fitxer <filename>rules</filename>.
es: Objetivos del archivo <filename>rules</filename>
fr: Cibles du fichier <filename>rules</filename>
it: Obiettivi del file <filename>rules</filename>
ja: <filename>rules</filename>ファイルのターゲット

source: Every <filename>rules</filename> file, as any other <filename>Makefile</filename>, consists of several targets and their rules specifying how to handle the source. <ulink url="&policy-debianrules;">Debian Policy Manual, 4.9 'Main building script: debian/rules'</ulink> explains its details.
ca: Cada arxiu <filename>rules</filename> (﻿de regles), com altres arxius <filename>Makefile</filename>, es compon de vàries regles que especifiquen què cal fer amb les fonts. <ulink url="&policy-debianrules;">«Debian Policy Manual, 4.9 'Main building script: debian/rules»'</ulink> explica detalladament la seva funció.
fr: Tout fichier <filename>rules</filename>, comme tout autre <filename>Makefile</filename>, consiste en plusieurs cibles et leurs règles précisant comment gérer le code source. La <ulink url="&policy-debianrules;">Charte Debian, 4.9 « Script de construction principal : debian/rules »</ulink> l'explique en détail.
it: Ogni file <filename>rules</filename>, come qualsiasi altro <filename>Makefile</filename>, consiste di diversi obiettivi e regole che specificano come gestire il sorgente. <ulink url="&policy-debianrules;">Manuale delle policy di Debian, 4.9 'Script principale per la creazione: debian/rules'</ulink> ne spiega i dettagli.
ja: <filename>rules</filename>ファイルは<filename>Makefile</filename>と同様に、ターゲットとルールで構成され、ソースファイルをどう扱うかを定めています。詳細は<ulink url="&policy-debianrules;">Debian Policy Manual, 4.9 'Main building script: debian/rules'</ulink>を参照してください。

source: The simplified explanation of targets are the following.
ca: A continuació tens una explicació simplificada dels obejctius:
es: A continuación se proporciona una explicación simplificada de los distintos objetivos.
fr: Voici une explication simplifiée des cibles :
it: La spiegazione breve degli obiettivi è la seguente.
ja: ターゲットについて簡単に説明します。

source: <literal>clean</literal> target: to clean all compiled, generated, and useless files in the build-tree. (required)
ca: <literal>clean</literal> (obligatori): elimina tots els fitxers generats, compilats o innecessaris de l'estructura de directoris de les fonts.
es: <literal>clean</literal> (obligatorio): elimina todos los archivos generados, compilados o innecesarios del árbol de directorios de las fuentes.
fr: <literal>clean</literal> (obligatoire) : pour nettoyer tous les fichiers compilés, créés, et inutiles de l'arborescence de construction ;
it: obiettivo <literal>clean</literal>: ripulire tutti i file compilati, generati ed inutili nella struttura di cartelle del pacchetto. (richiesto)
ja: <literal>clean</literal>ターゲット: ビルドツリー内に生成、コンパイルされた役に立たないファイルを掃除します。(必須)

source: <literal>build</literal> target: to build the source into compiled programs and formatted documents in the build-tree. (required)
ca: <literal>build</literal> (obligatori): construeix els fitxers executables o els documents amb format a partir dels fitxers de les fonts.
es: <literal>build</literal> (obligatorio): para la construcción de archivos compilados a partir de los archivos fuente o la construcción de documentos formateados.
fr: <literal>build</literal> (obligatoire) : pour construire les programmes compilés et les documents formatés à partir des sources dans l'arborescence de construction ;
it: obiettivo <literal>build</literal>: costruire tutti i sorgenti per ottenere programmi compilati e documenti formattati nell'albero delle cartelle del pacchetto. (richiesto)
ja: <literal>build</literal> ターゲット: ソースをビルドして、ビルドツリー内にコンパイルしたプログラムとドキュメントを生成します。(必須)

source: <literal>install</literal> target: to install files into a file tree for each binary package under the <filename>debian</filename> directory. If defined, <literal>binary*</literal> targets effectively depend on this target. (optional)
ca: <literal>install</literal> (opcional): fa la instal·lació en l'estructura de directoris temporal en el directori <filename>debian</filename> dels fitxers que constitueixen els paquets binaris. Si hi ha un objectiu <literal>binary*</literal>, dependrà d'aquest.
es: <literal>install</literal> (opcional): para la instalación en la estructura de directorios temporal bajo el directorio <filename>debian</filename> de los archivos para cada uno de los paquetes binarios. Si existe el objetivo <literal>binary*</literal>, dependerá de este.
fr: <literal>install</literal> (optionnelle) : pour installer les fichiers dans l'arborescence de chaque paquet binaire dans le répertoire <filename>debian</filename>. Si elles existent, les cibles <literal>binary*</literal> dépendent en réalité de cette cible.
it: obiettivo <literal>install</literal>: installare i file in una struttura ad albero per ogni pacchetto binario nella directory <filename>debian</filename>. Se definito, tutti gli obiettivi <literal>binary*</literal> dipenderanno effettivamente da quest'ultimo. (opzionale)
ja: <literal>install</literal> ターゲット: <filename>debian</filename>ディレクトリ以下にある各バイナリパッケージのファイルツリーにファイルをインストールします。定義されている場合は、<literal>binary*</literal>ターゲットが効率的にこのターゲットに依存します。(任意)

source: This target is used by <literal>dpkg-buildpackage</literal> as in <xref linkend="completebuild"/> .
ca: Aquest objectiu és utilitzat per <literal>dpkg-buildpackage</literal> com en <xref linkend="completebuild"/> .
es: Este objetivo es utilizado por <literal>dpkg-buildpackage</literal> como en <xref linkend="completebuild"/> .
fr: Cette cible est utilisée par « <literal>dpkg-buildpackage</literal> » comme en <xref linkend="completebuild"/> .

source: <literal>binary</literal> target: to create all binary packages (effectively combination of <literal>binary-arch</literal> and <literal>binary-indep</literal> targets). (required)<placeholder type="footnote" id="0"/>
ca: <literal>binary</literal> (obligatori): per a la construcció de cada un dels paquets binaris (combinat amb els objectius <literal>binary-arch</literal> i <literal>binary-indep</literal>) <placeholder type="footnote" id="0"/>.
es: <literal>binary</literal> (obligatorio): para la construcción de cada uno de los paquetes binarios (combinado con los objetivos <literal>binary-arch</literal> y <literal>binary-indep</literal>) <placeholder type="footnote" id="0"/>.
fr: <literal>binary</literal> (obligatoire) : pour créer tous les paquets binaires (en réalité, combinaison des cibles <literal>binary-arch</literal> et <literal>binary-indep</literal>) ; <placeholder type="footnote" id="0"/>
it: obiettivo <literal>binary</literal>: creare tutta una serie di pacchetti binari (combinando gli obiettivi <literal>binary-arch</literal> e <literal>binary-indep</literal>). (richiesto)<placeholder type="footnote" id="0"/>
ja: <literal>binary</literal> ターゲット: 全てのバイナリパッケージを作ります。(<literal>binary-arch</literal>と<literal>binary-indep</literal>の組み合わせ)(必須)<placeholder type="footnote" id="0"/>

source: This target is used by <literal>dpkg-buildpackage -B</literal> as in <xref linkend="autobuilder"/> .
ca: Aquest objectiu és utilitzat per <literal>dpkg-buildpackage -B</literal> com en <xref linkend="autobuilder"/> .
es: Este objetivo es utilizado por <literal>dpkg-buildpackage -B</literal> como en <xref linkend="autobuilder"/> .
fr: Cette cible est utilisée par « <literal>dpkg-buildpackage -B</literal> » comme en <xref linkend="autobuilder"/> .

source: <literal>binary-arch</literal> target: to create arch-dependent (<literal>Architecture: any</literal>) binary packages in the parent directory. (required)<placeholder type="footnote" id="0"/>
ca: <literal>binary-arch</literal> (obligatori): per a la construcció de paquets dependents de l'arquitectura (els que tenen el camp <literal>Architecture: any</literal> en el fitxer «control») <placeholder type="footnote" id="0"/>.
es: <literal>binary-arch</literal> (obligatorio): para la construcción de paquetes dependientes de la arquitectura (<literal>Architecture: any</literal>) <placeholder type="footnote" id="0"/>.
fr: <literal>binary-arch</literal> (obligatoire) : pour créer tous les paquets binaires dépendants de l'architecture (<literal>Architecture: any</literal>) dans le répertoire parent ;<placeholder type="footnote" id="0"/>
ja: <literal>binary-arch</literal> ターゲット: 親ディレクトリにアーキテクチャに依存したバイナリパッケージ (<literal>Architecture: any</literal>)を作ります。(必須)<placeholder type="footnote" id="0"/>

source: This target is used by <literal>dpkg-buildpackage -A</literal>.
ca: Aquest objectiu és utilitzat per <literal>dpkg-buildpackage -A</literal>.
es: Este objetivo es utilizado por <literal>dpkg-buildpackage -A</literal>.
fr: Cette cible est utilisée par « <literal>dpkg-buildpackage -A</literal> ».
it: Questo obiettivo è utilizzato da <literal>dpkg-buildpackage -A</literal>.
ja: このターゲットは、 <literal>dpkg-buildpackage -A</literal>が使用します。

source: <literal>binary-indep</literal> target: to create arch-independent (<literal>Architecture: all</literal>) binary packages in the parent directory. (required)<placeholder type="footnote" id="0"/>
ca: <literal>binary-indep</literal> (obligatori): per a la construcció de paquets independents de l'arquitectura (<literal>Architecture: all</literal> en el fitxer «control») <placeholder type="footnote" id="0"/>.
es: <literal>binary-indep</literal> (obligatorio): para la construcción de paquetes independientes de la arquitectura (<literal>Architecture: all</literal>) <placeholder type="footnote" id="0"/>.
fr: <literal>binary-indep</literal> (obligatoire) : pour créer tous les paquets binaires indépendants de l'architecture (<literal>Architecture: all</literal>) dans le répertoire parent ;<placeholder type="footnote" id="0"/>
it: obiettivo <literal>binary-indep</literal>: creare una serie di pacchetti binari indipendenti dall'architettura (<literal>Architecture: all</literal>) nella directory padre. (richiesto)<placeholder type="footnote" id="0"/>
ja: <literal>binary-indep</literal> ターゲット: 親ディレクトリにアーキテクチャに依存しないパッケージ (<literal>Architecture: all</literal>) を作ります。(必須)<placeholder type="footnote" id="0"/>

source: <literal>get-orig-source</literal> target: to obtain the most recent version of the original source package from upstream archive site. (optional)
ca: <literal>get-orig-source</literal> (opcional): per determinar la versió més recent de les fonts originals des del magatzem de l'autor.
es: <literal>get-orig-source</literal> (opcional): para obtener la versión más reciente de las fuentes originales desde el lugar de almacenaje del autor.
fr: <literal>get-orig-source</literal> (optionnelle) : pour obtenir la dernière version du paquet source d'origine à partir du site de l'archive amont.
it: obiettivo <literal>get-orig-source</literal>: ottenere la versione più recente del pacchetto sorgente originale dal relativo sito. (optional)
ja: <literal>get-orig-source</literal> ターゲット: 上流アーカイブのサイトから最新のバージョンのソースパッケージを持ってきます。(任意)
