Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: For <literal>Architecture: any</literal> packages, the autobuilder system rebuild them. It ensures to install
ca: Els paquets del tipus <literal>Architecture: any</literal>, són construïts pel sistema de compilació automàtica. El sistema garanteix la instal·lació de:
es: Los paquetes del tipo <literal>Architecture: any</literal>, son construidos por el sistema de compilación automática. El sistema garantiza la instalación de:
fr: Les paquets « <literal>Architecture: any</literal> » sont reconstruits par les serveurs d'empaquetage automatique. Seront installés :
it: I pacchetti con <literal>Architecture: any</literal>, verranno ricostruiti dal sistema di auto-costruzione. Ci si assicuri di avere installato
ja: <literal>Architecture: any</literal>のパッケージは、オートビルダーシステムによって再構築されます。それは、

source: the <systemitem role="package">build-essential</systemitem> package, and
ca: el paquet <systemitem role="package">build-essential</systemitem>, i
es: el paquete <systemitem role="package">build-essential</systemitem>, y
fr: le paquet <systemitem role="package">build-essential</systemitem> ;
it: il pacchetto <systemitem role="package">build-essential</systemitem>, e
ja: <systemitem role="package">build-essential</systemitem>パッケージと

source: packages listed in the <literal>Build-Depends</literal> field (see <xref linkend="control"/> ).
ca: els paquets llistats en el camp <literal>Build-Depends</literal> (consulta <xref linkend="control"/> ).
es: los paquetes listados en el campo <literal>Build-Depends</literal> (véase <xref linkend="control"/> ).
fr: les paquets énumérés dans le champ <literal>Build-Depends</literal>, cf. <xref linkend="control"/> .

source: Then it issues the following command in the source directory:
ca: A continuació s'executa la següent ordre en el directori de les fonts:
es: A continuación se ejecuta la siguiente orden en el directorio de las fuentes:
fr: Ensuite, la commande suivante est exécutée dans le répertoire des sources :
it: Dopo si può eseguire il comando seguente nella directory dei sorgenti:
ja: そして、ソースディレクトリで次のコマンドを実行します:

source: This will do everything to make architecture dependent binary packages on another architecture. It will:
ca: D'aquest manera, s'executa tot el necessari per a la construcció del paquet binari depenent de l'arquitectura per a cada arquitectura. Fa el següent:
es: De esta manera, se ejecuta todo lo necesario para construir el paquete binario dependiente de la arquitectura en cada arquitectura. Hace lo siguiente:
fr: Ceci fera tout le nécessaire pour créer entièrement les paquets binaires dépendants de l'architecture sur l'architecture concernée :
it: Questo comando creerà i pacchetti binari e sorgenti al posto vostro. Eseguirà le seguenti operazioni:
ja: これは、別のアーキテクチャ上で、アーキテクチャ依存のバイナリパッケージを生成する作業をすべて行ってくれます。これには以下の作業が含まれます。

source: build architecture dependent binary packages (<literal>fakeroot debian/rules binary-arch</literal>)
ca: construeix el paquet binari per a l'arquitectura (<literal>fakeroot debian/rules binary-arch</literal>).
es: construye el paquete binario para la arquitectura (<literal>fakeroot debian/rules binary-arch</literal>)
fr: construction des paquets binaires dépendants de l'architecture (« <literal>fakeroot debian/rules binary-arch</literal> ») ;
it: costruirà il pacchetto binario per una specifica architettura (<literal>fakeroot debian/rules binary-arch</literal>)
ja: アーキテクチャ依存のバイナリパッケージを構築(<literal>fakeroot debian/rules binary-arch</literal>)

source: This is why you see your package for other architectures.
ca: Així, el paquet estarà disponible per a altres arquitectures.
es: Esta es la razón por la que el paquete estará disponible para otras arquitecturas.
fr: C'est pourquoi votre paquet est disponible sur plusieurs architectures.
it: È questo il motivo per il quale si vede il proprio pacchetto per altre architetture.
ja: あなたのパッケージが他のアーキテクチャ用にも存在するのは、このためです。

source: Unlike under the <systemitem role="package">pbuilder</systemitem> package, the <command>chroot</command> environment under the <systemitem role="package">sbuild</systemitem> package used by the autobuilder system does not force the minimal system and may leave many packages installed.
ca: A diferència a com funciona el paquet <systemitem role="package">pbuilder</systemitem> (que s'explicarà més endavant), l'entorn <command>chroot</command> del paquet <systemitem role="package">sbuild</systemitem> fet servir pel sistema automàtic no té una instal·lació mínima de paquets del sistema i pot deixar molts de paquets instal·lats.
es: Contrariamente a modo de funcionamiento del paquete <systemitem role="package">pbuilder</systemitem> (que se tratará más adelante), el entorno <command>chroot</command> del paquete <systemitem role="package">sbuild</systemitem> utilizado por el sistema automático no tiene una instalación mínima de paquetes del sistema y puede dejar muchos paquetes instalados.
fr: contrairement à celui du paquet <systemitem role="package">pbuilder</systemitem>, l'environnement <command>chroot</command> du paquet <systemitem role="package">sbuild</systemitem> utilisé par les serveurs d'empaquetage automatique n'est pas forcément minimal et plusieurs paquets peuvent rester installés.
it: Diversamente dal pacchetto <systemitem role="package">pbuilder</systemitem>, l'ambiente <command>chroot</command> sotto il pacchetto <systemitem role="package">sbuild</systemitem>, usato dal sistema di auto-costruzione, non forza la creazione di un sistema minimale, e potrebbe lasciare installati molti pacchetti.
ja: <systemitem role="package">pbuilder</systemitem>パッケージとは違い、オートビルダーによって使用される<systemitem role="package">sbuild</systemitem>パッケージ下での<command>chroot</command>環境では、最小構成を強制しないので、多くのパッケージがインストールされたままになるかもしれません。

source: Although packages listed in the <literal>Build-Depends-indep</literal> field are required to be installed for the normal packaging by us (see <xref linkend="completebuild"/> ), they are not required to be installed for the autobuilder system since it build only architecture dependent binary packages. <placeholder type="footnote" id="0"/> This difference between normal packaging and autobuilder situation dictates whether you record such required packages in the <literal>Build-Depends</literal> or <literal>Build-Depends-indep</literal> fields of the <filename>debian/control</filename> file (see <xref linkend="control"/> ).
ca: Encara que és necessari instal·lar els paquets llistats en el camp <literal>Build-Depends-indep</literal> per a la construcció de paquets normal (consulta <xref linkend="completebuild"/> ), el sistema automàtic de construcció no ho requereix degut a què només construeix paquets binaris dependents de l'arquitectura <placeholder type="footnote" id="0"/>. Aquestes diferències entre l'empaquetament normal i l'automàtic determinen si els paquets requerits per a la compilació s'han de llistar en el camp <literal>Build-Depends</literal> o en el camp <literal>Build-Depends-indep</literal> del fitxer <filename>debian/control</filename> (consulta <xref linkend="control"/> ).
es: Aunque es necesario instalar los paquetes listados en el campo <literal>Build-Depends-indep</literal> para el empaquetamiento normal (véase <xref linkend="completebuild"/> ), el sistema automático de construcción no lo requiere puesto que solo construye paquetes binarios dependientes de la arquitectura <placeholder type="footnote" id="0"/>. Estas diferencias entre el empaquetamiento normal y el automático determinan si los paquetes requeridos para la compilación se deben listar en el campo <literal>Build-Depends</literal> o bien en el campo <literal>Build-Depends-indep</literal> del archivo <filename>debian/control</filename> (véase <xref linkend="control"/> ).
fr: Bien qu'il soit nécessaire d'installer les paquets énumérés dans le champ <literal>Build-Depends-indep</literal> pour l'empaquetage normal (cf. <xref linkend="completebuild"/> ), il n'est pas nécessaire de les installer sur le serveur d'empaquetage automatique puisqu'il ne construit que les paquets binaires dépendants de l'architecture. <placeholder type="footnote" id="0"/> Cette différence entre l'empaquetage normal et celui des serveurs d'empaquetage automatique permet de déterminer si les paquets doivent être énumérés dans le champ <literal>Build-Depends</literal> ou <literal>Build-Depends-indep</literal> du fichier <filename>debian/control</filename>, cf. <xref linkend="control"/> .

source: Including <filename>orig.tar.gz</filename> for upload
ca: Incloure el fitxer <filename>orig.tar.gz</filename> per a la transferència del paquet al repositori.
es: Incluir <filename>orig.tar.gz</filename> para la transferencia del paquete al repositorio.
fr: Inclusion de <filename>orig.tar.gz</filename> pour l'envoi
it: Includere <filename>orig.tar.gz</filename> per il caricamento.
ja: アップロード用<filename>orig.tar.gz</filename>の内容

source: When you first upload the package to the archive, you need to include the original <filename>orig.tar.gz</filename> source. If the last changelog entry is not the first one for the given upstream version, you must provide <command>dpkg-buildpackage</command> command with the <literal>-sa</literal> option. On the other hand, the <literal>-sd</literal> option will force to exclude the original <filename>orig.tar.gz</filename> source.
fr: Lors du premier envoi d'un paquet vers l'archive, il faut inclure les sources <filename>orig.tar.gz</filename> d'origine. Si la dernière entrée du journal de modification n'est pas la première pour cette version amont, vous devez passer l'option « <literal>-sa</literal> » à la commande <command>dpkg-buildpackage</command>. D'un autre côté, l'option « <literal>-sd</literal> » forcera l'exclusion des sources <filename>orig.tar.gz</filename> originales.

source: You can automate package build process of the <command>dpkg-buildpackage</command> command further with the <command>debuild</command> command. See <citerefentry> <refentrytitle>debuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ca: Pots automatitzar encara més el procés de construcció de paquets de <command>dpkg-buildpackage</command> amb l'ordre <command>debuild</command>. Consulta <citerefentry> <refentrytitle>debuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
es: Puedes automatizar aún más el proceso de construcción de paquetes de la orden <command>dpkg-buildpackage</command> con la orden <command>debuild</command>. Veáse <citerefentry> <refentrytitle>debuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
fr: Vous pouvez automatiser encore plus le processus de construction de la commande <command>dpkg-buildpackage</command> avec la commande <command>debuild</command>, cf. <citerefentry> <refentrytitle>debuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
it: È possibile automatizzare ulteriormente il processo di creazione del pacchetto, eseguito con il comando <command>dpkg-buildpackage</command>, utilizzando il comando <command>debuild</command>. Vedere <citerefentry> <refentrytitle>debuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ja: <command>dpkg-buildpackage</command>による自動構築プロセスは、<command>debuild</command>によりさらに進めることができます。詳しくは<citerefentry> <refentrytitle>debuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>を参照してください。

source: Customization of the <command>debuild</command> command can be done through <filename>/etc/devscripts.conf</filename> or <filename>~/.devscripts</filename>. I would suggest at least following items:
ca: La personalització de l'ordre <command>debuild</command> pot fer-se mitjançant els fitxers <filename>/etc/devscripts.conf</filename> o <filename>~/.devscripts</filename>. Et suggereixo almenys els següents valors:
fr: La configuration de la commande <command>debuild</command> peut être faite via <filename>/etc/devscript.conf</filename> ou <filename>~/.devscript</filename>. Les entrées suivantes sont suggérées :
it: La configurazione del comando <command>debuild</command> può essere fatta usando <filename>/etc/devscripts.conf</filename> o <filename>~/.devscripts</filename>. Ecco alcune impostazioni consigliate:
ja: <command>debuild</command>コマンドのカスタマイズは<filename>/etc/devscripts.conf</filename>や<filename>~/.devscripts</filename>を用いて行います。少なくとも以下の設定をすると良いでしょう。

source: DEBSIGN_KEYID=Your_GPG_keyID DEBUILD_LINTIAN=yes DEBUILD_LINTIAN_OPTS=-i -I --show-overrides
ca: DEBSIGN_KEYID=La_teva_ID_de_la_clau_GPG DEBUILD_LINTIAN=yes DEBUILD_LINTIAN_OPTS=-i -I --show-overrides
es: DEBSIGN_KEYID=Tu_ID_clave_GPG DEBUILD_LINTIAN=yes DEBUILD_LINTIAN_OPTS=-i -I --show-overrides
fr: DEBSIGN_KEYID=Votre_ID_cle_GPG DEBUILD_LINTIAN=yes DEBUILD_LINTIAN_OPTS=-i -I --show-overrides
it: DEBSIGN_KEYID=ID_della_vostra_chiave_GPG DEBUILD_LINTIAN=yes DEBUILD_LINTIAN_OPTS=-i -I --show-overrides

source: With these, packages are signed by your specified GPG key ID (good for sponsoring packages) and checked by the <command>lintian</command> command in details.
ca: Amb aquesta configuració pots construir paquets sempre amb la teva clau GPG, evitant incloure components no desitjats (i facilitant el patrocini del paquet) i la inspecció del paquet amb l'ordre <command>lintian</command> en el mode detallat.
es: Con estos valores, puedes construir paquetes siempre con tu clave GPG, evitando incluir componentes no deseados (facilitará que te patrocinen el paquete), e inspeccionar el paquete con la orden <command>lintian</command> en el modo detallado.
fr: Ainsi, les paquets seront signés avec votre identifiant de clé GPG (bon pour les paquets parrainés) et vérifiés avec la commande <command>lintian</command> en détail.
it: Con queste impostazioni, i pacchetti saranno firmati usando la chiave GPG con l'ID specificato (questo è utile per le sponsorizzazioni) e controllati con il programma <command>lintian</command> in modo dettagliato.
ja: これによって、パッケージは常にあなたのGPG鍵でサインされ、<command>lintian</command>コマンドで詳細にチェックされます。（これはスポンサーの作業にも適しています。）

source: Cleaning source and rebuilding package from a user account is as simple as:
ca: Per exemple, netejar el codi i reconstruir el paquet des d'un compte d'usuari és tan simple com:
es: Por ejemplo, limpiar el código y reconstruir el paquete desde una cuenta de usuario es tan simple como:
fr: Le nettoyage des sources et la reconstruction du paquet avec un compte utilisateur est aussi simple que :
it: Per esempio, si può ripulire i sorgenti e ricreare il pacchetto da un account utente, con:
ja: 以下のように一般ユーザアカウントから、簡単にソースを除去しパッケージを再ビルドできます。

source: Please note that the <command>dpkg-buildpackage</command> option <literal>-sa</literal> to include the original <filename>orig.tar.gz</filename> source can be specified as:
ca: Per incloure el fitxer de les fonts originals (per a què s'executi <command>dpkg-buildpackage</command> amb l'opció <literal>-sa</literal>) <filename>orig.tar.gz</filename> hauràs d'executar el següent:
es: Tenga en cuenta que puede especificar la opción «<literal>-sa</literal>» de <command>dpkg-buildpackage</command> para incluir el fichero original <filename>orig.tar.gz</filename> como sigue:
fr: Remarquez que le paramètre « <literal>-sa</literal> » de <command>dpkg-buildpackage</command> pour intégrer les sources d'origine <filename>orig.tar.gz</filename> peut être précisé :
it: Si noti che il programma <command>dpkg-buildpackage</command> eseguito con l'opzione <literal>-sa</literal>, può includere il sorgente originale <filename>orig.tar.gz</filename>, eccone un esempio:
ja: <command>dpkg-buildpackage</command>に<literal>-sa</literal>オプションを付けてオリジナルの<filename>orig.tar.gz</filename>ソースファイルを含める方法も覚えておきましょう。

source: You can clean source tree as simple as:
ca: Pots eliminar els fitxers generats en la compilació executant:
es: Puedes eliminar los archivos generados en la compilación ejecutando:
fr: Le nettoyage de l'arborescence des sources est aussi simple que :
it: È possibile ripulire l'albero dei sorgenti con:
ja: ソースツリーの掃除も簡単です。

source: Since the <systemitem role="package">pbuilder</systemitem> package is still evolving, you have to check the actual configuration situation by consulting the latest official documentation.
es: Dado que el paquete <systemitem role="package">pbuilder</systemitem> está evolucionando, deberías comprobar la situación de la configuración consultando la última documentación oficial disponible.
fr: Comme le paquet <systemitem role="package">pbuilder</systemitem> est en constante évolution, vous devez vérifier les possibilités réelles de la configuration en consultant la dernière documentation officielle.
it: <systemitem role="package">pbuilder</systemitem> è ancora in evoluzione, si dovrebbe controllare l'attuale configurazione consultando la documentazione ufficiale più recente.
ja: <systemitem role="package">pbuilder</systemitem>パッケージはまだ進化の過程なので、実際の構成は、公式ドキュメントで確認して下さい。

source: For a clean room (<command>chroot</command>) build environment to verify the build dependencies, the <systemitem role="package">pbuilder</systemitem> package is very useful. <placeholder type="footnote" id="0"/> This ensures a clean build from the source under the <literal>sid</literal> auto-builder for different architectures and avoids the severity serious FTBFS (Fails To Build From Source) bug which is always in the RC (release critical) category. See <ulink url="&buildd-do;">&buildd-do;</ulink> for more on the Debian package auto-builder.
fr: Pour un environnement de construction propre (<command>chroot</command>) permettant de vérifier les dépendances de construction, <systemitem role="package">pbuilder</systemitem> est très utile. <placeholder type="footnote" id="0"/> Cela garantit une construction propre des sources en construction automatique sous <literal>sid</literal> pour différentes architectures et évite l'erreur de gravité sérieuse FTBFS (« Fails To Build From Source » pour les échecs de construction à partir du paquet source), qui est toujours en catégorie RC (« Release Critical », bloquant la publication). Voir <ulink url="&buildd-do;">&buildd-do;</ulink> pour plus d'informations sur le constructeur automatique de paquet Debian.

source: Let's customize the <systemitem role="package">pbuilder</systemitem> package by the following.
ca: És possible personalitzar el funcionament del paquet <systemitem role="package">pbuilder</systemitem> en els següents aspectes:
es: Para personalizar el funcionamiento del paquete <systemitem role="package">pbuilder</systemitem> haz lo siguiente:
fr: Le paquet <systemitem role="package">pbuilder</systemitem> est personnalisable de la manière suivante :
it: Si configuri il pacchetto <systemitem role="package">pbuilder</systemitem> come segue.
ja: それでは、<systemitem role="package">pbuilder</systemitem>をカスタマイズしてみましょう。

source: setting <filename>/var/cache/pbuilder/result</filename> directory writable by the user.
ca: permet que el teu usuari tengui permís d'escriptura en el directori <filename>/var/cache/pbuilder/result</filename>.
es: permite que tu usuario del sistema tenga permiso de escritura en el directorio <filename>/var/cache/pbuilder/result</filename>.
fr: configuration du répertoire <filename>/var/cache/pbuilder/result</filename> accessible en écriture pour l'utilisateur ;
it: impostare il permesso di scrittura per l'utente alla directory <filename>/var/cache/pbuilder/result</filename>.
ja: <filename>/var/cache/pbuilder/result</filename>ディレクトリを、ユーザーから書き込めるように設定してください。

source: creating a directory, e.g. <filename><replaceable>/var/cache/pbuilder/hooks</replaceable></filename>, writable by the user to place hook scripts.
ca: genera un directori, p. ex. <filename><replaceable>/var/cache/pbuilder/hooks</replaceable></filename>, amb permís d'escriptura per al teu usuari. En aquest directori posaràs els guions «hook».
es: crea un directorio, p.e. <filename><replaceable>/var/cache/pbuilder/hooks</replaceable></filename>, con permiso de escritura para tu usuario. En este directorio pondrás los guiones «hook»
fr: création d'un répertoire, par exemple <filename><replaceable>/var/cache/pbuilder/hooks</replaceable></filename>, accessible en écriture pour l'utilisateur pour y placer ses scripts hook ;
it: creare una directory, ad es. <filename><replaceable>/var/cache/pbuilder/hooks</replaceable></filename>, con i permessi di scrittura per l'utente per potergli inserire degli script di hook.
ja: フックスクリプトを置くために、ユーザーからの書き込みが可能なディレクトリを作成してください。例） <filename><replaceable>/var/cache/pbuilder/hooks</replaceable></filename>

source: setting <filename>~/.pbuilderrc</filename> or <filename>/etc/pbuilderrc</filename> to include as follows.
ca: Estableix els fitxers <filename>~/.pbuilderrc</filename> o <filename>/etc/pbuilderrc</filename> amb el següent contingut:
es: establece los archivos <filename>~/.pbuilderrc</filename> o <filename>/etc/pbuilderrc</filename> con el siguiente contenido:
fr: configuration de <filename>~/.pbuilderrc</filename> ou <filename>/etc/pbuilderrc</filename> pour intégrer :
it: configurare il file <filename>~/.pbuilderrc</filename> o <filename>/etc/pbuilderrc</filename> in modo che includa le seguenti righe.
ja: <filename>~/.pbuilderrc</filename> か <filename>/etc/pbuilderrc</filename> に以下のように設定します。

source: This will allow you to sign generated packages with your secret GPG key in the <filename>~/.gnupg/</filename> directory.
ca: Així signaràs els paquets amb la teva clau GPG emmagatzemada en el directori <filename>~/.gnupg/</filename>.
es: Así podrás firmar los paquetes con tu clave GPG almacenada en el directorio <filename>~/.gnupg/</filename>.
fr: Les paquets créés seront alors signés avec votre clé GPG du répertoire <filename>~/.gnupg/</filename>.
it: Questo permetterà di firmare i pacchetti generati con la tua chiave GPG segreta situata nella directory <filename>~/.gnupg/</filename>.
ja: これにより、<filename>~/.gnupg/</filename>ディレクトリにある、あなたのGPGキーで生成されたパッケージへの署名を許可します。

source: Let's then initialize the local <systemitem role="package">pbuilder</systemitem> <command>chroot</command> system first as follows.
ca: Ara pots inicialitzar el sistema local <systemitem role="package">pbuilder</systemitem> <command>chroot</command> per primera vegada executant:
es: Ahora puedes inicializar el sistema local <systemitem role="package">pbuilder</systemitem> <command>chroot</command> por primera vez ejecutando:
fr: Le système <command>chroot</command> local de <systemitem role="package">pbuilder</systemitem> doit d'abord être initialisé :
it: Si avvii <systemitem role="package">pbuilder</systemitem> per costruire l'ambiente <command>chroot</command> locale, come segue.
ja: それでは、初めてのローカル<systemitem role="package">pbuilder</systemitem> <command>chroot</command> システムを初期化しましょう。
