Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: Changes to some auto-generated files by Autotools such as <filename>missing</filename>, <filename>aclocal.m4</filename>, <filename>config.guess</filename>, <filename>config.h.in</filename>, <filename>config.sub</filename>, <filename>configure</filename>, <filename>depcomp</filename>, <filename>install-sh</filename>, <filename>ltmain.sh</filename>, and <filename>Makefile.in</filename> may be ignored. You may erase them before running <command>diff</command> to the source for inspection.
ca: Les modificacions realitzades en els fitxers generats per «Autotools» (<filename>missing</filename>, <filename>aclocal.m4</filename>, <filename>config.guess</filename>, <filename>config.h.in</filename>, <filename>config.sub</filename>, <filename>configure</filename>, <filename>depcomp</filename>, <filename>install-sh</filename>, <filename>ltmain.sh</filename> i <filename>Makefile.in</filename>) pots ignorar-les. Fins i tot pots eliminar-los abans d'executar <command>diff</command> en les fonts per inspeccionar-les.
es: Las modificaciones realizadas en los archivos generados por «Autotools» (<filename>missing</filename>, <filename>aclocal.m4</filename>, <filename>config.guess</filename>, <filename>config.h.in</filename>, <filename>config.sub</filename>, <filename>configure</filename>, <filename>depcomp</filename>, <filename>install-sh</filename>, <filename>ltmain.sh</filename> y <filename>Makefile.in</filename>) puedes ignorarlas. Puedes eliminarlos antes de ejecutar <command>diff</command> en las fuentes para inspeccionarlas.
fr: Les modifications de certains fichiers automatiquement créés par Autotools comme <filename>missing</filename>, <filename>aclocal.m4</filename>, <filename>config.guess</filename>, <filename>config.h.in</filename>, <filename>config.sub</filename>, <filename>configure</filename>, <filename>depcomp</filename>, <filename>install-sh</filename>, <filename>ltmain.sh</filename> et <filename>Makefile.in</filename> peuvent être ignorées. Vous pouvez les effacer avant d'exécuter <command>diff</command> pour examiner les sources.
it: I cambiamenti effettuati ad alcuni file generati automaticamente dagli Autotools come <filename>missing</filename>, <filename>aclocal.m4</filename>, <filename>config.guess</filename>, <filename>config.h.in</filename>, <filename>config.sub</filename>, <filename>configure</filename>, <filename>depcomp</filename>, <filename>install-sh</filename>, <filename>ltmain.sh</filename>, e <filename>Makefile.in</filename> possono essere ignorati. Possono anzi venire cancellati prima di eseguire <command>diff</command> per controllare i sorgenti.
ja: <filename>missing</filename> や <filename>aclocal.m4</filename> や <filename>config.guess</filename> や <filename>config.h.in</filename> や <filename>config.sub</filename> や <filename>configure</filename> や <filename>depcomp</filename> や <filename>install-sh</filename> や <filename>ltmain.sh</filename> や <filename>Makefile.in</filename> 等の Autotools によって自動生成されるファイルへの変更は無視していい場合があります。ソースを検査するための <command>diff</command> を実行する前に消去してもいいです。

source: New upstream release
ca: Nova versió del programa font.
es: Nueva versión del programa fuente
fr: Nouvelle version amont
it: Nuova distribuzione
ja: 上流ソフトウェアの新版更新

source: If a package <systemitem role="package"><replaceable>foo</replaceable></systemitem> is packaged in the old <literal>1.0</literal> format, this can be done by running <literal>zcat /<replaceable>path</replaceable>/<replaceable>to</replaceable>/<replaceable>foo</replaceable>_<replaceable>oldversion</replaceable>.diff.gz|patch -p1</literal> in the new extracted source, instead.
fr: Si un paquet <systemitem role="package"><replaceable>toto</replaceable></systemitem> est empaqueté avec l'ancien format <literal>1.0</literal>, ce peut plutôt être réalisé en exécutant « <literal>zcat /<replaceable>chemin</replaceable>/<replaceable>vers</replaceable>/<replaceable>toto</replaceable>_<replaceable>ancienneversion</replaceable>.diff.gz|patch -p1</literal> » depuis la nouvelle arborescence source décompressée.
it: Se un pacchetto <systemitem role="package"><replaceable>foo</replaceable></systemitem> è stato pacchettizzato nel vecchio formato <literal>1.0</literal>, si deve invece eseguire <literal>zcat /<replaceable>path</replaceable>/<replaceable>to</replaceable>/<replaceable>foo</replaceable>_<replaceable>oldversion</replaceable>.diff.gz|patch -p1</literal> nella nuova directory sorgente scompattata.
ja: もしパッケージ <systemitem role="package"><replaceable>foo</replaceable></systemitem> が旧 <literal>1.0</literal> フォーマットでパッケージされている場合は、新規に展開されたソース中で <literal>zcat /<replaceable>path</replaceable>/<replaceable>to</replaceable>/<replaceable>foo</replaceable>_<replaceable>oldversion</replaceable>.diff.gz|patch -p1</literal> を実行すれば出来ます。

source: If a package <systemitem role="package"><replaceable>foo</replaceable></systemitem> is properly packaged in the newer <literal>3.0 (native)</literal> or <literal>3.0 (quilt)</literal> formats, packaging a new upstream version is essentially moving the old <filename>debian</filename> directory to the new source. This can be done by running <literal>tar xvzf /<replaceable>path</replaceable>/<replaceable>to</replaceable>/<replaceable>foo</replaceable>_<replaceable>oldversion</replaceable>.debian.tar.gz</literal> in the new extracted source. <placeholder type="footnote" id="0"/> Of course, you need to do few obvious chores.
fr: Si un paquet <systemitem role="package"><replaceable>toto</replaceable></systemitem> est correctement empaqueté au nouveau format <literal>3.0 (native)</literal> ou <literal>3.0 (quilt)</literal>, empaqueter une nouvelle version amont consiste essentiellement à déplacer l'ancien répertoire <filename>debian</filename> dans les nouvelles sources. Ce peut être réalisé en exécutant « <literal>tar xvzf /<replaceable>chemin</replaceable>/<replaceable>vers</replaceable>/<replaceable>toto</replaceable>_<replaceable>ancienneversion</replaceable>.debian.tar.gz</literal> » depuis la nouvelle arborescence source décompressée. <placeholder type="footnote" id="0"/> Bien sûr, vous devez vous occuper de quelques routines évidentes :
it: Se un pacchetto <systemitem role="package"><replaceable>foo</replaceable></systemitem> è stato impacchettato correttamente nei nuovi formati <literal>3.0 (native)</literal> o <literal>3.0 (quilt)</literal>, si rende necessario impacchettare anche la versione originale muovendo la directory <filename>debian</filename> nella nuova sorgente. Questo può essere fatto eseguendo <literal>tar xvzf /<replaceable>path</replaceable>/<replaceable>to</replaceable>/<replaceable>foo</replaceable>_<replaceable>oldversion</replaceable>.debian.tar.gz</literal> nella nuova directory sorgente scompattata. <placeholder type="footnote" id="0"/> Ovviamente bisognerà effettuare alcuni passaggi.
ja: もし <systemitem role="package"><replaceable>foo</replaceable></systemitem> パッケージが新規の <literal>3.0 (native)</literal> や <literal>3.0 (quilt)</literal> フォーマットで適正にパッケージされていれば、新規のアップストリームバージョンをパッケージスリのは基本的に旧 <filename>debian</filename> ディレクトリを新規ソースへと移動するのみです。これは新規に展開されたソース中で <literal>tar xvzf /<replaceable>path</replaceable>/<replaceable>to</replaceable>/<replaceable>foo</replaceable>_<replaceable>oldversion</replaceable>.debian.tar.gz</literal> を実行すれば出来ます。<placeholder type="footnote" id="0"/> もちろん当然するべき雑用をする必要があります。

source: Create a copy of upstream source as the <filename>foo_<replaceable>newversion</replaceable>.tar.gz</filename> file.
ca: Comprimir les fonts originals en el fitxer <filename>nom_paquet_<replaceable>número_nova_versió</replaceable>.tar.gz</filename>.
es: Comprimir las fuentes originales en el archivo <filename>nombre_del_paquete_<replaceable>nueva_versión</replaceable>.tar.gz</filename>.
fr: création d'une copie des sources amont dans un fichier <filename>toto_<replaceable>nouvelleversion</replaceable>.tar.gz</filename> ;
it: Creare una copia della sorgente originale nel file <filename>foo_<replaceable>newversion</replaceable>.tar.gz</filename>.
ja: アップストリームソースのコピーを <filename>foo_<replaceable>newversion</replaceable>.tar.gz</filename> ファイルとして作成します。

source: Update the Debian <filename>changelog</filename> file with <literal>dch -v <replaceable>newversion</replaceable>-<replaceable>1</replaceable></literal>.
ca: Actualitzar el fitxer <filename>changelog</filename> del directori «debian» executant <literal>dch -v <replaceable>número_nova_versió</replaceable>-<replaceable>1</replaceable></literal>.
es: Actualizar el archivo <filename>changelog</filename> Debian ejecutando <literal>dch -v <replaceable>nueva_versión</replaceable>-<replaceable>1</replaceable></literal> .
fr: mise à jour du ficher <filename>changelog</filename> Debian avec « <literal>dch -v <replaceable>nouvelleversion</replaceable>-<replaceable>1</replaceable></literal> » :
it: Aggiornare il file di <filename>changelog</filename> Debian con <literal>dch -v <replaceable>newversion</replaceable>-<replaceable>1</replaceable></literal>.
ja: Debian の <filename>changelog</filename> ファイルを <literal>dch -v <replaceable>newversion</replaceable>-<replaceable>1</replaceable></literal> を使って更新します。

source: Add an entry with New upstream release.
es: Añade una nueva linea con el texto «New upstream release» para indicar que se trata de una nueva versión de las fuentes originales.
fr: ajout d'une entrée avec « New upstream release. » (nouvelle version amont) ;

source: Describe concisely the changes <emphasis>in the new upstream release</emphasis> that fix reported bugs and close those bugs.
es: Describe sucintamente los cambios realizados <emphasis>en las fuentes originales por el autor</emphasis> que solucionan errores informados y cerrar los informes .
fr: description succincte des modifications <emphasis>dans la nouvelle version amont</emphasis> qui règlent des bogues et ferment les rapports associés ;

source: Describe concisely the changes <emphasis>to the new upstream release</emphasis> by the maintainer that fix reported bugs and close those bugs.
es: Describe sucintamente los cambios de la <emphasis>nueva versión</emphasis> del desarrollador que solucionan errores previamente reportados y cierra dichos errores.
fr: description succincte des modifications <emphasis>à la nouvelle version amont</emphasis> par le responsable qui règlent des bogues et ferment les rapports associés ;

source: <literal>while quilt push; do quilt refresh; done</literal> to apply all patches while removing <emphasis>fuzz</emphasis>.
fr: application de tous les correctifs en enlevant les approximations (« <emphasis>fuzz</emphasis> ») : « <literal>while quilt push; do quilt refresh; done</literal> ».

source: If the patch/merge did not apply cleanly, inspect the situation (clues are left in <filename>.rej</filename> files).
ca: Si les modificacions no s'executen correctament, inspecciona la situació (mira la informació dels fitxers <filename>.rej</filename>) com segueix:
es: Si las modificaciones no se ejecutan correctamente, inspecciona la situación (mira la información de los archivos <filename>.rej</filename>) como se muestra a continuación.
fr: Si la fusion des correctifs ne s'applique pas proprement, examinez la situation (des indices sont laissés dans les fichiers <filename>.rej</filename>) :
it: Se la patch/merge non è stata applicata in maniera corretta, si controlli la situazione (gli indizi vengono lasciati nei file <filename>.rej</filename>).
ja: もしパッチやマージがクリーンに適用できない場合は、状況を精査します (<filename>.rej</filename> ファイル中にヒントがあります)。

source: If a patch you applied to the source was integrated to the upstream source,
ca: Si un dels pegats aplicats està integrat en les fonts originals:
es: Si uno de los parches aplicados está integrado en las fuentes originales,
fr: si un correctif appliqué aux sources a été intégré aux sources amont :
it: Se una patch applicata alla sorgente è stata integrata nei sorgenti originali,
ja: もしソースにあなたが適用していたパッチがアップストリームソースに統合された場合は、

source: <literal>quilt delete</literal> to remove it.
es: ejecuta <literal>quilt delete</literal> para eliminarlo.
fr: « <literal>quilt delete</literal> » pour l'enlever ;

source: If a patch you applied to the source conflicted with new changes in the upstream source,
ca: Si un dels pegats entra en conflicte amb els canvis realitzats per l'autor en les fonts originals:
es: Si uno de los parches entra en conflicto con los cambios realizados por el autor en las fuentes originales,
fr: si un correctif appliqué aux sources entre en confit avec les nouvelles modifications des sources amont :
it: Se una patch applicata alla sorgente è andata in conflitto con i nuovi cambiamenti nei sorgenti originali,
ja: もしソースにあなたが適用していたパッチが新規アップストリームソースとぶつかる場合は、

source: Edit the <filename><replaceable>baz</replaceable></filename> file manually to realize intended effect of <filename><replaceable>baz</replaceable>.rej</filename>.
ca: Edita els fitxers <filename><replaceable>truc</replaceable>.rej</filename> manualment per saber l'efecte que es pretén amb <filename><replaceable>truc</replaceable>.rej</filename>.
es: Edita los archivos <filename><replaceable>rechazo</replaceable>.rej</filename> manualmente para saber el efecto que se pretende con <filename><replaceable>rechazo</replaceable>.rej</filename>.
fr: édition manuelle du fichier <filename><replaceable>truc</replaceable></filename> pour obtenir le résultat attendu de <filename><replaceable>truc</replaceable>.rej</filename> ;
it: Modificare manualmente il file <filename><replaceable>baz</replaceable></filename> per applicare gli effetti desiderati presenti nel file <filename><replaceable>baz</replaceable>.rej</filename>.
ja: <filename><replaceable>baz</replaceable>.rej</filename> の本来目指した効果を実現するように、<filename><replaceable>baz</replaceable></filename> ファイルを手動で編集します。

source: <literal>quilt refresh</literal> to update the patch.
es: Ejecuta <literal>quilt refresh</literal> para actualizar el parche.
fr: « <literal>quilt refresh</literal> » pour mettre à jour le correctif ;

source: Continue back to <literal>while quilt push; do quilt refresh; done</literal>.
es: Continua hasta la ejecución de <literal>while quilt push; do quilt refresh; done</literal>.
fr: continuer jusqu'à « <literal>while quilt push; do quilt refresh; done</literal> ».

source: This process can be automated using the <citerefentry> <refentrytitle>uupdate</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> command as follows:
ca: Pots automatitzar aquest procés fent servir l'ordre <citerefentry> <refentrytitle>uupdate</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> como segueix:
es: Puedes automatizar este proceso utilizando la orden <citerefentry> <refentrytitle>uupdate</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> como sigue:
fr: Cette méthode peut être automatisé avec <citerefentry> <refentrytitle>uupdate</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> :
it: Questo processo può essere automatizzato utilizzando il comando <citerefentry> <refentrytitle>uupdate</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> come segue:
ja: このプロセスは <citerefentry> <refentrytitle>uupdate</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> コマンドを以下のように使うことで自動化できます:

source: $ apt-get source <replaceable>foo</replaceable> ... dpkg-source: info: extracting <replaceable>foo</replaceable> in <replaceable>foo</replaceable>-<replaceable>oldversion</replaceable> dpkg-source: info: unpacking <replaceable>foo</replaceable>_<replaceable>oldversion</replaceable>.orig.tar.gz dpkg-source: info: applying <replaceable>foo</replaceable>_<replaceable>oldversion</replaceable>-1.debian.tar.gz $ ls -F <replaceable>foo</replaceable>-<replaceable>oldversion</replaceable>/ <replaceable>foo</replaceable>_<replaceable>oldversion</replaceable>-1.debian.tar.gz <replaceable>foo</replaceable>_<replaceable>oldversion</replaceable>-1.dsc <replaceable>foo</replaceable>_<replaceable>oldversion</replaceable>.orig.tar.gz $ wget http://example.org/<replaceable>foo</replaceable>/<replaceable>foo</replaceable>-<replaceable>newversion</replaceable>.tar.gz $ cd <replaceable>foo</replaceable>-<replaceable>oldversion</replaceable> $ uupdate -v <replaceable>newversion</replaceable> ../<replaceable>foo</replaceable>-<replaceable>newversion</replaceable>.tar.gz $ cd ../<replaceable>foo</replaceable>-<replaceable>newversion</replaceable> $ while quilt push; do quilt refresh; done $ dch ... document changes made
es: $ apt-get source <replaceable>nombre_del_paquete</replaceable> ... dpkg-source: info: extracting <replaceable>nombre_del_paquete</replaceable> in <replaceable>nombre_del_paquete</replaceable>-<replaceable>versión_anterior</replaceable> dpkg-source: info: unpacking <replaceable>nombre_del_paquete</replaceable>_<replaceable>versión_anterior</replaceable>.orig.tar.gz dpkg-source: info: applying <replaceable>nombre_del_paquete</replaceable>_<replaceable>versión_anterior</replaceable>-1.debian.tar.gz $ ls -F <replaceable>nombre_del_paquete</replaceable>-<replaceable>versión_anterior</replaceable>/ <replaceable>nombre_del_paquete</replaceable>_<replaceable>versión_anterior</replaceable>-1.debian.tar.gz <replaceable>nombre_del_paquete</replaceable>_<replaceable>versión_anterior</replaceable>-1.dsc <replaceable>nombre_del_paquete</replaceable>_<replaceable>versión_anterior</replaceable>.orig.tar.gz $ wget http://ejemplo.org/<replaceable>nombre_del_paquete</replaceable>/<replaceable>nombre_del_paquete</replaceable>-<replaceable>nueva_versión</replaceable>.tar.gz $ cd <replaceable>nombre_del_paquete</replaceable>-<replaceable>versión_anterior</replaceable> $ uupdate -v <replaceable>nueva_versión</replaceable> ../<replaceable>nombre_del_paquete</replaceable>-<replaceable>nueva_versión</replaceable>.tar.gz $ cd ../<replaceable>nombre_del_paquete</replaceable>-<replaceable>nueva_versión</replaceable> $ while quilt push; do quilt refresh; done $ dch ... documenta las modificaciones realizadas
fr: $ apt-get source <replaceable>foo</replaceable> ... dpkg-source: info: extraction de <replaceable>toto</replaceable> dans <replaceable>toto</replaceable>-<replaceable>ancienneversion</replaceable> dpkg-source: info: extraction de <replaceable>toto</replaceable>_<replaceable>ancienneversion</replaceable>.orig.tar.gz dpkg-source: info: extraction de <replaceable>toto</replaceable>_<replaceable>ancienneversion</replaceable>-1.debian.tar.gz $ ls -F <replaceable>toto</replaceable>-<replaceable>ancienneversion</replaceable>/ <replaceable>toto</replaceable>_<replaceable>ancienneversion</replaceable>-1.debian.tar.gz <replaceable>toto</replaceable>_<replaceable>ancienneversion</replaceable>-1.dsc <replaceable>toto</replaceable>_<replaceable>ancienneversion</replaceable>.orig.tar.gz $ wget http://example.org/<replaceable>toto</replaceable>/<replaceable>toto</replaceable>-<replaceable>nouvelleversion</replaceable>.tar.gz $ cd <replaceable>toto</replaceable>-<replaceable>ancienneversion</replaceable> $ uupdate -v <replaceable>nouvelleversion</replaceable> ../<replaceable>toto</replaceable>-<replaceable>nouvelleversion</replaceable>.tar.gz $ cd ../<replaceable>toto</replaceable>-<replaceable>nouvelleversion</replaceable> $ while quilt push; do quilt refresh; done $ dch ... documentation des modifications réalisées

source: You can release this updated source by repeating what you did in <xref linkend="completebuild"/> , <xref linkend="checkit"/> , and <xref linkend="upload"/> .
ca: Pots fer el llançament de l'actualització del paquet repetint el que s'ha explicat en <xref linkend="completebuild"/> , <xref linkend="checkit"/> <xref linkend="upload"/> .
es: Puedes liberar la nueva versión del paquete repitiendo lo expuesto en <xref linkend="completebuild"/> , <xref linkend="checkit"/> y <xref linkend="upload"/> .
fr: Vous pouvez publier ces sources mises à jour en recommençant ce qui a été fait en <xref linkend="completebuild"/> , <xref linkend="checkit"/> et <xref linkend="upload"/> .

source: Updating the packaging style
ca: Actualitzar el format del paquet.
es: Actualizar el formato del paquete
fr: Mise à jour du style d'empaquetage
it: Aggiornare lo stile di pacchettizzazione
ja: パッケージ化スタイルの更新

source: If your sponsor or other maintainers object to updating the existing packaging style, it is not worth bothering nor arguing. There are more important things to do.
ca: Si la persona que patrocina el teu paquet o altres desenvolupadors fan objeccions a l'actualització del format del paquet, no val la pena entossudir-se a argumentar a favor. Hi ha altres coses més importants que atendre.
es: Si quien patrocina tu paquete u otros desarrolladores hacen objeciones a la actualización del formato del paquete, no vale la pena empeñarse en argumentar a favor. Hay otras cosas más importantes que atender.
fr: Si votre parrain ou d'autres responsables s'opposent à la mise à jour du style d'empaquetage existant, ça ne vaut pas la peine de s'embêter à argumenter. Il y a des choses plus importantes à faire.
it: Se il proprio sponsor o altri manutentori non ritengono sia necessario aggiornare lo stile del pacchetto, allora non vale la pena impegnarcisi. Ci sono cose più importanti da fare.
ja: もしあなたのスポンサーや他のメンテナが既存のパッケージスタイル更新に異存がある場合には、更新することもまたその議論することも意味がありません。他にするべきより重要なことがあります。

source: Updating the package style is not a required activity for the update of a package. But, you can use the full capability of the modern <systemitem role="package">debhelper</systemitem> system and the <literal>3.0</literal> source format by doing this. <placeholder type="footnote" id="0"/>
ca: Per actualitzar un paquet no és necessari actualitzar el format de construcció del paquet. Encara així, pots aprofitar tota la funcionalitat de <systemitem role="package">debhelper</systemitem> i del format <literal>3.0</literal> fent el següent <placeholder type="footnote" id="0"/>:
es: Para actualizar un paquete no es necesario actualizar el formato del paquete. Aún así, puedes aprovechar completamente la funcionalidad de <systemitem role="package">debhelper</systemitem> y del formato <literal>3.0</literal> haciendo lo siguiente <placeholder type="footnote" id="0"/>:
fr: La mise à jour du style d'empaquetage n'est pas nécessaire lors de la mise à jour d'un paquet. Néanmoins, vous pouvez profiter de tout le potentiel du système <systemitem role="package">debhelper</systemitem> moderne et du format source <literal>3.0</literal> en même temps : <placeholder type="footnote" id="0"/>
it: L'aggiornamento dello stile del pacchetto non è una attività obbligatoria nel processo di aggiornamento di quest'ultimo. Tuttavia facendo ciò si può sfruttare appieno la capacità del moderno sistema <systemitem role="package">debhelper</systemitem> ed il formato sorgente <literal>3.0</literal>. <placeholder type="footnote" id="0"/>
ja: パッケージスタイルの 更新はパッケージ更新のために必須活動ではありません。しかし、こうすることで最新の <systemitem role="package">debhelper</systemitem> システムと <literal>3.0</literal> ソースフォーマットの全能力を活用できます。<placeholder type="footnote" id="0"/>
