Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: There are also some more specialized but similar packages such as <systemitem role="package">dh-make-perl</systemitem>, <systemitem role="package">dh-make-php</systemitem>, etc.
ja: <systemitem role="package">dh-make-perl</systemitem>、<systemitem role="package">dh-make-php</systemitem>等のように、同様の内容で特定目的に特化したパッケージもいくつかあります。

source: Before you decide to ask your question in some public place, please read the fine documentation.
ja: 公開の場で質問をすると決心する前に、良好な文書を読みましょう。

source: files in <filename>/usr/share/doc/<replaceable>package</replaceable></filename> for all pertinent packages
ja: 全ての関与するパッケージの <filename>/usr/share/doc/<replaceable>package</replaceable></filename> 中のファイル

source: contents of <literal><command>man</command> <replaceable>command</replaceable></literal> for all pertinent commands
ja: 全ての関与するコマンドの <literal><command>man</command> <replaceable>command</replaceable></literal> の内容

source: contents of <literal><command>info</command> <replaceable>command</replaceable></literal> for all pertinent commands
ja: 全ての関与するコマンドの <literal><command>info</command> <replaceable>command</replaceable></literal> の内容

source: contents of <ulink url="&debian-mentors-ldo;">debian-mentors@lists.debian.org mailing list archive</ulink>
ja: <ulink url="&debian-mentors-ldo;">debian-mentors@lists.debian.org メーリングリストのアーカイブ</ulink> の内容

source: contents of <ulink url="&debian-devel-ldo;">debian-devel@lists.debian.org mailing list archive</ulink>
ja: <ulink url="&debian-devel-ldo;">debian-devel@lists.debian.org メーリングリストのアーカイブ</ulink> の内容

source: If you still have questions about packaging that you couldn't find answers to in the available documentation and web resources, you can ask them interactively.
ja: 入手可能な文書やウエッブのリソースからは答えを見つけられない疑問が残った場合には、インタラクティブに疑問を聞く事が出来ます。

source: <ulink url="&debian-mentors-ldo;">debian-mentors@lists.debian.org mailing list</ulink>. (This mailing list is for the novice.)
ja: <ulink url="&debian-mentors-ldo;">debian-mentors@lists.debian.org メーリングリスト</ulink>。 (初心者向けメーリングリストです。)

source: <ulink url="&debian-devel-ldo;">debian-devel@lists.debian.org mailing list</ulink>. (This mailing list is for the expert.)
ja: <ulink url="&debian-devel-ldo;">debian-devel@lists.debian.org メーリングリスト</ulink>。 (上級者向けメーリングリストです。)

source: <ulink url="&irc-debian;">IRC</ulink> such as <literal>#debian-mentors</literal>.
ja: <literal>#debian-mentors</literal> の様な <ulink url="&irc-debian;">IRC</ulink>。

source: The more experienced Debian developers will gladly help you, if you ask properly after making your required efforts.
ja: あなたに必要とされる努力をした後に適切に質問すれば、より経験を持った Debian デベロッパーが喜んで助けてくれるでしょう。

source: Workflow of the Debian package building
ja: Debian パッケージ作成のワークフロー

source: You have probably chosen the package you want to create. The first thing you need to do is check if the package is in the distribution archive already by using the following.
ja: おそらく、作成したいパッケージを選んだことと思います。まず最初にしなければならないことは、ディストリビューションのアーカイブにそのパッケージがすでにあるかどうかを以下をを使って確認することです。

source: the <command>aptitude</command> command
ja: <command>aptitude</command> コマンド

source: There are several package ownership status resources.
ja: パッケージの所有状態の情報源がいくつかあります。

source: You can automate this by using <systemitem role="package">dh-autoreconf</systemitem> package. See <xref linkend="customrules"/>.
ja: <systemitem role="package">dh-autoreconf</systemitem> パッケージを用いるとこれが自動か出来ます。<xref linkend="customrules"/> を参照下さい。

source: Then let's create <filename>~/.quiltrc-dpkg</filename> as follows.
ja: <filename>~/.quiltrc-dpkg</filename> ファイルを次のように作成しましょう。

source: $ dquilt refresh $ dquilt header -e ... describe patch
ja: $ dquilt refresh $ dquilt header -e ... パッチの詳細

source: See <ulink url="&gnu-destdir;">GNU Coding Standards: 7.2.4 DESTDIR: Support for Staged Installs</ulink>.
ja: <ulink url="&gnu-destdir;">GNU Coding Standards: 7.2.4 DESTDIR: Support for Staged Installs</ulink> を参照下さい。

source: Edit those files and in those lines replace <literal>usr/local/lib</literal> with <literal>usr/lib</literal>. This can be done automatically as follows:
ja: それらのファイルを編集し、該当行の <literal>usr/local/lib</literal> を <literal>usr/lib</literal> に置き換えてください。これは以下の様にすると自動可出来ます。

source: In this chapter, files in the <filename>debian</filename> directory are referred without preceding <filename>debian/</filename> for simplicity whenever they are obvious.
ja: 本章では、<filename>debian</filename> ディレクトリ中のファイルは、明白な場合には前に付く <filename>debian/</filename> 無しで簡明に参照しています。

source: There is a new subdirectory under the program's source directory, it's called <filename>debian</filename>. There are a number of files in this directory that we should edit in order to customize the behavior of the package. The most important of them are <filename>control</filename>, <filename>changelog</filename>, <filename>copyright</filename> and <filename>rules</filename>, which are required for all packages. <placeholder type="footnote" id="0"/>
ja: プログラムのソースディレクトリの中に <filename>debian</filename>という名前の新しいディレクトリがつくられています。このディレクトリ内には多くのファイルがあり、パッケージの振る舞いをカスタマイズするには、これらを編集します。特に、 <filename>control</filename>、 <filename>changelog</filename>、 <filename>copyright</filename> 、 <filename>rules</filename>はすべてのパッケージになくてはならないファイルです。<placeholder type="footnote" id="0"/>

source: Here is the <filename>control</filename> file <command>dh_make</command> created for us:
ca: Aquest és el contingut del fitxer <filename>control</filename> generat per <command>dh_make</command>:
it: Questo è il file di <filename>control</filename> che <command>dh_make</command> crea:
ja: 以下は、<command>dh_make</command> が生成した <filename>control</filename> ファイルの雛型です。

source: Lines 1-7 are the control information for the source package. Lines 9-13 are the control information for the binary package.
ja: 1-7 行目は、ソースパッケージの管理情報です。9-13 行目は、バイナリーパッケージの管理情報です。

source: See <ulink url="&policy-subsections;">Debian Policy Manual, 2.4 'Sections'</ulink> and <ulink url="&sections-unstable;">List of sections in <literal>sid</literal></ulink>.
ja: <ulink url="&policy-subsections;">Debian Policy Manual, 2.4 'Sections'</ulink> と <ulink url="&sections-unstable;">List of sections in <literal>sid</literal></ulink> を参照下さい。

source: As you may have noticed, Debian archive is divided in sections: <literal>main</literal> (the free software), <literal>non-free</literal> (the not really free software) and <literal>contrib</literal> (free software that depends on non-free software). Under those, there are logical subsections that describe in short what packages are in. So we have <literal>admin</literal> for administrator-only programs, <literal>base</literal> for the basic tools, <literal>devel</literal> for programmer tools, <literal>doc</literal> for documentation, <literal>libs</literal> for libraries, <literal>mail</literal> for e-mail readers and daemons, <literal>net</literal> for network apps and daemons, <literal>x11</literal> for X11 programs that don't fit anywhere else, and many more. <placeholder type="footnote" id="0"/>
ja: ご存知のように、Debianアーカイブは<literal>main</literal> (完全にフリーなソフトウェア)、<literal>non-free</literal> (実質フリーであるとはいえないソフトウェア)、<literal>contrib</literal> (自身はフリーだがnon-freeに依存するソフトウェア)にわかれています。さらにその下で、論理的なサブセクションに分類されています。例えば、管理者専用のプログラムは<literal>admin</literal> 、基本的なツールは<literal>base</literal>、プログラマのためのツールは<literal>devel</literal> 、文書作成関連は<literal>doc</literal>、ライブラリ群は<literal>libs</literal>、メールリーダやメールサーバに必要なデーモンなどは<literal>mail</literal>、ネットワーク関連のアプリケーションやデーモンは<literal>net</literal>、分類ができないX11用のプログラムは<literal>x11</literal>に分類され、他にも様々なサブセクションがあります。<placeholder type="footnote" id="0"/>

source: See <ulink url="&policy-priorities;">Debian Policy Manual, 2.5 'Priorities'</ulink>.
ja: <ulink url="&policy-priorities;">Debian Policy Manual, 2.5 'Priorities'</ulink> を参照下さい。

source: Line 3 describes how important it is that the user installs this package. <placeholder type="footnote" id="0"/>
ja: 3行目は、ユーザーが当パッケージをインストールする重要度を示しています。<placeholder type="footnote" id="0"/>

source: See <ulink url="&policy-relationships;#s-sourcebinarydeps">Debian Policy Manual, 7.7 'Relationships between source and binary packages - Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep'</ulink>.
ja: <ulink url="&policy-relationships;#s-sourcebinarydeps">Debian Policy Manual, 7.7 'Relationships between source and binary packages - Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep'</ulink> を参照下さい。

source: For source packages which have some binary packages with <literal>Architecture: any</literal>, they are rebuild by the autobuilder. Since this autobuilder procedure runs <literal>debian/rules build</literal> in it while installing only packages listed in the <literal>Build-Depends</literal> field (see <xref linkend="autobuilder"/>), the <literal>Build-Depends</literal> field needs to list practically all the required packages and the <literal>Build-Depends-indep</literal> is rarely used.
ja: <literal>Architecture: any</literal>のバイナリパッケージを含むソースパッケージはオートビルダーによってリビルトされます。autobuilderは<literal>debian/rules build</literal>を実行します。その際に、<literal>Build-Depends</literal>フィールド (<xref linkend="autobuilder"/> を参照)に列挙されたパッケージしかインストールしないので、<literal>Build-Depends</literal>フィールドには事実上必要なパッケージ全てを列挙しなければなりません。 <literal>Build-Depends-indep</literal>はあまり使われません。

source: See <ulink url="&policy-relationships;">Debian Policy Manual, 7 'Declaring relationships between packages'</ulink>.
ja: See <ulink url="&policy-relationships;">Debian Policy Manual, 7 'Declaring relationships between packages'</ulink> を参照下さい。

source: Here is a simplified description of package relationships. <placeholder type="footnote" id="0"/>
ja: パッケージの依存関係を単純化し以下に説明します。 <placeholder type="footnote" id="0"/>

source: <literal>Depends</literal>
ja: <literal>Depends (依存)</literal>

source: <literal>Recommends</literal>
ja: <literal>Recommends (推奨)</literal>

source: <literal>Suggests</literal>
ja: <literal>Suggests (提案)</literal>

source: <literal>Pre-Depends</literal>
ja: <literal>Pre-Depends (事前依存)</literal>

source: This is stronger than <literal>Depends</literal>. The package will not be installed unless the packages it pre-depends on are installed and <emphasis>correctly configured</emphasis>. Use this <emphasis>very</emphasis> sparingly and only after discussing it on the <ulink url="&debian-devel-ldo;">debian-devel@lists.debian.org</ulink> mailing list. Read: don't use it at all. :-)
ca: Aquesta opció és més radical que <literal>Depends</literal>. El paquet no s'instal·larà fins que els paquets dels quals pre-depèn estiguin instal·lats i <emphasis>correctament configurats</emphasis>. Fes servir aquesta opció <emphasis>poques vegades</emphasis> i només després d'haver-ho discutit a la llista de distribució <ulink url="&debian-devel-ldo;">debian-devel@lists.debian.org</ulink>. Més clarament: no facis servir aquesta opció :-).
it: Questa relazione è più forte di <literal>Depends</literal>. Il pacchetto non verrà installato a meno che i pacchetti da cui pre-dipende sono stati installati e <emphasis>correttamente configurati</emphasis>. Si usi questa relazione con <emphasis>molta</emphasis> parsimonia e solo dopo averne discusso sulla mailing list <ulink url="&debian-devel-ldo;">debian-devel@lists.debian.org</ulink> . Leggasi: non utilizzarla affatto. :-)
ja: これは<literal>Depends</literal>よりも強い関係を示します。パッケージは先行依存のパッケージがあらかじめインストールされ、かつ<emphasis>適切に設定</emphasis>されていない限りインストールされません。これは、メーリングリスト<ulink url="&debian-devel-ldo;">debian-devel@lists.debian.org</ulink>で議論を尽くした上で、<emphasis>とても</emphasis>慎重に扱うべきです。つまり、使わないでください。:-)

source: <literal>Conflicts</literal>
ja: <literal>Conflicts (競合)</literal>

source: <literal>Breaks</literal>
ja: <literal>Breaks (破壊)</literal>

source: <literal>Provides</literal>
ja: <literal>Provides (提供)</literal>

source: For some types of packages where there are multiple alternatives virtual names have been defined. You can get the full list in the <ulink url="&virtual-package;">virtual-package-names-list.txt.gz</ulink> file. Use this if your program provides a function of an existing virtual package.
ja: パッケージによっては、選択の予知があるために仮想パッケージ名が定義されています。仮想パッケージ名の一覧仮想パッケージ名の一覧は <ulink url="&virtual-package;">virtual-package-names-list.txt.gz</ulink> にあります。あなたのプログラムが既存の仮想パッケージの機能を提供する場合には、これを使います。

source: <literal>Replaces</literal>
ja: <literal>Replaces (置換)</literal>

source: The last feature you need to know about is <literal>${shlibs:Depends}</literal>, <literal>${perl:Depends}</literal>, <literal>${misc:Depends}</literal>, etc.
ja: 知っておくべき最後の特徴は <literal>${shlibs:Depends}</literal> や <literal>${perl:Depends}</literal> や <literal>${misc:Depends}</literal> 等です。

source: <citerefentry> <refentrytitle>dh_shlibdeps</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> calculates shared library dependencies for binary packages. It generates a list of ELF executables and shared libraries it has found for each binary package. Such list is used for substituting <literal>${shlibs:Depends}</literal>.
ja: <citerefentry> <refentrytitle>dh_shlibdeps</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>は、バイナリパッケージのライブラリー依存関係を計算します。それは各バイナリパッケージ毎に、ELF実行可能ファイルや共有ライブラリーのリストを生成します。このようなリストは <literal>${shlibs:Depends}</literal> の置換に利用されます。

source: <citerefentry> <refentrytitle>dh_perl</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> calculates Perl dependencies. It generates a list of a dependency on <literal>perl</literal> or <literal>perlapi</literal> for each binary package. Such list is used for substituting <literal>${perl:Depends}</literal>.
ja: <citerefentry> <refentrytitle>dh_perl</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>は、Perl依存関係を計算します。それは各バイナリパッケージ毎に、<literal>perl</literal> や <literal>perlapi</literal> の依存関係リストを生成します。このようなリストは <literal>${perl:Depends}</literal> の置換に利用されます。

source: Some <systemitem role="package">debhelper</systemitem> commands may make the generated package need to depend on some other packages. All such commands generate a list of required packages for each binary package. Such list is used for substituting <literal>${misc:Depends}</literal>.
ja: 一部の <systemitem role="package">debhelper</systemitem>コマンドは、生成するパッケージが他パッケージに依存するようにパッケージを生成します。このようなコマンド全ては各バイナリパッケージが必要とするパッケージのリストを生成します。このようなリストは <literal>${misc:Depends}</literal> の置換に利用されます。

source: <citerefentry> <refentrytitle>dh_gencontrol</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> generates <filename>DEBIAN/control</filename> for each binary package while substituting <literal>${shlibs:Depends}</literal>, <literal>${perl:Depends}</literal>, <literal>${misc:Depends}</literal>, etc.
ja: <citerefentry> <refentrytitle>dh_gencontrol</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> が <literal>${shlibs:Depends}</literal>、<literal>${perl:Depends}</literal>、<literal>${misc:Depends}</literal> 等を置換しながら各バイナリパッケージ毎に <filename>DEBIAN/control</filename> を生成します。

source: Line 9 is the Homepage URL. Let's assume this to be at <ulink url="&gentoo;"/>.
ja: 9 行目はホームページの URLです。これが <ulink url="&gentoo;"/> と仮定しましょう。

source: These descriptions are in English. Translations of these descriptions are provided by <ulink url="&ddtp;">The Debian Description Translation Project - DDTP</ulink>.
ja: これらの説明は英語です。これらの説明の翻訳は <ulink url="&ddtp;">The Debian Description Translation Project - DDTP</ulink> によって提供されています。

source: Line 13 is where the long description goes. This should be a paragraph which gives more details about the package. Column 1 of each line should be empty. There must be no blank lines, but you can put a single <literal>.</literal> (dot) in a column to simulate that. Also, there must be no more than one blank line after the long description. <placeholder type="footnote" id="0"/>
ja: 13行目は詳細な説明です。これはパッケージについてより詳しく説明する1つの段落であるべきです。各行の先頭は空白（スペース文字）で始めます。空白行を入れてはいけませんが、 <literal>.</literal> (半角ピリオド) を1つ書くことで、空白行のように見せることができます。説明文の後にも１行以上の空白行を入れてはいけません。<placeholder type="footnote" id="0"/>

source: See <ulink url="&devref-bpp-vcs;">Developer's Reference, 6.2.5. 'Version Control System location'</ulink>.
ja: <ulink url="&devref-bpp-vcs;">Developer's Reference, 6.2.5. 'Version Control System location'</ulink> を参照下さい。

source: Let's insert <literal>Vcs-*</literal> fields to document the Version Control System (VCS) location between line 6 and 7. <placeholder type="footnote" id="0"/> Let's assume that the <systemitem role="package">gentoo</systemitem> package has its VCS located in Debian Alioth Git Service at <literal>git://git.debian.org/git/collab-maint/gentoo.git</literal>.
ja: 6行目と7行目の間に <literal>Vcs-*</literal>フィールドを追加しましょう。<placeholder type="footnote" id="0"/> <systemitem role="package">gentoo</systemitem>パッケージがその VCS アーカイブを <literal>git://git.debian.org/git/collab-maint/gentoo.git</literal>のDebian Alioth Git Serviceに置いていると仮定しましょう。

source: This file contains the information about package upstream resources, copyright and license information. <ulink url="&policy-copyright;">Debian Policy Manual, 12.5 'Copyright information'</ulink> dictates its content and <ulink url="&dep5;">DEP-5: Machine-parseable <filename>debian/copyright</filename></ulink> provides guidelines for its format.
ja: このファイルにはパッケージの上流 (upstream) に関するリソース、著作権、ライセンスなどの情報を記載します。その内容は <ulink url="&policy-copyright;">Debian Policy Manual, 12.5 'Copyright information'</ulink> に規定され、そのフォーマットは <ulink url="&dep5;">DEP-5: Machine-parseable <filename>debian/copyright</filename></ulink> がガイドラインを提供しています。

source: Please follow the HOWTO provided by ftpmasters and sent to debian-devel-announce: <ulink url="&howto-copyright;"/>.
ja: ftpmasterにより提供され debian-devel-announce に投稿された手順書 <ulink url="&howto-copyright;"/> に従って下さい。

source: You can read more about updating the <filename>changelog</filename> file later in <xref linkend="update"/>.
ja: <filename>changelog</filename>の更新については、<xref linkend="update"/> で詳しく説明します。

source: This target is used by <literal>dpkg-buildpackage</literal> as in <xref linkend="completebuild"/>.
ja: このターゲットは例えば、<xref linkend="completebuild"/> などで、<literal>dpkg-buildpackage</literal>が使用します。

source: This target is used by <literal>dpkg-buildpackage -B</literal> as in <xref linkend="autobuilder"/>.
ja: このターゲットは例えば、<xref linkend="autobuilder"/> などで、<literal>dpkg-buildpackage -B</literal>が使用します。

source: Line 11 can be uncommented to set <literal>DH_VERBOSE</literal> variable to 1. Then, the <command>dh</command> command will output which <command>dh_*</command> commands are executed by the <command>dh</command> command. You can also add <literal>export DH_OPTIONS=-v</literal> line here. Then each <command>dh_*</command> command will output which commands are executed by each <command>dh_*</command> command. This helps you to understand what exactly is going on behind this simple <filename>rules</filename> file and to debug its problems. This new <command>dh</command> is a core part of the <systemitem role="package">debhelper</systemitem> tools and does not hide anything from you.
ja: <literal>DH_VERBOSE</literal>変数を1に設定するためには、11行目のコメントを外します。そうすることによって、<command>dh</command>コマンドが、<command>dh</command>コマンドによって実行された<command>dh_*</command>コマンドを出力します。必要であればここに、<literal>export DH_OPTIONS=-v</literal>という行を追加できます。そうすることによって、<command>dh_*</command>コマンドが、<command>dh_*</command>によって実行されたコマンドを出力します。この単純な<filename>rules</filename>ファイルが何をしているのかを理解する手助けとなり、デバッグの際のヒントになるでしょう。この新しい<command>dh</command>が<systemitem role="package">debhelper</systemitem>ツールの中核となる部分です。

source: This uses the new <systemitem role="package">debhelper</systemitem> V7 features. Its design concepts are explained in <ulink url="&debhelper-slides;">Not Your Grandpa's Debhelper</ulink> presented at Debconf9 by the <systemitem role="package">debhelper</systemitem> upstream. Under <literal>lenny</literal>, <command>dh_make</command> created a much more complicated <filename>rules</filename> file with many <command>dh_*</command> scripts listed for each required explicit targets and frozen them to the state when it was initially packaged. This new <command>dh</command> command is simpler and frees us from this constrain. You still have full power to customize this with <literal>override_dh_*</literal> targets. See <xref linkend="customrules"/>. It is based only on the <systemitem role="package">debhelper</systemitem> package and does not obfuscate the package building process like the <systemitem role="package">cdbs</systemitem> package.
ja: これは新しい <systemitem role="package">debhelper</systemitem> V7の機能です。このデザインコンセプトはDebconf9で <systemitem role="package">debhelper</systemitem> 上流によって <ulink url="&debhelper-slides;">Not Your Grandpa's Debhelper</ulink> として提示されました。<literal>lenny</literal> の <command>dh_make</command> は、必須となる明示されたターゲットごとに、もっと複雑な <filename>rules</filename> ファイルと <command>dh_*</command> スクリプトを量産し、最初にパッケージ化した際の状態に凍結していました。新しい <command>dh</command> コマンドは、もっとシンプルで、旧来の制約に縛られません。その上、<literal>override_dh_*</literal> ターゲットでカスタマイズする利便性は失われていません。詳しくは <xref linkend="customrules"/> を参照してください。これは、<systemitem role="package">debhelper</systemitem> パッケージがもとになっており、<systemitem role="package">cdbs</systemitem> のようにパッケージをビルドするプロセスを複雑化することはありません。

source: These commands support other build environments such as <filename>setup.py</filename> which can be listed by executing <literal>dh_auto_build --list</literal> in a package source directory.
ja: これらのコマンドは、<literal>dh_auto_build --list</literal>を実行するとリストされる <filename>setup.py</filename> のような他のビルド環境もサポートします。

source: If you want to store the system configuration data in the <filename>/etc/gentoo</filename> directory instead of the usual <filename>/etc</filename> directory for the recent <systemitem role="package">gentoo</systemitem> package using Autotools, you can override the default <literal>--sysconfig=/etc</literal> argument given by the <command>dh_auto_configure</command> command to the <command>./configure</command> command by the following.
ja: 最近の Autotools を用いた <systemitem role="package">gentoo</systemitem>パッケージに関して、その設定情報を通常の <filename>/etc</filename> ディレクトリではなく、<filename>/etc/gentoo</filename> ディレクトリに置きたい場合には、<command>dh_auto_configure</command> コマンドが <command>./configure</command> コマンドに与えるデフォルトの引数 <literal>--sysconfig=/etc</literal> を以下のようにしてオーバーライドできます。

source: The <command>dh_make</command> command will create some template configuration files under the <filename>debian</filename> directory. Most of them come with filenames suffixed by <literal>.ex</literal>. Some of them come with filenames prefixed by the binary package name such as <literal><replaceable>package</replaceable></literal>. Take a look at all of them. <placeholder type="footnote" id="0"/>
ja: <command>dh_make</command>コマンドは、<filename>debian</filename>ディレクトリの中に設定ファイルの雛形を作成します。大抵の場合、<literal>.ex</literal>サフェックスが付いています。ファイル名の先頭に<literal><replaceable>package</replaceable></literal>などのように、バイナリパッケージの名前がつくものもあります。これらのファイルにはすべて目を通しておいてください。<placeholder type="footnote" id="0"/>

source: modify the <filename>control</filename> file (see <xref linkend="control"/>), if necessary.
ja: 必要であれば、<filename>control</filename>ファイル(参照 <xref linkend="control"/>)を変更します。

source: modify the <filename>rules</filename> file (see <xref linkend="rules"/>), if necessary.
ja: 必要なら<filename>rules</filename>ファイル(参照 <xref linkend="rules"/>)を編集してください。

source: See <citerefentry> <refentrytitle>dpkg</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> and <ulink url="&policy-conffiles;">Debian Policy Manual 'D.2.5 Conffiles'</ulink>.
ja: <citerefentry> <refentrytitle>dpkg</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> と <ulink url="&policy-conffiles;">Debian Policy Manual 'D.2.5 Conffiles'</ulink> を参照下さい。
