Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: Some programs don't use <filename>Makefile</filename> variables to define paths such as these. This means you might have to edit some real C sources in order to fix them to use the right locations. But where to search, and exactly what for? You can find this out by issuing:
ca: Alguns programes no fan servir variables en el fitxer <filename>makefile</filename> per definir les ubicacions dels fitxers. Això significa que hauràs d'editar alguns dels fitxers de codi C per solucionar això per tal de que es facin servir els directoris correctes. Però, on cal buscar?, i exactament, què? Prova d'executar el següent:
es: Algunos programas no usan variables en el <filename>makefile</filename> para definir rutas como éstas. Esto significa que tendrás que editar algunos de los ficheros de código C para arreglarlos y que usen las rutas correctas. Pero, ¿dónde buscar?, y exactamente, ¿el qué? Puedes probar a encontrarlos usando:
fr: Certains programmes n'utilisent pas les variables des fichiers <filename>Makefile</filename> pour définir des chemins comme ceux-ci. Cela signifie que vous risquez de devoir modifier de vrais fichiers sources C pour qu'ils utilisent les emplacements corrects. Mais où, et que chercher exactement ? Vous pouvez le découvrir avec :
it: Alcuni programmi non usano le variabili nel <filename>Makefile</filename> per definire dei percorsi come questi. Questo indica che potrebbe essere necessario modificare qualche sorgente in C, per fargli usare il percorso giusto. Ma dove cercarlo, e per farci cosa? Lo si può scoprire eseguendo questo:
ja: プログラムの中には、このようなパスを定義するための <filename>Makefile</filename> 変数を使っていないものもあります。このような場合、C のソースそのものをいじって、指定された場所を使うように修正しなければなりません。でもどこを探し、何を確認すればよいのでしょうか? 以下のコマンドを実行すれば該当箇所を見つけることができます。

source: <command>grep</command> will run recursively through the source tree and tell you the filename and the line number for all matches.
ca: <command>grep</command> buscarà recursivament en l'estructura de directoris i indicarà el nom del fitxer i la línia on hi hagi alguna concordança.
es: <command>grep</command> buscará recursivamente en los subdirectorios y te indicará el nombre del fichero y la línea cuando encuentre una concordancia con la cadena.
fr: <command>grep</command> va parcourir récursivement l'arbre des sources et donner le nom des fichiers et le numéro des lignes où il trouve une occurrence.
it: <command>grep</command> cercherà tutte le corrispondenze in maniera ricorsiva attraverso tutto l'albero dei sorgenti, indicando il nome del file e il numero della riga.
ja: <command>grep</command> がソースツリーを再帰的に検索し、該当箇所を見つけたらそのファイルの名前と検索対象の文字列が含まれる行番号とを表示します。

source: Edit those files and in those lines replace <literal>usr/local/lib</literal> with <literal>usr/lib</literal>.
es: Ahora edita esos ficheros y cambia en esas líneas <literal>usr/local/lib</literal> por <literal>usr/lib</literal>.
fr: Modifiez ces fichiers et à ces lignes, remplacez <literal>usr/local/lib</literal> par <literal>usr/lib</literal> :

source: Be careful that you don't mess up the rest of the code! :-)
ca: ¡Posa molta atenció en fer canvis inadvertits en el codi! :-)
es: ¡Mucha atención en hacer otros cambios inadvertidos en el código! :-)
fr: Soyez attentif à ne pas casser le reste du code ! :-)
it: Si faccia attenzione a non pasticciare il resto dei sorgenti! :-)

source: After that you should find the install target (search for line that starts with <literal>install:</literal>, that will usually work) and rename all references to directories other than ones defined at the top of the <filename>Makefile</filename>.
fr: Ensuite, vous devriez trouver la cible d'installation (cherchez une ligne qui commence par <literal>install:</literal>, d'ordinaire cela fonctionne) et renommez toutes les références aux répertoires autres que ceux définis au début du <filename>Makefile</filename>.
it: A questo punto si dovrebbe trovare il percorso di destinazione per l'installazione (si cerchi la riga che inizia con <literal>install:</literal>, di solito è quella corretta) e modificare tutti i riferimenti alle directory diverse da quelle definite nel <filename>Makefile</filename>.

source: After your upstream bug fix, <systemitem role="package">gentoo</systemitem>'s install target said:
es: Antes de corregir el error en el código original, el objetivo «install» de <systemitem role="package">gentoo</systemitem> declaraba:
fr: Après la correction du bogue amont, la cible « install » de <systemitem role="package">gentoo</systemitem> est sous la forme :

source: Let's fix this and record this with the <command>quilt</command> command as <filename>debian/patches/install.patch</filename>.
es: Ahora corregiremos el error, conservando las modificaciones en el archivo <filename>debian/patches/install.patch</filename> con la orden <command>quilt</command>.
fr: Corrigez l'erreur et enregistrez la modification avec la commande <command>quilt</command> sous <filename>debian/patches/install.patch</filename> :

source: Let's change this for Debian package as following using the editor:
ca: Anem a canviar això per al paquet Debian amb l'editor:
es: Y ahora escribe los cambios con el editor:
fr: Pour le paquet Debian, il faut modifier comme suit avec l'éditeur :
it: Per il pacchetto debian si modifichi come segue, utilizzando un editor:

source: You've surely noticed that there's now a <literal>install -d</literal> command before the other commands in the rule. The original <filename>Makefile</filename> didn't have it because usually the <literal>/usr/local/bin</literal> and other directories already exist on the system where one runs <literal>make install</literal>. However, since we will install into our own empty (or even nonexistent) directory, we will have to create each and every one of those directories.
ca: Fixa't que hi ha la primera línia que és nova (<literal>install -d</literal>) abans de les altres. El fitxer <filename>Makefile</filename> original no estava aquesta ordre degut a què els directoris <literal>/usr/local/bin</literal> ja existeixen en el sistema quan s'executa <literal>make install</literal> . Per això, com farem la instal·lació en un directori buit (o inexistent), caldrà assegurar-se que els directoris necessaris ja existeixen.
es: Seguramente has notado que ahora hay una orden <literal>install -d</literal> antes de las demás órdenes de la regla. El <filename>Makefile</filename> original no la tenía porque normalmente <literal>/usr/local/bin</literal> y otros directorios ya existen en el sistema donde se ejecuta <literal>make install</literal>. Sin embargo, dado que lo instalaremos en un directorio vacío (o incluso inexistente), tendremos que generar cada uno de estos directorios.
fr: Vous aurez sûrement remarqué qu'il y a maintenant une commande « <literal>install -d</literal> » avant les autres dans la règle. Elle n'existait pas dans le fichier <filename>Makefile</filename> originel parce qu'habituellement <literal>/usr/local/bin</literal> et les autres répertoires existent déjà sur le système dans lequel « <literal>make install </literal>» est exécuté. Cependant, puisque dans notre cas les répertoires d'installation sont vides (ou même inexistants), chacun de ces répertoires doit être créé.
it: Si sarà sicuramente notato che c'è adesso un comando <literal>install -d</literal> prima degli altri, nella regola. Il <filename>Makefile</filename> originale non ce l'ha perché generalmente usa <literal>/usr/local/bin</literal> e altre directory che già esistono nel sistema su cui si esegue <literal>make install</literal>. Tuttavia, dal momento che verrà installato nella nostra directory vuota (o anche inesistente), si dovrà creare ogni singola directory.

source: We can also add in other things at the end of the rule, like the installation of additional documentation that the upstream authors sometimes omit:
ca: També podem afegir altres coses al final de la regla, com la instal·lació de la documentació ﻿addicional que de vegades els autors originals poden haver descuidat:
es: También podemos añadir otras cosas al final de la regla, como la instalación de documentación adicional que los desarrolladores originales a veces omiten:
fr: D'autres choses peuvent être ajoutés à la fin de la règle, comme l'installation de la documentation additionnelle que l'auteur amont oublie parfois :
it: È possibile anche aggiungere altre cose alla fine della regola, come l'installazione di documentazione aggiuntiva che gli autori originali talvolta omettono:
ja: ルールの最後には、開発元の作者が省略することの多い付加的な資料のインストールなど、他の作業を追加することもできます。

source: After careful check, if everything is fine, ask <command>quilt</command> to refresh the patch to create <filename>debian/patches/install.patch</filename> and add its description.
es: Después de comprobar que sea todo correcto, ejecuta <command>quilt</command> para actualizar la modificación en el archivo <filename>debian/patches/install.patch</filename> y añade la descripción en la cabecera del archivo.
fr: Après avoir soigneusement vérifié que tout est bon, demandez à <command>quilt</command> de rafraîchir le correctif pour créer <filename>debian/patches/install.patch</filename> et ajoutez sa description.

source: Now you have a series of patches.
ca: Ja tens un parell de pegats del paquet:
es: Ahora ya tienes un par de parches en el paquete.
fr: Vous avez maintenant un ensemble de correctifs.
it: Adesso si avranno una serie di patch.
ja: これで、一連のパッチができました。

source: Upstream bug fix: <filename>debian/patches/fix-gentoo-target.patch</filename>
ca: Correcció d'un error en el codi font: <filename>debian/patches/fix-gentoo-target.patch</filename>
es: Corrección de un error en el código fuente: <filename>debian/patches/fix-gentoo-target.patch</filename>
fr: correction d'un bogue amont : <filename>debian/patches/fix-gentoo-target.patch</filename> ;
it: Correzione del bug riguardante il sorgente originale: <filename>debian/patches/fix-gentoo-target.patch</filename>
ja: 上流のバグ修正： <filename>debian/patches/fix-gentoo-target.patch</filename>

source: Debian specific packaging modification: <filename>debian/patches/install.patch</filename>
ca: Una modificació específica de l'empaquetat Debian: <filename>debian/patches/install.patch</filename>
es: Una modificación específica del empaquetado Debian: <filename>debian/patches/install.patch</filename>
fr: modification spécifique à l'empaquetage Debian : <filename>debian/patches/install.patch</filename> ;
it: Modifica specifica per il sistema di pacchettizzazione Debian: <filename>debian/patches/install.patch</filename>
ja: Debian 固有のパッケージ上の変更： <filename>debian/patches/install.patch</filename>

source: Whenever you make changes that are not specifically related to Debian package such as <filename>debian/patches/fix-gentoo-target.patch</filename>, be sure to send them to the upstream maintainer so they can be included in the next program revision and be useful to everyone else. Also remember to make your fixes not specific to Debian or Linux (or even Unix!) prior to sending them -- make them portable. This will make your fixes much easier to apply.
ca: Sempre que facis canvis que no estiguin específicament relacionats amb el paquet Debian, tals com <filename>debian/patches/fix-gentoo-target.patch</filename>, envia'ls a l'autor del codi original per tal que aquest ho pugui incorporar en la pròxima revisió del programa i així li puguin ésser útils. A més, procura que els canvis realitzats no siguin exclusius per a Debian o GNU/Linux (ni tan sols per a Unix!) abans d'enviar-los: fes canvis que siguin portables. Això farà que els teus pedaços siguin fàcils d'aplicar.
es: Siempre que hagas cambios que no estén específicamente relacionados con el paquete Debian, tales como <filename>debian/patches/fix-gentoo-target.patch</filename>, asegúrate de que los envías al desarrollador original para que éste los pueda incluir en la próxima revisión del programa y así le puedan ser útiles a alguien más. Además, recuerda hacer que tus cambios no sean específicos para Debian o GNU/Linux (¡ni siquiera para Unix!) antes de enviarlos, hazlo portable. Esto hará que tus arreglos sean más fáciles de aplicar.
fr: Chaque fois que vous faites des modifications qui ne sont pas spécifiquement liées à Debian comme <filename>debian/patches/fix-gentoo-target.patch</filename>, envoyez-les au responsable amont pour qu'elles puissent être incluses dans la version suivante du programme et que tout le monde puisse en profiter. Souvenez-vous aussi de ne pas rendre vos corrections spécifiques à Debian ou Linux (ou même Unix !) avant de les envoyer — faites-les portables. Cela rendra vos corrections beaucoup plus faciles à appliquer.
it: Ogni volta che si apportano delle modifiche che non sono specificatamente legate alla pacchettizzazione Debian, come <filename>debian/patches/fix-gentoo-target.patch</filename>, bisogna assicurarsi di inviare le modifiche al manutentore originale, in modo che possano essere incluse nella prossima versione del programma e possano beneficiarne altri utenti. Ci si ricordi, di creare delle correzioni portabili, ovvero di non renderle specifiche per Debian o Linux (o altri Unix!), prima di inviarle. Questo renderà più semplice applicare le correzioni.

source: Note that you don't have to send the <filename>debian/*</filename> files upstream.
ca: No cal enviar cap dels fitxers del directori <filename>debian/*</filename> a l'autor original.
es: Ten en cuenta que no tienes que enviar ninguno de los ficheros <filename>debian/*</filename> al desarrollador original.
fr: Remarquez que vous ne devez pas envoyer les fichiers <filename>debian/*</filename> en amont.
it: Da notare che non è necessario inviare i file <filename>debian/*</filename> all'autore originale.
ja: 開発元の作者へ <filename>debian/*</filename> ファイルを送らなくてもよいことに注意してください。

source: Differing libraries
ca: ﻿Diferències a les biblioteques.
es: Diferencias en las bibliotecas
fr: Bibliothèques différentes
it: Distinguere le librerie
ja: ライブラリの相違

source: There is one other common problem: libraries are often different from platform to platform. For example, a <filename>Makefile</filename> can contain a reference to a library which doesn't exist on Debian systems. In that case, we need to change it to a library which does exist in Debian, and serves the same purpose.
ca: Hi ha un problema que és bastant freqüent: les biblioteques són generalment diferents entre plataformes. Per exemple, un arxiu <filename>Makefile</filename> pot fer referència a una biblioteca que no ﻿existeixi en Debian o fins i tot a GNU/Linux. En aquest cas, cal canviar-la a una biblioteca equivalent a Debian.
es: Hay otro problema común: las bibliotecas son generalmente diferentes entre plataformas. Por ejemplo, un <filename>Makefile</filename> puede contener una referencia a una biblioteca que no exista en Debian o ni siquiera en GNU/Linux. En este caso, se necesita cambiarla a una biblioteca que sí exista en Debian y sirva para el mismo propósito.
fr: Il y a un autre problème courant : des bibliothèques sont souvent différentes d'une plate-forme à l'autre. Par exemple, <filename>Makefile</filename> peut contenir une référence à une bibliothèque qui n'existe pas sur les systèmes Debian. Dans ce cas, changez-la en une bibliothèque qui existe dans Debian, et qui sert à la même chose.
it: C'è un altro problema comune: le librerie sono spesso diverse da piattaforma a piattaforma. Per esempio, il <filename>Makefile</filename> può contenere un riferimento a una libreria che non esiste nei sistemi Debian. In tal caso occorre cambiare il riferimento ad una libreria che serve allo stesso scopo e che esista in Debian.

source: The author realizes that this is not the best example considering our <systemitem role="package">libncurses</systemitem> package now ships with a <filename>libcurses.so</filename> symlink, but he couldn't think of a better one. Suggestions very welcome :-)
ca: L'autor és conscient que aquest no és un bon exemple ara que el paquet <systemitem role="package">libncurses</systemitem> inclou un enllaç simbòlic <filename>libcurses.so</filename> però no se li ocorre un exemple millor. Serà benvingut qualsevol suggeriment:-)
es: El autor es consciente que este no es el mejor ejemplo ahora que el paquete <systemitem role="package">libncurses</systemitem> incluye un enlace simbólico <filename>libcurses.so</filename> pero no tenia a mano un ejemplo mejor. Cualquier sugerencia será bienvenida :-)
fr: NdA : ceci n'est pas le meilleur exemple dans la mesure où le paquet <systemitem role="package">libncurses</systemitem> est maintenant livré avec un lien symbolique <filename>libcurses.so</filename>. Les suggestions sont les bienvenues :-)
it: L'autore si rende conto che questo non è il miglior esempio, considerando che con il pacchetto <systemitem role="package">libncurses</systemitem> viene fornito il link simbolico <filename>libcurses.so</filename>, ma non è riuscito a trovare di meglio. Sono molto graditi dei suggerimenti :-)

source: So, if there is a line in your program's <filename>Makefile</filename> (or <filename>Makefile.in</filename>) that says something like this (and your program doesn't compile) <placeholder type="footnote" id="0"/>:
ca: Hi ha una línia en el fitxer <filename>Makefile</filename> (o <filename>Makefile.in</filename>) del teu programa que posa alguna cosa com el següent (i degut en això la compilació no és possible)<placeholder type="footnote" id="0"/>:
es: Así, si hay una línea en el <filename>Makefile</filename> (o <filename>Makefile.in</filename>) de tu programa que dice algo como lo siguiente (y tu programa no compila) <placeholder type="footnote" id="0"/>:
fr: Ainsi, si une ligne de <filename>Makefile</filename> (ou <filename>Makefile.in</filename>) du programme indique quelque chose comme ceci (et que le programme ne compile pas) <placeholder type="footnote" id="0"/> :
it: Così, se c'è una riga nel <filename>Makefile</filename> del programma (o nel <filename>Makefile.in</filename>) che dice qualcosa tipo (e il programma non compila) <placeholder type="footnote" id="0"/>:

source: LIBS = -lcurses -lsomething -lsomethingelse
ca: LIBS = -lcurses -lcosas -lméscoses
es: LIBS = -lcurses -lcosas -lmás_cosas
fr: LIBS = -lcurses -lquelquechose -lautrechose

source: Let's fix this as <filename>debian/patches/ncurse.patch</filename> by changing <literal>curses</literal> into <literal>ncurses</literal>.
ca: Corregeix això amb el fitxer <filename>debian/patches/ncurse.patch</filename> canviant <literal>curses</literal> per <literal>ncurses</literal>.
es: Corrige esto con el archivo <filename>debian/patches/ncurse.patch</filename> cambiando <literal>curses</literal> por <literal>ncurses</literal>.
fr: Il suffit de le corriger dans <filename>debian/patches/ncurse.patch</filename> en modifiant <literal>curses</literal> en <literal>ncurses</literal> :
it: Si cambi <literal>curses</literal> con <literal>ncurses</literal> e si salvi la correzione come <filename>debian/patches/ncurse.patch</filename>.

source: $ quilt new ncurse.patch $ quilt add Makefile $ sed -i -e s/-lcurses/-lncurses/g Makefile $ quilt refresh $ quilt header -e ... describe patch
es: $ quilt new ncurse.patch $ quilt add Makefile $ sed -i -e s/-lcurses/-lncurses/g Makefile $ quilt refresh $ quilt header -e ... describe el cambio
fr: $ quilt new ncurse.patch $ quilt add Makefile $ sed -i -e s/-lcurses/-lncurses/g Makefile $ quilt refresh $ quilt header -e ... description du correctif

source: Required files under the <filename>debian</filename> directory
ca: Fitxers necessaris en el directori <filename>debian</filename>.
es: Archivos necesarios en el directorio <filename>debian</filename>
fr: Fichiers nécessaires dans le répertoire <filename>debian</filename>
it: File richiesti nella directory <filename>debian</filename>
ja: <filename>debian/</filename> ディレクトリ以下に無くてはならないファイル

source: There is a new subdirectory under the program's source directory, it's called <filename>debian</filename>. There are a number of files in this directory that we should edit in order to customize the behavior of the package. The most important of them are <filename>control</filename>, <filename>changelog</filename>, <filename>copyright</filename> and <filename>rules</filename>, which are required for all packages.
ca: Ara tens un nou directori en el directori principal del programa («gentoo-0.9.12»), amb el nom <filename>debian</filename>. Hi ha alguns fitxers en aquest directori que caldrà editar per adaptar-los. Els fitxers més importants són <filename>control</filename>, <filename>changelog</filename>, <filename>copyright</filename> i <filename>rules</filename>, tots ells s'han d'incloure a tots els paquets.
es: Ahora hay un nuevo subdirectorio bajo el directorio principal del programa («gentoo-0.9.12»), que se llama <filename>debian</filename>. Hay algunos ficheros en este directorio que debemos editar para adaptar el comportamiento del paquete. La parte más importante es modificar los ficheros <filename>control</filename>, <filename>changelog</filename>, <filename>copyright</filename> y <filename>rules</filename> que son necesarios en todos los paquetes.
fr: Un nouveau sous-répertoire se trouve dans le répertoire des sources du programme, nommé <filename>debian</filename>. Certains fichiers de ce répertoire sont à modifier pour personnaliser le comportement du paquet. Les plus importants sont <filename>control</filename>, <filename>changelog</filename>, <filename>copyright</filename> et <filename>rules</filename>, ils sont nécessaires pour tous les paquets.

source: <filename>control</filename> file
ca: El fitxer <filename>control</filename>.
es: El archivo <filename>control</filename>
fr: Fichier <filename>control</filename>
it: Il file <filename>control</filename>
ja: <filename>control</filename>ファイル

source: This file contains various values which <command>dpkg</command>, <command>dselect</command>, <command>apt-get</command>, <command>apt-cache</command>, <command>aptitude</command>, and other package management tools will use to manage the package. It is defined by the <ulink url="&policy-control;">Debian Policy Manual, 5 'Control files and their fields'</ulink>.
ca: La informació d'aquest fitxer es fa servir per <command>dpkg</command>, <command>dselect</command>, <command>apt-get</command>, <command>apt-cache</command>, <command>aptitude</command> i altres eines de gestió de paquets. El seu contingut està explicat a <ulink url="&policy-control;">«Debian Policy Manual, 5 'Control files and their fields'»</ulink>.
fr: Ce fichier contient plusieurs valeurs utilisées par <command>dpkg</command>, <command>dselect</command>, <command>apt-get</command>, <command>apt-cache</command>, <command>aptitude</command> et d'autres outils de gestions de paquets pour gérer le paquet. Il est défini par la <ulink url="&policy-control;">Charte Debian, 5 « Fichiers de contrôle et leurs champs »</ulink>.
it: Questo file contiene diversi valori che <command>dpkg</command>, <command>dselect</command>, <command>apt-get</command>, <command>apt-cache</command>, <command>aptitude</command>, ed altri strumenti utilizzeranno per gestire il pacchetto. Il tutto è definito nel <ulink url="&policy-control;">Manuale delle policy di Debian, 5 'File di controllo e loro campi'</ulink>.
ja: <command>dpkg</command>、<command>dselect</command>、 <command>apt-get</command>、 <command>apt-cache</command>、 <command>aptitude</command>などのパッケージ管理のためのツールが利用する情報は、このファイルに記載されています。詳細は、<ulink url="&policy-control;">Debian Policy Manual, 5 'Control files and their fields'</ulink>に定義されています。
