Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: Even if it all worked well, it's time to start praying. Why? Because in just a few hours (or days) users from all around the world will start to use your package, and if you made some critical error you'll get mailbombed by numerous angry Debian users... Just kidding. :-)
ca: Encara que tot funcioni correctament, cal encomanar-se! Només en unes hores (o dies) els usuaris de tot el món faran ús del teu paquet, i si has fet alguna errada crítica, centenars d'usuaris furiosos de Debian et bombardejaran amb correus...feia broma :-)
es: Aunque todo funcione bien, es el momento de cruzar los dedos. ¿Por qué? Por que en sólo unas horas (o días) usuarios de todo el mundo empezarán a usar tu paquete, y si cometiste algún error crítico centenares de usuarios furiosos de Debian te bombardearán con correos... sólo bromeaba :-)
fr: Même si tout fonctionne bien, il est temps de commencer à prier. Pourquoi ? Parce que dans quelques heures (ou jours) les utilisateurs du monde entier vont commencer à utiliser votre paquet, et si vous avez fait des erreurs critiques, vous serez bombardé par les courriers électroniques d'utilisateurs Debian furieux... :-)
it: Anche se tutto è andato per il meglio, è arrivato il momento di pregare. Perché? Perché in poche ore (o giorni) utenti da tutto il mondo cominceranno ad usare il vostro pacchetto, e se si è commesso qualche errore grave, la proprio email sarà inondata da messaggi di molti utenti Debian incavolati... Si scherza ovviamente. :-)
ja: すべてうまくやったとしても、これからはお祈りの時間です。なぜか？ それは、ほんの数時間 (あるいは数日) で、世界中のユーザがそのパッケージを使いはじめるからです。もし何か致命的なエラーをやらかしていたら、膨大な数の怒った Debian ユーザからメール爆弾を受けとることになります……なんて冗談ですが :-)

source: Relax and be ready for bug reports, because there is a lot more work to be done before your package will be fully in line with Debian policies and its best practice guidelines (once again, read the <emphasis>real documentation</emphasis> for details). Good luck!
ca: ﻿Relaxa't i estiguis preparat per rebre informes d'errades, perquè el camí és llarg per aconseguir el compliment de las Normes de Debian (una vegada més llegeix la <emphasis>documentació real</emphasis> per a més detalls). Bona sort!
es: Relájate y prepárate para recibir informes de fallos, porque hay mucho más trabajo que realizar antes de que tu paquete cumpla las Normas de Debian (una vez más lee la <emphasis>documentación real</emphasis> para más detalles). ¡Buena suerte!
fr: Relaxez-vous et soyez prêt pour les rapports de bogues, parce qu'il y aura beaucoup plus de travail à faire avant que votre paquet soit parfaitement conforme aux règles Debian (une fois encore, lisez la <emphasis>vraie documentation</emphasis> pour les détails). Bonne chance !
it: Ci si deve rilassare ed essere pronti per le segnalazioni di bug, perché c'è molto lavoro prima che un pacchetto sia completamente conforme alle policy di Debian (ancora una volta, si legga la <emphasis>vera documentazione</emphasis> per i dettagli). In bocca al lupo!
ja: リラックスしてバグ報告に備えてください。なにしろ、そのパッケージが Debian ポリシーやそのベストプラクティスに完全に沿うようになるまでには、やらなくてはいけないことは沢山あるのですから (繰り返しますが、詳細は<emphasis>実際の文書</emphasis>を読んでください)。頑張ってください！

source: First steps
ca: ﻿Primers passos.
es: Primeros pasos
fr: Premiers pas
it: Primi passi
ja: はじめの一歩

source: Let's try to make your own package (or, better even, adopt an existing one).
ca: Començarem la construcció del teu paquet (o encara millor, pots adoptar un paquet ja existent).
es: Vamos a construir nuestro propio paquete (o, mejor aún, adoptar un paquete ya existente).
fr: Comment réaliser son premier paquet (ou, encore mieux, en adopter un).
it: Proviamo a creare un pacchetto (o, meglio ancora, adottarne uno già esistente).

source: Choose your program
ca: Seleccionar el programa.
es: Elige el programa
fr: Choix du programme
it: Scegliamo il programma
ja: プログラムの選定

source: You have probably chosen the package you want to create. The first thing you need to do is check if the package is in the distribution archive already by using <command>aptitude</command>.
es: Probablemente hayas escogido ya el paquete que deseas construir. Lo primero que debes hacer es comprobar si el paquete está ya en el archivo de la distribución utilizando <command>aptitude</command>.
fr: Vous avez probablement choisi le paquet que vous voulez créer. La première chose à faire est de vérifier si le paquet ne se trouve pas déjà dans l'archive de la distribution en utilisant <command>aptitude</command>.

source: You can also check package information through <ulink url="&packages-do;">package search page</ulink> and <ulink url="&packages-qa-do;">Debian Package Tracking System</ulink>.
fr: Vous pouvez aussi vérifier les informations de paquets avec la <ulink url="&packages-do;">page de recherche de paquets</ulink> et le <ulink url="&packages-qa-do;">système de suivi des paquets Debian</ulink>.

source: If the package already exists, well, install it! :-) If it happens to be <emphasis role="strong">orphaned</emphasis> -- if its maintainer is set to <ulink url="&qa-do;">Debian QA Group</ulink>, you may be able to pick it up if it's still available (check the ownership status at <ulink url="&wnpp-bts;">Debian Bug report logs: Bugs in package wnpp in unstable</ulink>). You may also adopt a package for which the corresponding maintainer has filed a Request for Adoption (<emphasis role="strong">RFA</emphasis>).
fr: Si le paquet existe déjà, et bien, installez-le :-). S'il se trouve qu'il est <emphasis role="strong">orphelin</emphasis> — si son responsable est « <ulink url="&qa-do;">Debian QA Group</ulink> », vous devriez pouvoir le reprendre s'il est toujours disponible (vérifier qui est le propriétaire sur les <ulink url="&wnpp-bts;">jounaux de rapport de bogue Debian : bogues du paquet wnpp dans unstable</ulink>). Vous pouvez aussi adopter un paquet pour lequel le responsable a rempli une demande d'adoption (« Request for Adoption » ou <emphasis role="strong">RFA</emphasis>).

source: Several different views of orphaned or RFA'ed packages are available at:
es: Puedes consultar las siguientes listas de paquetes huérfanos o de RFA en:
fr: Différentes vues des paquets orphelins ou en attente d'adoption sont disponibles :

source: Having said that, there will of course always be new programs that are worthwhile packaging.
ca: Tot i així, hi ha nous programes que són d'interès per a Debian.
es: Dicho esto, hay, por supuesto, nuevos programas que vale la pena empaquetar para Debian.
fr: Cela dit, il existera toujours des paquets qui vaudront la peine d'être empaquetés.
it: Detto questo, ovviamente ci sarà sempre qualche nuovo programma che vale la pena pacchettizzare.

source: As a side note, it's important to point out that Debian already has packages for most kinds of programs, and the number of packages already in the Debian archive is much larger than that of contributors with upload rights. Thus, contributions to packages already in the archive are far more appreciated (and more likely to receive sponsorship) by other developers <placeholder type="footnote" id="0"/>. You can do that in various ways.
ca: Cal tenir present que Debian incorpora paquets d'un gran nombre de programes de tot tipus i que la quantitat de paquets disponibles en el repositori de Debian és major que el nombre de col·laboradors amb autorització per afegir paquets al repositori. En conseqüència, la col·laboració en el manteniment de paquets que ja estan en el repositori es valora molt positivament (i és més fàcil trobar un patrocinador) per la resta de desenvolupadors <placeholder type="footnote" id="0"/>. Per col·laborar en el manteniment de paquets ja disponibles en el repositori tens les següents opcions:
es: A modo de nota al margen, es importante tener presente que Debian incorpora paquetes de un gran número de programas de todo tipo, y que la cantidad de paquetes disponibles en el repositorio de Debian es mucho mayor al de colaboradores con permiso para incorporar paquetes al repositorio. En consecuencia, la colaboración en el mantenimiento de paquetes que ya están en el repositorio se valora muy positivamente (y es más fácil conseguir patrocinador) por el resto de desarrolladores <placeholder type="footnote" id="0"/>. Puedes hacer esto de distintas formas.
fr: En remarque, il est important de souligner que Debian possède déjà des paquets pour quasiment tous les types de programme, et que le nombre de paquets déjà dans l'archive Debian est bien plus important que le nombre de personnes ayant les droits suffisants pour envoyer les mises à jour. Par conséquent, contribuer aux paquets existants déjà dans l'archive est bien plus apprécié (avec plus de chances d'être parrainé) des autres développeurs <placeholder type="footnote" id="0"/>. Il est possible de le faire de plusieurs façons comme suit :
it: Come nota a margine, è importante sottolineare che Debian ha già i pacchetti per la maggior parte dei programmi e che il numero di pacchetti presenti nell'archivio Debian è molto più grande di quello dei contribuenti con permessi di caricamento. Pertanto, i contributi sui pacchetti già presenti in archivio sono molto più apprezzati dagli altri sviluppatori (ed è molto più probabile che si ottenga una sponsorizzazione). <placeholder type="footnote" id="0"/>. Si può farlo in diversi modi.

source: taking over orphaned, yet actively used, packages
ca: Fer-te càrrec de paquets orfes d'ús freqüent
es: hacerte cargo de paquetes huérfanos pero que son utilizados frecuentemente por otros usuarios
fr: se charger de paquets orphelins, encore largement utilisés ;
it: prendendo in consegna dei pacchetti orfani, ma ancora attivamente utilizzati
ja: まだよく使われている、みなしごのパッケージを引き取る

source: joining <ulink url="&teams;">packaging teams</ulink>
ca: Consultar els <ulink url="&teams;">equips de desenvolupadors</ulink>.
fr: rejoindre des <ulink url="&teams;">équipes d'empaquetage</ulink> ;
it: entrando a far parte del <ulink url="&teams;">packaging teams</ulink>
ja: <ulink url="&teams;">パッケージ化チーム</ulink>に参加する

source: triaging bugs of very popular packages
ca: Selecciona errors dels paquets més populars.
es: seleccionando errores de los paquetes más populares
fr: trier des bogues de paquets populaires ;
it: aiutando nella risoluzione dei bug di pacchetti molto popolari
ja: よく使われているパッケージのバグに対処する

source: preparing <ulink url="&devref-nmu;">QA or NMU uploads</ulink>
ca: Selecciona <ulink url="&devref-nmu;">paquets QA o NMU</ulink>.
fr: préparer des <ulink url="&devref-nmu;">envois de QA ou des NMU</ulink>
it: preparazione di <ulink url="&devref-nmu;">QA or NMU uploads</ulink>
ja: <ulink url="&devref-nmu;">QA もしくは NMU アップロード</ulink> を準備する

source: If you are able to adopt the package, get the sources (with something like <literal>apt-get source <replaceable>packagename</replaceable></literal>) and examine them. This document unfortunately doesn't include comprehensive information about adopting packages. Thankfully you shouldn't have a hard time figuring out how the package works since someone has already done the initial set up for you. Keep reading, though, a lot of the advice below will still be applicable for your case.
es: Si puedes adoptar el paquete, descarga las fuentes (con algo como <literal>apt-get source <replaceable>nombre_del_paquete</replaceable></literal>) y examínalas. Desgraciadamente este documento no incluye aún información exhaustiva sobre la adopción de paquetes. No debería ser difícil entender cómo funciona el paquete ya que alguien ha hecho el trabajo inicial por ti. Aún así es mejor que sigas leyendo, muchos de los consejos que se dan a continuación serán también aplicables para tu caso.
fr: Si vous pouvez adopter le paquet, récupérez les sources (avec quelque chose comme « <literal>apt-get source <replaceable>nomdepaquet</replaceable></literal> ») et examinez-les. Malheureusement ce document n'inclut pas d'informations exhaustives sur l'adoption de paquets. Heureusement, vous ne devriez pas avoir de problèmes à comprendre comment le paquet fonctionne, puisque quelqu'un a déjà fait la configuration pour vous. Continuez quand même à lire ce document, une bonne partie des conseils qui suivent seront applicables dans votre cas.
it: Appena ci si sente in grado di adottare un pacchetto, bisogna scaricare i sorgenti (con qualcosa tipo <literal>apt-get source <replaceable>pacchetto</replaceable></literal>) ed esaminarli. Questo documento purtroppo non include tutte le informazioni che riguardano l'adozione dei pacchetti. Fortunatamente non sarà difficile capire come funziona il pacchetto dal momento che qualcuno avrà già effettuato la configurazione iniziale. Continua a leggere comunque, molti dei suggerimenti qui di seguito saranno ancora utili al caso.

source: If the package is new, and you decide you'd like to see it in Debian, proceed as follows:
ca: Si el paquet és nou i decideixes que t'agradaria posar-lo a disposició dels usuaris de Debian, ﻿has de seguir els passos indicats a continuació:
es: Si el paquete es nuevo y decides que te gustaría verlo en Debian debes seguir los pasos indicados a continuación:
fr: Si le paquet est nouveau, et que vous aimeriez le voir dans Debian, procédez comme suit :
it: Se il pacchetto è nuovo, e si pensa che sarebbe bello entrare a far parte di Debian, ecco come procedere:
ja: もしあなたの選んだプログラムがまだパッケージ化されていないもので、それを Debian に入れたいと決めたなら、以下のチェック項目について確認してください。

source: First, you must know that program works, and have tried it for some time to confirm its usefulness.
ca: Aprèn el funcionament del programa i fes-ho servir una temporada (per comprovar la seva utilitat).
es: En primer lugar deberías saber cómo funciona, y haberlo utilizado durante algún tiempo (para confirmar su utilidad).
fr: d'abord, assurez-vous qu'il fonctionne, et essayez-le pendant quelques temps pour confirmer son utilité ;
it: Prima di tutto bisogna capire se il programma funziona in modo corretto, e averlo provato per almeno un po' di tempo e dimostrarne l'utilità.

source: You must check if no one else is working on the package already at <ulink url="&wnpp-packaged;">the list of packages being worked on</ulink>. If no one else is working on it, file an ITP (Intent To Package) bug report to the <systemitem role="package">wnpp</systemitem> pseudo-package using <command>reportbug</command>. If someone's already on it, contact them if you feel you need to. If not - find another interesting program that nobody maintains.
fr: vérifiez que personne d'autre ne travaille déjà sur ce paquet en consultant la <ulink url="&wnpp-do;being_packaged">liste des paquets en cours de création</ulink>. Si personne ne travaille dessus, déclarez votre intention de l'empaqueter (« Intent To Package » ou ITP) avec un bogue ITP sur le pseudo-paquet <systemitem role="package">wnpp</systemitem> en utilisant <command>reportbug</command>. Si quelqu'un travaille déjà dessus, contactez-le si vous voulez. Sinon, trouvez un autre programme intéressant dont personne n'est responsable.

source: That program <emphasis role="strong">must have a license</emphasis>.
ca: Cal que el programa <emphasis role="strong">tengui</emphasis> una llicència:
es: El programa <emphasis role="strong">debe</emphasis> tener una licencia.
fr: le programme <emphasis role="strong">doit</emphasis> avoir une licence :
it: il programma <emphasis role="strong">deve avere una licenza</emphasis>.

source: For the <literal>main</literal> section, it <emphasis role="strong">must be compliant to all the Debian Free Software Guidelines (DFSG)</emphasis> (see <ulink url="&dfsg;">&dfsg;</ulink>) and <emphasis role="strong">that program must not require a package outside of <literal>main</literal></emphasis> for compilation or execution as required by the Debian Policy. This is desired case.
fr: pour la section <literal>main</literal> (principale), elle <emphasis role="strong">doit être conforme à tous les principes du logiciel libre selon Debian (« Debian Free Software Guidelines » ou DFSG)</emphasis> (voir <ulink url="&dfsg;">&dfsg;</ulink>) et <emphasis role="strong">ce programme ne doit pas dépendre de paquets hors de <literal>main</literal></emphasis> pour la compilation ou l'exécution, conformément à la Charte Debian. C'est le cas idéal ;

source: For the <literal>contrib</literal> section, it must be compliant to all the DFSG but it may require a package outside of <literal>main</literal> for compilation or execution.
ca: Per a paquets de la secció <literal>contrib</literal>, la llicència cal que compleixi tots els requisits de la DFSG però pot precisar la instal·lació d'altres paquets que no siguin de la secció <literal>main</literal> en la compilació o execució.
es: Para paquetes de la sección <literal>contrib</literal> la licencia debe cumplir todos los requisitos de la DFSG pero puede precisar la instalación de otro paquete que no sea de la sección <literal>main</literal> para su compilación o ejecución.
fr: pour la section <literal>contrib</literal> (contributions), il doit être conforme à tous les DFSG mais peut dépendre de paquets hors de <literal>main</literal> pour la compilation ou l'exécution ;
it: I programmi nella sezione <literal>contrib</literal>, devono essere conformi alle DFSG, ma potrebbero richiedere, per la compilazione o l'esecuzione, un pacchetto che non è presente nella sezione <literal>main</literal>.

source: For the <literal>non-free</literal> section, it may not be compliant to some of the DFSG but it <emphasis role="strong">must be distributable</emphasis>.
ca: Per a paquets de la secció <literal>non-free</literal>, no és necessari que la llicència compleixi tots els requisits de la DFSG però <emphasis role="strong">cal que permeti la distribució del programa</emphasis>.
es: Para paquetes de la sección <literal>non-free</literal>, no es necesario que la licencia cumpla todos los requisitos de la DFSG pero <emphasis role="strong">debe permitir la distribución del programa</emphasis>.
fr: pour la section <literal>non-free</literal> (non libre), il peut être non conforme à certaines DFSG mais <emphasis role="strong">doit être distribuable</emphasis>.
it: I programmi nella sezione <literal>non-free</literal>, possono non essere conformi alle DFSG, ma <emphasis role="strong">devono poter essere distribuibili</emphasis>.

source: If you are unsure about where it should go, post the license text on <ulink url="&debian-legal-ldo;">debian-legal@lists.debian.org</ulink> and ask for advice.
ca: Si tens dubtes a l'hora d'assignar al paquet a una secció, envia un correu amb el text de la llicència (en anglès) adreçat a <ulink url="&debian-legal-ldo;">debian-legal@lists.debian.org</ulink>.
fr: En cas de doute sur la section à laquelle il devrait appartenir, envoyez la licence sur <ulink url="&debian-legal-ldo;">debian-legal@lists.debian.org</ulink> et demandez conseil ;
it: Se non si è sicuri su quale sezione il pacchetto dovrebbe essere incluso, si può mandare il testo della licenza alla mailing list <ulink url="&debian-legal-ldo;">debian-legal@lists.debian.org</ulink> e chiedere consigli.
ja: どうするべきかよくわからなければ、<ulink url="&debian-legal-ldo;">debian-legal@lists.debian.org</ulink> にライセンス文を送り、アドバイスを求めてください。

source: That program certainly should <emphasis role="strong">not</emphasis> run setuid root, or even better - it shouldn't need to be setuid or setgid to anything.
ca: El programa <emphasis role="strong">no</emphasis> s'ha d'executar com a «setuid root»: cal que no sigui «setuid» ni «setgid».
es: El programa <emphasis role="strong">no</emphasis> debería ejecutarse con «setuid root», o aún mejor: no debería ser «setuid» ni «setgid».
fr: le programme ne devrait certainement <emphasis role="strong">pas</emphasis> être exécuté setuid root, ou encore mieux, il ne devrait pas être setuid ou setgid quoi que ce soit ;
it: il programma <emphasis role="strong">non</emphasis> dovrebbe girare come setuid root, o meglio, non dovrebbe richiedere di essere setuid o setgid per nessun utente.

source: That program should not be a daemon, or something that goes in <filename>*/sbin</filename> directories, or open a port as root.
ca: Cal que el programa no sigui un dimoni, o que s'instal·li en els directoris <filename>*/sbin</filename> o ﻿obrir un port com a usuari administrador.
es: El programa no debería ser un demonio, o algo que vaya en los directorios <filename>*/sbin</filename>, o abrir un puerto como usuario administrador.
fr: le programme ne devrait ni être un démon, ni s'installer dans les répertoires <filename>*/sbin</filename>, ni ouvrir un port en tant que superutilisateur ;
it: il programma non dovrebbe essere un daemon, o qualcosa che debba essere installato nelle directory <filename>*/sbin</filename>, o aprire una porta come root.

source: That program should result in binary executable form, libraries are harder to handle.
ca: ﻿El programa hauria d'estar compost per binaris executables, no intentis empaquetar llibreries (és difícil).
es: El programa debería estar compuesto por binarios ejecutables, no intentes empaquetar aún bibliotecas (son difíciles).
fr: le programme résultant devrait être sous forme de binaire exécutable, les bibliothèques sont plus difficiles à gérer ;
it: il programma dovrebbe essere in formato binario eseguibile, le librerie sono più difficili da gestire.

source: That program should be well documented and its code needs to be understandable (i.e. not obfuscated).
ca: Cal que el programa estigui ben documentat, que el codi sigui llegible i clar.
es: El programa debería tener una buena documentación o al menos un código fuente legible y no ofuscado.
fr: il devrait être bien documenté, et le code doit être compréhensible (c'est-à-dire, pas volontairement obscur) ;
it: il programma dovrebbe essere ben documentato e il suo codice facilmente comprensibile (ad es. non offuscato).

source: You should contact program's author(s) to check if they agree with packaging it and amicable to Debian. It is important to be able to consult with author(s) about the program in case of any program specific problems, so don't try to package unmaintained pieces of software.
ca: Cal que contactis amb l'autor o autors del programa per comprovar que accepten la construcció del paquet. És important que els autors ﻿continuïn amb el manteniment del programa de manera que puguis fer consultes sobre problemes específics del programa. No comencis a empaquetar un programa que no sigui mantingut pels autors.
es: Deberías contactar con el autor o autores del programa para comprobar su conformidad con el empaquetado. Es importante que el autor o autores sigan manteniendo el programa para que puedas en el futuro consultarle/s en caso de que haya problemas específicos. No deberías intentar empaquetar programas que no estén mantenidos.
fr: vous devriez contacter les auteurs du programme pour vérifier qu'ils soient d'accord pour la création du paquet et bienveillants envers Debian. Il est important de pouvoir consulter les auteurs à propos du programme en cas de problèmes spécifiques à celui-ci, donc n'essayez pas de créer un paquet à partir de programmes non maintenus.
it: Si dovrebbe contattare l'autore o gli autori del programma per verificare che siano d'accordo con la sua pacchettizzazione. È importante essere in grado di consultarsi con l'autore/i sul programma nel caso di problemi specifici del programma, per questo è meglio non provare a pacchettizzare programmi non più manutenuti.
