Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: Once you are finished with your tuning, remember to rebuild following the proper procedure. You may not be able to upload correctly if you try to upload <filename>.deb</filename> files built this way.
ca: Un cop has acabat la posada a punt, caldrà reconstruir el paquet amb el procediment explicat anteriorment. No podràs enviar al repositori els fitxers <filename>.deb</filename> construïts d'aquesta manera.
es: Una vez que has terminado la puesta a punto, recuerda reconstruir el paquete siguiendo el procedimiento adecuado que está arriba. Puede que no seas capaz de enviar correctamente el paquete si intentas enviar los archivos <filename>.deb</filename> construidos de esta forma.
fr: Une fois terminés vos ajustements, souvenez-vous de reconstruire en suivant la procédure correcte ci-dessus. Vous pouvez être incapable d'envoyer proprement si vous essayez d'envoyer des fichiers <filename>.deb</filename> construits de cette façon.
it: Una volta completati i vari aggiustamenti, bisogna ricordarsi di ricostruire il pacchetto usando la giusta procedura. Si potrebbe non essere in grado di caricare il pacchetto correttamente se si prova con dei file <filename>.deb</filename> creati in questo modo.
ja: 最終的にきちんとテストが完了したら、正しい手順に従ってパッケージを最初から再構築することを忘れないでください。この方法でビルドした <filename>.deb</filename> ファイルをアップロードしようとしても、おそらくうまくアップロードできないでしょう。

source: Checking the package for errors
ca: Com comprovar el teu paquet per trobar errors.
es: Comprobando el paquete en busca de fallos
fr: Contrôle des erreurs du paquet
it: Controllare il pacchetto per errori
ja: パッケージのエラーの検証

source: There are few chores you should know to check the package for errors by yourself before uploading packages to public archives.
ca: Cal que coneguis els procediments per comprovar el paquet i localitzar les errades abans d'enviar-lo als repositoris públics.
es: Debes conocer varios métodos para comprobar el paquete y localizar errores antes de transferirlo a repositorios públicos.
fr: Quelques routines sont à connaître pour chercher vous-même des erreurs sur le paquet avant de l'envoyer sur des archives publiques.
it: Ci sono un paio di questioni da tenere in conto per controllare autonomamente che il pacchetto creato sia privo di errori prima di procedere a caricarlo negli archivi pubblici.
ja: ここでは, 公式アーカイブにパッケージをアップロードする前に、作成したパッケージのエラーをあなた自身で確認するために知っておかなければならない方法について、幾つか述べます。

source: Testing on machine other than your own is also good idea. You must watch closely for any warnings or errors for all the test described here.
ca: Provar el paquet en una màquina distinta de la que has fet servir en la construcció és una magnífica idea. Cal que posis atenció en tots els errors detectats en les proves que s'expliquen a continuació.
es: Probar el paquete en una máquina distinta a la usada en su construcción es una magnífica idea. Debes poner atención en todos los avisos y errores que se produzcan en las pruebas explicadas a continuación.
fr: Essayer sur une machine différente de la vôtre est aussi une bonne idée. Vous devez observer de près chaque alerte ou erreur pour tous les tests décrits ici.
it: Effettuare dei test su altre macchine oltre a quella con cui si è sviluppato è una buona idea. Si deve inoltre fare attenzione a tutti gli avvisi ed agli errori per tutti i test che verranno qui descritti.
ja: あなたのマシン以外でのテストもまた良いアイデアです。以下に述べるすべてのテストにおける、どんな警告とエラーについてでもしっかりと確認しておかなければなりません。

source: Verifying package for install
ca: Comprovació de la instal·lació del paquet
es: Comprobando la instalación del paquete
fr: Vérification de l'installation du paquet
it: Verifica del pacchetto per l'installazione
ja: インストールに対するパッケージの検証

source: You must test your package if it installs without problem. The <citerefentry> <refentrytitle>debi</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> command helps you to test to install all the generated binary packages.
ca: Prova d'instal·lar el paquet, per exemple, fent servir l'ordre <citerefentry> <refentrytitle>debi</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> com a usuari «root». Intenta instal·lar-lo i executar-lo en altres màquines (diferents a la que has fet servir per a la construcció del paquet) i posa atenció per detectar errors o avisos en la instal·lació i en l'execució del programa.
es: Instala el paquete para probarlo tú mismo, por ejemplo, usando la orden <citerefentry> <refentrytitle>debi</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> como superusuario. Intenta instalarlo y ejecutarlo en otras máquinas distintas de la tuya, y presta atención para detectar errores o avisos tanto en la instalación como en la ejecución del programa.
fr: Vous devez essayer votre paquet pour vérifier qu'il s'installe sans problème. La commande <citerefentry> <refentrytitle>debi</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> vous permet d'essayer l'installation de tout paquet binaire créé.
it: Bisogna verificare che il pacchetto si installi senza problemi. Il comando <citerefentry> <refentrytitle>debi</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> aiuta a testare l'installazione di tutti i pacchetti binari generati.
ja: あなたのパッケージが問題なくインストールできるかどうかをテストしなければなりません。<citerefentry> <refentrytitle>debi</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> コマンドはあなたが作成した全てのバイナリパッケージのインストールテストに役立ちます。

source: You have to make sure that there are no overlapped files with other existing packages using the <filename>Contents-<replaceable>i386</replaceable></filename> file downloaded from the Debian archive to prevent installation problem on different systems. The <command>apt-file</command> command may be handy for this task. If there are overlapped files, please take actions to avoid the real problem using the alternatives mechanism (see <citerefentry> <refentrytitle>update-alternatives</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) by coordinating with other affected packages or by setting the <literal>Conflicts</literal> entry in the <filename>debian/control</filename> file.
ca: Has d'assegurar-te que no hi hagi fitxers en conflicte amb altres paquets fent servir el fitxer <filename>Contents-<replaceable>i386</replaceable></filename>, (disponible al repositori Debian) per prevenir problemes d'instal·lació en distints sistemes. L'ordre <command>apt-file</command> serà útil per fer aquesta comprovació. Si hi ha fitxers en conflicte, hauràs de fer el que sigui necessari per evitar-los fent servir el mecanisme d'alternatives (consulta <citerefentry> <refentrytitle>update-alternatives</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) en coordinació amb els responsables dels altres paquets o bé establint correctament el camp <literal>Conflicts</literal> del fitxer <filename>debian/control</filename>.
es: Debes asegurarte que no haya archivos en conflicto con otros paquetes utilizando el archivo <filename>Contents-<replaceable>i386</replaceable></filename>, (descargándolo del repositorio Debian) para prevenir problemas de instalación en distintos sistemas. La orden <command>apt-file</command> será útil para realizar esta tarea. Si hay archivos en conflicto, deberás hacer lo necesario para evitar problemas utilizando el mecanismo de alternativas (véase <citerefentry> <refentrytitle>update-alternatives</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) coordinándote con los responsables de los otros paquetes o bien estableciendo correctamente el campo <literal>Conflicts</literal> del archivo <filename>debian/control</filename>.
fr: Vous devez vérifier qu'il n'y a pas de fichier en conflit avec ceux existants dans d'autres paquets à l'aide du fichier <filename>Contents-<replaceable>i386</replaceable></filename> téléchargé depuis l'archive Debian pour éviter les problèmes d'installation sur différents systèmes. La commande <command>apt-file</command> peut être pratique pour cela. S'il existe des fichiers en conflit, veuillez prendre les mesures nécessaires pour éviter les vrais problèmes avec le mécanisme d'alternatives (cf. <citerefentry> <refentrytitle>update-alternatives</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) en vous coordonnant avec les responsables de l'autre paquet concerné ou en configurant le champs « <literal>Conflicts</literal> » du fichier <filename>debian/control</filename>.
it: Bisogna assicurarsi che non ci siano file che si sovrappongono ad altri pacchetti esistenti utilizzando il file <filename>Contents-<replaceable>i386</replaceable></filename> scaricato dall'archivio Debian per prevenire problemi di installazione su sistemi differenti. Il comando <command>apt-file</command> può tornare utile a questo scopo. Se ci sono file che si sovrappongono, si prega di prendere delle misure per evitare l'insorgere del problema utilizzando meccanismi alternativi (si veda <citerefentry> <refentrytitle>update-alternatives</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) che permettendo di coordinarsi con gli altri pacchetti interessati o settano la voce <literal>Conflicts</literal> nel file <filename>debian/control</filename>.
ja: 別のシステムでインストール時に問題が起きるのを防ぐために、Debian アーカイブよりダウンロードした <filename>Contents-<replaceable>i386</replaceable></filename> ファイルを用いて、他の既存のパッケージと重複するファイルがないことを確認しておかなければなりません。<command>apt-file</command> コマンドはこの作業において恐らく役に立つでしょう。重複するファイルが存在するならば、実際に問題になることを回避するために alternatives (<citerefentry> <refentrytitle>update-alternatives</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> 参照)を用いて他の影響のあるパッケージと調整するか、<filename>debian/control</filename>に <literal>Conflicts</literal> エントリを追加して下さい。

source: Verifying package for <emphasis>maintainer scripts</emphasis>
ca: Comprovar els <emphasis>guions del desenvolupador</emphasis> («maintainer scripts»).
es: Comprobando los <emphasis>guiones del desarrollador</emphasis> («maintainer scripts»)
fr: Vérification des <emphasis>scripts du responsable</emphasis> du paquet
it: Verifica del pacchetto per gli <emphasis>script del manutentore</emphasis>
ja: パッケージの<emphasis>メンテナスクリプト</emphasis>の検証

source: All <emphasis>maintainer scripts</emphasis>, i.e., <filename>preinst</filename>, <filename>prerm</filename>, <filename>postinst</filename>, and <filename>postrm</filename> files, are non-trivial unless they are auto-generated by the <systemitem role="package">debhelper</systemitem> programs. So do not use them if you are a novice maintainer (see <xref linkend="maintscripts"/> ).
ca: Ja s'ha comentat que els <emphasis>guions d'instal·lació</emphasis> (els fitxers <filename>preinst</filename>, <filename>prerm</filename>, <filename>postinst</filename> i <filename>postrm</filename>) són complicats, excepte si s'utilitzen els generats per el paquet <systemitem role="package">debhelper</systemitem>. No es recomana la seva utilització als desenvolupadors principiants (consulta <xref linkend="maintscripts"/> ).
es: Ya se ha comentado que los <emphasis>guiones del desarrollador</emphasis> (los archivos <filename>preinst</filename>, <filename>prerm</filename>, <filename>postinst</filename> y <filename>postrm</filename>) son complicados, excepto si se utilizan los generados por el paquete <systemitem role="package">debhelper</systemitem>. No se recomienda su utilización a los desarrolladores principiantes (véase <xref linkend="maintscripts"/> ).
fr: Tous les <emphasis>scripts du responsable</emphasis>, c'est-à-dire les fichiers <filename>preinst</filename>, <filename>prerm</filename>, <filename>postinst</filename> et <filename>postrm</filename> files, ne sont pas triviaux, à moins qu'ils n'aient été générés automatiquement par les programmes <systemitem role="package">debhelper</systemitem>. Ne les utilisez donc pas si vous êtes un responsable débutant, cf. <xref linkend="maintscripts"/> .

source: If the package makes use of these non-trivial <emphasis>maintainer scripts</emphasis>, be sure to test not only for install but also for remove, purge, and upgrade. Many <emphasis>maintainer script</emphasis> bugs show up when packages are removed or purged. Use the <command>dpkg</command> command as follows to test them.
es: Si el paquete utiliza estos <emphasis>guiones del desarrollador</emphasis> modificados o no triviales, debes comprobar su funcionamiento en la instalación, desinstalación, eliminación y actualización. Algunos errores en estos <emphasis>guiones del desarrollador</emphasis> sólo se producen cuando los paquetes se eliminan o purgan. Utiliza la orden <command>dpkg</command> como se indica a continuación para probarlos:
fr: Si le paquet utilise des <emphasis>scripts du responsable</emphasis> non triviaux, veuillez les essayer non seulement pour l'installation, mais aussi la suppression, la purge et la mise à niveau. De nombreux bogues dans les <emphasis>scripts du responsable</emphasis> surviennent lors de la suppression et de la purge. Utilisez la commande <command>dpkg</command> comme ceci pour les essayer :
it: Se il pacchetto utilizza questi particolari <emphasis>script del manutentore</emphasis>, ci si assicuri di effettuare delle prove non solo per l'operazione di install, ma anche per il remove, purge, e l'upgrade. Molti bu degli <emphasis>script del manutentore</emphasis> vengono fuori quando i pacchetti sono rimossi o viene applicato il purge. Si utilizzi il comando <command>dpkg</command> nel seguente modo per testarli.
ja: パッケージがこれらの重要な<emphasis>メンテナスクリプト</emphasis>を使用するならば、インストールだけではなく、削除、完全削除 (purge)、そしてアップグレードについてもテストしておかなければなりません。多くの<emphasis>メンテナスクリプト</emphasis>のバグは削除もしくは完全削除の場合に発生します。これらのテストのためには、以下の様に <command>dpkg</command> コマンドを実行します。

source: This should be done with sequences such as the following.
ca: Segueix aquesta seqüència per a la comprovació:
es: Sigue esta secuencia para la comprobación:
fr: Les séquences suivantes devraient être essayées :
it: Questa operazione si dovrebbe effettuare con delle sequenze di questo tipo.
ja: 以下のような順番で実行すべきでしょう。

source: install the previous version (if needed).
ca: Instal·la la versió anterior del paquet (obligatori).
es: Instala la versión anterior del paquete (requerido).
fr: installation de la version précédente (si elle existe) ;
it: installazione della versione precedente (se necessaria).
ja: (可能な場合は)前回バージョンをインストールします。

source: upgrade it from the previous version.
ca: Actualitza ara a la versió actual.
es: Actualiza ahora a la versión actual.
fr: mise à niveau depuis la version précédente ;
it: aggiornamento dalla versione precedente.
ja: 旧バージョンからアップグレードします。

source: downgrade it back to the previous version (optional).
ca: Torna a la versió anterior (opcional).
es: Vuelve a la versión anterior (opcional).
fr: dégradation (« downgrade ») à la version précédente (optionnel) ;
it: ritorno alla versione precedente (opzionale).
ja: 旧バージョンになるよう、ダウングレードします (オプション)。

source: purge it.
ca: Desinstal·la el paquet.
es: Elimínalo.
fr: purge ;
it: applicazione del purge.
ja: 完全削除 (purge) します。

source: install the new package.
ca: Instal·la la nova versió del paquet.
es: Instala la nueva versión del paquete.
fr: installation du nouveau paquet ;
it: installazione del nuovo pacchetto.
ja: 新しいパッケージとしてインストールします。

source: remove it.
ca: Elimina'l.
es: Elimínalo.
fr: suppression (« remove ») du paquet.
it: rimozione del pacchetto.
ja: 削除します。

source: install it again.
ca: Instal·la'l de nou.
es: Instálalo de nuevo.
fr: installation du paquet, encore.
it: reinstallazione del pacchetto.
ja: もう一度インストールします。

source: If this is your first package, you should create dummy packages with different versions to test your package in advance to prevent future problems.
ca: Si treballes en la construcció de la primera versió del paquet, construeix versions «fantasma» anteriors (és suficient canviar el número de versió) per realitzar les proves i prevenir problemes.
es: Si estás trabajando en la construcción de la primera versión del paquete, construye versiones «fantasma» anteriores (será suficiente cambiar el número de la versión) para realizar las pruebas y así prevenir problemas.
fr: Pour votre premier paquet, vous devriez créer des paquets factices avec différentes versions pour essayer votre paquet à l'avance et éviter des problèmes par la suite.
it: Se si sta creando il primo pacchetto, andrebbero creati dei pacchetti fittizi con diversi numeri di versione per testare il pacchetto originale in anticipo e prevenire problemi futuri.
ja: これが最初に作成したパッケージならば、将来発生するかもしれない問題を防ぐために、異なるバージョンのダミーパッケージを作成すべきです。

source: Bear in mind that if your package has previously been released in Debian, people will often be upgrading to your package from the version that was in the last Debian release. Remember to test upgrades from that version too.
ca: Recorda que si hi ha versions anteriors del paquet en el repositori Debian, els usuaris actualitzaran el paquet des de la versió anterior disponible (i aquesta versió pot ésser distinta en la versió estable i de proves). Realitza les comprovacions també amb aquestes versions.
es: Recuerda que si ya hay versiones anteriores del paquete en el repositorio Debian, los usuarios actualizarán el paquete desde la versión anterior disponible (y esta versión puede ser distinta en la versión estable y de pruebas). Realiza las comprobaciones también con estas versiones.
fr: Gardez à l'esprit que si votre paquet a déjà été publié avec Debian, des gens vont mettre à jour ce paquet à partir de la version qui était dans la publication Debian précédente. Souvenez-vous d'essayer aussi les mises à jour à partir de cette version.
it: Si tenga in mente che se il pacchetto è stato già rilasciato in Debian, le persone spesso effettueranno un aggiorneranno a quest'ultimo a partire dall'ultima versione disponibile su Debian. Si ricordi di testare gli aggiornamenti anche a partire da questa versione.
ja: あなたのパッケージが過去の Debian にてリリースされていた場合には、人々は大抵最新の Debian のリリース版に含まれているバージョンからパッケージのアップグレードをするであろう、ということに配慮しましょう。上記の手順で、そのバージョンからきちんとアップグレードできることを、忘れずに確認しておいてください。

source: Although downgrade is not officially supported, it should be nice to support it.
ca: Encara que no es garanteix la reinstal·lació d'una versió anterior, és preferible assegurar-se que és possible fer-ho sense generar problemes.
es: Aunque no se garantiza la reinstalación de una versión anterior, es preferible asegurarse que es posible sin generar problemas.
fr: Même si la dégradation n'est pas officiellement gérée, il est préférable de la permettre.
it: Anche se il ritorno ad una versione precedente non è supportato ufficialmente, sarebbe buona abitudine che lo fosse.
ja: ダウングレードは公式にはサポートされていませんが、これをサポートしておいてくれると素敵ですね。

source: You do not need to provide the <command>lintian</command> option <literal>-i -I --show-overrides</literal> if you customized <filename>/etc/devscripts.conf</filename> or <filename>~/.devscripts</filename> as described in <xref linkend="debuild"/> .
ca: No és necessari afegir a <command>lintian</command> l'opció <literal>-i -I --show-overrides</literal> si l'has inclòs en la configuració a <filename>/etc/devscripts.conf</filename> o <filename>~/.devscripts</filename> com s'ha explicat a <xref linkend="debuild"/> .
fr: Il n'est pas nécessaire d'ajouter le paramètre « <literal>-i -I --show-overrides</literal> » à <command>lintian</command> si vous avez personnalisé <filename>/etc/devscripts.conf</filename> ou <filename>~/.devscripts</filename> comme décrit en <xref linkend="debuild"/> .

source: Run <citerefentry> <refentrytitle>lintian</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> on your <filename>.changes</filename> file. The <command>lintian</command> command runs many test scripts to check for many common packaging errors. <placeholder type="footnote" id="0"/>
ca: Executa <citerefentry> <refentrytitle>lintian</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> amb el teu arxiu de canvis <filename>.changes</filename>. L'ordre <command>lintian</command> executa diversos guions de comprovació del paquet per localitzar els errors més freqüents <placeholder type="footnote" id="0"/>.
fr: Exécutez <citerefentry> <refentrytitle>lintian</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> sur le fichier <filename>.changes</filename>. La commande <command>lintian</command> exécute de nombreux scripts de tests pour vérifier la plupart des erreurs habituelles d'empaquetage. <placeholder type="footnote" id="0"/>
it: Si esegua <citerefentry> <refentrytitle>lintian</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> sul file <filename>.changes</filename>. Il comando <command>lintian</command> esegue molti script di test alla ricerca dei più comuni errori di pacchettizzazione. <placeholder type="footnote" id="0"/>
ja: <citerefentry> <refentrytitle>lintian</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> を <filename>.changes</filename> に対して実行しましょう。<command>lintian</command> コマンドはパッケージ作成時のよくある間違いをチェックするために多くのテストスクリプトを実行します。<placeholder type="footnote" id="0"/>

source: Of course, replace the filename with the name of the <filename>.changes</filename> file generated for your package. The output of the <command>lintian</command> command are marked as follows.
ca: Per suposat, canvia el nom de l'arxiu pel nom de l'arxiu <filename>.changes</filename> del teu paquet. Els missatges d'error de <command>lintian</command> es codifiquen amb una lletra inicial en la línia del missatge:
es: Por supuesto, cambia el nombre del fichero por el nombre del fichero <filename>.changes</filename> generado por tu paquete. Los mensajes de error de <command>lintian</command> se codifican con una letra al inicio de la línea del mensaje:
fr: Bien sûr, remplacez le nom de fichier par celui du fichier <filename>.changes</filename> créé pour votre paquet. La sortie de la commande <command>lintian</command> est marquée ainsi :
it: Ovviamente va rimpiazzato il nome con quello del file <filename>.changes</filename> generato per il pacchetto. I risultati del comando <command>lintian</command> vengono qui elencati di seguito.
ja: もちろん、<filename>.changes</filename> のファイル名はあなたが作成したパッケージに置き換えて下さい。<command>lintian</command> コマンドの出力は以下のようにマークされています。

source: <literal>E:</literal> for error; a sure policy violation or a packaging error.
ca: <literal>E:</literal> error; per indicar violacions de les normes o un error en el paquet.
es: <literal>E:</literal> para los errores; indica violaciones de las normas o un error en el paquete.
fr: <literal>E:</literal> pour erreur ; une violation certaine de la Charte ou erreur d'empaquetage ;
it: <literal>E:</literal> errore; una violazione certa di una policy o un errore di pacchettizzazione.
ja: <literal>E:</literal> はエラーです。 確実にポリシー違反もしくはパッケージエラーです。

source: <literal>W:</literal> for warning; a possible policy violation or a packaging error.
ca: <literal>W:</literal> advertència; per advertir d'una possible violació de les normes o error en el paquet (però pot ésser una falsa alarma).
es: <literal>W:</literal> para las advertencias; indica una posible violación de las normas o error en el paquete (pero pudiendo ser una falsa alarma).
fr: <literal>W:</literal> pour avertissement ; une violation possible de la Charte ou erreur d'empaquetage ;
it: <literal>W:</literal> attenzione; una possibile violazione di policy o un errore della pacchettizzazione.
ja: <literal>W:</literal> は警告です。 ポリシー違反もしくはパッケージエラーである可能性があります。

source: <literal>I:</literal> for info; a information on certain packaging aspects.
ca: <literal>I:</literal> informació; informació sobre algun aspecte del paquet (que tal vegada és millorable).
es: <literal>I:</literal> para información; proporciona algo de información sobre algún aspecto del paquete (que tal vez sea mejorable).
fr: <literal>I:</literal> pour information ; une information sur certains aspects d'empaquetage ;
it: <literal>I:</literal> informazione; una informazione su alcuni aspetti della pacchettizzazione.
ja: <literal>I:</literal> は参考情報です。パッケージのとある性質について参考となる情報を提供します。
