Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: It actually looks for the first available target of <literal>distclean</literal>, <literal>realclean</literal> or <literal>clean</literal> in <filename>Makefile</filename> and execute it.
ca: Mira el primer objectiu disponible entre <literal>distclean</literal>, <literal>realclean</literal> o <literal>clean</literal> a l'arxiu <filename>Makefile</filename> i l'executa.
es: En realidad busca el primer objetivo <literal>distclean</literal>, <literal>realclean</literal> o <literal>clean</literal> disponible en el <filename>Makefile</filename> y lo ejecuta.
fr: En fait il recherche la première cible disponible parmi <literal>distclean</literal>, <literal>realclean</literal> et <literal>clean</literal> dans <filename>Makefile</filename> et l'exécute.
it: Attualmente il programma esegue il primo target <literal>distclean</literal>, <literal>realclean</literal> o <literal>clean</literal> prensente nel <filename>Makefile</filename>
ja: 実際には、<filename>Makefile</filename>中の<literal>distclean</literal>、<literal>realclean</literal>、 <literal>clean</literal>のうち、最初に利用可能なものを実行します。

source: <command>dh_auto_clean</command> usually executes the following if <filename>Makefile</filename> exists with the <literal>distclean</literal> target. <placeholder type="footnote" id="0"/>
ca: <command>dh_auto_clean</command> executa el seguent si hi ha un arxiu <filename>Makefile</filename> amb l'objectiu <literal>distclean</literal> <placeholder type="footnote" id="0"/>.
es: <command>dh_auto_clean</command> normalmente ejecuta lo siguiente, siempre que exista un fichero <filename>Makefile</filename> con el objetivo <literal>distclean</literal><placeholder type="footnote" id="0"/>.
fr: <command>dh_auto_clean</command> exécute normalement ce qui suit si <filename>Makefile</filename> fournit la cible <literal>distclean</literal> : <placeholder type="footnote" id="0"/>
it: <command>dh_auto_clean</command> normalmente esegue i seguenti comandi se nel <filename>Makefile</filename> è presente il target <literal>distclean</literal>.<placeholder type="footnote" id="0"/>
ja: <command>dh_auto_clean</command>は、<filename>Makefile</filename>に<literal>distclean</literal>ターゲットがあれば以下のコマンドを実行します。<placeholder type="footnote" id="0"/>

source: <command>dh_auto_configure</command> usually executes the following if <filename>./configure</filename> exists (arguments abbreviated for readability).
ca: <command>dh_auto_configure</command> executa el següent si es fa servir el fitxer <filename>./configure</filename> (els arguments s'ha abreviat per facilitar la lectura):
es: <command>dh_auto_configure</command> ejecuta lo siguiente si existe el archivo <filename>./configure</filename> (se han abreviado los argumentos para facilitar la lectura).
fr: <command>dh_auto_configure</command> exécute normalement ce qui suit si <filename>./configure</filename> existe (les paramètres sont abrégés pour la lisibilité) :
it: <command>dh_auto_configure</command> normalmente esegue i seguenti comandi se esiste il file <filename>./configure</filename> (argomenti abbreviati for una maggiore leggibilità).
ja: <command>dh_auto_configure</command>は、<filename>./configure</filename>があれば以下のコマンドを実行します。 (読みやすくするために引数は省略しました)

source: <command>dh_auto_build</command> usually executes the following to execute the first target of <filename>Makefile</filename> if it exists.
ca: <command>dh_auto_build</command> executa el següent per executar el primer objectiu del fitxer <filename>Makefile</filename> (si es fa servir aquest arxiu).
es: <command>dh_auto_build</command> ejecuta lo siguiente para ejecutar el primer objetivo del archivo <filename>Makefile</filename> (supuesto que este existe).
fr: <command>dh_auto_build</command> exécute normalement ce qui suit pour exécuter la première cible de <filename>Makefile</filename> si elle existe :
it: <command>dh_auto_build</command> normalmente lancia il seguente comando per eseguire, se esiste, il primo obiettivo del <filename>Makefile</filename>.
ja: <command>dh_auto_build</command>は、 <filename>Makefile</filename>があれば、その最初のターゲットをビルドするために、以下のコマンドを実行します。

source: It actually looks for the first available target of <literal>test</literal> or <literal>check</literal> in <filename>Makefile</filename> and execute it.
ca: En realitat executa el primer dels objectius <literal>test</literal> o <literal>check</literal> del fitxer <filename>Makefile</filename>.
es: En realidad busca el primero de los objetivos <literal>test</literal> o <literal>check</literal> en el archivo <filename>Makefile</filename> y lo ejecuta.
fr: En fait il recherche la première cible disponible parmi <literal>test</literal> et <literal>check</literal> dans <filename>Makefile</filename> et l'exécute.
it: Attualmente il programma esegue il primo target <literal>test</literal> o <literal>check</literal> nel <filename>Makefile</filename>
ja: 実際には、<filename>Makefile</filename>中の<literal>test</literal>か<literal>check</literal>のうち、最初に利用可能なものを実行します。

source: <command>dh_auto_test</command> usually executes the following if <filename>Makefile</filename> exists with the <literal>test</literal> target. <placeholder type="footnote" id="0"/>
ca: <command>dh_auto_test</command> executa el següent si existeix l'objectiu <literal>test</literal> en el fitxer <filename>Makefile</filename> <placeholder type="footnote" id="0"/>.
es: <command>dh_auto_test</command> ejecuta lo siguiente si existe el objetivo <literal>test</literal> en el archivo <filename>Makefile</filename> <placeholder type="footnote" id="0"/>.
fr: <command>dh_auto_test</command> exécute normalement ce qui suit si <filename>Makefile</filename> fournit la cible <literal>test</literal> : <placeholder type="footnote" id="0"/>
it: <command>dh_auto_clean</command> normalmente esegue i seguenti comandi con l'obiettivo <literal>distclean</literal> se esiste il file <filename>Makefile</filename>.<placeholder type="footnote" id="0"/>
ja: <command>dh_auto_test</command>は、<filename>Makefile</filename>中に<literal>test</literal> ターゲットがあれば、以下を実行します。<placeholder type="footnote" id="0"/>

source: <command>dh_auto_install</command> usually executes the following if <filename>Makefile</filename> exists with the <literal>install</literal> target (line folded for readability).
ca: <command>dh_auto_install</command> executa el següent si existeix l'objectiu <literal>install</literal> en el fitxer <filename>Makefile</filename> (s'ha truncat la línia per facilitar la lectura):
es: <command>dh_auto_install</command> ejecuta lo siguiente si en el archivo <filename>Makefile</filename> existe el objetivo <literal>install</literal> (se ha truncado la linea para permitir su lectura).
fr: <command>dh_auto_install</command> exécute normalement ce qui suit si <filename>Makefile</filename> fournit la cible <literal>install</literal> (la ligne est coupée pour la lisibilité) :
it: <command>dh_auto_install</command> normalmente esegue il seguente comando con l'obiettivo <literal>install</literal> se esiste il file <filename>Makefile</filename> (riga spezzata per aumentare la leggibilità).
ja: <command>dh_auto_install</command>は、<filename>Makefile</filename>に<literal>install</literal>ターゲットがあれば、以下のコマンドを実行します。 (読みやすくするために畳み込みました)。

source: make install \ DESTDIR=<replaceable>/path/to</replaceable>/<replaceable>package</replaceable>_<replaceable>version</replaceable>-<replaceable>revision</replaceable>/debian/<replaceable>package</replaceable>
ca: make install \ DESTDIR=<replaceable>/directori/del</replaceable>/<replaceable>paquet</replaceable>_<replaceable>versió</replaceable>-<replaceable>revisió</replaceable>/debian/<replaceable>nom_paquet</replaceable>
es: make install \ DESTDIR=<replaceable>/ruta/a</replaceable>/<replaceable>paquete</replaceable>_<replaceable>versión</replaceable>-<replaceable>revisión</replaceable>/debian/<replaceable>paquete</replaceable>
fr: make install \ DESTDIR=<replaceable>/chemin/vers</replaceable>/<replaceable>paquet</replaceable>_<replaceable>version</replaceable>-<replaceable>revision</replaceable>/debian/<replaceable>paquet</replaceable>

source: Targets which require the <command>fakeroot</command> command contain <command>dh_testroot</command>. If you are not pretending to be root using this command, it exits with an error.
ca: Els objectius que cal executar amb l'ordre <command>fakeroot</command> contenen <command>dh_testroot</command>. Si no fas servir l'ordre «fakeroot» per simular l'execució per l'usuari «root», es produirà una errada que aturarà l'execució.
es: Los objetivos que deben ejecutarse con la orden <command>fakeroot</command> contienen <command>dh_testroot</command>. Si no utilizas la orden para simular la ejecución por el usuario «root», se producirá un error que detendrá la ejecución.
fr: Les cibles ayant besoin de la commande <command>fakeroot</command> contiennent <command>dh_testroot</command>. Si vous ne vous faites pas passer pour le superutilisateur lors de l'utilisation de cette commande, elle se terminera en erreur.
it: Gli obiettivi che richiedono il comando <command>fakeroot</command> contengono <command>dh_testroot</command>. Se non si sta fingendo di essere root utilizzando questo comando, questo terminerà con un errore.
ja: <command>fakeroot</command>コマンドを必要とするターゲットは<command>dh_testroot</command>を含みます。このコマンドでルートのふりをしなければ、エラーで終了します。

source: The important part to know about the <filename>rules</filename> file created by <command>dh_make</command>, is that it is just a suggestion. It will work for most packages but for more complicated ones, don't be afraid to customize it to fit your needs. Only things that you must not change are the names of the rules, because all the tools use these names, as mandated by the Debian Policy.
ca: És important tenir present que el fitxer <filename>rules</filename> construït per <command>dh_make</command> només és un exemple. Serà útil per a la majoria dels paquets simples, però no deixis de fer les adaptacions necessàries. L'únic que no pots canviar són els noms de les regles, degut a què totes les eines fan servir el mateixos seguint les normes de Debian.
es: Es importante tener presente que el archivo <filename>rules</filename> que genera <command>dh_make</command> es sólo una sugerencia. Será suficiente para la mayoría de los paquetes simples, pero no dejes de adaptarlo a tus necesidades en paquetes más complejos. Lo único que no debes cambiar son los nombres de las reglas, puesto que todas las herramientas los utilizan, como se especifica en la normas de Debian.
fr: Le plus important à propos du fichier <filename>rules</filename> créé par <command>dh_make</command>, c'est qu'il s'agit d'une simple suggestion. Il fonctionnera pour la plupart des paquets, mais pour les plus compliqués, vous ne devez pas hésiter à le modifier pour le faire correspondre à vos besoins. Les seules choses à ne pas pas changer sont les noms des règles, car tous les outils utilisent ces noms, conformément à la Charte.
it: La cosa importante da sapere riguardo al file <filename>rules</filename> creato da <command>dh_make</command>, è che il suo contenuto contiene dei semplici consigli. Funzionerà per la maggior parte dei pacchetti ma per i più complicati non si esiti a personalizzarlo secondo le proprie esigenze. Le uniche cose che non vanno cambiate sono i nomi delle regole, perché tutti gli strumenti utilizzano questi nomi, così come è indicato dalle policy di Debian.
ja: <command>dh_make</command>によって作成された<filename>rules</filename>ファイルについて知っておくべきことは、これは単なるひとつの例でしかないということです。 これはほぼ全てのパッケージに有効ですが、もっと複雑なものに対しては、必要に応じてカスタマイズをする勇気が必要です。ただし、ファイル内に記述された各ルールの名前だけは変えてはいけません。

source: Although <literal>install</literal> is not required target, it is supported. <literal>fakeroot dh install</literal> behaves like <literal>fakeroot dh binary</literal> but stops after <command>dh_fixperms</command>.
ca: Malgrat que <literal>install</literal> no és un objectiu obligatori, es considera el seu ús. <literal>fakeroot dh install</literal> es comporta com <literal>fakeroot dh binary</literal> però s'atura després de <command>dh_fixperms</command>.
es: A pesar de que <literal>install</literal> no es un objetivo obligatorio, se contempla su uso. <literal>fakeroot dh install</literal> se comporta como <literal>fakeroot dh binary</literal> pero se detiene después de <command>dh_fixperms</command>.
fr: Bien que la cible « <literal>install</literal> » ne soit pas obligatoire, elle est gérée. « <literal>fakeroot dh install</literal> » se comporte comme « <literal>fakeroot dh binary</literal> » mais s'arrête après <command>dh_fixperms</command>.
it: Anche se l'obiettivo <literal>install</literal> non è richiesto, è comunque supportato. <literal>fakeroot dh install</literal> si comporta come <literal>fakeroot dh binary</literal> ma si ferma dopo <command>dh_fixperms</command>.
ja: <literal>install</literal>は、必須ではりませんがサポートはされています。<literal>fakeroot dh install</literal> は <literal>fakeroot dh binary</literal> のようにふるまいますが、<command>dh_fixperms</command>の後で停止します。

source: Customization of <filename>rules</filename> file
ca: Personalització del fitxer <filename>rules</filename>.
es: Personalización del archivo <filename>rules</filename>
fr: Personnalisation du fichier <filename>rules</filename>
it: Personalizzazione del file <filename>rules</filename>
ja: <filename>rules</filename> ファイルのカスタマイズ

source: There are many ways to customize the <filename>rules</filename> file created with the new <command>dh</command> command.
ca: Pots fer molts canvis per adaptar el fitxer <filename>rules</filename> construït per l'ordre <command>dh</command>.
es: Puedes realizar muchos cambios para adaptar el archivo <filename>rules</filename> construido por la orden <command>dh</command>.
fr: Il existe plusieurs façons de personnaliser le fichier <filename>rules</filename> créé avec la nouvelle commande <command>dh</command>.
it: Verrà qui spiegata la personalizzazione del file <filename>rules</filename>, creato con il nuovo comando <command>dh</command>.
ja: 新しい<command>dh</command>コマンドで作成された<filename>rules</filename>ファイルをカスタマイズする方法は何通りもあります。

source: If a package installs the <filename>/usr/share/perl5/Debian/Debhelper/Sequence/<replaceable>custom_name</replaceable>.pm</filename> file, you should activate its customization function by <literal>dh --with <replaceable>custom-name</replaceable> $@</literal>.
ca: Si un paquet instal·la el fitxer <filename>/usr/share/perl5/Debian/Debhelper/Sequence/<replaceable>nom_arxiu</replaceable>.pm</filename> pots activar la funció adaptada amb <literal>dh --with <replaceable>nom_arxiu</replaceable> $@</literal>.
es: Si un paquete instala el archivo <filename>/usr/share/perl5/Debian/Debhelper/Sequence/<replaceable>nombre_archivo</replaceable>.pm</filename> puedes activar la función adaptada con <literal>dh --with <replaceable>nombre_archivo</replaceable> $@</literal>.
fr: Si un paquet installe le fichier <filename>/usr/share/perl5/Debian/Debhelper/Sequence/<replaceable>nom_personnalise</replaceable>.pm</filename>, vous devriez déclencher sa fonction de personnalisation avec « <literal>dh --with <replaceable>nom-personnalise</replaceable> $@</literal> .
it: Se il pacchetto installata il file <filename>/usr/share/perl5/Debian/Debhelper/Sequence/<replaceable>nome_personalizzato</replaceable>.pm</filename>, si deve attivare la funzione di personalizzazione tramite il comando <literal>dh --with <replaceable>nome-personalizzato</replaceable> $@</literal>.
ja: もし、パッケージが <filename>/usr/share/perl5/Debian/Debhelper/Sequence/<replaceable>custom_name</replaceable>.pm</filename>ファイルをインストールする場合、そのカスタマイズの機能を <literal>dh --with <replaceable>custom-name</replaceable> $@</literal>で有効にしなければなりません。

source: The <literal>dh $@</literal> command can be customized as follows. <placeholder type="footnote" id="0"/>
ca: L'ordre <literal>dh $@</literal> permet les següents adaptacions <placeholder type="footnote" id="0"/>:
es: La orden <literal>dh $@</literal> permite las siguientes adaptaciones <placeholder type="footnote" id="0"/>:
fr: La commande « <literal>dh $@</literal> » peut être personnalisée comme suit : <placeholder type="footnote" id="0"/>
it: Il comando <literal>dh $@</literal> può essere personalizzato come segue. <placeholder type="footnote" id="0"/>
ja: <literal>dh $@</literal> コマンドは以下の方法でカスタマイズできます。<placeholder type="footnote" id="0"/>

source: Use of the <command>dh_pysupport</command> command is preferred over use of the <command>dh_pycentral</command> command. Do not use the <command>dh_python</command> command.
ca: És preferible fer servir l'ordre <command>dh_pysupport</command> abans que l'ordre <command>dh_pycentral</command>. No facis servir l'ordre <command>dh_python</command>.
es: Es preferible el uso de la orden <command>dh_pysupport</command> respecto a la orden <command>dh_pycentral</command>. No uses la orden <command>dh_python</command>.
fr: L'utilisation de la commande <command>dh_pysupport</command> est préférable à <command>dh_pycentral</command>. N'utilisez pas la commande <command>dh_python</command>.
it: L'uso del comando <command>dh_pysupport</command> è preferito rispetto all'uso di del comando <command>dh_pycentral</command>. Non si deve utilizzare il comando <command>dh_python</command>.
ja: <command>dh_pycentral</command>コマンドよりも<command>dh_pysupport</command>コマンドが好まれます。<command>dh_python</command>コマンドは使用しないでください。

source: Add support of the <command>dh_pysupport</command> command. (The best choice for Python.) <placeholder type="footnote" id="0"/>
ca: Afegir funcionalitat per a l'ordre <command>dh_pysupport</command> (la millor opció per a Python) <placeholder type="footnote" id="0"/>.
es: Añadiendo la orden <command>dh_pysupport</command> (la mejor opción para Python) <placeholder type="footnote" id="0"/>.
fr: ajout de l'assistance de la commande <command>dh_pysupport</command> (la meilleure solution pour Python) : <placeholder type="footnote" id="0"/>
it: Aggiunge il supporto per il comando <command>dh_pysupport</command>. (La scelta migliore per Python) <placeholder type="footnote" id="0"/>
ja: <command>dh_pysupport</command> コマンドのサポートを追加する(Pythonに最適の選択) <placeholder type="footnote" id="0"/>

source: Install the <systemitem role="package">python-support</systemitem> package in <literal>Build-Depends</literal>.
ca: Afegeix el paquet <systemitem role="package">python-support</systemitem> en el camp <literal>Build-Depends</literal>.
es: Añade el paquete <systemitem role="package">python-support</systemitem> en el campo <literal>Build-Depends</literal>.
fr: ajout de <systemitem role="package">python-support</systemitem> à « <literal>Build-Depends</literal> » ;
it: Installa il pacchetto <systemitem role="package">python-support</systemitem> in <literal>Build-Depends</literal>.
ja: <systemitem role="package">python-support</systemitem>を<literal>Build-Depends</literal>にインストールします。

source: Use <literal>dh $@</literal> as usual. (This is enabled by default)
ca: No cal fer canvis en <literal>dh $@</literal> (és l'opció predeterminada).
es: Utiliza <literal>dh $@</literal> como de costumbre (es la opción predeterminada).
fr: utilisation normale de « <literal>dh $@</literal> » (activé par défaut) ;
it: Utilizza <literal>dh $@</literal> normalmente. (Questo è abilitato in modo predefinito)
ja: 通常通り<literal>dh $@</literal>を使用します。(デフォルトで有効になっています。)

source: This handles Python modules using the <systemitem role="package">python-support</systemitem> framework.
ca: Així es gestiona el mòdul Python fent servir el entorn («framework») de <systemitem role="package">python-support</systemitem>.
es: Esto gestiona el módulo Python utilizando las funcionalidades de <systemitem role="package">python-support</systemitem>.
fr: conséquence : gestion des modules Python avec la structure <systemitem role="package">python-support</systemitem> ;
it: Gestisce i moduli Python utilizzando l'infrastruttura <systemitem role="package">python-support</systemitem>.
ja: これで<systemitem role="package">python-support</systemitem>フレームワークを使用してPythonモジュールを利用できます。

source: Add support of the <command>dh_pycentral</command> command.
ca: Afegir funcionalitat per a l'ordre <command>dh_pycentral</command>.
es: Añadiendo la orden <command>dh_pycentral</command>.
fr: ajout de l'assistance de la commande <command>dh_pycentral</command> :
it: Aggiunge il supporto al comando <command>dh_pycentral</command>.
ja: <command>dh_pycentral</command>のサポートを追加する

source: Install the <systemitem role="package">python-central</systemitem> package in <literal>Build-Depends</literal>.
ca: Afegeix el paquet <systemitem role="package">python-central</systemitem> en el camp <literal>Build-Depends</literal>.
es: Añade el paquete <systemitem role="package">python-central</systemitem> en el campo <literal>Build-Depends</literal>.
fr: ajout de <systemitem role="package">python-central</systemitem> à « <literal>Build-Depends</literal> » ;
it: Installa il pacchetto <systemitem role="package">python-central</systemitem> in <literal>Build-Depends</literal>.
ja: <literal>Build-Depends</literal>に、<systemitem role="package">python-central</systemitem>パッケージをインストールします。

source: Use <literal>dh --with python-central $@</literal> instead.
ca: Fes servir <literal>dh --with python-central $@</literal> ﻿en el seu lloc.
es: Utiliza <literal>dh --with python-central $@</literal> en su lugar.
fr: utilisation de « <literal>dh --with python-central $@</literal> » à la place ;
it: Utilizza in alternativa <literal>dh --with python-central $@</literal>
ja: 代わりに<literal>dh --with python-central $@</literal>を使用します。

source: This also deactivates the <command>dh_pysupport</command> command.
ca: També es desactiva l'ordre <command>dh_pysupport</command>.
es: Esto desactiva la orden <command>dh_pysupport</command>.
fr: conséquence : désactivation de la commande <command>dh_pysupport</command> ;
it: Disattiva anche il domando <command>dh_pysupport</command>
ja: これで<command>dh_pysupport</command>コマンドも無効化されます。

source: This handles Python modules using the <systemitem role="package">python-central</systemitem> framework.
ca: I es gestiona el mòdul Python fent servir l'entorn («framework») de <systemitem role="package">python-central</systemitem>.
es: Esto gestiona el módulo Python utilizando las funcionalidades de <systemitem role="package">python-central</systemitem>.
fr: conséquence : gestion des modules Python avec la structure <systemitem role="package">python-central</systemitem> ;
it: Gestisce i moduli Python utilizzando l'infrastruttura <systemitem role="package">python-central</systemitem>.
ja: これで<systemitem role="package">python-central</systemitem>フレームワークを使用してPythonモジュールを利用できます。

source: Add support of the <command>dh_installtex</command> command.
ca: Afegir funcionalitat per a l'ordre <command>dh_installtex</command>.
es: Añadiendo la orden <command>dh_installtex</command>.
fr: ajout de l'assistance de la commande <command>dh_installtex</command> :
it: Aggiunge il supporto al comando <command>dh_installtex</command>
ja: <command>dh_installtex</command>コマンドのサポートを追加する

source: Install the <systemitem role="package">tex-common</systemitem> package in <literal>Build-Depends</literal>.
ca: Afegeix el paquet <systemitem role="package">tex-common</systemitem> en el camp <literal>Build-Depends</literal>.
es: Añade el paquete <systemitem role="package">tex-common</systemitem> en el campo <literal>Build-Depends</literal>.
fr: ajout de <systemitem role="package">tex-common</systemitem> à « <literal>Build-Depends</literal> » ;
it: Installa il pacchetto <systemitem role="package">tex-common</systemitem> in <literal>Build-Depends</literal>.
ja: <literal>Build-Depends</literal>に、<systemitem role="package">tex-common</systemitem>パッケージをインストールします。
