Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: rename template files by removing the <literal>.ex</literal> or <literal>.EX</literal> suffix if the template files have one.
ca: elimina els sufix <literal>.ex</literal> o <literal>.EX</literal> de tots els fitxers de plantilla.
es: elimina los sufijos <literal>.ex</literal> o <literal>.EX</literal> de los archivos de plantilla que lo tengan.
fr: renommer les fichiers modèles en enlevant l'extension <literal>.ex</literal> ou <literal>.EX</literal> si elle existe ;
it: si rinomini il file modello rimuovendo l'estensione <literal>.ex</literal> o <literal>.EX</literal> se presente.
ja: <literal>.ex</literal>や<literal>.EX</literal>サフェックスがついていれば、消してください。

source: rename the name of these configuration files using the actual binary package name in place of <literal><replaceable>package</replaceable></literal>.
ca: reanomena els fitxers de configuració fent servir el nom del fitxer del paquet binari en lloc de <literal><replaceable>nom_paquet</replaceable></literal>.
es: renombra los archivos de configuración utilizando el nombre del archivo del paquete binario en lugar de <literal><replaceable>nombre_del_paquete</replaceable></literal>.
fr: renommer les fichiers de configuration en utilisant le véritable nom du paquet binaire à la place de <literal><replaceable>package</replaceable></literal> ;
it: si rinominino i file di configurazione con il nome usato dall'attuale pacchetto binario al posto di <literal><replaceable>pacchetto</replaceable></literal>.
ja: ファイル名を、<literal><replaceable>package</replaceable></literal>の代わりに、実際のバイナリパッケージの名前に変更してください。

source: modify template file contents to suit your needs.
ca: modifica el contingut dels fitxers de plantilla per adaptar-los a les teves necessitats.
es: modifica el contenido de los archivos de plantilla para adaptarlos a tus necesidades.
fr: modifiez le contenu des fichiers modèles selon vos besoins ;
it: si modifichi il contenuto del file in base al bisogno.
ja: 必要に応じて、ファイルの中身を書き換えます。

source: remove template files which you do not need.
ca: elimina els fitxers que no ﻿necessitis.
es: elimina aquellos archivos que no necesites.
fr: enlevez les fichiers modèles dont vous n'avez pas besoin ;
it: si elimini il file modello di cui non si ha più bisogno.
ja: 不要な雛形のファイルは削除してください。

source: modify the <filename>control</filename> file (see <xref linkend="control"/> ), if necessary.
ca: fes les modificacions necessàries en el fitxer <filename>control</filename> (consulta <xref linkend="control"/> ).
es: realiza las modificaciones necesarias en el archivo <filename>control</filename> (véase <xref linkend="control"/> ).
fr: si nécessaire, modifiez le fichier <filename>control</filename> (cf. <xref linkend="control"/> ) ;

source: modify the <filename>rules</filename> file (see <xref linkend="rules"/> ), if necessary.
ca: modifica el fitxer <filename>rules</filename> (consulta <xref linkend="rules"/> ) si és necessari.
es: modifica el archivo <filename>rules</filename> (véase <xref linkend="rules"/> ) si es necesario.
fr: si nécessaire, modifiez le fichier <filename>rules</filename> (cf. <xref linkend="rules"/> ).

source: Those <systemitem role="package">debhelper</systemitem> configuration files without <filename><replaceable>package</replaceable></filename> prefix such as <filename>install</filename> apply to the first binary package. When there are many binary packages, their configurations can be specified by prefixing their name to their configuration filenames such as <filename><replaceable>package-1</replaceable>.install</filename>, <filename><replaceable>package-2</replaceable>.install</filename>, etc.
ca: Els fitxers de configuració construïts per <systemitem role="package">debhelper</systemitem> que no tenen el prefix <filename><replaceable>nom_paquet</replaceable></filename> com és ara <filename>install</filename> s'aplicaran al primer paquet binari. Si hi ha més d'una paquet binari, les seves configuracions s'especificaran amb el prefix del paquet binari corresponent al seu nom: <filename><replaceable>paquet-1</replaceable>.install</filename>, <filename><replaceable>paquet-2</replaceable>.install</filename>, etc.
es: Los archivos de configuración construidos por <systemitem role="package">debhelper</systemitem> que no tienen el prefijo <filename><replaceable>nombre_del_paquete</replaceable></filename> tales como <filename>install</filename> se aplicaran al primer paquete binario. Si hay varios paquetes binarios. sus configuraciones se especificaran con el prefijo de paquete binario correspondiente en su nombre: así tendrás los archivos <filename><replaceable>paquete-1</replaceable>.install</filename>, <filename><replaceable>paquete-2</replaceable>.install</filename>, etc.
fr: Les fichiers de configuration de <systemitem role="package">debhelper</systemitem> sans préfixe <filename><replaceable>paquet</replaceable></filename> comme <filename>install</filename> sont relatifs au premier paquet binaire. Lorsqu'il y a plusieurs paquets binaires, leur configuration respective peut être précisée en ajoutant leur nom en préfixe du nom de fichier de configuration : <filename><replaceable>paquet-1</replaceable>.install</filename>, <filename><replaceable>paquet-2</replaceable>.install</filename>, etc.
it: Questi file di configurazione di <systemitem role="package">debhelper</systemitem> senza prefisso del <filename><replaceable>pacchetto</replaceable></filename>, come nel file <filename>install</filename> vengono applicati al primo pacchetto binario. Quando ci sono molti pacchetti binari le loro configurazioni possono essere specificate aggiungendo il loro prefisso al nome del file di configurazione come <filename><replaceable>pacchetto-1</replaceable>.install</filename>, <filename><replaceable>pacchetto-2</replaceable>.install</filename>, ecc.
ja: <filename><replaceable>package</replaceable></filename>をプリフェックスとして持たない、例えば<filename>install</filename>のような<systemitem role="package">debhelper</systemitem>の設定ファイルは、最初のバイナリパッケージへ適用されます。 バイナリパッケージが多数ある場合、<filename><replaceable>package-1</replaceable>install</filename>、<filename><replaceable>package-2</replaceable>.install</filename>、などのように、パッケージ名を設定ファイルのプリフェックスとすることで指定できます。

source: <filename>README.Debian</filename> file
ca: <filename>README.Debian</filename> (﻿LLEGEIX-ME.debian)
es: Archivo <filename>README.Debian</filename> (LÉEME.debian)
fr: Fichier <filename>README.Debian</filename>
it: Il file <filename>README.Debian</filename>
ja: <filename>README.Debian</filename> ファイル

source: Any extra details or discrepancies between the original package and your Debian version should be documented here.
ca: Qualsevol detall extra o discrepància entre el programa original i la seva versió Debian cal documentar-la en aquest arxiu.
es: Cualquier detalle extra o discrepancias entre el programa original y su versión debianizada debería documentarse aquí.
fr: Tous les détails ou différences entre le paquet original et votre version Debian devraient être documentés ici.
it: Ogni ulteriore dettaglio o discrepanza tra il pacchetto originale e la versione Debian dovrebbe essere documentato qui.
ja: パッケージに関して、何か特別にユーザに知らせなければならない情報や、オリジナルのソフトウェアと作成したDebianパッケージとの相違点があればここに記述します。

source: <command>dh_make</command> created a default one, this is what it looks like:
fr: <command>dh_make</command> en crée un par défaut, qui ressemble à ceci :
it: <command>dh_make</command> ne crea uno predefinito, ecco come appare:
ja: 以下は<command>dh_make</command>がデフォルトとして生成するものです。

source: If you have nothing to be documented, remove this file. See <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ca: Atès que no tenim res per explicar, eliminarem el fitxer. Consulta <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
es: Dado que no tenemos que poner nada aquí - está permitido borrarlo.Véase <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
fr: Si vous n'avez rien à documenter, effacez ce fichier, cf. <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
it: Qui dovrebbero inserire delle brevi informazioni specifiche di Debian. Si veda <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ja: もし、ドキュメントがなければこのファイルを削除してください。詳しくは <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>を参照してください。

source: <filename>compat</filename> file
ca: Fitxer <filename>compat</filename>.
es: Archivo <filename>compat</filename>
fr: Fichier <filename>compat</filename>
it: Il file <filename>compat</filename>
ja: <filename>compat</filename> ファイル

source: The <filename>compat</filename> file defines the <systemitem role="package">debhelper</systemitem> compatibility level. Currently, you should set it to the <systemitem role="package">debhelper</systemitem> V7 by the following.
ca: El fitxer <filename>compat</filename> defineix el nivell de compatibilitat de <systemitem role="package">debhelper</systemitem>. Actualment, ﻿establiràs la compatibilitat a la versió 7 de <systemitem role="package">debhelper</systemitem> de la següent manera:
es: El archivo <filename>compat</filename> define el nivel de compatibilidad de <systemitem role="package">debhelper</systemitem>. Actualmente, establecerás la compatibilidad a la versión 7 de <systemitem role="package">debhelper</systemitem> como se indica a continuación.
fr: Le fichier <filename>compat</filename> définit le niveau de compatibilité de <systemitem role="package">debhelper</systemitem>. Actuellement, vous devriez le définir à <systemitem role="package">debhelper</systemitem> V7 comme suit :
it: Il file <filename>compat</filename> definisce il livello di compatibilità di <systemitem role="package">debhelper</systemitem>. Al momento dovrebbe essere impostato a <systemitem role="package">debhelper</systemitem> V7 nel modo seguente.
ja: <filename>compat</filename>ファイルは、<systemitem role="package">debhelper</systemitem>の互換性レベルを規定します。現段階では、以下のように<systemitem role="package">debhelper</systemitem> V7に設定します。

source: <filename>conffiles</filename> file
ca: Fitxer <filename>conffiles</filename>.
es: Archivo <filename>conffiles</filename>
fr: Fichier <filename>conffiles</filename>
it: I file <filename>conffiles</filename>
ja: <filename>conffiles</filename>ファイル

source: One of the most annoying things about software is when you spend a great deal of time and effort customizing a program, only to have an upgrade stomp all over your changes. Debian solves this problem by marking configuration files so that when you upgrade a package, you'll be prompted whether you want to keep your old configuration or not.
es: Una de las cosas más molestas de los programas es cuando pasas mucho tiempo y esfuerzo adaptando un programa (como usuario) y una actualización destroza todos tus cambios. Debian resuelve este problema marcando los ficheros de configuración de forma que cuando actualizas un paquete se te pregunta si deseas mantener la nueva configuración o no.
fr: Une des choses les plus irritantes à propos des logiciels est de consacrer beaucoup de temps et d'efforts pour configurer un programme, et de voir une seule mise à jour détruire tous ses changements. Debian résout ce problème en marquant les fichiers de configuration de sorte que quand vous mettez à jour un paquet, il vous sera demandé si vous voulez gardez votre ancienne configuration ou pas.

source: Since <systemitem role="package">debhelper</systemitem> V3, <citerefentry> <refentrytitle>dh_installdeb</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> will <emphasis>automatically</emphasis> flag any files under the <filename>/etc</filename> directory as conffiles, so if your program only has conffiles there you do not need to specify them in this file. For most package types, the only place there is (and should be conffiles) is under <filename>/etc</filename> and so this file doesn't need to exist.
ca: Des de la versió 3 de <systemitem role="package">debhelper</systemitem>, <citerefentry> <refentrytitle>dh_installdeb</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> considera <emphasis>automàticament</emphasis> a tots els fitxers ubicats en el directori <filename>/etc</filename> com fitxers de configuració, de manera que si tots els fitxers de configuració del programa són en aquest directori, no es necessari que els incloguis en el fitxer «conffiles» (abreviatura d'arxiu de configuració). Per a la majoria de paquets, l'única ubicació dels arxius de configuració és <filename>/etc</filename> i en aquest cas pots eliminar aquest arxiu.
es: Desde la versión 3 de <systemitem role="package">debhelper</systemitem>, <citerefentry> <refentrytitle>dh_installdeb</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> considera <emphasis>automáticamente</emphasis> a todos los archivos ubicados en el directorio <filename>/etc</filename> como «conffiles» (archivos de configuración gestionados por el sistema de paquetes). Así, si todos los «conffiles» están en este directorio no es necesario que los incluyas en este archivo. Para la mayoría de paquetes, la única ubicación de los «conffiles» es <filename>/etc</filename> por lo que no es necesario generar este archivo.
fr: Depuis <systemitem role="package">debhelper</systemitem> V3, <citerefentry> <refentrytitle>dh_installdeb</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> va <emphasis>automatiquement</emphasis> considérer tous les fichiers du répertoire <filename>/etc</filename> comme des fichiers de configuration, donc si tous les fichiers de configuration de votre programme sont dans ce répertoire, il n'est pas nécessaire de les indiquer dans ce fichier. Pour la plupart des paquets, le seul endroit (et ce devrait toujours être le cas) contenant des fichiers de configuration est <filename>/etc</filename>, donc ce fichier ne devrait pas exister.
it: A partire da <systemitem role="package">debhelper</systemitem> V3, <citerefentry> <refentrytitle>dh_installdeb</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> <emphasis>automaticamente</emphasis> marcherà ogni file che si trova nella directory <filename>/etc</filename> come conffiles, così che se il programma ha soli file di configurazione in quella directory, non ci sarà bisogno di specificarli in questo file. Per la maggioranza dei tipi di pacchetto, l'unico posto in cui si trovano (ed in cui si dovrebbero trovare i conffile) è all'interno di <filename>/etc</filename> e quindi non c'è bisogno che questo file esista.
ja: <systemitem role="package">debhelper</systemitem> V3、 <citerefentry> <refentrytitle>dh_installdeb</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> は<emphasis>自動的に</emphasis><filename>/etc</filename>ディレクトリ以下のファイルを全てconffilesとみなすので、あなたのプログラムが他のディレクトリにconffilesを持たない場合は特に指定する必要はありません。ほとんどのパッケージの場合、<filename>/etc</filename>以下にのみconffilesがある（そうあるべきです）ので、このファイルの存在は不要です。

source: If your program uses configuration files but also rewrites them on its own, it's best not to make them as conffiles because <command>dpkg</command> will then prompt users to verify the changes all the time.
ca: Si el teu programa fa servir fitxers de configuració però també els sobreescriu ell mateix (directament des del codi font) es millor no marcar-los com «conffiles». Si ho fas, <command>dpkg</command> informarà als usuaris que revisin els canvis realitzats en aquests fitxers en cada actualització.
es: En el caso de que tu programa utilice ficheros de configuración pero también los reescriba él mismo es mejor no marcarlos como «conffiles». Si lo haces, <command>dpkg</command> informará a los usuarios que verifiquen los cambios de estos ficheros cada vez que lo actualicen.
fr: Si votre programme utilise des fichiers de configuration, mais les réécrit aussi de son côté, il vaut mieux ne pas les marquer comme fichiers de configuration, parce que <command>dpkg</command> va alors interroger les utilisateurs pour vérifier les modifications tout le temps.
it: Se il programma creato utilizza file di configurazione e li sovrascrive in automatico, è meglio non rendere questi ultimi dei file di configurazione perché <command>dpkg</command> chiederà ogni volta agli utenti di verificare i cambiamenti.
ja: あなたのプログラムが設定ファイルを利用する場合であっても、 その設定ファイルがプログラム自身によって頻繁に上書きされるような場合には、パッケージをアップグレードするたびに<command>dpkg</command>によって設定ファイルの変更について確認を求められることになるので、その設定ファイルをconffilesに登録しないほうが良いでしょう。

source: If the program you're packaging requires every user to modify the configuration files in the <filename>/etc</filename> directory, there are 2 popular ways to make them not as conffiles to keep <command>dpkg</command> quiet.
ca: Si el programa que empaquetes requereix que cada usuari modifiqui els fitxers de configuració del directori <filename>/etc</filename>, hi ha dues formes per a no marcar-los com fitxers «conffiles» i que no siguin manipulats per <command>dpkg</command>:
es: Si el programa que estas empaquetando requiere que cada usuario modifique los archivos de configuración del directorio <filename>/etc</filename>, hay dos formas para no marcarlos como archivos «conffiles» y que no sean manipulados por <command>dpkg</command>
fr: Si le programme que vous empaquetez oblige chaque utilisateur à modifier les fichiers de configuration du répertoire <filename>/etc</filename>, il y a deux façons usuelles de ne pas les marquer comme fichiers de configuration pour que <command>dpkg</command> reste silencieux :
it: Se il programma di cui si sta creando il pacchetto richiede ad ogni utente di modificare i file di configurazione nella directory <filename>/etc</filename>, ci sono principalmente 2 modi per non renderli conffiles e quindi di mantenere <command>dpkg</command> tranquillo.
ja: あなたのパッケージングするプログラムが、ユーザーに<filename>/etc</filename>ディレクトリの中にある設定ファイルを編集することを要求する場合、<command>dpkg</command>を黙らせるためにconffilesとして登録するためによく使われる方法が２つあります。

source: You make a symlink under the <filename>/etc</filename> directory pointing to a file under the <filename>/var</filename> directory generated by the <emphasis>maintainer scripts</emphasis>.
ca: Construir un enllaç simbòlic dels fitxers ubicats en <filename>/etc</filename> que apunti als fitxers ubicats en el directori <filename>/var</filename> generats per <emphasis>guions del desenvolupador</emphasis> («maintainer scripts»).
es: Construir un enlace simbólico de los archivos ubicados en <filename>/etc</filename> que apunten a archivos ubicados en el directorio <filename>/var</filename> generados por <emphasis>guiones del desarrollador</emphasis> («maintainer scripts»).
fr: faire un lien symbolique dans le répertoire <filename>/etc</filename> vers un fichier du répertoire <filename>/var</filename> créé par les <emphasis>scripts du responsable</emphasis> ;
it: Si può creare un link simbolico nella directory <filename>/etc</filename> che punti ad un file nella directory <filename>/var</filename> generato dagli <emphasis>script del manutentore</emphasis>.
ja: <filename>/etc</filename>ディレクトリ中に、<emphasis>maintainer scripts</emphasis>によって生成された<filename>/var</filename>ディレクトリ以下のファイルにシンボリックリンクを張る方法と、

source: You make a file generated by the <emphasis>maintainer scripts</emphasis> under the <filename>/etc</filename> directory.
ca: Posar els fitxers generats pels <emphasis>guions del desenvolupador</emphasis> en el directori <filename>/etc</filename>.
es: Poner los archivos generados por los <emphasis>guiones del desarrollador</emphasis> en el directorio <filename>/etc</filename>.
fr: créer un fichier dans le répertoire <filename>/etc</filename> par les <emphasis>scripts du responsable</emphasis> ;
it: Si fa generare un file dagli <emphasis>script del manutentore</emphasis> nella directory <filename>/etc</filename>.
ja: <filename>/etc</filename>ディレクトリの中に<emphasis>maintainer scripts</emphasis>によってファイルを生成する方法です。

source: For more information on the <emphasis>maintainer scripts</emphasis>, see <xref linkend="maintscripts"/> .
ca: Si vols més informació sobre els <emphasis>guions del desenvolupador</emphasis> consulta <xref linkend="maintscripts"/> .
es: Para más información sobre los <emphasis>guiones del desarrollador</emphasis> véase <xref linkend="maintscripts"/> .
fr: Pour plus d'informations sur les <emphasis>scripts du responsable</emphasis>, veuillez consulter <xref linkend="maintscripts"/> .

source: <filename><replaceable>package</replaceable>.cron.*</filename> files
ca: Fitxers <filename><replaceable>nom_paquet</replaceable>.cron.*</filename>
es: Archivos <filename><replaceable>nombre_del_paquete</replaceable>.cron.*</filename>
fr: Fichiers <filename><replaceable>paquet</replaceable>.cron.*</filename>
it: I file <filename><replaceable>pacchetto</replaceable>.cron.*</filename>
ja: <filename><replaceable>package</replaceable>.cron.*</filename>ファイル

source: If your package requires regularly scheduled tasks to operate properly, you can use this file to set it up. You can either setup regular tasks that happen hourly, daily, weekly or monthly or alternatively happen any other time that you wish. The filenames are:
ca: Si el teu paquet requereix la realització de tasques periòdiques per funcionar correctament, pots fer servir aquest arxiu. Pots establir la realització de tasques cada hora, dia, setmana o mes o qualsevol altre període de temps. Els noms dels fitxers són:
es: Si tu paquete requiere tareas periódicas para funcionar adecuadamente, puedes usar este fichero como patrón. Puedes establecer la realización de tareas que se ejecuten cada hora, día, semana, o mes. O pueden ejecutarse en cualquier otro momento, si lo desea. Los nombres de los archivos son:
fr: Si votre paquet a besoin d'exécuter des tâches régulièrement pour fonctionner correctement, vous pouvez utiliser ce fichier pour les configurer. Vous pouvez soit programmer des tâches régulières horaires, quotidiennes ou mensuelles, soit des tâches qui se produiront au moment que vous préférez. Les noms de fichiers sont :
it: Se il pacchetto creato richiede che vengano programmate delle operazioni per funzionare correttamente, si può utilizzare questo file per lo scopo. Si possono programmare delle operazioni in modo tale che vengano eseguite su base oraria, giornaliera, settimanale, mensile o che vengano eseguite alternativamente in qualsiasi momento si voglia.
ja: パッケージが正しく動作するために、定期的にあるタスクを実行する必要がある場合は、このファイルで設定します。毎時間、毎日、毎週、または指定した時間にタスクを実行するように指定することができます。ファイル名：

source: <filename>cron.hourly</filename> - Installed as <filename>/etc/cron.hourly/<replaceable>package</replaceable></filename>: run once an hour every hour.
ca: <filename>cron.hourly</filename> - instal·lats com <filename>/etc/cron.hourly/<replaceable>nom_paquet</replaceable></filename>: s'executen cada hora.
es: <filename>cron.hourly</filename> - instalados como <filename>/etc/cron.hourly/<replaceable>nombre_del_paquete</replaceable></filename>: se ejecutan cada hora.
fr: <filename>cron.hourly</filename> — installé comme <filename>/etc/cron.hourly/<replaceable>paquet</replaceable></filename> : exécuté une fois par heure, toutes les heures ;
it: <filename>cron.hourly</filename> - Installato come <filename>/etc/cron.hourly/<replaceable>pacchetto</replaceable></filename>: viene eseguito una volta all'ora, ogni ora.
ja: <filename>cron.hourly</filename> - <filename>/etc/cron.hourly/<replaceable>package</replaceable></filename>としてインストール: 1時間ごとに実行する。
