Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: In the <filename>debian/source/format</filename> file, there should be a single line indicating the desired format for the source package (check <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> for an exhaustive list). After <literal>squeeze</literal>, it should say either:
ca: El fitxer <filename>debian/source/format</filename>, només conté una línia que indica el format de construcció del paquet (consulta <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> on hi ha la llista completa). Després de <literal>squeeze</literal> hauria de ser:
es: El archivo <filename>debian/source/format</filename>, solo contendrá una línea indicando el formato deseado para el paquete (véase <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> para consultar la lista completa). Después de <literal>squeeze</literal> debería ser:
fr: Dans le fichier <filename>debian/source/format</filename>, il devrait y avoir une seule ligne indiquant le format voulu du paquet source (vérifier en <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> pour une liste exhaustive). Après <literal>Squeeze</literal>, il devrait contenir selon les cas :
it: Nel file <filename>debian/source/format</filename>, ci dovrebbe essere una unica riga che indichi il formato desiderato per il pacchetto sorgente (controllare <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> per una lista completa). Dopo <literal>squeeze</literal>, dovrebbe scrivere:
ja: <filename>debian/source/format</filename>ファイルでは、ソースパッケージのための理想の書式を示すための行があります。 (完全なリストは、<citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>を参照してください。)<literal>squeeze</literal>以降は、以下のどちらかになっているべきです。

source: <literal>3.0 (native)</literal> for Debian native packages or
ca: <literal>3.0 (native)</literal> per a paquets nadius de Debian o
es: <literal>3.0 (native)</literal> para paquetes nativos de Debian
fr: <literal>3.0 (native)</literal> pour les paquets Debian natifs ;
ja: <literal>3.0 (native)</literal>： Debianネイティブなパッケージ

source: <literal>3.0 (quilt)</literal> for everything else.
ca: <literal>3.0 (quilt)</literal> per als altres paquets.
es: <literal>3.0 (quilt)</literal> para el resto de paquetes.
fr: <literal>3.0 (quilt)</literal> pour tout le reste.
ja: <literal>3.0 (quilt)</literal>： それ以外の全て。

source: See <ulink url="&debsrc3;">DebSrc3.0</ulink> for the summary information concerning the switch to the new <literal>3.0 (quilt)</literal> and <literal>3.0 (native)</literal> source formats.
ca: Consulta <ulink url="&debsrc3;">DebSrc3.0</ulink> on es resumeix la informació sobre els formats <literal>3.0 (quilt)</literal> i <literal>3.0 (native)</literal>.
fr: Consulter <ulink url="&debsrc3;">DebSrc3.0</ulink> pour un condensé d'informations sur la conversion des sources au formats source <literal>3.0 (quilt)</literal> et <literal>3.0 (native)</literal>.
it: Si veda <ulink url="&debsrc3;">DebSrc3.0</ulink> per una serie di informazioni generali riguardanti il passaggio al nuovo formato <literal>3.0 (quilt)</literal> ed ai formati sorgente <literal>3.0 (native)</literal>.
ja: ソースの書式を<literal>3.0 (quilt)</literal> and <literal>3.0 (native)</literal>に移行する際の注意点などは、<ulink url="&debsrc3;">DebSrc3.0</ulink> にまとまっています。

source: Actually, this new format also supports multiple upstream tarballs and more compression methods. These are beyond the scope of this document.
ca: Actualment, el nou format també permet treballar amb més d'un arxiu «tar» amb les fonts originals i altres sistemes de compressió. Aquestes funcions no s'expliquen en aquest document.
es: Actualmente, este nuevo formato también permite trabajar con múltiples archivos «tar» fuente y otros sistemas de compresión. Estas funciones están fuera del objetivo de este documento.
fr: En fait, ce nouveau format permet de gérer des archives amont multiples et plusieurs méthodes de compression. Ces considérations sortent du cadre de ce document.
it: Al momento questo nuovo formato supporta anche molteplici archivi e più metodi di compressione. Questi però esulano dall'obiettivo di questo documento.
ja: この新しいフォーマットは、複数の上流のtar玉などもっと多くの圧縮方法をサポートしています。詳細は本稿の範疇を超えるため割愛します。

source: The newer <literal>3.0 (quilt)</literal> source format records modifications in a <command>quilt</command> patch series within <filename>debian/patches</filename>. Those changes are then automatically applied during extraction of the source package. <placeholder type="footnote" id="0"/> The Debian modifications are simply stored in a <filename>debian.tar.gz</filename> archive containing all files under the <filename>debian</filename> directory. This new format supports inclusion of binary files such as PNG icons by the package maintainer without requiring tricks. <placeholder type="footnote" id="1"/>
ca: El nou format <literal>3.0 (quilt)</literal> registre els canvis realitzats en el paquet en fitxers de pegats <command>quilt</command> en el directori <filename>debian/patches</filename>. Aquests canvis s'aplique automàticament en l'extracció dels fitxers originals del paquet <placeholder type="footnote" id="0"/>. Les modificacions es desen en el fitxer <filename>debian.tar.gz</filename> que conté tots els fitxers del directori <filename>debian</filename> utilitzat en la construcció del paquet. El nou format permet la inclusió d'arxius com els icones PNG sense necessitat de trucs <placeholder type="footnote" id="1"/>.
es: El nuevo formato <literal>3.0 (quilt)</literal> registra los cambios en series de archivos de parches <command>quilt</command> en el directorio <filename>debian/patches</filename>. Estos cambios se aplican automáticamente en la extracción de las fuentes del paquete <placeholder type="footnote" id="0"/>. Las modificaciones se guardan en el archivo <filename>debian.tar.gz</filename> que contiene todos los archivos del directorio <filename>debian</filename> utilizado en la construcción del paquete. El nuevo formato permite la inclusión de archivos como los iconos PNG sin necesidad de trucos <placeholder type="footnote" id="1"/>.
fr: Le récent format source <literal>3.0 (quilt)</literal> enregistre les modifications dans un ensemble de correctifs <command>quilt</command> dans <filename>debian/patches</filename>. Ces changements sont alors appliqués automatiquement lors de l'extraction du paquet source. <placeholder type="footnote" id="0"/> Les modifications Debian sont simplement conservées dans une archive <filename>debian.tar.gz</filename> contenant tous les fichiers du répertoire <filename>debian</filename>. Ce nouveau format permet d'inclure des fichiers binaires comme des icônes PNG sans bidouillage. <placeholder type="footnote" id="1"/>
it: Il nuovo formato sorgente <literal>3.0 (quilt)</literal> registra le modifiche in una serie di patch <command>quilt</command> all'interno di <filename>debian/patches</filename>. Questi cambiamenti vengono poi automaticamente applicati durante l'estrazione del pacchetto sorgente. <placeholder type="footnote" id="0"/> Le modifiche di Debian sono semplicemente mantenute in un archivio <filename>debian.tar.gz</filename> contenente tutti i file sotto la directory <filename>debian</filename>. Questo nuovo formato supporta l'inclusione di file binari come per esempio le icone PNG del manutentore del pacchetto senza richiedere trucchi.<placeholder type="footnote" id="1"/>
ja: 新しい<literal>3.0 (quilt)</literal>の書式は<command>quilt</command>パッチによる変更を <filename>debian/patches</filename>に記録します。そして、その変更は自動的にソースパッケージを展開するときに適用されます。<placeholder type="footnote" id="0"/>Debianの変更は、<filename>debian</filename>ディレクトリ以下のファイル全てを含め、<filename>debian.tar.gz</filename>アーカイブに保存されています。この新しい書式は、特殊な方法を用いることなく、PGNアイコンなどのパッケージメンテナによるバイナリファイルを含めることが可能です。<placeholder type="footnote" id="1"/>

source: When <command>dpkg-source</command> extracts a source package in <literal>3.0 (quilt)</literal> source format, it automatically applies all patches listed in <filename>debian/patches/series</filename>. You can avoid applying patches at the end of the extraction with the <literal>--skip-patches</literal> option.
ca: Quan <command>dpkg-source</command> extreu un paquet amb les fonts amb el format <literal>3.0 (quilt)</literal>, automàticament s'apliquen tots els pegats llistats en l'arxiu <filename>debian/patches/series</filename>. Això ho pots evitar amb l'opció <literal>--skip-patches</literal>.
es: Cuando <command>dpkg-source</command> extrae un paquete fuente con el formato <literal>3.0 (quilt)</literal>, automáticamente aplica todos los parches listados en el archivo <filename>debian/patches/series</filename>. Puedes evitar la ejecución de los parches al final de la extracción con la opción <literal>--skip-patches</literal>.
fr: Quand <command>dpkg-source</command> extrait un paquet source au format <literal>3.0 (quilt)</literal>, il applique automatiquement tous les correctifs énumérés dans <filename>debian/patches/series</filename>. Vous pouvez éviter que les correctifs soient appliqués à la fin de l'extraction avec l'option <literal>--skip-patches</literal>.
it: Quando <command>dpkg-source</command> estrae un pacchetto sorgente nel formato <literal>3.0 (quilt)</literal>, applica automaticamente tutte le patch elencate nel file <filename>debian/patches/series</filename>. Si può evitare di applicare le patch alla fine dell'estrazione con l'opzione <literal>--skip-patches</literal>.
ja: <command>dpkg-source</command>が<literal>3.0 (quilt)</literal>の書式でソースパッケージを展開する際、<filename>debian/patches/series</filename>に列挙されたパッチを自動的に適用します。<literal>--skip-patches</literal>オプションで、展開時にパッチを適用しないようにできます。

source: <filename>source/local-options</filename> file
ca: Fitxer <filename>source/local-options</filename>.
es: Archivo <filename>source/local-options</filename>
fr: Fichier <filename>source/local-options</filename>
it: Il file <filename>source/local-options</filename>
ja: <filename>source/local-options</filename> ファイル

source: When you want to manage Debian packaging activities under a VCS, you typically create one branch (e.g. <literal>upstream</literal>) tracking the upstream source and another branch (e.g. typically <literal>master</literal> for Git) tracking the Debian package. For the latter, you usually want to have unpatched upstream source with your <filename>debian/*</filename> files for the Debian packaging to ease merging of the new upstream source.
ca: Si has de gestionar els treballs d'empaquetament a un entorn VCS, segurament tindràs una branca (p. ex. <literal>upstream</literal>) per a les fonts originals i una altra (p. ex. normalment <literal>master</literal> en Git) per al paquet Debian. Si és així, tindràs les fonts originals sense modificar (sense aplicar els pegats) amb els fitxers <filename>debian/*</filename> per l'empaquetament Debian per fusionar-les amb les noves versions de les fonts.
es: Si deseas gestionar los trabajos de empaquetado en un entorno VCS, seguramente tendrás una rama (p.ej. <literal>upstream</literal>) que sigue las fuentes originales y otra rama (p.ej. normalmente <literal>master</literal> en Git) para el paquete Debian. Para este último caso, generalmente tendrás las fuentes originales sin modificar (sin aplicarles los parches) con los archivos <filename>debian/*</filename> para el empaquetamiento Debian para facilitar la fusión con las nuevas versiones de las fuentes.
fr: Lors de la maintenance de paquet Debian avec un système de gestion de version, il faut typiquement créer une branche (par exemple <literal>upstream</literal>) pour suivre les sources amont, et une autre branche (typiquement <literal>master</literal> avec Git) pour suivre le paquet Debian. Pour cette dernière, il est préférable de garder les sources amont non modifiés aux côtés des fichiers <filename>debian/*</filename> du paquet Debian pour faciliter la fusion avec les nouveaux sources amonts.
it: Quando si vogliono gestire le attività di pacchettizzazione utilizzando un VCS, di norma si crea un ramo (es. <literal>upstream</literal>) in cui si tiene traccia dei cambiamenti apportanti al sorgente originale, e un altro ramo (es. di solito <literal>master</literal> per git) in cui si tiene traccia delle modifiche apportate al pacchetto. In fine, è consigliato avere i sorgenti originali non pachati con i file in <filename>debian/*</filename> per il pacchetto Debian, per fare facilitare le operazioni di fusione con il nuovo sorgente originale.
ja: Debianをパッケージングする活動をVCSで管理したい場合、上流のソースをトラックするためのブランチ(例 <literal>upstream</literal>)とDebianパッケージをトラックするための別のブランチ(例 Gitのための<literal>master</literal>)を作成します。後者の場合、新しい上流のソースとマージするのを簡単にするために、通常パッチの当てていない上流のソースを<filename>debian/*</filename>ファイルと一緒に持っておきます。

source: After you build a package, the source is normally left patched. You need to unpatch it manually by running <literal>quilt pop -a</literal> before committing to the <literal>master</literal> branch. You can automate this by adding the optional <filename>debian/source/local-options</filename> file containing <literal>unapply-patches</literal>. This file is not included in the generated source package and changes the local build behavior only. This file may contain <literal>abort-on-upstream-changes</literal>, too (see <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
es: Una vez compilado el paquete, las fuentes estarán parcheadas. Deberás deshacer los parches manualmente ejecutando <literal>quilt pop -a</literal> antes de sincronizar con la rama <literal>master</literal>. Puedes automatizar esto añadiendo el archivo opcional <filename>debian/source/local-options</filename> cuyo contenido será «<literal>unapply-patches</literal>». Este archivo no se incluye en el paquete fuente generado y sólo cambia el entorno local de compilación. Este archivo también puede contener la línea «<literal>abort-on-upstream-changes</literal>» (véase <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
fr: Après la construction d'un paquet, les sources sont normalement laissés modifiés (« patched »). « <literal>quilt pop -a</literal> » doit être exécuté avant d'envoyer vers la branche <literal>master</literal>. Créer un fichier optionnel <filename>debian/source/local-options</filename> contenant « <literal>unapply-patches</literal> » permet d'automatiser cela. Ce fichier n'est pas inclus dans le paquet source créé et modifie seulement le comportement de construction local. Ce fichier peut aussi contenir « <literal>abort-on-upstream-changes</literal> » (voir <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).

source: <filename>patches/*</filename> files
ca: Fitxers <filename>patches/*</filename>.
es: Archivos <filename>patches/*</filename>
fr: Fichiers <filename>patches/*</filename>
it: I file <filename>patches/*</filename>
ja: <filename>patches/*</filename> ファイル群

source: The old <literal>1.0</literal> source format created a single large <filename>diff.gz</filename> file which contains package maintenance files in <filename>debian</filename> and patch files to the source. Such a package is a bit cumbersome to inspect and understand for each source tree modification later. This is not so nice.
ca: L'antic format <literal>1.0</literal> construïa un arxiu <filename>diff.gz</filename> amb el contingut dels fitxers de construcció del paquet del directori <filename>debian</filename> i els canvis a realitzar en les fonts. Aquest format per conservar els canvis era una mica enutjós quan es tractava d'inspeccionar i entendre cada modificació de les fonts. Ja no és eficaç.
es: El antiguo formato <literal>1.0</literal> construía un archivo <filename>diff.gz</filename> cuyo contenido era el de los archivos de construcción del paquete del directorio <filename>debian</filename> así como los cambios a realizar en las fuentes. Este formato para conservar los cambios resultaba engorroso cuando se trataba de inspeccionar y entender cada modificación de las fuentes. Ya no resulta eficaz.
fr: L'ancien format source <literal>1.0</literal> créait un unique et gros fichier <filename>diff.gz</filename> avec les fichiers de maintenance de paquet dans <filename>debian/</filename> et les correctifs. Un tel paquet est un peu délicat à inspecter et à comprendre pour chaque modification de l'arbre source par la suite. Ce n'est pas conseillé.
it: Il vecchio formato sorgente <literal>1.0</literal> creava un singolo, grosso file <filename>diff.gz</filename> file che conteneva tutti i file di manutenzione del pacchetto che stavano in <filename>debian</filename> ed i file di patch del sorgente. Un pacchetto così è un poco ingombrante da ispezionare per capire successivamente la sequenza delle modifiche. Per questo tale formato non è considerato soddisfacente.
ja: 古い<literal>1.0</literal>のソースフォーマットは、<filename>debian</filename>内にパッケージメンテナンスファイルと、パッチファイルを含む単一の大きな<filename>diff.gz</filename>ファイルを作っていました。そのようなファイルは、ソースツリーの変更を後から調べたり、理解するのが非常に厄介でした。これはあまりいただけません。

source: For <xref linkend="modify"/> , we created 3 patches in <filename>debian/patches</filename>.
ca: A <xref linkend="modify"/> , s'han construït tres fitxers de pegats en el directori <filename>debian/patches</filename>.
es: En <xref linkend="modify"/> , se han construido tres archivos de parches en <filename>debian/patches</filename>.
fr: En <xref linkend="modify"/> , trois correctifs ont été créés dans <filename>debian/patches</filename>.

source: Since Debian patches are located in <filename>debian/patches</filename>, please make sure to setup the <command>quilt</command> command properly as described in <xref linkend="quiltrc"/> .
es: Puesto que los parches se ubican en <filename>debian/patches</filename>, por favor asegúrate que has configurado adecuadamente la orden <command>quilt</command> como se describe en <xref linkend="quiltrc"/> .
fr: Puisque les correctifs Debian sont localisés en <filename>debian/patches</filename>, veuillez vous assurer d'avoir configuré correctement la commande <command>quilt</command> conformément à la description en <xref linkend="quiltrc"/> .

source: When someone (including yourself) provides you with a patch <filename><replaceable>foo</replaceable>.patch</filename> to the source later, then the modification of a <literal>3.0 (quilt)</literal> source package is quite simple:
ca: Quan algú (inclòs tu mateix), facilita un pegat <filename><replaceable>nom_pegat</replaceable>.patch</filename> per a les fonts, una vegada construït el paquet, la modificació del paquet amb format <literal>3.0 (quilt)</literal> és així de simple:
es: Cuando alguien (incluido tú mismo), facilita un parche <filename><replaceable>nombre_parche</replaceable>.patch</filename> para las fuentes, cuando ya está construido el paquete, la modificación de un paquete con formato <literal>3.0 (quilt)</literal> es así de simple:
fr: Quand quelqu'un (éventuellement vous-même) fournit un correctif <filename><replaceable>toto</replaceable>.patch</filename> par la suite, la modification d'un paquet source <literal>3.0 (quilt)</literal> est assez simple :
it: Quando una qualsiasi persona fornisce una patch <filename><replaceable>foo</replaceable>.patch</filename> per i sorgenti, allora la modifica del pacchetto sorgente di tipo <literal>3.0 (quilt)</literal>è abbastanza semplice:
ja: 誰かが(あなた自身も含みます)<filename><replaceable>foo</replaceable>.patch</filename>というパッチを後から提供した時、<literal>3.0 (quilt)</literal>ソースパッケージの変更はとてもシンプルです。

source: $ dpkg-source -x gentoo_0.9.12.dsc $ cd gentoo-0.9.12 $ quilt import ../<replaceable>foo</replaceable>.patch $ quilt push $ quilt refresh $ quilt header -e ... describe patch
es: $ dpkg-source -x gentoo_0.9.12.dsc $ cd gentoo-0.9.12 $ quilt import ../<replaceable>nombre_parche</replaceable>.patch $ quilt push $ quilt refresh $ quilt header -e ... descripción de la modificación
fr: $ dpkg-source -x gentoo_0.9.12.dsc $ cd gentoo-0.9.12 $ quilt import ../<replaceable>toto</replaceable>.patch $ quilt push $ quilt refresh $ quilt header -e ... description du correctif

source: The patches stored in the newer <literal>3.0 (quilt)</literal> source format must be <emphasis>fuzz</emphasis> free. You should ensure it as <literal>quilt pop -a; while quilt push; do quilt refresh; done</literal>.
es: Los parches conservados con el nuevo formato de fuentes <literal>3.0 (quilt)</literal> deben estar exentos de <emphasis>cosas innecesarias</emphasis>. Debes asegurarte ejecutando <literal>quilt pop -a; while quilt push; do quilt refresh; done</literal>.
fr: Les correctifs conservés au nouveau format source <literal>3.0 (quilt)</literal> doivent être sans approximation (« <emphasis>fuzz</emphasis> »). Vous devriez vous en assurer avec « <literal>quilt pop -a; while quilt push; do quilt refresh; done</literal> ».

source: Building the package
ca: Construir el paquet.
es: Construyendo el paquete
fr: Construction du paquet
it: Costruzione del pacchetto
ja: パッケージの構築

source: We should now be ready to build the package.
ca: Ara hauríem d'estar preparats per construir el paquet.
es: Ahora deberíamos estar preparados para construir el paquete.
fr: Tout devrait maintenant être prêt pour construire le paquet.
it: A questo punto, si dovrebbe essere pronti a creare il pacchetto.
ja: これでパッケージを構築する準備が整いました。

source: Complete (re)build
ca: Reconstrucció completa.
es: (Re)construcción completa
fr: Reconstruction complète
it: (ri)Creazione completa
ja: 完全な（再）構築

source: In order to properly make complete (re)build of a package, you have to ensure to install
ca: Per realitzar correctament la construcció ( o la reconstrucció) completa d'un paquet, comprova que els següents paquets estan instal·lats:
es: Para realizar correctamente la (re)compilación completa de un paquete, debes asegurarte que tienes instalados:
fr: Pour faire correctement la reconstruction complète d'un paquet, doivent être installés :
it: Al fine di (ri)creare un pacchetto in modo appropriato, è necessario assicurarsi di installare
ja: 完全なパッケージの（再）構築を行うには、

source: the <systemitem role="package">build-essential</systemitem> package,
ca: el paquet <systemitem role="package">build-essential</systemitem>.
es: el paquete <systemitem role="package">build-essential</systemitem>.
fr: le paquet <systemitem role="package">build-essential</systemitem> ;
it: il pacchetto <systemitem role="package">build-essential</systemitem>,
ja: <systemitem role="package">build-essential</systemitem>パッケージ、

source: packages listed in the <literal>Build-Depends</literal> field (see <xref linkend="control"/> ), and
ca: els paquets llistats en el camp <literal>Build-Depends</literal> del fitxer «control» (consulta <xref linkend="control"/> ).
es: los paquetes listados en el campo <literal>Build-Depends</literal> del archivo «control» (<xref linkend="control"/> ).
fr: les paquets énumérés dans le champ <literal>Build-Depends</literal>, cf. <xref linkend="control"/> ;

source: packages listed in the <literal>Build-Depends-indep</literal> field (see <xref linkend="control"/> ).
ca: els paquets llistats en el camp <literal>Build-Depends-indep</literal> (també de l'arxiu «control», consulta <xref linkend="control"/> ).
es: los paquetes listados en el campo <literal>Build-Depends-indep</literal> (también del archivo «control», <xref linkend="control"/> ).
fr: les paquets énumérés dans le champ <literal>Build-Depends-indep</literal>, cf. <xref linkend="control"/> .
