Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: These 2 differences between (1) the normal program installation and (2) the Debian packaging can be transparently addressed by the <systemitem role="package">debhelper</systemitem> package through the <command>dh_auto_configure</command> and <command>dh_auto_install</command> commands if the following conditions are met.
ca: Aquestes diferències entre (1) la instal·lació del programa i (2) la «simulació» d'instal·lació en el procés d'empaquetament Debian, és gestionada de manera transparent pel paquet <systemitem role="package">debhelper</systemitem> amb les ordres <command>dh_auto_configure</command> i <command>dh_auto_install</command> si es compleixen els següents requisits:
es: Estas dos diferencias entre (1) la instalación del programa y (2) la «simulación» de instalación en el empaquetamiento Debian las maneja de forma transparente el paquete <systemitem role="package">debhelper</systemitem> con las órdenes <command>dh_auto_configure</command> y <command>dh_auto_install</command> siempre que se cumplan los requisitos indicados a continuación.
fr: Ces deux différences entre (1) l'installation normale du programme et (2) l'empaquetage Debian peuvent être abordées de façon transparente par le paquet <systemitem role="package">debhelper</systemitem> à l'aide des commandes <command>dh_auto_configure</command> et <command>dh_auto_install</command> si les conditions suivantes sont vérifiées :
it: Le 2 differenze tra (1) la normale installazione di un programma e (2) l'installazione tramite il sistema di pacchettizzazione Debian può essere affrontato in modo trasparente dal pacchetto <systemitem role="package">debhelper</systemitem>, attraverso i comandi <command>dh_auto_configure</command> e <command>dh_auto_install</command>, se le seguenti condizioni sono soddisfatte.

source: The <filename>Makefile</filename> file follows the GNU conventions to support <literal>$(DESTDIR)</literal> variable (<filename>/usr/share/doc/gnu-standards/standards.html#Makefile-Conventions</filename>).
es: El archivo <filename>Makefile</filename> debe seguir las convenciones GNU de forma que admita la variable <literal>$(DESTDIR)</literal>. (véase <filename>/usr/share/doc/gnu-standards/standards.html#Makefile-Conventions</filename>).
fr: le fichier <filename>Makefile</filename> suit les conventions GNU pour gérer la variable <literal>$(DESTDIR)</literal> (<filename>/usr/share/doc/gnu-standards/standards.html#Makefile-Conventions</filename>) ;

source: The source follows the Filesystem Hierarchy Standard (FHS).
ca: Cal que el codi font segueixi l'estàndard de la jerarquia del sistema de fitxers («Filesystem Hierarchy Standard» o FHS).
es: El código fuente sigue el estándar de la jerarquía del sistema de ficheros. («Filesystem Hierarchy Standard» o FHS).
fr: les sources suivent la norme de hiérarchie des fichiers (« Filesystem Hierarchy Standard » ou FHS).
it: Il sorgente è conforme allo Standard di Gerarchia dei Filesystem (FHS)

source: Programs that use GNU <command>autoconf</command> <emphasis>automatically</emphasis> follow the GNU conventions and their packaging is almost <emphasis>automatic</emphasis>. With this and other heuristics, the <systemitem role="package">debhelper</systemitem> package estimates that it works for about 90% of packages without making any intrusive changes to their build system. So the packaging is not as complicated as it may seem.
ca: Els programes que fan servir <command>autoconf</command> de GNU ﻿compleixen <emphasis>automàticamente</emphasis> amb les convencions GNU i el seu empaquetament es quasi <emphasis>automàtic</emphasis>. Amb aquests requisits i ﻿l'heurística emprada pel paquet <systemitem role="package">debhelper</systemitem>, és possible empaquetar sense fer canvis en el sistema de compilació. L'empaquetament no es tan complicat com pot semblar.
es: Los programas que usan <command>autoconf</command> de GNU cumplen <emphasis>automáticamente</emphasis> con las convenciones GNU y su empaquetamiento es casi <emphasis>automático</emphasis>. Con estos requisitos y la heurística que aplica el paquete <systemitem role="package">debhelper</systemitem>, se estima que funciona sobre el 90% de paquetes sin tener que realizar ningún cambio intrusivo en su sistema de construcción. El empaquetado no es tan complicado como puede parecer.
fr: Les programmes qui utilisent GNU <command>autoconf</command> suivent <emphasis>automatiquement</emphasis> la norme GNU et leur empaquetage est presque <emphasis>automatique</emphasis>. Avec ceci et d'autres paramètres, le paquet <systemitem role="package">debhelper</systemitem> est estimé fonctionner pour 90 % des paquets sans modification intrusive à leur système de construction. L'empaquetage n'est donc pas aussi compliqué qu'il y parait.
it: I programmi che usano GNU <command>autoconf</command> sono <emphasis>automaticamente</emphasis> conformi alle convenzioni GNU e la loro pacchettizzazione è quasi <emphasis>automatica</emphasis>. Con questi ed altri accorgimenti, si stima che il pacchetto <systemitem role="package">debhelper</systemitem> funzioni sul quasi il 90% dei pacchetti senza apportare pesanti modifiche al loro sistema di compilazione. La pacchettizzazione non è così complicata come potrebbe sembrare.

source: If you need to make changes in the <filename>Makefile</filename> file, you should make sure to support these <literal>$(DESTDIR)</literal> variable. The <literal>$(DESTDIR)</literal> variable is unset in it and is prepended to each file path used for the program installation. The packaging script will set <literal>$(DESTDIR)</literal> to the temporary directory.
ca: Per fer canvis en el fitxer <filename>Makefile</filename>, assegura't que permet fer servir la variable <literal>$(DESTDIR)</literal>. La variable <literal>$(DESTDIR)</literal> no es defineix a l'arxiu i s'afegirà a totes les adreces de directoris que es facin servir en la instal·lació del programa. El guió d'empaquetament estableix el valor de la variable <literal>$(DESTDIR)</literal> al valor del directori temporal d'instal·lació del programa en el procés de construcció del paquet.
es: Si debes hacer cambios en el archivo <filename>Makefile</filename>, debes asegurarte que admite la variable <literal>$(DESTDIR)</literal>. La variable <literal>$(DESTDIR)</literal> no está definida en el archivo y se añadirá en todas las rutas de directorios usadas en la instalación del programa. El guión de empaquetamiento establece el valor de la variable <literal>$(DESTDIR)</literal> al valor del directorio temporal de instalación del programa en el proceso de construcción del paquete.
fr: Si vous devez modifier le fichier <filename>Makefile</filename>, vous devriez vous assurer qu'il gère la variable <literal>$(DESTDIR)</literal>. La variable <literal>$(DESTDIR)</literal> n'y est pas configurée et précède chaque chemin de fichier utilisé par le programme d'installation. Le script d'empaquetage configurera <literal>$(DESTDIR)</literal> en tant que répertoire temporaire.

source: For multiple binary packages, the <command>dh_auto_install</command> command uses <filename>debian/tmp</filename> as the temporary directory while the <command>dh_install</command> command with the help of <filename>debian/<replaceable>package-1</replaceable>.install</filename> and <filename>debian/<replaceable>package-2</replaceable>.install</filename> files will split contents of <filename>debian/tmp</filename> into <filename>debian/<replaceable>package-1</replaceable></filename> and <filename>debian/<replaceable>package-2</replaceable></filename> temporary directories to create multiple binary <filename>*.deb</filename> packages.
ca: Si el paquet té més d'un binari, l'ordre <command>dh_auto_install</command> fa servir el directori temporal <filename>debian/tmp</filename> i l'ordre <command>dh_install</command> amb l'ajuda dels fitxers <filename>debian/<replaceable>paquet-1</replaceable>.install</filename> i <filename>debian/<replaceable>paquet-2</replaceable>.install</filename> distribuirà el contingut del directori <filename>debian/tmp</filename> en els directoris temporals <filename>debian/<replaceable>paquet-1</replaceable></filename> i <filename>debian/<replaceable>paquet-2</replaceable></filename> per tal de construir els paquets <filename>*.deb</filename> amb més d'un binari.
es: Para paquetes con más de un archivo binario, la orden <command>dh_auto_install</command> utiliza como directorio temporal <filename>debian/tmp</filename> mientras que la orden <command>dh_install</command> con la ayuda de los archivos <filename>debian/<replaceable>paquete-1</replaceable>.install</filename> y <filename>debian/<replaceable>paquete-2</replaceable>.install</filename> distribuirá el contenido del directorio <filename>debian/tmp</filename> en los directorios temporales <filename>debian/<replaceable>paquete-1</replaceable></filename> y <filename>debian/<replaceable>package-2</replaceable></filename> para construir paquetes <filename>*.deb</filename> para más de un binario.
fr: Pour les paquets binaires multiples, la commande <command>dh_auto_install</command> utilise <filename>debian/tmp</filename> comme répertoire temporaire alors que la commande <command>dh_install</command>, à l'aide des fichiers <filename>debian/<replaceable>paquet-1</replaceable>.install</filename> et <filename>debian/<replaceable>paquet-2</replaceable>.install</filename>, séparera le contenu de <filename>debian/tmp</filename> dans les répertoires temporaires <filename>debian/<replaceable>paquet-1</replaceable></filename> et <filename>debian/<replaceable>paquet-2</replaceable></filename> pour créer les paquets binaires multiples <filename>*.deb</filename>.
it: Per i pacchetti binari multipli, il comando <command>dh_auto_install</command> utilizza la directory temporanea <filename>debian/tmp</filename>, mentre il comando <command>dh_install</command>, con l'aiuto dei file <filename>debian/<replaceable>pacchetto-1</replaceable>.install</filename> e <filename>debian/<replaceable>pacchetto-2</replaceable>.install</filename> suddivide il contenuto di <filename>debian/tmp</filename> nelle directory temporanee <filename>debian/<replaceable>pacchetto-1</replaceable></filename> e <filename>debian/<replaceable>pacchetto-2</replaceable></filename> per creare pacchetti binari multipli <filename>*.deb</filename>.

source: The temporary directory used by the <command>dh_auto_install</command> command is chosen as <filename>debian/<replaceable>package</replaceable></filename> for single binary packages. <placeholder type="footnote" id="0"/> Everything that is contained in the temporary directory will be installed on a user's system when they install your package, the only difference is that <command>dpkg</command> will be installing the files in the root directory.
ca: El directori temporal fet servir per l'ordre <command>dh_auto_install</command> és <filename>debian/<replaceable>nom_del_paquet</replaceable></filename> per a paquets amb un arxiu binari <placeholder type="footnote" id="0"/>. El contingut complet del directori temporal s'instal·larà en el sistema de l'usuari quan aquest instal·li el paquet, amb la diferència que amb <command>dpkg</command> la instal·lació es fa des del directori arrel del sistema (en lloc del directori «debian/» o «debian/tmp» fet servir en la construcció del paquet).
es: El directorio temporal usado por la orden <command>dh_auto_install</command> es <filename>debian/<replaceable>nombre_de_paquete</replaceable></filename> para paquetes con un binario <placeholder type="footnote" id="0"/>. El contenido completo del directorio temporal será instalado en en sistema del usuario cuando se instale el paquete, con la diferencia que con <command>dpkg</command> la instalación se realizará a partir del directorio raíz del sistema.
fr: Le répertoire temporaire utilisé par la commande <command>dh_auto_install</command> est choisi en tant que <filename>debian/<replaceable>paquet</replaceable></filename> pour les paquets binaires simples. <placeholder type="footnote" id="0"/> Le contenu du répertoire temporaire sera copié sur le système de l'utilisateur qui installera votre paquet, la seule différence est que <command>dpkg</command> placera ces fichiers dans le répertoire racine.
it: La directory temporanea, utilizzata dal comando <command>dh_auto_install</command>, è <filename>debian/<replaceable>pacchetto</replaceable></filename> per i pacchetti binari singoli. <placeholder type="footnote" id="0"/> Tutto quello contenuto nella directory temporanea verrà installato sul sistema dell'utente, appena si installa il pacchetto, l'unica differenza è che <command>dpkg</command> installerà i file nella radice del file system.

source: Bear in mind that even though your program installs in <filename>debian/<replaceable>package</replaceable></filename>, it still needs to behave correctly when placed in the root directory, i.e. when installed from the <filename>.deb</filename> package. So you must not allow the build system to hardcode strings like <literal>/home/me/deb/<replaceable>package</replaceable>-<replaceable>version</replaceable>/usr/share/<replaceable>package</replaceable></literal> into the package file.
ca: Tots els fitxers i directoris que s'instal·len en el directori <filename>debian/<replaceable>nom_del_paquet</replaceable></filename> en la construcció del paquet, huaràn de poder instal·lar-se correctament des del directori arrel quan s'instal·lin fent servir el fitxer <filename>.deb</filename>. No s'ha de fer servir cadenes del tipus <literal>/home/elmeu/deb/<replaceable>nom_paquet</replaceable>-<replaceable>versió</replaceable>/usr/share/<replaceable>nom_paquet</replaceable></literal> en la construcció del paquet.
es: Aunque el programa se instalen en el directorio <filename>debian/<replaceable>nombre_del_paquete</replaceable></filename> será necesario que se comporte correctamente cuando se instalen en el directorio raíz, esto es, cuando se instalen usando el archivo <filename>.deb</filename>. Debería evitar que el sistema de compilación incluya cadenas del tipo <literal>/home/mi/deb/<replaceable>nombre_del_paquete</replaceable>-<replaceable>versión</replaceable>/usr/share/<replaceable>nombre_del_paquete</replaceable></literal> en el fichero de paquete.
fr: Gardez à l'esprit que même si le programme s'installe dans <filename>debian/<replaceable>paquet</replaceable></filename>, il doit continuer à s'exécuter correctement quand il est installé dans le répertoire racine, c'est-à-dire quand il est installé à partir du paquet <filename>.deb</filename>. Vous ne devez donc pas laisser le système de construction coder en dur des chaînes de caractères comme <literal>/home/moi/deb/<replaceable>paquet</replaceable>-<replaceable>version</replaceable>/usr/share/<replaceable>paquet</replaceable></literal> dans les fichiers du paquet.
it: Bisogna tenere in considerazione che, anche se il programma viene installato in <filename>debian/<replaceable>pacchetto</replaceable></filename>, deve comunque rispettare i percorsi convenzionali, una volta posizionato nella radice, ad es. quando si installa un pacchetto <filename>.deb</filename>. Per questo motivo non bisogna consentire al sistema di compilazione di utilizzare stringhe impostate manualmente come costanti, ad esempio <literal>/home/me/deb/<replaceable>package</replaceable>-<replaceable>version</replaceable>/usr/share/<replaceable>pacchetto</replaceable></literal> nel file del pacchetto.

source: This is just an example to show how the <filename>Makefile</filename> file should look like. If the <filename>Makefile</filename> file is created by the <command>./configure</command> command, the correct way to fix this kind of <filename>Makefile</filename> is to executed the <command>./configure</command> command from the <command>dh_auto_configure</command> command with default options including <literal>--prefix=/usr</literal>.
ca: Només és un exemple del contingut de l'arxiu <filename>Makefile</filename>. Si el fitxer <filename>Makefile</filename> es construeix amb l'ordre <command>./configure</command>, el procediment correcte per solucionar això en l'arxiu <filename>Makefile</filename> és executar l'ordre <command>./configure</command> des de l'ordre <command>dh_auto_configure</command> amb les opcions predeterminades afegint l'opció <literal>--prefix=/usr</literal>.
fr: Il s'agit simplement d'un exemple pour montrer à quoi le fichier <filename>Makefile</filename> devrait ressembler. Si le fichier <filename>Makefile</filename> est créé par la commande <command>./configure</command>, la bonne façon de modifier ce genre de <filename>Makefile</filename> est d'exécuter la commande <command>./configure</command> à partir de la commande <command>dh_auto_configure</command> avec les options par défaut y compris <literal>--prefix=/usr</literal>.
it: Questo è solo un esempio che mostra come un <filename>Makefile</filename> dovrebbe apparire. Se il <filename>Makefile</filename> è creato dal comando <command>./configure</command>, il modo giusto per correggere il <filename>Makefile</filename> è eseguire il comando <command>./configure</command> dal comando <command>dh_auto_configure</command> includendo come opzione predefinita <literal>--prefix=/usr</literal>.

source: Here's the relevant part of <systemitem role="package">gentoo</systemitem>'s <filename>Makefile</filename> file <placeholder type="footnote" id="0"/>:
ca: Aquest és la part important del fitxer <filename>Makefile</filename> del paquet <systemitem role="package">gentoo</systemitem> <placeholder type="footnote" id="0"/>:
fr: Voici les parties concernées du <filename>Makefile</filename> de <systemitem role="package">gentoo</systemitem> <placeholder type="footnote" id="0"/> :
it: Questa è la parte più importante del <filename>Makefile</filename> del pacchetto <systemitem role="package">gentoo</systemitem> <placeholder type="footnote" id="0"/>:

source: We see that the files are set to install under <filename>/usr/local</filename>. Change those paths to:
ca: A l'exemple, els fitxers s'instal·laran en el directori <filename>/usr/local</filename>. Cal canviar l'ubicació a:
es: Vemos que los ficheros están configurados para instalarse bajo <filename>/usr/local</filename>. Cambia estas rutas a:
fr: Les fichiers sont configurés pour s'installer sous <filename>/usr/local/</filename>. Changez ces chemins en :
it: Da notare che i file verranno installati in <filename>/usr/local</filename>. Si modifichino questi percorsi con:

source: But why in that directory, and not some other? Because Debian packages never install files beneath <filename>/usr/local</filename> -- that tree is reserved for the system administrator's use. Such files on Debian systems go under <filename>/usr</filename> instead.
ca: Quin és el motiu de posar aquest directori? Els paquets de Debian no s'instal·len mai a <filename>/usr/local</filename>, directori reservat al administrador del sistema. Cal instal·lar els fitxers en el directori <filename>/usr</filename>.
es: Pero ¿por qué en este directorio y no en otro? Porque los paquetes de Debian nunca se instalan bajo <filename>/usr/local</filename>, este árbol de directorio, está reservado para el uso del administrador del sistema. Así que estos ficheros deben instalarse en <filename>/usr</filename>.
fr: Mais pourquoi dans ce répertoire, et pas dans un autre ? Parce que Debian n'installe jamais de fichiers sous <filename>/usr/local</filename> — cet arbre est réservé à l'usage de l'administrateur système. Sur un système Debian, de tels fichiers doivent plutôt aller sous <filename>/usr</filename>.
it: Ma perché in questa directory e non altrove? Perché i pacchetti Debian non installano mai dei file nella directory <filename>/usr/local</filename> -- questo percorso è riservato all'amministratore di sistema. Questi file, invece, nei sistemi Debian vanno posizionati in <filename>/usr</filename>.

source: The more exact locations for binaries, icons, documentation etc. are specified in the Filesystem Hierarchy Standard (see <filename>/usr/share/doc/debian-policy/fhs/</filename>). I recommend you browse it and read the sections that might concern your package.
es: La ubicación correcta de los binarios, iconos, documentación, etc, está especificada en el «Estándar de la jerarquía del sistema de ficheros» (véase <filename>/usr/share/doc/debian-policy/fhs</filename>). Te recomiendo que leas las secciones que podrían aplicarse a tu paquete.
fr: Les emplacements exacts des exécutables, icônes, documentation, etc., sont spécifiées dans la norme de hiérarchie des fichiers (voir <filename>/usr/share/doc/debian-policy/fhs/</filename>). Vous devriez la consulter et lire les sections relatives à votre paquet.

source: So, we should install the binary in <filename>/usr/bin</filename> instead of <filename>/usr/local/bin</filename>, the manual page in <filename>/usr/share/man/man1</filename> instead of <filename>/usr/local/man/man1</filename> etc. Notice how there's no manual page mentioned in <systemitem role="package">gentoo</systemitem>'s <filename>Makefile</filename>, but since the Debian Policy requires that every program has one, we'll make one later and install it in <filename>/usr/share/man/man1</filename>.
ca: Així doncs, hauríem d'instal·lar el fitxer binari en el directori <filename>/usr/bin</filename> en lloc de <filename>/usr/local/bin</filename> i la pàgina de manual a <filename>/usr/share/man/man1</filename> en lloc de <filename>/usr/local/man/man1</filename>. No hi ha cap referència a la pàgina de manual en el fitxer <filename>Makefile</filename> de <systemitem role="package">gentoo</systemitem> , però en Debian cal que cada programa tengui la seva pàgina de manual, així que més endavant en farem una i la instal·larem a <filename>/usr/share/man/man1</filename>.
fr: Dès lors, l'exécutable devrait être installé sous <filename>/usr/bin</filename> plutôt que sous <filename>/usr/local/bin</filename>, la page de manuel sous <filename>/usr/share/man/man1</filename> plutôt que sous <filename>/usr/local/man/man1</filename>, etc. Remarquez qu'il n'y a pas de page de manuel mentionnée dans le fichier <filename>Makefile</filename> de <systemitem role="package">gentoo</systemitem>, mais comme la Charte Debian demande que chaque programme en ait une, il faudra en créer une plus tard et l'installer dans <filename>/usr/share/man/man1</filename>.
it: Si dovrà installare, quindi, il binario in <filename>/usr/bin</filename> anziché in <filename>/usr/local/bin</filename>, la pagina di manuale in <filename>/usr/share/man/man1</filename> anziché <filename>/usr/local/man/man1</filename>, ecc. Da notare che nel <filename>Makefile</filename> del pacchetto <systemitem role="package">gentoo</systemitem> non è presente una pagina di manuale, ma dal momento che la policy di Debian prevede che ogni programma ne abbia una, ne verrà creata una e sarà installata in <filename>/usr/share/man/man1</filename>.
