Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: One of the most annoying things about software is when you spend a great deal of time and effort customizing a program, only to have an upgrade stomp all over your changes. Debian solves this problem by marking such configuration files as conffiles. <placeholder type="footnote" id="0"/> When you upgrade a package, you'll be prompted whether you want to keep your old configuration files or not.
ja: 大変な時間と労力を費やしてプログラムをカスタマイズしても、一回のアップグレードであなたの変更をあちこち上書きされてしまうとうんざりします。このような設定ファイルを conffile と記録しておくことで、Debianはこの問題を解決しました。<placeholder type="footnote" id="0"/> パッケージをアップグレードした時に、あなたは古い設定ファイルをキープしたいかかどうかを尋ねられます。

source: For more information on the <emphasis>maintainer scripts</emphasis>, see <xref linkend="maintscripts"/>.
ja: <emphasis>maintainer scripts</emphasis>について、詳細は<xref linkend="maintscripts"/> を参照してください。

source: Files listed in the <filename>install</filename> file doesn't need the directories created first. See <xref linkend="install"/>.
ja: <filename>install</filename>ファイルに書かれてるファイルは最初にディレクトリを作成する必要がないファイルです。詳しくは <xref linkend="install"/> を参照してください。

source: It is best to try to run the installation first and only use this if you run into trouble. There is no preceding slash on the directory names listed in the <filename>dirs</filename> file.
ja: まずは試しにインストールしてみて、なにか問題が起きた場合にのみ使うべきでしょう。 <filename>dirs</filename> ファイル中のディレクトリ名の頭にスラッシュが付かない事に注意してください。

source: For information on the file format, see <citerefentry> <refentrytitle>install-docs</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> and the <systemitem role="package">doc-base</systemitem> manual, in <ulink url="&doc-base;">Debian doc-base Manual</ulink>.
ja: このファイルの書式については<citerefentry> <refentrytitle>install-docs</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>および <ulink url="&doc-base;">Debian doc-base Manual</ulink> にある <systemitem role="package">doc-base</systemitem> のマニュアルを参照してください。

source: For more details on installing additional documentation, look in <xref linkend="destdir"/>.
ja: 追加ドキュメントのインストールについて、詳細は<xref linkend="destdir"/> を見てください。

source: The <filename><replaceable>package</replaceable>.init</filename> file is installed as the <filename>/etc/init.d/<replaceable>package</replaceable></filename> script for the <emphasis>init script</emphasis> which starts and stops a daemon. Its fairly generic skeleton template is provided by the <command>dh_make</command> command as <filename>init.d.ex</filename>. You'll likely have to rename and edit it, a lot, while making sure to provide <ulink url="&lsb;">Linux Standard Base</ulink> (LSB) compliant headers. It gets installed into the temporary directory by <citerefentry> <refentrytitle>dh_installinit</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ja: <filename><replaceable>package</replaceable>.init</filename> ファイルはデーモンの起動や停止をする <emphasis>init スクリプト</emphasis> のための <filename>/etc/init.d/<replaceable>package</replaceable></filename> スクリプトとしてインストールされます。その極めて標準的なテンプレートファイルは<command>dh_make</command>コマンドによって提供される <filename>init.d.ex</filename>です。<ulink url="&lsb;">Linux Standard Base</ulink> (LSB) に準拠したヘッダーを提供するように確実にするとともに、ファイル名を変更しかなりの内容編集をすることがおそらく必要です。このファイルは<citerefentry> <refentrytitle>dh_installinit</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>によって、一時的なディレクトリにインストールされます。

source: The <filename><replaceable>package</replaceable>.default</filename> file will be installed into <filename>/etc/default/<replaceable>package</replaceable></filename>. This file sets defaults that are sourced by the <emphasis>init script</emphasis>. Most times this <filename><replaceable>package</replaceable>.default</filename> file is used to disable running a daemon, set some default flags or timeouts. If your <emphasis>init script</emphasis> has certain <emphasis>settable</emphasis> features you want to install these into the <filename><replaceable>package</replaceable>.default</filename> file, not the <emphasis>init script</emphasis>.
ja: <filename><replaceable>package</replaceable>.default</filename> ファイルは <filename>/etc/default/<replaceable>package</replaceable></filename> にインストールされます。このファイルは <emphasis>init スクリプト</emphasis>のデフォルト設定となります。この <filename><replaceable>package</replaceable>.default</filename> ファイルは大抵、デーモンを停止したり、デフォルトのフラグやタイムアウトなどの設定に使われます。もしもあなたの <emphasis>init スクリプト</emphasis>が、特定の<emphasis>設定可能</emphasis>な機能を有しているのであれば、それは <emphasis>init スクリプト</emphasis>ではなく、このデフォルトファイルに設定しておくべきでしょう。

source: If your upstream program provides a file for the <emphasis>init script</emphasis>, you can either use it or not. If you don't use their <emphasis>init script</emphasis> then create a new one in <filename><replaceable>package</replaceable>.init</filename>. However if the upstream <emphasis>init script</emphasis> looks fine and installs in the right place you still need to setup the <filename>rc*</filename> symlinks. To do this you will need to override <command>dh_installinit</command> in the <filename>rules</filename> file with the following lines:
ja: 上流プログラムが <emphasis>init スクリプト</emphasis>用ファイルを提供する場合、それを使用するかしないかは自由です。もし上流からの <emphasis>init スクリプト</emphasis>を使わないのであれば<filename><replaceable>package</replaceable>.init</filename>に新しいのを作成しましょう。上流の <emphasis>init スクリプト</emphasis>が問題なく正しい場所にインストールされるとしても、<filename>rc*</filename> シンボリックリンクの設定は必要です。そのためには、<filename>rules</filename>ファイルに以下を追加して、<command>dh_installinit</command>をオーバーライドしましょう。

source: If <systemitem role="package">lintian</systemitem> reports an erroneous diagnostics for a case when the policy allows exceptions to some rule, you can use <filename><replaceable>package</replaceable>.lintian-overrides</filename> or <filename>source/lintian-overrides</filename> to quiet it. Please read <ulink url="&lintian-doc;">Lintian User's Manual</ulink> and refrain from abusing this.
ja: ポリシーが例外を認めているにも関わらず、<systemitem role="package">lintian</systemitem>が誤診断を報告してきた場合、<filename><replaceable>package</replaceable>.lintian-overrides</filename>か<filename>source/lintian-overrides</filename>を使って黙らせることができます。<ulink url="&lintian-doc;">Lintian User's Manual</ulink> を読み、濫用は控えてください。

source: manual page sections
ja: マニュアルページのセクション

source: Section
ja: セクション

source: Description
ja: 内容

source: Notes
ja: ノート

source: User command
ja: ユーザーコマンド

source: Executable commands or scripts
ja: 実行可能なコマンドやスクリプト

source: System calls
ja: システムコール

source: Functions provided by the kernel
ja: カーネルが提供するファンクション

source: Library calls
ja: ライブラリコール

source: Functions within system libraries
ja: システムライブラリが提供するファンクション

source: Special files
ja: 特殊ファイル

source: Usually found in <filename>/dev</filename>
ja: 通常 <filename>/dev</filename> にある

source: File formats
ja: ファイルフォーマット

source: E.g. <filename>/etc/passwd</filename>'s format
ja: 例えば、<filename>/etc/passwd</filename>のフォーマット

source: Games
ja: ゲーム

source: Games or other frivolous programs
ja: ゲームや他の他愛ないプログラム

source: Macro packages
ja: マクロパッケージ

source: Such as <command>man</command> macros
ja: <command>man</command>のマクロ等

source: System administration
ja: システム管理

source: Programs typically only run by root
ja: 普通rootが実行するプログラム

source: Kernel routines
ja: カーネルルーチン

source: Non-standard calls and internals
ja: 非標準のコールや内部コール

source: add <literal>docbook-to-man</literal> to the <literal>Build-Depends</literal> line in the <filename>control</filename> file
it: aggiunto <literal>docbook-to-man</literal> alla linea <literal>Build-Depends</literal> nel file <filename>control</filename>
ja: <filename>control</filename> ファイルの <literal>Build-Depends</literal> 行へ <literal>docbook-to-man</literal> を追加

source: To install <filename>docs/gentoo.1</filename> for the <systemitem role="package">gentoo</systemitem> package as its manpage, you create a <filename>gentoo.manpages</filename> file as the following.
ja: <systemitem role="package">gentoo</systemitem> パッケージのマンページとして <filename>docs/gentoo.1</filename> をインストールするには、以下のような <filename>gentoo.manpages</filename> ファイルを作成します。

source: Here's the default <filename>menu.ex</filename> file that <command>dh_make</command> created.
ja: 以下が <command>dh_make</command> が生成したデフォルトの <filename>menu.ex</filename> ファイルです。

source: The current list of sections is at <ulink url="&menu-structure;">The Debian Menu sub-policy 2.1 'Preferred menu structure'</ulink>. There were a major reorganization of menu structure for <literal>squeeze</literal>.
ja: セクションに関する現行のリストは <ulink url="&menu-structure;">The Debian Menu sub-policy 2.1 'Preferred menu structure'</ulink> にあります。メニュー構造の大幅な改変が <literal>squeeze</literal> で行われました。

source: The next is <literal>section</literal>, where the menu and submenu entry should appear in. <placeholder type="footnote" id="0"/>
ja: 次はメニューやサブメニューのエントリーが現れる <literal>section</literal>です。<placeholder type="footnote" id="0"/>

source: You can also add other fields like <literal>longtitle</literal>, <literal>icon</literal>, <literal>hints</literal> etc. See <citerefentry> <refentrytitle>dh_installmenu</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>menufile</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>update-menus</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> and <ulink url="&menu-policy;">The Debian Menu sub-policy</ulink> for more information.
ja: 他にも、<literal>longtitle</literal>、<literal>icon</literal>、<literal>hints</literal>などのフィールドを追加できます。詳しくは <citerefentry> <refentrytitle>dh_installmenu</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>、 <citerefentry> <refentrytitle>menufile</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>、 <citerefentry> <refentrytitle>update-menus</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>、<ulink url="&menu-policy;">The Debian Menu sub-policy</ulink> を参照してください。

source: Normally with this <filename>watch</filename> file, the URL at <literal>&sf-net;/gentoo</literal> is downloaded and searched for links of the form <literal>&lt;a href=...&gt;</literal>. The base name (just the part after the final <literal>/</literal>) of these linked URLs are matched against Perl regular expression (see <citerefentry> <refentrytitle>perlre</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) pattern <literal>gentoo-(.+)\.tar\.gz</literal>. Out of matched files, the file with the greatest version number is downloaded and the <command>uupdate</command> program is run to create the updated source tree from them.
ja: 通常、この<filename>watch</filename>ファイルでは、<literal>&sf-net;/gentoo</literal>のURLがダウンロードされ、<literal>&lt;a href=...&gt;</literal>フォームへのリンクを検索します。リンクされたURLのベースネーム(最後の<literal>/</literal>から後の部分のみ)はPerlの正規表現 (<citerefentry> <refentrytitle>perlre</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> 参照)パターン<literal>gentoo-(.+)\.tar\.gz</literal>に照らし合わされます。一致したファイルの中から、バージョンの番号が一番大きいものがダウンロードされ、それからアップデートされたソースツリーを作成するために <command>uupdate</command> プログラムを実行します。

source: Although this is true for other sites, the SourceForge download service at <ulink url="&sf-net;"/> is an exception. When the <filename>watch</filename> file has an URL matching with the Perl regexp <literal>^http://sf\.net/</literal>, the <command>uscan</command> program substitutes it with <literal>&qa-do;watch/sf.php/</literal> and then applies this rule. The URL redirector service at this <ulink url="&qa-do;"/> is designed to offer a stable redirect service to the desired file for the <filename>watch</filename> file having <literal>&sf-net;/<replaceable>project</replaceable>/<replaceable>tar-name</replaceable>-(.+)\.tar\.gz</literal>. This solves issues related to the periodically changing URL there.
ja: 他のサイトでは上記の通りですが、<ulink url="&sf-net;"/> のSourceForgeのダウンロードサービスは例外です。<filename>watch</filename>ファイルがPerlの正規表現<literal>^http://sf\.net/</literal>に一致するURLを含む場合、<command>uscan</command>プログラムが代わりに<literal>&qa-do;watch/sf.php/</literal>を使い、このルールを当てはめます。<ulink url="&qa-do;">&qa-do;</ulink>のURLリダイレクトは<literal>&sf-net;/<replaceable>project</replaceable>/<replaceable>tar-name</replaceable>-(.+)\.tar\.gz</literal>を含む<filename>watch</filename>ファイルを大対象に安定したリダイレクトを提供するよう設計されています。これにより、そこで周期的に変化するURLに関する問題を解決しています。

source: After you build a package, the source is normally left patched. You need to unpatch it manually by running <literal>dquilt pop -a</literal> before committing to the <literal>master</literal> branch. You can automate this by adding the optional <filename>debian/source/local-options</filename> file containing <literal>unapply-patches</literal>. This file is not included in the generated source package and changes the local build behavior only. This file may contain <literal>abort-on-upstream-changes</literal>, too (see <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
ja: パッケージをビルドした後は、ソースのパッチは通常当てたままにされます。<literal>master</literal>ブランチにコミットする前に手動で <literal>quilt pop -a</literal> を実行してパッチを外す必要があります。<filename>debian/source/local-options</filename>ファイルに<literal>unapply-patches</literal>を書いておけば、自動的にパッチを外せます。このファイルは生成されたソースパッケージには含まれず、ローカルビルドでの挙動のみを変更します。このファイルは<literal>abort-on-upstream-changes</literal>も含むかもしれません (<citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> 参照)。

source: <filename>source/options</filename> file
ja: <filename>source/options</filename> ファイル

source: The autogenerated files in the source tree can be quite annoying for packaging since they generate meaningless large patch files. There are custom modules such as <command>dh_autoreconf</command> to ease this problem as described in <xref linkend="customrules"/>.
ja: ソースツリーの中の自動生成されるファイルはパッケージングする際に無意味で大きなパッチファイルを生成するのでとても厄介です。<xref linkend="customrules"/> で説明したように<command>dh_autoreconf</command> のようなカスタムモジュールが本問題を解消るために存在します。

source: You can provide a Perl regular expression to the <literal>--extend-diff-ignore</literal> option argument of <citerefentry> <refentrytitle>dpkg-source</refentrytitle><manvolnum>1</manvolnum> </citerefentry> to ignore changes made to the autogenerated files while creating the source package.
ja: <citerefentry> <refentrytitle>dpkg-source</refentrytitle><manvolnum>1</manvolnum> </citerefentry> の <literal>--extend-diff-ignore</literal> オプション引数に Perl 正規表現を提供すると、ソースパッケージ生成時に自動生成ファイルへの変更を無視できます。

source: You can store such <command>dpkg-source</command> option argument in the <filename>source/options</filename> file of the source package as the generic solution to address this problem of the autogenerated files. The following will skip creating patch files for <filename>config.sub</filename>, <filename>config.guess</filename> and <filename>Makefile</filename>.
ja: この自動生成ファイルの問題の一般的解決策としてソースパッケージの <filename>source/options</filename> ファイル中に <command>dpkg-source</command> オプション引数を保存する事が出来ます。以下の例では、<filename>config.sub</filename> と <filename>config.guess</filename> と <filename>Makefile</filename> に関してパッチファイルを生成をスキップします。

source: Several methods for the patch set maintenance have been proposed and are in use with Debian packages. The <command>quilt</command> system is the preferred maintenance system in use. Other ones are <command>dpatch</command>, <command>dbs</command>, <command>cdbs</command>, etc. Many of these keep such patches as <filename>debian/patches/*</filename> files.
ja: パッチセットをメンテナンスするためのいくつかの方法が提案され、Debianパッケージで使われていますが、<command>quilt</command>が推奨されています。他には、<command>dpatch</command>、<command>dbs</command>、<command>cdbs</command>、などがあります。これらの方法は、大抵<filename>debian/patches/*</filename>ファイルでパッチを管理しています。

source: The newer <literal>3.0 (quilt)</literal> source format stores patches in <filename>debian/patches/*</filename> files using the <command>quilt</command> command. These patches and other package data which are all constrained under the <filename>debian</filename> directory are packaged as the <filename>debian.tar.gz</filename> file. Since the <command>dpkg-source</command> command can handle <command>quilt</command> formatted patch data in the <literal>3.0 (quilt)</literal> source without the <systemitem role="package">quilt</systemitem> package, it does not need to <literal>Build-Depends</literal> on the <systemitem role="package">quilt</systemitem> package. <placeholder type="footnote" id="0"/>
ja: 新しい<literal>3.0 (quilt)</literal>は、<command>quilt</command>コマンドを使って、パッチを<filename>debian/patches/*</filename>に置きます。<filename>debian</filename>ディレクトリ異化に拘束されているパッチや、その他のパッケージデータは、<filename>debian.tar.gz</filename>ファイルとしてパッケージングされます。<command>dpkg-source</command>コマンドは、<command>quilt</command>形式のパッチデータを<systemitem role="package">quilt</systemitem>パッケージなしで<literal>3.0 (quilt)</literal>として扱えるので、<literal>Build-Depends</literal>には<systemitem role="package">quilt</systemitem>パッケージは必要ありません。<placeholder type="footnote" id="0"/>

source: For <xref linkend="modify"/>, we created 3 patches in <filename>debian/patches</filename>.
ja: <xref linkend="modify"/> では、<filename>debian/patches</filename>に３つのパッチを作りました。

source: Since Debian patches are located in <filename>debian/patches</filename>, please make sure to setup the <command>dquilt</command> command properly as described in <xref linkend="quiltrc"/>.
ja: Debianのパッチは <filename>debian/patches</filename> にあるので、<xref linkend="quiltrc"/> の説明に従い、<command>dquilt</command>コマンドを正しく設定してください。

source: The patches stored in the newer <literal>3.0 (quilt)</literal> source format must be <emphasis>fuzz</emphasis> free. You should ensure it as <literal>dquilt pop -a; while dquilt push; do dquilt refresh; done</literal>.
ja: 新しい<literal>3.0 (quilt)</literal>形式で保存されるパッチには <emphasis>曖昧さ</emphasis>があってはいけません。それを保証するために、<literal>dquilt pop -a; while dquilt push; do dquilt refresh; done</literal>としてください。

source: packages listed in the <literal>Build-Depends</literal> field (see <xref linkend="control"/>), and
ja: <literal>Build-Depends</literal>に挙げられているパッケージ(参照<xref linkend="control"/>)

source: packages listed in the <literal>Build-Depends-indep</literal> field (see <xref linkend="control"/>).
ja: <literal>Build-Depends-indep</literal>に挙げられているパッケージ(参照 <xref linkend="control"/>)が全てインストールされていなければなりません。

source: This GPG key must be signed by a Debian developer to get connected to the web of trust and must be registered to <ulink url="&keyring;">the Debian keyring</ulink>. This enables your uploaded packages to be accepted to the Debian archives. See <ulink url="&keycreate;">Creating a new GPG key</ulink> and <ulink url="&keysigning; ">Debian Wiki on Keysigning</ulink>.
ja: This GPG キーは信頼の網に連結するように Debian デベロッパーによって署名され、<ulink url="&keyring;">the Debian keyring</ulink> に登録されていなければいけません。こうすることで Debian アーカイブにパッケージをアップロードして受け付けられるようになります。<ulink url="&keycreate;">Creating a new GPG key</ulink> と <ulink url="&keysigning; ">Debian Wiki on Keysigning</ulink> を参照下さい。

source: The only input that will be required of you is your GPG secret pass phrase, twice. <placeholder type="footnote" id="0"/>
ja: 途中で GPG の秘密鍵を 2 回入力する必要がありますが、 それ以外はこのプログラムにすべて任せておけば大丈夫です。 <placeholder type="footnote" id="0"/>

source: You can avoid applying <command>quilt</command> patches in the <literal>3.0 (quilt)</literal> source format at the end of the extraction with the <literal>--skip-patches</literal> option. Alternatively, you can run <literal>dquilt pop -a</literal> after normal operation.
ja: <literal>3.0 (quilt)</literal>ソースフォーマットで<command>quilt</command>パッチを当てないようにするには、上記コマンドに<literal>--skip-patches</literal>オプションをつけて実行します。または、通常の操作の後に、<literal>quilt pop -a</literal>を実行する方法もあります。

source: packages listed in the <literal>Build-Depends</literal> field (see <xref linkend="control"/>).
ja: <literal>Build-Depends</literal>に挙げられているパッケージ (参照 <xref linkend="control"/>)を確実にインストールします。

source: Although packages listed in the <literal>Build-Depends-indep</literal> field are required to be installed for the normal packaging by us (see <xref linkend="completebuild"/>), they are not required to be installed for the autobuilder system since it build only architecture dependent binary packages. <placeholder type="footnote" id="0"/> This difference between normal packaging and autobuilder situation dictates whether you record such required packages in the <literal>Build-Depends</literal> or <literal>Build-Depends-indep</literal> fields of the <filename>debian/control</filename> file (see <xref linkend="control"/>).
ja: <literal>Build-Depends-indep</literal>フィールドのパッケージは、通常のパッケージの場合はインストールを要求されますが(参照 <xref linkend="completebuild"/>)、オートビルダーシステムは、アーキテクチャ依存のパッケージのみをビルドするので、インストールは必須ではありません。<placeholder type="footnote" id="0"/> オートビルダーを使用した場合と普通のパッケージングとのこの違いは、要求パッケージを <filename>debian/control</filename>ファイルの<literal>Build-Depends</literal> や <literal>Build-Depends-indep</literal>に記録するかどうかで決定されます。(参照 <xref linkend="control"/>)

source: When you first upload the package to the archive, you need to include the original <filename>orig.tar.gz</filename> source, too. If the Debian revision number of such package is neither <literal>1</literal> nor <literal>0</literal>, you must provide <command>dpkg-buildpackage</command> command with the <literal>-sa</literal> option. On the other hand, the <literal>-sd</literal> option will force to exclude the original <filename>orig.tar.gz</filename> source.
ja: はじめてパッケージをアーカイブにアップロードする際は、オリジナルの<filename>orig.tar.gz</filename>ソースファイルを含めなければなりません。当該パッケージの Debian リビジョン番号が <literal>1</literal> でも <literal>0</literal> でも無い場合には、<command>dpkg-buildpackage</command> に <literal>-sa</literal> オプションを付けなければなりません。逆に、<literal>-sd</literal>オプションを付けると、オリジナルの<filename>orig.tar.gz</filename> ソースファイルを強制的に除外します。

source: See <ulink url="&buildd-do;"/> for more on the auto-builder of the Debian package.
ja: Debian パッケージのオートビルダーの詳細は <ulink url="&buildd-do;"/> を参照下さい。

source: For a clean room (<command>chroot</command>) build environment to verify the build dependencies, the <systemitem role="package">pbuilder</systemitem> package is very useful. <placeholder type="footnote" id="0"/> This ensures a clean build from the source under the <literal>sid</literal> auto-builder for different architectures and avoids the severity serious FTBFS (Fails To Build From Source) bug which is always in the RC (release critical) category. <placeholder type="footnote" id="1"/>
ja: ビルド依存を確認するためのクリーンルーム (<command>chroot</command>)なビルド環境として、<systemitem role="package">pbuilder</systemitem>パッケージが非常に便利です。<placeholder type="footnote" id="0"/> これを使うことで、異なるアーキテクチャ向けに<literal>sid</literal>環境オートビルダーの下でのソースからのクリーンなビルドが保証され、常に RC (release critical) に分類される重要度が serious の FTBFS (Fails To Build From Source) バグを防ぎます。<placeholder type="footnote" id="1"/>

source: See <ulink url="&pbuilder;"/>, <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>pbuilderrc</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>, and <citerefentry> <refentrytitle>pbuilder</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>.
ja: <ulink url="&pbuilder;"/> と <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> と <citerefentry> <refentrytitle>pbuilderrc</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> と <citerefentry> <refentrytitle>pbuilder</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> を参照下さい。

source: See <ulink url="&debref-vcs;">Version control systems</ulink> for more.
ja: 詳しくは <ulink url="&debref-vcs;">Version control systems</ulink> を参照下さい。

source: If your upstream uses the source code management system (VCS) <placeholder type="footnote" id="0"/> to maintain their code, you should consider to use them. That makes merging and cherry-picking upstream patches much easier. There are several specialized wrapper script packages for the Debian package building for each VCS.
ja: 上流がソースコード管理システム (VCS) <placeholder type="footnote" id="0"/> を使っているのであれば、同様に使用することを考えるべきです。それによって、マージと上流パッチの取捨選択がより簡単になります。各VCS毎にDebianパッケージをビルドするための特別なラッパースクリプトのパッケージもいくつかあります。
