Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: Use this when your program replaces files from another package, or completely replaces another package (used in conjunction with <literal>Conflicts</literal>). Files from the named packages will be overwritten with the files from your package.
ca: Fes servir aquesta opció només si el teu programa substitueix fitxers d'un altra paquet o el paquet complet (generalment es fa servir aquesta opció conjuntament amb <literal>Conflicts</literal>). S'eliminaran els fitxers dels paquets indicats abans d'instal·lar el teu.
es: Usa esto si tu programa reemplaza ficheros de otro paquete o reemplaza totalmente otro paquete (generalmente se usa conjuntamente con <literal>Conflicts</literal>). Se sobrescribirán los ficheros de los paquetes indicados con los ficheros de tu paquete.
fr: à utiliser quand le programme remplace des fichiers d'un autre paquet, ou remplace complètement un autre paquet (utilisé en conjonction avec <literal>Conflicts</literal>). Les fichiers du paquet nommé seront écrasés par les fichiers de votre paquet.
it: Si usi questa relazione quando il programma rimpiazza i file di un altro pacchetto, o lo rimpiazza completamente (utilizzato in congiunzione con <literal>Conflicts</literal>). I file dei pacchetti indicati saranno sovrascritti con i file del nuovo pacchetto.
ja: あなたのプログラムが別パッケージのファイルを上書きしたり、パッケージ全体を完全に置き換えてしまう場合（この場合は<literal>Conflicts</literal>も一緒に指定してください）この指定を使います。ここで指定されたパッケージに含まれるファイルはあなたのパッケージのファイルによって上書きされます。

source: All these fields have uniform syntax. They are a list of package names separated by commas. These package names may also be lists of alternative package names, separated by vertical bar symbols <literal>|</literal> (pipe symbols).
ca: Tots aquests camps tenen una sintaxi uniforme: es tracta d'una llista de noms de paquets separats per comes. Aquests noms de paquets també poder ésser llistes de paquets alternatius, separats amb una barra vertical «<literal>|</literal>» (símbol de tub).
es: Todos estos campos tienen una sintaxis uniforme: se trata de una lista de nombres de paquetes separados por comas. Estos nombres de paquetes también puede ser listas de paquetes alternativos, separados por los símbolos de barra vertical «<literal>|</literal>» (símbolos tubería).
fr: Tous ces champs ont une syntaxe uniforme. Il s'agit d'une liste de paquets séparés par des virgules. Ces noms de paquets peuvent aussi être une liste d'alternatives, séparés par des barres verticales « <literal>|</literal> » (symbole tube ou « pipe »).
it: Tutti i campi qui descritti hanno una sintassi uniforme. Sono costituiti da una lista contenente i nomi dei pacchetti separati da virgole. Questi possono essere anche costituiti da liste di nomi di pacchetto alternativi, separati da barre verticali <literal>|</literal> (simboli pipe).
ja: これらのフィールドは胸痛の書式で記述します。指定したいパッケージ名をコンマで区切って並べます。もし選択肢があれば、それらのパッケージ名を縦棒<literal>|</literal> (パイプ記号)で区切って並べます。

source: The fields may restrict their applicability to particular versions of each named package. These versions are listed in parentheses after each individual package name, and they should contain a relation from the list below followed by the version number. The relations allowed are: <literal>&lt;&lt;</literal>, <literal>&lt;=</literal>, <literal>=</literal>, <literal>&gt;=</literal> and <literal>&gt;&gt;</literal> for strictly lower, lower or equal, exactly equal, greater or equal and strictly greater, respectively. For example,
ca: Els camps poden restringir la seva aplicació a versions determinades del paquet llistat. Això es fa afegint a cada nom de paquet la versió entre parèntesi precedida pels símbols <literal>&lt;&lt;</literal>, <literal>&lt;=</literal>, <literal>=</literal>, <literal>&gt;=</literal> i <literal>&gt;&gt;</literal> per a estrictament anterior, anterior o igual, exactament igual, posterior o igual i estrictament posterior, respectivament. Per exemple:
es: Los campos pueden restringir su aplicación a versiones determinadas de cada paquete nombrado. Esto se hace listando después de cada nombre de paquete individual las versiones entre paréntesis, e indicando antes del número de versión una relación de la siguiente lista. Las relaciones permitidas son: <literal>&lt;&lt;</literal>, <literal>&lt;=</literal>, <literal>=</literal>, <literal>&gt;=</literal> y <literal>&gt;&gt;</literal> para estrictamente anterior, anterior o igual, exactamente igual, posterior o igual o estrictamente posterior, respectivamente. Por ejemplo:
fr: Le domaine d'application des champs peut être restreint à des versions particulières de chaque paquet nommé. Ces versions sont précisées entre parenthèses après chaque nom de paquet individuel, et doivent contenir une relation de la liste suivante suivie par un numéro de version. Les relations autorisées sont <literal>&lt;&lt;</literal>, <literal>&lt;=</literal>, <literal>=</literal>, <literal>&gt;=</literal> et <literal>&gt;&gt;</literal> (respectivement : strictement plus petit, plus petit ou égal, exactement égal, plus grand ou égal et strictement plus grand). Par exemple :
it: I campi possono limitare la loro applicabilità a particolari versioni di ogni pacchetto indicato. Queste versioni sono elencate tra parentesi dopo ogni singolo nome di pacchetto, e dovrebbero contenere una relazione presa dalla lista qui sotto seguita dal numero di versione. Le relazioni permesse sono: <literal>&lt;&lt;</literal>, <literal>&lt;=</literal>, <literal>=</literal>, <literal>&gt;=</literal> e <literal>&gt;&gt;</literal> per strettamente inferiore, inferiore o uguale, esattamente uguale, superiore o uguale e strettamente superiore, rispettivamente. Per esempio,
ja: また、適用されるパッケージのバージョン番号で制限をすることも可能です。これを指定したい場合にはそれぞれのパッケージ名の後で 丸カッコ (パーレン) を開き、以下の関係式に続けて バージョン番号を指定してください。使用できる関係式は、<literal>&lt;&lt;</literal>, <literal>&lt;=</literal>, <literal>=</literal>, <literal>&gt;=</literal> and <literal>&gt;&gt;</literal> で、それぞれ 「指定されたものより古いバージョンのみ」、 「指定されたバージョン以前」(指定のバージョンも当然含まれます)、 「指定のバージョンのみ」 「指定されたバージョン以降」(指定のバージョンも当然含まれます)、 「指定されたものより新しいバージョンのみ」を意味します。今まで説明してきた依存関係を使うことで、例えば以下のような 指定も可能です。

source: Depends: foo (&gt;= 1.2), libbar1 (= 1.3.4) Conflicts: baz Recommends: libbaz4 (&gt;&gt; 4.0.7) Suggests: quux Replaces: quux (&lt;&lt; 5), quux-foo (&lt;= 7.6)
fr: Depends: toto (&gt;= 1.2), libbidule1 (= 1.3.4) Conflicts: machin Recommends: libmachin4 (&gt;&gt; 4.0.7) Suggests: truc Replaces: truc (&lt;&lt; 5), truc-toto (&lt;= 7.6)

source: The last feature you need to know about is <literal>${shlibs:Depends}</literal>, <literal>${perl:Depends}</literal>, <literal>${misc:Depends}</literal>, etc. These entries are substituted by the list generated by other <systemitem role="package">debhelper</systemitem> components when the <citerefentry> <refentrytitle>dh_gencontrol</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> command is executed.
es: La última funcionalidad que necesitas conocer es <literal>$(shlibs:Depends)</literal>,<literal>${perl:Depends}</literal>, <literal>${misc:Depends}</literal>, etc. Estas entradas funcionan como variables: son substituidas por listas de paquetes cuando <systemitem role="package">debhelper</systemitem> ejecuta la orden <citerefentry> <refentrytitle>dh_gencontrol</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
fr: La dernière fonctionnalité à connaître est <literal>${shlibs:Depends}</literal>, <literal>${perl:Depends}</literal>, <literal>${misc:Depends}</literal>, etc. Ces paramètres seront remplacés par une liste générée par les autres composants de <systemitem role="package">debhelper</systemitem> quand la commande <citerefentry> <refentrytitle>dh_gencontrol</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> est exécutée.

source: <citerefentry> <refentrytitle>dh_shlibdeps</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> will scan it for binaries and libraries determine their shared library dependencies and detect which packages they are in, such as <systemitem role="package">libc6</systemitem> or <systemitem role="package">xlib6g</systemitem>, after your package has been built and installed into the temporary directory. This list of shared library dependencies is used for <literal>${shlibs:Depends}</literal>.
es: Después de que tu paquete se compile y se instale en el directorio temporal, <citerefentry> <refentrytitle>dh_shlibdeps</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> lo escaneará en busca de binarios y bibliotecas para determinar las dependencias de bibliotecas compartidas y en qué paquetes están, tales como como <systemitem role="package">libc6</systemitem> o <systemitem role="package">xlib6g</systemitem>. Esta lista sera utilizada por <literal>${shlibs:Depends}</literal>.
fr: <citerefentry> <refentrytitle>dh_shlibdeps</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> parcourra le paquet après sa construction et son installation dans le répertoire temporaire, afin de rechercher les exécutables et bibliothèques, déterminer leurs dépendances en bibliothèques partagées, et détecter dans quels paquets elles se trouvent (<systemitem role="package">libc6</systemitem> ou <systemitem role="package">xlib6g</systemitem> par exemple). La liste des bibliothèques partagées dépendantes est utilisée pour remplacer <literal>${shlibs:Depends}</literal>.

source: The package list generated by the <citerefentry> <refentrytitle>dh_perl</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> is used for <literal>${perl:Depends}</literal>.
es: La lista de paquetes generada por <citerefentry> <refentrytitle>dh_perl</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> se usa para <literal>${perl:Depends}</literal>.
fr: La liste de paquets créée par <citerefentry> <refentrytitle>dh_perl</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> est utilisée pour remplacer <literal>${perl:Depends}</literal>.

source: Some <systemitem role="package">debhelper</systemitem> commands may make the generated package need to depend on some other packages. This list of required packages is used for <literal>${misc:Depends}</literal>.
es: Algunas órdenes de <systemitem role="package">debhelper</systemitem> determinan las dependencias de los paquetes listados anteriormente. La lista de estos paquetes se usará para <literal>${misc:Depends}</literal>.
fr: Certaines commandes de <systemitem role="package">debhelper</systemitem> peuvent rendre la création de paquet dépendante d'autres paquets. Cette liste de paquets nécessaires est utilisée pour remplacer <literal>${misc:Depends}</literal>.

source: Having said all that, we can leave the <literal>Depends</literal> field exactly as it is now, and insert another line after it saying <literal>Suggests: file</literal>, because <systemitem role="package">gentoo</systemitem> can use some features provided by that <systemitem role="package">file</systemitem> package.
es: Después de decir todo esto, podemos dejar la línea de <literal>Depends</literal> exactamente como está ahora e insertar otra línea tras ésta con el texto <literal>Suggests: file</literal>, porque <systemitem role="package">gentoo</systemitem> utiliza algunas funciones proporcionadas por el paquete/programa <systemitem role="package">file</systemitem>.
fr: Cela dit, le champ <literal>Depends</literal> peut rester exactement comme il est maintenant, et une autre ligne avec « <literal>Suggests: file</literal> » peut être ajoutée, car <systemitem role="package">gentoo</systemitem> peut utiliser certaines fonctionnalités fournies par le paquet <systemitem role="package">file</systemitem>.
it: Avendo detto ciò, si può lasciare la riga <literal>Depends</literal> esattamente come è ora, si può inserire un'altra riga dopo questa che dica <literal>Suggests: file</literal>, perché <systemitem role="package">gentoo</systemitem> può utilizzare alcune caratteristiche fornite dal pacchetto <systemitem role="package">file</systemitem>.
ja: とは言っても、今のところ<literal>Depends</literal>フィールドはそのままにして、その下に<literal>Suggests: file</literal>という新たな行を追加しましょう。<systemitem role="package">gentoo</systemitem>は<systemitem role="package">file</systemitem>パッケージによって提供される機能を利用することができるからです。

source: Line 12 is the short description. Most people screens are 80 columns wide so this shouldn't be longer than about 60 characters. I'll change it to <literal>fully GUI-configurable, two-pane X file manager</literal>.
ca: La línia 12 és una descripció curta del programa. La major part dels monitors dels usuaris són de 80 columnes d'amplada (els terminals, és clar!) per la qual cosa la descripció no hauria de tenir més de 60 caràcters. Canviaré la descripció per a <literal>fully GUI configurable GTK+ file manager</literal> («Interfície gràfica d'usuari GTK+ de gestió de fitxers completament configurable»).
es: La línea 12 es una descripción corta. La mayor parte de los monitores (en realidad, de las terminales en modo de texto) de la gente son de 80 columnas de ancho, así que no debería tener más de 60 caracteres. Cambiaré esto a <literal>fully GUI-configurable, two-pane X file manager</literal> («Gestor de ficheros GTK+ completamente configurable por GUI»).
fr: La ligne 12 est la description courte. La plupart des écrans sont larges de 80 colonnes, aussi cela ne devrait pas dépasser les 60 caractères. « <literal>fully GUI-configurable, two-pane X file manager</literal> » convient ici.
it: La riga 12 contiene una breve descrizione del pacchetto. La maggioranza degli schermi degli utenti è larga 80 colonne quindi il contenuto non dovrebbe superare i 60 caratteri. Si cambia questo valore in <literal>fully GUI-configurable, two-pane X file manager</literal>.
ja: 12行目は手短な説明です。ほとんどの人は1行（半角）80文字幅のスクリーンを使用しているので、(半角)60字以上にならないようにしましょう。<literal>fully GUI-configurable, two-pane X file manager</literal>に変更します。

source: Let's insert <literal>Vcs-*</literal> fields documented in <ulink url="&devref-bpp-vcs;">Developer's Reference, 6.2.5. 'Version Control System location'</ulink> between line 6 and 7. Let's assume that the <systemitem role="package">gentoo</systemitem> package is located in Debian Alioth Git Service at <literal>git://git.debian.org/git/collab-maint/gentoo.git</literal>.
fr: Le champ <literal>Vcs-*</literal> documenté dans la <ulink url="&devref-bpp-vcs;">référence du développeur, 6.2.5 « Emplacement du système de gestion de versions »</ulink> peut être inséré entre les lignes 6 et 7. Considérons que le paquet <systemitem role="package">gentoo</systemitem> est localisé sur le service Git d'Alioth en <literal>git://git.debian.org/git/collab-maint/gentoo.git</literal>.

source: Finally, here is the updated <filename>control</filename> file:
ca: Finalment, el fitxer <filename>control</filename> actualitzat quedarà així:
es: Aquí está el archivo <filename>control</filename> actualizado:
fr: Finalement, voici le fichier <filename>control</filename> mis à jour :
ja: 以下が修正後の<filename>control</filename> ファイルです。

source: 1 Source: gentoo 2 Section: x11 3 Priority: optional 4 Maintainer: Josip Rodin &lt;joy-mg@debian.org&gt; 5 Build-Depends: debhelper (&gt;= 7.0.5), xlibs-dev, libgtk1.2-dev, libglib1.2-dev 6 Standards-Version: 3.8.4 7 Vcs-Git: git://git.debian.org/git/collab-maint/gentoo.git 8 Vcs-browser: http://git.debian.org/?p=collab-maint/gentoo.git 9 Homepage: &gentoo; 10 11 Package: gentoo 12 Architecture: any 13 Depends: ${shlibs:Depends}, ${misc:Depends} 14 Suggests: file 15 Description: fully GUI-configurable, two-pane X file manager 16 gentoo is a two-pane file manager for the X Window System. gentoo lets the 17 user do (almost) all of the configuration and customizing from within the 18 program itself. If you still prefer to hand-edit configuration files, 19 they're fairly easy to work with since they are written in an XML format. 20 . 21 gentoo features a fairly complex and powerful file identification system, 22 coupled to a object-oriented style system, which together give you a lot 23 of control over how files of different types are displayed and acted upon. 24 Additionally, over a hundred pixmap images are available for use in file 25 type descriptions. 26 . 29 gentoo was written from scratch in ANSI C, and it utilises the GTK+ toolkit 30 for its interface.
fr: 1 Source: gentoo 2 Section: x11 3 Priority: optional 4 Maintainer: Prénom Nom &lt;votre.adresse.mail@example.org&gt; 5 Build-Depends: debhelper (&gt;= 7.0.5), xlibs-dev, libgtk1.2-dev, libglib1.2-dev 6 Standards-Version: 3.8.4 7 Vcs-Git: git://git.debian.org/git/collab-maint/gentoo.git 8 Vcs-browser: http://git.debian.org/?p=collab-maint/gentoo.git 9 Homepage: &gentoo; 10 11 Package: gentoo 12 Architecture: any 13 Depends: ${shlibs:Depends}, ${misc:Depends} 14 Suggests: file 15 Description: fully GUI-configurable, two-pane X file manager 16 gentoo is a two-pane file manager for the X Window System. gentoo lets the 17 user do (almost) all of the configuration and customizing from within the 18 program itself. If you still prefer to hand-edit configuration files, 19 they're fairly easy to work with since they are written in an XML format. 20 . 21 gentoo features a fairly complex and powerful file identification system, 22 coupled to a object-oriented style system, which together give you a lot 23 of control over how files of different types are displayed and acted upon. 24 Additionally, over a hundred pixmap images are available for use in file 25 type descriptions. 26 . 29 gentoo was written from scratch in ANSI C, and it utilises the GTK+ toolkit 30 for its interface.

source: <filename>copyright</filename> file
ca: El fitxer <filename>copyright</filename>.
es: El archivo <filename>copyright</filename>
fr: Fichier <filename>copyright</filename>
it: Il file <filename>copyright</filename>
ja: <filename>copyright</filename>ファイル

source: This file contains the information about package upstream resources, copyright and license information. Its format is not dictated by the Debian Policy Manual, but the content is (<ulink url="&policy-copyright;">Debian Policy Manual, 12.5 'Copyright information'</ulink>). You may also consult <ulink url="&dep5;">DEP-5: Machine-parseable debian/copyright</ulink>.
fr: Ce fichier contient les informations sur les ressources en amont, le copyright et la licence du paquet. Le format n'est pas dicté par la Charte Debian, mais son contenu l'est (<ulink url="&policy-copyright;">Charte Debian, 12.5 « Informations sur le copyright »</ulink>). Vous pouvez aussi consulter la <ulink url="&dep5;">DEP-5 : debian/copyright analysable automatiquement</ulink>.

source: <command>dh_make</command> can give you a template <filename>copyright</filename> file. Let's use the <literal>--copyright gpl2</literal> option here to get a template file for the <systemitem role="package">gentoo</systemitem> package released under GPL-2.
ca: <command>dh_make</command> proporciona una plantilla per a l'arxiu <filename>copyright</filename>. Amb l'opció <literal>--copyright gpl2</literal> s'aconsegueix la plantilla per al paquet <systemitem role="package">gentoo</systemitem> amb la llicència GPL-2.
es: <command>dh_make</command> proporciona una plantilla para el archivo <filename>copyright</filename>. Con la opción <literal>--copyright gpl2</literal> se consigue la plantilla para el paquete <systemitem role="package">gentoo</systemitem> con la licencia GPL-2.
fr: <command>dh_make</command> peut proposer un modèle de fichier <filename>copyright</filename>. L'option « <literal>--copyright gpl2</literal> » peut être utilisée ici pour obtenir un modèle de fichier pour le paquet <systemitem role="package">gentoo</systemitem> package publié sous GPL-2.
it: <command>dh_make</command> può fornire un modello di file del <filename>copyright</filename>, basta utilizzare l'opzione <literal>--copyright</literal> per selezionare quello giusto, se si desidera rilasciare il pacchetto <systemitem role="package">gentoo</systemitem> sotto licenza GPL-2.
ja: <command>dh_make</command>は<filename>copyright</filename>ファイルのテンプレートを作成します。GPL-2でリリースされた<systemitem role="package">gentoo</systemitem>パッケージのテンプレートを入手するには、<literal>--copyright gpl2</literal>オプションを使用します。

source: You must fill in missing information such as the place you got the package from, the actual copyright notice and their license to complete this file. For the common free software licenses such as GNU GPL-1, GNU GPL-2, GNU GPL-3, LGPL-2, LGPL-2.1, LGPL-3, GNU FDL-1.2, GNU FDL-1.3, Apache-2.0 or the Artistic license, you can just refer to the appropriate file in <filename>/usr/share/common-licenses/</filename> directory that exists on every Debian system. Otherwise, you must include the complete license.
ca: Has de completar la informació sobre el lloc on es pot obtenir el codi font, les condicions dels drets d'autor i la llicència. Les llicències de codi lliure més comuns són GNU GPL-1, GNU GPL-2, GNU GPL-3, LGPL-2, LGPL-2.1, LGPL-3, GNU FDL-1.2, GNU FDL-1.3, Apache-2.0 o la «Artistic license» i fer referència al fitxer corresponent disponible a <filename>/usr/share/common-licenses/</filename> en els sistemes Debian. En cas contrari, cal incloure el text complet de la llicència en el fitxer.
es: Debes completar la información sobre el lugar donde se puede obtener el código fuente, la condiciones de derechos de autor y la licencia. Las licencias de código libre más comunes son GNU GPL-1, GNU GPL-2, GNU GPL-3, LGPL-2, LGPL-2.1, LGPL-3, GNU FDL-1.2, GNU FDL-1.3, Apache-2.0 o la «Artistic license» y hacer referencia al archivo correspondiente ubicado en el directorio <filename>/usr/share/common-licenses/</filename>, que existen en todos los sistemas Debian. De lo contrario, debe incluirse el texto de la licencia completo.
fr: Les choses à ajouter obligatoirement à ce fichier sont l'endroit où vous avez trouvé ce paquet, ainsi que le copyright et la licence d'exploitation réelle. Si la licence est une des licences de logiciel libre populaires comme GNU GPL-1, GNU GPL-2, GNU GPL-3, LGPL-2, LGPL-2.1, LGPL-3, GNU FDL-1.2, GNU FDL-1.3, Apache ou Artistic, vous pouvez juste faire référence au fichier approprié dans le répertoire <filename>/usr/share/common-licenses/</filename>, qui existe sur chaque système Debian. Sinon, vous devez inclure la licence en entier.
it: Si devono inserire le informazioni mancanti per completare questo file, come la fonte utilizzata per recuperare il pacchetto, le informazioni attuali di copyright e la licenza. Per le licenze più comuni relative al software libero come, GNU GPL-1, GNU GPL-2, GNU GPL-3, LGPL-2, LGPL-2.1, LGPL-3, GNU FDL-1.2, GNU FDL-1.3, Apache-2.0 o la licenza Artistic, è possibile fare riferimento al file appropriato nella directory <filename>/usr/share/common-licenses/</filename> presente su ogni sistema Debian. In alternativa è necessario includere la licenza completa.
ja: パッケージの入手先や著作権表示、ラインセンスなど、抜けている情報を書き加え、ファイルを完成させましょう。GNU GPL-1、GNU GPL-2、GNU GPL-3、LGPL-2、LGPL-2.1,、LGPL-3、GNU FDL-1.2、GNU FDL-1.3、Apache-2.0や 創作上の特権など、一般的にフリーソフトウェアに使用される代表的なライセンスは、各Debianシステムの<filename>/usr/share/common-licenses/</filename>ディレクトリ内にあるファイルを参照することができ、全文の引用は不要です。その他のライセンスの場合、完全なライセンスを同包しなければなりません。

source: In short, here's how <systemitem role="package">gentoo</systemitem>'s <filename>copyright</filename> file should look like:
ca: Resumint, el fitxer <filename>copyright</filename> del paquet <systemitem role="package">gentoo</systemitem> hauria de ser més o menys com el següent exemple:
es: En resumen, el archivo <filename>copyright</filename> del paquete <systemitem role="package">gentoo</systemitem> debería ser similar a esto:
fr: En bref, voici ce à quoi le fichier <filename>copyright</filename> de <systemitem role="package">gentoo</systemitem> devrait ressembler :
it: Brevemente, ecco come il file di <filename>copyright</filename> del pacchetto <systemitem role="package">gentoo</systemitem> dovrebbe apparire:
ja: <systemitem role="package">gentoo</systemitem>パッケージの<filename>copyright</filename>ファイルは以下のようになります。
