Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: If you need to add erased template files for any reason, you may run <command>dh_make</command> again in the same Debian package source tree with <literal>--addmissing</literal> option. Then edit them properly.
ca: Si necessites novament algun dels fitxers de plantilla eliminats, pots regenerar-los executant <command>dh_make</command> amb l'opció <literal>--addmissing</literal> des del directori de les fonts. A continuació, fes les modificacions ja explicades.
es: Si necesitas de nuevo algunos de los archivos de plantilla eliminados, puedes regenerarlos ejecutando otra vez <command>dh_make</command> con la opción <literal>--addmissing</literal> en el directorio de las fuentes. A continuación modifícalos correctamente.
fr: si vous devez, pour quelque raison que ce soit, ajouter des fichiers modèles qui avaient été effacés, pour pouvez exécuter <command>dh_make</command> à nouveau depuis le répertoire des sources Debian, avec l'option <literal>--addmissing</literal>. Puis modifier les correctement ;
it: Se per qualsiasi motivo c'è la necessità di aggiungere file di template cancellati, si può eseguire nuovamente il comando <command>dh_make</command> nella stessa directory del sorgente del pacchetto Debian con l'opzione <literal>--addmissing</literal>. Fatto questo si potrà modificarlo di conseguenza.
ja: もし何らかの理由で消去された雛形ファイルを追加する必要がある場合には、同一の Debian ソースツリーの中で <literal>--addmissing</literal> オプションとともに <command>dh_make</command> をもう一度実行してもいいです。そして、それらを適正に編集しましょう。

source: If the package has not updated to use the <systemitem role="package">debhelper</systemitem> V7 <command>dh</command> syntax for the <filename>debian/rules</filename> file, update it to use <command>dh</command>. Update the <filename>debian/control</filename> file accordingly.
ca: Si el paquet no està actualitzat per fer servir la nova sintaxi <command>dh</command> de la versió 7 de <systemitem role="package">debhelper</systemitem> en el fitxer <filename>debian/rules</filename>, fes-ne l'actualització per fer servir <command>dh</command>. També hauràs d'actualitzar <filename>debian/control</filename>.
fr: si le paquet n'a pas été mis à jour pour utiliser la syntaxe <command>dh</command> de <systemitem role="package">debhelper</systemitem> V7 dans le fichier <filename>debian/rules</filename>, mettez-le à jour pour utiliser <command>dh</command>. Mettez à jour le fichier <filename>debian/control</filename> en conséquence ;
it: Se il pacchetto non è stato aggiornato per utilizzare la sintassi V7 di <command>dh</command> del pacchetto <systemitem role="package">debhelper</systemitem> per il file <filename>debian/rules</filename>, si deve effettuare una aggiornamento per poter usare <command>dh</command>. Si aggiorni di conseguenza anche il file <filename>debian/control</filename>.
ja: <filename>debian/rules</filename> ファイルに関して <systemitem role="package">debhelper</systemitem> V7 <command>dh</command> シンタックスへとパッケージが更新されていない場合は <command>dh</command> を使うように更新しましょう。<filename>debian/control</filename> ファイルもそれに合わせて変更しましょう。

source: In the <systemitem role="package">cdbs</systemitem> (0.4.74) package, there are some negative descriptions of the <filename>rules</filename> file created by the <command>dh_make</command> command for the non-<systemitem role="package">cdbs</systemitem> choices. Do not worry about it. It applies only for <literal>lenny</literal> which created explicit targets with long list of <command>dh_*</command> commands.
ca: En el paquet <systemitem role="package">cdbs</systemitem> (versió 0.4.74), hi ha alguns comentaris negatius sobre el fitxer <filename>rules</filename> construït amb l'ordre <command>dh_make</command> en fer servir sistemes distints a <systemitem role="package">cdbs</systemitem>. No en facis cas, només afecten a la versió <literal>lenny</literal>: llavors es generaven objectius amb una llarga llista d'ordres <command>dh_*</command>.
es: En el paquete <systemitem role="package">cdbs</systemitem> (versión 0.4.74), hay algunos comentarios negativos sobre el archivo <filename>rules</filename> construido por la orden <command>dh_make</command> al utilizar sistemas distintos a <systemitem role="package">cdbs</systemitem>. No te preocupes. Esto solo afecta a la versión en <literal>lenny</literal>: entonces se generaban objetivos con una larga lista de órdenes <command>dh_*</command>.
fr: Dans le paquet <systemitem role="package">cdbs</systemitem> (0.4.74), vous trouverez certaines descriptions négatives du fichier <filename>rules</filename> créé par la commande <command>dh_make</command> pour les choix non <systemitem role="package">cdbs</systemitem>. Ne vous en inquiétez pas. C'est uniquement relatif à la version de <literal>Lenny</literal> qui créait des cibles explicites et une longue liste de commandes <command>dh_*</command>.
ja: <systemitem role="package">cdbs</systemitem> (0.4.74) パッケージ中に、 <systemitem role="package">cdbs</systemitem>以外の選択をした際の <command>dh_make</command> コマンドにより生成される <filename>rules</filename> ファイルに関する否定的記述があります。心配無用です。それは <command>dh_*</command> コマンドの長いリストを明示的ターゲットとして生成した <literal>lenny</literal> にのみ当てはまります。

source: If you want to update the <filename>rules</filename> file created with the <filename>Makefile</filename> inclusion mechanism of the Common Debian Build System (<systemitem role="package">cdbs</systemitem>) to the <command>dh</command> syntax, see <filename>/usr/share/doc/cdbs/cdbs-doc.html</filename> and understand its <literal>DEB_*</literal> configuration variables. <placeholder type="footnote" id="0"/>
es: Si vas ha actualizar el archivo <filename>rules</filename> construido por el mecanismo de inclusión <filename>Makefile</filename> del sistema de compilación Debian (<systemitem role="package">cdbs</systemitem>) a la nueva sintaxis <command>dh</command>, lee <filename>/usr/share/doc/cdbs/cdbs-doc.html</filename> y aprende las variables de configuración <literal>DEB_*</literal> <placeholder type="footnote" id="0"/>.
fr: si vous voulez mettre à jour le fichier <filename>rules</filename> créé avec le mécanisme d'héritage <filename>Makefile</filename> du système de compilation usuel Debian (<systemitem role="package">cdbs</systemitem>) vers la syntaxe <command>dh</command>, voyez <filename>/usr/share/doc/cdbs/cdbs-doc.html</filename> et comprenez ses variables de configuration <literal>DEB_*</literal> ; <placeholder type="footnote" id="0"/>

source: If you have a <literal>1.0</literal> source package without the <filename><replaceable>foo</replaceable>.diff.gz</filename> file, you can update it to the newer <literal>3.0 (native)</literal> source format by creating <filename>debian/source/format</filename> with <literal>3.0 (native)</literal>. The rest of <filename>debian/*</filename> files can be just copied.
ca: Si treballes amb un paquet construït amb el format <literal>1.0</literal> sense l'arxiu <filename><replaceable>nom_paquet</replaceable>.diff.gz</filename>, pots actualitzar-lo a la nova versió <literal>3.0 (native)</literal> afegint el fitxer <filename>debian/source/format</filename> amb la línia <literal>3.0 (native)</literal>. Copia els altres fitxers del directori <filename>debian/*</filename>.
es: Si estás trabajando con un paquete construido con el formato <literal>1.0</literal> sin el archivo <filename><replaceable>nombre_del_paquete</replaceable>.diff.gz</filename>, puedes actualizarlo a la nueva versión <literal>3.0 (native)</literal> añadiendo el archivo <filename>debian/source/format</filename> con la linea <literal>3.0 (native)</literal>. Copia los otros archivos del directorio <filename>debian/*</filename>.
fr: si vous avez un paquet source <literal>1.0</literal> sans fichier <filename><replaceable>toto</replaceable>.diff.gz</filename>, vous pouvez le mettre à jour au récent format source <literal>3.0 (native)</literal> en créant <filename>debian/source/format</filename> contenant « <literal>3.0 (native)</literal> ». Le reste des fichiers <filename>debian/*</filename> peut être simplement copié ;
it: Se si ha un pacchetto sorgente nella versione <literal>1.0</literal> senza il file <filename><replaceable>foo</replaceable>.diff.gz</filename>, si può aggiornare al nuovo formato sorgente <literal>3.0 (native)</literal> creando il file <filename>debian/source/format</filename> con <literal>3.0 (native)</literal>. Gli altri file <filename>debian/*</filename> possono essere semplicemente copiati.
ja: <filename><replaceable>foo</replaceable>.diff.gz</filename> ファイル無しの <literal>1.0</literal> ソースパッケージの場合、<literal>3.0 (native)</literal> と言う内容の <filename>debian/source/format</filename> を作成することで新規の <literal>3.0 (native)</literal> ソースフォーマットに更新できます。残りの <filename>debian/*</filename> ファイルは単にコピーするだけです。

source: You may split <filename>big.diff</filename> into many small incremental patches using the <command>splitdiff</command> command.
ca: Pots fragmentar el fitxer <filename>nom_paquet.diff</filename> en diversos fitxers de pegats fent servir l'ordre <command>splitdiff</command>.
es: Puedes fragmentar el archivo <filename>nombre_del_paquete.diff</filename> en varios archivos de parches utilizando la orden <command>splitdiff</command>.
fr: vous pouvez découper <filename>gros.diff</filename> en plusieurs petits correctifs incrémentaux avec la commande <command>splitdiff</command>.
it: E' possibile dividere il file <filename>big.diff</filename> in tanti piccole patch incrementali utilizzando il comando <command>splitdiff</command>.
ja: <command>splitdiff</command> コマンドを用いると <filename>big.diff</filename> は多くの小さな増分パッチに分割できます。

source: If you have a <literal>1.0</literal> source package with the <filename><replaceable>foo</replaceable>.diff.gz</filename> file, you can update it to the newer <literal>3.0 (quilt)</literal> source format by creating <filename>debian/source/format</filename> with <literal>3.0 (quilt)</literal>. The rest of <filename>debian/*</filename> files can be just copied. Import the <filename>big.diff</filename> file generated by the <literal>filterdiff -z -x '*/debian/*' <replaceable>foo</replaceable>.diff.gz &gt; big.diff</literal> command to your <command>quilt</command> system, if needed. <placeholder type="footnote" id="0"/>
ca: Si treballes amb un paquet construït amb el format <literal>1.0</literal> amb el fitxer <filename><replaceable>nom_paquet</replaceable>.diff.gz</filename>, pots actualitzar-lo al nou format <literal>3.0 (native)</literal> afegint el fitxer <filename>debian/source/format</filename> amb la línia <literal>3.0 (native)</literal>. Copia els altres fitxers del directori <filename>debian/*</filename>. Importa el fitxer <filename>nom_paquet.diff</filename> generat amb l'ordre <literal>filterdiff -z -x '*/debian/*' <replaceable>nom_paquet</replaceable>.diff.gz &gt; nom_paquet.diff</literal> al sistema <command>quilt</command> <placeholder type="footnote" id="0"/>.
es: Si estás trabajando con un paquete construido con el formato <literal>1.0</literal> con el archivo <filename><replaceable>nombre_del_paquete</replaceable>.diff.gz</filename>, puedes actualizarlo a la nueva versión <literal>3.0 (native)</literal> añadiendo el archivo <filename>debian/source/format</filename> con la linea <literal>3.0 (native)</literal>. Copia los otros archivos del directorio <filename>debian/*</filename>. Importa el archivo <filename>nombre_del_paquete.diff</filename> generado por la orden <literal>filterdiff -z -x '*/debian/*' <replaceable>nombre_del_paquete</replaceable>.diff.gz &gt; nombre_del_paquete.diff</literal> al sistema <command>quilt</command> <placeholder type="footnote" id="0"/>.
fr: si vous avez un paquet source <literal>1.0</literal> avec fichier <filename><replaceable>toto</replaceable>.diff.gz</filename>, vous pouvez le mettre à jour au récent format source <literal>3.0 (quilt)</literal> en créant <filename>debian/source/format</filename> contenant « <literal>3.0 (quilt)</literal> ». Le reste des fichiers <filename>debian/*</filename> peut être simplement copié. Importez le fichier <filename>gros.diff</filename> généré par la commande « <literal>filterdiff -z -x '*/debian/*' <replaceable>toto</replaceable>.diff.gz &gt; gros.diff</literal> » dans votre système <command>quilt</command>, au besoin ; <placeholder type="footnote" id="0"/>
it: Se si ha un pacchetto sorgente nella versione <literal>1.0</literal> con il file <filename><replaceable>foo</replaceable>.diff.gz</filename>, si può aggiornare al nuovo formato sorgente <literal>3.0 (quilt)</literal> creando il file <filename>debian/source/format</filename> con <literal>3.0 (quilt)</literal>. Gli altri file <filename>debian/*</filename> possono essere semplicemente copiati. Se necessario, si importi il file <filename>big.diff</filename> generato dal comando <literal>filterdiff -z -x '*/debian/*' <replaceable>foo</replaceable>.diff.gz &gt; big.diff</literal> nel sistema <command>quilt</command>.<placeholder type="footnote" id="0"/>
ja: <filename><replaceable>foo</replaceable>.diff.gz</filename> ファイルありの <literal>1.0</literal> ソースパッケージの場合、<literal>3.0 (quilt)</literal> と言う内容の <filename>debian/source/format</filename> を作成することで新規の <literal>3.0 (quilt)</literal> ソースフォーマットに更新できます。残りの <filename>debian/*</filename> ファイルは単にコピーするだけです。必要な場合、<literal>filterdiff -z -x '*/debian/*' <replaceable>foo</replaceable>.diff.gz &gt; big.diff</literal> コマンドにより生成される <filename>big.diff</filename> ファイルをあなたの <command>quilt</command> システムにインポートします。<placeholder type="footnote" id="0"/>

source: If it was packaged with another patch system such as <systemitem role="package">dpatch</systemitem>, <systemitem role="package">dbs</systemitem>, or <systemitem role="package">cdbs</systemitem> with <literal>-p0</literal>, <literal>-p1</literal>, or <literal>-p2</literal>, convert it to the <systemitem role="package">quilt</systemitem> command using <filename>deb3</filename> at <ulink url="&deb3;">&deb3;</ulink>.
fr: si l'empaquetage a été créé avec un autre système de correctif comme <systemitem role="package">dpatch</systemitem>, <systemitem role="package">dbs</systemitem> ou <systemitem role="package">cdbs</systemitem> avec <literal>-p0</literal>, <literal>-p1</literal> ou <literal>-p2</literal>, convertissez-le à la commande <systemitem role="package">quilt</systemitem> avec <filename>deb3</filename> disponible en <ulink url="&deb3;">&deb3;</ulink> ;

source: If it was packaged with the <command>dh</command> command with the <literal>--with quilt</literal> option or with the <command>dh_quilt_patch</command> and <command>dh_quilt_unpatch</command> commands, remove such things and make it use the newer <literal>3.0 (native)</literal> source format.
ca: Si el paquet s'ha construït executant l'ordre <command>dh</command> amb l'opció <literal>--with quilt</literal> o amb <command>dh_quilt_patch</command> i <command>dh_quilt_unpatch</command>, elimina tot això i fes servir el format <literal>3.0 (native)</literal>.
es: Si el paquete se ha construido con ejecutando la orden <command>dh</command> con la opción <literal>--with quilt</literal> o bien con <command>dh_quilt_patch</command> y <command>dh_quilt_unpatch</command>, elimina todo esto y utiliza el formato <literal>3.0 (native)</literal>.
fr: si l'empaquetage a été créé avec la commande <command>dh</command> et le paramètre « <literal>--with quilt</literal> » ou les commandes <command>dh_quilt_patch</command> et <command>dh_quilt_unpatch</command>, enlevez ces choses et utilisez le nouveau format source <literal>3.0 (native)</literal>.
it: Se il pacchetto è stato creato con il comando <command>dh</command> con l'opzione <literal>--with quilt</literal> o con i comandi <command>dh_quilt_patch</command> e <command>dh_quilt_unpatch</command>, si rimuovano i file prodotti e li si sostituisca usando il nuovo formato dei sorgenti <literal>3.0 (native)</literal>.
ja: もし <literal>--with quilt</literal> オプション付きの <command>dh</command> コマンドとか、<command>dh_quilt_patch</command> と <command>dh_quilt_unpatch</command> コマンドを用いてパッケージされている場合には、これらを削除し新規の <literal>3.0 (native)</literal> ソースフォーマットを使うようにします。

source: You need to do other tasks described in <xref linkend="newupstream"/> , too.
ca: Repassa la secció <xref linkend="newupstream"/> per si has de repetir alguns dels passos indicats en aquesta secció
es: Repasa la sección <xref linkend="newupstream"/> por si debes repetir algunos de los pasos indicados en ella.
fr: D'autres tâches décrites en <xref linkend="newupstream"/> sont aussi à effectuer.

source: Reminders for updating packages
ca: Recordatori per actualitzar paquets.
es: Recordatorio para actualizar paquetes
fr: Rappels pour la mise à jour de paquets
it: Note per l'aggiornamento dei pacchetti
ja: パッケージをアップグレードする際の注意点

source: Here are few reminders for updating packages.
ca: Aquí tens un llistat de coses a tenir en compte en actualitzar paquets:
es: A continuación se listan algunas cosas a tener en cuenta al actualizar paquetes.
fr: Voici quelques rappels pour la mise à jour de paquets :
it: Vengono qui presentate alcune note per l'aggiornamento dei pacchetti.
ja: パッケージをアップグレードする際の注意点は以下です。

source: Preserve old <filename>changelog</filename> entries (sounds obvious, but there have been incidents to type <literal>dch</literal> when you should have typed <literal>dch -i</literal>.)
ca: Conserva les entrades anteriors del fitxer <filename>changelog</filename> (sona a obvietat, però s'han donat casos d'executar <literal>dch</literal> en lloc de <literal>dch -i</literal>).
es: Conserva las entradas anteriores del archivo <filename>changelog</filename> (suena a obviedad, pero se han dado casos de ejecutar <literal>dch</literal> en lugar de <literal>dch -i</literal>).
fr: préservez les anciennes entrées <filename>changelog</filename> (cela va de soit, mais il y a déjà eu des incidents du genre « <literal>dch</literal> » alors qu'il aurait fallu taper « <literal>dch -i</literal> ») ;
it: Si preservino le vecchie voci del <filename>changelog</filename> (sembra ovvio, ma a volte si sono verificati problemi per aver scritto <literal>dch</literal> mentre si sarebbe dovuto scrivere <literal>dch -i</literal>.)
ja: <filename>changelog</filename> の旧項目を保全します (自明ですが、<literal>dch -i</literal> とするべき時に <literal>dch</literal> とした過去事例があります。)

source: Existing Debian changes need to be reevaluated; throw away stuff that upstream has incorporated (in one form or another) and remember to keep stuff that hasn't been incorporated by upstream, unless there is a compelling reason not to.
ca: Reconsidera els canvis en la construcció del paquet Debian: elimina les modificacions anteriors (sigui el que sigui) i recorda't d'afegir tot el necessari, sempre que no hi hagi una bona raó per no fer-ho.
es: Los cambios en la construcción del paquete Debian deben ser reconsiderados; elimina las modificaciones anteriores (sea lo que sea) y recuerda de añadir todo lo necesario, a no ser que haya una buena razón para no hacerlo.
fr: les modifications Debian existantes doivent être réévaluées ; jetez tout ce qui a été incorporé en amont (sous une forme ou une autre), et souvenez-vous de garder ce qui ne l'a pas été, à moins qu'il n'y ait une bonne raison de ne pas le faire ;
it: Cambiamenti preesistenti devono essere ricontrollati; si scarti tutto ciò che è stato incorporato in upstream (in una forma o nell'altra) e ci si ricordi di mantenere tutto quello che non è stato incorporato dall'upstream, a meno che non ci sia una buona ragione per non farlo.
ja: 現存の Debian による変更は再評価する必要があります。(何らかの形で)アップストリームが組み込んだことは捨て、アップストリームが組み込まなかったことは残しましょう。

source: If any changes were made to the build system (hopefully you'd know from inspecting upstream changes) then update the <filename>debian/rules</filename> and <filename>debian/control</filename> build dependencies if necessary.
ca: Si s'ha realitzat alguna modificació en la compilació (ho veuràs quan inspeccionis els canvis en les fonts originals) pot ser necessari actualitzar el fitxer <filename>debian/rules</filename> i les dependències de compilació en el fitxer <filename>debian/control</filename>.
es: Si se ha realizado alguna modificación en la compilación (te enterarás al inspeccionar los cambios en las fuentes originales) puede que sea necesario actualizar el archivo <filename>debian/rules</filename> y las dependencias de compilación en el archivo <filename>debian/control</filename>.
fr: si le système de construction a été modifié (avec un peu de chance, vous êtes au courant depuis l'inspection des modifications amont), mettez à jour les dépendances de construction <filename>debian/rules</filename> et <filename>debian/control</filename>, si besoin est ;
it: Se è stato fatto qualsiasi cambiamento nel sistema di costruzione del pacchetto (sperabilmente ce se ne renderà conto controllando i cambiamenti dall'originale) allora si aggiorni il file <filename>debian/rules</filename> e le dipendenze di <filename>debian/control</filename> se necessario.
ja: ビルドシステムに変更が加えられた場合には (アップストリームの変更を精査した際に分かっているはずですよね)、 必要に応じて <filename>debian/rules</filename> と <filename>debian/control</filename> のビルド依存関係を更新します。

source: Check to see <ulink url="&bts;">Debian Bug Tracking System (BTS)</ulink> if someone have provided patches to bugs that are currently open in it.
ca: Comprova si hi ha alguna comunicació de pegats del paquet en el sistema de gestió d'errors (algun usuari pot haver construït i enviat un pegat que puguis fer servir) en <ulink url="&bts;">BTS</ulink>.
fr: vérifiez dans le <ulink url="&bts;">système de gestion de bogues (BTS)</ulink> que personne n'a fourni de correctifs aux bogues ouverts ;
it: Si controlli nel <ulink url="&bts;">Debian Bug Tracking System (BTS)</ulink> se qualcuno ha reso disponibili delle patch ai bug che sono attualmente aperti.
ja: 現存のバグへのパッチを誰かが提供していないかを、<ulink url="&bts;">Debian Bug Tracking System (BTS)</ulink>で確認します。

source: Check the contents of the <filename>.changes</filename> file to make sure you are uploading to the correct distribution, the proper bugs closures are listed in the <literal>Closes</literal> field, the <literal>Maintainer</literal> and <literal>Changed-By</literal> fields match, the file is GPG-signed, etc.
ca: Comprova el contingut del fitxer <filename>.changes</filename> per assegurar-te que envies el paquet a la distribució correcta, que els informes d'errors que es tanquen amb la nova versió estan llistats en el camp <literal>Closes</literal>, que el contingut dels camps <literal>Maintainer</literal> i <literal>Changed-By</literal> són correctes, que has signat el fitxer amb la teva clau GPG, etc.
es: Comprueba el contenido del archivo <filename>.changes</filename> para asegurarte que envías el paquete a la distribución correcta, que los informes de errores que se cierran con la nueva versión del paquete están listados en el campo <literal>Closes</literal> del archivo, que el contenido de los campos <literal>Maintainer</literal> y <literal>Changed-By</literal> son correctos, que has firmado el archivo con tu clave GPG, etc.
fr: vérifiez le contenu du fichier <filename>.changes</filename> pour vous assurer que vous envoyez vers la bonne distribution, que les rapports de bogues refermés sont correctement listés dans les champs <literal>Closes</literal>, que les champs <literal>Maintainer</literal> et <literal>Changed-By</literal> correspondent, que le fichier est signé avec GPG, etc.
it: Si controlli il contenuto del file <filename>.changes</filename> per essere sicuri che si stia caricando la distribuzione corretta, le risoluzioni ai bug vengono listate nel campo <literal>Closes</literal>, i campi <literal>Maintainer</literal> e <literal>Changed-By</literal> corrispondono, il file è firmato con GPG, ecc.
ja: 正しいディストリビューションへアップロードすること、 <literal>Closes</literal> フィールドに適切なバグのクローズがリストされていること、<literal>Maintainer</literal> と <literal>Changed-By</literal> フィールドがマッチしていること、ファイルが GPG-サインされていること等を確実にするように、<filename>.changes</filename> ファイルの内容を確認します。
