Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: If you already have the completed source packages, issue the following commands in the directory where the <filename><replaceable>foo</replaceable>.orig.tar.gz</filename>, <filename><replaceable>foo</replaceable>.debian.tar.gz</filename>, and <filename><replaceable>foo</replaceable>.dsc</filename> files exist to update the local <systemitem role="package">pbuilder</systemitem> <command>chroot</command> system and to build binary packages in it.
ca: Si treballes amb un paquet font complet, executa les següents ordres en el directori on tenguis els fitxers <filename><replaceable>nom_paquet</replaceable>.orig.tar.gz</filename>, <filename><replaceable>nom_paquet</replaceable>.debian.tar.gz</filename> i <filename><replaceable>nom_paquet</replaceable>.dsc</filename> per actualitzar el sistema local <systemitem role="package">pbuilder</systemitem> <command>chroot</command> i, a continuació, compilar el paquet binari:
es: Si ya dispones de un paquete fuente completo, ejecuta las siguientes órdenes en el directorio donde tengas los archivos <filename><replaceable>nombre_del_paquete</replaceable>.orig.tar.gz</filename>, <filename><replaceable>nombre_del_paquete</replaceable>.debian.tar.gz</filename> y <filename><replaceable>nombre_del_paquete</replaceable>.dsc</filename> para actualizar el sistema local <systemitem role="package">pbuilder</systemitem> <command>chroot</command> y, a continuación, compilar el paquete binario en él:
fr: Si vous possédez déjà les paquets sources terminés, exécutez les commandes suivantes dans le répertoire contenant les fichiers <filename><replaceable>toto</replaceable>.orig.tar.gz</filename>, <filename><replaceable>toto</replaceable>.debian.tar.gz</filename>, et <filename><replaceable>toto</replaceable>.dsc</filename> pour mettre à jour le système <command>chroot</command> de <systemitem role="package">pbuilder</systemitem> et y construire les paquets binaires :
it: Se si hanno già i pacchetti sorgenti, eseguire i seguenti comandi nella directory in cui si trovano i file <filename><replaceable>foo</replaceable>.orig.tar.gz</filename>, <filename><replaceable>foo</replaceable>.debian.tar.gz</filename>, e <filename><replaceable>foo</replaceable>.dsc</filename> per aggiornare l'ambiente <command>chroot</command> di <systemitem role="package">pbuilder</systemitem> e per costruirci dentro il pacchetto binario.
ja: 既に完全なソースパッケージがあれば、<filename><replaceable>foo</replaceable>.orig.tar.gz</filename>ファイル、 <filename><replaceable>foo</replaceable>.debian.tar.gz</filename>ファイル、<filename><replaceable>foo</replaceable>.dsc</filename>ファイルが存在するディレクトリで、ローカル<systemitem role="package">pbuilder</systemitem> <command>chroot</command>システムをアップデートし、バイナリパッケージをビルドする為に以下のコマンドを発行しましょう。

source: $ sudo pbuilder --update $ sudo pbuilder --build <replaceable>foo</replaceable>.dsc
ca: $ sudo pbuilder --update $ sudo pbuilder --build <replaceable>nom_paquet</replaceable>.dsc
es: $ sudo pbuilder --update $ sudo pbuilder --build <replaceable>nombre_del_paquete</replaceable>.dsc
fr: $ sudo pbuilder --update $ sudo pbuilder --build <replaceable>toto</replaceable>.dsc

source: $ sudo pbuilder --build --debbuildopts -sa <replaceable>foo</replaceable>.dsc
ca: $ sudo pbuilder --build --debbuildopts -sa <replaceable>nom_paquet</replaceable>.dsc
es: $ sudo pbuilder --build --debbuildopts -sa <replaceable>nombre_del_paquete</replaceable>.dsc
fr: $ sudo pbuilder --build --debbuildopts -sa <replaceable>toto</replaceable>.dsc

source: The newly built packages will be located in <filename>/var/cache/pbuilder/result/</filename> with non-root ownership.
ca: En acabar la compilació, el paquet compilat estarà en el directori <filename>/var/cache/pbuilder/result/</filename> i tu en seràs el propietari.
es: Una vez finalizada la compilación, el paquete compilado estará en el directorio <filename>/var/cache/pbuilder/result/</filename> cuyo propietario será tu usuario en lugar del usuario administrador.
fr: Les paquets nouvellement créés sont accessibles en <filename>/var/cache/pbuilder/result/</filename> et n'appartiennent pas au superutilisateur.
it: Il nuovo pacchetto sarà creato nella directory <filename>/var/cache/pbuilder/result/</filename> con proprietà non assegnata all'utente root.
ja: 新しくビルドしたパッケージは非ルート所有者として<filename>/var/cache/pbuilder/result/</filename>に置かれます。

source: If you already have the updated source tree without generating the matching source packages, issue the following commands in the source directory where the <filename>debian</filename> directory exists, instead.
ca: Si en lloc d'iniciar la construcció del paquet a partir d'un paquet ja construït, disposes d'un directori amb les fonts originals actualitzades, hauràs d'executar les següents ordres des del directori de les fonts originals (on hi haurà el directori <filename>debian</filename> amb el seu contingut):
es: Si en lugar de iniciar la construcción del paquete a partir de un paquete ya construido, dispones de un directorio con las fuentes originales actualizadas, deberás ejecutar las siguientes órdenes desde el directorio de las fuentes originales (y en el que deberá estar presente el directorio <filename>debian</filename> con todo su contenido):
fr: Si vous possédez déjà l'arborescence des sources à jour, sans avoir créé les paquets sources correspondants, exécutez plutôt les commandes suivantes dans le répertoire des sources avec le répertoire <filename>debian</filename> :
it: Se si ha già l'albero dei sorgenti aggiornato, senza generare i rispettivi pacchetti sorgenti, eseguire i seguenti comandi nella directory dei sorgenti in cui si trova il file <filename>debian</filename>.
ja: 更新されたソースツリーが既にあり、一致するソースパッケージを生成していない場合は、代わりに、<filename>debian</filename> ディレクトリが存在するディレクトリで、以下のコマンドを発行します。

source: You can log into its <command>chroot</command> environment with the <literal>pbuilder --login --save-after-login</literal> command and configure it as you wish. This environment can be saved by leaving its shell prompt with <literal>^D</literal> (Control-D).
ca: Pots «connectar-te» a l'entorn <command>chroot</command> executant l'ordre <literal>pbuilder --login --save-after-login</literal> i configurar-lo per adaptar-lo a les teves necessitats. Aquest entorn pot desar-se sortint del «shell» amb <literal>^D</literal> (Control-D).
es: Puedes «conectarte» al entorno <command>chroot</command> ejecutando la orden <literal>pbuilder --login --save-after-login</literal> y configurarlo para adaptarlo a tus necesidades. Este entorno puede guardarse saliendo del «shell» con <literal>^D</literal> (Control-D).
fr: Vous pouvez vous connecter à l'environnement <command>chroot</command> avec la commande « <literal>pbuilder --login --save-after-login</literal> » et le configurer à votre convenance. Cet environnement peut être sauvegardé en quittant l'invite de commande avec <literal>^D</literal> (Contrôle-D).
it: È possibile accedere all'ambiente <command>chroot</command> con il comando <literal>pbuilder --login --save-after-login</literal> e configurarlo come si vuole. Questo ambiente può essere salvato, semplicemente uscendo dalla shell con <literal>^D</literal> (Control-D).
ja: <literal>pbuilder --login --save-after-login</literal>コマンドで、<command>chroot</command>環境にログインし、好きに設定することができます。シェルプロンプトから<literal>^D</literal> (Control-D)で抜けると、その環境を保存しておくことができます。

source: #!/bin/sh set -e install_packages() { apt-get -y --force-yes install $@ } install_packages lintian echo +++ lintian output +++ su -c lintian -i -I --show-overrides /tmp/buildd/*.changes - pbuilder # use this version if you don't want lintian to fail the build #su -c lintian -i -I --show-overrides /tmp/buildd/*.changes; : - pbuilder echo +++ end of lintian output +++
ca: #!/bin/sh set -e install_packages() { apt-get -y --force-yes install $@ } install_packages lintian echo +++ informe de lintian +++ su -c lintian -i -I --show-overrides /tmp/buildd/*.changes - pbuilder # si vols evitar que lintian aturi la construcció fes servir el següent #su -c lintian -i -I --show-overrides /tmp/buildd/*.changes; : - pbuilder echo +++ final de l'informe de lintian +++«
es: #!/bin/sh set -e install_packages() { apt-get -y --force-yes install $@ } install_packages lintian echo +++ informe de lintian +++ su -c lintian -i -I --show-overrides /tmp/buildd/*.changes - pbuilder # si quieres evitar que lintian pare la construcción utiliza lo siguiente #su -c lintian -i -I --show-overrides /tmp/buildd/*.changes; : - pbuilder echo +++ final del informe de lintian +++
fr: #!/bin/sh set -e install_packages() { apt-get -y --force-yes install $@ } install_packages lintian echo +++ début de lintian +++ su -c lintian -i -I --show-overrides /tmp/buildd/*.changes - pbuilder # utilisez ceci si vous ne voulez pas que lintian arrête la construction #su -c lintian -i -I --show-overrides /tmp/buildd/*.changes; : - pbuilder echo +++ fin de lintian +++

source: You need to have access to the latest <literal>sid</literal> environment to build packages properly for <literal>sid</literal>. In reality, <literal>sid</literal> may be experiencing issues which makes it not desirable for you to migrate your whole system. The <systemitem role="package">pbuilder</systemitem> package can help you to cope with this kind of situation.
ca: Has de tenir un entorn <literal>sid</literal> actualitzat per construir correctament paquets per a <literal>sid</literal>. En realitat, la versió <literal>sid</literal> pot tenir errades que no fan recomanable la migració del teu sistema en aquesta versió. El paquet <systemitem role="package">pbuilder</systemitem> t'ajuda a fer front en aquesta situació.
es: Debes tener un entorno <literal>sid</literal> actualizado para construir correctamente paquetes para <literal>sid</literal>. En realidad, al versión <literal>sid</literal> puede contener errores que no hacen recomendable la migración de tu sistema a esta versión. El paquete <systemitem role="package">pbuilder</systemitem> te ayuda a hacer frente a esta situación.
fr: Un environnement <literal>sid</literal> à jour est nécessaire pour construire correctement les paquets destinés à <literal>sid</literal>. En fait, <literal>sid</literal> peut parfois être victime de problèmes qui peuvent rendre non souhaitable la migration de votre système complet. Le paquet <systemitem role="package">pbuilder</systemitem> peut vous aider à faire face à ce genre de situation.
it: E' necessario avere accesso all'ultima versione di <literal>sid</literal> per poter costruire correttamente i pacchetti per <literal>sid</literal>. In realtà <literal>sid</literal> potrebbe avere dei problemi che rendono poco consigliabile migrare l'intero sistema. In questo caso il pacchetto <systemitem role="package">pbuilder</systemitem> può essere molto di aiuto.
ja: <literal>sid</literal>環境向けのパッケージを正しくビルドするには最新の<literal>sid</literal>環境が必要です。<literal>sid</literal>には環境を移行するには望ましくない問題を抱えていることが少なくありません。<systemitem role="package">pbuilder</systemitem>パッケージはそのような状況に対処できるようになっています。

source: There are some restrictions for such updates of your <literal>stable</literal> package.
ca: Hi ha restriccions per a aquestes actualitzacions del teu paquet per a la versió <literal>stable</literal>.
es: Hay algunas restricciones para estas actualizaciones de tu paquete <literal>stable</literal>.
fr: Il existe des restrictions pour de telles mises à jour de paquet <literal>stable</literal>.
it: Ci sono alcune restrizioni per tali aggiornamenti del pacchetto <literal>stable</literal>.
ja: <literal>stable</literal> パッケージのそのようなアップデートには制限が課せられます。

source: You may need to update your <literal>stable</literal> packages after their release for <literal>stable-proposed-updates</literal>, <literal>stable/updates</literal>, etc. <placeholder type="footnote" id="0"/> For such occasions, I am running <literal>sid</literal> system is not good enough excuse not to update them promptly. The <systemitem role="package">pbuilder</systemitem> package can help you to access environments of almost any Debian derivative distributions of the same CPU architecture.
ca: És possible que hagis d'actualitzar el paquet per a la versió <literal>stable</literal> després de distribuir-lo per a <literal>stable-proposed-updates</literal>, <literal>stable/updates</literal>, etc <placeholder type="footnote" id="0"/>. En algunes ocasions, «Jo treballo amb la versió <literal>sid</literal>» pot no ésser una excusa per deixar d'actualitzar el paquet. El paquet <systemitem role="package">pbuilder</systemitem> t'ajuda a treballar en entorns per a totes les distribucions derivades Debian en una arquitectura determinada.
es: Es posible que debas actualizar tu paquete <literal>stable</literal> después de distribuirlo para <literal>stable-proposed-updates</literal>, <literal>stable/updates</literal>, etc <placeholder type="footnote" id="0"/>. En algunas ocasiones, «Yo trabajo con la versión <literal>sid</literal>» puede no ser una excusa para dejar de actualizar el paquete. El paquete <systemitem role="package">pbuilder</systemitem> te ayuda trabajar en entornos para todas las distribuciones derivadas Debian para una arquitectura determinada.
fr: Vous pouvez avoir besoin de mettre à jour vos paquets <literal>stable</literal> après sa publication à destination de <literal>stable-proposed-updates</literal>, <literal>stable/updates</literal>, etc. <placeholder type="footnote" id="0"/> Dans ces cas-là, « j'utilise <literal>sid</literal> » est une mauvaise excuse pour ne pas les mettre à jour au plus tôt. Le paquet <systemitem role="package">pbuilder</systemitem> vous permet d'accéder à la plupart des distributions dérivées de Debian pour la même architecture de microprocesseur.
it: Potrebbe essere necessario aggiornare i pacchetti <literal>stable</literal> dopo il loro rilascio per <literal>stable-proposed-updates</literal>, <literal>stable/updates</literal>, ecc. <placeholder type="footnote" id="0"/> Per questa ragione sto utilizzando un sistema <literal>sid</literal> non èè una buona scusa per non aggiornarli tempestivamente. Il pacchetto <systemitem role="package">pbuilder</systemitem> aiuta ad accedere agli ambienti di quasi tutte le distribuzioni derivate da Debian con la stessa architettura di CPU.
ja: <literal>stable/updates</literal>や<literal>stable-proposed-updates</literal>がリリースされた後、<literal>stable</literal>パッケージのアップデートが必要な場合があります。<placeholder type="footnote" id="0"/>そのような場合に、 即座にアップデートしない言い訳として<literal>sid</literal> を使っているから というのは不十分です。<systemitem role="package">pbuilder</systemitem>パッケージは、同じCPUアーキテクチャのほぼ全てのDebian派生であるディストリビューションへのアクセスを手助けします。

source: See <ulink url="&pbuilder;">&pbuilder;</ulink>, <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>pbuilderrc</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>, and <citerefentry> <refentrytitle>pbuilder</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>.
fr: Voir <ulink url="&pbuilder;">&pbuilder;</ulink>, <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>pbuilderrc</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>, et <citerefentry> <refentrytitle>pbuilder</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> .

source: If your upstream uses the source code management system (<ulink url="&debref-vcs;">VCS</ulink>) to maintain their code, you should consider to use them. That makes merging and cherry-picking upstream patches much easier. There are several specialized wrapper script packages for the Debian package building for each VCS.
fr: Si les développeurs amont utilisent un système de gestion de version (<ulink url="http://www.debian.org/doc/manuals/debian-reference/ch10.fr.html#_version_control_systems">VCS</ulink>) pour maintenir leur code source, vous devriez envisager de l'utiliser. Cela rend la fusion et la sélection (« cherry-picking ») des correctifs amont plus facile. De nombreux paquets de scripts d'enrobage sont disponibles pour la construction de paquets Debian pour chaque système de gestion de version :

source: <systemitem role="package">git-buildpackage</systemitem>: Suite to help with Debian packages in Git repositories.
ca: <systemitem role="package">git-buildpackage</systemitem>: conjunt per a la compilació de paquets en repositoris «Git».
es: <systemitem role="package">git-buildpackage</systemitem>: conjunto para la compilación de paquetes en repositorios «Git».
fr: <systemitem role="package">git-buildpackage</systemitem> : assistants pour les paquets Debian en dépôts Git ;
ja: <systemitem role="package">git-buildpackage</systemitem>: Gitリポジトリ内でのDebianパッケージを支援するパッケージソフトです。

source: <systemitem role="package">topgit</systemitem>: a Git patch queue manager
es: <systemitem role="package">topgit</systemitem>: para gestionar las pilas de parches en «Git».
fr: <systemitem role="package">topgit</systemitem> : gestionnaire de file de correctifs Git ;

source: <systemitem role="package">svn-buildpackage</systemitem>: helper programs to maintain Debian packages with Subversion.
ca: <systemitem role="package">svn-buildpackage</systemitem>: programes d'ajuda per al manteniment de paquets Debian amb «Subversion».
es: <systemitem role="package">svn-buildpackage</systemitem>: programas de ayuda para el mantenimiento de paquetes Debian con «Subversion».
fr: <systemitem role="package">svn-buildpackage</systemitem> : assistants pour la maintenance de paquets Debian en dépôt Subversion ;
it: <systemitem role="package">svn-buildpackage</systemitem>: programmi di supporto per mantenere i pacchetti Debian con Subversion.
ja: <systemitem role="package">svn-buildpackage</systemitem>:DebianパッケージSubversionで管理するための支援プログラムです。

source: <systemitem role="package">cvs-buildpackage</systemitem>: A set of Debian package scripts for CVS source trees.
ca: <systemitem role="package">cvs-buildpackage</systemitem>: conjunt de paquets de guions Debian per a estructures de directoris CVS.
es: <systemitem role="package">cvs-buildpackage</systemitem>: conjunto de paquete de guiones Debian para estructuras de directorios CVS.
fr: <systemitem role="package">cvs-buildpackage</systemitem> : scripts pour paquets Debian en dépôt CVS.
it: <systemitem role="package">cvs-buildpackage</systemitem>: una serie di script per i pacchetti Debian per gli alberi di sorgenti sotto CVS.
ja: <systemitem role="package">cvs-buildpackage</systemitem>: CVSソースツリーのためのスクリプト群をDebianパッケージにしたものです。

source: Here are few web resources available for advanced audiences.
fr: Voici quelques ressources disponibles sur la toile pour les utilisateurs avancés :
it: Ecco alcune risorse web, per gli utenti esperti.
ja: 上級者のみなさんのためになるウェブ上で閲覧できる資料です。

source: Building Debian Packages with git-buildpackage at <filename>/usr/share/doc/git-buildpackage/manual-html/gbp.html</filename>
fr: « Construction de paquets Debian avec git-buildpackage » en <filename>/usr/share/doc/git-buildpackage/manual-html/gbp.html</filename> ;

source: <ulink url="&debian-packages-git;">debian packages in git</ulink>
fr: « <ulink url="&debian-packages-git;">paquets Debian avec Git</ulink> » ;

source: <ulink url="&git-debian-packaging;">Using Git for Debian Packaging</ulink>
fr: « <ulink url="&git-debian-packaging;">Utilisation de Git pour l'empaquetage Debian</ulink> » ;

source: <ulink url="http://git.debian.org/?p=collab-maint/topgit.git;a=blob_plain;f=debian/HOWTO-tg2quilt;hb=HEAD">Using TopGit to generate quilt series for Debian packaging</ulink>
fr: « <ulink url="http://git.debian.org/?p=collab-maint/topgit.git;a=blob_plain;f=debian/HOWTO-tg2quilt;hb=HEAD">Utilisation de TopGit pour créer un ensemble quilt pour l'empaquetage Debian</ulink> » ;

source: <ulink url="&git-dpm;">git-dpm: Debian packages in Git manager</ulink>
fr: « <ulink url="&git-dpm;">git-dpm : paquets Debian en gestionnaire Git</ulink> »

source: These packages offer more elegant working environment than manual use of the <command>quilt</command> commands for advanced audiences to <emphasis>automate</emphasis> building of packages. I will not explain them in this tutorial. <placeholder type="footnote" id="0"/>
fr: Ces paquets permettent la mise en place d'un environnement de développement plus agréable que l'utilisation manuelle des commandes <command>quilt</command> pour les utilisateurs avancés afin d'<emphasis>automatiser</emphasis> la construction de paquets. Ils ne seront pas détaillés dans ce tutoriel. <placeholder type="footnote" id="0"/>

source: Quick rebuild
ca: Reconstrucció ràpida.
es: Reconstrucción rápida
fr: Reconstruction rapide
it: Ricostruzione veloce
ja: 部分的な再構築

source: Environment variables which are normally configured to proper values are not set by this method. Never create real packages to be uploaded using this <emphasis role="strong">quick</emphasis> method.
es: Las variables de entorno que normalmente están configuradas con los valores adecuados, no se configuran con este método. Nunca cree paquetes reales para enviarlos utilizando este método <emphasis role="strong">rápido</emphasis>.
fr: Les variables d'environnement qui devraient normalement être configurées correctement à cette étape ne sont pas configurées par cette méthode. Ne créez jamais de vrai paquets pour l'envoi avec cette méthode <emphasis role="strong">rapide</emphasis>.
it: Le variabili d'ambiente, che sono normalmente impostate con dei valori corretti, non sono utilizzati in questa modalità. Mai creare dei pacchetti, che poi andranno caricati, utilizzando il metodo <emphasis role="strong">veloce</emphasis>.
ja: その場合は、通常だと正しく設定される環境変数は設定されません。アップロード用のパッケージはこの<emphasis role="strong">簡易</emphasis>メソッドで生成しないでください。

source: With a large package, you may not want to rebuild from scratch every time while you tune details in <filename>debian/rules</filename>. For testing purposes, you can make a <filename>.deb</filename> file without rebuilding the upstream sources like this <placeholder type="footnote" id="0"/>:
es: Con un paquete grande, puede que no quieras recompilar desde cero cada vez que tocas un detalle en el fichero <filename>debian/rules</filename>. Para propósitos de prueba, puedes hacer un fichero <filename>.deb</filename> sin necesidad de recompilar las fuentes originales de esta forma<placeholder type="footnote" id="0"/>:
fr: Avec un paquet imposant, vous ne voudrez sans doute pas reconstruire depuis le début chaque fois que vous faites une petite modification à <filename>debian/rules</filename>. Pour tester, vous pouvez faire un fichier <filename>.deb</filename> sans reconstruire les sources amont comme ceci <placeholder type="footnote" id="0"/> :
it: Con un pacchetto di grandi dimensioni, si potrebbe non voler ricostruire tutto da zero, ogni volte che si modifica un dettaglio in <filename>debian/rules</filename>. Per effettuare delle prove, si può creare un file <filename>.deb</filename>, senza ricompilare i sorgenti originali, come segue: <placeholder type="footnote" id="0"/>:
ja: 大規模なパッケージの場合には、<filename>debian/rules</filename>をちょっといじるたびに、毎回最初からパッケージの再構築をやりなおすのは手間です。テスト目的であれば、以下の方法で上流（upstream）ソースを再構築をせずに<filename>.deb</filename> ファイルを生成することができます。 <placeholder type="footnote" id="0"/>:

source: Or, simply as following to see if it build or not.
ca: O simplement pots comprovar si el paquet se compila amb:
es: O simplemente puedes comprobar si el paquete se compila con:
fr: Ou, simplement comme ceci pour voir s'il y a construction ou non :
it: Oppure, semplicemente controllando se costruirlo o no. Come:
ja: また、以下の方法を使えば生成可能かどうかをチェックすることができます。
