Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: See <ulink url="&pbuilder-home;">&pbuilder-home;</ulink>, <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>pbuilderrc</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>, and <citerefentry> <refentrytitle>pbuilder</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>.
es: Consulta <ulink url="&pbuilder-home;">&pbuilder-home;</ulink>, <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>pbuilderrc</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>, y <citerefentry> <refentrytitle>pbuilder</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>.

source: <command>git-buildpackage</command> command and similars
ca: L'ordre <command>git-buildpackage</command> i semblants.
es: La orden <command>git-buildpackage</command> y similares
it: Il comando <command>git-buildpackage</command> ed altri simili
ja: <command>git-buildpackage</command>コマンドとその仲間

source: If your upstream uses the source code management system (<ulink url="http://www.debian.org/doc/manuals/debian-reference/ch10.en.html#_version_control_systems">VCS</ulink>) to maintain their code, you should consider to use them. That makes merging and cherry-picking upstream patches much easier. There are several specialized wrapper script packages for the Debian package building for each VCS.
es: Si el autor original utiliza un sistema de gestión de versiones para el código (<ulink url="http://www.debian.org/doc/manuals/debian-reference/ch10.en.html#_version_control_systems">VCS</ulink>) puedes considerar utilizarlo. Así se facilita la coordinación y la selección de los parches en las fuentes. Debian dispone de varios paquetes de guiones especializados en cada tipos de VCS:

source: $ sudo dpkg -r gentoo $ sudo dpkg -P gentoo $ sudo dpkg -i gentoo_<replaceable>version</replaceable>-<replaceable>revision</replaceable>_<replaceable>i386</replaceable>.deb
ca: $ sudo dpkg -r gentoo $ sudo dpkg -P gentoo $ sudo dpkg -i gentoo_<replaceable>versió</replaceable>-<replaceable>revisió</replaceable>_<replaceable>i386</replaceable>.deb
es: $ sudo dpkg -r gentoo $ sudo dpkg -P gentoo $ sudo dpkg -i gentoo_<replaceable>versión</replaceable>-<replaceable>revisión</replaceable>_<replaceable>i386</replaceable>.deb

source: <systemitem role="package">lintian</systemitem> package
ca: El paquet <systemitem role="package">lintian</systemitem>.
es: El paquete <systemitem role="package">lintian</systemitem>
it: Il pacchetto <systemitem role="package">lintian</systemitem>
ja: <systemitem role="package">lintian</systemitem> パッケージ

source: <command>debc</command> command
ca: L'ordre <command>debc</command>.
es: La orden <command>debc</command>
it: Il comando <command>debc</command>
ja: <command>debc</command> コマンド

source: <command>debdiff</command> command
ca: L'ordre <command>debdiff</command>.
es: La orden <command>debdiff</command>
it: Il comando <command>debdiff</command>
ja: <command>debdiff</command> コマンド

source: <command>interdiff</command> command
ca: L'ordre <command>interdiff</command>.
es: La orden <command>interdiff</command>
it: Il comando <command>interdiff</command>
ja: <command>interdiff</command> コマンド

source: <command>mc</command> command
ca: L'ordre <command>mc</command>.
es: La orden <command>mc</command>
it: Il comando <command>mc</command>
ja: <command>mc</command> コマンド

source: Now that you have tested your new package thoroughly, you will be technically ready to start the Debian new maintainer application process, as described at <ulink url="http://www.debian.org/devel/join/newmaint">http://www.debian.org/devel/join/newmaint</ulink>
es: Ahora que has probado tu nuevo paquete en profundidad, estarás preparado para comenzar el proceso de nuevo desarrollador de Debian tal y como se describe en: <ulink url="http://www.debian.org/devel/join/newmaint">http://www.debian.org/devel/join/newmaint</ulink>

source: See <ulink url="http://mentors.debian.net/cgi-bin/welcome">mentors.debian.net</ulink> for publically accessible upload area for non-DD.
es: Lee <ulink url="http://mentors.debian.net/cgi-bin/welcome">mentors.debian.net</ulink> para saber cómo enviar tu paquete en el caso que no seas Desarrollador de Debian (DD).

source: See <ulink url="http://www.debian.org/doc/manuals/debian-reference/ch02.en.html#_small_public_package_archive">Debian Reference, 2.7.12. 'Small public package archive'</ulink> for an example for creating a small public package archive compatible with the modern secure APT system.
es: Lee <ulink url="http://www.debian.org/doc/manuals/debian-reference/ch02.en.html#_small_public_package_archive">Debian Reference, 2.7.12. 'Pequeño repositorio público de paquetes'</ulink> para saber cómo construir un repositorio personal público compatible con el moderno y seguro sistema APT.

source: Include a short description of the bug and the solution in the changelog entry, followed by <literal>Closes: #54321</literal>. That way, the bug report will be <emphasis>automagically</emphasis> closed by the archive maintenance software the moment your package gets accepted in the Debian archive.
ca: Incloure la descripció (breu) de l'error i la solució, seguida de la referència de la notificació de l'error amb <literal>(Closes: #54321)</literal>. D'aquesta manera, l'informe d'error es «tancarà» <emphasis>automàticament</emphasis> pel sistema de manteniment del repositori de Debian quan el paquet sigui acceptat en el repositori.
es: Incluye la descripción (breve) del error y la solución, seguida de la referencia de la notificación del error con <literal>(Closes: #54321)</literal>. De esta manera, el informe de error sera «cerrado» <emphasis>automáticamente</emphasis> por el sistema de mantenimiento del repositorio Debian cuando el paquete sea aceptado en el repositorio.
it: Includere nella nuova voce del changelog una breve descrizione del problema e della relativa soluzione, seguita da <literal>Closes: #54321</literal>. In questo modo, il report del problema verrà <emphasis>automaticamente</emphasis> chiuso dal programma di manutenzione dell'archivio Debian nel momento stesso in cui il pacchetto viene accettato.
ja: changelog の説明行に、このリビジョンで解決されたバグと、 その解決方法についての簡単な説明を記載し、 「<literal>Closes: #54321</literal>」と続けておきます。 これによってあなたのパッケージが Debian アーカイブ中に受け入れられた時、 アーカイブ管理ソフトウェアによって該当するバグレポート (今回の場合は #54321) が<emphasis>自動的</emphasis>に閉じられます。

source: <literal>quilt push -f</literal> to apply old patches while forcing rejects as <filename><replaceable>baz</replaceable>.rej</filename>.
es: ejecuta <literal>quilt push -f</literal> para aplicar los parches de la versión anterior para forzar los rechazos (tendrás la información de los rechazos en los archivos <filename><replaceable>rechazo</replaceable>.rej</filename>).

source: If the <command>uscan</command> command downloads the updated source but it does not run the <command>uupdate</command> command, you should correct the <filename>debian/watch</filename> file to have <literal>debian uupdate</literal> at the end of the URL.
ca: Si l'ordre <command>uscan</command> descarrega les fonts però no executa l'ordre <command>uupdate</command>, cal modificar l'arxiu <filename>debian/watch</filename> afegint <literal>debian uupdate</literal> al final de l'URL del fitxer.
es: Si la orden <command>uscan</command> descargar las fuentes pero no ejecuta la orden <command>uupdate</command>, debes corregir el archivo <filename>debian/watch</filename> añadiendo <literal>debian uupdate</literal> al final de la URL del archivo.
it: Se il comando <command>uscan</command> scarica il sorgente aggiornato ma non esegue il comando <command>uupdate</command>, si può modificare il file <filename>debian/watch</filename> inserendo <literal>debian uupdate</literal> alla fine dell'URL.
ja: もし <command>uscan</command> コマンドが更新されたソースはダウンロードするが <command>uupdate</command> コマンドを実行しない場合には、URLの最後に <literal>debian uupdate</literal> となるように <filename>debian/watch</filename> ファイルを修正するべきです。

source: If you set up a <filename>debian/watch</filename> file as described in <xref linkend="watch"/> , you can skip the <command>wget</command> command. You simply run <citerefentry> <refentrytitle>uscan</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> in the <filename><replaceable>foo</replaceable>-<replaceable>oldversion</replaceable></filename> directory instead of the <command>uupdate</command> command. This will <emphasis>automagically</emphasis> look for the updated source, download it, and run the <command>uupdate</command> command. <placeholder type="footnote" id="0"/>
ca: Si has configurat el fitxer <filename>debian/watch</filename> com s'ha explicat a <xref linkend="watch"/> , no és necessari que executis l'ordre <command>wget</command>. Simplement, executa <citerefentry> <refentrytitle>uscan</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> en el directori <filename><replaceable>nom_paquet</replaceable>-<replaceable>número_versió_anterior</replaceable></filename> en lloc de l'ordre <command>uupdate</command>. Així, es buscarà <emphasis>automàticament</emphasis> el fitxer de les fonts, se descarregarà en el teu ordinador i s'executarà l'ordre <command>uupdate</command> <placeholder type="footnote" id="0"/>.
es: Si has configurado el archivo «<filename>debian/watch</filename>» como se ha descrito en <xref linkend="watch"/> , puedes saltarte la orden <command>wget</command>. Simplemente, ejecuta <citerefentry> <refentrytitle>uscan</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> en el directorio <filename><replaceable>nombre_del_paquete</replaceable>-<replaceable>antigua_versión</replaceable></filename> en lugar de la orden <command>uupdate</command>. Así, se buscará <emphasis>automáticamente</emphasis> el archivo de las fuentes, se descargará en tu ordenador y se ejecutará la orden <command>uupdate</command> <placeholder type="footnote" id="0"/>.

source: If it was packaged with another patch system such as <systemitem role="package">dpatch</systemitem>, <systemitem role="package">dbs</systemitem>, or <systemitem role="package">cdbs</systemitem> with <literal>-p0</literal>, <literal>-p1</literal>, or <literal>-p2</literal>, convert it to the <systemitem role="package">quilt</systemitem> command using <filename>deb3</filename> at <ulink url="http://bugs.debian.org/581186">http://bugs.debian.org/581186</ulink>.
es: Si el paquete se ha construido con sistema de parches distinto como <systemitem role="package">dpatch</systemitem>, <systemitem role="package">dbs</systemitem> o <systemitem role="package">cdbs</systemitem> utilizando las opciones <literal>-p0</literal>, <literal>-p1</literal> o <literal>-p2</literal>, puedes convertirlo al formato <systemitem role="package">quilt</systemitem> utilizando el guión <filename>deb3</filename> explicado en <ulink url="http://bugs.debian.org/581186">http://bugs.debian.org/581186</ulink>.

source: Check to see <ulink url="http://www.debian.org/Bugs/">Debian Bug Tracking System (BTS)</ulink> if someone have provided patches to bugs that are currently open in it.
es: Debes comprobar si hay alguna comunicación de parches del paquete en el sistema de gestión de errores (puede darse el caso que algún usuario envíe un parche ya construido y que te sea de utilidad) en <ulink url="http://www.debian.org/Bugs/">BTS</ulink>.

source: original contents
ja: 初期の内容

source: updated contents
ja: 更新された内容

source: version &docversion;
ja: バージョン &docversion;

source: The New-Maintainer's Debian Packaging Howto, copyright © 1997 Will Lowe.
ja: 新メンテナ向け Debian パッケージング法、copyright © 1997 Will Lowe.

source: This document tries to describe the building of a Debian package to ordinary Debian users and prospective developers. It uses fairly non-technical language, and it's well covered with working examples. There is an old Latin saying: <emphasis>Longum iter est per praecepta, breve et efficax per exempla</emphasis> (It's a long way by the rules, but short and efficient with examples).
ja: この文書では、Debian パッケージ作成をどうするかを、一般的な Debian ユーザと開発者予備軍を対象に解説しようと思います。技術用語をできるだけ避けて、実用的な例示を多用してしいます。古いラテンの諺にもあるように、<emphasis>Longum iter est per praecepta, breve et efficax per exempla</emphasis> (百聞は一見にしかず) です。

source: The document assumes you are using a <literal>&base-release;</literal> or newer system. If you need to follow this text in an older system (including an older Ubuntu system etc.), you must install backported <systemitem role="package">dpkg</systemitem> and <systemitem role="package">debhelper</systemitem> packages, at least.
ja: 文中では、<literal>&base-release;</literal> より新しいシステムを使っていると想定しています。古いシステム (古い Ubuntu システム等を含む)を使ってこの文書についていきたいのであれば、少なくともバックポートされた <systemitem role="package">dpkg</systemitem> および <systemitem role="package">debhelper</systemitem> パッケージをインストールする必要があります。

source: This document has been updated for the Debian <literal>&base-release;</literal> release. <placeholder type="footnote" id="0"/>
ja: この文書は、Debian <literal>&base-release;</literal> リリース用に更新されています。<placeholder type="footnote" id="0"/>

source: You can learn about the basic handling of a Debian system from the <ulink url="&debref;">Debian Reference</ulink>. It contains some pointers to learn about Unix programming, too.
ja: Debian システムの基本的な操作は <ulink url="&debref;">Debian Reference</ulink> から学べます。Unix プログラミングに関しても学べるいくつかのポインターも含まれています。

source: One of the things that makes Debian such a top-notch distribution is its package system. While there is a vast quantity of software already in the Debian format, sometimes you need to install software that isn't. You may be wondering how you can make your own packages; and perhaps you think it is a very difficult task. Well, if you are a real novice on Linux, it is hard, but if you were a rookie, you wouldn't be reading this document now&nbsp;:-) You do need to know a little about Unix programming but you certainly don't need to be a wizard. <placeholder type="footnote" id="0"/>
ja: Debian を最高峰の Linux ディストリビューションたらしめている理由のひとつが、そのパッケージ管理システムです。すでに膨大な数のソフトウェアが Debian 形式で配布されていますが、まだパッケージ化されていないソフトウェアをインストールしなければならないことがあるでしょう。どうやったら自分でパッケージが作れるんだろうとか、それはとても難しいことなんじゃないかなどと考えたことがあるかもしれませんね。確かに、もしあなたが本当に駆け出しの Linux ユーザなら難しいでしょうが、でもそうだったら今ごろこんな文書読んでませんよね&nbsp;:-) パッケージを作成するには、Unix のプログラミングについて少々知っている必要がありますが、神様みたいに精通している必要は全くありません。 <placeholder type="footnote" id="0"/>

source: One thing is certain, though: to properly create and maintain Debian packages takes many hours. Make no mistake, for our system to work the maintainers need to be both technically competent and diligent.
ja: ただ、確かなことがひとつあります。Debian パッケージをきちんと作成し保守していくには手間を惜しんではならない、ということです。間違えないでください。Debian のシステムをうまく動かしていくためには、メンテナは技術的に有能であるだけでなく、勤勉であることも必要なのです。

source: This document will explain every little (at first maybe irrelevant) step, and help you create that first package, and to gain some experience in building the next releases of that and maybe other packages later on.
ja: この文書では (最初は関係無さそうに思えることまで) どんな細かい手順も余さず説明し、最初のパッケージを作ることを援助し、。ともかく一つ作ってしまえば、あとは次のリリース、そして他のパッケージへと経験を積んでいけばよいのです。

source: If you need some help on packaging, please read <xref linkend="helpme"/>.
ja: パッケージ作成において手助けが必要なら、<xref linkend="helpme"/> を読んでください。

source: Newer versions of this document should always be available online at <ulink url="&maint-guide;"/> and in the <systemitem role="package">maint-guide</systemitem> package. The translations may be available in packages such as <systemitem role="package">maint-guide-es</systemitem>. Please note that this documentation may be slightly outdated.
ja: この文書の最新版は常に以下の場所からネットワーク経由で入手できます。<ulink url="&maint-guide;"/> また、<systemitem role="package">maint-guide</systemitem>パッケージにも含まれています。日本語訳は<systemitem role="package">maint-guide-ja</systemitem>パッケージに含まれています。本文書の内容が少々古くなっているかもしれない事に注意して下さい。

source: Social dynamics of Debian
ja: Debianにおける社会ダイナミズム

source: Here are some observations of Debian's social dynamics, presented in the hope that it will prepare you for interactions with Debian.
ja: あなたがDebian と関わる際の準備となることを望み、Debianの社会ダイナミズムの観察結果を記します。

source: We all are volunteers.
ja: 我々全員はボランティアです。

source: You cannot impose on others what to do.
ja: 他人に何をするかを押し付けてはいけません。

source: You should be motivated to do things by yourself.
ja: 自分自身で行う意欲を持つべきです。

source: Friendly cooperation is the driving force.
ja: 友好的な協力が推進力です。

source: Your contribution should not overstrain others.
ja: あなたの寄与は他人にストレスを掛けすぎてはいけません。

source: Your contribution is valuable only when others appreciate it.
ja: あなたの寄与は他人に評価されて初めて価値があります。

source: Debian is not your school where you get automatic attention of teachers.
ja: Debian は教師の注意が自動的にあなたに注がれるあなたの学校ではありません。

source: You should be able to learn many things by yourself.
ja: 独力で多くのことを学べるべきです。

source: Attention from other volunteers is a very scarce resource.
ja: 他ボランティアから注意を得ることはリソースとして非常に難しいです。

source: Debian is constantly improving.
ja: Debian は常に改良されています。

source: You are expected to make high quality packages.
ja: あなたには高品質パッケージを作成することが期待されています。

source: You should adapt yourself to change.
ja: あなたは変化に自らを適合させる必要があります。

source: There are several types of people interacting around Debian with different roles.
ja: Debian 界隈では異なる役割で色々なタイプの人がが交流しています。

source: <emphasis role="strong">upstream author</emphasis>: the person who made the original program.
ja: <emphasis role="strong">upstream author (開発元の作者)</emphasis>: 元のプログラムを作った人です。

source: <emphasis role="strong">upstream maintainer</emphasis>: the person who currently maintains the program.
ja: <emphasis role="strong">upstream maintainer (開発元のメンテナ)</emphasis>: 現在プログラムをメンテナンスしている人です。

source: <emphasis role="strong">maintainer</emphasis>: the person making the Debian package of the program.
ja: <emphasis role="strong">maintainer (メンテナ)</emphasis>: プログラムの Debian パッケージを作成している人です。

source: <emphasis role="strong">sponsor</emphasis>: a person who helps maintainers to upload packages to the official Debian package archive (after checking their contents).
ja: <emphasis role="strong">sponsor (スポンサー)</emphasis>: メンテナのパッケージを、(内容をチェックした後で)公式 Debian パッケージアーカイブにアップロードするのを手伝う人です。

source: <emphasis role="strong">mentor</emphasis>: a person who helps novice maintainers with packaging etc.
ja: <emphasis role="strong">mentor (指導役)</emphasis>: 新米メンテナをパッケージを作成等で手助けする人です。

source: <emphasis role="strong">Debian Developer</emphasis> (DD): a member of the Debian project with full upload rights to the official Debian package archive.
ja: <emphasis role="strong">Debian Developer (Debian 開発者)</emphasis> (DD): 公式 Debian パッケージアーカイブへの全面的アップロード権限を持っているDebian プロジェクトのメンバーです。

source: <emphasis role="strong">Debian Maintainer</emphasis> (DM): a person with limited upload rights to the official Debian package archive.
ja: <emphasis role="strong">Debian Maintainer (Debian メンテナ)</emphasis> (DM): 公式 Debian パッケージアーカイブへの限定的アップロード権限持っている人です。

source: Please note that you cannot become an official <emphasis role="strong">Debian Developer</emphasis> (DD) overnight, because it takes more than technical skill. Please do not be discouraged by this. If it is useful to others, you can still upload your package either as a <emphasis role="strong">maintainer</emphasis> through a <emphasis role="strong">sponsor</emphasis> or as a <emphasis role="strong">Debian Maintainer</emphasis>.
ja: 技術的なスキル以外の要件があるので、一夜にして正式な <emphasis role="strong">Debian 開発者</emphasis> (DD) になることはできません。これでがっかりしないでください。それが他の人にとっても有用ならば、あなたはあなたのパッケージを<emphasis role="strong">メンテナ</emphasis>として <emphasis role="strong">スポンサー</emphasis> を通して、あるいは <emphasis role="strong">Debian メンテナ</emphasis> として、アップロードすることが可能です。

source: Please note that you do not need to create any new package to become an official Debian Developer. Contributing to the existing packages can provide a path to becoming an official Debian Developer too. There are many packages waiting for good maintainers (see <xref linkend="choose"/>).
ja: 正式な Debian 開発者になるのに新しいパッケージの作成は必須ではないことに注意してください。既存のパッケージに対して貢献していくことでも正式な Debian 開発者への道は開かれます。多くのパッケージがよいメンテナを待っています (<xref linkend="choose"/> を参照)。

source: Since we focus only on technical aspects of packaging in this document, please refer to the following to learn how Debian functions and how you can get involved.
ja: 本書ではパッケージングの技術面にのみフォーカスするので、Debian が如何にして機能し、あなたが如何にすれば関与できるのかは以下を参照下さい。

source: <ulink url="&logiciellibre;">Debian: 17 years of Free Software, "do-ocracy", and democracy</ulink> (Introductory slides)
ja: <ulink url="&logiciellibre;">Debian: フリーソフトウエアーと、"do-ocracy" (実行による支配)と、democracy (多数決による支配)の17年間</ulink> (紹介スライド、英語)

source: <ulink url="&debianorghelp;">How can you help Debian?</ulink> (official)
ja: <ulink url="&debianorghelp;">Debian に協力するには?</ulink> (正規)

source: <ulink url="&debianfaqhelp;">The Debian GNU/Linux FAQ, Chapter 13 - 'Contributing to the Debian Project'</ulink> (semi-official)
ja: <ulink url="&debianfaqhelp;">The Debian GNU/Linux FAQ, Chapter 13 - 'Contributing to the Debian Project' (準正規) </ulink>

source: <ulink url="&debianwikihelp;">Debian Wiki, HelpDebian</ulink> (supplemental)
ja: <ulink url="&debianwikihelp;">Debian Wiki, HelpDebian</ulink> (補足)

source: <ulink url="&nm-do;">Debian New Maintainer site</ulink> (official)
ja: <ulink url="&nm-do;">Debian New Maintainer サイト</ulink> (正規)

source: <ulink url="&debianmentorfaq;">Debian Mentors FAQ</ulink> (supplemental)
ja: <ulink url="&debianmentorfaq;">Debian Mentors FAQ</ulink> (補足)

source: The following packages come with the standard Debian installation, so you probably have them already (along with any additional packages they depend on). Still, you should check it with <literal>aptitude show <replaceable>package</replaceable></literal> or with <literal>dpkg -s <replaceable>package</replaceable></literal>.
ja: 以下のパッケージは Debian の標準 (standard) インストール構成に含まれており、すでに (それらが依存する他のパッケージといっしょに) システムに含まれているはずです。しかし、念のために <literal>aptitude show <replaceable>パッケージ名</replaceable></literal> もしくは <literal>dpkg -s <replaceable>package</replaceable></literal> で確認しておきましょう。

source: The most important package to install on your development system is the <systemitem role="package">build-essential</systemitem> package. Once you try to install that, it will <emphasis>pull in</emphasis> other packages required to have a basic build environment.
ja: 開発用システムにインストールする一番重要なパッケージは、<systemitem role="package">build-essential</systemitem> です。これをインストールしようとすると、基本的なビルド環境に必要な他のパッケージを <emphasis>引き込む</emphasis>でしょう。

source: For some types of packages, that is all you will require; however, there is another set of packages that while not essential for all package builds are useful to have installed or may be required by your package:
ja: パッケージの種類によっては、必要になるのはこれが全てかもしれません。ただ、すべてのパッケージ作成に必須ではないにせよ、インストールしておくと便利だったり、パッケージによっては必要になったりするパッケージ群があります：

source: <systemitem role="package">autoconf</systemitem>, <systemitem role="package">automake</systemitem>, and <systemitem role="package">autotools-dev</systemitem> - many newer programs use configure scripts and <filename>Makefile</filename> files preprocessed with the help of programs like these (see <literal>info autoconf</literal>, <literal>info automake</literal>). <systemitem role="package">autotools-dev</systemitem> keeps up-to-date versions of certain auto files and has documentation about the best way to use those files.
ja: <systemitem role="package">autoconf</systemitem> と <systemitem role="package">automake</systemitem> と <systemitem role="package">autotools-dev</systemitem> - 多くの新しいプログラムが、これらのプログラムを使って前処理される設定スクリプトや <filename>Makefile</filename> を利用しています。 (詳しくは <literal>info autoconf</literal>, <literal>info automake</literal> を参照)。 <systemitem role="package">autotools-dev</systemitem> には、特定の auto ファイルを最新版に保ち、 そのようなファイルを使う最善の方法についてのドキュメントが含まれています。
