Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: As you may have noticed, Debian archive is divided in sections: <literal>main</literal> (the free software), <literal>non-free</literal> (the not really free software) and <literal>contrib</literal> (free software that depends on non-free software). Under those, there are logical subsections that describe in short what packages are in. So we have <literal>admin</literal> for administrator-only programs, <literal>base</literal> for the basic tools, <literal>devel</literal> for programmer tools, <literal>doc</literal> for documentation, <literal>libs</literal> for libraries, <literal>mail</literal> for e-mail readers and daemons, <literal>net</literal> for network apps and daemons, <literal>x11</literal> for X11 programs that don't fit anywhere else, and many more. See the <ulink url="http://www.debian.org/doc/debian-policy/ch-archive.html#s-subsections">Debian Policy Manual, 2.4 'Sections'</ulink> and <ulink url="http://packages.debian.org/unstable/">List of sections in 'sid'</ulink> for the guidance.
es: Como puede que hayas notado, Debian está dividida en secciones: <literal>main</literal> (principal, los programas libres o de código abierto), <literal>non-free</literal> (no libre, los programas que no son libres, que son de propietario) y <literal>contrib</literal> (programas libres que dependen de programas no libre o de propietario). Bajo ellas hay subdivisiones lógicas que describen en una palabra qué paquetes hay dentro. Así que tenemos <literal>admin</literal> para programas que sólo usa un administrador,<literal>base</literal> para las herramientas básicas, <literal>devel</literal> para las herramientas de programación, <literal>doc</literal> para la documentación, <literal>libs</literal> para las bibliotecas, <literal>mail</literal> para lectores y demonios de correo-e, <literal>net</literal> para aplicaciones y demonios de red, <literal>x11</literal> para programas específicos de X11, y muchos más. Como guía véanse las <ulink url="http://www.debian.org/doc/debian-policy/ch-archive.html#s-subsections">normas de Debian, 2.4 'Secciones'</ulink> y la <ulink url="http://packages.debian.org/unstable/">lista de secciones en «sid»</ulink>.

source: Line 3 describes how important it is that the user installs this package. See the <ulink url="http://www.debian.org/doc/debian-policy/ch-archive.html#s-priorities">Debian Policy Manual, 2.5 'Priorities'</ulink> for the guidance.
es: La línea 3 describe cómo de importante es para el usuario la instalación de este paquete. Podrás consultar en el manual de normas de Debian («Debian Policy», N. del T.) en <ulink url="http://www.debian.org/doc/debian-policy/ch-archive.html#s-priorities">Manual de normas de Debian, 2.5 'Prioridad'</ulink> la guía de los valores que deberían tener estos campos.

source: The 5th line includes the list of packages required to build your package as the <literal>Build-Depends</literal> field. You can also have the <literal>Build-Depends-Indep</literal> field as an additional line, here. (see the <ulink url="http://www.debian.org/doc/debian-policy/ch-relationships.html#s-sourcebinarydeps">Debian Policy Manual, 7.7 'Relationships between source and binary packages - Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep'</ulink>). Some packages like <systemitem role="package">gcc</systemitem> and <systemitem role="package">make</systemitem> which are required by the <systemitem role="package">build-essential</systemitem> package are implied. If you need to have other tools to build your package, you should add them to these fields. Multiple entries are separated with commas; read on for the explanation of binary dependencies to find out more about the syntax of these lines.
es: La línea 5 incluye la lista de paquetes requeridos para construir tu paquete (en el campo <literal>Build-Depends</literal>). Puedes tener una línea adicional con el campo <literal>Build-Depends-Indep</literal> (consulta <ulink url="http://www.debian.org/doc/debian-policy/ch-relationships.html#s-sourcebinarydeps">«Debian Policy Manual, 7.7 Relationships between source and binary packages - Build-Depends, Build-Depends-Indep, Build-Conflicts, Build-Conflicts-Indep»</ulink> para más información sobre este campo). Algunos paquetes como <systemitem role="package">gcc</systemitem> y <systemitem role="package">make</systemitem> están implícitos, consulta el paquete <systemitem role="package">build-essential</systemitem> para más detalles. Si se necesita algún compilador no estándar u otra herramienta para construir tu paquete, deberías añadirla en la línea «Build-Depends». Las entradas múltiples se separan con comas, lee la explicación de las dependencias binarias para averiguar más sobre la sintaxis de este campo.

source: This somewhat strange situation is a feature well documented in the <ulink url="http://www.debian.org/doc/debian-policy/footnotes.html#f48">Debian Policy Manual, Footnotes 48</ulink>. This is not due to the use of the <command>dh</command> command in the <filename>debian/rules</filename> file but due to how the <command>dpkg-buildpackage</command> works. The same situation applies to the <ulink url="https://bugs.launchpad.net/launchpad-buildd/+bug/238141">auto build system for Ubuntu</ulink>.
es: Este caso esta documentado en <ulink url="http://www.debian.org/doc/debian-policy/footnotes.html#f48">Debian Policy Manual, Footnotes 48</ulink>. Esto se debe al funcionamiento de <command>dpkg-buildpackage</command>, no al uso de la orden <command>dh</command> en el archivo <filename>debian/rules</filename>. Esto también se aplica al <ulink url="https://bugs.launchpad.net/launchpad-buildd/+bug/238141">«auto build system for Ubuntu»</ulink>.

source: Line 6 is the version of the <ulink url="http://www.debian.org/doc/devel-manuals#policy">Debian Policy Manual</ulink> standards this package follows, the one you read while making your package.
es: La línea 6 es la versión de los estándares definidos en las normas de Debian que sigue este paquete, es decir, la versión del manual de normas que has leído mientras haces tu paquete (véase <ulink url="http://www.debian.org/doc/devel-manuals#policy">«Debian Policy Manual»</ulink>.

source: Line 10 describes the CPU architecture the binary package can be compiled for. We'll leave this as <literal>any</literal> because <citerefentry> <refentrytitle>dpkg-gencontrol</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> will fill in the appropriate value for any machine this package gets compiled on.
ca: La línia 10 descriu l'arquitectura de CPU amb què el paquet pot ésser compilat. Deixarem <literal>any</literal> (qualsevol), perquè <citerefentry> <refentrytitle>dpkg-gencontrol</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> emplenarà aquest camp amb el valor corresponent a l'arquitectura quan el paquet es compili.
es: La línea 10 describe la arquitectura de CPU para la que el paquete binario puede ser compilado. Dejaremos puesto <literal>any</literal> (cualquiera), porque <citerefentry> <refentrytitle>dpkg-gencontrol</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> la rellenará con el valor apropiado cuando se compile este paquete en cualquier arquitectura para la cual pueda ser compilado.
it: Alla riga 10 viene descritta l'architettura CPU per cui può essere compilato il pacchetto binario. Si lascerà <literal>any</literal> perché <citerefentry> <refentrytitle>dpkg-gencontrol</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> riempa questo campo con un valore adeguato per ciascuna macchina in cui il pacchetto viene compilato.
ja: 10行目はバイナリパッケージをコンパイル可能なCPUアーキテクチャです。ここを<literal>any</literal>のままにしておくと、<citerefentry> <refentrytitle>dpkg-gencontrol</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>がパッケージをコンパイルしたマシンに合わせて適当に埋めてくれます。

source: This is stronger than <literal>Depends</literal>. The package will not be installed unless the packages it pre-depends on are installed and <emphasis>correctly configured</emphasis>. Use this <emphasis>very</emphasis> sparingly and only after discussing it on the <ulink url="http://lists.debian.org/debian-devel/">debian-devel@lists.debian.org</ulink> mailing list. Read: don't use it at all. :-)
es: Esto es más fuerte que <literal>Depends</literal>. El paquete no se instalará a menos que los paquetes de los que pre-dependa estén instalados y <emphasis>correctamente configurados</emphasis>. Utiliza esto <emphasis>muy</emphasis> poco y sólo después de haberlo discutido en la lista de distribución (<ulink url="http://lists.debian.org/debian-devel/">debian-devel@lists.debian.org</ulink>). En resumidas cuentas: no lo utilices en absoluto :-)

source: Line 13 is where the long description goes. This should be a paragraph which gives more details about the package. Column 1 of each line should be empty. There must be no blank lines, but you can put a single <literal>.</literal> (dot) in a column to simulate that. Also, there must be no more than one blank line after the long description.
es: La línea 13 es donde va la descripción larga del paquete. Debería ser al menos un párrafo que dé más detalles del paquete. La primera columna de cada línea debería estar vacía. No puede haber líneas en blanco, pero puede poner un <literal>.</literal> (punto) en una columna para simularlo. Tampoco debe haber más de una línea en blanco después de la descripción completa.

source: Let's insert <literal>Vcs-*</literal> fields documented in <ulink url="http://www.debian.org/doc/manuals/developers-reference/best-pkging-practices.html#bpp-vcs">Developer's Reference, 6.2.5. 'Version Control System location'</ulink> between line 6 and 7. Let's assume that the <systemitem role="package">gentoo</systemitem> package is located in Debian Alioth Git Service at <literal>git://git.debian.org/git/collab-maint/gentoo.git</literal>.
es: Vamos a poner los campos <literal>Vcs-*</literal> documentados en <ulink url="http://www.debian.org/doc/manuals/developers-reference/best-pkging-practices.html#bpp-vcs">«Developer's Reference, 6.2.5. 'Version Control System location'»</ulink> entre las lineas 6 y 7. Se supone que el paquete <systemitem role="package">gentoo</systemitem> está alojado en el servicio «Debian Alioth Git» en <literal>git://git.debian.org/git/collab-maint/gentoo.git</literal>.

source: This file contains the information about package upstream resources, copyright and license information. Its format is not dictated by the Debian Policy Manual, but the content is (<ulink url="http://www.debian.org/doc/debian-policy/ch-docs.html#s-copyrightfile">Debian Policy Manual, 12.5 'Copyright information'</ulink>). You may also consult <ulink url="http://dep.debian.net/deps/dep5/">DEP-5: Machine-parseable debian/copyright</ulink>.
es: Este fichero contiene la información sobre la licencia y copyright de las fuentes originales del paquete. El formato no está definido en las normas, pero sí en sus contenidos (<ulink url="http://www.debian.org/doc/debian-policy/ch-docs.html#s-copyrightfile">«Debian Policy Manual, 12.5 'Copyright information'»</ulink>). También puedes consultar <ulink url="http://dep.debian.net/deps/dep5/">«DEP-5: Machine-parseable debian/copyright»</ulink>.

source: Please follow the HOWTO provided by ftpmasters and sent to debian-devel-announce: <ulink url="&copyright-howto;">&copyright-howto;</ulink>.
es: Por favor, sigue el COMO redactado por «ftpmasters» y enviado a «debian-devel-announce»: <ulink url="&copyright-howto;">&copyright-howto;</ulink>.

source: Some people use invalid distribution values such as <literal>UNRELEASED</literal> to prevent a package to be accidentally uploaded when updating a package in a shared VCS.
ca: De vegades es fa servir un nom de distribució incorrecte com és ara <literal>UNRELEASED</literal> per evitar que el paquet sigui transferit al repositori accidentalment en fer una actualització quan es fa servir un sistema VCS compartit.
es: Muchas personas utilizan un nombre de distribución erróneo como <literal>UNRELEASED</literal> para prevenir que el paquete sea transferido al repositorio accidentalmente al actualizar un sistema VCS compartido.
it: Alcune persone utilizzano dei valori di distribuzione non validi come <literal>UNRELEASED</literal> per evitare che un pacchetto venga accidentalmente caricato in una VCS condivisa.
ja: 共有VSCを更新する時に、間違ってパッケージがアップロードされないように、<literal>UNRELEASED</literal>などの無効なディストリビューションの値を設定する人もいます。

source: Line 1 is the package name, version, distribution, and urgency. The name must match the source package name, distribution should be either <literal>unstable</literal> (or even <literal>experimental</literal>) <placeholder type="footnote" id="0"/>, and urgency shouldn't be changed to anything higher than <literal>low</literal>. :-)
ca: A la línia 1 hi ha el nom del paquet, versió, distribució i urgència. El nom serà el del paquet amb les fonts, la distribució hauria de ser, per ara, <literal>unstable</literal> (o fins i tot <literal>experimental</literal>) <placeholder type="footnote" id="0"/>. i la urgència no hauria de ser major a <literal>low</literal>. :-)
es: La línea 1 es el nombre del paquete, versión, distribución y urgencia. El nombre debe coincidir con el nombre del paquete fuente, la distribución debería ser, por ahora, <literal>unstable</literal> (o incluso <literal>experimental</literal>) <placeholder type="footnote" id="0"/> y la urgencia no debería cambiarse a algo mayor que <literal>low</literal>. :-)
it: La riga 1 indica il nome del pacchetto, la versione, la distribuzione e l'urgenza. Il nome deve corrispondere al nome del pacchetto sorgente, mentre la distribuzione dovrebbe essere <literal>unstable</literal> (o anche <literal>experimental</literal>) <placeholder type="footnote" id="0"/> , e l'urgenza non dovrebbe essere cambiata in qualcosa di più alto di <literal>low</literal>. :-)
ja: 1 行目はパッケージ名、バージョン、ディストリビューション、 そして緊急度 (urgency) です。ここに書くパッケージ名はソースパッケージの名前と一致していなければ なりません。 またディストリビューションは<literal>unstable</literal> (または<literal>experimental</literal>)にすべきです。 <placeholder type="footnote" id="0"/>また、緊急度は<literal>low</literal>より高くしてはいけません。:-)

source: Lines 3-5 are a log entry, where you document changes made in this package revision (not the upstream changes - there is special file for that purpose, created by the upstream authors, which you will later install as <filename>/usr/share/doc/gentoo/changelog.gz</filename>). Let's assume your ITP (Intent To Package) bug report number was <literal>12345</literal>. New lines must be inserted just before the uppermost line that begins with <literal>*</literal> (asterisk). You can do it with <citerefentry> <refentrytitle>dch</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, or manually with a text editor.
ca: Les línies 3-5 són entrades de registre, on es documenta els canvis fets en la versió/revisió actual del paquet (no els canvis fets en les fonts originals: per això els autors de les fonts fan servir un altre arxiu que s'instal·larà com <filename>/usr/share/doc/gentoo/changelog.gz</filename>). A l'exemple se suposa que el codi de l'informe d'error ITP («Intent To Package», intent d'empaquetament) és <literal>12345</literal>. Les noves línies s'afegiran a continuació de la primera començant sempre amb un <literal>*</literal> (asterisc) . Pots fer servir <citerefentry> <refentrytitle>dch</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> per afegir nova informació o un editor de text.
es: Las líneas 3 a 5 son una entrada de registro, donde se documentan los cambios hechos en esta revisión del paquete (no los cambios en las fuentes originales - hay un fichero especial para este propósito, creado por los autores originales y que instalarás luego como <filename>/usr/share/doc/gentoo/changelog.gz</filename>). En el ejemplo se supone que el código del informe de error ITP («Intent To Package», intento de empaquetar) es <literal>12345</literal>. Las nuevas líneas deben insertarse justo antes de la línea que hay más arriba que comienza por un asterisco (<literal>*</literal>). Puede hacerlo con <citerefentry> <refentrytitle>dch</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, o manualmente con cualquier editor de texto.
it: Le righe 3-5 sono una voce del registro, in cui vengono documentati i cambiamenti fatti nella revisione del pacchetto (non dei cambiamenti del pacchetto originario - c'è un file apposta per questo scopo, creato dagli autori originali, che verrà installato successivamente <filename>/usr/share/doc/gentoo/changelog.gz</filename>). Supponiamo che il numero di servizio del ticket ITP fosse <literal>12345</literal>. Nuove righe devono essere aggiunte appena prima della riga più in alto che comincia con <literal>*</literal> (asterisco). Ciò si può fare con <citerefentry> <refentrytitle>dch</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, o manualmente con un editor testuale.
ja: 3-5 行目はログエントリで、ここにリビジョンのパッケージで 行われた変更を記述します (上流プログラムそのものの変更点では ありません - その目的のためには、上流作者によって作成され、 <filename>/usr/share/doc/gentoo/changelog.gz</filename>としてインストールされる 専用のファイルが存在しています)。ITP (Intent To Package)バグレポート番号を<literal>12345</literal>と仮定しましょう。新しい行は<literal>*</literal> (アスタリスク)で始まる最初の行の直前に挿入します。この操作は<citerefentry> <refentrytitle>dch</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>を使うと便利ですが、 テキストエディタを使って実行してももちろん構いません。

source: Every <filename>rules</filename> file, as any other <filename>Makefile</filename>, consists of several targets and their rules specifying how to handle the source. <ulink url="http://www.debian.org/doc/debian-policy/ch-source.html#s-debianrules">Debian Policy Manual, 4.9 'Main building script: debian/rules'</ulink> explains its details.
es: Cada fichero <filename>rules</filename> (de reglas), como muchos otros <filename>Makefile</filename>, se compone de varias reglas que especifican cómo tratar las fuentes.<ulink url="http://www.debian.org/doc/debian-policy/ch-source.html#s-debianrules">«Debian Policy Manual, 4.9 'Main building script: debian/rules'»</ulink> explica detalladamente su función.

source: This uses the new <systemitem role="package">debhelper</systemitem> V7 features. Its design concepts are explained in <ulink url="http://joey.kitenet.net/talks/debhelper/debhelper-slides.pdf">Not Your Grandpa's Debhelper</ulink> presented at Debconf9 by the <systemitem role="package">debhelper</systemitem> upstream. Under <literal>lenny</literal>, <command>dh_make</command> created a much more complicated <filename>rules</filename> file with many <command>dh_*</command> scripts listed for each required explicit targets and frozen them to the state when it was initially packaged. This new <command>dh</command> command is simpler and frees us from this constrain. You still have full power to customize this with <literal>override_dh_*</literal> targets. See <xref linkend="customrules"/> . It is based only on the <systemitem role="package">debhelper</systemitem> package and does not obfuscate the package building process like the <systemitem role="package">cdbs</systemitem> package.
es: Aquí se utilizan las nuevas funciones de la versión 7 de <systemitem role="package">debhelper</systemitem> que se explican en <ulink url="http://joey.kitenet.net/talks/debhelper/debhelper-slides.pdf">«Not Your Grandpa's Debhelper»</ulink> presentadas en la Debconf9 por el autor de <systemitem role="package">debhelper</systemitem>. En <literal>lenny</literal>, <command>dh_make</command> construía un archivo <filename>rules</filename> más complejo con el listado de todas las órdenes <command>dh_*</command> necesarias para cada objetivo y los mantenía en el estado del empaquetado inicial. La nueva orden <command>dh</command> es simple y nos libera de esta restricción. Aún así, es posible personalizar el archivo con objetivos <literal>override_dh_*</literal>. Véase <xref linkend="customrules"/> . Se basa únicamente en el paquete <systemitem role="package">debhelper</systemitem> y no complica el proceso de construcción de paquetes como el paquete <systemitem role="package">cdbs</systemitem>.

source: For complete information on what do all these <command>dh_*</command> scripts exactly do, and what their other options are, please read their respective manual pages and the <systemitem role="package">debhelper</systemitem> documentation.
es: Para una descripción completa de la función de cada <command>dh_*</command> y de sus opciones, lee los manuales respectivos así como la documentación de <systemitem role="package">debhelper</systemitem>.
ja: <command>dh_*</command>スクリプトが、実際に何をして、どのようなオプションがあるのかを知りたい場合は、<systemitem role="package">debhelper</systemitem> のマニュアルにある該当ページを参照してください。

source: The function of <command>dh_*</command> commands are almost self-evident from their names. <placeholder type="footnote" id="0"/> There are few notable ones worth making (over)simplified explanation here assuming typical build environment based on <filename>Makefile</filename>. <placeholder type="footnote" id="1"/>
es: La función de las órdenes <command>dh_*</command> puede deducirse de su nombre <placeholder type="footnote" id="0"/>. A continuación se resume las funciones de las órdenes más importantes asumiendo que se utiliza un sistema de compilación basado en un archivo <filename>Makefile</filename> <placeholder type="footnote" id="1"/>.
ja: <command>dh_*</command>は、名前からその機能がわかるようなものばかりです。<placeholder type="footnote" id="0"/> ここでは、<filename>Makefile</filename>をもとに作られたビルド環境を前提にして、簡単な説明を行う価値があるいくつかの特筆すべき項目について述べます。<placeholder type="footnote" id="1"/>

source: The <systemitem role="package">gentoo</systemitem> package uses the GNU build system, also known as the Autotools. See <ulink url="http://en.wikipedia.org/wiki/GNU_build_system">http://en.wikipedia.org/wiki/GNU_build_system</ulink>.
es: El paquete <systemitem role="package">gentoo</systemitem> utiliza el sistema de compilación GNU, también conocido por «Autotools». Véase <ulink url="http://es.wikipedia.org/wiki/GNU_build_system">http://es.wikipedia.org/wiki/GNU_build_system</ulink>.

source: To control most of what <systemitem role="package">debhelper</systemitem> does while building the package, you put optional configuration files under the <filename>debian</filename> directory. This chapter will make an overview of what each of these does and its format. Please read <ulink url="http://www.debian.org/doc/devel-manuals#policy">Debian Policy Manual</ulink> and <ulink url="http://www.debian.org/doc/devel-manuals#devref">Debian Developer's Reference</ulink> for guidelines for the packaging.
es: Para controlar el trabajo de <systemitem role="package">debhelper</systemitem> en la compilación del paquete, puedes añadir archivos de configuración en el directorio <filename>debian</filename>. En este capítulo se resumirá lo que puede hacerse con cada uno de ellos y su formato. Por favor, lee <ulink url="http://www.debian.org/doc/devel-manuals#policy">«Debian Policy Manual»</ulink> y <ulink url="http://www.debian.org/doc/devel-manuals#devref">«Debian Developer's Reference»</ulink> para más información.

source: This usually includes HTML, PS and PDF files, shipped in <filename>/usr/share/doc/<replaceable>packagename</replaceable>/</filename>.
ca: La documentació inclourà fitxers HTML, PS i PDF ubicats en <filename>/usr/share/doc/<replaceable>nom_paquet</replaceable>/</filename>.
es: La documentación incluirá archivos HTML, PS y PDF ubicados en <filename>/usr/share/doc/<replaceable>nombre_del_paquete</replaceable>/</filename>.
it: Questa documentazione è solitamente costituita da documenti HTML, file PS e PDF, disponibili in <filename>/usr/share/doc/<replaceable>nomepacchetto</replaceable>/</filename>.
ja: これには通常、<filename>/usr/share/doc/<replaceable>packagename</replaceable>/</filename>の中に収められるようなHTML、PS、およびPDFなどの形式の付属文書が含まれます。
