Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: BUGS CONFIG-CHANGES CREDITS NEWS README README.gtkrc TODO
ca: BUGS CONFIG-CHANGES CREDITS ONEWS README README.gtkrc TODO
es: BUGS CONFIG-CHANGES CREDITS ONEWS README README.gtkrc TODO

source: If your upstream program has an init file you can either use it or not. If you don't use their init.d script then create a new one in <filename>debian/<replaceable>package</replaceable>.init</filename>. However if the upstream init script looks fine and installs in the right place you still need to setup the <filename>rc*</filename> symlinks. To do this you will need to override <command>dh_installinit</command> in the <filename>rules</filename> file with the following lines:
ca: Si el programa original inclou un arxiu «init», tu pots fer-ne ús o bé descartar-ho. Si decideixes no fer servir el guió «init.d» original, caldrà que en facis un de nou en <filename>debian/<replaceable>nom_paquet</replaceable>.init</filename>. Tot i així, si el guió original té bona pinta i s'instal·la en la ubicació correcta, encara caldrà configurar el fitxer <filename>rc*</filename> d'enllaços simbòlics. Caldrà reescriure l'objectiu <command>dh_installinit</command> de l'arxiu <filename>rules</filename> com segueix:
es: Si el programa original incluye un archivo «init», tu puedes hacer uso de él o bien descartarlo. Si optas por no hacer uso del guión «init.d» original, deberás construir uno nuevo en <filename>debian/<replaceable>nombre_del_paquete</replaceable>.init</filename>. En cualquier caso deberás construir los enlaces simbólicos <filename>rc*</filename> aunque el guión original parezca correcto y se instale en el lugar adecuado. Para ello, deberás reescribir el objetivo <command>dh_installinit</command> en el archivo <filename>rules</filename> con las siguientes líneas:

source: Manual pages are normally written in <citerefentry> <refentrytitle>nroff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. The <filename>manpage.1.ex</filename> template is written in <command>nroff</command>, too. See the <citerefentry> <refentrytitle>man</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> manual page for a brief description of how to edit such a file.
ca: Las pàgines de manual s'escriuen normalment amb <citerefentry> <refentrytitle>nroff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. L'exemple <filename>manpage.1.ex</filename> està escrit amb <command>nroff</command>. Consulta la pàgina de manual <citerefentry> <refentrytitle>man</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> on s'explica com editar el fitxer.
es: Las páginas de manual se escriben normalmente con <citerefentry> <refentrytitle>nroff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. La plantilla <filename>manpage.1.ex</filename> está escrita con<command>nroff</command>. Consulta la página de manual <citerefentry> <refentrytitle>man</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> para una breve descripción sobre como editar el archivo.
it: Le pagine del manuale sono solitamente scritte per <citerefentry> <refentrytitle>nroff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Anche il file modello <filename>manpage.1.ex</filename> è scritto per <command>nroff</command>. Si veda la pagina di manuale <citerefentry> <refentrytitle>man</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> per una breve descrizione su come modificare un file del genere.
ja: マニュアルページは通常、<citerefentry> <refentrytitle>nroff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>で書かれています。<filename>manpage.1.ex</filename>のテンプレートも<command>nroff</command>で書かれています。これらのファイルをどう編集するのかについて、簡単な説明が<citerefentry> <refentrytitle>man</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>にあります。

source: If on the other hand you prefer writing SGML instead of <command>nroff</command>, you can use the <filename>manpage.sgml.ex</filename> template. If you do this, you have to:
ca: Si prefereixes fer servir el format SGML en lloc de <command>nroff</command> pots fer servir la plantilla <filename>manpage.sgml.ex</filename>. En aquest cas hauràs de fer el següent:
es: Por otro lado, puede que prefieras escribir usando SGML en lugar de <command>nroff</command>. En este caso, puedes usar la plantilla <filename>manpage.sgml.ex</filename>. Si haces esto, tendrás que:
it: Se d'altra parte si preferisce scrivere in SGML piuttosto che utilizzare <command>nroff</command>, si può utilizzare il modello <filename>manpage.sgml.ex</filename> . Se si procede in questo modo andrà:
ja: もし、<command>nroff</command>よりSGMLのほうが好みであれば、<filename>manpage.sgml.ex</filename> のほうをひな型として使うことも できます。こちらの場合には、以下の手順が必要です。

source: rename the file to something like <filename>gentoo.sgml</filename>.
ca: reanomenar el fitxer com <filename>gentoo.sgml</filename>.
es: renombrar el fichero a algo como <filename>gentoo.sgml</filename>.
it: rinominato il file in qualcosa del tipo <filename>gentoo.sgml</filename>
ja: ファイル名を<filename>gentoo.sgml</filename>のような名前に変更します。

source: Here's the default <filename>menu.ex</filename> file that <command>dh_make</command> created:
es: Éste es el fichero <filename>menu.ex</filename> que <command>dh_make</command> construye por omisión:

source: ?package(gentoo):needs=X11|text|vc|wm \ section=Applications/see-menu-manual\ title=gentoo command=/usr/bin/gentoo
ca: ?package(gentoo):needs=X11|text|vc|wm section=Apps/llegeix-manual-menu\ title=gentoo command=/usr/bin/gentoo
es: ?package(gentoo):needs=X11|text|vc|wm section=Apps/lea-manual-menu\ title=gentoo command=/usr/bin/gentoo

source: As a novice maintainer, you should avoid any manual editing of <emphasis>maintainer scripts</emphasis> because they are problematic. For more information look in the <ulink url="http://www.debian.org/doc/debian-policy/ch-maintainerscripts.html">Debian Policy Manual, 6 'Package maintainer scripts and installation procedure'</ulink>, and take a look at these example files provided by <command>dh_make</command>.
es: Por ahora, deberías intentar evitar editar manualmente estos <emphasis>guiones del desarrollador</emphasis> si puedes porque suelen hacerse muy complejos. Para más información lee <ulink url="http://www.debian.org/doc/debian-policy/ch-maintainerscripts.html">«Debian Policy Manual, 6 'Package maintainer scripts and installation procedure'»</ulink>, y echa un vistazo a los ejemplos proporcionados por <command>dh_make</command>.

source: When the upgrade is necessarily intrusive (eg., config files scattered through various home directories with totally different structure), you may consider to set package to the safe default (e.g., disabled service) and provide proper documentations required by the policy (<filename>README.Debian</filename> and <filename>NEWS.Debian</filename>) as the last resort. Don't bother user with the <command>debconf</command> note invoked from these <emphasis>maintainer scripts</emphasis> for upgrades.
ca: Quan l'actualització és necessàriament intrusiva (p. ex. fitxers de configuració dispersos en diversos directoris amb una estructura totalment modificada), s'haurien d'establir els valors predeterminats segurs (p. ex. desactivar els serveis) i facilitar la documentació apropiada establerta en les normes (fitxers <filename>README.Debian</filename> i <filename>NEWS.Debian</filename>) com a darrer recurs. Cal evitar molestar a l'usuari amb notes <command>debconf</command> invocades pels <emphasis>guions del desenvolupador</emphasis> en les actualitzacions.
es: Cuando la actualización es necesariamente intrusiva (p.e. archivos de configuración dispersos en varios directorios con una estructura totalmente modificada), se deberían establecer los valores predeterminados seguros (p.e. desactivar los servicios) y facilitar la documentación apropiada establecida por las normas (archivos <filename>README.Debian</filename> y <filename>NEWS.Debian</filename>) como último recurso. Hay que evitar molestar al usuario con notas <command>debconf</command> invocadas por los <emphasis>guiones del desarrollador</emphasis> en las actualizaciones.
it: Quando l'aggiornamento deve per forza di cose essere invadente (per esempio, file di configurazione sparsi all'interno di diverse cartelle home con strutture totalmente differenti), si può impostare il pacchetto ai valori sicuri predefiniti (esempio, servizi disabilitati) e fornire una valida documentazione come richiesto dalla policy (<filename>README.Debian</filename> e <filename>NEWS.Debian</filename>) come ultima spiaggia. Sarebbe meglio non disturbare l'utente con la nota <command>debconf</command> richiamata da questi <emphasis>script del manutentore</emphasis> per gli aggiornamenti.
ja: アップグレードが出しゃばる必要がある場合(例えば構造が変わって、設定ファイルがあっちこちに散らばってしまった場合など)、パッケージのデフォルトを安全側に設定したり(例えばサービスを停止しておくなど)、最後の手段としてはポリシーに要求されるきちんとしたドキュメント(<filename>README.Debian</filename>と<filename>NEWS.Debian</filename>)を提供するなどの対策を考えるべきです。アップグレード際に<emphasis>maintainer scripts</emphasis>で<command>debconf</command>ノートを呼び出すような嫌がらせはやめてください。

source: The <filename>watch</filename> file format is documented in the <citerefentry> <refentrytitle>uscan</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> manpage. The <filename>watch</filename> file configures the <command>uscan</command> program (in the <systemitem role="package">devscripts</systemitem> package) to watch the site where you originally got the source from. This is also used by <ulink url="http://wiki.debian.org/DEHS">Debian External Health Status (DEHS)</ulink>.
es: El formato del archivo <filename>watch</filename> se documenta en la página de manual de <citerefentry> <refentrytitle>uscan</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. El archivo <filename>watch</filename> se usa para configurar el programa <command>uscan</command> (del paquete <systemitem role="package">devscripts</systemitem>) que vigila el servidor de donde obtuviste las fuentes originales. También lo utiliza <ulink url="http://wiki.debian.org/DEHS">«Debian External Health Status (DEHS)»</ulink>.

source: Normally with this <filename>watch</filename> file, the URL at <literal>http://sf.net/gentoo</literal> is downloaded and searched for links of the form <literal>&lt;a href=...&gt;</literal>. The base name (just the part after the final <literal>/</literal>) of these linked URLs are matched against Perl regexp (see <citerefentry> <refentrytitle>perlre</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) pattern <literal>gentoo-(.+)\.tar\.gz</literal>. Out of matched files, the file with the greatest version number is downloaded and the <command>uupdate</command> program is run to create the updated source tree from them.
es: Con el archivo <filename>watch</filename>, la URL <literal>http://sf.net/gentoo</literal> se descarga y se buscan los enlaces del tipo <literal>&lt;a href=...&gt;</literal>. El nombre base (justo la parte después del <literal>/</literal> final) de las direcciones URL enlazadas se comparan con la expresión regular de Perl (véase <citerefentry> <refentrytitle>perlre</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) con el patrón <literal>gentoo-(.*)\.tar\.gz</literal>. Se descarga el archivo de versión más reciente de entre todos los archivos encontrados cuyo nombre se ajuste al patrón, y se ejecutará el programa <command>uupdate</command> para construir el árbol de código fuente actualizado en base a este fichero.

source: Although this is true for other sites, the SourceForge download service at <ulink url="http://sf.net">http://sf.net</ulink> is an exception. When the <filename>watch</filename> file has an URL matching with the Perl regexp <literal>^http://sf\.net/</literal>, the <command>uscan</command> program substitutes it with <literal>http://qa.debian.org/watch/sf.php/</literal> and then applies this rule. The URL redirector service at this <ulink url="http://qa.debian.org/">http://qa.debian.org/</ulink> is designed to offer a stable redirect service to the desired file for the <filename>watch</filename> file having <literal>http://sf.net/<replaceable>project</replaceable>/<replaceable>tar-name</replaceable>-(.+)\.tar\.gz</literal>. This solves issues related to the periodically changing URL there.
es: Aunque es posible hacer esto con otros portales, el servicio de descarga de «SourceForge» en <ulink url="http://sf.net">http://sf.net</ulink> es una excepción. Cuando el archivo <filename>watch</filename> tiene una URL que concuerda con el patrón Perl <literal>^http://sf\.net/</literal>, el programa <command>uscan</command> lo substituye por <literal>http://qa.debian.org/watch/sf.php/</literal> y después aplica esta regla. El servicio de redireccionamiento URL a la dirección <ulink url="http://qa.debian.org/">http://qa.debian.org/</ulink> está diseñado para ofrecer un servicio estable de redireccionamiento al archivo presente en <filename>watch</filename> y que concuerda con <literal>http://sf.net/<replaceable>proyecto</replaceable>/<replaceable>nombre_archivo_tar</replaceable>-(.*)\.tar\.gz</literal>

source: See <ulink url="http://wiki.debian.org/Projects/DebSrc3.0">DebSrc3.0</ulink> for the summary information concerning the switch to the new <literal>3.0 (quilt)</literal> and <literal>3.0 (native)</literal> source formats.
es: Véase <ulink url="http://wiki.debian.org/Projects/DebSrc3.0">DebSrc3.0</ulink> para un resumen informativo sobre los formatos <literal>3.0 (quilt)</literal> y <literal>3.0 (native)</literal>.

source: If you are asking a sponsor to upload your package, this kind of clear separation and documentation of your changes are very important to expedite the package review by your sponsor.
ca: Si has demanat a un ﻿patrocinador que afegeixi el paquet al repositori Debian, aquest sistema de separació i documentació dels canvia és molt important per facilitar la revisió del paquet per part del ﻿patrocinador.
es: Si has solicitado a un patrocinador que transfiera el paquete al repositorio, este sistema de separación y documentación de los cambios es muy importante para facilitar la revisión del paquete por el patrocinador.
it: Se si sta chiedendo ad uno sponsor di caricare il proprio pacchetto, questo tipo di chiara separazione e documentazione dei cambiamenti è molto importante per per accelerare la revisione del pacchetto da parte dello sponsor.
ja: スポンサーにパッケージのアップロードを頼む時にも、あなたが加えた変更に対するこのような明確な分離とドキュメントは、スポンサーによるパッケージのレビューを促進させるためにも、非常に重要です。

source: The <command>quilt</command> command is explained in <citerefentry> <refentrytitle>quilt</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. It records modifications to the source as a stack of <literal>-p1</literal> patch files in the <filename>debian/patches</filename> directory and the source tree is untouched outside of the <filename>debian</filename> directory. The order of these patches are recorded in the <filename>debian/patches/series</filename> file. You can apply (=push), un-apply (=pop), and refresh patches easily. <placeholder type="footnote" id="0"/>
ca: El funcionament de l'ordre <command>quilt</command> s'explica en <citerefentry> <refentrytitle>quilt</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Conserva les modificacions de les fonts en una col·lecció de fitxers de pegats <literal>-p1</literal> en el directori <filename>debian/patches</filename> i les fonts originals romanen sense modificar fora del directori <filename>debian</filename>. L'ordre d'aplicació de les modificacions es conserva en el fitxer <filename>debian/patches/series</filename>. Pots executar («push»), desfer («pop») i actualitzar les modificacions fàcilment <placeholder type="footnote" id="0"/>.
es: El funcionamiento de la orden <command>quilt</command> se explica en <citerefentry> <refentrytitle>quilt</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Conserva las modificaciones de las fuentes en una colección de archivos de parches <literal>-p1</literal> en el directorio <filename>debian/patches</filename> y las fuentes originales permanecen sin modificar fuera del directorio <filename>debian</filename>. El orden de aplicación de las modificaciones se conserva en el archivo <filename>debian/patches/series</filename>. Puedes aplicar («push»), deshacer («pop») y actualizar las modificaciones fácilmente <placeholder type="footnote" id="0"/>.
it: Il comando <command>quilt</command> è documentato in <citerefentry> <refentrytitle>quilt</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Esso registra le modifiche ai sorgenti come una coda di file di patch <literal>-p1</literal> nella directory <filename>debian/patches</filename> e l'albero dei sorgenti non varia al di fuori della directory <filename>debian</filename>. L'ordine delle patch è registrato nel file <filename>debian/patches/series</filename>. Si può applicare (=push), rimuovere(=pop), ed aggiornare le patch con facilità. <placeholder type="footnote" id="0"/>
ja: <command>quilt</command>コマンドについては<citerefentry> <refentrytitle>quilt</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>で説明されています。ソースへの変更は、<filename>debian/patches</filename>ディレクトリ内<literal>-p1</literal>パッチファイルのスタックとして記録され、<filename>debian</filename>ディレクトリの外のソースツリーには触れません。それらのパッチの順番は<filename>debian/patches/series</filename>ファイルに記録されます。パッチの適用(push)も、外す(pop)のも、更新(refresh)も、簡単にできます。 <placeholder type="footnote" id="0"/>

source: As you keep working on the package, behavior will change and new features will be added. People downloading your package can look at this file and quickly see what has changed. Debian archive maintenance programs will also post the contents of this file to the <ulink url="http://lists.debian.org/debian-devel-announce/">debian-devel-announce@lists.debian.org</ulink> mailing list.
es: Mientras sigues trabajando en el paquete, éste cambiará su comportamiento y se le añadirán nuevas funciones. Las personas que descarguen tu paquete pueden leer este fichero y ver qué ha cambiado. Los programas de mantenimiento del archivo de Debian, también enviarán el contenido de este fichero a la lista de correo <ulink url="http://lists.debian.org/debian-devel-announce/">debian-devel-announce@lists.debian.org</ulink>.

source: Debian supports many <ulink url="http://www.debian.org/ports/">ports</ulink> with the <ulink url="http://www.debian.org/devel/buildd/">autobuilder network</ulink> running <command>buildd</command> daemons on many different architecture computers. Although you do not need to do this by yourself, you should be aware of what will happen on your packages. Let's look into roughly how your packages are rebuild for many different architectures by them. <placeholder type="footnote" id="0"/>
es: Debian mantiene diversas <ulink url="http://www.debian.org/ports/">adaptaciones «ports»</ulink> con la <ulink url="http://www.debian.org/devel/buildd/">red de servidores de compilación automática</ulink> que ejecuta demonios <command>buildd</command> en ordenadores con diferentes arquitecturas. Aunque no deberás hacer todo esto tú mismo, debes conocer el proceso al que se verá sometido tu paquete. Veamos cómo se procesa el paquete para compilarlo en diversas arquitecturas. <placeholder type="footnote" id="0"/>.

source: <command>debuild</command> command
ca: L'ordre <command>debuild</command>.
es: La orden <command>debuild</command>
it: Il comando <command>debuild</command>
ja: <command>debuild</command>コマンド

source: <systemitem role="package">pbuilder</systemitem> package
ca: El paquet <systemitem role="package">pbuilder</systemitem>.
es: El paquete <systemitem role="package">pbuilder</systemitem>
it: Il pacchetto <systemitem role="package">pbuilder</systemitem>
ja: <systemitem role="package">pbuilder</systemitem>パッケージ

source: For a clean room (<command>chroot</command>) build environment to verify the build dependencies, the <systemitem role="package">pbuilder</systemitem> package is very useful. <placeholder type="footnote" id="0"/> This ensures a clean build from the source under the <literal>sid</literal> auto-builder for different architectures and avoids the severity serious FTBFS (Fails To Build From Source) bug which is always in the RC (release critical) category. See <ulink url="&buildd-home;">&buildd-home;</ulink> for more on the Debian package auto-builder.
es: El paquete <systemitem role="package">pbuilder</systemitem> es muy útil para conseguir un entorno de compilación limpio (<command>chroot</command>) donde verificar las dependencias de compilación <placeholder type="footnote" id="0"/>. Esto asegura una construcción limpia desde el código en los auto-compiladores de <literal>sid</literal> para las distintas arquitecturas y evita fallos de nivel de severidad serios del tipo FTBFS («Fail to Build From Source», o «fallo al construir desde la fuente »), que son siempre de categoría RC (fallos críticos o «release critical»). Para más información del paquete Debian «auto-builder» consulte <ulink url="&buildd-home;">&buildd-home;</ulink>.

source: This assumes <literal>HOOKDIR=/var/cache/pbuilder/hooks</literal>. You can find many examples of the hook script in the <filename>/usr/share/doc/pbuilder/examples</filename> directory.
ca: Se suposa que la variable d'entorn <literal>HOOKDIR=/var/cache/pbuilder/hooks</literal> ja està configurada. Tens exemples a <filename>/usr/share/doc/pbuilder/examples</filename>.
es: Se supone que la variable de entorno <literal>HOOKDIR=/var/cache/pbuilder/hooks</literal> ya está configurada. Puedes consultar otros ejemplos en <filename>/usr/share/doc/pbuilder/examples</filename>.
it: Ciò presuppone il settaggio <literal>HOOKDIR=/var/cache/pbuilder/hooks</literal>. È possibile trovare numerosi esempi di script di hook, nella directory <filename>/usr/share/doc/pbuilder/examples</filename>.
ja: <literal>HOOKDIR=/var/cache/pbuilder/hooks</literal>に設定した場合。フックスクリプトのサンプルは<filename>/usr/share/doc/pbuilder/examples</filename> ディレクトリににあります。

source: The latest version of the <command>lintian</command> command can be executed in the <literal>chroot</literal> environment using the hook script <filename><replaceable>/var/cache/pbuilder/hooks</replaceable>/B90lintian</filename> configured as follows. <placeholder type="footnote" id="0"/>
ca: La darrera versió de l'ordre <command>lintian</command> pot executar-se automàticament en l'entorn <literal>chroot</literal> fent servir el guió «hook» disponible a <filename><replaceable>/var/cache/pbuilder/hooks</replaceable>/B90lintian</filename> i configurat de la següent manera <placeholder type="footnote" id="0"/>:
es: La última versión de la orden <command>lintian</command> puede ejecutarse automáticamente en el entorno <literal>chroot</literal> utilizando el guión «hook» disponible en <filename><replaceable>/var/cache/pbuilder/hooks</replaceable>/B90lintian</filename> y configurado como sigue <placeholder type="footnote" id="0"/>:
it: L'ultima versione del programma <command>lintian</command> può essere eseguita nell'ambiente <literal>chroot</literal>, usando gli script di hook <filename><replaceable>/var/cache/pbuilder/hooks</replaceable>/B90lintian</filename>, configurati come segue. <placeholder type="footnote" id="0"/>
ja: 最新の<command>lintian</command>コマンドは<literal>chroot</literal>環境から次のように設定されたフックスクリプト<filename><replaceable>/var/cache/pbuilder/hooks</replaceable>/B90lintian</filename>を使用して実行することができます。<placeholder type="footnote" id="0"/>
