Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: <literal>N:</literal> for note; a detailed message to help your debugging.
ca: <literal>N:</literal> nota o anotació; per a missatges detallats que poden ajudar-te en la depuració del paquet.
es: <literal>N:</literal> para las notas o anotaciones; proporciona mensajes detallados que pueden ayudarte en la depuración del paquete.
fr: <literal>N:</literal> pour note ; un message détaillé pour vous aider à déboguer ;
it: <literal>N:</literal> nota; un messaggio dettagliato per aiutare nell'analisi degli errori.
ja: <literal>N:</literal> は覚書です。 デバッグに有用な情報を詳述します。

source: <literal>O:</literal> for overridden; a message overridden by the <filename>lintian-overrides</filename> files but displayed by the <literal>--show-overrides</literal> option.
ca: <literal>O:</literal> ignorat; un missatges ignorat (segons la configuració dels fitxers <filename>lintian-overrides</filename>) però que s'emet degut a l'opció <literal>--show-overrides</literal>.
es: <literal>O:</literal> para mensajes ignorados; un mensaje ignorado (según lo configurado en los archivos <filename>lintian-overrides</filename> pero que se emite debido a la opción <literal>--show-overrides</literal>.
fr: <literal>O:</literal> pour ignoré ; un message ignoré par le fichier <filename>lintian-overrides</filename> mais affiché avec le paramètre <literal>--show-overrides</literal>.
it: <literal>O:</literal> per sovrascrivere: il messaggio verrà sovrascritto dal file <filename>lintian-overrides</filename>, ma potrà essere visualizzato con l'opzione <literal>--show-overrides</literal>.
ja: <literal>O:</literal> は上書きの通知です。 <filename>lintian-overrides</filename> ファイルによりメッセージが上書きされたメッセージです。これは <literal>--show-overrides</literal> オプションを指定した際に表示されます。

source: For warnings, tune the package to avoid them or verify that the warnings are spurious. If spurious, set the <filename>lintian-overrides</filename> files as described in <xref linkend="lintian"/> .
ca: En el cas dels errors (línies amb «E:» inicial), llegeix l'explicació (línies «N:»), fes els canvis necessaris en el paquet o comprova que són avisos falsos. En aquest cas, fes que <filename>lintian</filename> els accepti com s'ha explicat a <xref linkend="lintian"/> .
fr: Pour les avertissements, mettez au point le paquet pour les éviter ou vérifier qu'ils sont infondés. S'ils sont infondés, configurez les fichiers <filename>lintian-overrides</filename> comme décrit en <xref linkend="lintian"/> .

source: Note that you can build the package with <command>dpkg-buildpackage</command> and run <command>lintian</command> on it in one command with <citerefentry> <refentrytitle>debuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> or with <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ca: Observa que pots construir el paquet amb <command>dpkg-buildpackage</command> i executar <command>lintian</command> només amb una ordre si fas servir <citerefentry> <refentrytitle>debuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> o <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
es: Observa que puedes construir el paquete con <command>dpkg-buildpackage</command> y ejecutar <command>lintian</command> todo con sólo una orden si utilizas <citerefentry> <refentrytitle>debuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> o <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
fr: Vous pouvez reconstruire le paquet avec <command>dpkg-buildpackage</command> et lancer <command>lintian</command> en une seule commande avec <citerefentry> <refentrytitle>debuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> ou <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
it: Si noti che si può costruire il pacchetto con <command>dpkg-buildpackage</command> ed eseguire <command>lintian</command> su di esso in una sola volta con <citerefentry> <refentrytitle>debuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> o con <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ja: <command>dpkg-buildpackage</command> によるパッケージの生成と <command>lintian</command> の実行は、<citerefentry> <refentrytitle>debuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> コマンド、もしくは <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> コマンドを用いて一度に実行することができます。

source: You can list files in the binary Debian package by <citerefentry> <refentrytitle>debc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> command.
ca: Pots veure una llista dels fitxers del paquet binari Debian executant l'ordre <citerefentry> <refentrytitle>debc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> així:
es: Puedes ver la lista de archivos del paquete binario Debian ejecutando la orden <citerefentry> <refentrytitle>debc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> como sigue:
fr: La commande <citerefentry> <refentrytitle>debc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> peut énumérer les fichiers du paquet Debian binaire.
it: Si possono elencare i file nel pacchetto binario Debian con il comando <citerefentry> <refentrytitle>debc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ja: <citerefentry> <refentrytitle>debc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> コマンドを用いるとバイナリパッケージに含まれるファイルの一覧が得られます。

source: $ debc <replaceable>package</replaceable>.changes
ca: $ debc <replaceable>nom_paquet</replaceable>.changes
es: $ debc <replaceable>nombre_del_paquete</replaceable>.changes
fr: $ debc <replaceable>paquet</replaceable>.changes

source: You can compare file contents in two source Debian packages with the <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> command.
ca: Pots comparar el contingut de dos paquets de fonts Debian executant l'ordre <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> així:
es: Puedes comparar el contenido de dos paquetes de fuentes Debian ejecutando la orden <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> como sigue:
fr: La commande <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> peut comparer les contenus de fichiers entre deux paquets Debian sources.
it: Si può confrontare il contenuto dei file in due pacchetti sorgente Debian con il comando <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ja: <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> コマンドを用いると、二つのソースパッケージに含まれているファイルを比較することができます。

source: $ debdiff <replaceable>old-package</replaceable>.dsc <replaceable>new-package</replaceable>.dsc
ca: $ debdiff <replaceable>versió_anterior</replaceable>.dsc <replaceable>nova_versió</replaceable>.dsc
es: $ debdiff <replaceable>versión_anterior</replaceable>.dsc <replaceable>nueva_versión</replaceable>.dsc
fr: $ debdiff <replaceable>ancien-paquet</replaceable>.dsc <replaceable>nouveau-paquet</replaceable>.dsc

source: You can also compare file lists in two sets of binary Debian packages with the <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> command.
ca: Pots comparar la llista de fitxers de dos paquets binaris de Debian amb l'ordre <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> executant l'ordre següent:
es: Puedes comparar la lista de ficheros de dos paquetes binarios de Debian con la orden <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> ejecutando la orden como sigue:
fr: La commande <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> permet aussi de comparer les listes de fichiers entre deux ensembles de paquets Debian binaires.
it: Si possono anche confrontare le liste di file in due set di pacchetti binari Debian con il comando <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ja: <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> コマンドは二つのバイナリパッケージに含まれるファイルの一覧を比較することもできます。

source: $ debdiff <replaceable>old-package</replaceable>.changes <replaceable>new-package</replaceable>.changes
ca: $ debdiff <replaceable>versió_anterior</replaceable>.changes <replaceable>nova_versió</replaceable>.changes
es: $ debdiff <replaceable>versión_anterior</replaceable>.changes <replaceable>nueva_versión</replaceable>.changes
fr: $ debdiff <replaceable>ancien-paquet</replaceable>.changes <replaceable>nouveau-paquet</replaceable>.changes

source: These are useful to identify what has been changed in the source packages, if no files have been unintentionally misplaced or removed in the binary packages, and if no other inadvertent changes were made when updating binary packages.
ca: Aquest programa és útil per comprovar que no hi ha fitxers canviats d'ubicació o eliminats per error, i que no s'ha realitzat cap altre canvi no desitjat en l'actualització del paquet.
es: Este programa es útil para verificar que no hay ficheros que se hayan cambiado de sitio o eliminado por error, y que no se ha realizado ningún otro cambio no deseado al actualizar el paquete.
fr: Ces commandes sont utiles pour identifier ce qui a été modifié dans les paquets sources, si aucun fichier n'a été déplacé ou enlevé involontairement dans les paquets binaires, et qu'aucune autre modification n'a été faite par inadvertance lors de la mise à jour des paquets binaires.
it: Questi comandi sono utili per vedere cosa sia cambiato nei pacchetti sorgente, se alcun file sia stato spostato inavvertitamente o rimosso dai pacchetti, e se altri cambiamenti non intenzionali siano stati fatti durante l'aggiornamento dei pacchetti binari.
ja: これらのコマンドは、ソースパッケージ中でどんな変更をしたのか、バイナリパッケージの中で意図せず削除したり配置を間違えたりしていないか、そしてバイナリパッケージの更新時に不用意な変更をしていないかどうか, といった事柄を確認するのに便利です。

source: You can compare two <filename>diff.gz</filename> files with the <citerefentry> <refentrytitle>interdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> command. This is useful for verifying that no inadvertent changes were made to the source by the maintainer when updating packages in the old <literal>1.0</literal> source format.
ca: Pots comparar dos fitxers <filename>diff.gz</filename> amb l'ordre <citerefentry> <refentrytitle>interdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Això és útil per comprovar que el responsable del paquet no ha fet canvis inadvertits en l'actualització de paquets construïts amb el format <literal>1.0</literal>. Executa:
es: Puedes comparar dos ficheros <filename>diff.gz</filename> con la orden <citerefentry> <refentrytitle>interdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Esto es muy útil para verificar que no se han realizado cambios inadvertidos por el responsable del paquete al actualizar el paquetes que se han construido con el formato <literal>1.0</literal>. Ejecuta lo siguiente:
fr: Vous pouvez comparer deux fichiers <filename>diff.gz</filename> avec la commande <citerefentry> <refentrytitle>interdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. C'est utile pour vérifier qu'aucune modification involontaire n'a été effectuée sur les sources par le responsable en mettant à jour les paquets à l'ancien format source <literal>1.0</literal>.
it: Si possono confrontare due file <filename>diff.gz</filename> con il comando <citerefentry> <refentrytitle>interdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Questo è utile per verificare che il manutentore non abbia inavvertitamente fatto dei cambiamenti ai sorgenti durante il processo di aggiornamento dei pacchetti nel vecchio formato sorgente <literal>1.0</literal>.
ja: <citerefentry> <refentrytitle>interdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> コマンドを用いると、二つの <filename>.diff.gz</filename> ファイルを比較することができます。旧来の <literal>1.0</literal> ソース形式でパッケージを更新している場合には、メンテナがソースに意図しない変更をしていないことを確認するのに便利です。

source: $ interdiff -z <replaceable>old-package</replaceable>.diff.gz <replaceable>new-package</replaceable>.diff.gz
ca: $ interdiff -z <replaceable>versió_anterior</replaceable>.diff.gz <replaceable>nova_versió</replaceable>.diff.gz
es: $ interdiff -z <replaceable>versión_anterior</replaceable>.diff.gz <replaceable>nueva_versión</replaceable>.diff.gz
fr: $ interdiff -z <replaceable>ancien-paquet</replaceable>.diff.gz <replaceable>nouveau-paquet</replaceable>.diff.gz

source: Many of these file inspection operations can be made into an intuitive process by using a file manager like <citerefentry> <refentrytitle>mc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> which will let you browse not only the contents of <filename>*.deb</filename> package files but also <filename>*.udeb</filename>, <filename>*.debian.tar.gz</filename>, <filename>*.diff.gz</filename>, and <filename>*.orig.tar.gz</filename> files.
ca: Algunes de les operacions de comprovació del paquet explicades poden realitzar-se de manera molt intuïtiva si es fa servir un gestor de fitxers com <citerefentry> <refentrytitle>mc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, que permet visualitzar el contingut del paquet <filename>*.deb</filename>, i dels fitxers <filename>*.udeb</filename>, <filename>*.debian.tar.gz</filename>, <filename>*.diff.gz</filename> i <filename>*.orig.tar.gz</filename>
es: Algunas de las operaciones de comprobación del paquete descritas puede realizarse de forma muy intuitiva si empleamos un gestor de ficheros como <citerefentry> <refentrytitle>mc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, que permite visionar tanto el contenido del paquete <filename>*.deb</filename>, como el de los ficheros <filename>*.udeb</filename>, <filename>*.debian.tar.gz</filename>, <filename>*.diff.gz</filename>, <filename>*.orig.tar.gz</filename>.
fr: Toutes ces opérations d'inspection de fichier peuvent être transformées en un processus intuitif avec un gestionnaire de fichiers comme <citerefentry> <refentrytitle>mc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> qui vous permet de consulter non seulement le contenu des fichiers paquet <filename>*.deb</filename>, mais aussi les fichiers <filename>*.udeb</filename>, <filename>*.debian.tar.gz</filename>, <filename>*.diff.gz</filename> et <filename>*.orig.tar.gz</filename>.
it: Molte delle operazione di ispezione dei file possono essere rese più semplici utilizzando un gestore dei file come <citerefentry> <refentrytitle>mc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, che permette di navigare non solo il contenuto dei pacchetti in formato <filename>*.deb</filename> ma anche degli <filename>*.udeb</filename>, <filename>*.debian.tar.gz</filename>, <filename>*.diff.gz</filename>, e dei file <filename>*.orig.tar.gz</filename>.
ja: <citerefentry> <refentrytitle>mc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> の様に、<filename>*.deb</filename>パッケージファイルだけではなく、<filename>*.udev</filename>, <filename>*.debian.tar.gz</filename>, <filename>*.diff.gz</filename>, <filename>*.orig.tar.gz</filename> の中身を閲覧することができるファイルマネージャを用いると、多くのファイルの検査が直感的に行なえます。

source: Be on the lookout for extra unneeded files or zero length files, both in the binary and source package. Often cruft doesn't get cleaned up properly; adjust your <filename>rules</filename> file to compensate for that.
ca: Comprova que no hi hagi fitxers innecessaris o de tamany zero, tant en el binari com en el paquet font. De vegades , hi ha coses que no es varen netejar adequadament: caldrà ajustar el fitxer <filename>rules</filename> per arreglar això.
es: Vigila que no haya ficheros innecesarios extra o de tamaño cero, tanto en el binario como en el paquete fuente. A veces, hay cosas que no se limpiaron adecuadamente, debes ajustar tu fichero <filename>rules</filename> para arreglar esto.
fr: Soyez attentif aux fichiers inutiles ou de taille nulle, dans les paquets binaires et source. Souvent les fichiers inutiles ne sont pas nettoyés correctement ; adaptez le fichier <filename>rules</filename> pour compenser.
it: Si faccia attenzione ad ulteriori file non necessari o vuoti, sia nel pacchetto binario che in quello sorgente. Spesso non vengono ripuliti correttamente; si aggiusti il file <filename>rules</filename> per riparare a questo problema.
ja: 不要なファイルや長さゼロのファイルがバイナリパッケージとソースパッケージに含まれていないことを確認して下さい。 大抵は、これらの不要なファイルは正しく削除されずに残ってしまっています。<filename>rules</filename> を調整しこれを補正して下さい。

source: Uploading the package
ca: Enviar el paquet.
es: Enviar el paquete
fr: Envoi de paquet
it: Caricamento del pacchetto
ja: パッケージをアップロードする

source: Now that you have tested your new package thoroughly, you will be technically ready to start the Debian new maintainer application process, as described at <ulink url="&nm-join;">&nm-join;</ulink>
fr: Maintenant que votre nouveau paquet a été testé en détail, vous êtes prêt à commencer le processus d'application de nouveau responsable Debian, décrit en <ulink url="&nm-join;">&nm-join;</ulink>.

source: Uploading to the Debian archive
ca: Enviar el paquet al repositori de Debian.
es: Enviar al repositorio de Debian
fr: Envoi vers l'archive Debian
it: Caricamento nell'archivio Debian
ja: Debian アーカイブへアップロードする

source: The <systemitem role="package">dput</systemitem> package seems to come with more features and becoming more popular than the <systemitem role="package">dupload</systemitem> package. It uses the <filename>/etc/dput</filename> file for the global configuration and the <filename>~/.dput.cf</filename> file for the per-user one. It supports Ubuntu related services out-of-box, too.
ca: És possible que el paquet <systemitem role="package">dput</systemitem> ofereixi més funcionalitats i sigui més popular que <systemitem role="package">dupload</systemitem>. Fes servir l'arxiu <filename>/etc/dput</filename> per a la configuració global i el fitxer <filename>~/.dput.cf</filename> per a la configuració pròpia de l'usuari. També incorpora l'assistència per a Ubuntu.
es: Tal vez el paquete <systemitem role="package">dput</systemitem> tenga más funcionalidades y sea más popular que <systemitem role="package">dupload</systemitem> . Utiliza el archivo <filename>/etc/dput</filename> para la configuración global y el archivo <filename>~/.dput.cf</filename> para la configuración del usuario. También incorpora la asistencia para Ubuntu.
fr: Le paquet <systemitem role="package">dput</systemitem> semble fournir plus de fonctionnalités, et devient plus populaire que le paquet <systemitem role="package">dupload</systemitem>. Il utilise le fichier <filename>/etc/dput</filename> pour la configuration globale et le fichier <filename>~/.dput.cf</filename> pour la configuration par utilisateur. Il gère aussi les services relatifs à Ubuntu d'origine.
it: Il pacchetto <systemitem role="package">dput</systemitem> sembra avere più funzionalità e sta divenendo più famoso del pacchetto <systemitem role="package">dupload</systemitem>. Questo utilizza il file <filename>/etc/dput</filename> per la configurazione globale ed il file <filename>~/.dput.cf</filename> per quella dei singoli utenti. Inoltre supporta nativamente anche i servizi relativi ad Ubuntu.
ja: <systemitem role="package">dput</systemitem> パッケージは、より多くのフィーチャーがあり <systemitem role="package">dupload</systemitem> パッケージより人気が出てきています。それは、<filename>/etc/dput</filename> ファイルをグローバル設定に用い、 <filename>~/.dput.cf</filename> ファイルをユーザー毎の設定に用います。更にそれは、そのままUbuntu関連のサービスもサポートします。

source: Once you become an official developer, you'll need to upload the package to the Debian archive. You can do this manually, but it's easier to use the provided automated tools, like <citerefentry> <refentrytitle>dupload</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> or <citerefentry> <refentrytitle>dput</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. We'll describe how it's done with <command>dupload</command>. <placeholder type="footnote" id="0"/>
es: Cuando seas desarrollador oficial Debian, podrás transferir el paquete al repositorio de Debian. Puedes hacer esto manualmente, pero es más fácil hacerlo con las herramientas automáticas ya disponibles como <citerefentry> <refentrytitle>dupload</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> o <citerefentry> <refentrytitle>dput</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. A continuación describiremos cómo hacerlo con <command>dupload</command> <placeholder type="footnote" id="0"/>.
fr: Une fois devenu un développeur Debian officiel, vous devrez envoyer le paquet sur les archives Debian. Vous pouvez le faire vous-même, mais il est plus facile d'utiliser les outils automatiques disponibles, comme <citerefentry> <refentrytitle>dupload</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> ou <citerefentry> <refentrytitle>dput</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Nous décrirons la façon de faire avec <command>dupload</command>. <placeholder type="footnote" id="0"/>

source: First you have to set up <command>dupload</command>'s config file. You can either edit the system-wide <filename>/etc/dupload.conf</filename> file, or have your own <filename>~/.dupload.conf</filename> file override the few things you want to change.
fr: D'abord vous devez écrire le fichier de configuration de <command>dupload</command>. Vous pouvez soit éditer le fichier global <filename>/etc/dupload.conf</filename>, soit avoir votre propre fichier <filename>~/.dupload</filename> pour remplacer les quelques détails que vous voulez changer.
it: Innanzitutto andrà impostato il file di configurazione di <command>dupload</command>. Si può modificare il file <filename>/etc/dupload.conf</filename> per l'intero sistema, oppure far si che il file <filename>~/.dupload.conf</filename> sovrascriva le poche cose che si vogliono cambiare.
ja: まず <command>dupload</command> の設定ファイルを調整しなければいけません。 システム全体の設定ファイルである <filename>/etc/dupload.conf</filename> を編集するか、あるいはあなた専用の設定ファイルである <filename>~/.dupload.conf</filename> を使って変更したい項目だけをオーバーライドさせてもかまいません。

source: You can read the <citerefentry> <refentrytitle>dupload.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page to understand what each of these options means.
ca: Consulta el manual de <citerefentry> <refentrytitle>dupload.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> per conèixer el significat de cada opció.
es: Consulta el manual de <citerefentry> <refentrytitle>dupload.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para saber el significado de cada opción.
fr: Vous pouvez lire la page de manuel <citerefentry> <refentrytitle>dupload.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> pour comprendre ce que chacune de ces options signifie.
it: Si legga la pagina del manuale <citerefentry> <refentrytitle>dupload.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> per capire cosa significhino tutte le opzioni.
ja: またそれぞれのオプションが持つ意味を理解するため <citerefentry> <refentrytitle>dupload.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> マニュアルページを読むことができます。
