Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: Then you issue the following command in the source directory:
ca: Accedeix al directori principal del codi font del programa i executa la següent ordre:
es: Después ejecuta la siguiente orden en el directorio raíz del código fuente del programa:
fr: Ensuite, exécutez la commande suivante dans le répertoire des sources :
it: Adesso ci si sposti nella directory dei sorgenti del programma e si lancia il comando:
ja: ソースディレクトリーで以下のコマンドを実行してください:

source: This will do everything to make full binary and source packages for you. It will:
ca: Aquesta ordre farà totes les tasques necessàries per construir els paquets binaris i de fonts. Més concretament:
es: Esto hará todo lo necesario para construir los paquetes binarios y de fuentes para ti. Para ello:
fr: Ceci fera tout le nécessaire pour créer entièrement les paquets binaires et source à votre place :
it: Questo comando creerà i pacchetti binari e sorgenti al posto vostro. Eseguirà le seguenti operazioni:
ja: このコマンドはバイナリパッケージとソースパッケージを構築する作業をすべて行ってくれます。これには以下の作業が含まれます。

source: clean the source tree (<literal>debian/rules clean</literal>)
ca: neteja l'arbre del codi (<literal>debian/rules clean</literal>).
es: limpia el árbol del código fuente («<literal>debian/rules clean</literal>»)
fr: nettoyage de l'arbre des sources (« <literal>debian/rules clean</literal> ») ;
it: pulirà l'albero dei sorgenti (<literal>debian/rules clean</literal>)
ja: ソースツリーの掃除 (<literal>debian/rules clean</literal>)

source: build the source package (<literal>dpkg-source -b</literal>)
ca: construeix el paquet de codi font (<literal>dpkg-source -b</literal>).
es: construye el paquete de código («<literal>dpkg-source -b</literal>»)
fr: construction du paquet source (« <literal>dpkg-source -b</literal> ») ;
it: costruirà il pacchetto sorgente (<literal>dpkg-source -b</literal>)
ja: ソースパッケージの構築 (<literal>dpkg-source -b</literal>)

source: build the program (<literal>debian/rules build</literal>)
ca: compila el programa (<literal>debian/rules build</literal>).
es: construye el programa («<literal>debian/rules build</literal>»)
fr: construction du programme (« <literal>debian/rules build</literal> ») ;
it: costruirà il programma (<literal>debian/rules build</literal>)
ja: プログラムの構築 (<literal>debian/rules build</literal>)

source: build binary packages (<literal>fakeroot debian/rules binary</literal>)
ca: construeix el paquet binari (<literal>fakeroot debian/rules binary</literal>)
es: construye el paquete binario (<literal>fakeroot debian/rules binary</literal>)
fr: construction des paquets binaires (« <literal>fakeroot debian/rules binary</literal> ») ;
it: costruirà il pacchetto binario (<literal>fakeroot debian/rules binary</literal>)
ja: バイナリパッケージの構築 (<literal>fakeroot debian/rules binary</literal>)

source: sign the source <filename>.dsc</filename> file, using <command>gpg</command>
fr: signature du fichier source <filename>.dsc</filename>, en utilisant <command>gpg</command> ;
it: firmerà il file sorgente <filename>.dsc</filename> file, usando <command>gpg</command>
ja: <command>gpg</command> を使用したソース<filename>.dsc</filename>ファイルへの署名

source: create and sign the upload <filename>.changes</filename> file, using <command>dpkg-genchanges</command> and <command>gpg</command>
fr: création et signature du fichier de téléchargement <filename>.changes</filename>, en utilisant <command>dpkg-genchanges</command> et <command>gpg</command>.
it: creerà e firmerà il file di upload <filename>.changes</filename> file, usando <command>dpkg-genchanges</command> e <command>gpg</command>
ja: <command>dpkg-genchanges</command>および<command>gpg</command>を使用したアップロード用<filename>.changes</filename>ファイルの生成と署名

source: The only input that will be required of you is your GPG secret pass phrase, twice.
es: Lo único que se te pedirá es que escribas tu contraseña secreta de la clave GPG, dos veces.
fr: Seul votre mot de passe GPG vous sera demandé, deux fois.

source: After all this is done, you will see the following files in the directory above (<filename>~/gentoo</filename>):
ca: Quan acabi el procés, veuràs els següents fitxers en el directori superior al directori de treball (<filename>~/gentoo/</filename>):
es: Después de hacer todo esto, verás los siguientes archivos en el directorio superior al directorio de trabajo (<filename>~/gentoo/</filename>):
fr: Une fois terminé, les fichiers suivants seront dans le répertoire parent (<filename>~/gentoo/</filename>) :
it: Fatto ciò, si vedranno quattro nuovi file nella directory dei sorgenti (<filename>~/gentoo</filename>):
ja: 一連の作業が終わった後、上記ディレクトリ(<filename>~/gentoo</filename>)には以下のファイルが生成されているはずです。

source: This is the original source code tarball, merely renamed to the above so that it adheres to the Debian standard. Note that this was created initially by the <literal>dh_make -f ../gentoo-0.9.12.tar.gz</literal>.
ca: És el codi font original comprimit, simplement s'ha canviat el nom per ajustar-ho als estandards Debian. El fitxer s'ha construït executant l'ordre <literal>dh_make -f ../gentoo-0.9.12.tar.gz</literal> a l'inici.
es: Este es el código fuente original comprimido, simplemente se ha renombrado para seguir los estándares de Debian. Nótese que fue generado usando la opción «-f» de <literal>dh_make -f ../gentoo-0.9.12.tar.gz</literal> ejecutada en el inicio.
fr: C'est le code source d'origine, simplement renommé pour être conforme aux normes Debian. Il a été créé au début avec « <literal>dh_make -f ../gentoo-0.9.12.tar.gz</literal> ».
it: Questo è il codice sorgente originale, semplicemente rinominato in modo da aderire allo standard Debian. Da notare che questo è stato creato inizialmente con <literal>dh_make -f ../gentoo-0.9.12.tar.gz</literal>.
ja: これは単に Debian 標準に合わせるために名前を変更しただけで、 中身はオリジナルなソースコードの tar アーカイブです。これはもともと、<literal>dh_make -f ../gentoo-0.9.12.tar.gz</literal>で作成されたということを覚えておいてください。

source: This is a summary of the contents of the source code. The file is generated from your <filename>control</filename> file, and is used when unpacking the source with <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. This file is GPG signed, so that people can be sure that it's really yours.
ca: Aquest és un sumari dels continguts del codi font. Aquest arxiu es genera amb la informació del fitxer <filename>control</filename> i es fa servir quan es descomprimeixen les fonts amb <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Aquest arxiu està signat amb GPG i així és possible comprovar qui és l'autor.
es: Este es un sumario de los contenidos del código fuente. Este fichero se genera a partir del fichero de <filename>control</filename> y se usa cuando se descomprimen las fuentes con <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Este fichero está firmado con GPG de forma que cualquiera pueda estar seguro de que es realmente tuyo.
fr: C'est un résumé du contenu du code source. Il est créé à partir du fichier <filename>control</filename>, et est utilisé pour décompresser les sources avec <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. C'est un fichier signé avec GPG, de sorte que les gens peuvent être sûrs qu'il s'agit bien du vôtre.
it: Questo è un sommario del contenuto del codice sorgente. Questo file è generato dal file <filename>control</filename>, ed è usato quando si decomprime il sorgente con <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Questo file è firmato con GPG, in modo da confermare l'autenticità dell'autore del pacchetto.
ja: これはソースコードの内容の概要です。このファイルは あなたの<filename>control</filename>ファイルから生成され、<citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>によって ソースを展開する時に使われます。また、GPG で署名されているので、本当にあなた自身が作成したものかどうかを利用者が検証できます。

source: This compressed tarball contains your <filename>debian</filename> directory contents. Each and every addition you made to the original source code are stored as <command>quilt</command> patches in <filename>debian/patches</filename>.
ca: Aquest arxiu comprimit té tots els fitxers del directori <filename>debian</filename>. Les modificacions de les fonts originals es conserven en els fitxers de pegats <command>quilt</command> en el directori <filename>debian/patches</filename>.
es: Este fichero comprimido contiene el directorio <filename>debian</filename> completo. Todas las modificaciones de las fuentes originales se conservan en los archivos de parches <command>quilt</command> en el directorio <filename>debian/patches</filename>.
fr: Cette archive compressée contient le répertoire <filename>debian</filename>. Tous les ajouts et modifications au code source d'origine sont conservés en tant que correctifs <command>quilt</command> dans <filename>debian/patches</filename>.
it: Questo file compresso contiene il contenuto della directory <filename>debian</filename>. Ogni modifica effettuata al codice sorgente originale, verrà memorizzata come patch di <command>quilt</command> in <filename>debian/patches</filename>.
ja: この圧縮されたターボールには、あなたの<filename>debian</filename>ディレクトリーの中身が含まれています。オリジナルのソースコードに行った変更や追加などの情報は全て<filename>debian/patches</filename>内に、<command>quilt</command>パッチとして保存されます。

source: You can avoid applying <command>quilt</command> patches in the <literal>3.0 (quilt)</literal> source format at the end of the extraction with the <literal>--skip-patches</literal> option. Alternatively, you can run <literal>quilt pop -a</literal> after normal operation.
es: Puedes evitar la aplicación automática de las modificaciones por <command>quilt</command> en los paquetes con formato <literal>3.0 (quilt)</literal> al final de la extracción con la opción <literal>--skip-patches</literal>. También puedes deshacer las modificaciones al finalizar la extracción con la ejecución de <literal>quilt pop -a</literal>.
fr: Il est possible de ne pas appliquer les correctifs <command>quilt</command> du format source <literal>3.0 (quilt)</literal> à la fin de l'extraction avec l'option <literal>--skip-patches</literal>. Sinon, il est aussi possible d'exécuter « <literal>quilt pop -a</literal> » après l'extraction normale.

source: If someone else wants to re-create your package from scratch, they can easily do so using the above three files. The extraction procedure is trivial: just copy the three files somewhere else and run <literal>dpkg-source -x gentoo_0.9.12-1.dsc</literal>. <placeholder type="footnote" id="0"/>
ca: Si una altra persona vol tornar a construir el paquet des de l'inici, pot fer-ho fàcilment fent servir aquests tres fitxers. El procés d'extracció és trivial: només cal copiar-los en un directori i executar <literal>dpkg-source -x gentoo_0.9.12-1.dsc</literal> <placeholder type="footnote" id="0"/>.
es: Si alguien quiere volver a construir tu paquete desde cero, puede hacerlo fácilmente usando los tres ficheros de arriba. El proceso de extracción es trivial: sólo se debe copiar los tres ficheros en algún lado y ejecutar <literal>dpkg-source -x gentoo_0.9.12-1.dsc</literal> <placeholder type="footnote" id="0"/>.
fr: Si quelqu'un d'autre veut recréer le paquet depuis le début, il peut facilement le faire en utilisant ces trois fichiers. La procédure d'extraction est facile : copier simplement ces trois fichiers quelque part et exécuter « <literal>dpkg-source -x gentoo_0.9.12-1.dsc</literal> ». <placeholder type="footnote" id="0"/>
it: Se qualcun altro volesse ri-creare il pacchetto da zero, potrebbe farlo facilmente usando i suddetti tre file. La procedura di estrazione è banale: basta copiare i tre file da qualche parte ed eseguire <literal>dpkg-source -x gentoo_0.9.12-1.dsc</literal>. <placeholder type="footnote" id="0"/>
ja: 上記３つのファイルを使えば誰でも簡単にあなたのパッケージをスクラッチから構築することができます。３つのファイルを任意の場所にコピーし、<literal>dpkg-source -x gentoo_0.9.12-1.dsc</literal>を実行するだけです。<placeholder type="footnote" id="0"/>

source: This is your completed binary package. You can use <command>dpkg</command> to install and remove this just like any other package.
ca: Aquest és el paquet binari Debian. Pots fer servir <command>dpkg</command> per instal·lar o eliminar aquest paquet o qualsevol altre.
es: Este es el paquete binario completo. Puedes usar <command>dpkg</command> para instalar o eliminar tanto este paquete como cualquier otro.
fr: C'est le paquet binaire terminé. Vous pouvez utiliser <command>dpkg</command> pour l'installer ou le retirer comme n'importe quel autre paquet.
it: Questo è il pacchetto binario completo. Si può usare <command>dpkg</command> per installarlo e rimuoverlo, come per ogni altro pacchetto.
ja: これは、あなたが生成した完全なバイナリパッケージです。他の全てのパッケージと同じく、<command>dpkg</command>を使ってインストールしたり削除したりできます。

source: This file describes all the changes made in the current package revision, and it is used by the Debian FTP archive maintenance programs to install the binary and source packages in it. It is partly generated from the <filename>changelog</filename> file and the <filename>.dsc</filename> file. This file is GPG signed, so that people can be sure that it's really yours.
ca: Aquest arxiu conté la descripció dels canvis fets en la revisió actual del paquet, i el fan servir els programes de gestió FTP del repositori Debian per instal·lar-hi els paquets binaris i de fonts. Se genera parcialment amb l'arxiu <filename>changelog</filename> i el fitxer <filename>.dsc</filename>. Aquest arxiu està signat amb GPG, per assegurar-ne l'autoria.
es: Este fichero describe todos los cambios hechos en la revisión actual del paquete, y lo utilizan los programas de mantenimiento del archivo FTP de Debian para instalar los paquetes binarios y fuentes en él. Se genera parcialmente a partir del fichero <filename>changelog</filename> y el fichero <filename>.dsc</filename>. Este fichero está firmado con GPG, de forma que cualquiera puede estar aún más seguro de que es realmente tuyo.
fr: Ce fichier contient toutes les modifications effectuées dans la révision actuelle du paquet, et est utilisé par les programmes de maintenance des archives FTP Debian pour y installer les paquets binaires et sources. Il est partiellement créé à partir des fichiers <filename>changelog</filename> et <filename>.dsc</filename>. Ce fichier est signé avec GPG, de sorte que les gens peuvent être sûrs qu'il s'agit bien du vôtre.
it: Questo file descrive tutte le modifiche effettuate nella revisione corrente del pacchetto, ed è usata dai programmi di manutenzione dell'archivio FTP di Debian, per installare i pacchetti binari e sorgenti. È generato parzialmente dal contenuto del file <filename>changelog</filename> e dal file <filename>.dsc</filename>. Questo file è firmato con GPG, in modo da confermare l'autenticità dell'autore del pacchetto.
ja: このファイルは現在のリビジョンパッケージにおける変更点をすべて記載したもので、Debian FTP アーカイブ管理プログラムによって、バイナリおよびソースパッケージをFTPアーカイブにインストールするために利用されます。このファイルの一部は、<filename>changelog</filename>ファイルと<filename>.dsc</filename>をもとに生成されます。また、GPG で署名されているので、本当にあなた自身が作成したものかどうかを利用者が検証できます。

source: As you keep working on the package, behavior will change and new features will be added. People downloading your package can look at this file and quickly see what has changed. Debian archive maintenance programs will also post the contents of this file to the <ulink url="&debian-devel-announce-ldo;">debian-devel-announce@lists.debian.org</ulink> mailing list.
ca: Amb el temps, el paquet anirà canviat i s'afegiran funcions. Les persones que descarreguin el paquet poden llegir aquest arxiu i assabentar-se dels canvis. Els programes de manteniment del repositori Debian també envien el contingut d'aquest arxiu a la llista de correu <ulink url="&debian-devel-announce-ldo;">debian-devel-announce@lists.debian.org</ulink>.
fr: Au fur et à mesure que vous travaillez sur le paquet, son comportement va évoluer et de nouvelles fonctionnalités seront ajoutées. Les gens qui téléchargent votre paquet peuvent lire ce fichier et voir rapidement ce qui a changé. Les programmes de maintenance des archives Debian vont aussi poster le contenu de ce fichier sur la liste de diffusion <ulink url="&debian-devel-announce-ldo;">debian-devel-announce@lists.debian.org</ulink>.
it: Quando si lavora sul pacchetto, potrebbero cambiare il funzionamento del programma, o potrebbero venire introdotte nuove funzionalità. Chi scaricherà il pacchetto, potrà controllare questo file per vedere velocemente quali sono i cambiamenti. I programmi di manutenzione dell'archivio Debian invieranno anche i contenuti di questo file alla mailing list <ulink url="&debian-devel-announce-ldo;">debian-devel-announce@lists.debian.org</ulink>.
ja: パッケージの保守管理を続けていくと、挙動の変更や新機能の追加をすることがあります。あなたのパッケージをダウンロードする人は、このファイルを見れば何が変わったのか、一目でわかります。また、このファイルの中身はDebian アーカイブ管理プログラムによって、<ulink url="&debian-devel-announce-ldo;">debian-devel-announce@lists.debian.org</ulink>メーリングリストへ流されます。

source: The long strings of numbers in the <filename>.dsc</filename> and <filename>.changes</filename> files are MD5/SHA1/SHA256 checksums for the files mentioned. A person downloading your files can test them with <citerefentry> <refentrytitle>md5sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>sha1sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, or <citerefentry> <refentrytitle>sha256sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> and if the numbers don't match, they'll know the file is corrupt or has been tampered with.
ca: Les llistes de números en els fitxers <filename>.dsc</filename> i <filename>.changes</filename> són les sumes MD5/SHA1/SHA256 dels fitxers. Les persones que descarreguen els arxius poden comprovar-los amb <citerefentry> <refentrytitle>md5sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>sha1sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> o <citerefentry> <refentrytitle>sha256sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> i si els nombres no coincideixen sabran que el fitxer està corrupte o s'ha modificat.
es: Las largas listas de números en los ficheros <filename>.dsc</filename> y <filename>.changes</filename> son las sumas MD5/SHA1/SHA256 de los ficheros incluidos en el paquete. Las personas que descarguen estos ficheros pueden comprobarlos con <citerefentry> <refentrytitle>md5sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>sha1sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> o <citerefentry> <refentrytitle>sha256sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> y si los números no coinciden, sabrán que el fichero está corrupto o ha sido modificado.
fr: Les longues chaînes de chiffres dans les fichiers <filename>.dsc</filename> et <filename>.changes</filename> sont les sommes MD5, SHA1 et SHA256 des fichiers mentionnés. Les personnes téléchargeant vos fichiers peuvent les tester avec <citerefentry> <refentrytitle>md5sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>sha1sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> ou <citerefentry> <refentrytitle>sha256sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, et si les fichiers ne correspondent pas, elles sauront que le fichier a été corrompu ou falsifié.
it: Le lunghe stringhe di numeri nei file <filename>.dsc</filename> e <filename>.changes</filename> sono codici di controllo MD5/SHA1/SHA256 per i file menzionati. Chi scarica questi file, può controllarli con <citerefentry> <refentrytitle>md5sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>sha1sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, o <citerefentry> <refentrytitle>sha256sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> e se i numeri non corrispondessero saprebbe che il file relativo è corrotto, o è stato alterato.
ja: <filename>.dsc</filename> と <filename>.changes</filename> ファイルに記載されている長い数字の羅列は各ファイルの MD5/SHA1/SHA256 チェックサムです。パッケージをダウンロードした人は、<citerefentry> <refentrytitle>md5sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>、 <citerefentry> <refentrytitle>sha1sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>、<citerefentry> <refentrytitle>sha256sum</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>を使って整合性をテストすることができます。もし、数字が一致しない場合には、ファイルが壊れているか、あるいは何者かによって改ざんされていると分かるわけです。

source: Autobuilder
fr: Serveurs d'empaquetage automatique (« autobuilder »)
it: Auto-costruzione
ja: オートビルダー

source: The actual autobuilder system involves much more complicated schemes than the one documented here. Such details are beyond the scope of this document.
ca: El funcionament del sistema actual de compilació automàtica és més complicat del que s'explica en aquest document. Molts dels detalls del seu funcionament no són objectiu d'aquest document.
es: El funcionamiento del sistema actual de compilación automática es más complicado que lo expuesto en este documento. Muchos detalles quedan fuera de los objetivos de este documento.
fr: Le véritable réseau de serveurs d'empaquetage automatique a un fonctionnement autrement plus compliqué que celui présenté ici. De tels détails sortent du cadre de ce document.
it: L'attuale sistema di auto-costruzione è molto più complicato di come è qui documentato. Tali dettagli esulano dallo scopo del documento.
ja: 実際のオートビルダーシステムは、本稿の説明よりもかなり複雑なスキームによって実現しています。それらの詳細は、本稿の範囲を超えるため割愛します。

source: Debian supports many <ulink url="&ports;">ports</ulink> with the <ulink url="&buildd;">autobuilder network</ulink> running <command>buildd</command> daemons on many different architecture computers. Although you do not need to do this by yourself, you should be aware of what will happen on your packages. Let's look into roughly how your packages are rebuild for many different architectures by them. <placeholder type="footnote" id="0"/>
ca: Debian manté diverses <ulink url="&ports;">adaptacions «ports»</ulink> amb la <ulink url="&buildd;">xarxa de servidors de compilació automàtica</ulink> que executa dimonis <command>buildd</command> en ordinadors d'arquitectura diferent. Encara que tu no hauràs de fer res de tot això, has de conèixer el processament del teu paquet. Veurem com es processa el paquet per compilar-ho en diferents arquitectures <placeholder type="footnote" id="0"/>.
fr: Debian gère de nombreux <ulink url="&ports;">portages</ulink> avec le <ulink url="&buildd;">réseau de serveurs d'empaquetage automatique</ulink> faisant fonctionner des démons <command>buildd</command> sur de nombreux ordinateurs d'architectures différentes. Même si vous n'avez pas besoin de le faire vous-même, vous devriez être au courant de ce qui va arriver à vos paquets. La suite présente brièvement comment les paquets sont reconstruits sur ces différentes architectures. <placeholder type="footnote" id="0"/>
it: Debian supporta molti <ulink url="&ports;">port</ulink> tramite la <ulink url="&buildd;">autobuilder network</ulink>, su cui sono in esecuzione i demoni di <command>buildd</command> su molti computer con architetture differenti. Anche se non sarà necessario fare questo da soli, si dovrebbe essere consapevoli di quello che succederà ai pacchetti. Si vedrà, in maniera non approfondita, come i pacchetti vengono ricostruiti per architetture differenti. <placeholder type="footnote" id="0"/>
ja: Debian は、様々なアーキテクチャ上で<command>buildd</command>デーモンを走らせている<ulink url="&buildd;">オートビルダーネットワーク</ulink>によって、色々な<ulink url="&ports;">ports</ulink>をサポートしています。あなたがそれらを明示的に使う必要はありませんが、パッケージがどうなるのかを知っておくと良いでしょう。それでは、あなたのパッケージがどのように異なるアーキテクチャ向けに再構築されるのかを見ていきましょう。<placeholder type="footnote" id="0"/>
