Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: There are few similar but specialized packages such as <systemitem role="package">dh-make-perl</systemitem>, <systemitem role="package">dh-make-php</systemitem>, etc.
ca: Hi ha d'altres paquets semblants pel que fa a la seva funcionalitat però més específics, com és ara <systemitem role="package">dh-make-perl</systemitem>, <systemitem role="package">dh-make-php</systemitem>, etc.
es: Hay varios paquetes similares pero más específicos como <systemitem role="package">dh-make-perl</systemitem>, <systemitem role="package">dh-make-php</systemitem>, etc.
fr: Il y a d'autres paquets similaires mais spécialisés comme <systemitem role="package">dh-make-perl</systemitem>, <systemitem role="package">dh-make-php</systemitem>, etc.
it: Ci sono un paio di pacchetti simili, ma specializzati come <systemitem role="package">dh-make-perl</systemitem>, <systemitem role="package">dh-make-php</systemitem>, ecc.

source: <systemitem role="package">dh-make</systemitem> and <systemitem role="package">debhelper</systemitem> - <systemitem role="package">dh-make</systemitem> is necessary to create the skeleton of our example package, and it will use some of the <systemitem role="package">debhelper</systemitem> tools for creating packages. They are not essential for creation of packages, but are <emphasis>highly</emphasis> recommended for new maintainers. It makes the whole process very much easier to start, and control afterwards. (see <citerefentry> <refentrytitle>dh_make</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>debhelper</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <filename>/usr/share/doc/debhelper/README</filename>) <placeholder type="footnote" id="0"/>
es: <systemitem role="package">dh-make</systemitem> y <systemitem role="package">debhelper</systemitem> - <systemitem role="package">dh-make</systemitem> es necesario para construir el esqueleto de nuestro paquete ejemplo, y se usarán algunas de las herramientas de <systemitem role="package">debhelper</systemitem> para construir los paquetes. Aunque no son imprescindibles para la construcción de paquetes se recomiendan <emphasis>encarecidamente</emphasis> para nuevos desarrolladores. Hacen el proceso mucho más fácil al principio, y más fácil de controlar en el futuro (véase <citerefentry> <refentrytitle>dh_make</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>debhelper</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <filename>/usr/share/doc/debhelper/README</filename>)<placeholder type="footnote" id="0"/>.
fr: <systemitem role="package">dh-make</systemitem> et <systemitem role="package">debhelper</systemitem> — <systemitem role="package">dh-make</systemitem> est nécessaire pour créer le squelette de notre exemple de paquet et il utilise certains outils de <systemitem role="package">debhelper</systemitem> pour créer les paquets. Ils ne sont pas indispensables pour la création des paquets, mais ils sont <emphasis>fortement</emphasis> recommandés pour les nouveaux responsables. Ils rendent le processus complet bien plus facile à démarrer et à contrôler par la suite (voir <citerefentry> <refentrytitle>dh_make</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>debhelper</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> et <filename>/usr/share/doc/debhelper/README</filename>) <placeholder type="footnote" id="0"/> ;

source: <systemitem role="package">devscripts</systemitem> - this package contains some nice and useful scripts that can be helpful to the maintainers, but they are also not necessary for building packages. Packages recommended and suggested by this package are worth looking into. (see <filename>/usr/share/doc/devscripts/README.gz</filename>)
es: <systemitem role="package">devscripts</systemitem> - este paquete contiene algunos guiones útiles para los desarrolladores, pero no son necesarios para construir paquetes. Vale la pena mirar los paquetes recomendados y sugeridos por este paquete (véase <filename>/usr/share/doc/devscripts/README.gz</filename>).
fr: <systemitem role="package">devscripts</systemitem> — ce paquet contient de jolis scripts utiles pouvant aider les responsables, mais ils ne sont pas indispensables pour la création de paquets. Les paquets recommandés et suggérés par celui-ci valent le coup d'œil (voir <filename>/usr/share/doc/devscripts/README.gz</filename>) ;

source: <systemitem role="package">fakeroot</systemitem> - this utility lets you emulate being root which is necessary for some parts of the build process. (see <citerefentry> <refentrytitle>fakeroot</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)
ca: <systemitem role="package">fakeroot</systemitem> - aquesta utilitat permet simular l'usuari administrador (usuari «root»), la qual cosa és necessària per a algunes etapes del procés de construcció de paquets (llegeix <citerefentry> <refentrytitle>fakeroot</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
es: <systemitem role="package">fakeroot</systemitem> - esta utilidad te permite emular al usuario administrador (o «root», N. del T.), lo cual es necesario para ciertas partes del proceso de construcción (véase <citerefentry> <refentrytitle>fakeroot</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
fr: <systemitem role="package">fakeroot</systemitem> — cet utilitaire vous laisse prétendre être le superutilisateur, ce qui est nécessaire pour certaines parties du processus de construction (voir <citerefentry> <refentrytitle>fakeroot</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) ;
it: <systemitem role="package">fakeroot</systemitem> - questo programma permette di fingere di essere root, dato che è necessario per l'esecuzione di alcune parti del processo di creazione del pacchetto. (vedere <citerefentry> <refentrytitle>fakeroot</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)

source: <systemitem role="package">gnupg</systemitem> - a tool that enables you to digitally <emphasis>sign</emphasis> packages. This is especially important if you want to distribute it to other people, and you will certainly be doing that when your work gets included in the Debian distribution. (see <citerefentry> <refentrytitle>gpg</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)
ca: <systemitem role="package">gnupg</systemitem> - eina que es fa servir per a la <emphasis>signatura digital</emphasis> dels paquets. Cal signar els paquets per tal de distribuir-los i és imprescindible per ﻿incloure'ls en el repositori Debian (llegeix <citerefentry> <refentrytitle>gpg</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
es: <systemitem role="package">gnupg</systemitem> - herramienta que te permite <emphasis>firmar</emphasis> digitalmente los paquetes. Esto es especialmente importante si quieres distribuir tu paquete a otras personas, y ciertamente, tendrás que hacerlo cuando tu trabajo vaya a incluirse en la distribución de Debian (véase <citerefentry> <refentrytitle>gpg</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
fr: <systemitem role="package">gnupg</systemitem> — un outil qui vous permet de <emphasis>signer</emphasis> numériquement les paquets. Ceci est spécialement important si vous comptez les distribuer à d'autres personnes, et c'est certainement ce que vous ferez quand votre travail sera inclus dans la distribution Debian (voir <citerefentry> <refentrytitle>gpg</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) ;
it: <systemitem role="package">gnupg</systemitem> - questo programma consente di <emphasis>firmare</emphasis> elettronicamente i pacchetti. Questo è importante soprattutto se si vuole distribuirli ad altre persone, e verrà sicuramente fatto quando un pacchetto sarà pronto per essere incluso nella distribuzione Debian. (vedere <citerefentry> <refentrytitle>gpg</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)

source: <systemitem role="package">gfortran</systemitem> - the GNU Fortran 95 compiler, necessary if your program is written in Fortran. (see <citerefentry> <refentrytitle>gfortran</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)
ca: <systemitem role="package">gfortran</systemitem> - el compilador GNU per a Fortran 95, necessari si el programa està escrit en Fortran (llegeix <citerefentry> <refentrytitle>gfortran</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
es: <systemitem role="package">gfortran</systemitem> - el compilador GNU de Fortran 95, necesario si el programa está escrito en Fortran (véase <citerefentry> <refentrytitle>gfortran</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
fr: <systemitem role="package">gfortran</systemitem> — le compilateur Fortran 95 de GNU, nécessaire si votre programme est écrit en Fortran (voir <citerefentry> <refentrytitle>gfortran</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) ;
it: <systemitem role="package">gfortran</systemitem> - il compilatore GNU Fortran 95, necessario se il programma è scritto in Fortran. (vedere <citerefentry> <refentrytitle>gfortran</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)

source: <systemitem role="package">gpc</systemitem> - the GNU Pascal compiler, necessary if your program is written in Pascal. Worthy of note here is <systemitem role="package">fp-compiler</systemitem>, the Free Pascal Compiler, which is also good at this task. (see <citerefentry> <refentrytitle>gpc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>ppc386</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)
ca: <systemitem role="package">gpc</systemitem> - el compilador GNU de Pascal, necessari si el programa fa servir aquest llenguatge. També hi ha el compilador <systemitem role="package">fp-compiler</systemitem>, de codi lliure per a Pascal (llegeix <citerefentry> <refentrytitle>gpc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> i <citerefentry> <refentrytitle>ppc386</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
es: <systemitem role="package">gpc</systemitem> - el compilador GNU de Pascal, necesario si el programa está escrito en Pascal. Merece la pena mencionar aquí <systemitem role="package">fp-compiler</systemitem>, un compilador libre de Pascal, que también es bueno en esta tarea (véase <citerefentry> <refentrytitle>gpc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>ppc386</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
fr: <systemitem role="package">gpc</systemitem> — le compilateur Pascal de GNU, nécessaire si votre programme est écrit en Pascal. Mérite d'être mentionné ici, <systemitem role="package">fp-compiler</systemitem>, le compilateur pascal libre, convient également (voir <citerefentry> <refentrytitle>gpc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>ppc386</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) ;
it: <systemitem role="package">gpc</systemitem> - il compilatore GNU Pascal, necessario se il programma è scritto in Pascal. Un sostituto degno di nota è <systemitem role="package">fp-compiler</systemitem>, il Compilatore Free Pascal. (vedere <citerefentry> <refentrytitle>gpc</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>ppc386</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)

source: <systemitem role="package">xutils-dev</systemitem> - some programs, usually those made for X11, also use these programs to generate <filename>Makefile</filename> files from sets of macro functions. (see <citerefentry> <refentrytitle>imake</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>xmkmf</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)
ca: <systemitem role="package">xutils-dev</systemitem> - alguns programes, si més no els escrits per a X11, fan servir aquest paquet per generar fitxers <filename>Makefile</filename> executant conjunts de funcions macro (llegeix <citerefentry> <refentrytitle>imake</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> i <citerefentry> <refentrytitle>xmkmf</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
es: <systemitem role="package">xutils-dev</systemitem> - algunos programas, normalmente aquellos hechos para X11, también usan programas para generar <filename>Makefile</filename> ejecutando un conjunto de funciones de macro (véase <citerefentry> <refentrytitle>imake</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>xmkmf</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
fr: <systemitem role="package">xutils-dev</systemitem> — certains programmes, d'ordinaire ceux conçus pour X11, utilisent aussi ces programmes pour générer les fichiers <filename>Makefile</filename> à partir d'un ensemble de fonctions macros (voir <citerefentry> <refentrytitle>imake</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>xmkmf</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) ;
it: <systemitem role="package">xutils-dev</systemitem> - alcuni programmi, generalmente quelli fatti per X11, usano questi strumenti per generare i <filename>Makefile</filename> da una serie di funzioni macro. (vedere <citerefentry> <refentrytitle>imake</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>xmkmf</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)

source: <systemitem role="package">patchutils</systemitem> - this package contains some utilities to work with patches such as the <command>lsdiff</command>, <command>interdiff</command> and <command>filterdiff</command> commands.
ca: <systemitem role="package">patchutils</systemitem> - aquest paquet proporciona programes per gestionar els ﻿pegats, entre d'altres <command>lsdiff</command>, <command>interdiff</command> i <command>filterdiff</command>.
es: <systemitem role="package">patchutils</systemitem> - este paquete contiene programas para trabajar con los «parches» como <command>lsdiff</command>, <command>interdiff</command> y <command>filterdiff</command>.
fr: <systemitem role="package">patchutils</systemitem> — ce paquet contient certains utilitaires pour travailler avec les correctifs comme les commandes <command>lsdiff</command>, <command>interdiff</command> et <command>filterdiff</command> ;
it: <systemitem role="package">patchutils</systemitem> - questo pacchetto contiene dei programmi che lavorano con le patch, come <command>lsdiff</command>, <command>interdiff</command> e <command>filterdiff</command>.
ja: <systemitem role="package">patchutils</systemitem> - このパッケージには、<command>lsdiff</command>、 <command>interdiff</command> や <command>filterdiff</command> といったパッチを扱うユーティリティが含まれています。

source: <systemitem role="package">quilt</systemitem> - this package helps you to manage a series of patches by keeping track of the changes each of them makes. They are logically organized as a stack, and you can apply (=push), un-apply (=pop), refresh them easily by traveling into the stack. (see <citerefentry> <refentrytitle>quilt</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <filename>/usr/share/doc/quilt/README.Debian</filename>)
es: <systemitem role="package">quilt</systemitem> - este paquete ayuda a aplicar modificaciones («parches») y hacer el seguimiento de los cambios realizados. Aplica las modificaciones ordenadamente en pila, y es posible aplicar, deshacer y actualizar las modificaciones fácilmente recorriendo la pila (véase <citerefentry> <refentrytitle>quilt</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <filename>/usr/share/doc/quilt/README.Debian</filename>).
fr: <systemitem role="package">quilt</systemitem> — ce paquet aide à gérer un ensemble de correctifs en gardant une trace du rôle de chacun. Ils sont logiquement organisés en pile, et vous pouvez les appliquer (« push »), les enlever (« pop »), et les rafraîchir facilement en parcourant la pile (consultez <citerefentry> <refentrytitle>quilt</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> et <filename>/usr/share/doc/quilt/README.Debian</filename>) ;

source: <systemitem role="package">git</systemitem> - this package provides popular version control system designed to handle very large projects with speed and efficiency; it is used for many high profile open source projects, most notably the Linux kernel. (see <citerefentry> <refentrytitle>git</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <filename>/usr/share/doc/git-doc/index.html</filename>)
es: <systemitem role="package">git</systemitem> - este paquete instala el popular sistema de control de versiones, diseñado para hacer el seguimiento de proyectos grandes con eficacia y rapidez; se utiliza para proyectos de código libre importantes como es el caso del núcleo («kernel») de Linux (véase <citerefentry> <refentrytitle>git</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <filename>/usr/share/doc/git-doc/index.html</filename>).
fr: <systemitem role="package">git</systemitem> — ce paquet fournit un système de gestion de version populaire conçu pour manipuler de très gros projets rapidement et efficacement ; il est utilisé pour des projets libres de grande envergure, en particulier le noyau Linux (voir <citerefentry> <refentrytitle>git</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> et <filename>/usr/share/doc/git-doc/index.html</filename>).

source: The following is the <emphasis>very important</emphasis> documentation which you should read along with this document:
ca: I finalment, la documentació <emphasis>imprescindible</emphasis> i que cal llegir amb aquest document:
es: Por último, la documentación que se indica a continuación es de <emphasis>gran importancia</emphasis> y debería leerse junto con este documento:
fr: Les documents suivants sont <emphasis>très importants</emphasis> et doivent être lus en parallèle à ce document :
it: Segue una serie di documenti <emphasis>molto importanti</emphasis> che è consigliabile leggere insieme a questo documento:
ja: 以下は、この文書と合わせて読むべき<emphasis>とても重要な</emphasis>文書です。

source: <systemitem role="package">debian-policy</systemitem> - the <ulink url="&debian-policy;">Debian Policy Manual</ulink> includes explanations of the structure and contents of the Debian archive, several OS design issues, the Filesystem Hierarchy Standard (which says where each file and directory should be) etc. For you, the most important thing is that it describes requirements that each package must satisfy to be included in the distribution (see <filename>/usr/share/doc/debian-policy/policy.html/index.html</filename>).
fr: <systemitem role="package">debian-policy</systemitem> — la <ulink url="&debian-policy;">Charte Debian</ulink> inclut des explications sur la structure et le contenu de l'archive Debian, plusieurs considérations sur l'architecture du système d'exploitation, la norme de hiérarchie des fichiers (« Filesystem Hierarchy Standard » ou FHS, qui dit où chaque fichier et répertoire doit se trouver), etc. Le plus important pour vous est qu'elle décrive les critères que chaque paquet doit vérifier pour être inclus dans la distribution (voir <filename>/usr/share/doc/debian-policy/policy.html/index.html</filename>) ;

source: <systemitem role="package">developers-reference</systemitem> - the <ulink url="&developers-reference;">Debian Developer's Reference</ulink> describes all matters not specifically about the technical details of packaging, like the structure of the archive, how to rename, orphan, pick up packages, how to do NMUs, how to manage bugs, best packaging practices, when and where to upload etc. (see <filename>/usr/share/doc/developers-reference/</filename>).
fr: <systemitem role="package">developers-reference</systemitem> — la <ulink url="&developers-reference;">Référence du développeur Debian</ulink> concerne tout ce qui n'est pas spécifique aux détails techniques de la création de paquets, comme la structure des archives, comment renommer, abandonner, choisir les paquets, faire une NMU (« Non-Maintainer Uploads » ou mise à jour indépendante), comment gérer les bogues, les meilleures pratiques d'empaquetage, où et quand faire des envois de paquets, etc. (consultez <filename>/usr/share/doc/developers-reference/</filename>) ;

source: <ulink url="&autotools-tutorial;">Autotools Tutorial</ulink> provides very good tutorial for <ulink url="&gnu-build-system;">the GNU Build System known as the GNU Autotools</ulink> whose most important components are Autoconf, Automake, Libtool, and gettext.
ca: <ulink url="&autotools-tutorial;">Tutorial de «Autotools»</ulink> és un bon tutorial del <ulink url="&gnu-build-system;">sistema de compilació GNU conegut como «GNU Autotools»</ulink> composat per Autoconf, Automake, Libtool, i gettext.
fr: Le <ulink url="&autotools-tutorial;">tutoriel des Autotools</ulink> fournit un très bon tutoriel pour le <ulink url="http://fr.wikipedia.org/wiki/Autotools">système de construction GNU connu comme les GNU Autotools</ulink> dont les composants les plus importants sont Autoconf, Automake, Libtool, et gettext ;
it: <ulink url="&autotools-tutorial;">Autotools Tutorial</ulink> contiene un ottimo tutorial su <ulink url="&gnu-build-system;">the GNU Build System known as the GNU Autotools</ulink> i cui componenti più importanti sono Autoconf, Automake, Libtool, e gettext.

source: <systemitem role="package">gnu-standards</systemitem> - this package contains two pieces of documentation from the GNU project: <ulink url="&gnu-standard;">GNU Coding Standards</ulink>, and <ulink url="&gnu-maintainer;">Information for Maintainers of GNU Software</ulink>. Although Debian does not require these to be followed, these are still helpful as guidelines and common sense. (see <filename>/usr/share/doc/gnu-standards/standards.html</filename> and <filename>/usr/share/doc/gnu-standards/maintain.html</filename>).
fr: <systemitem role="package">gnu-standards</systemitem> — ce paquet contient deux documentations issues du projet GNU : les <ulink url="&gnu-standard;">normes GNU de codage</ulink>, et les <ulink url="&gnu-maintainer;">informations pour les responsables de programme GNU</ulink>. Bien que Debian n'exige pas que ces recommandations soient suivies, elles sont néanmoins utiles en tant que lignes directrices et bon sens. (voir <filename>/usr/share/doc/gnu-standards/standards.html</filename> et <filename>/usr/share/doc/gnu-standards/maintain.html</filename>).

source: If this document contradicts with what the Debian Policy Manual and Debian Developer's Reference describes, they are correct. Please file a bug report on the <systemitem role="package">maint-guide</systemitem> package.
es: Si este documento contradice en algún aspecto al «Debian Policy Manual» o al «Debian Developer's Reference», prevalecen estos últimos. Por favor, envíe un informe de error del paquete <systemitem role="package">maint-guide</systemitem>.
fr: Si ce document entre en contradiction avec ce qui est décrit dans la Charte Debian ou la référence du développeur, elles sont prioritaires. Veuillez signaler un bogue sur le paquet <systemitem role="package">maint-guide</systemitem>.
