Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: Some information will come up. It will ask you what sort of package you want to create. Gentoo is a single binary package - it creates only one binary, and thus one <filename>.deb</filename> file - so we will select the first option, with the <literal>s</literal> key, check the information on the screen and confirm by pressing <literal><replaceable>ENTER</replaceable></literal>. <placeholder type="footnote" id="0"/>
fr: Des informations seront affichées. Il vous sera demandé quelle sorte de paquet vous voulez créer. Gentoo est un paquet binaire simple — il ne crée qu'un exécutable, et donc un seul fichier <filename>.deb</filename> — donc la première option sera sélectionnée, avec la touche « <literal>s</literal> ». Une fois l'information vérifiée sur l'écran, confirmez en pressant « <literal><replaceable>Entrée</replaceable></literal> ». <placeholder type="footnote" id="0"/>
it: Verranno visualizzate alcune informazioni. Verrà chiesto che tipo di pacchetto creare. Gentoo è un singolo pacchetto binario - crea un solo binario, e quindi un solo file <filename>.deb</filename> - per cui si dovrà selezionare la prima opzione con il tasto <literal>s</literal>, controllare le informazioni sullo schermo e confermare la scelta con <literal><replaceable>ENTER</replaceable></literal>. <placeholder type="footnote" id="0"/>

source: After this execution of <command>dh_make</command>, a copy of the upstream tarball is created as <filename>gentoo_0.9.12.orig.tar.gz</filename> in the parent directory to accommodate the creation of the non-native Debian source package with the <filename>debian.tar.gz</filename> later.
ca: Desprès d'executar l'ordre <command>dh_make</command>, es fa una còpia del fitxer amb el codi original amb el nom <filename>gentoo_0.9.12.orig.tar.gz</filename> en el directori arrel per facilitar la construcció del paquet de fonts no nadiu de Debian amb el fitxer <filename>debian.tar.gz</filename>.
es: Tras ejecutar <command>dh_make</command>, se genera una copia del código original con el nombre <filename>gentoo_0.9.12.orig.tar.gz</filename> en el directorio raíz para facilitar la construcción del paquete de fuentes no nativo de Debian con el archivo <filename>debian.tar.gz</filename>.
fr: Après cette exécution de <command>dh_make</command>, une copie de l'archive amont est créée sous <filename>gentoo_0.9.12.orig.tar.gz</filename> dans le répertoire parent pour permettre ensuite la création d'un paquet source Debian non natif avec <filename>debian.tar.gz</filename>.
it: Dopo l'esecuzione di <command>dh_make</command>, verrà eseguita una copia dell'archivio originale del programma, come nome <filename>gentoo_0.9.12.orig.tar.gz</filename>, nella directory superiore, per consentire, più avanti, la creazione di un pacchetto Debian sorgente non-nativo con il <filename>debian.tar.gz</filename>.

source: Please note 2 key features in this <filename>gentoo_0.9.12.orig.tar.gz</filename> file name:
ca: Posa atenció en els dos canvis en el nom del fitxer <filename>gentoo_0.9.12.orig.tar.gz</filename>:
es: Observa que hay dos cambios clave en el nombre del fichero <filename>gentoo_0.9.12.orig.tar.gz</filename>:
fr: Veuillez remarquer deux caractéristiques dans ce nom de fichier <filename>gentoo_0.9.12.orig.tar.gz</filename> :
it: Si presti attenzione a due caratteristiche chiave presenti nel nome del file <filename>gentoo_0.9.12.orig.tar.gz</filename>:

source: Package name and version are separated by the <literal>_</literal> (underscore).
ca: El nom del paquet i de la versió estan separats per «<literal>_</literal>».
es: El nombre del paquete y la versión están separados por «<literal>_</literal>».
fr: le nom de paquet et la version sont séparés par « <literal>_</literal> » (tiret bas) ;
it: Il nome del pacchetto e la versione sono separati da <literal>_</literal> (trattino basso).

source: You should also notice that many template files are created in the source under the <filename>debian</filename> directory. These will be explained in <xref linkend="dreq"/> and <xref linkend="dother"/> . You should also understand that the packaging is not automatic process. You need to modify the upstream source for Debian as <xref linkend="modify"/> . After all these, you need to build Debian packages under the proper method as <xref linkend="build"/> , check them as <xref linkend="checkit"/> , and upload them as <xref linkend="upload"/> . I will explain all these steps.
ca: Fitxa't que hi ha nous fitxers (de plantilla) en el directori <filename>debian</filename> dels quals es parlarà en <xref linkend="dreq"/> i <xref linkend="dother"/> . El procés d'empaquetament no està totalment automatitzat. La modificació dels fitxers Debian s'explicarà a <xref linkend="modify"/> . A continuació es compilarà el paquet Debian en l'apartat <xref linkend="build"/> , la revisió del resultat a l'apartat <xref linkend="checkit"/> i la transferència del paquet al repositori a <xref linkend="upload"/> . S'explicarà cada etapa a continuació.
es: Observa que la ejecución de la orden ha creado varios archivos de plantilla en el directorio <filename>debian</filename>. Se tratará sobre ellos en <xref linkend="dreq"/> y <xref linkend="dother"/> . El proceso de empaquetado no está totalmente automatizado. Se tratará de la modificación de los archivos Debian en <xref linkend="modify"/> . A continuación se compilará el paquete Debian en el apartado <xref linkend="build"/> , la revisión del resultado en <xref linkend="checkit"/> y el envío del paquete en <xref linkend="upload"/> . Se explicará cada una de estas etapas a continuación.
fr: Vous devriez aussi remarquer que de nombreux fichiers modèles sont créés dans les sources sous le répertoire <filename>debian</filename>. Ce sera expliqué en <xref linkend="dreq"/> et <xref linkend="dother"/> . Vous devriez aussi comprendre que l'empaquetage n'est pas un processus automatique. Vous devez modifier les sources amont pour Debian comme en <xref linkend="modify"/> . Après tout cela, vous avez besoin de construire les paquets avec la méthode appropriée comme en <xref linkend="build"/> , les vérifier comme en <xref linkend="checkit"/> , et les envoyer comme en <xref linkend="upload"/> . Toutes ces étapes seront expliquées.

source: Once again, as a new maintainer you are discouraged from creating complicated packages, e.g.,
ca: Com a nou desenvolupador, no s'aconsella la construcció de paquets complicats, per exemple:
es: Como nuevo desarrollador, se desaconseja construir paquetes complicados, por ejemplo:
fr: Rappelons-le, en tant que nouveau responsable, vous ne devriez pas créer de paquets compliqués, par exemple :
it: Ancora una volta, visto che si è alle prime armi come maintainer non è consigliato creare pacchetti complessi, ad esempio:

source: multiple binary packages,
ca: paquets amb més d'un binari.
es: múltiples paquetes binarios
fr: des paquets à binaires multiples ;
it: pacchetti binari multipli,

source: library packages,
ca: paquets de biblioteques.
es: paquetes de bibliotecas
fr: des paquets de bibliothèque ;
it: pacchetti di libreria,

source: kernel module packages,
ca: paquets amb mòduls del nucli.
es: paquetes de módulos del núcleo,
fr: des paquets de modules du noyau ;
it: pacchetti di moduli del kernel,

source: kernel patch packages,
ca: paquets amb pegats del nucli.
es: paquetes de parches del núcleo,
fr: des paquets de correctifs du noyau ;
it: pacchetti di patch del kernel,

source: the source tarball containing undistributable contents.
ca: paquets amb parts de les fonts que no es poden distribuir.
es: paquetes cuyas fuentes contienen partes que no se pueden distribuir.
fr: une archive source avec des contenus non distribuables ;
it: l'archivio dei sorgenti ha contenuti non distribuibili.

source: It's not too hard, but it does require a bit more knowledge, so we won't describe all of it here.
ca: Aquest casos no són especialment complicats però cal tenir alguns coneixements complementaris que no s'expliquen en aquest document.
es: Estos casos no son extremadamente difíciles pero es preciso tener algunos conocimientos más, así que aquí no se describirá el proceso de empaquetado para este tipo de paquetes.
fr: Ce n'est pas si difficile, mais cela requiert un peu plus de connaissances, et nous n'entrerons pas dans les détails ici.
it: Non è difficile, ma richiede un po' più di conoscenze, per cui non ne parleremo in questo documento.

source: If you accidentally erased some template files while working on them, you can recover them by running <command>dh_make</command> with the <literal>--addmissing</literal> option again in a Debian package source tree.
ca: Si casualment elimines algun dels fitxers de plantilles del directori «debian», pots tornar a generar-los executant <command>dh_make</command> amb l'opció <literal>--addmissing</literal> des del directori de les fonts.
es: Si accidentalmente eliminó alguna de las plantillas mientras trabajaba en ellas, puedes regenerarlas ejecutando <command>dh_make</command> con la opción <literal>--addmissing</literal> desde el directorio con las fuentes del paquete Debian.
fr: Si vous effacez par mégarde quelques fichiers modèles en travaillant dessus, vous pouvez les retrouver en exécutant de nouveau <command>dh_make</command> avec l'option <literal>--addmissing</literal> dans une arborescence de paquet Debian.
it: Se accidentalmente viene cancellato qualche modello di file mentre ci si lavora, è possibile recuperarlo eseguendo <command>dh_make</command> con l'opzione <literal>--addmissing</literal> nella directory dei sorgenti del pacchetto Debian.
ja: 作業中にテンプレートファイルを間違って消した場合は、Debian パッケージのソースツリーで <command>dh_make</command> を <literal>--addmissing</literal> オプションつきで再度実行することで修復できます。

source: Updating an existing package may get complicated since it may be using older techniques. Please stick with fresh packaging cases for now to learn basics. I will come back to explain it later in <xref linkend="update"/> .
ca: L'actualització d'un paquet ja construït és un procés més complex: es probable que s'hagi construït amb procediments distints als que es fan servir actualment. Es millor treballar amb paquets actualitzats per aprendre els procediments bàsics de la construcció de paquets. Per empaquetar una revisió o una nova versió del teu paquet en el futur, faràs servir un procediment distint. Tot això s'explicarà a la secció <xref linkend="update"/> .
es: La actualización de un paquete ya creado es un proceso más complejo: es probable que se haya construido con procedimientos distintos al actual. Es mejor trabajar con paquetes actualizados para aprender lo básico del empaquetado. Esto también significa que usarás un método distinto para generar una nueva revisión o una nueva versión de tu paquete en el futuro. Lee más sobre esto más adelante, en <xref linkend="update"/> .
fr: La mise à jour d'un paquet existant peut devenir compliquée puisqu'il pourrait utiliser d'anciennes techniques. Veuillez vous en tenir aux cas d'empaquetage récent pour l'instant afin d'apprendre les bases. Des explications arriveront plus loin en <xref linkend="update"/> .

source: Modifying the source
ca: Modificar les fonts originals.
es: Modificar las fuentes
fr: Modification du code source
it: Modificare i sorgenti
ja: ソースコードの変更

source: Please note that there isn't space here to go into <emphasis>all</emphasis> the details of fixing upstream sources, but here are some basic steps and problems people often run across.
ca: No hi ha espai en aquest document per explicar <emphasis>tots</emphasis> els detalls de les modificacions que poden haver de fer-se a les fonts originals. Tot i així, a continuació s'expliquen els problemes més freqüents.
es: Ten en cuenta que no hay espacio aquí para entrar en <emphasis>todos</emphasis> los detalles respecto a los cambios que deben hacerse en las fuentes originales. Sin embargo, a continuación se detallan algunos de los problemas más frecuentes.
fr: La place manque pour entrer dans <emphasis>tous</emphasis> les détails de modification des sources amont, mais voici quelques étapes fondamentales et problèmes qui reviennent souvent.
it: Non c'è spazio qui per approfondire <emphasis>tutti</emphasis> i dettagli su come modificare i sorgenti originali, ma verranno trattati alcuni passaggi fondamentali e le problematiche più comuni.
ja: 開発元のソースを修正する具体的なやり方について、<emphasis>何から何まで</emphasis>説明するにはとても紙面が足りませんが、よくあるパターンとしては大体以下のようなものでしょう。

source: You can disable this configuration by starting the <command>quilt</command> command as <literal>quilt --quiltrc /dev/null ...</literal>.
es: Para deshabilitar la configuración ejecute el programa <command>quilt</command> con la opción <literal>quilt --quiltrc /dev/null ...</literal>.
fr: Cette configuration peut-être désactivée en démarrant la commande <command>quilt</command> comme ceci : « <literal>quilt --quiltrc /dev/null ...</literal> ».

source: The <command>quilt</command> program offers the basic method to record modification to the source for the Debian packaging. Since slightly different default is desirable for Debian packaging, let's set up <filename>~/.quiltrc</filename> as follows. <placeholder type="footnote" id="0"/>
es: El programa <command>quilt</command> ofrece un método básico para realizar y conservar las modificaciones del código fuente para construir paquetes Debian. Para empaquetar, es preferible realizar algunos cambios a la configuración predeterminada del programa, vamos a escribir lo siguiente en el archivo <filename>~/.quiltrc</filename><placeholder type="footnote" id="0"/>.
fr: Le programme <command>quilt</command> fournit la méthode fondamentale pour enregistrer les modifications du code source pour l'empaquetage Debian. Puisque de légères modifications au paramétrage par défaut sont souhaitables pour l'empaquetage Debian, configurez <filename>~/.quiltrc</filename> comme suit : <placeholder type="footnote" id="0"/>

source: d=. ; while [ ! -d $d/debian -a `readlink -e $d` != / ]; do d=$d/..; done if [ -d $d/debian ] &amp;&amp; [ -z $QUILT_PATCHES ]; then # Debian packaging case and unset $QUILT_PATCHES QUILT_PATCHES=debian/patches QUILT_PATCH_OPTS=--unified-reject-files QUILT_DIFF_ARGS=-p ab --no-timestamps --no-index --color=auto QUILT_REFRESH_ARGS=-p ab --no-timestamps --no-index QUILT_COLORS=diff_hdr=1;32:diff_add=1;34:diff_rem=1;31:diff_hunk=1;33:diff_ctx=35:diff_cctx=33 if ! [ -d $d/debian/patches ]; then mkdir $d/debian/patches; fi fi
fr: d=. ; while [ ! -d $d/debian -a `readlink -e $d` != / ]; do d=$d/..; done if [ -d $d/debian ] &amp;&amp; [ -z $QUILT_PATCHES ]; then # Cas d'empaquetage Debian avec $QUILT_PATCHES non configuré QUILT_PATCHES=debian/patches QUILT_PATCH_OPTS=--unified-reject-files QUILT_DIFF_ARGS=-p ab --no-timestamps --no-index --color=auto QUILT_REFRESH_ARGS=-p ab --no-timestamps --no-index QUILT_COLORS=diff_hdr=1;32:diff_add=1;34:diff_rem=1;31:diff_hunk=1;33:diff_ctx=35:diff_cctx=33 if ! [ -d $d/debian/patches ]; then mkdir $d/debian/patches; fi fi

source: See <citerefentry> <refentrytitle>quilt</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> and <filename>/usr/share/doc/quilt/quilt.html</filename> for how to use <command>quilt</command>.
es: Véase <citerefentry> <refentrytitle>quilt</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> y <filename>/usr/share/doc/quilt/quilt.html</filename> para utilizar <command>quilt</command>.
fr: Voir <citerefentry> <refentrytitle>quilt</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> et <filename>/usr/share/doc/quilt/quilt.html</filename> pour apprendre à utiliser <command>quilt</command>.

source: Fixing upstream bug
ca: Apedaçant el codi font.
es: Corregir un error en el código fuente
fr: Correction de bogue amont
it: Correggere i bug nel sorgente originale

source: Let's assume you find an error in the upstream <filename>Makefile</filename> file as follows where <literal>install: gentoo</literal> should have been <literal>install: gentoo-target</literal>.
ca: Suposem que has detectant la següent errada en el fitxer <filename>Makefile</filename> original: on posa «<literal>install: gentoo</literal>» hauria de posar «<literal>install: gentoo-target</literal>».
es: Vamos a suponer que has encontrado el siguiente error en el archivo <filename>Makefile</filename> original: donde pone «<literal>install: gentoo</literal>» debería poner «<literal>install: gentoo-target</literal>».
fr: Si vous trouvez une erreur dans le fichier <filename>Makefile</filename> amont comme suit, où « <literal>install: gentoo</literal> » aurait dû être « <literal>install: gentoo-target</literal> » :
it: Si supponga di trovare un errore, nel file <filename>Makefile</filename> distribuito con il programma originale, ad esempio la stringa <literal>install: gentoo</literal> avrebbe dovuto essere <literal>install: gentoo-target</literal>.

source: The <filename>debian/patches</filename> directory should exist now if you run <command>dh_make</command> as described before. This example operation creates it just in case you are updating the existing package.
ca: L'anterior execució de <command>dh_make</command> hauria d'haver generat el directori <filename>debian/patches</filename>. En cas contrari o bé si estàs treballant en l'actualització d'un paquet, caldrà executar la primera ordre «mkdir debian/patches».
es: El directorio <filename>debian/patches</filename> debería haberse creado en la anterior ejecución de <command>dh_make</command>. Sólo debes generarlo si no existe o bien si estas actualizando un paquete.
fr: Le répertoire <filename>debian/patches</filename> devrait maintenant exister si vous exécutez <command>dh_make</command> comme décrit auparavant. Cet exemple de manipulation le créé seulement si vous mettez à jour le paquet existant.
it: La directory <filename>debian/patches</filename> dovrebbe essere creata se si esegue <command>dh_make</command>, come descritto prima. Questo esempio crea la directory nel caso in cui si stia aggiornando un pacchetto esistente.

source: Let's fix this and record this with the <command>quilt</command> command as <filename>fix-gentoo-target.patch</filename>. <placeholder type="footnote" id="0"/>
es: Vamos a arreglar este error con la orden <command>quilt</command> y conservar las modificaciones a realizar en el archivo <filename>fix-gentoo-target.patch</filename> <placeholder type="footnote" id="0"/>.
fr: Corrigez l'erreur et enregistrez la modification avec la commande <command>quilt</command> sous <filename>fix-gentoo-target.patch</filename> : <placeholder type="footnote" id="0"/>

source: You change the <filename>Makefile</filename> file as follows.
ca: Ara fes els canvis necessaris en el fitxer <filename>Makefile</filename> (amb un editor) original i deixa'l així:
es: Ahora cambia el archivo <filename>Makefile</filename> (con un editor) original como se muestra a continuación.
fr: Modifiez le fichier <filename>Makefile</filename> comme suit :
it: Si modifichi il file <filename>Makefile</filename> come segue.
ja: <filename>Makefile</filename> ファイルを次のように変更します。

source: Ask <command>quilt</command> to refresh the patch to create <filename>debian/patches/fix-gentoo-target.patch</filename> and add its description.
es: A continuación ejecuta <command>quilt</command> para que actualice el parche creando el archivo <filename>debian/patches/fix-gentoo-target.patch</filename> y añade la descripción del parche.
fr: Demandez à <command>quilt</command> de créer <filename>debian/patches/fix-gentoo-target.patch</filename> et ajoutez sa description :

source: $ quilt refresh $ quilt header -e ... describe patch
es: $ quilt refresh $ quilt header -e ... describe el parche
fr: $ quilt refresh $ quilt header -e ... description du correctif

source: Installation of files to the destination
ca: Instal·lació del programa.
es: Instalación del programa
fr: Installation des fichiers à leur emplacement
it: Installazione in una sotto-directory

source: Normally, programs install themselves in the <filename>/usr/local</filename> subdirectory. Since it is reserved for system administrator's (or user's) private use, Debian packages must not use that directory but should use system directories such as the <filename>/usr/bin</filename> subdirectory following the Filesystem Hierarchy Standard (<ulink url="&fhs;">FHS</ulink>, <filename>/usr/share/doc/debian-policy/fhs/fhs-2.3.html</filename>).
fr: Normalement, les programmes s'installent d'eux-mêmes dans le sous-répertoire <filename>/usr/local</filename>. Puisqu'il est réservé à l'usage privé de l'administrateur système (ou de l'utilisateur), les paquets Debian ne doivent pas utiliser ce répertoire, mais devraient utiliser le sous-répertoire <filename>/usr/bin</filename> conformément à la norme de hiérarchie des fichiers (<ulink url="&fhs;">FHS</ulink>, <filename>/usr/share/doc/debian-policy/fhs/fhs-2.3.html</filename>).

source: Normally, <citerefentry> <refentrytitle>make</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> is used to automate building the program and the execution of <literal>make install</literal> installs programs directly to the desired destination by the <literal>install</literal> target of the <filename>Makefile</filename> file. In order for Debian to provide binary packages, the build system installs programs to the file tree image created under a temporary directory instead to the actual destination.
ca: És freqüent fer servir l'ordre <citerefentry> <refentrytitle>make</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> per a la construcció (compilació) automatitzada del programa i l'execució de l'ordre <literal>make install</literal> instal·la directament el programa en el directori desitjat executant la secció <literal>install</literal> del fitxer <filename>Makefile</filename>. En la construcció dels paquets binaris de Debian, el sistema de construcció simula la instal·lació del programa en una reconstrucció de l'estructura de directoris del programa en un directori temporal en lloc de fer-ho en la destinació real.
es: Es frecuente la utilización de <citerefentry> <refentrytitle>make</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> para la construcción automatizada del programa y la ejecución de la orden <literal>make install</literal> instala directamente el programa en la ubicación deseada ejecutando la sección <literal>install</literal> del archivo <filename>Makefile</filename>. En la construcción de los paquetes binarios de Debian, el sistema de construcción instala los programas en una reconstrucción de la estructura de directorios del programa en un directorio temporal en lugar de hacerlo en su destino real.
fr: Habituellement, <citerefentry> <refentrytitle>make</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> est utilisé pour automatiser la construction du programme et l'exécution de « <literal>make install</literal> » installe les programmes directement à l'endroit voulu par la cible <literal>install</literal> du fichier <filename>Makefile</filename>. Pour permettre à Debian de fournir des paquets binaires, le système de construction installe les programmes dans l'image de l'arborescence de fichiers créé dans un répertoire temporaire plutôt que dans la destination réelle.
it: Normalmente, <citerefentry> <refentrytitle>make</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> è usato per costruire automaticamente il programma, invece l'esecuzione di <literal>make install</literal> installa il programma direttamente nella destinazione prestabilita. Questa è configurata nella sezione <literal>install</literal> del file <filename>Makefile</filename>. Per far in modo che Debian fornisca dei pacchetti binari, il sistema di compilazione installa i programmi in un'immagine dell'albero dei file, creata dentro una directory temporanea, anziché nella destinazione prestabilita.
