Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: If you want to store the system configuration data for the <systemitem role="package">gentoo</systemitem> package in the <filename>/etc/gentoo</filename> directory instead of the usual <filename>/etc</filename> directory, you can override the default <literal>--sysconfig=/etc</literal> argument given by the <command>dh_auto_configure</command> command to the <command>./configure</command> command by the following. <placeholder type="footnote" id="0"/>
es: Si vas a guardar los datos de configuración del paquete <systemitem role="package">gentoo</systemitem> en el directorio <filename>/etc/gentoo</filename> en lugar del directorio habitual <filename>/etc</filename>, debes anular la ejecución del argumento predeterminado <literal>--sysconfig=/etc</literal> de la orden <command>dh_auto_configure</command> por <command>./configure</command> con lo siguiente <placeholder type="footnote" id="0"/>:
fr: Pour conserver les données de configuration du paquet <systemitem role="package">gentoo</systemitem> dans le répertoire <filename>/etc/gentoo</filename> plutôt que dans le répertoire consacré <filename>/etc</filename>, il suffit de remplacer l'option <literal>--sysconfig=/etc</literal> donnée par la commande <command>dh_auto_configure</command> à la commande <command>./configure</command> avec : <placeholder type="footnote" id="0"/>

source: The arguments given after <literal>--</literal> are appended to the default arguments of the auto-executed program to override them. Using the <command>dh_auto_configure</command> command is better than the <command>./configure</command> command here since it will only override the <literal>--sysconfig</literal> argument and keeps well intended other arguments to the <command>./configure</command> command.
ca: Els arguments a continuació de <literal>dh_auto_configure --</literal> s'afegeixen als predeterminants, anul·lant-los , en l'execució automàtica del programa. És millor fer servir l'ordre <command>dh_auto_configure</command> que el <command>./configure</command>: d'aquesta manera només s'anul·larà l'argument <literal>--sysconfig</literal> mantenint els altres arguments de <command>./configure</command>.
es: Los argumentos a continuación de <literal>--</literal> se añaden a los argumentos predeterminados, anulándolos, en la ejecución automática del programa. Es mejor utilizar la orden <command>dh_auto_configure</command> que el <command>./configure</command> ya que así sólo anulará el argumento <literal>--sysconfig</literal> manteniendo intactos otros argumentos de <command>./configure</command>.
fr: Les options données après <literal>--</literal> sont ajoutées aux options par défaut du programme exécuté automatiquement dans le but de les remplacer. L'utilisation de la commande <command>dh_auto_configure</command> est ici préférable à la commande <command>./configure</command> puisqu'elle remplacera seulement l'option <literal>--sysconfig</literal> et conservera les autres options pertinentes de la commande <command>./configure</command>.
it: I parametri immessi dopo <literal>--</literal> vengono aggiunti dopo i parametri predefiniti dei programmi eseguiti pr sovrascriverli. Utilizzare il comando <command>dh_auto_configure</command> è preferibile rispetto al comando <command>./configure</command> dal momento che sovrascriverà esclusivamente il parametro <literal>--sysconfig</literal> e manterrà gli altri parametri del comando <command>./configure</command>.
ja: <literal>--</literal>以下の引数は、自動的に実行されるプログラムの引数に付け足されます。<command>dh_auto_configure</command>コマンドは、引数<literal>--sysconfig</literal>のみをオーバーライドしその他の良く配慮された <command>./configure</command> 引数には触れないため、<command>./configure</command>コマンドをここに使うより優れているとされています。

source: <command>dh_auto_build</command> without any arguments will execute the first target in the <filename>Makefile</filename> file.
ca: <command>dh_auto_build</command> sense arguments executarà el primer objectiu del fitxer <filename>Makefile</filename>.
es: <command>dh_auto_build</command> sin argumentos ejecutará el primer objetivo del archivo <filename>Makefile</filename>.
fr: <command>dh_auto_build</command> sans autre option exécutera la première cible du fichier <filename>Makefile</filename>.
it: <command>dh_auto_build</command> senza alcun argomento eseguirà il primo obiettivo del file <filename>Makefile</filename>.
ja: 引数なしの<command>dh_auto_build</command>は、<filename>Makefile</filename>の最初のターゲットを実行します。

source: If <filename>Makefile</filename> of a source for <systemitem role="package">gentoo</systemitem> requires you to specify <literal>build</literal> as its target to build it <placeholder type="footnote" id="0"/>, you create an <literal>override_dh_auto_build</literal> target to enable it.
ca: Si el <filename>Makefile</filename> de les fonts de <systemitem role="package">gentoo</systemitem> requereix l'especificació de l'objectiu <literal>build</literal> per a la compilació <placeholder type="footnote" id="0"/>, pots afegir un objectiu <literal>override_dh_auto_build</literal> per tal d'﻿anul·lar-lo.
es: Si el <filename>Makefile</filename> de las fuentes de <systemitem role="package">gentoo</systemitem> requiere la especificación del objetivo <literal>build</literal> para compilarlo <placeholder type="footnote" id="0"/>, puedes añadir un objetivo <literal>override_dh_auto_build</literal> para anularlo.
fr: Si le <filename>Makefile</filename> des sources de <systemitem role="package">gentoo</systemitem> nécessite de préciser <literal>build</literal> comme cible pour la construction <placeholder type="footnote" id="0"/>, vous pouvez créer une cible <literal>override_dh_auto_build</literal> pour ce faire.
it: Se il <filename>Makefile</filename> del sorgente per il pacchetto <systemitem role="package">gentoo</systemitem> necessita che venga specificato l'obiettivo <literal>build</literal> per essere costruito <placeholder type="footnote" id="0"/>, basterà creare l'obiettivo <literal>override_dh_auto_build</literal> pe abilitarlo.
ja: もしも<systemitem role="package">gentoo</systemitem>のソースの<filename>Makefile</filename>が、ビルドするために、<literal>build</literal>ターゲットを必要とする場合、<placeholder type="footnote" id="0"/><literal>override_dh_auto_build</literal>ターゲットを作り、有効化しなければなりません。

source: This ensures to run $(MAKE) with all the default arguments given by the <command>dh_auto_build</command> command and <literal>build</literal> argument.
ca: D'aquest forma es garanteix l'execució de $(MAKE) amb tots els arguments predeterminats per l'ordre <command>dh_auto_build</command> i del argument <literal>build</literal>.
es: De esta forma se garantiza la ejecución de $(MAKE) con todos los argumentos predeterminados dados por la orden <command>dh_auto_build</command> y del argumento <literal>build</literal>.
fr: Ceci garanti d'exécuter $(MAKE) avec toutes les options par défaut données à la commande <command>dh_auto_build</command> avec en plus le paramètre <literal>build</literal>.
it: Questo ci assicura che $(MAKE) verrà eseguito con tutti i parametri predefiniti del comando <command>dh_auto_build</command> ed il parametro di <literal>build</literal>.
ja: $(MAKE)を、<command>dh_auto_build</command>コマンドと<literal>build</literal>コマンドにデフォルトで与えられた引数すべてを確実に実行します。

source: If <filename>Makefile</filename> of a source for <systemitem role="package">gentoo</systemitem> requires you to specify the <literal>packageclean</literal> target to clean it for Debian package instead of the <literal>distclean</literal> or <literal>clean</literal> targets in the <filename>Makefile</filename> file, you create an <literal>override_dh_auto_clean</literal> target to enable it.
ca: Si el fitxer <filename>Makefile</filename> de les fonts de <systemitem role="package">gentoo</systemitem> requereix l'especificació de l'objectiu <literal>packageclean</literal> (per fer neteja després de la compilació), en lloc dels objectius <literal>distclean</literal> o <literal>clean</literal> a l'arxiu <filename>Makefile</filename> pots afegir un objectiu <literal>override_dh_auto_clean</literal> per habilitar l'ordre.
es: Si el <filename>Makefile</filename> de las fuentes de <systemitem role="package">gentoo</systemitem> requiere la especificación del objetivo <literal>packageclean</literal> para limpiarlo, en lugar de los objetivos <literal>distclean</literal> o <literal>clean</literal> en el archivo <filename>Makefile</filename>, puedes añadir un objetivo <literal>override_dh_auto_clean</literal> para habilitarlo.
fr: Si le <filename>Makefile</filename> des sources de <systemitem role="package">gentoo</systemitem> oblige à préciser la cible <literal>packageclean</literal> pour nettoyer le paquet Debian à la place des cibles <literal>distclean</literal> ou <literal>clean</literal> dans le fichier <filename>Makefile</filename>, vous pouvez créer une cible <literal>override_dh_auto_clean</literal> pour ce faire.
ja: もし、Debianパッケージのためにソースをクリーンするのに <systemitem role="package">gentoo</systemitem> のソースの <filename>Makefile</filename> が、<filename>Makefile</filename> 中の <literal>distclean</literal> や <literal>clean</literal> ターゲットの代わりに <literal>packageclean</literal> ターゲットを指定する必要がある場合には、<literal>override_dh_auto_clean</literal> ターゲットを作るとそれが可能になります。

source: If <filename>Makefile</filename> of a source for <systemitem role="package">gentoo</systemitem> contains <literal>test</literal> target which you do not want to run for the Debian package building process, you can use empty <literal>override_dh_auto_test</literal> target to skip it.
ca: Si el fitxer <filename>Makefile</filename> de les fonts de <systemitem role="package">gentoo</systemitem> té un objectiu <literal>test</literal> i desitges que no s'executi en la construcció del paquet, pots fer servir l'objectiu <literal>override_dh_auto_test</literal> sense ordres per tal de que no es faci res.
es: Si el <filename>Makefile</filename> de las fuentes de <systemitem role="package">gentoo</systemitem> contiene un objetivo <literal>test</literal> que no deseas que se ejecute en la construcción del paquete Debian, puedes usar un objetivo <literal>override_dh_auto_test</literal> sin órdenes para ignorarlo.
fr: Si le <filename>Makefile</filename> des sources pour <systemitem role="package">gentoo</systemitem> contient une cible <literal>test</literal> dont vous ne voulez pas pour exécuter le processus de construction du paquet Debian, vous pouvez utiliser une cible <literal>override_dh_auto_test</literal> vide pour l'omettre.
it: Se il <filename>Makefile</filename> di un sorgente per il pacchetto <systemitem role="package">gentoo</systemitem> contiene l'obiettivo <literal>test</literal> che non vuole essere eseguito nel processo di costruzione del pacchetto Debian, si può utilizzare l'obiettivo <literal>override_dh_auto_test</literal> per saltarlo.
ja: もし、<systemitem role="package">gentoo</systemitem>のソースの<filename>Makefile</filename>が、<literal>test</literal>ターゲットを含み、Debianパッケージをビルドする過程で実行されたくない場合は、空の<literal>override_dh_auto_clean</literal>ターゲットを作ることで、スキップできます。

source: The <filename>debian/changelog</filename> and <filename>debian/NEWS</filename> files are always automatically installed. The upstream changelog is searched by converting filenames to the lower case and matching them with the <filename>changelog</filename>, <filename>changes</filename>, <filename>changelog.txt</filename>, and <filename>changes.txt</filename>.
ca: Els fitxers <filename>debian/changelog</filename> i <filename>debian/NEWS</filename> sempre s'instal·len automàticament. També es busca el fitxer de canvis de l'autor canviant el nom a minúscules i per la seva coincidència amb <filename>changelog</filename>, <filename>changes</filename>, <filename>changelog.txt</filename>, i <filename>changes.txt</filename>.
es: Los archivos <filename>debian/changelog</filename> y <filename>debian/NEWS</filename> siempre se instalan automáticamente. También se busca el archivo de cambios del autor para cambiar el nombre a minúsculas y por su coincidencia con <filename>changelog</filename>, <filename>changes</filename>, <filename>changelog.txt</filename>, y <filename>changes.txt</filename>.
fr: Les fichiers <filename>debian/changelog</filename> et <filename>debian/NEWS</filename> sont toujours installés automatiquement. Le journal de modification amont est cherché en convertissant les noms de fichiers en minuscule puis en vérifiant l'existence de <filename>changelog</filename>, <filename>changes</filename>, <filename>changelog.txt</filename>, et <filename>changes.txt</filename>.
it: I file <filename>debian/changelog</filename> e <filename>debian/NEWS</filename> vengono sempre installati automaticamente. Il changelog originale viene ricercato convertendo i nomi dei file in minuscolo e cercando la corrispondenza con <filename>changelog</filename>, <filename>changes</filename>, <filename>changelog.txt</filename>, e <filename>changes.txt</filename>.
ja: <filename>debian/changelog</filename> と <filename>debian/NEWS</filename> は常に自動でインストールされます。上流のチェンジログファイルは、ファイル名を小文字に変換し、<filename>changelog</filename>、<filename>changes</filename>、<filename>changelog.txt</filename>、<filename>changes.txt</filename>のいずれかと一致するものを検索します。

source: If <systemitem role="package">gentoo</systemitem> has an unusual upstream changelog file called <filename>FIXES</filename>, <command>dh_installchangelogs</command> will not install that file by default. The <command>dh_installchangelogs</command> command requires <filename>FIXES</filename> as its argument to install it. <placeholder type="footnote" id="0"/>
ca: Si el paquet <systemitem role="package">gentoo</systemitem> inclou el poc freqüent arxiu de canvis de l'autor amb el nom <filename>FIXES</filename>, <command>dh_installchangelogs</command> no en farà la instal·lació (és l'opció predeterminada). L'ordre <command>dh_installchangelogs</command> requereix l'argument <filename>FIXES</filename> per tal d'instal·lar-lo <placeholder type="footnote" id="0"/>.
es: Si <systemitem role="package">gentoo</systemitem> contiene el poco frecuente archivo de cambios del autor con el nombre <filename>FIXES</filename>, <command>dh_installchangelogs</command> no lo instalará por omisión. La orden <command>dh_installchangelogs</command> requiere como argumento <filename>FIXES</filename> para instalarlo <placeholder type="footnote" id="0"/>.
fr: Si <systemitem role="package">gentoo</systemitem> possède un fichier journal de modification inhabituel appelé <filename>FIXES</filename>, <command>dh_installchangelogs</command> ne l'installera pas par défaut. La commande <command>dh_installchangelogs</command> a besoin de <filename>FIXES</filename> en option pour l'installer. <placeholder type="footnote" id="0"/>
it: Se il programma originale <systemitem role="package">gentoo</systemitem> contiene un inusuale file di changelog chiamato <filename>FIXES</filename>, <command>dh_installchangelogs</command> non installerà questo file in modo predefinito. Il comando <command>dh_installchangelogs</command> richiede che venga fornito il parametro <filename>FIXES</filename> per installarlo.<placeholder type="footnote" id="0"/>
ja: もし、<systemitem role="package">gentoo</systemitem>パッケージに、普通ではない<filename>FIXES</filename>という上流のチェンジログファイルがある場合、 <command>dh_installchangelogs</command>はデフォルトではそのファイルをインストールしません。このファイルをインストールするには、<filename>FIXES</filename>を引数として、<command>dh_installchangelogs</command>に渡してやる必要があります。<placeholder type="footnote" id="0"/>

source: When you use the new <command>dh</command> command, use of explicit targets such as the ones listed in <xref linkend="targets"/> except <literal>get-orig-source</literal> target may make it difficult to understand their exact effects. Please limit explicit targets to <literal>override_dh_*</literal> targets and completely independent ones, if possible.
ca: Si fas sevir el nou <command>dh</command>, la utilització explícita d'objectius com els llistats a <xref linkend="targets"/> (excepte <literal>get-orig-source</literal>) pot dificultar la correcta comprensió dels seus efectes. Si us plau, limita l'ús d'objectius explícits a objectius del tipus <literal>override_dh_*</literal> i de manera que siguin completament independents entre ells (sempre que sigui possible).
es: Cuando utilizas el nuevo programa <command>dh</command>, la utilización explícita de objetivos como los listados en <xref linkend="targets"/> (excepto <literal>get-orig-source</literal>) puede dificultar la correcta comprensión de sus efectos exactos. Por favor, limita el uso de objetivos explícitos a objetivos del tipo <literal>override_dh_*</literal> y de forma que sean completamente independientes entre sí (siempre que sea posible).
fr: Lors de l'utilisation de la nouvelle commande <command>dh</command>, la compréhension des effets exacts des cibles explicites comme celles énumérées en <xref linkend="targets"/> (à part <literal>get-orig-source</literal>) peut être rendue difficile. Veuillez limiter les cibles explicites aux cibles <literal>override_dh_*</literal>, et à celle complètement indépendantes, si possible.
it: Quando si usa il nuovo comando <command>dh</command>, l'utilizzo di target espliciti come quelli elencanti in <xref linkend="targets"/> , tranne il target <literal>get-orig-source</literal>, possono rendere difficile capire i loro effettivi effetti. Si prega di limitare i target espliciti in favore dei target <literal>override_dh_*</literal> e, se possibile, quelli completamente indipendenti.
ja: この新しい<command>dh</command>コマンドを使う際には、その正確な影響が把握するのが難しい<literal>get-orig-source</literal>を除き、<xref linkend="targets"/> にあるような明確なターゲット指定をします。可能であれば、<literal>override_dh_*</literal>ターゲットおよび、完全に独立したものに明確なターゲットを制限してください。

source: Other files under the <filename>debian</filename> directory
ca: Altres fitxers del directori <filename>debian</filename>.
es: Otros ficheros en el directorio <filename>debian</filename>.
fr: Autres fichiers dans le répertoire <filename>debian</filename>
it: Altri file nella directory <filename>debian</filename>
ja: <filename>debian</filename>ディレクトリにあるその他のファイル

source: To control most of what <systemitem role="package">debhelper</systemitem> does while building the package, you put optional configuration files under the <filename>debian</filename> directory. This chapter will make an overview of what each of these does and its format. Please read <ulink url="&debian-policy;">Debian Policy Manual</ulink> and <ulink url="&developers-reference;">Debian Developer's Reference</ulink> for guidelines for the packaging.
ca: Per tal de controlar el treball de <systemitem role="package">debhelper</systemitem> en la compilació del paquet, pots afegir fitxers de configuració en el directori <filename>debian</filename>. En aquest capítol es resumeix el que pots fer amb cada un d'ells i el seu format. Consulta <ulink url="&debian-policy;">«Debian Policy Manual»</ulink> i <ulink url="&developers-reference;">«Debian Developer's Reference»</ulink> per a les directrius de construcció de paquets.
fr: Pour contrôler la plupart des actions de <systemitem role="package">debhelper</systemitem> lors de la construction du paquet, placez des fichiers de configuration optionnels dans le répertoire <filename>debian</filename>. Ce chapitre présente globalement le rôle de ces fichiers et leur format. Veuillez vous reporter à la <ulink url="&debian-policy;">Charte Debian</ulink> et à la <ulink url="&developers-reference;">référence du développeur Debian</ulink> pour les principes d'empaquetage.
it: Per controllare la maggior parte delle operazioni che <systemitem role="package">debhelper</systemitem> effettua durante la creazione del pacchetto, si possono inserire dei file di configurazione all'interno della directory <filename>debian</filename>. Questo capitolo fornirà una panoramica sull'utilizzo di ciascuno di essi ed il loro formato. Si legga <ulink url="&debian-policy;">Manuale delle policy di Debian</ulink> e <ulink url="&developers-reference;">Guida di riferimento per lo sviluppatore Debian</ulink> per le linee guida sulla creazione dei pacchetti.
ja: <systemitem role="package">debhelper</systemitem>がパッケージのビルド中に行うことをコントロールするためには、任意の設定ファイルを<filename>debian</filename>ディレクトリに置きます。この章では、それぞれの設定ファイルが何をして、どのような書式なのか、その概説をしていきます。パッケージングのガイドラインについての詳細は<ulink url="&debian-policy;">Debian Policy Manual</ulink> と <ulink url="&developers-reference;">Debian Developer's Reference</ulink> を参照してください。

source: The <command>dh_make</command> command will create some template configuration files under the <filename>debian</filename> directory. Most of them come with filenames suffixed by <literal>.ex</literal>. Some of them come with filenames prefixed by the binary package name such as <literal><replaceable>package</replaceable></literal>. Take a look at all of them.
ca: L'ordre <command>dh_make</command> construeix alguns fitxers de configuració com a plantilles i els col·loca en el directori <filename>debian</filename>. Alguns d'ells tenen el sufix <literal>.ex</literal> (de «example») en el nom. Altres tenen com a prefix (del nom) <literal><replaceable>nom_paquet</replaceable></literal> que estàs construint. Mira el contingut de tots ells.
es: La orden <command>dh_make</command> construye varios archivos de configuración a modo de plantillas y los ubica en el directorio <filename>debian</filename>. Algunos de ellos tienen el sufijo <literal>.ex</literal> (de «example») en el nombre. Otros tienen como prefijo en el nombre el nombre del paquete en la forma <literal><replaceable>nombre_del_paquete</replaceable></literal> . Mira el contenido de todos ellos.
fr: La commande <command>dh_make</command> crée quelques modèles de fichiers de configuration dans le répertoire <filename>debian</filename>. La plupart d'entre-eux ont une extension « <literal>.ex</literal> ». Certains d'entre-eux ont le nom du paquet binaire comme préfixe : <literal><replaceable>paquet</replaceable></literal>. Regardez les tous.

source: The <command>dh_make</command> command may not create some template configuration files for <systemitem role="package">debhelper</systemitem>. In such cases, you need to create them with the editor.
ca: En altres casos, <command>dh_make</command> no pot construir plantilles de configuració per a <systemitem role="package">debhelper</systemitem>. En aquests casos tu mateix escriuràs els fitxers amb un editor.
es: En otros casos, <command>dh_make</command> no puede construir plantillas de configuración para <systemitem role="package">debhelper</systemitem>. En estos casos, deberás construir tu mismo los archivos con un editor.
fr: La commande <command>dh_make</command> ne crée pas tous les modèles de fichiers de configuration pour <systemitem role="package">debhelper</systemitem>. Dans ce cas, vous devez les créer avec un éditeur.
it: Il comando <command>dh_make</command> non crea alcun modello di file di configurazione per <systemitem role="package">debhelper</systemitem>. In questo caso, è necessario crearlo con un editor.
ja: <command>dh_make</command>コマンドは、<systemitem role="package">debhelper</systemitem>用の設定ファイルを作らないことがあります。その場合、自分でエディターを使い設定ファイルを作成しなければなりません。

source: If you wish or need to activate any of those, please do the following.
ca: Si vols fer servir els fitxers generats en la construcció del paquet, fes el següent:
es: Si quieres utilizar estos archivos en la construcción de tu paquete, haz lo siguiente.
fr: Pour activer certains d'entre-eux, veuillez suivre les instructions suivantes :
it: Se si vuole o si ha bisogno di attivare alcuno di questi file, si effettuino le seguenti operazioni:
ja: 以下の手順で、設定ファイルを有効にできます。
