Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: Newer versions of this document should always be available online at <ulink url="http://www.debian.org/doc/maint-guide/">http://www.debian.org/doc/maint-guide/</ulink> and in the <systemitem role="package">maint-guide</systemitem> package.
es: Las nuevas versiones de este documento están en <ulink url="http://www.debian.org/doc/maint-guide/">http://www.debian.org/doc/maint-guide/</ulink> y en el paquete <systemitem role="package">maint-guide</systemitem>.

source: <systemitem role="package">lintian</systemitem> - this is the Debian package checker that can let you know of any common mistakes after you build the package, and explains the errors found. (see <citerefentry> <refentrytitle>lintian</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <filename>/usr/share/doc/lintian/lintian.html/index.html</filename>)
es: <systemitem role="package">lintian</systemitem> - este es el programa que comprueba los paquetes de Debian, puede indicarte muchos de los errores comunes después de construir un paquete, y explica los errores encontrados (véase <citerefentry> <refentrytitle>lintian</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <filename>/usr/share/doc/lintian/lintian.html/index.html</filename>).

source: <systemitem role="package">pbuilder</systemitem> - this package contains programs which are used for creating and maintaining <command>chroot</command> environment. Building Debian package in this <command>chroot</command> environment verifies the proper build dependency and avoid FTBFS (Fails To Build From Source) bugs. (see <citerefentry> <refentrytitle>pbuilder</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> and <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)
ca: <systemitem role="package">pbuilder</systemitem> - aquest paquet conté un conjunt de programes per construir i mantenir entorns <command>chroot</command>. Quan es construeix un paquet Debian en un entorn <command>chroot</command> es controla que les dependències són les adequades i s'eviten errors de construcció des del codi font (FTBFS, «Fails To Build From Source») (llegeix <citerefentry> <refentrytitle>pbuilder</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> i <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
es: <systemitem role="package">pbuilder</systemitem> - este paquete contiene programas para generar y mantener entornos <command>chroot</command>. Al construir paquetes Debian en estos entornos <command>chroot</command> se verifica que las dependencias son las adecuadas y se evitan fallos al construir desde el código fuente (FTBFS de «Fails To Build From Source»). Véase <citerefentry> <refentrytitle>pbuilder</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> y <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
it: <systemitem role="package">pbuilder</systemitem> - questo pacchetto contiene i programmi che vengono usati per creare e manutenere un ambiente <command>chroot</command>. Creare pacchetti Debian nell'ambiente <command>chroot</command> permette di verificare le dipendenze appropriate ed evitare bug di tipo FTBS (Fails To Build From Source, non compila da sorgente). (vedere <citerefentry> <refentrytitle>pbuilder</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> e <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)
ja: <systemitem role="package">pbuilder</systemitem> - このパッケージには <command>chroot</command> 環境の作成や保守に使用されるプログラムが含まれます。この <command>chroot</command> 環境下で Debian パッケージをビルドすることで適切なビルド依存を確認して FTBFS (Fails To Build From Source) バグを回避することができます。(詳しくは <citerefentry> <refentrytitle>pbuilder</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> と <citerefentry> <refentrytitle>pdebuild</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> 参照)

source: <systemitem role="package">debian-policy</systemitem> - the <ulink url="http://www.debian.org/doc/devel-manuals#policy">Debian Policy Manual</ulink> includes explanations of the structure and contents of the Debian archive, several OS design issues, the Filesystem Hierarchy Standard (which says where each file and directory should be) etc. For you, the most important thing is that it describes requirements that each package must satisfy to be included in the distribution (see <filename>&debian-policy;</filename>).
es: <systemitem role="package">debian-policy</systemitem> - el <ulink url="http://www.debian.org/doc/devel-manuals#policy">manual de normas de Debian</ulink> incluye la descripción de la estructura y contenidos del archivo, ciertas notas sobre el diseño del sistema operativo, el estándar de la jerarquía del sistema de ficheros («Filesystem Hierarchy Standard», que explica dónde deberían estar cada fichero y directorio), y, lo más importante para ti, describe los requisitos que debe satisfacer cada paquete para ser incluido en la distribución (véase <filename>&debian-policy;</filename>).

source: <systemitem role="package">developers-reference</systemitem> - the <ulink url="http://www.debian.org/doc/devel-manuals#devref">Debian Developer's Reference</ulink> describes all matters not specifically about the technical details of packaging, like the structure of the archive, how to rename, orphan, pick up packages, how to do NMUs, how to manage bugs, best packaging practices, when and where to upload etc. (see <filename>&developers-reference;</filename>).
es: <systemitem role="package">developers-reference</systemitem> - la <ulink url="http://www.debian.org/doc/devel-manuals#devref">referencia del desarrollador de Debian</ulink> para todos los temas no específicamente relacionados con los detalles técnicos de cómo empaquetar, tales como la estructura del archivo (o repositorio de Debian), cómo renombrar, abandonar, adoptar paquetes, cómo hacer NMUs («Non-Maintainer Uploads», o envíos por personas distintas del desarrollador), como gestionar los errores que los usuarios envían, buenas prácticas de empaquetado, cómo y cuando enviar los paquetes, etc. (véase <filename>&developers-reference;</filename>).

source: <ulink url="http://www.lrde.epita.fr/~adl/autotools.html">Autotools Tutorial</ulink> provides very good tutorial for <ulink url="http://en.wikipedia.org/wiki/GNU_build_system">the GNU Build System known as the GNU Autotools</ulink> whose most important components are Autoconf, Automake, Libtool, and gettext.
es: <ulink url="http://www.lrde.epita.fr/~adl/autotools.html">Tutorial de «Autotools»</ulink> contiene un tutorial muy bueno sobre <ulink url="http://es.wikipedia.org/wiki/GNU_build_system">el sistema de compilación GNU conocido como «GNU Autotools»</ulink> cuyos componentes más importantes son «Autoconf», «Automake», «Libtool», y «gettext»

source: <systemitem role="package">gnu-standards</systemitem> - this package contains two pieces of documentation from the GNU project: <ulink url="http://www.gnu.org/prep/standards/html_node/index.html">GNU Coding Standards</ulink>, and <ulink url="http://www.gnu.org/prep/maintain/html_node/index.html">Information for Maintainers of GNU Software</ulink>. Although Debian does not require these to be followed, these are still helpful as guidelines and common sense. (see <filename>/usr/share/doc/gnu-standards/standards.html</filename> and <filename>/usr/share/doc/gnu-standards/maintain.html</filename>).
es: <systemitem role="package">gnu-standards</systemitem> - este paquete contiene dos documentos del proyecto GNU: <ulink url="http://www.gnu.org/prep/standards/html_node/index.html">«GNU Coding Standards»</ulink>, y <ulink url="http://www.gnu.org/prep/maintain/html_node/index.html">«Information for Maintainers of GNU Software»</ulink>. Aunque no se exige su cumplimiento en Debian, son útiles como orientación y sentido común (véase <filename>/usr/share/doc/gnu-standards/standards.html</filename> y <filename>/usr/share/doc/gnu-standards/maintain.html</filename>).

source: You can not become an official <emphasis role="strong">Debian Developer</emphasis> (DD) over night because it takes more than technical skill. Please do not be discouraged by this. If it is useful to others, you can still upload your package either as a <emphasis role="strong">maintainer</emphasis> through a <emphasis role="strong">sponsor</emphasis> or as a <emphasis role="strong">Debian Maintainer</emphasis>. See <ulink url="&newmaint;">Debian New Maintainers</ulink> for more.
es: No puedes convertirte en <emphasis role="strong">desarrollador oficial de Debian</emphasis> (DD) de la noche a la mañana porque hace falta algo más que habilidades técnicas. No te sientas desilusionado por esto. Aún puedes subir tu paquete, si es útil a otras personas, como <emphasis role="strong">empaquetador</emphasis> a través de un <emphasis role="strong">patrocinador</emphasis> o un <emphasis role="strong">empaquetador de Debian</emphasis>. Encontrarás más información de este procedimiento en <ulink url="&newmaint;">el rincón del nuevo desarrollador de Debian</ulink>.

source: If you still have questions about packaging that you couldn't find answers to in the available documentation and web resources, you can ask them on the Debian Mentors' mailing list at <ulink url="http://lists.debian.org/debian-mentors/">debian-mentors@lists.debian.org</ulink>. The more experienced Debian developers will gladly help you, but do read at least some of the documentation before asking a question!
es: Si tienes dudas sobre empaquetado a las que no has podido encontrar respuesta en la documentación y en el la web, puedes preguntar en la lista de correo de Debian Mentors <ulink url="http://lists.debian.org/debian-mentors/">debian-mentors@lists.debian.org</ulink>. Los desarrolladores más experimentados de Debian, te ayudarán gustosamente, pero, por favor, ¡léete la documentación antes de preguntar!.

source: See <ulink url="http://lists.debian.org/debian-mentors/">http://lists.debian.org/debian-mentors/</ulink> for more information about this mailing list.
es: Consulta <ulink url="http://lists.debian.org/debian-mentors/">http://lists.debian.org/debian-mentors/</ulink> para más información sobre esta lista de correo.

source: When you receive a bug report (yes, actual bug reports!), you will know that it is time for you to dig into the <ulink url="http://www.debian.org/Bugs/">Debian Bug Tracking System</ulink> and read the documentation there, to be able to deal with the reports efficiently. I highly recommend reading the <ulink url="http://www.debian.org/doc/manuals/developers-reference/pkgs.html#bug-handling">Developer's Reference, 5.8. 'Handling bugs'</ulink>.
es: Cuando recibas un aviso de fallo (sí, avisos de fallos, ¡de verdad!) sabrás que es el momento de indagar en el <ulink url="http://www.debian.org/Bugs/">Sistema de seguimiento de fallos de Debian</ulink> y leer la documentación de allí para poder tratar los informes de forma eficiente. Te recomiendo la lectura de la Referencia del Desarrollador, en particular el capítulo de «<ulink url="http://www.debian.org/doc/manuals/developers-reference/pkgs.html#bug-handling">Referencia del desarrollador sección 5.8 - Manejo de fallos</ulink>» («Handling Bugs»).

source: If you still have questions, ask on the Debian Developers' mailing list at <ulink url="http://lists.debian.org/debian-devel/">debian-devel@lists.debian.org</ulink>. See <ulink url="http://lists.debian.org/debian-devel/">http://lists.debian.org/debian-devel/</ulink> for more information about this mailing list.
es: Si aún tienes preguntas, házlas en la lista de distribución de Desarrolladores de Debian en <ulink url="http://lists.debian.org/debian-devel/">debian-devel@lists.debian.org</ulink>. Véase <ulink url="http://lists.debian.org/debian-devel/">http://lists.debian.org/debian-devel/</ulink> para más información sobre esta lista de correo.

source: You can also check package information through <ulink url="http://www.debian.org/distrib/packages">package search page</ulink> and <ulink url="http://packages.qa.debian.org/common/index.html">Debian Package Tracking System</ulink>.
es: También debes consultar la <ulink url="http://www.debian.org/distrib/packages">página de búsqueda de paquetes</ulink> y en el <ulink url="http://packages.qa.debian.org/common/index.html">Sistema de seguimiento de paquetes de Debian</ulink>.

source: If the package already exists, well, install it! :-) If it happens to be <emphasis role="strong">orphaned</emphasis> -- if its maintainer is set to <ulink url="http://qa.debian.org/">Debian QA Group</ulink>, you may be able to pick it up if it's still available (check the ownership status at <ulink url="http://bugs.debian.org/wnpp">Debian Bug report logs: Bugs in package wnpp in unstable</ulink>). You may also adopt a package for which the corresponding maintainer has filed a Request for Adoption (<emphasis role="strong">RFA</emphasis>).
es: Si el paquete ya existe, ¡instálalo! :-) Si te encuentras con que el paquete es un paquete <emphasis role="strong">huérfano</emphasis> (cuando su desarrollador es el <ulink url="http://qa.debian.org/">Debian QA Group</ulink>, es decir, el grupo de calidad de Debian), puedes adoptarlo (convertirte en el responsable de empaquetarlo y mantenerlo) si está disponible, comprueba si realmente está disponible en <ulink url="http://bugs.debian.org/wnpp">«Debian Bug report logs»: Errores en el paquete «wnpp» en la distribución de trabajo («inestable» o «sid»)</ulink>. También puedes adoptar un paquete para el cual se ha emitido una «solicitud de adopción» (Request for Adoption o <emphasis role="strong">RFA</emphasis>) por su desarrollador o por un DD.

source: joining <ulink url="http://wiki.debian.org/Teams">packaging teams</ulink>
es: consultando <ulink url="http://wiki.debian.org/Teams">equipos de desarrolladores</ulink>.

source: preparing <ulink url="http://www.debian.org/doc/developers-reference/pkgs.html#nmu-qa-upload">QA or NMU uploads</ulink>
es: preparando <ulink url="http://www.debian.org/doc/developers-reference/pkgs.html#nmu-qa-upload">paquetes QA o NMU</ulink>

source: You must check if no one else is working on the package already at <ulink url="http://www.de.debian.org/devel/wnpp/being_packaged">the list of packages being worked on</ulink>. If no one else is working on it, file an ITP (Intent To Package) bug report to the <systemitem role="package">wnpp</systemitem> pseudo-package using <command>reportbug</command>. If someone's already on it, contact them if you feel you need to. If not - find another interesting program that nobody maintains.
es: Comprueba que no hay nadie más trabajando ya en el paquete consultando <ulink url="http://www.de.debian.org/devel/wnpp/being_packaged">la lista de paquetes en los que se está trabajando</ulink>. Si nadie está ya trabajando en el empaquetado del programa, envía un informe de error de tipo ITP («Intent To Package», Intento de empaquetado) al meta-paquete <systemitem role="package">wnpp</systemitem> utilizando el programa de comunicación de errores <command>reportbug</command> (accesible en el menú de herramientas del sistema). Si ya hay alguien trabajando en él, contacta con esa persona: es posible que podáis colaborar. En caso contrario, intenta encontrar otro programa interesante que nadie mantenga.

source: For the <literal>main</literal> section, it <emphasis role="strong">must be compliant to all the Debian Free Software Guidelines (DFSG)</emphasis> (see <ulink url="http://www.debian.org/social_contract#guidelines">http://www.debian.org/social_contract#guidelines</ulink>) and <emphasis role="strong">that program must not require a package outside of <literal>main</literal></emphasis> for compilation or execution as required by the Debian Policy. This is desired case.
es: Si el paquete debe pertenecer a la sección <literal>main</literal> el programa <emphasis role="strong">debe cumplir con las Directrices de Debian para el software (DFSG)</emphasis> libre (véase <ulink url="http://www.debian.org/social_contract.html#guidelines">http://www.debian.org/social_contract.html#guidelines</ulink>) y <emphasis role="strong">no debe precisar la instalación de otro paquete que no pertenezca a la sección <literal>main</literal></emphasis> para su compilación o ejecución como requiere la directiva de Debian («Debian Policy»).

source: If you are unsure about where it should go, post the license text on <ulink url="http://lists.debian.org/debian-legal/">debian-legal@lists.debian.org</ulink> and ask for advice.
es: Si no estás seguro sobre en qué lugar debería ir, envía el texto de la licencia y pide consejo con un correo (en inglés) dirigido a <ulink url="http://lists.debian.org/debian-legal/">debian-legal@lists.debian.org</ulink>.

source: Of course, these things are just safety measures, and intended to save you from raging users if you do something wrong in some setuid daemon... When you gain some more experience in packaging, you'll be able to do such packages, but even the experienced developers consult the <ulink url="http://lists.debian.org/debian-mentors/">debian-mentors@lists.debian.org</ulink> mailing list when they are in doubt. And people there will gladly help.
es: Por supuesto, esta lista son sólo medidas de seguridad, y con la intención de salvarte de usuarios enfurecidos si haces algo mal con algún demonio «setuid»... Cuando tengas más experiencia en empaquetar, podrás hacer este tipo de paquetes: incluso los desarrolladores más experimentados hacen consultas en la lista de correo <ulink url="http://lists.debian.org/debian-mentors/">debian-mentors@lists.debian.org</ulink> cuando tienen dudas. La gente te ayudará gustosamente.

source: For more help about these, check in <ulink url="http://www.debian.org/doc/devel-manuals#devref">Debian Developer's Reference</ulink>.
es: Para más ayuda sobre el tema, lee la <ulink url="http://www.debian.org/doc/devel-manuals#devref">Referencia del desarrollador</ulink>.

source: A lot of Free programs are written in the <ulink url="http://en.wikipedia.org/wiki/C_(programming_language)">C</ulink> and <ulink url="http://en.wikipedia.org/wiki/C++">C++</ulink> languages. Many of these use Autotools or CMake to make them portable across different platforms. These tools are used to generate <filename>Makefile</filename> and other required source files. Then, such programs are built with usual <literal>make; make install</literal>.
es: Buena parte de los programas libres están escritos en lenguaje <ulink url="http://es.wikipedia.org/wiki/C_%28lenguaje_de_programaci%C3%B3n%29">C</ulink> y <ulink url="http://es.wikipedia.org/wiki/C%2B%2B">C++</ulink>. Muchos utilizan las «Autotools» y «CMake» para compilar en diferentes plataformas. Estas herramientas se utilizan para generar un archivo <filename>Makefile</filename> y otros archivos necesarios para la compilación. Así, muchos programas se compilan ejecutando «<literal>make; make install</literal>».

source: See <ulink url="http://www.lrde.epita.fr/~adl/autotools.html">Autotools Tutorial</ulink> and <filename>&autotools-dev;</filename>.
es: Véase <ulink url="http://www.lrde.epita.fr/~adl/autotools.html">Autotools Tutorial</ulink> y <filename>&autotools-dev;</filename>.

source: <ulink url="http://en.wikipedia.org/wiki/GNU_build_system">Autotools</ulink> are the GNU build system comprising <ulink url="http://en.wikipedia.org/wiki/Autoconf">Autoconf</ulink>, <ulink url="http://en.wikipedia.org/wiki/Automake">Automake</ulink>, <ulink url="http://en.wikipedia.org/wiki/GNU_Libtool">Libtool</ulink>, and <ulink url="http://en.wikipedia.org/wiki/GNU_gettext">gettext</ulink>. You can notice such sources by the <filename>configure.ac</filename>, <filename>Makefile.am</filename>, and <filename>Makefile.in</filename> files. <placeholder type="footnote" id="0"/>
es: <ulink url="http://es.wikipedia.org/wiki/Autotools">Las Autotools</ulink> son el sistema de compilación GNU e incluyen <ulink url="http://es.wikipedia.org/wiki/Autoconf">Autoconf</ulink>, <ulink url="http://es.wikipedia.org/wiki/Automake">Automake</ulink>, <ulink url="http://es.wikipedia.org/wiki/GNU_Libtool">Libtool</ulink> y <ulink url="http://es.wikipedia.org/wiki/Gettext">gettext</ulink>. Confirmarás que el programa utiliza las autoools por la presencia de los archivos <filename>configure.ac</filename>, <filename>Makefile.am</filename>, y <filename>Makefile.in</filename> <placeholder type="footnote" id="0"/>.

source: <ulink url="http://en.wikipedia.org/wiki/CMake">CMake</ulink> is an alternative build system. You can notice such sources by the <filename>CMakeLists.txt</filename> file.
es: <ulink url="http://es.wikipedia.org/wiki/Cmake">CMake</ulink> es un sistema de compilación alternativo. La presencia del archivo <filename>CMakeLists.txt</filename> te indicará que se utiliza esta opción para compilar el programa.

source: $ . ~/.bashrc $ cd ~/gentoo/gentoo-0.9.12 $ dh_make -f ../gentoo-0.9.12.tar.gz
es: $ cd ~/gentoo/gentoo-0.9.12 $ dh_make -f ../gentoo-0.9.12.tar.gz

source: There is the <filename>.orig</filename> before the <filename>.tar.gz</filename>.
ca: S'ha afegit <filename>.orig</filename> abans de l'extensió <filename>.tar.gz</filename>.
es: Hay un <filename>.orig</filename> antes de <filename>.tar.gz</filename>.
it: C'è <filename>.orig</filename> prima di <filename>.tar.gz</filename>.

source: Set up <command>quilt</command>
ca: Fent servir <command>quilt</command>.
es: Configurar <command>quilt</command>
it: Configurare <command>quilt</command>

source: Normally, programs install themselves in the <filename>/usr/local</filename> subdirectory. Since it is reserved for system administrator's (or user's) private use, Debian packages must not use that directory but should use system directories such as the <filename>/usr/bin</filename> subdirectory following the Filesystem Hierarchy Standard (<ulink url="http://www.debian.org/doc/packaging-manuals/fhs/fhs-2.3.html">FHS</ulink>, <filename>/usr/share/doc/debian-policy/fhs/fhs-2.3.html</filename>).
es: Por lo general, los programas se instalan a sí mismos en el subdirectorio <filename>/usr/local</filename>. Pero los paquetes Debian no pueden utilizar este directorio ya que está reservado para el uso privado del administrador (o de los usuarios) sino que deben utilizar los directorios del sistema como <filename>/usr/bin</filename> según lo establecido por la normativa de jerarquía del sistema de archivos («Filesystem Hierarchy Standard» <ulink url="http://www.debian.org/doc/packaging-manuals/fhs/fhs-2.3.html">FHS</ulink>, <filename>/usr/share/doc/debian-policy/fhs/fhs-2.3.html</filename>).

source: This file contains various values which <command>dpkg</command>, <command>dselect</command>, <command>apt-get</command>, <command>apt-cache</command>, <command>aptitude</command>, and other package management tools will use to manage the package. It is defined by the <ulink url="http://www.debian.org/doc/debian-policy/ch-controlfields.html">Debian Policy Manual, 5 'Control files and their fields'</ulink>.
es: Este fichero contiene varios valores que <command>dpkg</command>, <command>dselect</command>, <command>apt-get</command>, <command>apt-cache</command>, <command>aptitude</command> y otras herramientas de gestión de paquetes usarán para gestionar el paquete. Su contenido está concretado en <ulink url="http://www.debian.org/doc/debian-policy/ch-controlfields.html">Debian Policy Manual, 5 'Control files and their fields'</ulink>.
