Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: The <literal>title</literal> field is the name of the program. You can start this one in uppercase if you like. Just keep it short.
ca: El camp <literal>title</literal> és el nom del programa (o millor el text que apareixerà en el menú). Pots començar el nom en majúscules si vols, però és convenient fer-ho curt.
es: El campo <literal>title</literal> es el nombre del programa. Puedes comenzar éste en mayúsculas si así lo prefieres, pero hazlo lo más corto que puedas.
fr: Le champ <literal>title</literal> est le nom du programme. Vous pouvez le commencer par une majuscule si vous le souhaitez. Mais gardez-le court.
it: Il campo <literal>title</literal> indica il nome del programma. Se si vuole si può scrivere in maiuscolo. Basta che si mantenga corto.
ja: <literal>title</literal>フィールドはプログラムの名称です。そうしたければ、大文字ではじめても大丈夫です。ただ、短くするようにしましょう。

source: Finally, the <literal>command</literal> field is the command that runs the program.
ca: El camp <literal>command</literal> és l'ordre que executa el programa.
es: Finalmente, el campo <literal>command</literal> es la orden que ejecuta el programa.
fr: Enfin, le champ <literal>command</literal> est la commande qui exécute le programme.
it: Infine, il campo <literal>command</literal> indica il comando che manda in esecuzione il programma.
ja: 最後の <literal>command</literal> フィールドは、実際にプログラムを実行するコマンドです。

source: Let's change the file name to <filename>menu</filename> and change the menu entry to this:
es: Vamos a cambiar el nombre del archivo a <filename>menu</filename> y la entrada del menú por ésta:
fr: Une fois le fichier renommé en <filename>menu</filename>, l'entrée de menu peut être modifiée comme ceci :
it: Si può quindi cambiare il file <filename>menu</filename> e la voce del menu nel modo seguente:
ja: それでは、ファイル名を<filename>menu</filename>に変更し、メニューのエントリーを以下のように変更しましょう。

source: You can also add other fields like <literal>longtitle</literal>, <literal>icon</literal>, <literal>hints</literal> etc. See <citerefentry> <refentrytitle>dh_installmenu</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>menufile</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>update-menus</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> and <filename>/usr/share/doc/debian-policy/menu-policy.html/</filename> for more information.
es: También puedes añadir otros campos como son <literal>longtitle</literal> (título largo), <literal>icon</literal> (icono), <literal>hints</literal> (pistas), etc. Para más información consulta <citerefentry> <refentrytitle>dh_installmenu</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>menufile</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>update-menus</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> y <filename>/usr/share/doc/debian-policy/menu-policy.html/</filename>.
fr: Vous pouvez aussi ajouter d'autres champs comme <literal>longtitle</literal>, <literal>icon</literal>, <literal>hints</literal>, etc. Voir <citerefentry> <refentrytitle>dh_installmenu</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>menufile</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>update-menus</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> et <filename>/usr/share/doc/debian-policy/menu-policy.html/</filename> pour plus d'informations.

source: <filename>NEWS</filename> file
ca: Fitxer <filename>NEWS</filename>.
es: Archivo <filename>NEWS</filename>
fr: Fichier <filename>NEWS</filename>
it: Il file <filename>NEWS</filename>
ja: <filename>NEWS</filename> ファイル

source: The <citerefentry> <refentrytitle>dh_installchangelogs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> command installs this.
ca: L'ordre <citerefentry> <refentrytitle>dh_installchangelogs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> instal·la aquest arxiu.
es: La orden <citerefentry> <refentrytitle>dh_installchangelogs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> instala este archivo.
fr: La commande <citerefentry> <refentrytitle>dh_installchangelogs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> l'installe.
it: Il comando <citerefentry> <refentrytitle>dh_installchangelogs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> installa questo file.
ja: <citerefentry> <refentrytitle>dh_installchangelogs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>コマンドでインストールします。

source: <filename>{post|pre}{inst|rm}</filename> files
ca: Fitxers <filename>{post|pre}{inst|rm}</filename>
es: Archivos <filename>{post|pre}{inst|rm}</filename>
fr: Fichier <filename>{post|pre}{inst|rm}</filename>
it: I file <filename>{post|pre}{inst|rm}</filename>
ja: <filename>{post|pre}{inst|rm}</filename> ファイル

source: Although I used Bash short hand expression to indicate these files as <filename>{post|pre}{inst|rm}</filename> here, I recommend you to use pure POSIX (non-Bash) shell for these <emphasis>maintainer scripts</emphasis> as much as possible for the better compatibility.
fr: Même s'ils ont été présentés par un raccourci Bash « <filename>{post|pre}{inst|rm}</filename> », il est préférable d'utiliser un shell pur POSIX (non Bash) pour ces <emphasis>scripts du responsable</emphasis> pour des raisons de compatibilité.
it: Anche se è stata utilizzata una corta espressione Bash per indicare questi file come <filename>{post|pre}{inst|rm}</filename> , si raccomanda di utilizzare una shell POSIX (non Bash) per questi <emphasis>script del manutentore</emphasis> il più possibile per massimizzare la compatibilità.
ja: ここでは簡略化するために<filename>{postpre}{instrm}</filename>にBashを使っていますが、<emphasis>maintainer scripts</emphasis>には、互換性の観点から、可能な限りPOSIX（Bashではない）シェルを使うべきでしょう。

source: These <filename>postinst</filename>, <filename>preinst</filename>, <filename>postrm</filename>, and <filename>prerm</filename> files <placeholder type="footnote" id="0"/> are called <emphasis>maintainer scripts</emphasis>. They are scripts which are put in the control area of the package and run by <command>dpkg</command> when your package is installed, upgraded or removed.
fr: Ces fichiers <filename>postinst</filename>, <filename>preinst</filename>, <filename>postrm</filename>, et <filename>prerm</filename> <placeholder type="footnote" id="0"/> sont nommés <emphasis>scripts du responsable</emphasis>. Ces scripts sont placés dans la zone de contrôle du paquet et sont exécutés par <command>dpkg</command> lorsque le paquet est installé, mis à jour ou supprimé.
it: I files <filename>postinst</filename>, <filename>preinst</filename>, <filename>postrm</filename> e <filename>prerm</filename> <placeholder type="footnote" id="0"/> vengono chiamati <emphasis>script del manutentore</emphasis>. Questi sono script che vengono messi nell'area di controllo del pacchetto e vengono lanciati dal comando <command>dpkg</command> quando il pacchetto viene installato, aggiornato o rimosso.
ja: <filename>postinst</filename>、<filename>preinst</filename>、<filename>postrm</filename>、そして <filename>prerm</filename>ファイルは <placeholder type="footnote" id="0"/><emphasis>maintainer scripts</emphasis>と呼ばれています。これらのスクリプトは、パッケージを管理するアリアに置かれ、インストール、アップグレード、削除される際に<command>dpkg</command>によって実行されます。

source: As a novice maintainer, you should avoid any manual editing of <emphasis>maintainer scripts</emphasis> because they are problematic. For more information look in the <ulink url="&policy-mantainerscripts;">Debian Policy Manual, 6 'Package maintainer scripts and installation procedure'</ulink>, and take a look at these example files provided by <command>dh_make</command>.
ca: Hauries d'evitar editar manualment els <emphasis>guions del desenvolupador</emphasis> degut a la seva complexitat. Consulta <ulink url="&policy-mantainerscripts;">«Debian Policy Manual, 6 'Package maintainer scripts and installation procedure'»</ulink>, i examina els exemples contruïts per <command>dh_make</command>.
fr: En tant que responsable débutant, vous devriez éviter de modifier manuellement les <emphasis>scripts du responsable</emphasis> parce qu'ils ont tendance à être complexes. Pour plus d'informations, regardez dans la <ulink url="&policy-mantainerscripts;">Charte Debian, chapitre 6 « scripts du responsable et procédure d'installation »</ulink>, et examinez les fichiers d'exemple fournis par <command>dh_make</command>.
it: Un nuovo manutentore dovrebbe, se possibile, evitare ogni modifica manuale degli <emphasis>script del manutentore</emphasis> perché potrebbero creare dei problemi. Per maggiori informazioni si guardi nel <ulink url="&policy-mantainerscripts;">Manuale delle policy di Debian, 6 'Script di manutenzione del pacchetto e procedure di installazione'</ulink>, e si dia un'occhiata ai file di esempio forniti da <command>dh_make</command>.
ja: メンテナ初心者のうちは、問題になることが多いので<emphasis>maintainer scripts</emphasis>を直接編集しないようにしましょう。詳しくは<ulink url="&policy-mantainerscripts;">Debian Policy Manual, 6 'Package maintainer scripts and installation procedure'</ulink>を参照し、<command>dh_make</command>によって生成されるサンプルファイルに目を通してください。

source: If you did not listen to me and made your custom <emphasis>maintainer scripts</emphasis> for a package, you should make sure to test them not only for <emphasis role="strong">install</emphasis> and <emphasis role="strong">upgrade</emphasis> but also for <emphasis role="strong">remove</emphasis> and <emphasis role="strong">purge</emphasis>.
ca: Si malgrat les meves advertències, adaptes els <emphasis>guions del desenvolupador</emphasis> per al teu paquet, comprova el seu funcionament en la <emphasis role="strong">instal·lació</emphasis>, <emphasis role="strong">actualització</emphasis>, <emphasis role="strong">desinstal·lació</emphasis> i <emphasis role="strong">eliminació completa</emphasis>.
es: Si a pesar de mis advertencias, adaptas los <emphasis>guiones del desarrollador</emphasis> para el paquete, asegúrate de comprobar su funcionamiento no sólo para la <emphasis role="strong">instalación</emphasis> y <emphasis role="strong">actualización</emphasis> del paquete, sino también para su <emphasis role="strong">desinstalación</emphasis> y <emphasis role="strong">eliminación completa</emphasis>.
fr: Si vous préférez n'en faire qu'à votre tête en personnalisant vos <emphasis>scripts du responsable</emphasis> pour un paquet, vous devriez les essayer non seulement lors de l'<emphasis role="strong">installation</emphasis> et la <emphasis role="strong">mise à jour</emphasis>, mais aussi pour la <emphasis role="strong">désinstallation</emphasis> et la <emphasis role="strong">purge</emphasis>.
it: Se non si è data retta e si sono creati dei <emphasis>script del manutentore</emphasis> personalizzati per un pacchetto, bisogna essere sicuri di averli provati non solo per <emphasis role="strong">install</emphasis> e <emphasis role="strong">upgrade</emphasis>, ma anche per <emphasis role="strong">remove</emphasis> e <emphasis role="strong">purge</emphasis>.
ja: もし私の忠告を無視して、<emphasis>maintainer scripts</emphasis>を直接編集した場合は、 <emphasis role="strong">インストール</emphasis>、<emphasis role="strong">アップグレード</emphasis>だけでなく、 <emphasis role="strong">削除</emphasis>と<emphasis role="strong">パージ</emphasis>のテストもしっかり行ってください。

source: Upgrades to the new version should be silent and non-intrusive (existing users should not notice the upgrade except by discovering that old bugs have been fixed and there perhaps are new features).
ca: Les actualitzacions a una nova versió cal que siguin «silencioses» i no intrusives (els usuaris només haurien de veure que s'han arreglat els errors i afegit noves funcions).
es: Las actualizaciones a una nueva versión deben ser «silenciosas» y no intrusivas. Los usuarios no deberían darse cuenta de la actualización, salvo quizás para descubrir que se han arreglado errores antiguos y porque hay alguna nueva funcionalidad.
fr: Les mises à jour devraient être silencieuses et non intrusives (les utilisateurs existants ne devraient pas remarquer la mise à jour à part en constatant la résolution de vieux bogues et peut-être l'arrivée de nouvelles fonctionnalités).
it: Gli aggiornamenti alle nuove versioni dovrebbero essere indolore e non invadenti (gli utenti esistenti non dovrebbero notare gli aggiornamenti a meno di scoprire che vecchi bug sono stati corretti e che vi sono magari delle nuove funzionalità).
ja: 新バージョンへのアップグレードはおとなしく、そして押し付けがましくしてはいけません。（現行のユーザは、バグが直されたことと新機能の追加以外については、アップグレードに気づかないのが理想です。)

source: The <systemitem role="package">ucf</systemitem> package provides <emphasis>conffile-like</emphasis> handling infrastructure to preserve user changes for files that may not be labeled <emphasis>conffiles</emphasis> such as ones managed by the <emphasis>maintainer scripts</emphasis>. This should minimize issues associated with them.
ca: El paquet <systemitem role="package">ucf</systemitem> facilita el sistema <emphasis>conffile-like</emphasis> per preservar els canvis de configuració realitzats per l'usuari i per això no han de nomenar-se com <emphasis>conffiles</emphasis> els fitxers gestionats pels <emphasis>guions del desenvolupador</emphasis>. Així es minimitzen les incidències associades amb ells.
es: El paquete <systemitem role="package">ucf</systemitem> facilita el sistema <emphasis>conffile-like</emphasis> para preservar los cambios de configuración realizados por el usuario y por ello no deben nombrarse como <emphasis>conffiles</emphasis> los archivos manejados por los <emphasis>guiones del desarrollador</emphasis>. Así se minimizan las incidencias asociadas con ellos.
fr: Le paquet <systemitem role="package">ucf</systemitem> fournit un dispositif <emphasis>à la conffile</emphasis> pour conserver les modifications des utilisateurs pour les fichiers qui n'ont pas été marqués <emphasis>conffiles</emphasis> comme ceux gérés par les <emphasis>scripts du responsable</emphasis>. Cela permet de réduire les problèmes associés à ces fichiers.
it: Il pacchetto <systemitem role="package">ucf</systemitem> fornisce una infrastruttura di gestione <emphasis>simil-conffile</emphasis> per preservare cambiamenti effettuati dall'utente in file che non possono essere etichettati come <emphasis>conffile</emphasis>, come ad esempio quelli gestiti dagli <emphasis>script del manutentore</emphasis>. Questo dovrebbe ridurre al minimo i problemi ad esso associati.
ja: <systemitem role="package">ucf</systemitem>パッケージは、<emphasis>maintainer scripts</emphasis>によって管理されているような<emphasis>conffiles</emphasis>にされていない、ユーザによって変更されたファイルを保存し、<emphasis>conffileのように</emphasis>処理する仕組みを提供します。この仕組みによって、関連する問題を最小化しています。

source: These <emphasis>maintainer scripts</emphasis> are the Debian enhancements that explain <emphasis role="strong">why people choose Debian</emphasis>. You must be very careful not to annoy them with these.
ca: Aquests <emphasis>guions del desenvolupador</emphasis> són un exemple de les característiques de Debian que expliquen <emphasis role="strong">perquè la gent elegeix Debian</emphasis>. Has de ser acurat amb no molestar amb ells.
es: Estos <emphasis>guiones del desarrollador</emphasis> son un ejemplo de las características de Debian que explican <emphasis role="strong">por qué la gente elige Debian</emphasis>. Debes ser cuidadoso con no molestarles con ellos.
fr: Ces <emphasis>scripts du responsable</emphasis> sont des améliorations Debian qui expliquent <emphasis role="strong">pourquoi les gens choisissent Debian</emphasis>. Prenez garde de ne pas les ennuyer avec ces scripts.
it: Questi <emphasis>script del manutentore</emphasis> sono delle migliorie di Debian che fanno capire <emphasis role="strong">come mai le persone scelgano Debian</emphasis>. Bisogna stare molo attenti a non infastidirle a causa loro.
ja: これら、<emphasis>maintainer scripts</emphasis>は<emphasis role="strong">なぜDebianを選ぶのか</emphasis>という理由の１つでもあります。これらの仕組みで、ユーザの邪魔をしないようにしましょう。

source: <filename>TODO</filename> file
ca: Fitxer <filename>TODO</filename>.
es: Archivo <filename>TODO</filename>
fr: Fichier <filename>TODO</filename>
it: Il file <filename>TODO</filename>
ja: <filename>TODO</filename> ファイル

source: The <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> command installs this.
ca: L'ordre <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> instal·la aquest arxiu.
es: La orden <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> instala este archivo.
fr: La commande <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> l'installe.
it: Il comando <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> installa questo file.
ja: <citerefentry> <refentrytitle>dh_installdocs</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>コマンドでインストールします。

source: <filename>watch</filename> file
ca: Fitxer <filename>watch.ex</filename>.
es: Archivo <filename>watch.ex</filename>
fr: Fichier <filename>watch</filename>
it: Il file <filename>watch</filename>
ja: <filename>watch</filename> ファイル

source: The <filename>watch</filename> file format is documented in the <citerefentry> <refentrytitle>uscan</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> manpage. The <filename>watch</filename> file configures the <command>uscan</command> program (in the <systemitem role="package">devscripts</systemitem> package) to watch the site where you originally got the source from. This is also used by <ulink url="&dehs;">Debian External Health Status (DEHS)</ulink>.
ca: El format del fitxer <filename>watch</filename> està documentat en la pàgina de manual de <citerefentry> <refentrytitle>uscan</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. El fitxer <filename>watch</filename> es fa servir per configurar el programa <command>uscan</command> (del paquet <systemitem role="package">devscripts</systemitem>) que vigila el servidor on està el codi font original. També ho fa servir <ulink url="&dehs;">«Debian External Health Status (DEHS)»</ulink>.
fr: Le format du fichier <filename>watch</filename> est documenté dans la page de manuel <citerefentry> <refentrytitle>uscan</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Le fichier <filename>watch</filename> configure le programme <command>uscan</command> (dans le paquet <systemitem role="package">devscripts</systemitem>) pour surveiller le site sur lequel vous avez obtenu les sources. C'est également utilisé par l'<ulink url="&dehs;">état de santé exterieur à Debian ou « Debian External Health Status » (DEHS)</ulink>.
ja: <filename>watch</filename>ファイルの書式は<citerefentry> <refentrytitle>uscan</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>を参照してください。<filename>watch</filename>ファイルは、<command>uscan</command> ( <systemitem role="package">devscripts</systemitem>パッケージに含まれます)を設定し、ソースをどこから入手したのかを監視しています。<ulink url="&dehs;">Debian External Health Status (DEHS)</ulink>によっても使用されています。

source: Here's what I put in it:
ca: Això he escrit jo:
es: Esto es lo que he puesto yo:
fr: Voici ce qu'il contient ici :
it: Questo è ciò che si può mettere al suo interno:
ja: 今回は以下のようにしました。

source: Normally with this <filename>watch</filename> file, the URL at <literal>&sf-net;/gentoo</literal> is downloaded and searched for links of the form <literal>&lt;a href=...&gt;</literal>. The base name (just the part after the final <literal>/</literal>) of these linked URLs are matched against Perl regexp (see <citerefentry> <refentrytitle>perlre</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) pattern <literal>gentoo-(.+)\.tar\.gz</literal>. Out of matched files, the file with the greatest version number is downloaded and the <command>uupdate</command> program is run to create the updated source tree from them.
fr: Normalement, avec ce fichier <filename>watch</filename>, la page servie à l'URL « <literal>&sf-net;/gentoo</literal> » est téléchargée pour chercher des liens sous la forme « <literal>&lt;a href=...&gt;</literal> ». Ces liens sont comparés au nom de base (juste après la dernière « <literal>/</literal> ») « <literal>gentoo-(.+)\.tar\.gz</literal> » comme motif d'expression rationnelle Perl (cf. <citerefentry> <refentrytitle>perlre</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>). Parmi les fichiers concordants, celui avec le plus grand numéro de version est téléchargé puis le programme <command>uupdate</command> est exécuté pour créer une arborescence source mise à jour à partir de ce fichier.

source: Although this is true for other sites, the SourceForge download service at <ulink url="&sf-net;">&sf-net;</ulink> is an exception. When the <filename>watch</filename> file has an URL matching with the Perl regexp <literal>^http://sf\.net/</literal>, the <command>uscan</command> program substitutes it with <literal>&qa-do;watch/sf.php/</literal> and then applies this rule. The URL redirector service at this <ulink url="&qa-do;">&qa-do;</ulink> is designed to offer a stable redirect service to the desired file for the <filename>watch</filename> file having <literal>&sf-net;/<replaceable>project</replaceable>/<replaceable>tar-name</replaceable>-(.+)\.tar\.gz</literal>. This solves issues related to the periodically changing URL there.
fr: Bien que ce soit vrai pour les autres sites, le service de téléchargement de SourceForge en <ulink url="&sf-net;">&sf-net;</ulink> est une exception. Quand le fichier <filename>watch</filename> comporte une URL concordant avec le motif d'expression rationnelle « <literal>^http://sf\.net/</literal> », le programme <command>uscan</command> le remplace par « <literal>&qa-do;watch/sf.php/</literal> » et applique ensuite cette règle. Le service de redirection en <ulink url="&qa-do;">&qa-do;</ulink> est conçu pour offrir un service stable vers le fichier voulu pour un fichier <filename>watch</filename> avec « <literal>&sf-net;/<replaceable>projet</replaceable>/<replaceable>nom-d-archive</replaceable>-(.+)\.tar\.gz</literal> ». Le but est de résoudre le problème lié au fréquent changement d'URL pour ce domaine.

source: <filename>source/format</filename> file
ca: Fitxer <filename>source/format</filename>.
es: Archivo <filename>source/format</filename>
fr: Fichier <filename>source/format</filename>
it: Il file <filename>source/format</filename>
ja: <filename>source/format</filename> ファイル
