Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: Your program(s) should have a manual page. If they don't, you should create them. The <command>dh_make</command> command creates few template files for a manual page. These need to be copied and edited for each command without its manual page. Please make sure to remove unused templates.
ca: Cal que el programa tengui una pàgina de manual. Si l'autor original no l'ha fet, l'hauràs de fer tu. L'ordre <command>dh_make</command> construeix alguns fitxers de plantilla per a les pàgines de manual. Caldrà editar-los i emplenar-los. Comprova que elimines els fitxers que no fas servir.
es: El/los programa/s debería/n tener una página de manual. Tendrás que escribirla si no existe. La orden <command>dh_make</command> construye varios archivos de plantilla para las páginas de manual. Deberás copiarlos y editarlos para cada programa que no tenga página de manual. Asegúrate de eliminar los que no utilices.
fr: Le programme devrait être livré avec une page de manuel. Sinon, vous devriez en créer au moins une. La commande <command>dh_make</command> crée quelques modèles de fichiers pour page de manuel. Ils doivent être copiés et modifiés pour chaque commande sans page de manuel. Assurez-vous d'avoir effacé les modèles non utilisés.
it: I programmi creati dovrebbero avere una pagina di manuale. In caso contrario bisogna crearlo. Il comando <command>dh_make</command> crea diversi file modello per la pagina di manuale. Questi devono essere copiati e modificati per ogni comando senza pagina di manuale. Si faccia attenzione a rimuovere i file modello non utilizzati.
ja: プログラムはマニュアルページが必ず必要ですもしなければ、作らなければなりません。<command>dh_make</command>コマンドはマニュアルページの雛形を作成します。マニュアルページがないコマンドのために、コピー、編集する必要があります。不要な雛形ファイルを削除するのを忘れないようにしてください。

source: <filename>manpage.1.ex</filename> file
ca: Fitxers <filename>manpage.1.ex</filename>
es: Archivo <filename>manpage.1.ex</filename>
fr: Fichier <filename>manpage.1.ex</filename>
it: Il file <filename>manpage.1.ex</filename>
ja: <filename>manpage.1.ex</filename> ファイル

source: The final manual page file name should include the name of the program it is documenting, so we will rename it from <literal>manpage</literal> to <literal>gentoo</literal>. The file name also includes <literal>.1</literal> as the first suffix, which means it's a manual page for a user command. Be sure to verify that this section is indeed the correct one. Here's a short list of manual page sections:
ca: El nom del fitxer de manual ha d'incloure el nom del programa corresponent: així canviaràs el nom de <literal>manpage</literal> a <literal>gentoo</literal>. El nom del fitxer inclou <literal>.1</literal> com a sufixe: aquest és el codi que indica que la pàgina de manual correspon a un programa d'usuari. Comprova que és la secció correcta. Aquí tens una petita llista de les seccions de les pàgines de manual.
es: El nombre del archivo de manual debería incluir el nombre del programa que está documentando, así que lo renombraremos de <literal>manpage</literal> a <literal>gentoo</literal>. El nombre del fichero incluye también <literal>.1</literal> como primer sufijo, lo que significa que es una página de manual para una programa de usuario. Asegúrate de verificar que esa sección es la correcta. Aquí tienes una pequeña lista de las secciones de las páginas de manual.
fr: Le nom de fichier de la page de manuel devrait inclure le nom du programme qu'elle documente, donc « <literal>manpage</literal> » doit être renommé en « <literal>gentoo</literal> ». Le nom de fichier inclut aussi « <literal>.1</literal> » comme premier suffixe, qui signifie que c'est une page de manuel pour une commande utilisateur. Assurez-vous de vérifier que cette section est effectivement la bonne. Voici une courte liste des sections de pages de manuel :
it: L'ultimo file delle pagine del manuale dovrebbe includere il nome del programma che si sta documentando, quindi verrà rinominato da <literal>manpage</literal> a <literal>gentoo</literal>. Il nome del file include anche <literal>.1</literal> come primo suffisso, il che sta ad indicare che la sezione della pagina del manuale è relativa ad un comando dell'utente. Si verifichi che questa sezione sia quella corretta. Qui di seguito viene presentata una breve lista delle sezioni delle pagine del manuale:
ja: 最終的なマニュアルページのファイル名は、解説されているプログラム名を含めなければなりません。ここでは、ファイル名を<literal>manpage</literal>から<literal>gentoo</literal>に変更しましょう。ファイル名は、<literal>.1</literal>というサフェックスも含みます。これは、このマニュアルページはユーザーコマンドのものだ、という意味です。この部分を間違わないように気をつけてください。以下はマニュアルページのリストです:

source: Section | Description | Notes 1 User commands Executable commands or scripts. 2 System calls Functions provided by the kernel. 3 Library calls Functions within system libraries. 4 Special files Usually found in /dev 5 File formats E.g. /etc/passwd's format 6 Games Or other frivolous programs 7 Macro packages Such as man macros. 8 System administration Programs typically only run by root. 9 Kernel routines Non-standard calls and internals.
es: Sección | Descripción | Notas 1 Órdenes de Usuario Programas o guiones ejecutables. 2 Llamadas al Sistema Funciones que ofrece el núcleo. 3 Llamadas a Bibliotecas Funciones dadas por las bibliotecas del sistema. 4 Ficheros Especiales Generalmente se encuentran en /dev. 5 Formatos de Fichero Por ejemplo, el formato del /etc/passwd. 6 Juegos U otros programas frívolos. 7 Paquetes de Macros Como las macros de man. 8 Administración del Sist. Programas que sólo suele ejecutar el superusuario. 9 Rutinas del Núcleo Llamadas al sistema no estándar.
fr: Section | Description | Notes 1 Commandes utilisateur Commandes ou scripts exécutables. 2 Appels système Fonctions fournies par le noyau. 3 Appels bibliothèque Fonctions des bibliothèques système. 4 Fichiers spéciaux D'ordinaire trouvés dans /dev. 5 Formats de fichiers Par ex. le format /etc/password. 6 Jeux Ou d'autres programmes frivoles. 7 Paquets de macros Comme les macros de man. 8 Administration système Programmes normalement exécutés par root. 9 Routines noyau Appels non standards et routines internes.

source: So <systemitem role="package">gentoo</systemitem>'s man page should be called <filename>gentoo.1</filename>. If there was no <filename>gentoo.1</filename> man page in the original source, you should create it by renaming the <filename>manpage.1.ex</filename> template to <filename>gentoo.1</filename> and edit it by using information from the example and from upstream docs.
ca: En el cas del <systemitem role="package">gentoo</systemitem>, el nom del fitxer serà <filename>gentoo.1</filename>. Com què no hi havia una pàgina de manual en els fitxers de fonts de <filename>gentoo.1</filename>, en vaig escriure una canviant el nom de la plantilla <filename>manpage.1.ex</filename> per <filename>gentoo.1</filename> i editant-la fent servir la informació de l'exemple i la documentació del programador original.
es: Así que la página de manual de <systemitem role="package">gentoo</systemitem> debería nombrarse como <filename>gentoo.1</filename>. No había una página de manual <filename>gentoo.1</filename> en el paquete fuente así que la escribí renombrando la plantilla <filename>manpage.1.ex</filename> como <filename>gentoo.1</filename> y modificándola usando la información del ejemplo y de los documentos del programador original.
fr: Ainsi, la page de manuel de <systemitem role="package">gentoo</systemitem> devrait être appelée <filename>gentoo.1</filename>. S'il n'y avait pas de page de manuel <filename>gentoo.1</filename> dans les sources originales, il aurait fallu renommer le modèle <filename>manpage.1.ex</filename> en <filename>gentoo.1</filename> puis le modifier à partir des informations de l'exemple et de la documentation amont.
it: Così la pagina man del pacchetto <systemitem role="package">gentoo</systemitem> dovrebbe chiamarsi <filename>gentoo.1</filename>. Se non ci fosse alcuna pagina man <filename>gentoo.1</filename> nei sorgenti originali, andrebbe creata rinominando il modello <filename>manpage.1.ex</filename> in <filename>gentoo.1</filename> e modificandolo utilizzando le informazioni contenute negli esempi e nei documenti originali.
ja: つまり、<systemitem role="package">gentoo</systemitem>のmanページは<filename>gentoo.1</filename>となります。オリジナルのソースファイルに<filename>gentoo.1</filename>というmanページがなければ、上流のドキュメントと例を元にして、<filename>manpage.1.ex</filename>という雛形ファイルを編集し<filename>gentoo.1</filename>というmanページを作らなければなりません。

source: If the command is missing <command>info</command> page but have documentation files in the <filename>/usr/share/<replaceable>package</replaceable></filename> directory, you should manually edit generated the man page created by the <command>help2man</command> command.
ca: Si el programa no té una pàgina <command>info</command> però si fitxers de documentació en el directori <filename>/usr/share/<replaceable>nom_paquet</replaceable></filename>, pots editar manualment la pàgina de manual ﻿construïda per <command>help2man</command>.
es: Si el programa no tiene página <command>info</command> pero contiene archivos de documentación en el directorio <filename>/usr/share/<replaceable>nombre_del_paquete</replaceable></filename>, deberás editar manualmente la página de manual construida por <command>help2man</command>.
fr: Si la commande n'a pas non plus de page <command>info</command>, mais possède des fichiers de documentation dans le répertoire <filename>/usr/share/<replaceable>paquet</replaceable></filename>, vous devriez modifier manuellement la page créée par la commande <command>help2man</command>.
it: Se al comando manca la pagina <command>info</command> ma esistono file di documentazione nella directory <filename>/usr/share/<replaceable>pacchetto</replaceable></filename>, si dovrebbe manualmente modificare la pagina man generata dal comando <command>help2man</command>.
ja: <filename>/usr/share/<replaceable>package</replaceable></filename>ディレクトリにドキュメントがあるにも関わらず、コマンドが<command>info</command>ページを見つけられない場合は、<command>help2man</command>コマンドで生成されたページを直接編集します。

source: You can use the <command>help2man</command> command to generate a man page out of <literal>--help</literal> and <literal>--version</literal> output of each program, too. <placeholder type="footnote" id="0"/>
ca: Fes servir l'ordre <command>help2man</command> per generar la pàgina de manual fent servir la informació aportada per les opcions «<literal>--help</literal>» i «<literal>--version</literal>» de cada programa <placeholder type="footnote" id="0"/>.
es: Utiliza la orden <command>help2man</command> para generar la página de manual a partir de la información dada por «<literal>--help</literal>» and «<literal>--version</literal>» para cada programa <placeholder type="footnote" id="0"/>.
fr: La commande <command>help2man</command> peut aussi être utilisée pour créer une page de manuel à partir de la sortie de « <literal>--help</literal> » et « <literal>--version</literal> » pour chaque programme. <placeholder type="footnote" id="0"/>
it: Si può utilizzare il comando <command>help2man</command> per generare una pagina di manuale, priva del risultato di <literal>--help</literal> and <literal>--version</literal>, per ogni programma. <placeholder type="footnote" id="0"/>
ja: <literal>--help</literal>と<literal>--version</literal>から<command>help2man</command>コマンドを用いてmanページを作成することも可能です。<placeholder type="footnote" id="0"/>

source: <filename>manpage.sgml.ex</filename> file
ca: Fitxer <filename>manpage.sgml.ex</filename>.
es: Archivo <filename>manpage.sgml.ex</filename>
fr: Fichier <filename>manpage.sgml.ex</filename>
it: Il file <filename>manpage.sgml.ex</filename>
ja: <filename>manpage.sgml.ex</filename> ファイル

source: install the <systemitem role="package">docbook-to-man</systemitem> package
ca: instal·lar el paquet <systemitem role="package">docbook-to-man</systemitem>
es: instalar el paquete <systemitem role="package">docbook-to-man</systemitem>
fr: installer le paquet <systemitem role="package">docbook-to-man</systemitem> ;
it: installato il pacchetto <systemitem role="package">docbook-to-man</systemitem>
ja: <systemitem role="package">docbook-to-man</systemitem> パッケージのインストール

source: add a <literal>override_dh_auto_build</literal> target to your <filename>rules</filename> file:
ca: afegir l'objectiu <literal>override_dh_auto_build</literal> en el fitxer <filename>rules</filename> com a l'exemple:
es: añadir el objetivo <literal>override_dh_auto_build</literal> en el fichero <filename>rules</filename> de la siguiente forma:
fr: ajouter une cible <literal>override_dh_auto_build</literal> au fichier <filename>rules</filename> :
it: aggiungere un obiettivo <literal>override_dh_auto_build</literal> al file <filename>rules</filename> :
ja: <filename>rules</filename>ファイルに<literal>override_dh_auto_build</literal>ターゲットを追加

source: <filename>manpage.xml.ex</filename> file
ca: Fitxer <filename>manpage.xml.ex</filename>.
es: Archivo <filename>manpage.xml.ex</filename>
fr: Fichier <filename>manpage.xml.ex</filename>
it: Il file <filename>manpage.xml.ex</filename>
ja: <filename>manpage.xml.ex</filename> ファイル

source: If you prefer XML over SGML, you can use the <literal>manpage.xml.ex</literal> template. If you do this, you have to:
ca: I si prefereixes treballar en format XML en lloc de SGML, pots fer servir la plantilla <literal>manpage.xml.ex</literal>. En aquest cas hauràs de fer el següent:
es: Si prefieres el formato XML en lugar de SGML, puedes utilizar la plantilla <literal>manpage.xml.ex</literal>. En este caso debes:
fr: Si vous préférez XML à SGML, vous pouvez utiliser le modèle <literal>manpage.xml.ex</literal>. Si vous le faites, vous devez :
it: Se si preferisce l'XML all'SGML, si può utilizzare il modello <literal>manpage.xml.ex</literal>. Se si decide questa modalità si avranno due scelte:
ja: SGMLよりもXMLが好みであれば、<literal>manpage.xml.ex</literal>をひな形として使うこともできます。こちらの場合には、以下の手順が必要です。

source: rename the source file to something like <literal>gentoo.1.xml</literal>
ca: reanomenar el fitxer a <literal>gentoo.1.xml</literal>
es: renombrar el archivo a <literal>gentoo.1.xml</literal>
fr: renommer le fichier en quelque chose comme <literal>gentoo.xml</literal> ;
it: rinominare il file in qualcosa del tipo <literal>gentoo.1.xml</literal>
ja: ソースファイルの名前を、<literal>gentoo.1.xml</literal>のような名前に変更します。

source: install the <systemitem role="package">docbook-xsl</systemitem> package and an XSLT processor like <systemitem role="package">xsltproc</systemitem> (recommended)
ca: instal·lar el paquet <systemitem role="package">docbook-xsl</systemitem> i un processador XSLT com <systemitem role="package">xsltproc</systemitem> (﻿recomanat)
es: instalar el paquete <systemitem role="package">docbook-xsl</systemitem> y un procesador XSLT como <systemitem role="package">xsltproc</systemitem> (recomendado)
fr: installer le paquet <systemitem role="package">docbook-xsl</systemitem> et un processeur XSLT comme <systemitem role="package">xsltproc</systemitem> (recommandé) ;
it: installare il pacchetto <systemitem role="package">docbook-xsl</systemitem> e l'elaboratore XSLT come <systemitem role="package">xsltproc</systemitem> (recommended)
ja: <systemitem role="package">docbook-xsl</systemitem> パッケージと <systemitem role="package">xsltproc</systemitem> のような XSLT プロセッサのインストール (推奨)

source: add the <literal>docbook-xsl</literal>, <literal>docbook-xml</literal> and <literal>xsltproc</literal> packages to the <literal>Build-Depends</literal> line in the <literal>control</literal> file
ca: afegir els paquets <literal>docbook-xsl</literal>, <literal>docbook-xml</literal> i <literal>xsltproc</literal> a la línia de <literal>Build-Depends</literal> en el fitxer <literal>control</literal>
es: añadir los paquetes <literal>docbook-xsl</literal>, <literal>docbook-xml</literal> y <literal>xsltproc</literal> a la línea de <literal>Build-Depends</literal> en el fichero de <literal>control</literal>
fr: ajouter <literal>docbook-xsl</literal>, <literal>docbook-xml</literal> et <literal>xsltproc</literal> à la ligne <literal>Build-Depends</literal> dans le fichier <literal>control</literal> ;
it: aggiungere i pacchetti <literal>docbook-xsl</literal>, <literal>docbook-xml</literal> e <literal>xsltproc</literal> alla linea <literal>Build-Depends</literal> nel file <literal>control</literal>
ja: <literal>control</literal> ファイルの <literal>Build-Depends</literal> 行へ、<literal>docbook-xsl</literal>、<literal>docbook-xml</literal>、<literal>xsltproc</literal>の各パッケージを追加

source: <filename><replaceable>package</replaceable>.manpages</filename> file
ca: Fitxer <filename><replaceable>nom_paquet</replaceable>.manpages</filename>
es: Archivo <filename><replaceable>nombre_del_paquete</replaceable>.manpages</filename>
fr: Fichier <filename><replaceable>paquet</replaceable>.manpages</filename>
it: <filename><replaceable>pacchetto</replaceable>.manpages</filename>
ja: <filename><replaceable>package</replaceable>.manpages</filename> ファイル

source: If your package has manual pages, you should install them using <citerefentry> <refentrytitle>dh_installman</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> by listing them in the <filename><replaceable>package</replaceable>.manpages</filename> files.
ca: Si el teu paquet té pàgines de manual, les instal·laràs amb <citerefentry> <refentrytitle>dh_installman</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> llistant els fitxers corresponents en el fitxer <filename><replaceable>nom_paquet</replaceable>.manpages</filename>.
es: Si tu paquete tiene páginas de manual, deberías instalarlas con <citerefentry> <refentrytitle>dh_installman</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> listando los archivos correspondientes en el archivo <filename><replaceable>nombre_del_paquete</replaceable>.manpages</filename>.
fr: Si le paquet possède des pages de manuel, vous devriez les installer avec <citerefentry> <refentrytitle>dh_installman</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> en les énumérant dans les fichiers <filename><replaceable>paquet</replaceable>.manpages</filename>.
it: Se il pacchetto creato presenta delle pagine del manuale, queste andrebbero installate utilizzando il comando <citerefentry> <refentrytitle>dh_installman</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> ed elencandole nei file <filename><replaceable>pacchetto</replaceable>.manpages</filename> .
ja: パッケージにマニュアルページがある場合、<filename><replaceable>package</replaceable>.manpages</filename>にそれらを挙げて、<citerefentry> <refentrytitle>dh_installman</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>を使用してインストールします。

source: To install <filename>doc/gentoo.1</filename> for the <systemitem role="package">gentoo</systemitem> package as its manpage, you create a <filename>gentoo.manpages</filename> file as:
es: Para instalar el archivo <filename>doc/gentoo.1</filename> del paquete <systemitem role="package">gentoo</systemitem> como su manual, construirás el archivo <filename>gentoo.manpages</filename> con el contenido:
fr: Pour installer <filename>doc/gentoo.1</filename> dans le paquet <systemitem role="package">gentoo</systemitem> en tant que page de manuel, créez le fichier <filename>gentoo.manpages</filename> contenant :

source: <filename>menu</filename> file
ca: Fitxer <filename>menu.ex</filename>.
es: Archivo <filename>menu.ex</filename>
fr: Fichier <filename>menu</filename>
it: Il file <filename>menu</filename>
ja: <filename>menu</filename> ファイル

source: X Window System users usually have a window manager with a menu that can be customized to launch programs. If they have installed the Debian <systemitem role="package">menu</systemitem> package, a set of menus for every program on the system will be created for them.
ca: Els usuaris de X Windows fan servir un gestor de finestres amb menús que poden adaptar-se per llançar programes. Si tenen instal·lat el paquet <systemitem role="package">menu</systemitem> de Debian, es construirà un conjunt de menús per a cada programa del sistema.
es: Los usuarios de X Windows suelen tener un gestor de ventanas con menús que pueden adaptarse para lanzar programas. Si tienen instalado el paquete <systemitem role="package">menu</systemitem> de Debian, se generará un conjunto de menús para cada programa del sistema para ellos.
fr: Les utilisateurs de X Window ont un gestionnaire de fenêtres avec un menu qui peut être configuré pour lancer des programmes. S'ils ont installé le paquet <systemitem role="package">menu</systemitem> de Debian, un ensemble de menus pour chaque programme sur le système sera créé pour eux.
it: Gli utenti dell'X Window System solitamente hanno un gestore di finestre che può essere personalizzato per lanciare programmi. Se hanno installato il pacchetto <systemitem role="package">menu</systemitem> , verrà creato un set di menu per ogni programma del sistema.
ja: X Window System のユーザーは、大抵ウィンドウマネージャを使っており、好きなプログラムを起動できるようにメニュー機能をカスタマイズしています。<systemitem role="package">menu</systemitem> パッケージをインストールしていれば、システムにある全プログラムのメニュー項目が作成され、menu に対応したウィンドウマネージャから利用できます。

source: The first field after the colon character is <literal>needs</literal>, and it specifies what kind of interface the program needs. Change this to one of the listed alternatives, e.g. <literal>text</literal> or <literal>X11</literal>.
ca: El primer camp després de la coma (<literal>needs</literal>) són els requisits del programa i especifica el tipus d'interfície gràfica feta servir pel programa. Canvia a una de les alternatives llistades, p.ex. <literal>text</literal> o <literal>X11</literal>.
es: El primer campo tras la coma es <literal>needs</literal> (necesidades) y especifica qué tipo de interfaz necesita el programa. Cambia ésta a una de las alternativas que se listan, como por ejemplo <literal>text</literal> o <literal>X11</literal>..
fr: Le premier champ après les deux points est « <literal>needs</literal> », il indique le genre d'interface dont a besoin le programme. Changez ceci en une des alternatives énumérées, par exemple « <literal>text</literal> » ou « <literal>X11</literal> ».
it: Il primo campo dopo i due punti è <literal>needs</literal>, e specifica il tipo di interfaccia di cui ha bisogno il programma. Questo valore può essere cambiato con una delle alternative elencate, ad esempio <literal>text</literal> o <literal>X11</literal>.
ja: コロン (:) の後の最初のフィールドは<literal>needs</literal>です。このフィールドは、プログラムがどんなどんなインターフェースが必要かを規定します。デフォルトとして挙げられたもの（例：<literal>text</literal> や <literal>X11</literal>など）に変更してください。

source: There were a major reorganization of menu structure for <literal>squeeze</literal>.
es: Hubo una importante reorganización de la estructura del menú para <literal>squeeze</literal>.
fr: Il y a eu une réorganisation majeure de la structure du menu pour <literal>Squeeze</literal>.

source: The next is <literal>section</literal>, where the menu and submenu the entry should appear in. The current list of sections <placeholder type="footnote" id="0"/> is at: <filename>/usr/share/doc/debian-policy/menu-policy.html/ch2.html#s2.1</filename>
es: El siguiente <literal>section</literal>, es la sección donde deberían aparecer la entrada del menú y del submenú. La lista actual de secciones <placeholder type="footnote" id="0"/> está en: <filename>/usr/share/doc/debian-policy/menu-policy.html/ch2.html#s2.1</filename>
fr: Le suivant est <literal>section</literal>, avec le menu et le sous-menu dans lesquels l'entrée devrait apparaître. La liste actuelle des sections <placeholder type="footnote" id="0"/> est dans : <filename>/usr/share/doc/debian-policy/menu-policy.html/ch2.html#s2.1</filename>.
