Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: en
ca: ca
es: es
fr: fr
it: it
ja: ja

source: Debian New Maintainers' Guide
ca: Guia del nou desenvolupador de Debian
es: Guía del nuevo desarrollador de Debian
fr: Guide du nouveau responsable Debian
it: Guida per il nuovo Maintainer
ja: Debian 新メンテナガイド

source: This document may be used under the terms the GNU General Public License version 2 or higher.
ca: Aquest document es publica amb llicència pública GNU versió 2 o posterior.
es: Este documento puede utilizarse en los términos descritos en la Licencia Pública GNU versión 2 o posterior.
fr: Ce document peut être utilisé selon les termes de la Licence publique générale de GNU version 2 ou suivante.
it: Questa guida può essere utilizzata nei termini della GNU General Public License versione 2 o successive.
ja: この文書は GNU 一般公有使用許諾書、バージョン 2 かそれ以降が規定する条件の下で使用できます。

source: This document was made using with these two documents as examples:
ca: Aquest document s'ha escrit fent servir aquest dos documents com a exemples:
es: Este documento se ha escrito usando estos dos documentos como ejemplo:
fr: Ce document a été créé en se basant sur les deux suivants :
it: Questo documento è stato realizzato utilizzando come modello i documenti seguenti:
ja: この文書は以下の二つの文書を参考にして書かれました。

source: Making a Debian Package (AKA the Debmake Manual), copyright © 1997 Jaldhar Vyas.
fr: Making a Debian Package (le manuel de debmake), copyright © 1997 Jaldhar Vyas.
it: Making a Debian Package (noto come Manuale di Debmake), copyright © 1997 Jaldhar Vyas.
ja: Debian パッケージの作り方 (別名 Debmake マニュアル)、Copyright © 1997 Jaldhar Vyas.

source: Getting started The Right Way
ca: Començant correctament.
es: Empezando «de la forma correcta».
fr: Partir du bon pied
it: Partire nel modo giusto
ja: まずは正攻法で始めよう

source: This document tries to describe building of a Debian package to the common Debian user, and the prospectus developer. It uses pretty common language, and it's well covered with working examples. There is an old Roman saying, <emphasis>Longum iter est per preaecepta, breve et efficax per exempla!</emphasis> (It's a long way by the rules, but short and efficient with examples!).
ca: Aquest document descriurà com es construeix un paquet Debian GNU/Linux per a un usuari comú Debian i per a futurs desenvolupadors, fent servir un llenguatge informat i incloent molts exemples. Un antic dit romà diu <emphasis>Longum iter est per preaecepta, breve et efficax per exempla!</emphasis> («És un llarg camí amb les normes, però curt i eficient amb els exemples»).
es: Este documento tratará de describir cómo se construye un paquete Debian GNU/Linux para el usuario común de Debian y para futuros desarrolladores en un lenguaje informal, y con multitud de ejemplos. Hay un antiguo dicho romano que dice, «<emphasis>Longum iter est per preaecepta, breve et efficax per exempla!</emphasis>» (¡Es un largo camino con las reglas, pero corto y eficiente con ejemplos!).
fr: Ce document essaie de décrire à l'utilisateur Debian moyen, et au développeur en devenir, la construction d'un paquet Debian. Il utilise un langage assez courant et est complété par des exemples, selon le vieux proverbe romain : « <emphasis>Longum iter est per preaecepta, breve et efficax per exempla !</emphasis> » (c'est long par la règle, court et efficace par l'exemple !).
it: Questo documento ha l'obiettivo di descrivere le procedure necessarie per la costruzione di un pacchetto Debian GNU/Linux, per un normale utente Debian e aspirante sviluppatore, utilizzando un linguaggio immediato e con l'ausilio di esempi concreti. C'è un detto latino che dice <emphasis>Longum iter est per preaecepta, breve et efficax per exempla!</emphasis> (La via è lunga usando la teoria, ma breve ed efficiente con gli esempi!).

source: The document assumes you are using the <literal>squeeze</literal> system. If you need to follow this text in the <literal>lenny</literal> system, you must install backported <systemitem role="package">dpkg</systemitem> and <systemitem role="package">debhelper</systemitem> packages, at least.
es: El documento asume que estás utilizando la versión <literal>squeeze</literal>. Si quieres utilizar este documento con la versión <literal>lenny</literal>, debes instalar (como mínimo) la versión «backport» de los paquetes <systemitem role="package">dpkg</systemitem> y <systemitem role="package">debhelper</systemitem>.
fr: Ce document suppose que vous utilisez le système <literal>Squeeze</literal>. Si vous avez l'intention de suivre ce texte avec un système <literal>Lenny</literal>, vous devez au moins installer les paquets <systemitem role="package">dpkg</systemitem> et <systemitem role="package">debhelper</systemitem> rétroportés.

source: This document has been updated for the Debian <literal>squeeze</literal> release. <placeholder type="footnote" id="0"/>
es: Este documento está actualizado a la versión <literal>squeeze</literal> de Debian <placeholder type="footnote" id="0"/>.
fr: Ce document a été mis à jour pour la version <literal>Squeeze</literal> de Debian. <placeholder type="footnote" id="0"/>

source: One of the things that makes Debian such a top-notch distribution is its package system. While there is a vast quantity of software already in the Debian format, sometimes you need to install software that isn't. You may be wondering how you can make your own packages and perhaps you think it is a very difficult task. Well, if you are a real novice on Linux, it is hard, but if you were rookie, you wouldn't be reading this doc now. :-) You do need to know a little about Unix programming but you certainly don't need to be a wizard.
es: Una de las cosas que hace a Debian una de las distribuciones más importantes del mercado es su sistema de paquetes. Aunque hay una gran cantidad de programas disponibles en forma de paquetes de Debian, algunas veces necesitarás instalar programas que no están disponible en este formato. Puede que te preguntes cómo hacer tus propios paquetes y que pienses que quizás ésta es una tarea demasiado difícil. Bueno, si eres un principiante en GNU/Linux, sí es duro, pero si eres un novato, no deberías estar leyendo esto ahora mismo. :-) Necesitas saber algo sobre programación en Unix, pero, desde luego, no tienes que ser un maestro.
fr: Une des choses qui font de Debian une distribution de si haut niveau est son système de paquets. Bien qu'il existe une grande quantité de logiciels au format Debian, vous devrez parfois installer un logiciel qui ne l'est pas. Vous pouvez vous demander comment faire vos propres paquets et peut-être pensez-vous que c'est une tâche très difficile. Eh bien, si vous êtes vraiment un débutant sous Linux, c'est dur, mais si vous étiez un débutant, vous ne seriez pas en train de lire ce document. :-) Vous devez en savoir un peu sur la programmation Unix, mais vous n'avez certainement pas besoin d'être un magicien.

source: One thing is certain, though: to properly create and maintain Debian packages you need many hours. Make no mistake, for our system to work the maintainers need to be both technically competent and diligent.
ca: Tot i així, una cosa és del tot segura: per construir i fer el manteniment de paquets Debian adequadament, calen moltes hores. Per a què el nostre sistema no tengui errors, cal que els nostres desenvolupadors siguin tècnicament competents.
es: Sin embargo, hay una cosa que es verdad: para construir y mantener paquetes Debian adecuadamente, necesitarás muchas horas. Para que nuestro sistema trabaje sin errores, nuestros desarrolladores necesitan ser técnicamente competentes y concienzudos.
fr: Une chose est sûre, cependant : pour créer et maintenir correctement des paquets Debian, il faut beaucoup de temps. Ne vous faites pas d'illusion, pour que votre système fonctionne, les responsables doivent à la fois être techniquement compétents et consciencieux.
it: Una cosa però è certa: per creare in maniera corretta e manutenere dei pacchetti Debian serviranno svariate ore di lavoro. Per far funzionare il nostro sistema, i maintainer devono stare attenti a non commettere errori, essere scrupolosi e tecnicamente competenti.

source: This document will explain every little (at first maybe irrelevant) step, and help you create that first package, and to gain some experience in building next releases of that and maybe other packages later on.
ca: Aquest document explicarà cada pas (fins i tot els més irrellevants), t'ajudarà a construir el teu primer paquet, a experimentar la construcció de noves versions i, tal vegada, a construir altres paquets més endavant.
es: Este documento explicará cada pequeño paso (al principio quizás irrelevantes), te ayudará a construir tu primer paquete, ganar alguna experiencia en construir próximas versiones de él, y quizás otros paquetes después.
fr: Ce document va expliquer toutes les étapes les plus petites (et peut-être a priori insignifiantes), vous aider à créer ce premier paquet, et à gagner de l'expérience pour construire les versions suivantes ainsi peut-être que d'autres paquets.
it: Questo documento spiegherà ogni piccolo (e forse all'inizio irrilevante) passo, aiuterà nella creazione del primo pacchetto e ad acquisire l'esperienza necessaria per manutenerne i successivi rilasci e possibilmente creare in futuro ulteriori pacchetti.

source: If you need some help on packaging, please read <xref linkend="helpme"/> .
ca: Si vols més informació sobre la construcció de paquets, llegeix <xref linkend="helpme"/> .
es: Si quieres información complementaria sobre cómo construir paquetes lee <xref linkend="helpme"/> .
fr: Si vous avez besoin d'aide sur l'empaquetage, veuillez vous reporter en <xref linkend="helpme"/> .

source: Programs you need for development
ca: Programes necessaris per treballar.
es: Programas necesarios para el desarrollo
fr: Programmes nécessaires au développement
it: Programmi necessari per lo sviluppo
ja: 開発に必要なプログラム

source: Before you start anything, you should make sure that you have properly installed some additional packages needed for development. Note that the list doesn't contain any packages marked <literal>essential</literal> or <literal>required</literal> - we expect that you have those installed already.
ca: Abans de començar, cal instal·lar els paquets necessaris per a la construcció de paquets. A la llista de paquets no ﻿estan inclosos paquets amb prioritat «essencial» o «﻿requerit» (<literal>essential</literal> i <literal>required</literal>) degut a què segurament ja estan instal·lats.
fr: Avant de commencer quoi que ce soit, vous devriez vous assurer d'avoir correctement installé certains paquets nécessaires au développement. Notez que la liste ne contient aucun paquet marqué <literal>essential</literal> ou <literal>required</literal> (essentiel ou requis) — nous supposons que ceux-ci sont déjà installés.
it: Prima di iniziare, bisogna assicurarsi di avere installato correttamente alcuni pacchetti aggiuntivi, necessari per lo sviluppo. Da notare che la lista non contiene nessun pacchetto etichettato come <literal>essenziale</literal> o <literal>richiesto</literal> - ci aspettiamo che siano già installati nel sistema.
ja: 何はさておき、開発に必要なパッケージがきちんとインストールされていることを確認せねばなりません。以下のリストには「<literal>essential</literal>」または「<literal>required</literal>」なパッケージが含まれていないことに注意してください。要するに、これらのパッケージは既にインストールされていることを前提としています。

source: The following packages come with the standard Debian installation, so you probably have them already (along with any additional packages they depend on). Still, you should check it with <literal>aptitude show <replaceable>package</replaceable></literal>.
es: Los siguientes paquetes vienen en una instalación estándar de Debian, así que probablemente ya los tengas (junto con los paquetes de los que dependen). Aún así, deberías comprobarlo ejecutando <literal>aptitude show <replaceable>nombre_del_paquete</replaceable></literal>.
fr: Les paquets suivants sont fournis dans l'installation standard de Debian, de sorte que vous les avez probablement déjà (ainsi que les paquets supplémentaires dont ils dépendent). Néanmoins, vous devriez le vérifier avec « <literal>aptitude show <replaceable>paquet</replaceable></literal> ».

source: The most important package to install on your development system is the <systemitem role="package">build-essential</systemitem> package. Once you try to install it, it will <emphasis>pull in</emphasis> other packages required to have a basic build environment.
ca: El paquet imprescindible per al desenvolupament és <systemitem role="package">build-essential</systemitem>. Quan s'instal·la, <emphasis>també s'instal·len</emphasis> altres paquets necessaris, obtenint-se la instal·lació bàsica per a la construcció de paquets.
es: El paquete imprescindible para el desarrollo es <systemitem role="package">build-essential</systemitem>. Al instalarlo, <emphasis>también se instalaran otros paquetes</emphasis> requeridos, consiguiendo una instalación básica para la construcción de paquetes.
fr: Le paquet le plus important à installer sur un système de développement est <systemitem role="package">build-essential</systemitem>. Lors de son installation, il <emphasis>tirera</emphasis> avec lui d'autres paquets nécessaires à un environnement de compilation de base.
it: Il pacchetto più importante da installare in un sistema in cui si ha intenzione di sviluppare è <systemitem role="package">build-essential</systemitem>. Questo <emphasis>includerà</emphasis> altri pacchetti necessari per avere un ambiente di base per la compilazione dei programmi.

source: For some types of packages, that is all you will require, however there is another set of packages that while not essential for all package builds are useful to have install or may be required by your package:
ca: Per a la construcció d'alguns paquets, amb això seria suficient, però n'hi ha d'altres que, sense ésser imprescindibles, pot ésser útil instal·lar-los o, fins i tot, necessaris:
es: Para la construcción de algunos paquetes esto seria suficiente, pero hay otros paquetes que, no siendo esenciales en general para la construcción de nuevos paquetes, puede ser útil tener instalados o, incluso, necesarios para el paquete que estás construyendo:
fr: Pour certaines catégories de paquets, c'est tout ce dont vous aurez besoin. Cependant d'autres paquets, bien que non essentiels à toutes les constructions de paquet, sont utiles ou peuvent être nécessaires pour votre paquet :
it: Per alcuni tipi di pacchetti questo è tutto quello che serve, ci sono però una serie di pacchetti che, pur non essendo essenziali per lo sviluppo, vengono in aiuto allo sviluppatore o possono essere richiesti dal pacchetto su cui si lavora:

source: <systemitem role="package">file</systemitem> - this handy program can determine what type a file is. (see <citerefentry> <refentrytitle>file</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)
ca: <systemitem role="package">file</systemitem> - aquest programa és molt útil per saber de quin tipus és un fitxer determinat (﻿consulta <citerefentry> <refentrytitle>file</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
es: <systemitem role="package">file</systemitem> - este útil programa puede determinar de qué tipo es un fichero (véase <citerefentry> <refentrytitle>file</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
fr: <systemitem role="package">file</systemitem> — ce programme pratique peut déterminer la nature d'un fichier (voir <citerefentry> <refentrytitle>file</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) ;
it: <systemitem role="package">file</systemitem> - questo semplice programma stabilisce la tipologia di un file. (vedere <citerefentry> <refentrytitle>file</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)

source: <systemitem role="package">patch</systemitem> - this very useful utility will take a file containing a difference listing (produced by the <command>diff</command> program) and apply it to the original file, producing a patched version. (see <citerefentry> <refentrytitle>patch</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)
ca: <systemitem role="package">patch</systemitem> - és una utilitat molt útil. Permet aplicar un arxiu amb una llista de diferències (produït pel programa <command>diff</command>) en el fitxer original, i obtenir una versió ﻿apedaçada del fitxer original (vegeu <citerefentry> <refentrytitle>patch</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
es: <systemitem role="package">patch</systemitem> - esta utilidad es muy práctica para modificar el original de un archivo a partir de un archivo de diferencias (elaborado por el programa <command>diff</command>) produciendo un archivo parcheado (véase <citerefentry> <refentrytitle>patch</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
fr: <systemitem role="package">patch</systemitem> — ce programme très utile prend un fichier contenant une liste de différences (produite par le programme <command>diff</command>) et l'applique au fichier original, produisant une version modifiée (voir <citerefentry> <refentrytitle>patch</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) ;

source: <systemitem role="package">perl</systemitem> - Perl is one of the most used interpreted scripting languages on today's Unix-like systems, often referred to as Unix's Swiss Army Chainsaw. (see <citerefentry> <refentrytitle>perl</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)
ca: <systemitem role="package">perl</systemitem> - Perl és un dels llenguatges interpretats usats amb més freqüència per als guions (o «scripts») en els sistemes Un*x. Tant es així que es fa servir l'expressió «navalla suïssa d'Unix» per fer referència en aquest llenguatge (llegeix <citerefentry> <refentrytitle>perl</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
es: <systemitem role="package">perl</systemitem> - Perl es uno de los lenguajes interpretados para hacer guiones (o «scripts») más usados en los sistemas Un*x de hoy en día, comúnmente se refiere a él como la «navaja suiza de Unix» (véase <citerefentry> <refentrytitle>perl</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
fr: <systemitem role="package">perl</systemitem> — Perl est un des langages de script les plus utilisés sur les systèmes modernes similaires à Unix, souvent qualifié de « tronçonneuse suisse d'Unix » (voir <citerefentry> <refentrytitle>perl</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) ;
it: <systemitem role="package">perl</systemitem> - Perl è uno dei linguaggi di scripting più utilizzati sui moderni sistemi Unix e derivati, spesso definito come il coltellino svizzero di Unix. (vedere <citerefentry> <refentrytitle>perl</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)

source: <systemitem role="package">python</systemitem> - Python is another of the most used interpreted scripting languages on the Debian system that combines remarkable power with very clear syntax. (see <citerefentry> <refentrytitle>python</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)
ca: <systemitem role="package">python</systemitem> - Python és una altre llenguatge interpretat per a fer guions a Debian degut a la combinació de funcionalitat i clara sintaxi (consulta <citerefentry> <refentrytitle>python</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
es: <systemitem role="package">python</systemitem> - Python es otro de los lenguajes interpretados para hacer guiones (o «scripts») en Debian debido a la combinación de su poder y sintaxis clara (véase <citerefentry> <refentrytitle>python</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>).
fr: <systemitem role="package">python</systemitem> — Python est un autre des langages de script les plus utilisés sur le système Debian qui combine une remarquable puissance et une syntaxe très claire (voir <citerefentry> <refentrytitle>python</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>) ;
it: <systemitem role="package">python</systemitem> - Python è un altro linguaggio di scripting molto utilizzato sui sistemi Debian, combina una notevole potenza con una sintassi molto chiara. (vedere <citerefentry> <refentrytitle>python</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>)

source: <systemitem role="package">autoconf</systemitem>, <systemitem role="package">automake</systemitem> and <systemitem role="package">autotools-dev</systemitem> - many newer programs use configure scripts and <filename>Makefile</filename> files preprocessed with help of programs like these. (see <literal>info autoconf</literal>, <literal>info automake</literal>). The <systemitem role="package">autotools-dev</systemitem> keeps up-to-date versions of certain auto files and has documentation about the best way to use those files.
ca: <systemitem role="package">autoconf</systemitem> , <systemitem role="package">automake</systemitem> i <systemitem role="package">autotools-dev</systemitem> - molts programes fan servir fitxers de configuració i fitxers <filename>Makefile</filename> que es gestionen amb aquests programes (llegeix <literal>info autoconf</literal>, <literal>info automake</literal>). El paquet <systemitem role="package">autotools-dev</systemitem> permet mantenir versions actualitzades dels fitxers «autoconf» i «automake» i conté documentació per aprendre a fer servir amb eficàcia aquest tipus de fitxers.
es: <systemitem role="package">autoconf</systemitem> , <systemitem role="package">automake</systemitem> y <systemitem role="package">autotools-dev</systemitem> - muchos programas nuevos usan ficheros de configuración y ficheros <filename>Makefile</filename> que se procesan con la ayuda de programas como éstos (véase <literal>info autoconf</literal>, <literal>info automake</literal>). El paquete <systemitem role="package">autotools-dev</systemitem> permite mantener versiones actualizadas de los archivos autoconf y automake y tiene documentación para usar eficientemente ese tipo de archivos.
fr: <systemitem role="package">autoconf</systemitem>, <systemitem role="package">automake</systemitem> et <systemitem role="package">autotools-dev</systemitem> — beaucoup de nouveaux programmes utilisent des scripts de configuration et des fichiers <filename>Makefile</filename> prétraités à l'aide de programmes comme ceux-ci (voir « <literal>info autoconf</literal> », « <literal>info automake</literal> »). <systemitem role="package">autotools-dev</systemitem> conserve les versions à jour de certains de ses fichiers automatiques et fournit une documentation sur la meilleure façon d'utiliser ces fichiers ;
it: <systemitem role="package">autoconf</systemitem>, <systemitem role="package">automake</systemitem> e <systemitem role="package">autotools-dev</systemitem> - diversi programmi recenti usano script di configurazione e <filename>Makefile</filename> preprocessati con l'aiuto di programmi come questi. (vedere <literal>info autoconf</literal>, <literal>info automake</literal>) <systemitem role="package">autotools-dev</systemitem> tiene aggiornate le versioni di alcuni file di automazione e contiene la documentazione che spiega il modo migliore per utilizzare questi file.
