Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: Use <literal>dh --with tex $@</literal> instead.
ca: Fes servir <literal>dh --with tex $@</literal> ﻿en el seu lloc.
es: Utiliza <literal>dh --with tex $@</literal> en su lugar.
fr: utilisation de « <literal>dh --with tex $@</literal> » à la place ;
it: Utilizza in alternativa <literal>dh --with tex $@</literal>
ja: 代わりに<literal>dh --with tex $@</literal>を使用します。

source: This registers Type 1 fonts, hyphenation patterns, or formats with TeX.
ca: Així es registren les fonts «Type 1», els patrons per a la separació de paraules («hyphenation patterns») o els formats TeX.
es: Esto registra las fuentes «Type 1», los patrones de separación de palabras («hyphenation patterns») o los formatos TeX.
fr: conséquence : enregistrement des fontes de Type 1, des modèles de césure, ou des formats avec Tex ;
it: Registra i caratteri Type 1, le regole di sillabazione, o i formati con TeX.
ja: これで、TeXによるType1フォント、ハイフネーション、またはフォーマットが登録されます。

source: Add support of the <command>dh_quilt_patch</command> and <command>dh_quilt_unpatch</command> commands.
ca: Afegir funcionalitat per a les ordres <command>dh_quilt_patch</command> i <command>dh_quilt_unpatch</command>.
es: Añadiendo las órdenes <command>dh_quilt_patch</command> y <command>dh_quilt_unpatch</command>.
fr: ajout de l'assistance des commandes <command>dh_quilt_patch</command> et <command>dh_quilt_unpatch</command> :
it: Aggiunge il supporto ai comandi <command>dh_quilt_patch</command> e <command>dh_quilt_unpatch</command>.
ja: <command>dh_quilt_patch</command> と <command>dh_quilt_unpatch</command> コマンドのサポートを追加する

source: Install the <systemitem role="package">quilt</systemitem> package in <literal>Build-Depends</literal>.
ca: Afegeix el paquet <systemitem role="package">quilt</systemitem> en el camp <literal>Build-Depends</literal>.
es: Añade el paquete <systemitem role="package">quilt</systemitem> en el campo <literal>Build-Depends</literal>.
fr: ajout de <systemitem role="package">quilt</systemitem> à « <literal>Build-Depends</literal> » ;
it: Installa il pacchetto <systemitem role="package">quilt</systemitem> in <literal>Build-Depends</literal>.
ja: <literal>Build-Depends</literal>に、<systemitem role="package">quilt</systemitem>パッケージをインストールします。

source: Use <literal>dh --with quilt $@</literal> instead.
ca: Fes servir <literal>dh --with quilt $@</literal> ﻿en el seu lloc.
es: Utiliza <literal>dh --with quilt $@</literal> en su lugar.
fr: utilisation de « <literal>dh --with quilt $@</literal> » à la place ;
it: Utilizza in alternativa <literal>dh --with quilt $@</literal>
ja: 代わりに<literal>dh --with quilt $@</literal>を使用します。

source: This applies and un-applies patches to the upstream source from files in the <filename>debian/patches</filename> directory for the <literal>1.0</literal> source package.
ca: Així s'apliquen o es desfan, en els fitxers de les fonts originals, les modificacions dels fitxers del directori <filename>debian/patches</filename> en els paquets construïts amb el format <literal>1.0</literal>.
es: Esto aplica o elimina los parches en los archivos de las fuentes originales, basándose en los ficheros del directorio <filename>debian/patches</filename> en los paquetes con el formato <literal>1.0</literal>.
fr: conséquence : application et retrait des correctifs au code source amont à partir des fichiers du répertoire <filename>debian/patches</filename> pour les paquets source au format <literal>1.0</literal> ;
it: Applica e rimuove le patch al sorgente originale dai file nella directory <filename>debian/patches</filename> per i sorgenti dei pacchetti <literal>1.0</literal>.
ja: <literal>1.0</literal>ソースパッケージの<filename>debian/patches</filename>ディレクトリ内にあるファイルの上流ソースにパッチを当てたり外したりできます。

source: This is not needed if you use the new <literal>3.0 (quilt)</literal> source package.
ca: Aquesta adaptació no és necessària pels paquets construïts amb el format <literal>3.0 (quilt)</literal>.
es: Esta adaptación no es necesaria para los paquetes con el nuevo formato <literal>3.0 (quilt)</literal>.
fr: inutile pour les paquets source au format <literal>3.0 (quilt)</literal> ;
it: Non è necessario se si utilizza il nuovo sorgente del pacchetti <literal>3.0 (quilt)</literal>.
ja: もし<literal>3.0 (quilt)</literal>ソースパッケージを使用している場合、これは不要です。

source: Add support of the <command>dh_dkms</command> command.
ca: Afegir funcionalitat per a l'ordre <command>dh_dkms</command>.
es: Añadiendo la orden <command>dh_dkms</command>.
fr: ajout de l'assistance de la commande <command>dh_dkms</command> :
it: Aggiunge il supporto al comando <command>dh_dkms</command>.
ja: <command>dh_dkms</command> コマンドのサポートを追加する

source: Install the <systemitem role="package">dkms</systemitem> package in <literal>Build-Depends</literal>.
ca: Afegeix el paquet <systemitem role="package">dkms</systemitem> en el camp <literal>Build-Depends</literal>.
es: Añade el paquete <systemitem role="package">dkms</systemitem> en el campo <literal>Build-Depends</literal>.
fr: ajout de <systemitem role="package">dkms</systemitem> à « <literal>Build-Depends</literal> » ;
it: Installa il pacchetto <systemitem role="package">dkms</systemitem> in <literal>Build-Depends</literal>.
ja: <literal>Build-Depends</literal>に、<systemitem role="package">dkms</systemitem>パッケージをインストールします。

source: Use <literal>dh --with dkms $@</literal> instead.
ca: Fes servir <literal>dh --with dkms $@</literal> en el seu lloc.
es: Utiliza <literal>dh --with dkms $@</literal> en su lugar.
fr: utilisation de « <literal>dh --with dkms $@</literal> » à la place ;
it: Utilizza in alternativa <literal>dh --with dkms $@</literal>.
ja: 代わりに<literal>dh --with dkms $@</literal>を使用します。

source: This correctly handles DKMS usage by the kernel module package.
ca: Així es controla correctament l'ús de DKMS en la construcció de paquets del nucli.
es: Esto controla correctamente el uso de DKMS en la construcción de paquetes del núcleo.
fr: conséquence : gestion correcte de l'utilisation de DKMS par le paquet de modules du noyau ;
it: Gestisce in maniera corretta DKMS, usato dal pacchetto del modulo del kernel.
ja: カーネルモジュールパッケージによるDKMSの使用方法正しく処理します。

source: Add support of the <command>dh_autotools-dev_updateconfig</command> and <command>dh_autotools-dev_restoreconfig</command> commands.
ca: Afegir funcionalitat per a les ordres <command>dh_autotools-dev_updateconfig</command> i <command>dh_autotools-dev_restoreconfig</command>.
es: Añadiendo las ordenes <command>dh_autotools-dev_updateconfig</command> y <command>dh_autotools-dev_restoreconfig</command>.
fr: ajout de l'assistance des commandes <command>dh_autotools-dev_updateconfig</command> et <command>dh_autotools-dev_restoreconfig</command> :
it: Aggiunge il supporto ai comandi <command>dh_autotools-dev_updateconfig</command> e <command>dh_autotools-dev_restoreconfig</command>.
ja: <command>dh_autotools-dev_updateconfig</command> と <command>dh_autotools-dev_restoreconfig</command> コマンドのサポートを追加する

source: Install the <systemitem role="package">autotools-dev</systemitem> package in <literal>Build-Depends</literal>.
ca: Afegeix el paquet <systemitem role="package">autotools-dev</systemitem> en el camp <literal>Build-Depends</literal>.
es: Añade el paquete <systemitem role="package">autotools-dev</systemitem> en el campo <literal>Build-Depends</literal>.
fr: ajout de <systemitem role="package">autotools-dev</systemitem> à « <literal>Build-Depends</literal> » ;
it: Installa il pacchetto <systemitem role="package">autotools-dev</systemitem> in <literal>Build-Depends</literal>.
ja: <literal>Build-Depends</literal>に、<systemitem role="package">autotools-dev</systemitem> パッケージをインストールします。

source: Use <literal>dh --with autotools-dev $@</literal> instead.
ca: Fes servir <literal>dh --with autotools-dev $@</literal> en el seu lloc.
es: Utiliza <literal>dh --with autotools-dev $@</literal> en su lugar.
fr: utilisation de « <literal>dh --with autotools-dev $@</literal> » à la place ;
it: Utilizza in alternativa <literal>dh --with autotools-dev $@</literal>.
ja: 代わりに <literal>dh --with autotools-dev $@</literal> を使用します。

source: This updates and restores <filename>config.sub</filename> and <filename>config.guess</filename>.
ca: Així s'actualitza i restaura <filename>config.sub</filename> i <filename>config.guess</filename>.
es: Esto actualiza y restaura <filename>config.sub</filename> y <filename>config.guess</filename>.
fr: conséquence : mise à jour et restauration de <filename>config.sub</filename> et <filename>config.guess</filename> ;
it: Aggiorna e ripristina i file <filename>config.sub</filename> and <filename>config.guess</filename>.
ja: これで<filename>config.sub</filename>と<filename>config.guess</filename>をアップデートおよびレストアします。

source: Add support of the <command>dh_autoreconf</command> and <command>dh_autoreconf_clean</command> commands.
ca: Afegir funcionalitat per a les ordres <command>dh_autoreconf</command> i <command>dh_autoreconf_clean</command>.
es: Añadiendo la orden <command>dh_autoreconf</command> y <command>dh_autoreconf_clean</command>.
fr: ajout de l'assistance des commandes <command>dh_autoreconf</command> et <command>dh_autoreconf_clean</command> :
it: Aggiunge il supporto ai comandi <command>dh_autoreconf</command> e <command>dh_autoreconf_clean</command>.
ja: <command>dh_autoreconf</command> と <command>dh_autoreconf_clean</command> コマンドのサポートを追加

source: Install the <systemitem role="package">dh-autoreconf</systemitem> package in <literal>Build-Depends</literal>.
ca: Afegeix el paquet <systemitem role="package">dh-autoreconf</systemitem> en el camp <literal>Build-Depends</literal>.
es: Añade el paquete <systemitem role="package">dh-autoreconf</systemitem> en el campo <literal>Build-Depends</literal>.
fr: ajout de <systemitem role="package">dh-autoreconf</systemitem> à « <literal>Build-Depends</literal> » ;
it: Installa il pacchetto <systemitem role="package">dh-autoreconf</systemitem> in <literal>Build-Depends</literal>.
ja: <literal>Build-Depends</literal>に、<systemitem role="package">dh-autoreconf</systemitem>パッケージをインストールします。

source: Use <literal>dh --with autoreconf $@</literal> instead.
ca: Fes servir <literal>dh --with autoreconf $@</literal> en el seu lloc.
es: Utiliza <literal>dh --with autoreconf $@</literal> en su lugar.
fr: utilisation de « <literal>dh --with autoreconf $@</literal> » à la place ;
it: Utilizza in alternativa <literal>dh --with autoreconf $@</literal>.
ja: 代わりに<literal>dh --with autoreconf $@</literal>を使用します。

source: This updates the GNU Build System files and restores them after the build.
ca: Així s'actualitzen els fitxers del sistema de compilació GNU i els restaura després de la compilació.
es: Así se actualiza los archivos del sistema de compilación GNU y los restaura después de la compilación.
fr: conséquence : mise à jour des fichiers du système de construction GNU et restauration de ceux-ci après la construction ;
it: Aggiorna i file del sistema di compilazione GNU e ripristina i file dopo la sua compilazione.
ja: これは、ビルド後にGNUビルドシステムのファイルのアップデートおよびレストアを行います。

source: Add support to the <command>bash</command> completion feature.
ca: Afegir funcionalitat d'ompliment automàtic a <command>bash</command>.
es: Añadir la funcionalidad de autocompletar a <command>bash</command>.
fr: ajout de l'assistance de la fonctionnalité de complétion de <command>bash</command> :
it: Aggiunge il supporto alla funzionalità di completamento di <command>bash</command>
ja: <command>bash</command>補完機能のサポートを追加します。

source: Install the <systemitem role="package">bash-completion</systemitem> package in <literal>Build-Depends</literal>.
ca: Afegeix el paquet <systemitem role="package">bash-completion</systemitem> en el camp <literal>Build-Depends</literal>.
es: Añade el paquete <systemitem role="package">bash-completion</systemitem> en el campo <literal>Build-Depends</literal>.
fr: ajout de <systemitem role="package">bash-completion</systemitem> à « <literal>Build-Depends</literal> » ;
it: Installa il pacchetto <systemitem role="package">bash-completion</systemitem> in <literal>Build-Depends</literal>.
ja: <literal>Build-Depends</literal>に、<systemitem role="package">bash-completion</systemitem>パッケージをインストールします。

source: Use <literal>dh --with bash-completion $@</literal> instead.
ca: Fes servir <literal>dh --with bash-completion $@</literal> en el seu lloc.
es: Utiliza <literal>dh --with bash-completion $@</literal> en su lugar.
fr: utilisation de « <literal>dh --with bash-completion $@</literal> » à la place ;
it: Utilizza in alternativa <literal>dh --with bash-completion $@</literal>.
ja: 代わりに<literal>dh --with bash-completion $@</literal>を使用します。

source: This installs <command>bash</command> completions using configuration file at <filename>debian/<replaceable>package</replaceable>.bash-completion</filename>.
ca: Així s'instal·la la funció ompliment automàtic de <command>bash</command> fent servir l'arxiu de configuració de <filename>debian/<replaceable>nom_paquet</replaceable>.bash-completion</filename>.
es: Esto instala la función autocompletar de <command>bash</command> utilizando el archivo de configuración de <filename>debian/<replaceable>nombre_del_paquete</replaceable>.bash-completion</filename>.
fr: conséquence : installation des complétions de <command>bash</command> en utilisant le fichier de configuration <filename>debian/<replaceable>paquet</replaceable>.bash-completion</filename>.
it: Installa il completamento per <command>bash</command> utilizzando il file di configurazione <filename>debian/<replaceable>package</replaceable>.bash-completion</filename>.
ja: このコマンドを使用すると、<command>bash</command>補完機能から、 <filename>debian/<replaceable>package</replaceable>.bash-completion</filename>の設定を使うことができるようになります。

source: For sources using Autotools, use combination of above as <literal>dh --with autotools-dev --with autoreconf $@</literal> to be most current with the GNU Build System.
ca: Per a les fonts que fan servir «Autotools», combinar les opcions anteriors amb <literal>dh --with autotools-dev --with autoreconf $@</literal> és habitual amb el sistema de compilació GNU.
es: Para las fuentes que usan «Autotools», combinar las opciones anteriores con <literal>dh --with autotools-dev --with autoreconf $@</literal> es lo habitual con el sistema de compilación GNU.
fr: Pour les sources utilisant Autotools, la combinaison « <literal>dh --with autotools-dev --with autoreconf $@</literal> » est la plus courante avec le système de construction GNU.
it: Per i sorgenti che utilizzano Autotools, utilizzare il comando <literal>dh --with autotools-dev --with autoreconf $@</literal> per essere aggiornati con il sistema di compilazione GNU.

source: Many <command>dh_*</command> commands invoked by the new <command>dh</command> command can be customized by the corresponding configuration files in the <filename>debian</filename> directory. See <xref linkend="dother"/> and the manpage of each command for the customization of such features.
ca: Moltes de les ordres <command>dh_*</command> executades per la nova ordre <command>dh</command> es poden personalitzar amb fitxers de configuració ubicats en el directori <filename>debian</filename>. Consulta <xref linkend="dother"/> i els manuals (les «manpage») de cada ordre.
es: Muchas de las órdenes <command>dh_*</command> invocadas por la nueva orden <command>dh</command> son personalizables mediante sus archivos de configuración en el directorio <filename>debian</filename>. Véase <xref linkend="dother"/> y los manuales (las «manpage») para cada orden.
fr: De nombreuses commandes <command>dh_*</command> invoquées par la nouvelle commande <command>dh</command> peuvent être personnalisées par les fichiers de configuration correspondants dans le répertoire <filename>debian</filename>. Voir <xref linkend="dother"/> et la page de manuel de chaque commande pour la personnalisation de telles fonctionnalités.
it: Molti comandi del tipo <command>dh_*</command>, invocati da <command>dh</command>, possono essere personalizzati modificando i rispettivi file di configurazione nella directory <filename>debian</filename>. Si veda <xref linkend="dother"/> per la personalizzazione di tali caratteristiche.
ja: 新しい <command>dh</command> コマンドにより起動される多くの <command>dh_*</command> コマンドは、<filename>debian</filename> ディレクトリ内にある対応する設定ファイルによりカスタマイズすることが可能です。そのような機能のカスタマイズ方法については、 <xref linkend="dother"/> とコマンドごとの manpage を参照してください。

source: Under <literal>lenny</literal>, if you wanted to change the behavior of a <command>dh_*</command> script you found the relevant line in the <filename>rules</filename> file and adjusted it.
ca: En <literal>lenny</literal>, quan calia canviar un guió <command>dh_*</command> calia trobar la línia adequada en el fitxer <filename>rules</filename> i canviar-la. Ara és suficient afegir un objectiu.
es: En <literal>lenny</literal>, cuando querías cambiar el comportamiento de un programa <command>dh_*</command> tenías que encontrar la línea adecuada en el archivo <filename>rules</filename> y cambiarla.
fr: Avec <literal>Lenny</literal>, pour modifier le comportement d'un script <command>dh_*</command> il fallait trouver et adapter la ligne pertinente du fichier <filename>rules</filename>.
it: Sotto <literal>lenny</literal>, se si vuole cambiare il comportamento di uno script <command>dh_*</command> basta cercare la riga relativa nel file <filename>rules</filename> e modificarla.
ja: <literal>lenny</literal>では、<command>dh_*</command>スクリプトの挙動を変えたい場合、<filename>rules</filename>ファイル内の該当する行を見つけ出し、調整していました。

source: Some <command>dh_*</command> commands invoked by the new <command>dh</command> command may require you to run it with some arguments or to run additional commands with them or to skip them. For such cases, you create an <literal>override_dh_<replaceable>foo</replaceable></literal> target with its rule in the <filename>rules</filename> file only for the <command>dh_<replaceable>foo</replaceable></command> command you want to change. It basically say <emphasis>run me instead</emphasis>. <placeholder type="footnote" id="0"/>
ca: Algunes ordres <command>dh_*</command> invocades per la nova ordre <command>dh</command> poden necessitar l'adició d'arguments o l'execució d'ordres addicionals. Per a aquests casos, hauràs d'afegir l'objectiu <literal>override_dh_<replaceable>nom_ordre</replaceable></literal> en el fitxer <filename>rules</filename> per a l'ordre <command>dh_<replaceable>nom_ordre</replaceable></command> que cal canviar. Es tracta de <emphasis>execute'm a mi en el seu lloc</emphasis> <placeholder type="footnote" id="0"/>.
es: Algunas órdenes <command>dh_*</command> invocadas por la nueva orden <command>dh</command> pueden precisar la adición de argumentos (opciones), la ejecución de órdenes adicionales u omitirlas del todo. Para estos casos, deberás añadir el objetivo <literal>override_dh_<replaceable>nombre_de_la_orden</replaceable></literal> con las reglas a ejecutar en el archivo <filename>rules</filename> sólo para la orden <command>dh_<replaceable>nombre_de_la_orden</replaceable></command> que vas a cambiar. Se trata de decir <emphasis>ejecútame a mí en su lugar</emphasis> <placeholder type="footnote" id="0"/>.
fr: Certaines commandes <command>dh_*</command> invoquées par la nouvelle commande <command>dh</command> doivent parfois utiliser des paramètres, exécuter des commandes supplémentaires, ou être ignorées. Pour ce faire, créez une cible <literal>override_dh_<replaceable>toto</replaceable></literal> avec sa règle dans le fichier <filename>rules</filename> uniquement pour la commande <command>dh_<replaceable>toto</replaceable></command> à remplacer. Son rôle est fondamentalement de dire « <emphasis>exécute-moi à la place</emphasis> ». <placeholder type="footnote" id="0"/>
it: Alcuni comandi del tipo <command>dh_*</command>, invocati da <command>dh</command>, possono richiedere la propria esecuzione con alcuni parametri o in aggiunta ad altri comandi da eseguire contestualmente o al posto dei comandi originali. In tali casi viene creato nel file <filename>rules</filename> l' obiettivo <literal>override_dh_<replaceable>foo</replaceable></literal> aggiungendo una regola solo per il comando <command>dh_<replaceable>foo</replaceable></command> che si intende modificare. Fondamentalmente tale regola dice <emphasis>esegui me al posto di</emphasis>. <placeholder type="footnote" id="0"/>
ja: <command>dh</command>コマンドによって呼び出される<command>dh_*</command>コマンドの中には、特定の引数で実行したり、それらを追加のコマンドとともに実行したり、スキップしたりする必要があることがあります。そのような場合は、変更したい<command>dh_<replaceable>foo</replaceable></command>コマンドについて、<literal>override_dh_<replaceable>foo</replaceable></literal> ターゲットを<filename>rules</filename>ファイルに追記してください。簡単に説明すると、このターゲットは<emphasis>かわりにこのコマンドを使用する</emphasis>という意味です。<placeholder type="footnote" id="0"/>

source: Please note that the <command>dh_auto_*</command> commands tend to do more than what has been discussed as (over)simplified explanation to take care all the corner cases. Use of simplified equivalent command instead of these in <literal>override_dh_*</literal> targets except the <literal>override_dh_auto_clean</literal> target is a bad idea since it may kill such <systemitem role="package">debhelper</systemitem>'s smart features.
ca: Les ordres <command>dh_auto_*</command> fan més coses que les explicades en aquest document. L'ús d'ordres equivalents més senzilles en el lloc d'aquestes en els objectius <literal>override_dh_*</literal> (amb l'excepció de l'objectiu <literal>override_dh_auto_clean</literal>) no és una bona idea ja que pot eliminar funcions intel·ligents de <systemitem role="package">debhelper</systemitem>.
es: Las ordenes <command>dh_auto_*</command> hacen más cosas que las expuestas aquí. El uso de ordenes equivalentes más sencillas en lugar de éstas en los objetivos <literal>override_dh_*</literal> (excepto el objetivo <literal>override_dh_auto_clean</literal>) es una mala idea ya que puede eliminar funciones inteligentes de <systemitem role="package">debhelper</systemitem>.
fr: Les commandes <command>dh_auto_*</command> ont tendance à en faire plus que ce ce qui a été présenté (très) simplement, pour prendre en compte toutes les situations délicates. L'utilisation d'une commande équivalente simplifiée à la place de celles des cibles <literal>override_dh_*</literal> (à part pour la cible <literal>override_dh_auto_clean</literal>) est une mauvaise idée qui risque de détruire les fonctionnalités intelligentes de <systemitem role="package">debhelper</systemitem>.
ja: ここでは簡単な説明を行いましたが、実際には、めったに発生しない厄介なケースを処理するため、<command>dh_auto_*</command>コマンドは、もっと複雑なことを行っているということを覚えておいてください。そのため、<literal>override_dh_auto_clean</literal>ターゲット以外は、<literal>override_dh_*</literal> ターゲットを使用して、簡素化された別のコマンドで代用しようとしてはいけません。<systemitem role="package">debhelper</systemitem>の賢い機能が台無しになってしまうからです。

source: The <systemitem role="package">gentoo</systemitem> package uses the GNU build system, also known as the Autotools. See <ulink url="&gnu-build-system;">&gnu-build-system;</ulink>.
fr: Le paquet <systemitem role="package">gentoo</systemitem> utilise le système de construction GNU, ou Autotools. Voir <ulink url="http://fr.wikipedia.org/wiki/Autotools">http://fr.wikipedia.org/wiki/Autotools</ulink>.
