Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: Rules that you want to execute are invoked as command line arguments (for example, <literal>./debian/rules build</literal> or <literal>fakeroot make -f debian/rules binary</literal>). After the target name, you can name the dependency, program or file that the rule depends on. After that, there can be any number of commands, indented with <literal><replaceable>TAB</replaceable></literal>. A new rule begins with the target declaration in the first column. Empty lines and lines beginning with <literal>#</literal> (hash) are treated as comments and ignored.
ca: Les regles que vulguis executar haurien d'executar-se com a arguments en el terminal (per ex. «<literal>./debian/rules build</literal>» o «<literal>fakeroot make -f debian/rules binary</literal>»). ﻿Després del nom de l'objectiu, pots afegir les dependències, programa o fitxers dels quals depèn la regla. A continuació, hi haurà un nombre qualsevol d'instruccions (començant amb <literal><replaceable>TAB</replaceable></literal>), acabades amb una línia en blanc. I a continuació la pròxima regla. Las línies múltiples en blanc i les línies que ﻿comencen amb <literal>#</literal> es tracten com comentaris i s'ignoren.
es: Cada regla se compone de objetivos, ficheros o nombres de acciones que se deben llevar a cabo (por ejemplo, «build:» o «install:»). Las reglas que quieras ejecutar deberían llamarse como argumentos de la línea de órdenes (por ejemplo, <literal>./debian/rules build</literal> o <literal>fakeroot make -f debian/rules binary</literal>). Después del nombre del objetivo, puedes nombrar las dependencias, programas o ficheros de los que la regla dependa. Después de esto, hay un número cualquiera de instrucciones (¡indentado con <literal><replaceable>TAB</replaceable></literal>), hasta que se llega a una línea en blanco. Ahí empieza otra regla. Las líneas múltiples en blanco, y las líneas que empiezan por almohadillas (<literal>#</literal>) se tratan como comentarios y se ignoran.
fr: Les règles à exécuter sont en paramètres de ligne de commande (par exemple, « <literal>./debian/rules build</literal> » ou « <literal>fakeroot make -f debian/rules binary</literal> »). Après le nom de la cible, vous pouvez nommer la dépendance, programme ou fichier dont la cible dépend. Ensuite, il peut y avoir un certain nombre de commandes, indentées par <literal><replaceable>tab</replaceable></literal>. Une nouvelle règle commence par la déclaration de cible dès la première colonne. Les lignes vides ainsi que celles qui commencent par un « <literal>#</literal> » (dièse) sont considérées comme des commentaires et sont ignorées.
it: Le regole che si vogliono applicare vengono applicate come parametri da linea di comando (per esempio, <literal>./debian/rules build</literal> o <literal>fakeroot make -f debian/rules binary</literal>). Dopo il nome dell'obiettivo si può scrivere il nome della dipendenza, programma o file da cui dipende la regola. Dopo aver fatto questo ci può essere un qualsiasi numero di comandi, separati da <literal><replaceable>TAB</replaceable></literal>. Una nuova regola comincia con la dichiarazione dell'obiettivo nella prima colonna. Le righe vuote e le righe che cominciano con <literal>#</literal> (cancelletto) vengono trattate come commenti e rimosse.
ja: 適用したいルールはコマンドライン引数として指定します。（例えば、<literal>./debian/rules build</literal>や<literal>fakeroot make -f debian/rules binary</literal>など)。ターゲット名の後には、依存するプログラムやファイル名などを指定できます。その次の行からはコマンド行になります。<literal><replaceable>TAB</replaceable></literal>でインデントし、コマンドを何行でも書くことができます。新しいルールを始めるには、行の先頭からターゲット名の宣言を書きます。空行や<literal>#</literal> (ハッシュ)で始まる行はコメントとして扱われ、無視されます。

source: You are probably confused now, but it will all be clear upon examination of the <filename>rules</filename> file that <command>dh_make</command> gives us as a default. You should also read <literal>info make</literal> for more information.
ca: Probablement l'exposició no és gens clara, però tot quedarà més clar després de veure el fitxer <filename>rules</filename> que <command>dh_make</command> construeix com a plantilla . Consulta l'entrada de <literal>info make</literal> en info.
es: Probablemente ya te hayas perdido, pero todo quedará más claro después de ver el fichero <filename>rules</filename> que <command>dh_make</command> pone por omisión. Deberías leer también la entrada de <literal>info make</literal> para más información.
fr: Tout ceci vous semble probablement confus pour l'instant, mais cela va devenir clair à l'examen du fichier <filename>rules</filename> que <command>dh_make</command> donne par défaut. Vous pouvez aussi lire « <literal>info make</literal> » pour plus d'informations.
it: È probabile che adesso ci sia un po' di confusione, ma sarà tutto più chiaro una volta esaminato il file <filename>rules</filename> che <command>dh_make</command> fornisce in modo predefinito. Inoltre si consiglia di leggere <literal>info make</literal> per maggiori informazioni.
ja: 今はまだよくわからないかもしれませんが、<command>dh_make</command>がデフォルトとして作成する<filename>rules</filename>ファイルを調べるうちに、きっと理解できるようになります。さらに詳細な説明は<literal>info make</literal>を参照してください。

source: Default <filename>rules</filename> file
ca: Fitxer <filename>rules</filename> predeterminat.
es: Archivo <filename>rules</filename> predeterminado
fr: Fichier <filename>rules</filename> par défaut
it: Il file <filename>rules</filename> predefinito
ja: デフォルトの<filename>rules</filename>ファイル

source: Newer <command>dh_make</command> generates a very simple but powerful default <filename>rules</filename> file using the <command>dh</command> command:
ca: La nova versió de <command>dh_make</command> genera un arxiu <filename>rules</filename> molt simple però poderós que fa servir l'ordre <command>dh</command>:
es: La nueva versión de <command>dh_make</command> genera un archivo <filename>rules</filename> muy simple pero poderoso utilizando la orden <command>dh</command>:
fr: Les versions récentes de <command>dh_make</command> créent un fichier <filename>rules</filename> par défaut très simple mais aussi très puissant en utilisant la commande <command>dh</command> :
it: Le nuove versioni di <command>dh_make</command> generano un file <filename>rules</filename> molto semplice ma potente utilizzando il comando <command>dh</command>:
ja: 最新の<command>dh_make</command>は<command>dh</command> コマンドでシンプルかつパワフルな<filename>rules</filename>ファイルを作ってくれます。

source: 1 #!/usr/bin/make -f 2 # -*- makefile -*- 3 # Sample debian/rules that uses debhelper. 4 # This file was originally written by Joey Hess and Craig Small. 5 # As a special exception, when this file is copied by dh-make into a 6 # dh-make output file, you may use that output file without restriction. 7 # This special exception was added by Craig Small in version 0.37 of dh-make. 8 9 # Uncomment this to turn on verbose mode. 10 #export DH_VERBOSE=1 11 12 %: 13 dh $@
fr: 1 #!/usr/bin/make -f 2 # -*- makefile -*- 3 # Exemple de debian/rules utilisant debhelper. 4 # Ce fichier a initialement été écrit par Joey Hess et Craig Small. 5 # En tant qu'exception particulière, lorsque ce fichier est copié 6 # par dh-make dans un fichier de sortie dh-make, vous pouvez 7 # utiliser ce fichier sans restriction. Cette exception particulière 8 # a été ajoutée par Craig Small dans la version 0.37 de dh-make. 9 10 # Décommentez la ligne suivante pour le mode volubile. 11 #export DH_VERBOSE=1 12 13 %: 14 dh $@

source: (I've added the line numbers. In the actual <filename>rules</filename> file, the leading white spaces are TAB codes.)
ca: (S'han afegit els números de les línies. En el fitxer <filename>debian/rules</filename> els espais inicials de les línies són tabulacions).
es: (He añadido los números de línea. En el fichero <filename>debian/rules</filename> los espacios iniciales de las líneas son tabulaciones)
fr: (Les numéros de ligne ont été ajoutés. Dans le vrai fichier <filename>rules</filename>, le grand espace est une tabulation.)
it: (Sono stati aggiunti i numeri di riga. Nel vero file <filename>rules</filename>, gli spazi vengono sostituiti da TAB.)
ja: (行番号は筆者による。実際の<filename>rules</filename>ファイルは行頭が空白のTABコード)

source: You are probably familiar with lines like line 1 from shell and Perl scripts. It tells the operating system that this file is to be processed with <filename>/usr/bin/make</filename>.
ca: Probablement estàs familiaritzat amb línies com la primera per a guions escrits en shell o Perl. Aquesta línia indica que el fitxer s'executa amb <filename>/usr/bin/make</filename>.
es: Probablemente estés familiarizado con líneas como la primera de guiones escritos en shell o Perl. Esta línea indica que el fichero debe ejecutarse con<filename>/usr/bin/make</filename>.
fr: Vous avez probablement l'habitude de la ligne 1 avec les scripts shell et Perl. Cela signifie que ce fichier doit être exécuté par <filename>/usr/bin/make</filename>.
it: Probabilmente si sarà già familiari con le righe tipo la prima che ricordano gli script shell e Perl. In pratica indica al sistema operativo che il file andrà elaborato con <filename>/usr/bin/make</filename>.
ja: 1行目はシェルやパールスクリプトでお馴染みの表現です。オペレーティングシステムに<filename>/usr/bin/make</filename>で処理するように指示しています。

source: This uses the new <systemitem role="package">debhelper</systemitem> V7 features. Its design concepts are explained in <ulink url="&debhelper-slides;">Not Your Grandpa's Debhelper</ulink> presented at Debconf9 by the <systemitem role="package">debhelper</systemitem> upstream. Under <literal>lenny</literal>, <command>dh_make</command> created a much more complicated <filename>rules</filename> file with many <command>dh_*</command> scripts listed for each required explicit targets and frozen them to the state when it was initially packaged. This new <command>dh</command> command is simpler and frees us from this constrain. You still have full power to customize this with <literal>override_dh_*</literal> targets. See <xref linkend="customrules"/> . It is based only on the <systemitem role="package">debhelper</systemitem> package and does not obfuscate the package building process like the <systemitem role="package">cdbs</systemitem> package.
ca: Aquí es fan servir les noves funcions de la versió 7 de <systemitem role="package">debhelper</systemitem> que s'explique a <ulink url="&debhelper-slides;">«Not Your Grandpa's Debhelper»</ulink> presentades a la DebConf9 per l'autor de <systemitem role="package">debhelper</systemitem>. En <literal>lenny</literal>, <command>dh_make</command> construïa un arxiu <filename>rules</filename> més ﻿complex amb el llistat de cada ordre <command>dh_*</command> necessària per a cada objectiu i els mantenia en l'estat del empaquetament inicial. La nova ordre <command>dh</command> és més simple i ens allibera d'aquesta restricció. Tot i així, és possible personalitzar el fitxer amb objectius <literal>override_dh_*</literal>. Consulta <xref linkend="customrules"/> . Es basa únicament en el paquet <systemitem role="package">debhelper</systemitem> i cal no confondre's amb la construcció de paquets feta amb <systemitem role="package">cdbs</systemitem>.
fr: Ceci utilise les fonctionnalités du nouveau <systemitem role="package">debhelper</systemitem> V7. Ses concepts fondateurs sont expliqués dans la présentation <ulink url="&debhelper-slides;">« Pas le debhelper de papy »</ulink> réalisé lors de la dixième conférence Debian par l'auteur de <systemitem role="package">debhelper</systemitem>. Sous <literal>Lenny</literal>, <command>dh_make</command> crée un fichier <filename>rules</filename> beaucoup plus compliqué avec de nombreux scripts <command>dh_*</command> énumérés pour chaque cible obligatoire explicitement et les gèle dans l'état de l'empaquetage initial. Cette nouvelle commande <command>dh</command> plus simple libère le responsable de cette contrainte. Vous gardez les pleins pouvoirs de personnalisation avec les cibles <literal>override_dh_*</literal>. Voir <xref linkend="customrules"/> . Il se base uniquement sur le paquet <systemitem role="package">debhelper</systemitem> et ne rend pas obscur le processus de construction comme le paquet <systemitem role="package">cdbs</systemitem>.

source: You can verify actual sequences of <command>dh_*</command> programs invoked for a given <literal><replaceable>target</replaceable></literal> as <literal>dh --no-act <replaceable>target</replaceable></literal> or <literal>debian/rules -- '--no-act <replaceable>target</replaceable>'</literal> without really running them.
ca: Per saber les seqüències d'ordres <command>dh_*</command> executades per a cada <literal><replaceable>objectiu</replaceable></literal> executa <literal>dh --no-act <replaceable>objectiu</replaceable></literal> o bé <literal>debian/rules -- '--no-act <replaceable>objectiu</replaceable>'</literal> sense que s'executin realment.
es: Puedes comprobar las secuencias de órdenes <command>dh_*</command> invocadas por cada <literal><replaceable>objetivo</replaceable></literal> ejecutando <literal>dh --no-act <replaceable>objetivo</replaceable></literal> o bien <literal>debian/rules -- '--no-act <replaceable>objetivo</replaceable>'</literal> sin que se ejecuten realmente.
fr: Vous pouvez vérifier les réelles séquences de programmes <command>dh_*</command> pour une <literal><replaceable>cible</replaceable></literal> donnée avec « <literal>dh --no-act <replaceable>cible</replaceable></literal> » ou « <literal>debian/rules -- '--no-act <replaceable>cible</replaceable>'</literal> » sans vraiment les exécuter.
it: Si può verificare la sequenza di avvio dei programmi <command>dh_*</command> indicando il <literal><replaceable>target</replaceable></literal> come <literal>dh --no-act <replaceable>target</replaceable></literal> o <literal>debian/rules -- '--no-act <replaceable>target</replaceable>'</literal>, in questo modo si ottiene un'esecuzione un'esecuzione simulata dei programmi.
ja: <literal><replaceable>target</replaceable></literal> 変数で呼び出され、<command>dh_*</command> プログラムが実際に実行するシーケンスは、プログラムを走らせなくても<literal>dh --no-act <replaceable>target</replaceable></literal> や、<literal>debian/rules -- '--no-act <replaceable>target</replaceable>'</literal>コマンドで確認することができます。

source: Lines 12 and 13 are where all the work is done. The percent sign means any targets which then call a single program, <command>dh</command> with the target name. <placeholder type="footnote" id="0"/> The <command>dh</command> command is a wrapper script which runs appropriate sequences of <command>dh_*</command> programs depending on its argument. <placeholder type="footnote" id="1"/>
ca: Tota la feina del fitxer la fan les línies 12 i 13. El símbol de percentatge substitueix qualsevol objectiu per a continuació executar únicament <command>dh</command> amb el nom de l'objectiu (com a opció) <placeholder type="footnote" id="0"/>. L'ordre <command>dh</command> és un guió que executa les ﻿seqüències necessàries d'ordres <command>dh_*</command> segons els seus paràmetres com es descriu a continuació <placeholder type="footnote" id="1"/>:
es: Todo el trabajo del archivo se reduce a las líneas 12 y 13. El símbolo de porcentaje substituye a cualquier objetivo para a continuación ejecutar únicamente <command>dh</command> con el nombre del objetivo (como opción) <placeholder type="footnote" id="0"/>. La orden <command>dh</command> es un guión que ejecuta las secuencias necesarias de órdenes <command>dh_*</command> según sus parámetros, como se describe a continuación <placeholder type="footnote" id="1"/>:
fr: Tout le travail est réalisé aux lignes 13 et 14. Le caractère pourcent (« % ») représente toutes les cibles qui appellent alors un seul programme, <command>dh</command> avec le nom de la cible. <placeholder type="footnote" id="0"/> La commande <command>dh</command> est un script d'emballage qui exécute les séquences opportunes de programmes <command>dh_*</command> dépendant de ses paramètres : <placeholder type="footnote" id="1"/>
it: Tutto il lavoro è svolto nelle righe 12 e 13. Il simbolo della percentuale significa che ogni target esegue una chiamata ad un singolo programma, <command>dh</command> con il nome del terget stesso. <placeholder type="footnote" id="0"/> Il comando <command>dh</command> è uno script wrapper, che esegue una sequenza appropriata di programmi <command>dh_*</command> in base all'argomento passato. <placeholder type="footnote" id="1"/>
ja: 12行目から13行目が処理の仕上げ段階です。％サインはターゲットを意味し、ターゲットの名前と一緒に <command>dh</command> プログラムを呼び出します。<placeholder type="footnote" id="0"/> <command>dh</command> コマンドは、引数によって、適切なシーケンスで <command>dh_*</command> プログラムを走らせるラッパースクリプトです。<placeholder type="footnote" id="1"/>

source: <literal>debian/rules clean</literal> runs <literal>dh clean</literal>; which in turn runs the following:
ca: <literal>debian/rules clean</literal> executa <literal>dh clean</literal>, ﻿que al seu torn executa el següent:
es: <literal>debian/rules clean</literal> ejecuta <literal>dh clean</literal>, que a su vez ejecuta lo siguiente:
fr: « <literal>debian/rules clean</literal> » exécute « <literal>dh clean</literal> », qui exécute à son tour :
it: <literal>debian/rules clean</literal> esegue <literal>dh clean</literal>; che a sua volta esegue i seguenti:
ja: <literal>debian/rules clean</literal> は <literal>dh clean</literal>を実行します。実行する順番は以下の通りです。

source: <literal>debian/rules build</literal> runs <literal>dh build</literal>; which in turn runs the following:
ca: <literal>debian/rules build</literal> executa <literal>dh build</literal>, ﻿que al seu torn executa el següent:
es: <literal>debian/rules build</literal> ejecuta <literal>dh build</literal>, que a su vez ejecuta lo siguiente:
fr: « <literal>debian/rules build</literal> » exécute « <literal>dh build</literal> », qui exécute à son tour :
it: <literal>debian/rules build</literal> esegue <literal>dh build</literal>; che a sua volta esegue i seguenti:
ja: <literal>debian/rules build</literal> は <literal>dh build</literal> を実行します。実行する順番は以下の通りです。

source: This assumes that the <systemitem role="package">python-support</systemitem> package is installed on the system.
ca: Suposat que el paquet <systemitem role="package">python-support</systemitem> està instal·lat en el sistema.
es: Se asume que el paquete <systemitem role="package">python-support</systemitem> está instalado en el sistema.
fr: En assumant que le paquet <systemitem role="package">python-support</systemitem> soit installé sur le système.
it: Si presuppone che il pacchetto <systemitem role="package">python-support</systemitem> sia installato nel sistema.
ja: <systemitem role="package">python-support</systemitem> がインストールされているという前提で

source: <literal>fakeroot debian/rules binary</literal> runs <literal>fakeroot dh binary</literal>; which in turn runs the following<placeholder type="footnote" id="0"/>:
ca: <literal>fakeroot debian/rules binary</literal> executa <literal>fakeroot dh binary</literal>, ﻿que al seu torn executa el següent <placeholder type="footnote" id="0"/>:
es: <literal>fakeroot debian/rules binary</literal> ejecuta <literal>fakeroot dh binary</literal>, que a su vez ejecuta lo siguiente <placeholder type="footnote" id="0"/>:
fr: « <literal>fakeroot debian/rules binary</literal> » exécute « <literal>fakeroot dh binary</literal> », qui exécute à son tour : <placeholder type="footnote" id="0"/>
it: <literal>fakeroot debian/rules binary</literal> esegue <literal>fakeroot dh binary</literal>; che a sua volta esegue i seguenti<placeholder type="footnote" id="0"/>:
ja: <literal>fakeroot debian/rules binary</literal> は<placeholder type="footnote" id="0"/>、<literal>fakeroot dh binary</literal>を実行します。実行する順番は以下の通りです:

source: <literal>fakeroot debian/rules binary-arch</literal> runs <literal>fakeroot dh binary-arch</literal>; which in turn runs the same sequence as <literal>fakeroot dh binary</literal> but with the <literal>-a</literal> option appended for each command.
ca: <literal>fakeroot debian/rules binary-arch</literal> executa <literal>fakeroot dh binary-arch</literal>; ﻿que al seu torn executa la mateixa seqüència que <literal>fakeroot dh binary</literal> però amb l'opció <literal>-a</literal> per a cada ordre.
es: <literal>fakeroot debian/rules binary-arch</literal> ejecuta <literal>fakeroot dh binary-arch</literal>; que a su vez ejecuta la misma secuencia que <literal>fakeroot dh binary</literal> pero con la opción <literal>-a</literal> para cada orden.
fr: « <literal>fakeroot debian/rules binary-arch</literal> » exécute « <literal>fakeroot dh binary-arch</literal> », qui exécute à son tour la même séquence que « <literal>fakeroot dh binary</literal> » mais avec l'option « <literal>-a</literal> » ajoutée à chaque commande ;
it: <literal>fakeroot debian/rules binary-arch</literal> esegue <literal>fakeroot dh binary-arch</literal>; che a sua volta esegue la stessa sequenza di <literal>fakeroot dh binary</literal> ma con l'opzione <literal>-a</literal> aggiunta ad ogni comando.
ja: <literal>fakeroot debian/rules binary-arch</literal> は <literal>fakeroot dh binary-arch</literal> を実行します。<literal>fakeroot dh binary</literal> の全てのコマンドに <literal>-a</literal> オプションをつけた場合と同じことを行います。

source: <literal>fakeroot debian/rules binary-indep</literal> runs <literal>fakeroot dh binary-indep</literal>; which in turn runs almost the same sequence as <literal>fakeroot dh binary</literal> but excluding <command>dh_strip</command>, <command>dh_makeshlibs</command>, and <command>dh_shlibdeps</command> with the <literal>-i</literal> option appended for each remaining command.
ca: <literal>fakeroot debian/rules binary-indep</literal> executa <literal>fakeroot dh binary-indep</literal>, que al seu torn executa la mateixa seqüència que <literal>fakeroot dh binary</literal> excloent l'execució de <command>dh_strip</command>, <command>dh_makeshlibs</command> i <command>dh_shlibdeps</command> a la vegada que executa les demés ordres amb l'opció <literal>-i</literal>.
es: <literal>fakeroot debian/rules binary-indep</literal> ejecuta <literal>fakeroot dh binary-indep</literal>; que a su vez ejecuta casi la misma secuencia que <literal>fakeroot dh binary</literal> puesto que excluye la ejecución de <command>dh_strip</command>, <command>dh_makeshlibs</command> y <command>dh_shlibdeps</command> a la vez que ejecuta el resto de órdenes añadiendo la opción <literal>-i</literal>.
fr: « <literal>fakeroot debian/rules binary-indep</literal> » exécute « <literal>fakeroot dh binary-indep</literal> », qui exécute à son tour à peu près la même séquence que « <literal>fakeroot dh binary</literal> » à l'exception de <command>dh_strip</command>, <command>dh_makeshlibs</command> et <command>dh_shlibdeps</command>, et avec l'option « <literal>-i</literal> » ajoutée à chaque commande restante.
it: <literal>fakeroot debian/rules binary-indep</literal> esegue <literal>fakeroot dh binary-indep</literal>; che a sua volta esegue la stessa sequenza di <literal>fakeroot dh binary</literal> ma escludendo <command>dh_strip</command>, <command>dh_makeshlibs</command>, e <command>dh_shlibdeps</command> con l'opzione <literal>-i</literal> aggiunta ad ogni comando rimanente.
ja: <literal>fakeroot debian/rules binary-indep</literal> は <literal>fakeroot dh binary-indep</literal> を実行します。同様のコマンドは<literal>fakeroot dh binary</literal>ですが、<command>dh_strip</command>、<command>dh_makeshlibs</command>、<command>dh_shlibdeps</command> は実行せず、残りのコマンドには<literal>-i</literal> オプションを付加して実行します。
