Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: Then you just take <literal>-dev</literal> version of every package as <literal>Build-Depends</literal> entry. If you use <command>ldd</command> for this purpose, it will report indirect lib dependencies as well, resulting in the problem of excessive build dependencies.
ca: Cal fer servir la versió <literal>-dev</literal> de cada un dels paquets llistats en el camp <literal>Build-Depends</literal>. Si fas servir el programa <command>ldd</command> per saber les dependències, també t'informarà de les dependències de les biblioteques indirectes, la qual cosa pot fer que la llista sigui massa llarga.
fr: Ajoutez ensuite simplement la version <literal>-dev</literal> de chaque paquet dans le champ <literal>Build-Depends</literal>. Si vous utilisez <command>ldd</command> à cet effet, des dépendances de bibliothèque indirectes seront indiquées, introduisant un problème de dépendances de construction excessives.
it: A questo punto si indica la versione <literal>-dev</literal> di ogni pacchetto come voce <literal>Build-Depends</literal>. Se si usa <command>ldd</command> per questo scopo, verranno considerate anche le dipendenze indirette, il che potrà portare ad avere un numero eccessivo di dipendenze.
ja: とします。<literal>Build-Depends</literal>に、各ライブラリの<literal>-dev</literal>バージョンを採用します。<command>ldd</command>を使用して依存パッケージを見つけようとすると、間接的な依存も報告してきます。そのため、過度のビルド依存になってしまいます。

source: <systemitem role="package">gentoo</systemitem> also happens to require <systemitem role="package">xlibs-dev</systemitem>, <systemitem role="package">libgtk1.2-dev</systemitem> and <systemitem role="package">libglib1.2-dev</systemitem> to build, so we'll add them here next to <systemitem role="package">debhelper</systemitem>.
ca: <systemitem role="package">gentoo</systemitem> fa servir <systemitem role="package">xlibs-dev</systemitem>, <systemitem role="package">libgtk1.2-dev</systemitem> i <systemitem role="package">libglib1.2-dev</systemitem> en la compilació, així que caldrà afegir-ho tot a continuació de <systemitem role="package">debhelper</systemitem>.
es: <systemitem role="package">gentoo</systemitem> también depende de <systemitem role="package">xlibs-dev</systemitem>, <systemitem role="package">libgtk1.2-dev</systemitem> y <systemitem role="package">libglib1.2-dev</systemitem> para su construcción, así que lo añadiremos junto a <systemitem role="package">debhelper</systemitem>.
fr: <systemitem role="package">gentoo</systemitem> a aussi besoin de <systemitem role="package">xlibs-dev</systemitem>, <systemitem role="package">libgtk1.2-dev</systemitem> et <systemitem role="package">libgl1.2-dev</systemitem> pour être construit, ils doivent donc être ajoutés à côté de <systemitem role="package">debhelper</systemitem>.
it: Il pacchetto <systemitem role="package">gentoo</systemitem> richiede anche <systemitem role="package">xlibs-dev</systemitem>, <systemitem role="package">libgtk1.2-dev</systemitem> e <systemitem role="package">libglib1.2-dev</systemitem> per poter essere costruito, quindi tali dipendenze si aggiungeranno subito dopo <systemitem role="package">debhelper</systemitem>.
ja: <systemitem role="package">gentoo</systemitem>パッケージをビルドするには<systemitem role="package">xlibs-dev</systemitem>、<systemitem role="package">libgtk1.2-dev</systemitem>、 <systemitem role="package">libglib1.2-dev</systemitem>が必要なので、<systemitem role="package">debhelper</systemitem>の後に記述しましょう。

source: Line 6 is the version of the <ulink url="&debian-policy;">Debian Policy Manual</ulink> standards this package follows, the one you read while making your package.
ca: La línia 6 és la versió dels ﻿estàndards definits en les normes Debian i que s'han seguit en la construcció del paquet, és a dir, la versió del manual de normes que has seguit per empaquetar (consulta <ulink url="&debian-policy;">«Debian Policy Manual»</ulink>).
fr: La ligne 6 est la version de la <ulink url="&debian-policy;">Charte Debian</ulink> que ce paquet respecte, celle que vous lisez quand vous créez le paquet.
it: La riga 6 indica la versione delle delle <ulink url="&debian-policy;">linee guida Debian</ulink> che il pacchetto deve rispettare, che corrisponde a quello che si legge quando lo si crea.
ja: 6行目は、パッケージが準拠する<ulink url="&debian-policy;">Debian Policy Manual</ulink> のバージョンです。これは、あなたがパッケージ作成の際に参照したポリシーマニュアルのバージョンです。

source: On line 7 you can put the URL of the homepage for the upstream program.
ca: A la ﻿línia 7 està l'adreça URL del programa.
es: En la línea 7 está la dirección URL de la página web del programa (donde has obtenido las fuentes).
fr: En ligne 7 vous pouvez indiquer l'URL de la page d'accueil du programme amont.
it: Nella riga 7 si può inserire l'URL della pagina del programma originale.
ja: 7行目には上流プログラムのホームページアドレスを記載できます。

source: Line 9 is the name of the binary package. This is usually the same as the name of the source package, but it doesn't necessarily have to be that way.
ca: La línia 9 és el nom del paquet binari. Normalment és el mateix que el paquet del codi original, tot i què no és imprescindible que sigui així.
es: La línea 9 es el nombre del paquete binario. Este suele ser el mismo que el del paquete fuente, aunque no es necesario que sea así siempre.
fr: La ligne 9 est le nom du paquet binaire. C'est d'ordinaire le même que le nom du paquet source, mais ce n'est pas nécessairement le cas.
it: La riga 9 indica il nome del pacchetto binario. Questo è normalmente lo stesso nome del pacchetto sorgente, ma non deve essere necessariamente così.
ja: 9行目はバイナリパッケージの名前です。ソースパッケージと同名にするのが通例ですが、そうでなくてもかまいません。

source: If your package is architecture independent (for example, a shell or Perl script, or a document), change this to <literal>all</literal>, and read later in <xref linkend="rules"/> about using the <literal>binary-indep</literal> rule instead of <literal>binary-arch</literal> for building the package.
ca: Si el teu paquet és independent de l'arquitectura (serà el cas d'un document o d'un guió escrit en Perl), canvia el valor a <literal>all</literal> i consulta més endavant <xref linkend="rules"/> per saber com fer servir la regla <literal>binary-indep</literal> en lloc de <literal>binary-arch</literal> per a la construcció del paquet.
es: Si tu paquete es independiente de la arquitectura (por ejemplo, un documento, un guión escrito en Perl o para el intérprete de órdenes), cambia esto a <literal>all</literal>, y consulta más adelante <xref linkend="rules"/> sobre cómo usar la regla <literal>binary-indep</literal> en lugar de <literal>binary-arch</literal> para construir el paquete.
fr: Si le paquet est indépendant d'une architecture (par exemple, un script shell ou Perl, ou un document), changez ce paramètre en « <literal>all</literal> », et lisez plus loin en <xref linkend="rules"/> comment utiliser la règle <literal>binary-indep</literal> au lieu de <literal>binary-arch</literal> pour construire le paquet.
it: Se il pacchetto è indipendente dall'architettura (per esempio, uno script shell o Perl, o un documento), si cambi questo valore in <literal>all</literal>, e si legga in seguito in <xref linkend="rules"/> riguardo l'utilizzo della regola <literal>binary-indep</literal> al posto di <literal>binary-arch</literal> per costruire il pacchetto.
ja: 特定のアーキテクチャに依存しない(例えば、シェルやPerlスクリプト、文書)パッケージであれば、パッケージをビルドする際に、これを <literal>all</literal> に変更し、<literal>binary-arch</literal> に代え <literal>binary-indep</literal> を使って後述の <xref linkend="rules"/> を読んでください。

source: Line 11 shows one of the most powerful features of the Debian packaging system. Packages can relate to each other in various ways. Apart from <literal>Depends</literal>, other relationship fields are <literal>Recommends</literal>, <literal>Suggests</literal>, <literal>Pre-Depends</literal>, <literal>Breaks</literal>, <literal>Conflicts</literal>, <literal>Provides</literal>, and <literal>Replaces</literal>.
ca: La línia 11 mostra una de les més poderoses possibilitats del sistema de paquets de Debian. És possible relacionar els paquets entre ells. A més de <literal>Depends</literal> (depèn de) altres camps de relació són <literal>Recommends</literal> (recomana), <literal>Suggests</literal> (suggereix), <literal>Pre-Depends</literal> (predepèn de), <literal>Breaks</literal> (﻿trenca a), <literal>Conflicts</literal> (entre en conflicte amb), <literal>Provides</literal> (proveeix), <literal>Replaces</literal> (﻿reemplaça a) <footnote><para>N. de t.: consulta les XXX_FIXME_url_XXX id=http://www.debian.org/doc/FAQ/ch-pkg_basics.en.html#s-depends name=preguntes més frequents de Debian XXX_XXX si vols una explicació més detallada de cada possibilitat. </para></footnote>.
es: La línea 11 muestra una de las más poderosas posibilidades del sistema de paquetes de Debian. Los paquetes se pueden relacionar unos con otros de diversas formas. Aparte de <literal>Depends</literal> (depende de) otros campos de relación son <literal>Recommends</literal> (recomienda), <literal>Suggests</literal> (sugiere), <literal>Pre-Depends</literal> (predepende de), <literal>Breaks</literal> (rompe a), <literal>Conflicts</literal> (entra en conflicto con), <literal>Provides</literal> (provee), <literal>Replaces</literal> (reemplaza a).
fr: La ligne 11 montre une des caractéristiques les plus puissantes du système de paquet Debian. Les paquets peuvent être liés entre eux de plusieurs façons. Hormis <literal>Depends</literal>, les autres champs décrivant ces relations sont <literal>Recommends</literal>, <literal>Suggests</literal>, <literal>Pre-Depends</literal>, <literal>Breaks</literal>, <literal>Conflicts</literal>, <literal>Provides</literal> et <literal>Replaces</literal>.
ja: 11行目からはDebianのパッケージシステムが強力なことがわかります。パッケージは様々な形で相互に関係することができます。<literal>Depends</literal>の他には、<literal>Recommends</literal>、 <literal>Suggests</literal>、<literal>Pre-Depends</literal>、<literal>Breaks</literal>、 <literal>Conflicts</literal>、<literal>Provides</literal>、<literal>Replaces</literal>などがあります。

source: The package management tools usually behave the same way when dealing with these relations; if not, it will be explained. (see <citerefentry> <refentrytitle>dpkg</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>dselect</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>apt</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>aptitude</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> etc.)
ca: Les eines de gestió de paquets tracten de la mateixa manera les relacions entre els paquets; els casos en què no és així s'explicaran en el seu moment (consulta <citerefentry> <refentrytitle>dpkg</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>dselect</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>apt</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>aptitude</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, etc.).
es: Las herramientas de gestión de paquetes se comportan habitualmente de la misma forma cuando tratan con esas relaciones entre paquetes; si no es así, se explicará en cada caso. (véase <citerefentry> <refentrytitle>dpkg</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>dselect</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>apt</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>aptitude</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, etc.)
fr: Les outils de gestion de paquets se comportent d'ordinaire de la même manière quand ils gèrent ces relations ; sinon, ce sera précisé (voir <citerefentry> <refentrytitle>dpkg</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>dselect</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>apt</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>aptitude</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, etc.)
it: Gli strumenti di gestione dei pacchetti solitamente si comportano allo stesso modo quando si occupano di tali relazioni; in caso contrario, il comportamento verrà spiegato. (si legga <citerefentry> <refentrytitle>dpkg</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>dselect</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>apt</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry> <refentrytitle>aptitude</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> ecc.)
ja: 異なるパッケージ管理ツールであっても、通常この関係処理に同じ動作をします。そうでない場合については、後から説明します。(<citerefentry> <refentrytitle>dpkg</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>、<citerefentry> <refentrytitle>dselect</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>、<citerefentry> <refentrytitle>apt</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>、<citerefentry> <refentrytitle>aptitude</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>などを参照してください。)

source: This is what the dependencies mean:
es: A continuación se detalla el significado de las dependencias:
fr: Voici la signification des dépendances :

source: The package will not be installed unless the packages it depends on are installed. Use this if your program absolutely will not run (or will cause severe breakage) unless a particular package is present.
ca: El programa no s'instal·larà fins què s'instal·lin els paquets dels quals depèn. Fes servir aquesta opció si el teu programa no funciona (o es trenca fàcilment) sense un paquet determinat.
es: No se instalará el programa a menos que los paquetes de los que depende estén ya instalados. Usa esto si tu programa no funcionará de ninguna forma (o se romperá fácilmente) a no ser que se haya instalado un paquete determinado.
fr: le paquet ne sera pas installé sans que les paquets dont il dépend ne soient installés. Utilisez-le si le programme ne s'exécute absolument pas (ou cause des dégâts sérieux) si un paquet particulier n'est pas présent ;
it: Il pacchetto non verrà installato a meno che tutti i pacchetti da cui dipende vengono installati. Si usi questa relazione se il programma non funzionerà assolutamente (o sarà praticamente inutilizzabile) a meno della presenza di particolari pacchetti.
ja: 依存しているパッケージがインストールされない限り、パッケージはインストールされません。あなたのプログラムが特定のパッケージなしでは動かない(または深刻な破損の原因になる恐れがある)場合はこれを使います。

source: Use this for packages that are not strictly necessary but are typically used with your program. When a user installs your program, all frontends will likely prompt them to install the recommended packages. <command>aptitude</command> and <command>apt-get</command> install recommended packages along with your package (but the user can disable this default behaviour). <command>dpkg</command> will ignore this field.
ca: Aquesta opció és per a paquets que no són imprescindibles per al funcionament del programa però que es fan servir juntament amb ell. Quan els usuaris instal·lin el teu paquet, totes les interfícies d'instal·lació aconsellaran la instal·lació dels paquets recomanats. <command>aptitude</command> i <command>apt-get</command> instal·len els paquets recomanats (però l'usuari pot decidir no fer-ho). <command>dpkg</command> ignora el contingut d'aquest camp.
es: Esta opción es para paquetes cuya instalación no es estrictamente necesaria para el funcionamiento de tu programa pero que suelen utilizarse junto con tu programa. Cuando los usuarios instalen tu paquete, todas las interfaces de instalación aconsejaran la instalación de los paquetes recomendados. <command>aptitude</command> y <command>apt-get</command> instalan los paquetes recomendados (pero el usuario puede decidir no hacerlo). <command>dpkg</command> ignora el contenido de este campo.
fr: à utiliser pour les paquets qui ne sont pas vraiment indispensables mais qui sont typiquement utilisés avec le programme. Lorsqu'un utilisateur installe le paquet, toutes les interfaces devraient proposer d'installer les paquets recommandés. <command>aptitude</command> et <command>apt-get</command> installent les paquets recommandés avec le paquet (mais l'utilisateur peut désactiver ce comportement par défaut). <command>dpkg</command> ignorent ce champ ;
it: Si usi questa relazione per pacchetti che non sono strettamente necessari ma sono solitamente utilizzati dal programma. Quando un utente installa il programma, tutte le interfacce probabilmente chiederanno l'installazione dei pacchetti raccomandati. <command>aptitude</command> e <command>apt-get</command> installano i pacchetti raccomandati insieme al pacchetto principale (ma l'utente può disabilitare questo comportamento predefinito). <command>dpkg</command> ignorerà questo campo.
ja: 厳密には必須ではないけれど通常一緒に使われるようなパッケージを指定します。あなたのプログラムをユーザーがインストールする時、フロントエンドが推奨しているパッケージも一緒にインストールするか確認します。<command>aptitude</command>や<command>apt-get</command>の場合は、推奨パッケージも一緒にインストールします。(ユーザーはこの機能を無効化できます。)<command>dpkg</command>は推奨されるパッケージを無視します。

source: Use this for packages which will work nicely with your program but are not at all necessary. When a user installs your program, all frontends will likely prompt them to install the suggested packages. <command>aptitude</command> can be configured to install suggested packages along with your package but this is not its default. <command>dpkg</command> and <command>apt-get</command> will ignore this field.
ca: En instal·lar el paquet, tots els programes informaran a l'usuari que pot instal·lar els paquets suggerits. És possible configurar <command>aptitude</command> per a què instal·li els paquets suggerits (no és l'opció per defecte). <command>dpkg</command> i <command>apt-get</command> ignoren aquestes dependències. Fes servir aquesta opció per a paquets que funcionaran bé amb el teu programa però que no són amb absolut necessaris.
es: Cuando un usuario instale el paquete, todos los programas le informarán de que puede instalar los paquetes sugeridos. Es posible configurar <command>aptitude</command> para que instale los paquetes sugeridos, aunque no es la opción predeterminada. <command>dpkg</command> y <command>apt-get</command>, que ignorarán estas dependencias. Utiliza esto para paquetes que funcionarán bien con tu programa pero que no son necesarios en absoluto.
fr: à utiliser pour les paquets qui fonctionnent bien avec le programme mais qui ne sont pas du tout indispensables. Lorsqu'un utilisateur installe le programme, toutes les interfaces devraient proposer d'installer les paquets suggérés. <command>aptitude</command> peut être configuré pour installer les paquets suggérés avec le paquet mais ce n'est pas le comportement par défaut. <command>dpkg</command> et <command>apt-get</command> ignore ce champ ;
it: Si usi questa relazione per pacchetti che funzionano bene con il programma ma non sono per niente necessari. Quando un utente installa il programma, tutte le interfacce probabilmente chiederanno l'installazione dei pacchetti consigliati. <command>aptitude</command> può essere configurato per installare i pacchetti consigliati insieme al pacchetto principale ma questo non è il comportamento predefinito. <command>dpkg</command> ed <command>apt-get</command> ignoreranno questo campo.
ja: 必要ではないものの、一緒に使用すると便利なパッケージを指定します。あなたのプログラムをユーザーがインストールする時、フロントエンドが提案しているパッケージも一緒にインストールするか確認します。<command>aptitude</command>は提案パッケージを一緒にインストールするように変更することが可能ですが、デフォルトではありません。<command>dpkg</command>と<command>apt-get</command>は提案されるパッケージを無視します。

source: The package will not be installed until all the packages it conflicts with have been removed. Use this if your program absolutely will not run or will cause severe problems if a particular package is present.
ca: El paquet no s'instal·larà fins què tots el paquets amb els quals entre en conflicte siguin eliminats. Fes servir aquesta opció si el teu programa no funcionarà amb absolut (o fallarà fàcilment) si un paquet en concret no està instal·lat.
es: El paquete no se instalará hasta que todos los paquetes con los que entra en conflicto hayan sido eliminados. Utiliza esto si tu programa no funcionará en absoluto (o fallará fácilmente) si un paquete en concreto está instalado.
fr: le paquet ne sera pas installé tant que les paquets avec lesquels il est en conflit n'aient été retirés. À utiliser si le programme ne peut absolument pas fonctionner ou s'il cause d'énormes problèmes quand un paquet particulier est présent ;
it: Il pacchetto non verrà installato a meno che tutti i pacchetti con i quali va in conflitto siano rimossi. Si usi questa relazione se il programma non funzionerà o causerà gravi problemi se un certo pacchetto è presente.
ja: 競合しているパッケージが削除されない限り、パッケージはインストールされません。あなたのプログラムが特定のパッケージと一緒だと動かない（または深刻な破損の原因になる恐れがある）場合はこれを使います。

source: The package will be installed while all the listed packages will be broken. Normally a <literal>Breaks</literal> entry has an earlier than version clause. The resolution is generally to upgrade the listed packages by the higher-level package management tools.
ca: Si el paquet s'instal·la, tots els paquets de la llista es trencaran. Normalment, els paquets inclosos en la llista <literal>Breaks</literal> tenen una clàusula de versió anterior. La solució és actualitzar els paquets de la llista a la versió més actual.
es: Si el paquete se instala, todos los paquetes de la lista se romperán. Normalmente, los paquetes incluidos en la lista <literal>Breaks</literal> tienen una cláusula de versión anterior. La solución es actualizar los paquetes de la lista a la versión más actual.
fr: le paquet sera installé pendant que les paquets énumérés seront cassés. Normalement les paquets du champ <literal>Breaks</literal> ont une relation « version antérieure à ». La résolution de conflits conduit généralement à mettre à niveau les paquets énumérés par les outils de gestion de paquets de haut niveau ;
it: Il pacchetto verrà installato, mentre tutti gli altri pacchetti saranno marcati come guasti. Normalmente la voce <literal>Breaks</literal> si ha per via della clausola di versione prima di. Per risolvere il problema, generalmente, basta aggiornare la lista dei pacchetti utilizzando uno strumento di gestione di alto livello, del sistema di pacchettizzazione.
ja: パッケージがインストールされると、あるパッケージが壊れる場合に指定します。通常、<literal>Breaks</literal>の項目は旧バージョンに対する制約になっています。パッケージマネジメントツールは、記載されたパッケージのバージョンを上げることで解決する場合がほとんどです。

source: For some types of packages where there are multiple alternatives virtual names have been defined. You can get the full list in the <filename>/usr/share/doc/debian-policy/virtual-package-names-list.txt.gz</filename> file. Use this if your program provides a function of an existing virtual package.
es: Se han definido nombres virtuales para algunos tipos determinados de paquetes que ofrecen múltiples alternativas para la misma función. Puedes obtener la lista completa en el fichero <filename>/usr/share/doc/debian-policy/virtual-package-names-list.text.gz</filename>. Usa esto si tu programa ofrece las funciones de un paquete virtual que ya exista.
fr: quand il y a plusieurs alternatives pour certains types de paquets, des noms virtuels ont été définis. La liste complète est disponible dans le fichier <filename>/usr/share/doc/debian-policy/virtual-package-name-list.txt.gz</filename>. À utiliser si le programme fournit une fonction d'un paquet virtuel existant ;
