Repository: lurdan/trans-ddp
Catalog: maint-guide/po4a/maint-guide.*.po
Languages: ca, es, fr, it, ja

source: <filename><replaceable>package</replaceable>.init</filename> and <filename><replaceable>package</replaceable>.default</filename> files
ca: Fitxers <filename><replaceable>nom_paquet</replaceable>.init</filename> <filename><replaceable>nom_paquet</replaceable>.default</filename>
es: Archivos <filename><replaceable>nombre_del_paquete</replaceable>.init</filename> y <filename><replaceable>nombre_del_paquete</replaceable>.default</filename>
fr: Fichiers <filename><replaceable>paquet</replaceable>.init</filename> et <filename><replaceable>paquet</replaceable>.default</filename>
it: I file <filename><replaceable>pacchetto</replaceable>.init</filename> e <filename><replaceable>pacchetto</replaceable>.default</filename>
ja: <filename><replaceable>package</replaceable>.init</filename> と <filename><replaceable>package</replaceable>.default</filename> ファイル

source: If your package is a daemon that needs to be run at the system start-up, you've obviously disregarded my initial recommendation, haven't you? :-)
ca: Si el teu paquet és un dimoni que s'executa en iniciar-se el sistema, és que no has fet cas a la meva recomanació inicial, o no? :-)
es: Si tu paquete es un demonio que necesita ejecutarse en el arranque del sistema, obviamente has desatendido mi recomendación inicial, ¿o no? :-)
fr: Si votre paquet est un démon qui doit être exécuté au démarrage du système, vous avez de toute évidence ignoré les recommandations initiales, n'est-ce-pas ? :-)
it: Se il pacchetto generato è un demone che deve partire all'avvio del sistema, hai chiaramente ignorato le mie raccomandazioni iniziali, vero? :-)
ja: もしあなたのパッケージがデーモンであり、システムの起動時に 自動的に動作させる必要があるとしたら、私が最初に勧めたことを あなたはまるっきり無視してしまったわけですよね。そうでしょ ?:-)

source: The <filename><replaceable>package</replaceable>.init</filename> file is installed as the <filename>/etc/init.d/<replaceable>package</replaceable></filename> script. Its fairly generic skeleton template is provided by the <command>dh_make</command> command as <filename>init.d.ex</filename>. You'll likely have to rename and edit it, a lot, while making sure to provide Filesystem Hierarchy Standard (see <filename>/usr/share/doc/debian-policy/fhs/</filename>) compliant headers. It gets installed into the temporary directory by <citerefentry> <refentrytitle>dh_installinit</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
es: El archivo <filename><replaceable>nombre_del_paquete</replaceable>.init</filename> se instala como un guión en <filename>/etc/init.d/<replaceable>nombre_del_paquete</replaceable></filename>. Se trata de una plantilla genérica construida por la orden <command>dh_make</command> como <filename>init.d.ex</filename>. Deberás renombrarlo y hacerle muchos cambios para asegurarte que cumpla con las cabeceras del estándar de la jerarquía del sistema de archivos («Filesystem Hierarchy Standard» véase <filename>/usr/share/doc/debian-policy/fhs/</filename>). <citerefentry> <refentrytitle>dh_installinit</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> lo instalará en el directorio temporal.
fr: Le fichier <filename><replaceable>paquet</replaceable>.init</filename> est installé comme un script en <filename>/etc/init.d/<replaceable>paquet</replaceable></filename>. Un squelette de modèle générique est fournit par la commande <command>dh_make</command> en <filename>init.d.ex</filename>. Vous devrez sans doute le renommer et le modifier, beaucoup, en vous assurant que les en-têtes respectent la norme de hiérarchie de fichiers (cf. <filename>/usr/share/doc/debian-policy/fhs/</filename>). Il est installé dans le répertoire temporaire par <citerefentry> <refentrytitle>dh_installinit</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.

source: If you don't need this, remove the files.
ca: Elimina el fitxer si no el fas servir.
es: Elimina el fichero si no lo necesitas.
fr: Si vous n'en avez pas besoin, effacez ces fichiers.
it: Se non si ha bisogno di tutto ciò, si possono rimuovere i file.
ja: 不要なら、このファイルを削除してください。

source: <filename>install</filename> file
ca: Fitxer <filename>install</filename>.
es: Archivo <filename>install</filename>
fr: Fichier <filename>install</filename>
it: Il file <filename>install</filename>
ja: <filename>install</filename> ファイル

source: This replaces the deprecated <citerefentry> <refentrytitle>dh_movefiles</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> command which is configured by the <filename>files</filename> file.
ca: Aquesta ordre reemplaça l'ordre obsoleta <citerefentry> <refentrytitle>dh_movefiles</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> que feia servir el fitxer <filename>files</filename>.
es: Esto reemplaza la orden obsoleta <citerefentry> <refentrytitle>dh_movefiles</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> que se configuraba con el archivo <filename>files</filename>.
fr: Cela remplace la commande obsolète <citerefentry> <refentrytitle>dh_movefiles</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> configurée par le fichier <filename>files</filename>.
it: Questo comando rimpiazza il comando <citerefentry> <refentrytitle>dh_movefiles</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, ormai deprecato, che veniva configurato dal file <filename>files</filename>.
ja: <filename>files</filename>ファイルによって、<citerefentry> <refentrytitle>dh_movefiles</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>コマンドが設定され、置換されます。

source: If there are files that need to be installed into your package but your standard <literal>make install</literal> won't do it, you put the filenames and destinations into this <filename>install</filename> file. They are installed by <citerefentry> <refentrytitle>dh_install</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.<placeholder type="footnote" id="0"/> You should first check there is not a more specific tool to use. For example, documents should be in the <filename>docs</filename> file and not in this one.
ca: Si hi ha fitxers que han d'ésser instal·lats pel paquet però <literal>make install</literal> no ho fa, pots llistar els fitxers i les seves destinacions a l'arxiu <filename>install</filename>. S'encarregarà de la instal·lació l'ordre <citerefentry> <refentrytitle>dh_install</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> <placeholder type="footnote" id="0"/>. Comprova que no hi ha un mètode més específic per fer aquesta instal·lació. Per exemple, en el cas de la documentació, cal fer servir el fitxer <filename>docs</filename>.
es: Si hay archivos que deben ser instalados por el paquete pero no lo hace <literal>make install</literal> , puedes listar los archivos y sus destinos en el archivo <filename>install</filename>. Se encargará de la instalación la orden <citerefentry> <refentrytitle>dh_install</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> <placeholder type="footnote" id="0"/>. Debes asegurarte que no hay un sistema más específico para hacer esta instalación. Por ejemplo, para la documentación debes utilizar el archivo <filename>docs</filename>, en lugar de este archivo.
fr: Si des fichiers doivent être installés dans le paquet mais que « <literal>make install</literal> » normal ne le fait pas, il faut ajouter les noms de fichiers et leur destination dans ce fichier <filename>install</filename>. Il sont installés par <citerefentry> <refentrytitle>dh_install</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.<placeholder type="footnote" id="0"/> Vous devriez d'abord vérifier s'il n'y a pas un outil plus approprié à utiliser. Par exemple, les documents devraient être dans le fichier <filename>docs</filename> et non dans celui-ci.
it: Se ci sono dei file che devono essere installati nel pacchetto ma con il normale comando <literal>make install</literal> non vengono elaborati, i nomi di quest'ultimi e le cartelle di destinazione vanno messe in questo file <filename>install</filename>. Tali file vengono installati con il comando <citerefentry> <refentrytitle>dh_install</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.<placeholder type="footnote" id="0"/> Andrebbe innanzitutto controllato che non ci sia uno strumento più specifico da poter utilizzare. Per esempio, i documenti dovrebbero essere elencati nel file <filename>docs</filename> e non in questo file.
ja: パッケージにとってインストールが必要なファイルがあるにも関わらず、 <literal>make install</literal>ではインストールされない場合、そのファイル名とファイルを置く目的地を<filename>install</filename>ファイルに記述します。そうすると、<citerefentry> <refentrytitle>dh_install</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>によってそれらのファイルがインストールされます。<placeholder type="footnote" id="0"/> まずは使えそうな別のツールがないかどうかを調べましょう。例えば、ドキュメントはこのファイルではなく<filename>docs</filename>ファイルにあるべきです。

source: This <filename>install</filename> file has one line per file installed, with the name of the file (relative to the top build directory) then a space then the installation directory (relative to the install directory). One example of where this is used is where a binary is forgotten to be installed, the <filename>install</filename> file would look like:
ca: En el fitxer <filename>install</filename> hi haurà una línia per a cada un dels fitxers a instal·lar, amb el seu nom (sempre relatiu al directori superior de la compilació) i després d'un espai, el directori d'instal·lació (relatiu al directori d'instal·lació). En el cas que no s'instal·li el fitxer binari del <filename>gentoo</filename>, hauries d'escriure el següent:
es: El archivo <filename>install</filename> tendrá una línea para cada uno de los archivos a instalar, con el nombre del archivo (relativo al directorio superior de la compilación) seguido de un espacio y a continuación el directorio de instalación (relativo al directorio superior de instalación). Suponiendo que el archivo binario no se instalase, deberías utilizar el archivo <filename>install</filename> como sigue:
fr: Ce fichier <filename>install</filename> possède une ligne par fichier installé, avec le nom du fichier (par rapport au répertoire de construction principal) suivi d'un espace puis du répertoire d'installation (par rapport au répertoire d'installation). Par exemple, si un binaire est oublié lors de l'installation, le fichier <filename>install</filename> ressemblera à :
it: Nel file <filename>install</filename> compare una riga per ogni file installato, contenente il nome del file (relativo alla directory in cui avviene la costruzione del pacchetto), uno spazio e la directory di installazione (relativa alla posizione del file install). Un esempio dell'utilizzo è quando un file binario non è stato installato, in questo caso il file <filename>install</filename> dovrebbe essere:

source: src/foo/mybin usr/bin
ca: src/nom_paquet/arxiu_binari usr/bin
es: src/nombre_del_paquete/nombre_archivo_binario usr/bin
fr: src/toto/monbin usr/bin

source: This will mean when this package is installed, there will be a binary file <filename>/usr/bin/mybin</filename>.
ca: Quan s'instal·li el paquet, s'instal·larà el fitxer binari en <filename>/usr/bin/arxiu_binari</filename>.
es: Al instalarse el paquete, se instalará el archivo binario <filename>/usr/bin/nombre_archivo_binario</filename>.
fr: Cela signifie que lors de l'installation du paquet, il y aura un fichier binaire <filename>/usr/bin/monbin</filename>.
it: Questo significa che quando il pacchetto verrà installato, ci sarà un file binario <filename>/usr/bin/mybin</filename>.

source: Alternatively, this <filename>install</filename> can have the name of the file only without the installation directory when the relative directory path does not change. This format is usually used for a large package that splits build result into multiple binary packages using <filename><replaceable>package-1</replaceable>.install</filename>, <filename><replaceable>package-2</replaceable>.install</filename>, etc.
ca: En el fitxer <filename>install</filename> pots escriure el nom del fitxer sense el directori d'instal·lació sempre que la ruta relativa de directori no canvii. Aquest format es fa servir amb paquets grans que separen el resultat de la compilació en més d'un paquet binari fent servir el conjunt de fitxers <filename><replaceable>nom_paquet-1</replaceable>.install</filename>, <filename><replaceable>nom_paquet-2</replaceable>.install</filename>, etc.
es: En el archivo <filename>install</filename> puedes escribir el nombre del archivo sin el directorio de instalación siempre que no cambie la ruta relativa de directorio. Este formato se usa en paquetes grandes que separan el resultado de la compilación en múltiples paquetes binarios haciendo uso de <filename><replaceable>nombre_del_paquete-1</replaceable>.install</filename>, <filename><replaceable>nombre_del_paquete-2</replaceable>.install</filename>, etc.
fr: Ce fichier <filename>install</filename> peut renseigner seulement le nom du fichier sans le répertoire d'installation quand le chemin relatif n'est pas modifié. Ce format est normalement utilisé pour un gros paquet qui découpe le résultat de la construction en multiples paquets binaires à l'aide de <filename><replaceable>paquet-1</replaceable>.install</filename>, <filename><replaceable>paquet-2</replaceable>.install</filename>, etc.
it: Alternativamente, questo file <filename>install</filename> può presentare il nome del file senza la directory di installazione solo quando il percorso relativo della directory non cambia. Questo formato è solitamente utilizzato per grandi pacchetti che organizzano i risultati della costruzione in pacchetti multipli utilizzando <filename><replaceable>pacchetto-1</replaceable>.install</filename>, <filename><replaceable>pacchetto-2</replaceable>.install</filename>, ecc.
ja: また、この<filename>install</filename>ファイルは相対パスが変わらない場合、インストールディレクトリの指定を省略することもできます。この書式はビルドした結果を、<filename><replaceable>package-1</replaceable>.install</filename>, <filename><replaceable>package-2</replaceable>.install</filename>, などを使用し、複数のバイナリパッケージに分割するような、大規模なパッケージで使われます。

source: The <command>dh_install</command> command will fall back to look in <filename>debian/tmp</filename> for files, if it doesn't find them in the current directory (or wherever you've told it to look using <literal>--sourcedir</literal>).
ca: L'ordre <command>dh_install</command> revisarà el directori <filename>debian/tmp</filename> per cercar els fitxers si no els troba en el directori actual (o en la ubicació establerta per a la recerca amb l'opció <literal>--sourcedir</literal>).
es: La orden <command>dh_install</command> retrocederá al directorio <filename>debian/tmp</filename> buscar los archivos si no los encuentra en el directorio actual (o en la ubicación que hayas establecido con para la búsqueda con <literal>--sourcedir</literal>).
fr: La commande <command>dh_install</command> finira par chercher les fichiers dans <filename>debian/tmp</filename>, s'il ne les trouve pas dans le répertoire courant (ou quelque soit l'endroit où il lui a été demandé de chercher avec <literal>--sourcedir</literal>).
it: Il comando <command>dh_install</command> andrà a controllare nella cartella <filename>debian/tmp</filename> alla ricerca di file, se non ne trova nella directory corrente (or in qualsiasi altro posto si sia indicato di guardare utilizzando <literal>--sourcedir</literal>).
ja: <command>dh_install</command> コマンドはもし、カレントディレクトリでファイルが見つからなかった場合は、(または、<literal>--sourcedir</literal> で探すように指示したディレクトリ内で見つからなかった場合は)フォールバックして <filename>debian/tmp</filename>内を検索します。

source: <filename><replaceable>package</replaceable>.info</filename> file
ca: Fitxer <filename><replaceable>nom_paquet</replaceable>.info</filename>.
es: Archivo <filename><replaceable>nombre_del_paquete</replaceable>.info</filename>
fr: Fichier <filename><replaceable>paquet</replaceable>.info</filename>
it: <filename><replaceable>pacchetto</replaceable>.info</filename>
ja: <filename><replaceable>package</replaceable>.info</filename> ファイル

source: If your package has info pages, you should install them using <citerefentry> <refentrytitle>dh_installinfo</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> by listing them in the <filename><replaceable>package</replaceable>.info</filename> files.
ca: Si el teu paquet fa servir fitxers «info» (sistema d'ajuda), pots instal·lar-los fent servir <citerefentry> <refentrytitle>dh_installinfo</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> que utilitzarà el llistat del fitxer <filename><replaceable>package</replaceable>.info</filename>.
es: Si tu paquete utiliza páginas de información («info pages»), podrás instalarlas utilizando <citerefentry> <refentrytitle>dh_installinfo</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> que utilizará el listado del archivo <filename><replaceable>package</replaceable>.info</filename>.
fr: Si le paquet possède des pages d'information, vous devriez les installer avec <citerefentry> <refentrytitle>dh_installinfo</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> en les énumérant dans les fichiers <filename><replaceable>paquet</replaceable>.info</filename>.
it: Se il pacchetto generato ha delle pagine informative, queste andrebbero installate utilizzando il comando <citerefentry> <refentrytitle>dh_installinfo</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> ed elencandole nei file <filename><replaceable>pacchetto</replaceable>.info</filename>.
ja: パッケージにinfoページがある場合、<filename><replaceable>package</replaceable>.info</filename>にそれらを挙げて、<citerefentry> <refentrytitle>dh_installinfo</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>を使用してインストールします。

source: <filename>{<replaceable>package</replaceable>.|source/}lintian-overrides</filename> files
ca: Fitxers <filename>{<replaceable>nom_arxiu</replaceable>.|source/}lintian-overrides</filename>
es: Archivos <filename>{<replaceable>nombre_del_paquete</replaceable>.|source/} lintian-overrides</filename>
fr: Fichiers <filename>{<replaceable>paquet</replaceable>.|source/}lintian-overrides</filename>
it: I file <filename>{<replaceable>pacchetto</replaceable>.|source/}lintian-overrides</filename>
ja: <filename>{<replaceable>package</replaceable>.|source/}lintian-overrides</filename> ファイル

source: If <systemitem role="package">lintian</systemitem> reports an erroneous diagnostics for a case when the policy allows exceptions to some rule, you can use <filename><replaceable>package</replaceable>.lintian-overrides</filename> or <filename>source/lintian-overrides</filename> to quiet it. Please read <filename>/usr/share/doc/lintian/lintian.html/index.html</filename> and refrain from abusing this.
es: Si el programa <systemitem role="package">lintian</systemitem> emite un informe de diagnóstico erróneo en algún caso en que las normas admitan excepciones, podrás utilizar los archivos <filename><replaceable>nombre_del_paquete</replaceable>.lintian-overrides</filename> o <filename>source/lintian-overrides</filename> para evitar que se emita el error. Por favor, lee <filename>/usr/share/doc/lintian/lintian.html/index.html</filename> error y procura no abusar de esta opción (para ocultar errores auténticos).
fr: Si <systemitem role="package">lintian</systemitem> signale des erreurs dans son diagnostique alors que la Charte accepte des exceptions à certaines règles, vous pouvez utiliser <filename><replaceable>paquet</replaceable>.lintian-overrides</filename> ou <filename>source/lintian-overrides</filename> pour le rendre silencieux. Veuillez lire <filename>/usr/share/doc/lintian/lintian.html/index.html</filename> et vous abstenir d'en abuser.

source: <filename><replaceable>package</replaceable>.lintian-overrides</filename> is for the binary package named as <systemitem role="package"><replaceable>package</replaceable></systemitem> and is installed into <filename>usr/share/lintian/overrides/<replaceable>package</replaceable></filename> by the <command>dh_lintian</command> command.
ca: El fitxer <filename><replaceable>nom_paquet</replaceable>.lintian-overrides</filename> és per a un paquet binari amb el nom <systemitem role="package"><replaceable>nom_paquet</replaceable></systemitem> i s'instal·la a <filename>usr/share/lintian/overrides/<replaceable>nom_paquet</replaceable></filename> per l'ordre <command>dh_lintian</command>.
es: <filename><replaceable>nombre_del_paquete</replaceable>.lintian-overrides</filename> es para un paquete binario con el nombre <systemitem role="package"><replaceable>nombre_del_paquete</replaceable></systemitem> y es instalado en <filename>usr/share/lintian/overrides/<replaceable>nombre_del_paquete</replaceable></filename> por la orden <command>dh_lintian</command>.
fr: <filename><replaceable>paquet</replaceable>.lintian-overrides</filename> concerne le paquet binaire appelé <systemitem role="package"><replaceable>paquet</replaceable></systemitem>, il est installé en <filename>usr/share/lintian/overrides/<replaceable>paquet</replaceable></filename> par la commande <command>dh_lintian</command>.
it: Il file <filename><replaceable>pacchetto</replaceable>.lintian-overrides</filename> è ovviamente utilizzato per il pacchetto binario chiamato <systemitem role="package"><replaceable>pacchetto</replaceable></systemitem> ed è installato in <filename>usr/share/lintian/overrides/<replaceable>pacchetto</replaceable></filename> dal comando <command>dh_lintian</command>.
ja: <filename><replaceable>package</replaceable>.lintian-overrides</filename>は<systemitem role="package"><replaceable>package</replaceable></systemitem>と名づけられたパッケージのためのファイルで、<command>dh_lintian</command>コマンドによって<filename>usr/share/lintian/overrides/<replaceable>package</replaceable></filename>にインストールされます。

source: <filename>source/lintian-overrides</filename> is for the source package. This is not installed.
ca: El fitxer <filename>source/lintian-overrides</filename> és per als paquets de codi original i no s'instal·la.
es: El archivo <filename>source/lintian-overrides</filename> es para los paquetes de fuentes y no se instala.
fr: <filename>source/lintian-overrides</filename> concerne le paquet source. Il n'est pas installé.
it: Il file <filename>source/lintian-overrides</filename> è utilizzato per il pacchetto sorgente. Questo non viene installato.
ja: <filename>source/lintian-overrides</filename>はソースパッケージのためのファイルです。これはインストールされません。

source: <filename>manpage.*</filename> files
ca: Fitxers <filename>manpage.*</filename>.
es: Archivos <filename>manpage.*</filename>
fr: Fichiers <filename>manpage.*</filename>
it: I file <filename>manpage.*</filename>
ja: <filename>manpage.*</filename>ファイル
