<!-- CVS revision of original english document "1.13" -->
<chapt id="nexttime">Erwartete &Auml;nderungen das n&auml;chste major release von Debian

<!-- XXX update for new distros -->

<sect id="security">Erh&ouml;hte Sicherheit

<p>Debian enth&auml;hlt unterst&uuml;zung f&uuml;r shadow Passw&ouml;rter seit release 1.3. 
Zus&auml;tzlich ist noch die Linux library f&uuml;r Pluggable Authentisierungs Module (alias
<url name="libpam" id="http://www.kernel.org/pub/linux/libs/pam/">;) das
erlaubt sysadmins die Autentiesierungsmethode von einer besimmten Anwendung zu w&auml;hlen
und standardm&auml;&szlig;ig ist es auf die Autentisierung &uuml;ber shadow Passw&ouml;rter eingestellt.

<p>Beinhaltet verscheidene andere Autentisierungs Methoden wie
Kerberos, sowie zus&auml;tzliche Sicherheitsverbesserungen f&uuml;r die Zugriffssteuerung
Kontrollmechanismen wie SElinux, RSBAC und buffer overflow protection,
Exec-shield or PaX sind momentan in Arbeit.

<sect id="i18n">Erweiterte unterst&uuml;tzung f&uuml;r nicht Englisch Sprachige User

<p>Debian hat bereits sher gute unterst&uuml;tzung f&uuml;r nicht Englisch Sprachige User, siehe
<ref id="nonenglish">.

<p>Wir hoffen weitere Leute zu finden welche uns helfen mehr Sprachen zu Unterst&uuml;tzen
und zu &uuml;bersetzen. Einige Programme unterst&uuml;tzen bereits Lokalisiert, so das wir
Nachrichten Katalog &Uuml;bersetzer brauchen. Weitere Programme warten noch auf ihre Lokalisierung.

<p>Das GNU Translation Project <url id="ftp://ftp.gnu.org/pub/gnu/ABOUT-NLS">
arbeitet an der Lokalisierung der GNU Programme.

<sect id="morearches">Mehr (Rechner)Architekturen

<p>Kompletes Debian System auf anderen Architekturen wie AMD64 oder SuperH
wird bald erwartet. Beachten Sie, das f&uuml;r AMD64 ein entwicklungs Archive
auf <url id="http://amd64.debian.net/"> existiert, das Installations-Images und
Bin&auml;r Packete f&uuml;r den Gro&szlig;teil der Distribution anbietet. Diese
Architektur wird vermutlich bald zu <tt>etch</tt> hinzugef&uuml;gt.

<sect id="morekernels">Mehr Kernel

<p>Zus&auml;tzich zu Debian GNU/Hurd, wird Debian f&uuml;r die
BSD Kernel portiert, zu finden unter 
<url id="http://www.debian.org/ports/netbsd" name="NetBSD">.

