Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: with format “3.0 (native)”, it has only a single <filename>.tar.{gz,bz2,xz}</filename> tarball.
de: mit Format »3.0« (nativ) hat es nur einen einzelnen <filename>.tar.{gz,bz2,xz}</filename>-Tarball.
fr: une seule archive <filename>.tar.{gz,bz2,xz}</filename> pour le format « 3.0 (native) ».
ja: フォーマット“3.0 (native)”では、単一の <filename>.tar.{gz,bz2,xz}</filename> tarball のみを持っています。

source: If a package is developed specially for Debian and is not distributed outside of Debian, there is just one <filename>.tar.{gz,bz2,xz}</filename> file which contains the sources of the program, it's called a “native” source package. If a package is distributed elsewhere too, the <filename>.orig.tar.{gz,bz2,xz}</filename> file stores the so-called <literal>upstream source code</literal>, that is the source code that's distributed by the <literal>upstream maintainer</literal> (often the author of the software). In this case, the <filename>.diff.gz</filename> or the <filename>debian.tar.{gz,bz2,xz}</filename> contains the changes made by the Debian maintainer.
de: Falls das Paket speziell für Debian entwickelt wurde und nicht außerhalb von Debian verteilt wird, gibt es dort nur eine <filename>.tar.{gz,bz2,xz}</filename>-Datei, die den Quellcode des Programms enthält, »natives« Quellpaket genannt. Falls ein Paket auch anderswo verteilt wird, wird in der <filename>.orig.tar.{gz,bz2,xz}</filename>-Datei der sogenannte <literal>upstream source code</literal> gespeichert, das ist der Quellcode, vom <literal>upstream maintainer</literal> (oft dem Autor der Software). In diesem Fall enthalten die Dateien <filename>.diff.gz</filename> oder <filename>debian.tar.{gz,bz2,xz}</filename> die Änderungen, die durch den Debian-Betreuer vorgenommen wurden.
fr: Si un paquet est développé spécifiquement pour le projet Debian et n'est pas distribué en dehors, il n'y a qu'un fichier <filename>.tar.{gz,bz2,xz}</filename> qui contient les sources du programme, il est appelé paquet source « natif » (« <literal>native</literal> »). Si un paquet est distribué ailleurs aussi, le fichier <filename>.orig.tar.{gz,bz2,xz}</filename> contient ce que l'on appelle le <literal>code source amont</literal>, c'est-à-dire, le code source distribué par le <literal>responsable amont</literal> (il s'agit souvent de l'auteur du logiciel). Dans ce cas, le fichier <filename>.diff.gz</filename> ou <filename>debian.tar.{gz,bz2,xz}</filename> contient les modifications faites par le responsable Debian.
ja: パッケージが特に Debian 用に作られていて Debian 以外で利用されていない場合は、プログラムのソースを含んだ単純な 1 つの <filename>.tar.{gz,bz2,xz}</filename> ファイルがあるだけで、“native”ソースパッケージと呼ばれます。パッケージが他でも配布されている場合は、<filename>.orig.tar.{gz,bz2,xz}</filename> は <literal>upstream ソースコード</literal>と呼ばれるものを保持しています (訳注: upstream = 開発元)。<literal>upstream ソースコード</literal>は <literal>upstream メンテナ</literal> (大抵の場合はソフトウェアの作者) によって配布されているソースコードです。この場合、<filename>.diff.gz</filename> や<filename>debian.tar.{gz,bz2,xz}</filename> は、Debian パッケージメンテナによって加えられた変更を含んでいます。

source: The <filename>.dsc</filename> file lists all the files in the source package together with checksums (<command>md5sums</command>) and some additional info about the package (maintainer, version, etc.).
de: Die <filename>.dsc</filename>-Datei listet alle Dateien im Quellpaket auf, zusammen mit den Prüfsummen (<command>md5sums</command>) und einigen zusätzlichen Informationen über das Paket (Betreuer, Version etc.).
fr: Le fichier <filename>.dsc</filename> liste tous les fichiers sources avec leurs sommes de contrôle (<command>md5sums</command>) et quelques informations supplémentaires concernant le paquet (responsable, version, etc.).
ja: <filename>.dsc</filename> ファイルはソースパッケージ中のすべてのファイルをチェックサム (<command>md5sums</command>) と共にリストしたものと、パッケージ関連の追加情報 (メンテナ、バージョン、etc) を含んでいます。

source: The directory system described in the previous chapter is itself contained within <literal>distribution directories</literal>. Each distribution is actually contained in the <filename>pool</filename> directory in the top-level of the Debian archive itself.
de: Das im vorherigen Kapitel beschriebene Verzeichnissystem ist selbst innerhalb der <literal>distribution directories</literal> enthalten. Jede Distribution ist derzeit im Verzeichnis <filename>pool</filename> in der obersten Ebene des Debian-Archivs selbst enthalten.
fr: L'organisation des répertoires présentée précédemment est elle-même contenue dans les <literal>répertoires de distributions</literal>. Chaque distribution est en fait incluse dans le répertoire <filename>pool</filename> à la racine de l'archive Debian.
ja: 前章で説明したディレクトリシステムは、それ自体が<literal>ディストリビューションディレクトリ</literal>内に含まれています。それぞれのディストリビューションは、実際には Debian アーカイブ自体の最上位階層の <filename>pool</filename> ディレクトリに含まれています。

source: To summarize, the Debian archive has a root directory within an FTP server. For instance, at the mirror site, <literal>ftp.us.debian.org</literal>, the Debian archive itself is contained in <ulink url="ftp://ftp.us.debian.org/debian">/debian</ulink>, which is a common location (another is <filename>/pub/debian</filename>).
de: Zusammenfassend gesagt, hat das Debian-Archiv ein Wurzelverzeichnis auf einem FTP-Server. Auf der Spiegel-Site <literal>ftp.us.debian.org</literal> ist beispielsweise das Debian-Archive selbst in <ulink url="ftp://ftp.us.debian.org/debian">/debian</ulink>, enthalten, was ein gebräuchlicher Ort dafür ist (ein anderer ist <filename>/pub/debian</filename>).
fr: Pour résumer, une archive Debian a un répertoire racine sur un serveur FTP. Par exemple, sur le site miroir <literal>ftp.fr.debian.org</literal>, l'archive Debian se trouve dans <ulink url="ftp://ftp.fr.debian.org/debian">/debian</ulink> qui est un emplacement courant (un autre emplacement courant est <filename>/pub/debian</filename>).
ja: 簡単にまとめると、Debian アーカイブは FTP サーバのルートディレクトリを持っています。例えば、ミラーサイトでいうと <literal>ftp.us.debian.org</literal> では Debian アーカイブそのものは <ulink url="ftp://ftp.us.debian.org/debian">/debian</ulink> に含まれており、これは共通した配置となっています (他には <filename>/pub/debian</filename> があります)。

source: A distribution comprises Debian source and binary packages, and the respective <filename>Sources</filename> and <filename>Packages</filename> index files, containing the header information from all those packages. The former are kept in the <filename>pool/</filename> directory, while the latter are kept in the <filename>dists/</filename> directory of the archive (for backwards compatibility).
de: Eine Distribution umfasst Debian-Quell- und -Binärpakete und die jeweiligen Indexdateien <filename>Sources</filename> sowie <filename>Packages</filename>, die die Kopfzeileninformationen von all diesen Paketen enthalten. Erstere werden im Verzeichnis <filename>pool/</filename> aufbewahrt, während letztere im Verzeichnis <filename>dists/</filename> des Archivs aufbewahrt werden (aus Gründen der Rückwärtskompatibilität).
fr: Une distribution est composée de paquets source et binaires, et des fichiers <filename>Sources</filename> et <filename>Packages</filename> correspondants, qui contiennent toutes les méta-informations sur les paquets. Les premiers sont dans le répertoire <filename>pool/</filename> tandis que les seconds sont dans le répertoire <filename>dists/</filename> de l'archive (pour compatibilité descendante).
ja: ディストリビューションは Debian ソースパッケージとバイナリパッケージと、これに対応した <filename>Sources</filename> と <filename>Packages</filename> のインデックスファイル (これら全てのパッケージのヘッダ情報を含む) から構成されています。前者は <filename>pool/</filename> ディレクトリに、そして後者はアーカイブの <filename>dists/</filename> ディレクトリに含まれています (後方互換性のため)。

source: Stable, testing, and unstable
de: Stable, testing und unstable
fr: <literal>Stable</literal>, <literal>testing</literal>, et <literal>unstable</literal>
ja: 安定版 (stable)、テスト版 (testing)、不安定版 (unstable)

source: There are always distributions called <literal>stable</literal> (residing in <filename>dists/stable</filename>), <literal>testing</literal> (residing in <filename>dists/testing</filename>), and <literal>unstable</literal> (residing in <filename>dists/unstable</filename>). This reflects the development process of the Debian project.
de: Es gibt immer Distributionen mit Namen <literal>stable</literal> (angesiedelt in <filename>dists/stable</filename>), <literal>testing</literal> (angesiedelt in <filename>dists/testing</filename>) und <literal>unstable</literal> (angesiedelt in <filename>dists/unstable</filename>). Dies spiegelt den Entwicklungsprozess des Debian-Projekts wider.
fr: Il existe toujours une distribution appelée <literal>stable</literal> (dans le répertoire <filename>dists/stable</filename>), une distribution appelée <literal>testing</literal> (dans le répertoire <filename>dists/testing</filename>), et une distribution appelée <literal>unstable</literal> (dans le répertoire <filename>dists/unstable</filename>). Ceci reflète le processus de développement du projet Debian.
ja: 常に <literal>安定版 (stable)</literal> (<filename>dists/stable</filename> に属します)、<literal>テスト晩 (testing)</literal> (<filename>dists/testing</filename> に属します)、<literal>不安定版 (unstable)</literal> (<filename>dists/unstable</filename> に属します) と呼ばれるディストリビューションが存在しています。これは Debian プロジェクトでの開発プロセスを反映しています。

source: Active development is done in the <literal>unstable</literal> distribution (that's why this distribution is sometimes called the <literal>development distribution</literal>). Every Debian developer can update their packages in this distribution at any time. Thus, the contents of this distribution change from day to day. Since no special effort is made to make sure everything in this distribution is working properly, it is sometimes literally unstable.
de: In der Distribution <literal>unstable</literal> wird aktiv entwickelt (daher wird diese Distribution manchmal auch die <literal>development distribution</literal> genannt). Jeder Debian-Entwickler kann jederzeit seine Pakete in dieser Distribution ändern. Daher ändert sich der Inhalt dieser Distribution von Tag zu Tag. Da keine besonderen Anstrengungen unternommen werden, sicherzustellen, dass alles in dieser Distribution funktioniert, ist sie manchmal buchstäblich instabil.
fr: Les développements se font sur la distribution <literal>unstable</literal> (c'est pourquoi elle est aussi appelée <literal>distribution de développement</literal>). Chaque développeur Debian peut modifier ses paquets à tout moment dans cette distribution. Ainsi son contenu change tous les jours. Comme aucun effort particulier n'est fait pour s'assurer que tout fonctionne correctement dans cette distribution, elle est parfois littéralement « instable ».
ja: 活発な開発が<literal>不安定版 (unstable)</literal> ディストリビューションで行われています (これが、何故このディストリビューションが<literal>開発ディストリビューション</literal>と呼ばれることがあるかという理由です)。全ての Debian 開発者は、このディストリビューション内の自分のパッケージを何時でも更新できます。つまり、このディストリビューションの内容は日々変化しているのです。このディストリビューションの全てが正しく動作するかを保証することについては特別な努力は払われていないので、時には文字通り不安定 (unstable) となります。

source: The <link linkend="testing">testing</link> distribution is generated automatically by taking packages from <literal>unstable</literal> if they satisfy certain criteria. Those criteria should ensure a good quality for packages within <literal>testing</literal>. The update to <literal>testing</literal> is launched twice each day, right after the new packages have been installed. See <xref linkend="testing"/>.
de: Die Distribution <link linkend="testing">testing</link> wird automatisch aus Paketen von <literal>unstable</literal> erzeugt, falls sie bestimmte Voraussetzungen erfüllen. Diese Voraussetzungen sollten eine gute Qualität für Pakete innerhalb von <literal>testing</literal> gewährleisten. Die Aktualisierung von <literal>testing</literal> wird zweimal täglich lanciert, gleich nachdem die neuen Pakete installiert wurden. Siehe <xref linkend="testing"/>.
fr: La distribution <link linkend="testing">testing</link> est générée automatiquement en prenant les paquets d'<literal>unstable</literal> s'ils satisfont à certains critères. Ces critères devraient garantir la bonne qualité des paquets de <literal>testing</literal>. La mise à jour de <literal>testing</literal> est effectuée deux fois par jour après l'installation des nouveaux paquets. Voir <xref linkend="testing"/>.
ja: <link linkend="testing">テスト版 (testing)</link> ディストリビューションは、パッケージが特定の判定規準を満たした際に<literal>不安定版</literal>から自動的に移動されることで生成されています。この判定規準は<literal>テスト版</literal>に含まれるパッケージとして十分な品質であることを保証する必要があります。<literal>テスト版</literal>への更新は、新しいパッケージがインストールされた後、毎日 2 回実施されています。<xref linkend="testing"/> を参照してください。

source: After a period of development, once the release manager deems fit, the <literal>testing</literal> distribution is frozen, meaning that the policies which control how packages move from <literal>unstable</literal> to <literal>testing</literal> are tightened. Packages which are too buggy are removed. No changes are allowed into <literal>testing</literal> except for bug fixes. After some time has elapsed, depending on progress, the <literal>testing</literal> distribution is frozen even further. Details of the handling of the testing distribution are published by the Release Team on debian-devel-announce. After the open issues are solved to the satisfaction of the Release Team, the distribution is released. Releasing means that <literal>testing</literal> is renamed to <literal>stable</literal>, and a new copy is created for the new <literal>testing</literal>, and the previous <literal>stable</literal> is renamed to <literal>oldstable</literal> and stays there until it is finally archived. On archiving, the contents are moved to <literal>&archive-host;</literal>.
de: Nach einer Entwicklungsperiode, sobald der Veröffentlichungsverwalter sie als tauglich erachtet, wird die Distribution <literal>testing</literal> eingefroren. Das bedeutet, dass die Richtlinien, die steuern welche Pakete von <literal>unstable</literal> nach <literal>testing</literal> verschoben werden, verschärft werden. Pakete, die zu viele Fehler aufweisen, werden entfernt. In <literal>testing</literal> sind außer Fehlerkorrekturen keine Änderungen erlaubt. Nachdem, abhängig vom Fortschritt, einige Zeit verstrichen ist, wird die Distribution <literal>testing</literal> sogar noch weiter eingefroren. Einzelheiten darüber, wie die Distribution <literal>testing</literal> gehandhabt wird, werden vom Veröffentlichungs-Team auf »debian-devel-announce« publiziert. Nachdem die offenen Probleme zur Zufriedenheit des Veröffentlichungs-Teams gelöst wurden, wird die Distribtion veröffentlicht. Veröffentlichen bedeutet, dass <literal>testing</literal> in <literal>stable</literal> umbenannt wird und für das neue <literal>testing</literal> eine neue Kopie erstellt wird. Das vorherige <literal>stable</literal> wird in <literal>oldstable</literal> umbenannt und bleibt bis zur endgültigen Archivierung dort. Bei der Archivierung wird der Inhalt nach <literal>&archive-host;</literal> verschoben.
fr: Après une période de développement, quand l'équipe de publication (« <literal>release team</literal> ») le juge opportun, la distribution <literal>testing</literal> est gelée, ce qui signifie que les conditions à remplir pour qu'un paquet passe d'<literal>unstable</literal> à <literal>testing</literal> sont durcies. Les paquets trop bogués sont supprimés et les seules mises à jours autorisées concernent les corrections de bogues. Après quelque temps, selon l'avancement, la distribution <literal>testing</literal> est gelée encore plus. Les détails de la gestion de la distribution <literal>testing</literal> sont publiées par l'équipe de publication sur la liste debian-devel-announce. Une fois les derniers problèmes résolus de façon satisfaisante pour l'équipe de publication, la distribution est publiée. La publication signifie que <literal>testing</literal> est renommée en <literal>stable</literal>, une nouvelle copie est créée pour la nouvelle <literal>testing</literal>, et l'ancienne <literal>stable</literal> est renommée en <literal>oldstable</literal> et y reste jusqu'à ce qu'elle soit finalement archivée. Lors de l'archivage, son contenu est déplacé sur <literal>&archive-host;</literal>.
ja: 一定の開発期間後、リリースマネージャが適当であると決定すると、<literal>テスト版 (testing)</literal> ディストリビューションはフリーズされます。これは、<literal>不安定版 (unstable)</literal> から<literal>テスト版 (testing)</literal> へのパッケージ移動をどのように行うかのポリシーがきつくなることを意味しています。バグが多すぎるパッケージは削除されます。バグ修正以外の変更が<literal>テスト版 (testing)</literal> に入ることは許可されません。いくらかの時間経過後、進行状況に応じて<literal>テスト版 (testing)</literal> ディストリビューションはより一層フリーズされます。テスト版ディストリビューションの取扱い詳細については debian-devel-announce にてリリースチームが発表します。リリースチームが満足する程度に残っていた問題が修正された後、ディストリビューションがリリースされます。リリースは、<literal>テスト版 (testing)</literal> が<literal>安定版 (stable)</literal> へとリネームされる事を意味しており、<literal>テスト版 (testing)</literal> 用の新しいコピーが作成され、以前の<literal>安定版 (stable)</literal> は<literal>旧安定版 (oldstable)</literal> にリネームされ、最終的にアーカイブされるまで存在しています。アーカイブ作業では、コンテンツは <literal>&archive-host;</literal> へと移動されます。

source: This development cycle is based on the assumption that the <literal>unstable</literal> distribution becomes <literal>stable</literal> after passing a period of being in <literal>testing</literal>. Even once a distribution is considered stable, a few bugs inevitably remain — that's why the stable distribution is updated every now and then. However, these updates are tested very carefully and have to be introduced into the archive individually to reduce the risk of introducing new bugs. You can find proposed additions to <literal>stable</literal> in the <filename>proposed-updates</filename> directory. Those packages in <filename>proposed-updates</filename> that pass muster are periodically moved as a batch into the stable distribution and the revision level of the stable distribution is incremented (e.g., ‘6.0’ becomes ‘6.0.1’, ‘5.0.7’ becomes ‘5.0.8’, and so forth). Please refer to <link linkend="upload-stable">uploads to the <literal>stable</literal> distribution</link> for details.
de: Der Entwicklungszyklus hängt von der Einschätzung ab, ob die Distribution <literal>unstable</literal> nach einer Periode, in der sie <literal>testing</literal> durchläuft, <literal>stable</literal> geworden ist.Sogar wenn eine Distribution stabil geworden ist, verbleiben zwangsläufig ein paar Fehler – daher wird die stabile Distribution ab und zu aktualisiert. Diese Aktualisierungen wurden jedoch sehr gründlich getestet und werden in einem einzelnen Archiv eingeführt, um das Risiko zu vermindern, neue Fehler einzuschleppen. Sie können die geplanten Ergänzungen zu <literal>stable</literal> im Verzeichnis <filename>proposed-updates</filename> finden. Diese Pakete in <filename>proposed-updates</filename>, die den Anforderungen entsprechen, werden periodisch in einem Stapellauf in die Stable-Distribution verschoben und die Überarbeitungsstufe der Stable-Distribution wird erhöht (z.B. »6.0« wird »6.0.1«, »5.0.7« wird »5.0.8« und so weiter). Bitte sehen Sie unter <link linkend="upload-stable">uploads to the <literal>stable</literal> distribution</link> nach, um weitere Einzelheiten zu erfahren.
fr: Ce cycle de développement est basé sur l'idée que la distribution <literal>unstable</literal> devient <literal>stable</literal> après une période de test dans <literal>testing</literal>. Une distribution contient inévitablement des bogues, même si elle est classée stable. C'est pourquoi la distribution stable est mise à jour de temps en temps. Les corrections introduites sont testées avec une grande attention et sont ajoutées une à une à l'archive pour diminuer les risques d'introduire de nouveaux bogues. Vous pouvez trouver les paquets proposés pour la prochaine mise à jour de <literal>stable</literal> dans le répertoire <filename>proposed-updates</filename>. De temps en temps, ces paquets du répertoire <filename>proposed-updates</filename> qui n'introduisent pas de régression sont installés ensemble dans la distribution <literal>stable</literal> et le numéro de révision de cette distribution est incrémenté (« 6.0 » devient « 6.0.1 », « 5.0.7 » devient « 5.0.8 » et ainsi de suite). Veuillez vous référer aux <link linkend="upload-stable">envois dans la distribution <literal>stable</literal></link> pour plus de détails.
ja: この開発サイクルは、<literal>不安定版 (unstable)</literal> ディストリビューションが、一定期間<literal>テスト版 (testing)</literal>を過ごした後で<literal>安定版 (stable)</literal>になる仮定に基づいています。一旦ディストリビューションが安定したと考えられたとしても、必然的にいくつかのバグは残っています — これが安定版ディストリビューションが時折更新されている理由です。しかし、これらの更新はとても注意深くテストされており、新たなバグを招き入れるリスクを避けるためにそれぞれ個々にアーカイブに収録されるようになっています。<literal>安定版 (stable)</literal> への追加提案は、<filename>proposed-updates</filename> ディレクトリにて参照可能です。<filename>proposed-updates</filename> にある合格したこれらのパッケージは、定期的にまとめて安定版ディストリビューションに移動され、安定版ディストリビューションのリビジョンレベルが 1 つ増えることになります (例: ‘6.0’ が ‘6.0.1’ に、‘5.0’ が ‘5.0.8’ に、以下同様)。詳細に付いては、<link linkend="upload-stable"><literal>安定版 (stable)</literal> ディストリビューションへのアップロード</link>を参照してください。

source: Note that development under <literal>unstable</literal> continues during the freeze period, since the <literal>unstable</literal> distribution remains in place in parallel with <literal>testing</literal>.
de: Beachten Sie, dass die Entwicklung unter <literal>unstable</literal> während der Periode des Freeze weitergeht, da die Distribution <literal>unstable</literal> an der Stelle parallel mit <literal>testing</literal> verbleibt.
fr: Pendant la période de gel, les développements continuent sur la distribution <literal>unstable</literal> car cette distribution reste en place parallèlement à <literal>testing</literal>.
ja: <literal>不安定版 (unstable)</literal>での開発はフリーズ期間中も続けられていることに注意してください。<literal>不安定版 (unstable)</literal> ディストリビューションは<literal>テスト版 (testing)</literal> とは平行した状態でありつづけているからです。

source: More information about the testing distribution
de: Weitere Informationen über die Testing-Distribution
fr: Informations complémentaires sur la distribution <literal>testing</literal>
ja: テスト版ディストリビューションについてのさらなる情報

source: Packages are usually installed into the <literal>testing</literal> distribution after they have undergone some degree of testing in <literal>unstable</literal>.
de: Pakete werden üblicherweise in der Distribution <literal>testing</literal> installiert, nachdem sie in gewissem Maße in <literal>unstable</literal> Tests unterzogen wurden.
fr: Les paquets sont habituellement installés dans la distribution <literal>testing</literal> après avoir subi suffisamment de tests dans <literal>unstable</literal>.
ja: パッケージは通常、<literal>不安定版 (unstable)</literal> におけるテスト版への移行基準を満たした後で<literal>テスト版 (testing)</literal> ディストリビューションへとインストールされます。

source: For more details, please see the <link linkend="testing">information about the testing distribution</link>.
de: Lesen Sie bitte die <link linkend="testing">Informationen über die Testing-Distribution</link>, um weitere Einzelheiten zu erfahren.
fr: Pour plus de détails, veuillez consulter les <link linkend="testing">informations à propos de la distribution <literal>testing</literal></link>.
ja: より詳細については、<link linkend="testing">テスト版ディストリビューションについての情報</link>を参照してください。

source: Experimental
fr: <literal>Experimental</literal>
ja: 試験版 (experimental)
