Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: The resources discussed in this reference include the mailing lists (<xref linkend="mailing-lists"/>) and servers (<xref linkend="server-machines"/>); a discussion of the structure of the Debian archive (<xref linkend="archive"/>); explanation of the different servers which accept package uploads (<xref linkend="upload-ftp-master"/>); and a discussion of resources which can help maintainers with the quality of their packages (<xref linkend="tools"/>).
de: Die in dieser Referenz besprochenen Ressourcen umfassen die Mailinglisten (<xref linkend="mailing-lists"/>) und Server (<xref linkend="server-machines"/>), eine Erörterung der Struktur des Debian-Archivs (<xref linkend="archive"/>), eine Erklärung der unterschiedlichen Server, die das Hochladen von Paketen akzeptieren (<xref linkend="upload-ftp-master"/>) und eine Erörterung von Mitteln, die Paketbetreuern dabei helfen, die Qualität ihrer Pakete zu gewährleisten (<xref linkend="tools"/>).
fr: Ce manuel présente entre autres les listes de diffusion (<xref linkend="mailing-lists"/>) et les serveurs (<xref linkend="server-machines"/>), la structure de l'archive Debian (<xref linkend="archive"/>), des explications sur les serveurs qui acceptent l'envoi de paquets (<xref linkend="upload-ftp-master"/>) et une présentation des outils qui peuvent aider un responsable à améliorer la qualité de ses paquets (<xref linkend="tools"/>).
ja: また、このリファレンスで触れるリソースには、メーリングリスト (<xref linkend="mailing-lists"/>) およびサーバ (<xref linkend="server-machines"/>)、Debian アーカイブの構成に関する解説 (<xref linkend="archive"/>)、パッケージのアップロードを受け付ける様々なサーバの説明 (<xref linkend="upload-ftp-master"/>)、パッケージの品質を高めるために開発者が利用できるリソースについての解説 (<xref linkend="tools"/>) などがあります。

source: It should be clear that this reference does not discuss the technical details of Debian packages nor how to generate them. Nor does this reference detail the standards to which Debian software must comply. All of such information can be found in the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>.
de: Es sollte klar sein, dass diese Referenz nicht die technischen Einzelheiten von Debian-Paketen erörtert oder wie sie erstellt werden. Ebenso wenig wird diese Referenz die Standards einzeln aufführen, die Debian-Software erfüllen muss. All diese Informationen finden Sie im <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>.
fr: Ce manuel de référence ne présente pas les aspects techniques liés aux paquets Debian, ni comment les créer. Il ne décrit pas non plus les règles que doivent respecter les paquets Debian. Ces informations sont disponibles dans la <ulink url="&url-debian-policy;">charte Debian</ulink>.
ja: 初めに明らかにしておきたいのですが、このリファレンスは Debian パッケージに関する技術的な詳細や、Debian パッケージの作成方法を説明するものではありません。また、このリファレンスは Debian に含まれるソフトウェアが準拠すべき基準を詳細に解説するようなものでもありません。その様な情報については全て、<ulink url="&url-debian-policy;">Debian ポリシーマニュアル</ulink> に記述されています。

source: Furthermore, this document is <emphasis>not an expression of formal policy</emphasis>. It contains documentation for the Debian system and generally agreed-upon best practices. Thus, it is not what is called a ``normative'' document.
de: Weiterhin ist dieses Dokument <emphasis>nicht ein Ausdruck einer formalen Richtlinie</emphasis>. Es enthält Dokumentation für das Debian-System und allgemein vereinbarte gute fachliche Gebräuche. Daher ist es nicht das, was normalerweise als ein »normgebendes« Dokument bezeichnet wird.
fr: De plus ce document <emphasis>n'est pas l'expression d'une politique officielle</emphasis>. Il contient de la documentation sur le système Debian et des conseils pratiques largement suivis. Ce n'est donc pas une sorte de guide de normes.
ja: さらに、この文書は<emphasis>公式なポリシーを明らかにするものではありません</emphasis>。含まれているのは Debian システムに関する記述と、一般的な合意がなされたベストプラクティスに関する記述です。すなわち「規範」文書と呼ばれるものではない、ということです。

source: Overview of Debian Maintainer Tools
de: Überblick über die Werkzeuge der Debian-Betreuer
fr: Aperçu des outils du responsable Debian
ja: Debian メンテナツールの概要

source: This section contains a rough overview of the tools available to maintainers. The following is by no means complete or definitive, but just a guide to some of the more popular tools.
de: Dieser Abschnitt enthält eine grobe Übersicht über die Werkzeuge, die Betreuern zur Verfügung stehen. Das Folgende ist beileibe nicht vollständig oder maßgeblich, sondern nur eine Anleitung für einige der beliebstesten Werkzeuge.
fr: Cette section contient un aperçu rapide des outils dont dispose le responsable. Cette liste n'est ni complète, ni définitive, il s'agit juste d'un guide des outils les plus utilisés.
ja: この章には、メンテナが利用できるツールについて大まかな概要が含まれています。以下は完全なものでも決定版的なものでもありませんが、よく使われているツールについての説明です。

source: Debian maintainer tools are meant to aid developers and free their time for critical tasks. As Larry Wall says, there's more than one way to do it.
de: Debian-Betreuerwerkzeuge sind dazu gedacht, Entwicklern zu helfen und Zeit für wirklich kritische Aufgaben einzuräumen. Wie schon Larry Wall sagte, gibt es mehr als einen Weg, um etwas zu erledigen.
fr: Les outils du responsable Debian sont destinés à aider les responsables et libérer leur temps pour des tâches plus cruciales. Comme le dit Larry Wall, « il y a plus d'une façon de le faire ».
ja: Debian メンテナツールは、開発者を手助けし、重要な作業のために時間を作れるようにしてくれるものです。Larry Wall が言うように、やり方は一つではありません (there's more than one way to do it)。

source: Some people prefer to use high-level package maintenance tools and some do not. Debian is officially agnostic on this issue; any tool which gets the job done is fine. Therefore, this section is not meant to stipulate to anyone which tools they should use or how they should go about their duties of maintainership. Nor is it meant to endorse any particular tool to the exclusion of a competing tool.
de: Einige Leute bevorzugen die Benutzung von hochrangigen Paketverwaltungswerkzeugen, andere nicht. Debian ist bei diesem Thema agnostisch; jedes Werkzeug, das seine Aufgabe erfüllt, ist gut. Daher ist dieser Abschnitt nicht dazu gedacht, jemandem vorzuschreiben, welche Werkzeuge er benutzen oder wie er mit seinen Pflichen als Betreuer umgehen soll. Er ist auch nicht dazu gedacht, ein besonderes Werkzeug zu befürworten, um ein konkurrierendes auszuschließen.
fr: Certaines personnes préfèrent utiliser des outils de haut niveau, d'autres pas. Debian n'a pas de position officielle sur la question ; tout outil conviendra du moment qu'il fait le boulot. C'est pourquoi cette section n'a pas été conçue pour indiquer à chacun quel outil il doit utiliser ou comment il devrait faire pour gérer sa charge de responsable. Elle n'est pas non plus destinée à favoriser l'utilisation d'un outil aux dépens d'un autre.
ja: 高度なパッケージメンテナンスツールを使うのを好む人もいればそうではない人もいます。Debian は公式にはこの問題を不可知論であるとしています。どのようなツールでも作業ができるのであれば構いません。つまり、この章は誰もがどのツールを使うべきか、メンテナンス上で何をすべきかと要求する為のものではないということです。あるいは競合するツールを排して特定のツールを勧める訳でもありません。

source: Most of the descriptions of these packages come from the actual package descriptions themselves. Further information can be found in the package documentation itself. You can also see more info with the command <command>apt-cache show <replaceable>package-name</replaceable></command>.
de: Die meisten Beschreibungen dieser Pakete entstammen selbst den tatsächlichen Paketbeschreibungen. Weitere Informationen können in der Paketbeschreibung selbst gefunden werden. Sie können außerdem mit dem Befehl <command>apt-cache show <replaceable>Paketname</replaceable></command> zusätzliche Informationen lesen.
fr: La plupart des descriptions de ces outils proviennent des descriptions de leurs paquets. Vous trouverez plus d'informations dans les documentations de ces paquets. Vous pouvez aussi obtenir plus d'informations avec la commande <literal>apt-cache show <replaceable>nom_de_paquet</replaceable></literal>.
ja: パッケージの説明文のほとんどは実際のパッケージの説明から取ったものです。より詳細な情報はパッケージ内のドキュメントで確認できます。<command>apt-cache show <replaceable>パッケージ名</replaceable></command> コマンドでも情報を得られます。

source: Core tools
de: Kernwerkzeuge
fr: Outils de base
ja: 主要なツール

source: The following tools are pretty much required for any maintainer.
de: Die folgenden Werkzeuge werden größtenteils von jedem Betreuer benötigt.
fr: Les outils suivants sont pratiquement nécessaires à tout responsable.
ja: 以下のツールはどのメンテナであっても、必ず必要とするものです。

source: <systemitem role="package">dpkg-dev</systemitem> contains the tools (including <command>dpkg-source</command>) required to unpack, build, and upload Debian source packages. These utilities contain the fundamental, low-level functionality required to create and manipulate packages; as such, they are essential for any Debian maintainer.
de: <systemitem role="package">dpkg-dev</systemitem> enthält die Werkzeuge (einschließlich <command>dpkg-source</command>), die benötigt werden, um Debian-Pakete zu entpacken, zu erstellen und hochzuladen. Diese Hilfswerkzeuge enthalten die untergeordneten Funktionalitäten, die zum Erstellen und Manipulieren von Paketen benötigt werden; als solches sind sie für jeden Debian-Betreuer erforderlich.
fr: <systemitem role="package">dpkg-dev</systemitem> contient les outils (y compris <command>dpkg-source</command>) nécessaires pour dépaqueter, construire, et envoyer les paquets source Debian. Ces utilitaires fournissent les fonctionnalités de bas niveau indispensables pour créer et manipuler les paquets ; en tant que tels, ils sont essentiels à tout responsable Debian.
ja: <systemitem role="package">dpkg-dev</systemitem> は、パッケージを展開、ビルド、Debian ソースパッケージをアップロードするのに必要なツールを含んでいます (<command>dpkg-source</command> を含む) 。これらのユーティリティはパッケージを作成・操作するのに必要な基礎的で、低レイヤの機能を含んでいます。そのため、これらはあらゆる Debian メンテナにとって必要不可欠なものです。

source: <systemitem role="package">debconf</systemitem> provides a consistent interface to configuring packages interactively. It is user interface independent, allowing end-users to configure packages with a text-only interface, an HTML interface, or a dialog interface. New interfaces can be added as modules.
de: <systemitem role="package">debconf</systemitem> stellt eine einheitliche Schnittstelle zur Verfügung, um Pakete interaktiv zu konfigurieren, Es ist unabhängig von der Schnittstelle des Anwenders, erlaubt Endanwendern Pakete mit einer reinen Textschnittstelle, einer HTML-Schnittstelle oder einer Dialogschnittstelle zu konfigurieren. Neue Schnittstellen können als Module hinzugefügt werden.
fr: <systemitem role="package">debconf</systemitem> fournit une interface unifiée pour configurer les paquets de façon interactive. Il est indépendant de l'interface et permet une configuration en mode texte, par une interface HTML ou par boîtes de dialogue. D'autres types d'interface peuvent être ajoutés sous forme de modules.
ja: <systemitem role="package">debconf</systemitem> は、パッケージを対話形式で設定できる一貫したインターフェイスを提供します。これはユーザインターフェイスに依存せず、エンドユーザがテキストのみのインターフェイス、HTML インターフェイス、ダイアログ形式のインターフェイスでパッケージを設定できます。新たなインターフェイスはモジュールとして追加できます。

source: You can find documentation for this package in the <systemitem role="package">debconf-doc</systemitem> package.
de: Sie können Dokumentation für dieses Paket im Paket <systemitem role="package">debconf-doc</systemitem> finden.
fr: Vous en trouverez la documentation dans le paquet <systemitem role="package">debconf-doc</systemitem>.
ja: このパッケージに関するドキュメントは <systemitem role="package">debconf-doc</systemitem> パッケージ中で確認できます。

source: Many feel that this system should be used for all packages which require interactive configuration; see <xref linkend="bpp-config-mgmt"/>. <systemitem role="package">debconf</systemitem> is not currently required by Debian Policy, but that may change in the future.
de: Viele sind der Ansicht, dieses System sollte für alle Pakete verwandt werden, die eine interaktive Konfiguration erfordern; siehe <xref linkend="bpp-config-mgmt"/>. Derzeit wird <systemitem role="package">debconf</systemitem> noch nicht von den Debian Richtlinien benötigt, aber das kann sich in der Zukunft ändern.
fr: Beaucoup pensent que ce système devrait être utilisé pour tout paquet nécessitant une configuration interactive, cf. <xref linkend="bpp-config-mgmt"/>. <systemitem role="package">debconf</systemitem> n'est pas requis par la Charte Debian pour le moment, mais cela pourrait changer.
ja: 多くの人が、対話的な設定を必要とする全てのパッケージにこのシステムが使われるべきだと感じています。<xref linkend="bpp-config-mgmt"/> を参照してください。現在は <systemitem role="package">debconf</systemitem> は Debian ポリシーで必要であるとはされていませんが、将来には変更されることでしょう。

source: <systemitem role="package">fakeroot</systemitem> simulates root privileges. This enables you to build packages without being root (packages usually want to install files with root ownership). If you have <systemitem role="package">fakeroot</systemitem> installed, you can build packages as a regular user: <literal>dpkg-buildpackage -rfakeroot</literal>.
de: <systemitem role="package">fakeroot</systemitem> simuliert Root-Rechte. Dies ermöglicht Ihnen, Pakete zu erstellen ohne Root zu sein (Pakete möchten üblicherweise Dateien mit Root-Besitzrechten installieren). Falls Sie <systemitem role="package">fakeroot</systemitem> installiert haben, können Sie Pakete als normaler Anwender erstellen: <literal>dpkg-buildpackage -rfakeroot</literal>.
fr: <systemitem role="package">fakeroot</systemitem> simule les privilèges de root. Cela permet de fabriquer un paquet sans être root (en général, les paquets installent des fichiers appartenant à root). Si vous avez installé <systemitem role="package">fakeroot</systemitem>, vous pouvez construire un paquet en tant que simple utilisateur : <literal>dpkg-buildpackage -rfakeroot</literal>.
ja: <systemitem role="package">fakeroot</systemitem> は root 特権をシミュレートします。これは root になること無しにパッケージをビルドできるようにしてくれます (パッケージは通常 root の所有権でファイルをインストールしようとします)。<systemitem role="package">fakeroot</systemitem> をインストールしているならば、通常のユーザでパッケージをビルドできます: <literal>dpkg-buildpackage -rfakeroot</literal>

source: Package lint tools
de: Lint-Werkzeuge für Pakete
fr: Contrôle de paquets (« <literal>lint</literal> »)
ja: パッケージチェック (lint) 用ツール

source: According to the Free On-line Dictionary of Computing (FOLDOC), `lint' is a Unix C language processor which carries out more thorough checks on the code than is usual with C compilers. Package lint tools help package maintainers by automatically finding common problems and policy violations in their packages.
de: Gemäß dem Free On-line Dictionary of Computing (FOLDOC) ist »lint« ein Unix-Prozessor für die Sprache C, der gründlichere Prüfungen des Codes mitbringt als übliche C-Kompiler. Lint-Werkzeuge für Pakete helfen Paketbetreuern automatisch häufige Probleme und Richtlinienverletzungen in ihren Paketen zu finden.
fr: Selon le « <literal>Free On-line Dictionary of Computing</literal> » (FOLDOC), « <literal>lint</literal> » est « un outil de traitement de langage C qui contient beaucoup plus de tests complets sur le code que n'en font habituellement les compilateurs C ». Les outils de contrôle de paquets aident les responsables à découvrir automatiquement les problèmes habituels et les violations de Charte dans leurs paquets.
ja: コンピュータ用のフリーオンライン辞書 (Free On-line Dictionary of Computing, FOLDOC) によると、「lint」は C コンパイラよりもより網羅的なチェックを行う Unix C 言語処理器とあります。パッケージ lint ツールは、パッケージ内の一般的な問題やポリシー違反を自動的に見つけてくれることで、パッケージメンテナを助けてくれます。

source: <systemitem role="package">lintian</systemitem> dissects Debian packages and emits information about bugs and policy violations. It contains automated checks for many aspects of Debian policy as well as some checks for common errors.
de: <systemitem role="package">lintian</systemitem> zerlegt Debian-Pakete und gibt Informationen über Fehler und Richtlinien-Verletzungen aus. Es enthält automatisierte Prüfungen für viele Gesichtspunkte der Debian-Richtlinien, als auch einige Prüfungen für häufige Fehler.
fr: <systemitem role="package">lintian</systemitem> dissèque les paquets pour y repérer des bogues et des manquements aux règles de développement. Il contient des tests automatisés pour vérifier de nombreuses règles et quelques erreurs courantes.
ja: <systemitem role="package">lintian</systemitem> は Debian パッケージを解剖してバグやポリシー違反の情報を出力します。一般的なエラーへのチェック同様にDebian ポリシーの多くの部分を自動チェックする機能を含んでいます。

source: You should periodically get the newest <systemitem role="package">lintian</systemitem> from <literal>unstable</literal> and check over all your packages. Notice that the <literal>-i</literal> option provides detailed explanations of what each error or warning means, what its basis in Policy is, and commonly how you can fix the problem.
de: Sie sollten regelmäßig das neuste <systemitem role="package">lintian</systemitem> aus <literal>unstable</literal> besorgen und all Ihre Pakete überprüfen. Beachten Sie, dass die Option <literal>-i</literal> detaillierte Erklärungen liefert, was jeder Fehler oder jede Warnung bedeutet, was die Grundlage in der Richtlinie ist und wie das Problem üblicherweise behoben werden kann.
fr: Vous devriez récupérer la dernière version de <systemitem role="package">lintian</systemitem> depuis <literal>unstable</literal> régulièrement et vérifier tous vos paquets. Notez que l'option <literal>-i</literal> donne des explications détaillées sur la signification de chaque erreur, la partie concernée dans la Charte et le moyen habituel de régler le problème.
ja: 定期的に最新の <systemitem role="package">lintian</systemitem> を <literal>unstable</literal> から取得し、パッケージを全てチェックするべきです。<literal>-i</literal> オプションは、各エラーや警告が何を意味しているのか、ポリシーを元に、詳細な説明を提供してくれ、一般的に問題をどのように修正するべきかを説明してくれることに留意してください。

source: Refer to <xref linkend="sanitycheck"/> for more information on how and when to use Lintian.
de: Es sei für weitere Informationen darüber, wie und wann Lintian benutzt wird, auf <xref linkend="sanitycheck"/> verwiesen.
fr: Voir <xref linkend="sanitycheck"/> pour plus d'informations sur comment et quand utiliser Lintian.
ja: 何時、どのようにして Lintian を使うのか、詳細については <xref linkend="sanitycheck"/> を参照してください。

source: You can also see a summary of all problems reported by Lintian on your packages at <ulink url="&url-lintian;"></ulink>. These reports contain the latest <command>lintian</command> output for the whole development distribution (<literal>unstable</literal>).
de: Sie können außerdem eine Zusammenfassung aller Probleme, die Lintian in all Ihren Paketen meldet unter <ulink url="&url-lintian;"></ulink> ansehen. Diese Berichte enthalten die letzte Ausgabe von <command>lintian</command> für die ganze Entwicklungsdistribution (<literal>unstable</literal>).
fr: Vous pouvez aussi obtenir un résumé de tous les problèmes signalés par Lintian sur vos paquets en <ulink url="&url-lintian;"></ulink>. Ces rapports contiennent la sortie de la dernière version de <command>lintian</command> pour l'ensemble de la distribution de développement (<literal>unstable</literal>).
ja: あなたのパッケージに対して Lintian によって報告されたの問題の要約はすべて <ulink url="&url-lintian;"></ulink> から確認することもできます。このレポートは、最新の <command>lintian</command> による開発版ディストリビューション (<literal>unstable</literal>) 全体についての出力を含んでいます。

source: <command>debdiff</command> (from the <systemitem role="package">devscripts</systemitem> package, <xref linkend="devscripts"/>) compares file lists and control files of two packages. It is a simple regression test, as it will help you notice if the number of binary packages has changed since the last upload, or if something has changed in the control file. Of course, some of the changes it reports will be all right, but it can help you prevent various accidents.
de: <command>debdiff</command> (aus dem Paket <systemitem role="package">devscripts</systemitem>, <xref linkend="devscripts"/>) vergleicht die Dateilisten und »control«-Dateien zweier Pakete. Es ist ein einfacher Rückfalltest, der Ihnen hilft festzustellen, ob sich die Anzahl der Binärpakete seit dem letzten Upload verändert hat oder ob sich etwas in der »control«-Datei geändert hat. Natürlich werden einige Änderungen, die es meldet, in Ordnung sein, aber es kann Ihnen helfen verschiedene Unfälle zu verhüten.
fr: <command>debdiff</command> (du paquet <systemitem role="package">devscripts</systemitem>, <xref linkend="devscripts"/>) compare les listes de fichiers ainsi que les fichiers de contrôle de deux paquets. C'est un simple test de régression qui peut aider à remarquer si le nombre de paquets binaires a changé depuis le dernier envoi ou si autre chose a changé dans le fichier de contrôle. Bien sûr, certains des changements indiqués sont normaux, mais cela peut aider à empêcher différents accidents.
ja: (<systemitem role="package">devscripts</systemitem> パッケージ、<xref linkend="devscripts"/> より) <command>debdiff</command> は二つのパッケージのファイルのリストと control ファイルを比較します。前回のアップロードからバイナリパッケージ数が変わったことや、control ファイル内で何が変わったのかなどに気付く手助けをしてくれるなど、簡単なリグレッションテストとなります。もちろん、報告される変更の多くは問題ありませんが、様々なアクシデントを防止するのに役立ってくれるでしょう。

source: You can run it over a pair of binary packages:
de: Sie können es für ein Paar binärer Pakete ausführen:
fr: Vous pouvez l'exécuter sur un couple de paquets binaires :
ja: バイナリパッケージのペアに対して実行することができます:

source: debdiff package_1-1_arch.deb package_2-1_arch.deb
fr: debdiff paquet_1-1_arch.deb paquet_2-1_arch.deb

source: Or even a pair of changes files:
de: oder sogar für ein Paar aus »changes«-Dateien:
fr: Ou même sur un couple de fichiers de changements :
ja: changes ファイルのペアに対してさえも実行できます:

source: debdiff package_1-1_arch.changes package_2-1_arch.changes
fr: debdiff paquet_1-1_arch.changes paquet_2-1_arch.changes

source: For more information please see <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
de: Um weitere Informationen zu erhalten, lesen Sie <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
fr: Pour plus d'informations, veuillez consulter <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ja: より詳細については、<citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>を参照してください。

source: Helpers for <filename>debian/rules</filename>
de: Helper-Skripte für <filename>debian/rules</filename>
fr: Assistance pour <filename>debian/rules</filename>
ja: <filename>debian/rules</filename> の補助ツール

source: Package building tools make the process of writing <filename>debian/rules</filename> files easier. See <xref linkend="helper-scripts"/> for more information about why these might or might not be desired.
de: Paketerstellungswerkzeuge erleichtern das Verfassen von <filename>debian/rules</filename>-Dateien. Lesen Sie <xref linkend="helper-scripts"/>, um weitere Informationen darüber zu erhalten, warum dies erwünscht und jenes unerwünscht sein könnte.
fr: Des outils de construction de paquets facilitent le processus d'écriture du fichier <filename>debian/rules</filename>. <xref linkend="helper-scripts"/> contient plus d'informations sur l'intérêt de les utiliser ou non.
ja: パッケージ構築ツールは <filename>debian/rules</filename> ファイルを書く作業を楽にしてくれます。これらが望ましい、あるいは望ましくない理由の詳細については <xref linkend="helper-scripts"/> を参照してください。
