Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: A single source package will often build several binary packages, either to provide several flavors of the same software (e.g., the <systemitem role="package">vim</systemitem> source package) or to make several small packages instead of a big one (e.g., so the user can install only the subset needed, and thus save some disk space).
de: Ein einzelnes Quellpaket wird oft mehrere Binärpakete erstellen, entweder um mehrere Geschmacksrichtungen der gleichen Software bereitzustellen (z.B. das <systemitem role="package">vim</systemitem>-Quellpaket) oder um mehrere kleine Pakete anstelle eines einzelnen großen zu erzeugen (z,B. damit der Benutzer nur die benötigte Untermenge installieren kann und dadurch Plattenplatz spart).
fr: Un simple paquet source créera souvent plusieurs paquets binaires, soit pour fournir plusieurs variantes du même logiciel (par exemple le paquet source <systemitem role="package">vim</systemitem>) ou pour répartir les fichiers en plusieurs paquets plus petits au lieu d'un seul paquet monolithique (ce qui peut permettre à un utilisateur de n'installer que les éléments nécessaires et donc préserver l'espace disque).
ja: 単一のソースパッケージはしばしば複数のバイナリパッケージを生成します。それは、同じソフトウェアで複数のフレーバーを提供することであったり (例: <systemitem role="package">vim</systemitem> ソースパッケージ)、巨大なパッケージではなく複数の小さなパッケージを作ったりします (例: ユーザがサブセットのみをインストールできるようにして、ディスク容量を節約できます)。

source: The second case can be easily managed in <filename>debian/rules</filename>. You just need to move the appropriate files from the build directory into the package's temporary trees. You can do this using <command>install</command> or <command>dh_install</command> from <systemitem role="package">debhelper</systemitem>. Be sure to check the different permutations of the various packages, ensuring that you have the inter-package dependencies set right in <filename>debian/control</filename>.
de: Der zweite Fall kann einfach in <filename>debian/rules</filename> verwaltet werden. Sie müssen nur die entsprechenden Dateien aus dem Build-Verzeichnis in die entsprechenden temporären Baumstrukturen des Pakets verschieben. Dies können Sie mit <command>install</command> oder <command>dh_install</command> aus <systemitem role="package">debhelper</systemitem> erledigen. Sorgen Sie dafür, dass Sie die unterschiedlichen Umsetzungen der verschiedenen Pakete prüfen, um sicherzustellen, dass Sie die wechselseitigen Abhängigkeiten in <filename>debian/control</filename> richtig gesetzt haben.
fr: Le second cas est simple à gérer dans le fichier <filename>debian/rules</filename>. Il suffit de déplacer les fichiers nécessaires depuis le répertoire de construction vers l'arborescence temporaire du paquet. Cela peut se faire avec les commandes <command>install</command> ou <command>dh_install</command> du paquet <systemitem role="package">debhelper</systemitem>. Veillez alors à contrôler les différentes permutations des paquets, afin de pouvoir indiquer les dépendances inter-paquets appropriées dans <filename>debian/control</filename>.
ja: 二つ目の例は、<filename>debian/rules</filename> で簡単に扱うことができます。ビルドディレクトリからパッケージの一時ツリーへ、適切なファイルを移動する必要があるだけです。これは、<command>install</command> または <systemitem role="package">debhelper</systemitem> の <command>dh_install</command> を使ってできます。パッケージ間の依存関係を <filename>debian/control</filename> 内で正しく設定したのを忘れずに確認してください。

source: The first case is a bit more difficult since it involves multiple recompiles of the same software but with different configuration options. The <systemitem role="package">vim</systemitem> source package is an example of how to manage this using an hand-crafted <filename>debian/rules</filename> file.
de: Der erste Fall ist etwas schwieriger, da er mehrmaliges Neukompilieren der selben Software einschließt, aber mit unterschiedlichen Konfigurationsoptionen. Das <systemitem role="package">vim</systemitem>-Quellpaket ist ein Beispiel dafür, wie dies mit einer handgemachten <filename>debian/rules</filename>-Datei verwaltet wird.
fr: Le premier cas est plus délicat à gérer car il implique des recompilations multiples du même logiciel avec différentes options de configuration. Le paquet source <systemitem role="package">vim</systemitem> en est un exemple, l'ensemble des actions dans le fichier <filename>debian/rules</filename> étant géré manuellement.
ja: 最初の例は、同じソフトウェアでありながら異なった設定オプションで複数回再コンパイルする必要があるので、ちょっと難しくなります。<systemitem role="package">vim</systemitem> ソースパッケージは、手作りの <filename>debian/rules</filename> ファイルを使ってどのようにこの作業を扱うか、という例です。

source: Best practices for <filename>debian/control</filename>
de: Optimale Vorgehensweisen für <filename>debian/control</filename>
fr: Meilleures pratiques pour <filename>debian/control</filename>
ja: <filename>debian/control</filename> のベストプラクティス

source: The following practices are relevant to the <filename>debian/control</filename> file. They supplement the <ulink url="&url-debian-policy;ch-binary.html#s-descriptions">Policy on package descriptions</ulink>.
de: Die folgenden Vorgehensweisen sind maßgeblich für die Datei <filename>debian/control</filename>. Sie ergänzen die <ulink url="&url-debian-policy;ch-binary.html#s-descriptions">Richtlinien für Paketbeschreibungen</ulink>.
fr: Les conseils qui suivent sont destinés au fichier <filename>debian/control</filename>. Ils complètent la <ulink url="&url-debian-policy;ch-binary.html#s-descriptions">Charte Debian</ulink> concernant les descriptions de paquets.
ja: 以下のプラクティスは、<filename>debian/control</filename> ファイルに関するものです。<ulink url="&url-debian-policy;ch-binary.html#s-descriptions">パッケージ説明文についてのポリシー</ulink>を補完します。

source: The description of the package, as defined by the corresponding field in the <filename>control</filename> file, contains both the package synopsis and the long description for the package. <xref linkend="bpp-desc-basics"/> describes common guidelines for both parts of the package description. Following that, <xref linkend="bpp-pkg-synopsis"/> provides guidelines specific to the synopsis, and <xref linkend="bpp-pkg-desc"/> contains guidelines specific to the description.
de: Die Beschreibung des Pakets, wie sie durch das entsprechende Feld in der Datei <filename>control</filename> definiert wird, enthält sowohl die Paketübersicht, als auch die ausführliche Beschreibung des Pakets. <xref linkend="bpp-desc-basics"/> beschreibt übliche Richtlinien für beide Teile der Paketbeschreibung. Diesen folgend stellt <xref linkend="bpp-pkg-synopsis"/> Richtlinien speziell für die Übersicht bereit und <xref linkend="bpp-pkg-desc"/> enthält spezielle Richtlinien für die Beschreibung.
fr: La description d'un paquet telle que définie par le champ correspondant du fichier <filename>control</filename>, comprend à la fois le résumé et la description longue du paquet. <xref linkend="bpp-desc-basics"/> donne des indications communes à ces deux parties, <xref linkend="bpp-pkg-synopsis"/> donne des indications spécifiques pour le résumé et <xref linkend="bpp-pkg-desc"/> donne des indications pour la description.
ja: パッケージの説明文は、<filename>control</filename> ファイルの対応するフィールドにて定義されている様に、パッケージの概要とパッケージに関する長い説明文の両方を含んでいます。<xref linkend="bpp-desc-basics"/> では、パッケージ説明文の双方の部分についての一般的なガイドラインが記述されています。それによると、<xref linkend="bpp-pkg-synopsis"/> が概要に特化したガイドラインを提供しており、そして <xref linkend="bpp-pkg-desc"/> が説明文 (description) に特化したガイドラインを含んでいます。

source: General guidelines for package descriptions
de: Allgemeine Richtlinien für Paketbeschreibungen
fr: Conseils généraux pour les descriptions de paquets
ja: パッケージ説明文の基本的なガイドライン

source: The package description should be written for the average likely user, the average person who will use and benefit from the package. For instance, development packages are for developers, and can be technical in their language. More general-purpose applications, such as editors, should be written for a less technical user.
de: Die Paketbeschreibung sollte für den erwarteten Durchschnittsanwender geschrieben werden, der Durchschnittsperson, die das Paket benutzt und davon profitiert. Entwicklungspakete sind beispielsweise für Entwickler und können in einer technischen Sprache verfasst werden. Anwendungen für allgemeinere Zwecke, wie Editoren, sollten für Anwender mit weniger technischem Verständnis geschrieben werden.
fr: La description d'un paquet doit être écrite pour son utilisateur moyen, c'est-à-dire la personne qui utilisera et tirera profit du paquet. Par exemple, les paquets de développement sont destinés aux développeurs et leur description peut comporter des détails techniques alors que les applications d'usage plus général, telles que les éditeurs, doivent avoir une description accessible à tout utilisateur.
ja: パッケージの説明文は平均的なユーザーに向けて書く必要があります。平均的な人というのは、パッケージを使って得をするであろう人のことです。例えば、開発用パッケージであれば開発者向けですし、彼ら向けの言葉でテクニカルに記述することができます。より汎用的なアプリケーション、例えばエディタなどであれば、あまり技術的ではないユーザ向けに書く必要があります。

source: Our review of package descriptions lead us to conclude that most package descriptions are technical, that is, are not written to make sense for non-technical users. Unless your package really is only for technical users, this is a problem.
de: Die Durchsicht der Paketbeschreibungen mündet in der Schlussfolgerung, dass die meisten Paketbeschreibungen technischer Natur sind, also nicht so geschrieben, das sie für Anwender ohne technischen Hintergrund einen Sinn ergeben. Sofern Ihr Paket nicht wirklich für technikkundige Anwender ist, ist dies ein Problem.
fr: Un examen général des descriptions de paquets tend à montrer que la plupart d'entre elles ont une orientation fortement technique et ne sont donc pas destinées à l'utilisateur moyen. Sauf dans le cas de paquets destinés à des spécialistes, cela doit être considéré comme un problème.
ja: パッケージ説明文のレビューを行った結果、ほとんどのものがテクニカルである、つまり、技術に詳しくはないユーザに通じるようには書かれてはいないという結論に達しました。あなたのパッケージが、本当に技術に精通したユーザ用のみではない限り、これは問題です。

source: How do you write for non-technical users? Avoid jargon. Avoid referring to other applications or frameworks that the user might not be familiar with — GNOME or KDE is fine, since users are probably familiar with these terms, but GTK+ is probably not. Try not to assume any knowledge at all. If you must use technical terms, introduce them.
de: Wie können sie für nicht technikkundige Anwender schreiben? Vermeiden Sie Fachsprache. Vermeiden Sie, sich auf Anwendungen und Rahmenwerke zu beziehen, mit denen der Anwender möglicherweise nicht vertraut ist – GNOME oder KDE sind in Ordnung, da Anwender wahrscheinlich mit diesen Begriffen vertraut sind, aber GTK+ vermutlich nicht. Versuchen Sie nicht irgendein Wissen vorauszusetzen, geben Sie eine Einführung.
fr: Une recommandation pour rester accessible à tout utilisateur est d'éviter l'utilisation de jargon. Il est déconseillé de faire référence à des applications ou environnements qui pourraient être inconnus de l'utilisateur : parler de GNOME ou KDE est correct, car la plupart des utilisateurs sont familiers avec ces termes mais parler de GTK+ ne l'est pas. Il est préférable de supposer que le lecteur n'aura pas de connaissance du sujet et, si des termes techniques doivent être utilisés, ils doivent être expliqués.
ja: どうやって技術に詳しくはないユーザに対して書けばいいのでしょう? ジャーゴンを避けましょう。ユーザが詳しくないであろう他のアプリケーションやフレームワークへの参照を避けましょうー GNOME や KDE については、おそらくユーザはその言葉について知っているでしょうから構いませんが、GTK+ はおそらくダメです。まったく知識がないと仮定してみましょう。技術用語を使わねばならない場合は、説明しましょう。

source: Be objective. Package descriptions are not the place for advocating your package, no matter how much you love it. Remember that the reader may not care about the same things you care about.
de: Seien Sie objektiv. Paketbeschreibungen sind nicht der richtige Ort, um Ihr Paket zu verfechten, egal wie Sie sehr sie es mögen. Denken Sie daran, dass der Leser nicht die gleichen Dinge wichtig nimmt, wie Sie.
fr: Il est conseillé de rester objectif. Les descriptions de paquets ne sont pas une plaquette publicitaire, quelles que soient vos opinions personnelles. Le lecteur peut très bien ne pas avoir les mêmes centres d'intérêt que vous.
ja: 客観的になりましょう。パッケージ説明文はあなたのパッケージの宣伝場所ではありません。あなたがそのパッケージをどんなに愛しているかは関係ありません。その説明文を読む人は、あなたが気にすることと同じことを気にはしないであろうことを覚えておいてください。

source: References to the names of any other software packages, protocol names, standards, or specifications should use their canonical forms, if one exists. For example, use X Window System, X11, or X; not X Windows, X-Windows, or X Window. Use GTK+, not GTK or gtk. Use GNOME, not Gnome. Use PostScript, not Postscript or postscript.
de: Bezüge zu Namen anderer Softwarepakete, Protokollnamen, Standards oder Spezifikationen sollten, falls sie existiert, in ihrer vorschriftsmäßigen Form verwandt werden. Benutzen Sie zum Beispiel X Window System, X11 oder X, nicht X Windows, X-Windows, or X Window. Benutzen Sie GTK+, nicht GTK oder gtk. Benutzen Sie GNOME nicht Gnome. Benutzen Sie PostScript, nicht Postscript oder postscript.
fr: Les références aux noms d'autres logiciels, de protocoles, normes ou spécifications doivent utiliser leur forme canonique si elle existe. Par exemple, utilisez « X Window System », « X11 » ou « X » mais pas « X Windows », « X-Windows », ou « X Window ». Utilisez « GTK+ » et non « GTK » ou « gtk », « GNOME » et non « Gnome », « PostScript » et non « Postscript » ou « postscript ».
ja: 他のソフトウェアパッケージ、プロトコル名、標準規格、仕様の名前を参照する場合には、もしあれば正規名称を使いましょう。X Windows や X-Windows や X Window ではなく、X Window System あるいは X11 または X を使いましょう。GTK や gtk ではなく GTK+ を使いましょう。Gnome ではなく GNOME を使いましょう。Postscript や postscript ではなく PostScript を使いましょう。

source: If you are having problems writing your description, you may wish to send it along to &email-debian-l10n-english; and request feedback.
de: Falls Sie Probleme beim Verfassen Ihrer Beschreibung haben, könnten Sie sie an &email-debian-l10n-english; senden und um Rückmeldung ersuchen.
fr: Si vous rencontrez des difficultés pour écrire la description d'un paquet, vous pouvez demander de l'aide ou une relecture sur &email-debian-l10n-english;.
ja: 説明文を書くことに問題があれば、&email-debian-l10n-english; へそれを送ってフィードバックを求めるとよいでしょう。

source: The package synopsis, or short description
de: Die Paketübersicht oder Kurzbeschreibung
fr: Résumé, ou description courte, d'un paquet
ja: パッケージの概要、あるいは短い説明文

source: Policy says the synopsis line (the short description) must be concise, not repeating the package name, but also informative.
de: Die Richtlinie sagt, die Übersichtszeile (die Kurzbeschreibung) muss kurz sein, darf den Paketnamen nicht wiederholen, muss aber auch informativ sein.
fr: La Charte indique que la ligne de résumé (la description courte) doit être concise, ne doit pas répéter le nom du paquet, mais doit être informative.
ja: ポリシーでは、概要行 (短い説明文) はパッケージ名を繰り返すのではなく、簡潔かつ有益なものである必要がある、となっています。

source: The synopsis functions as a phrase describing the package, not a complete sentence, so sentential punctuation is inappropriate: it does not need extra capital letters or a final period (full stop). It should also omit any initial indefinite or definite article — "a", "an", or "the". Thus for instance:
de: Die Übersichtsfunktionen ist ein Ausdruck, der das Paket beschreibt, kein kompletter Satz, daher ist Zeichensetzung unangebracht: Es wird weder eine besondere Großschreibung noch ein abschließender Punkt benötigt. Außerdem sollten jegliche bestimmten und unbestimmten Artikel am Anfang weggelassen werden – »a«, »an« oder »the«. Deshalb zum Beispiel:
fr: La description courte est une expression qui décrit le paquet, pas une phrase complète, donc les conventions de ponctuation sont inappropriés : pas besoin de commencer par une majuscule ou de finir par un point. Elle devrait éviter également la présence d'article défini ou indéfini — « <literal>a</literal> », « <literal>an</literal> », ou « <literal>the</literal> ». Par exemple :
ja: 概要は、完全な文章ではなくパッケージを記述するフレーズとして機能します。ですので、句読点は不適切です: 追加の大文字や最後のピリオドは不要です。また、最初の不定冠詞や定冠詞 — "a", "an", or "the" を削る必要があります。つまり、例えば以下のようになります:

source: Technically this is a noun phrase minus articles, as opposed to a verb phrase. A good heuristic is that it should be possible to substitute the package <replaceable>name</replaceable> and <replaceable>synopsis</replaceable> into this formula:
de: Technisch gesehen ist dies eine Nominalphrase im Gegensatz zu einer Verbalphrase. Eine gute Entscheidungsregel ist, dass es möglich sein sollte, den Paket-<replaceable>Namen</replaceable> und die <replaceable>Übersicht</replaceable> in diesem Schema zu ersetzen:
fr: Techniquement, c'est une phrase nominale sans article, par opposition à une une phrase verbale. Une bonne vérification est de pouvoir remplacer le <replaceable>nom</replaceable> du paquet et son <replaceable>résumé</replaceable> dans la phrase :
ja: 技術的に言えば、動詞のフレーズに対して、これは名詞のフレーズから文章を差し引いたものです。パッケージ<replaceable>名</replaceable>と<replaceable>要約</replaceable>をこの決まり文句に代入できるのがよい見つけ方です:

source: The package <replaceable>name</replaceable> provides {a,an,the,some} <replaceable>synopsis</replaceable>.
de: The package <replaceable>Name</replaceable> provides {a,an,the,some} <replaceable>Übersicht</replaceable>.
fr: Le paquet <replaceable>nom</replaceable> fournit {un,une,le,la,l',du,de la} <replaceable>résumé</replaceable> (« <literal>the package <replaceable>nom</replaceable> provides {a,an,the,some} <replaceable>résumé</replaceable></literal> »).
ja: パッケージの<replaceable>名前</replaceable>は<replaceable>概要</replaceable>を提供します。

source: Sets of related packages may use an alternative scheme that divides the synopsis into two parts, the first a description of the whole suite and the second a summary of the package's role within it:
de: Zusammenstellungen verwandter Pakete können ein alternatives Schema benutzen, das die Übersicht in zwei Teile unterteilt, als erstes eine Beschreibung der ganzen Suite und als zweites eine Zusammenfassung der Rolle, die das Paket darin spielt:
fr: Les ensembles de paquets peuvent utiliser un schéma alternatif qui divise la description courte en deux parties, la première une description de l'ensemble et la seconde un résumé du rôle du paquet dans l'ensemble :
ja: 関連パッケージ群は、概要を 2 つに分けた別の書き方をした方が良いでしょう。最初はその組一式の説明文で、その次はその組内でのパッケージの役割のサマリにします:

source: These synopses follow a modified formula. Where a package "<replaceable>name</replaceable>" has a synopsis "<replaceable>suite</replaceable> (<replaceable>role</replaceable>)" or "<replaceable>suite</replaceable> - <replaceable>role</replaceable>", the elements should be phrased so that they fit into the formula:
de: Diese Übersicht folgt einem geänderten Schema. Wo ein Paket »<replaceable>Name</replaceable>« die Übersicht »<replaceable>Suite</replaceable> (<replaceable>Rolle</replaceable>)« oder »<replaceable>Suite</replaceable> - <replaceable>Rolle</replaceable>« hat, sollten die Elemente so ausgedrückt werden, dass sie in dieses Schema passen:
fr: Ces descriptions courtes suivent un modèle modifié. Quand un paquet « <replaceable>nom</replaceable> » possède une description courte « <replaceable>ensemble</replaceable> (<replaceable>rôle</replaceable>) » ou « <replaceable>ensemble</replaceable> - <replaceable>rôle</replaceable> », les éléments peuvent être placés dans la phrase :
ja: これらの要約が、手が加えられた決まり文句に続きます。パッケージ "<replaceable>名</replaceable>" が、"<replaceable>プログラム一式</replaceable> (<replaceable>役割</replaceable>)" あるいは "<replaceable>プログラム一式</replaceable> - <replaceable>役割</replaceable>" という要約を持つ場合、要素はフレーズにすべきで、決まり文句に合うようになります:

source: The package <replaceable>name</replaceable> provides {a,an,the} <replaceable>role</replaceable> for the <replaceable>suite</replaceable>.
fr: Le paquet <replaceable>nom</replaceable> fournit {un,une,le,la,l'} <replaceable>rôle</replaceable> pour {le,la,l'} <replaceable>ensemble</replaceable> (« <literal>the package <replaceable>nom</replaceable> provides {a,an,the} <replaceable>rôle</replaceable> for the <replaceable>ensemble</replaceable></literal> »).
ja: パッケージ<replaceable>名</replaceable>は、<replaceable>プログラム一式</replaceable>に対する<replaceable>役割</replaceable>を表しています。

source: The long description
de: Die ausführliche Beschreibung
fr: Description longue
ja: 長い説明文 (long description)

source: The long description is the primary information available to the user about a package before they install it. It should provide all the information needed to let the user decide whether to install the package. Assume that the user has already read the package synopsis.
de: Die ausführliche Beschreibung ist die wichtigste für den Benutzer verfügbare Information über ein Paket, bevor er es installiert. Sie sollte alle nötigen Informationen bereitstellen, damit der Anwender entscheiden kann, ob er das Paket installiert. Es ist anzunehmen, dass der Benutzer bereits die Paketübersicht gelesen hat.
fr: La description longue est l'information principale disponible pour les utilisateurs avant d'installer un paquet. Elle devrait fournir toute les informations nécessaires pour déterminer si le paquet doit être installé. Elle complète le résumé qui est donc supposé avoir été lu précédemment.
ja: 長い説明文は、ユーザーがパッケージをインストールする前に利用可能な最初の情報です。ユーザーがインストールするか否かを決めるのに必要な情報を、すべて提供する必要があります。ユーザーがパッケージの概要を既に読んでいると仮定してください。

source: The long description should consist of full and complete sentences.
de: Die ausführliche Beschreibung sollte aus vollständigen Sätzen bestehen.
fr: La description longue est constituée de phrases complètes.
ja: 長い説明文は、完全な文章から成る必要があります。

source: The first paragraph of the long description should answer the following questions: what does the package do? what task does it help the user accomplish? It is important to describe this in a non-technical way, unless of course the audience for the package is necessarily technical.
de: Der erste Absatz der ausführlichen Beschreibung sollte die folgenden Fragen beantworten: Was tut das Paket? Bei welchen Aufgaben hilft es dem Anwender? Es ist wichtig dies auf eine nicht technische Weise zu beschreiben, sogar dann, wenn die Zielgruppe des Pakets notwendigerweise einen technischen Hintergrund hat.
fr: Le premier paragraphe de cette description devrait tenter de répondre aux questions suivantes : « Que fait ce paquet ? », « Dans quelle tâche aidera-t-il l'utilisateur ? ». Il est important que cette description se fasse de la manière la moins technique possible, sauf si le public auquel est destiné le paquet est par définition technique.
ja: 長い説明文の最初の段落は、以下の質問に答えている必要があります: このパッケージは何をするの? ユーザが作業を完了するのに、どのタスクが役に立つの? ─ 技術寄りではない書き方でこれを記述するのが重要です。もちろんパッケージの利用者が必然的に技術者ではない限り、です。
