Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: Make sure that you've built and tested your package in <literal>testing</literal>, not in <literal>unstable</literal>;
de: Prüfen Sie nach, ob Sie Ihr Paket in <literal>testing</literal> und nicht in <literal>unstable</literal> getestet haben.
fr: vérifiez avoir construit et testé votre paquet dans <literal>testing</literal>, et non dans <literal>unstable</literal> ;
ja: 必ず <literal>不安定版 (unstable)</literal> ではなく <literal>テスト版 (testing)</literal> でパッケージを構築・テストしている;

source: Make sure that your version number is higher than the version in <literal>testing</literal> and <literal>testing-proposed-updates</literal>, and lower than in <literal>unstable</literal>;
de: Gehen sie sicher, dass Ihre Versionsnummer höher als die Version in <literal>testing</literal> und <literal>testing-proposed-updates</literal> ist und niedriger als in <literal>unstable</literal>.
fr: vérifiez que le numéro de version est plus élevé que les versions de <literal>testing</literal> et <literal>testing-proposed-updates</literal>, et moins élevé que celle de <literal>unstable</literal> ;
ja: バージョン番号が <literal>testing</literal> および <literal>testing-proposed-updates</literal> のものよりも大きく、<literal>unstable</literal> のものよりも小さいのを確認する;

source: After uploading and successful build on all platforms, contact the release team at &email-debian-release; and ask them to approve your upload.
de: Nach dem Hochladen und erfolgreichen Erstellen auf allen Plattformen, kontaktieren Sie das Team unter &email-debian-release; und ersuchen Sie es um Genehmigung Ihres Uploads.
fr: après l'envoi et la construction réussie sur toutes les plates-formes, contactez l'équipe de publication à &email-debian-release; et demandez-leur d'approuver votre envoi.
ja: アップロードしてすべてのプラットフォームで構築が成功したら、&email-debian-release; 宛でリリースチームに連絡を取って、アップロードを承認してくれるように依頼しましょう。

source: Frequently asked questions
de: Häufig gestellte Fragen
fr: Foire aux questions
ja: よく聞かれる質問とその答え (FAQ)

source: What are release-critical bugs, and how do they get counted?
de: Was sind release-kritische Fehler und wie werden Sie gezählt?
fr: Quels sont les bogues bloquant l'intégration dans la version stable et comment sont-ils comptés ?
ja: リリースクリティカルバグとは何ですか、どうやって数えるのですか?

source: All bugs of some higher severities are by default considered release-critical; currently, these are <literal>critical</literal>, <literal>grave</literal> and <literal>serious</literal> bugs.
de: Alle Fehler mit einem höheren Schweregrad werden standardmäßig als release-kritisch angesehen. Aktuell sind dies Fehler der Schweregrade <literal>critical</literal>, <literal>grave</literal> und <literal>serious</literal>.
fr: Tous les bogues de gravité assez élevée sont par défaut considérés comme bloquant l'intégration du paquet dans la version stable ; actuellement, ce sont les bogues <literal>critical</literal> (critique), <literal>grave</literal> (grave) et <literal>serious</literal> (sérieux).
ja: ある重要度以上のバグすべてが通常リリースクリティカルであると見なされます。現在のところ、<literal>critical (致命的)</literal>、<literal>grave (重大)</literal>、<literal>serious (深刻)</literal> バグがそれにあたります。

source: Such bugs are presumed to have an impact on the chances that the package will be released with the <literal>stable</literal> release of Debian: in general, if a package has open release-critical bugs filed on it, it won't get into <literal>testing</literal>, and consequently won't be released in <literal>stable</literal>.
de: Von solchen Fehlern wird angenommen, dass sie einen Einfluss darauf haben, ob das Paket mit dem <literal>stable</literal>-Release von Debian veröffentlicht wird: Im Allgemeinen würde ein Paket, das offene release-kritische Fehler hat, nicht nach <literal>testing</literal> gelangen und demzufolge nicht in <literal>stable</literal> veröffentlicht werden.
fr: Certains bogues sont supposés avoir un impact sur la probabilité d'un paquet a être diffusé dans la version <literal>stable</literal> de Debian : en général, si un paquet a des bogues bloquants, il n'ira pas dans <literal>testing</literal>, et par conséquent, ne pourra pas être diffusé dans <literal>stable</literal>.
ja: そのようなバグは、Debian の <literal>安定版 (stable)</literal> リリース時に、そのパッケージがリリースされる見込みに影響があるものと仮定されます: 一般的に、パッケージでオープンになっているリリースクリティカルバグがある場合、そのパッケージは<literal>テスト版 (testing)</literal> に入らず、その結果<literal>安定版 (stable)</literal> ではリリースされません。

source: The <literal>unstable</literal> bug count are all release-critical bugs which are marked to apply to <replaceable>package</replaceable>/<replaceable>version</replaceable> combinations that are available in unstable for a release architecture. The <literal>testing</literal> bug count is defined analogously.
de: Als <literal>unstable</literal>-Fehleranzahl werden alle release-kritischen Fehler gezählt, die als <replaceable>Paket-</replaceable>/<replaceable>Versions-</replaceable>Kombinationen zugehörig markiert sind, die in Unstable für eine Release-Architektur verfügbar sind. Die Fehleranzahl in <literal>testing</literal> ist sinngemäß definiert.
fr: Le décompte des bogues d'<literal>unstable</literal> est effectué avec tous les bogues critiques pour la publication marqués pour s'appliquer à une combinaison de <replaceable>paquet</replaceable>/<replaceable>version</replaceable> disponible dans <literal>unstable</literal> pour une architecture concernée par la publication. Le décompte des bogues de <literal>testing</literal> est défini de façon analogue.
ja: <literal>不安定版 (unstable)</literal> でのバグのカウント数は、リリース対象アーキテクチャの不安定版 (unstable) で利用可能な<replaceable>パッケージ</replaceable>/<replaceable>バージョン</replaceable>の組み合わせに適用されるとマークされたすべてのリリースクリティカルバグです。<literal>テスト版 (testing)</literal> のバグのカウント数も同様に定義します。

source: How could installing a package into <literal>testing</literal> possibly break other packages?
de: Wie kann das Installieren eines Pakets in <literal>testing</literal> andere Pakete möglicherweise zerstören?
fr: Comment l'installation d'un paquet dans <literal>testing</literal> peut-elle casser d'autres paquets ?
ja: どのようにすれば、他のパッケージを壊す可能性があるパッケージを<literal>テスト版 (testing)</literal> へインストールできますか?

source: The structure of the distribution archives is such that they can only contain one version of a package; a package is defined by its name. So when the source package <literal>acmefoo</literal> is installed into <literal>testing</literal>, along with its binary packages <literal>acme-foo-bin</literal>, <literal>acme-bar-bin</literal>, <literal>libacme-foo1</literal> and <literal>libacme-foo-dev</literal>, the old version is removed.
de: Die Struktur der Distributionsarchive ist so aufgebaut, dass Sie nur eine Version eines Pakets enthalten kann. Ein Paket wird durch seinen Namen definiert. Wenn also das Quellpaket <literal>acmefoo</literal> zusammen mit seinen Binärpaketen <literal>acme-foo-bin</literal>, <literal>acme-bar-bin</literal>, <literal>libacme-foo1</literal> und <literal>libacme-foo-dev</literal> nach <literal>testing</literal> installiert wird, wird die alte Version entfernt.
fr: La structure des archives de la distribution est faite de telle façon qu'elles ne peuvent contenir qu'une version d'un paquet ; un paquet est défini par son nom. Donc, quand le paquet source <literal>acmefoo</literal> est installé dans <literal>testing</literal> avec ses paquets binaires <literal>acme-foo-bin</literal>, <literal>acme-bar-bin</literal>, <literal>libacme-foo1</literal> et <literal>libacme-foo-dev</literal>, l'ancienne version est supprimée.
ja: ディストリビューションにおけるアーカイブの構造では、一つのバージョンのパッケージだけを持つことができ、パッケージは名前によって定義されています。そのため、ソースパッケージ <literal>acmefoo</literal> が<literal>テスト版 (testing)</literal> にインストールされると、付随するバイナリパッケージ <literal>acme-foo-bin</literal>、<literal>acme-bar-bin</literal>、<literal>libacme-foo1</literal>、<literal>libacme-foo-dev</literal> の古いバージョンが削除されます。

source: However, the old version may have provided a binary package with an old soname of a library, such as <literal>libacme-foo0</literal>. Removing the old <literal>acmefoo</literal> will remove <literal>libacme-foo0</literal>, which will break any packages which depend on it.
de: Die alte Version könnte jedoch ein Binärpaket mit einem alten Soname einer Bibliothek bereitstellen, wie <literal>libacme-foo0</literal>. Das Entfernen der alten <literal>acmefoo</literal> wird <literal>libacme-foo0</literal> entfernen, was alle Pakete zerstört, die davon abhängen.
fr: Cependant, l'ancienne version pouvait fournir à un paquet binaire un vieux <literal>soname</literal> d'une bibliothèque, comme <literal>libacme-foo0</literal>. Supprimer l'ancien <literal>acmefoo</literal> va supprimer <literal>libacme-foo0</literal>, ce qui va casser tout paquet qui en dépend.
ja: しかし、古いバージョンではライブラリに古い soname を含んだ <literal>libacme-foo0</literal> のようなバイナリパッケージを提供しているかもしれません。古い <literal>acmefoo</literal> を削除するのは <literal>libacme-foo0</literal> を削除することになり、これに依存しているパッケージを壊してしまいます。

source: Evidently, this mainly affects packages which provide changing sets of binary packages in different versions (in turn, mainly libraries). However, it will also affect packages upon which versioned dependencies have been declared of the ==, &lt;=, or &lt;&lt; varieties.
de: Offenbar betrifft dies hauptsächlich Pakete, die ändernde Zusammenstellungen von Binärpaketen in unterschiedlichen Versionen bereitstellen (wiederum hauptsächlich Bibliotheken). Es wird jedoch außerdem Pakete betreffen, deren Versionsabhängigkeiten über die Varianten ==, &lt;= oder &lt;&lt; deklariert wurden.
fr: Évidemment, cela touche principalement des paquets qui fournissent des jeux changeant de paquets binaires dans différentes versions (à tour de rôle, principalement des bibliothèques). Cependant, cela va aussi concerner des paquets sur lesquels une dépendance versionnée du type <literal>==</literal>, <literal>&lt;=</literal>, ou <literal>&lt;&lt;</literal> a été déclarée.
ja: おそらく、これが主に影響するのは、一群のバイナリパッケージを変更したのを別バージョンで提供しているパッケージ (つまり、主にライブラリ) でしょう。しかし、バージョン付きの依存関係が ==、&lt;=、&lt;&lt; などで宣言されているパッケージにも影響は及ぼします。

source: When the set of binary packages provided by a source package change in this way, all the packages that depended on the old binaries will have to be updated to depend on the new binaries instead. Because installing such a source package into <literal>testing</literal> breaks all the packages that depended on it in <literal>testing</literal>, some care has to be taken now: all the depending packages must be updated and ready to be installed themselves so that they won't be broken, and, once everything is ready, manual intervention by the release manager or an assistant is normally required.
de: Wenn sich die Zusammenstellung von Binärpaketen, die von einem Quellpaket bereitgestellt werden, auf diese Weise ändert, müssen alle Pakete, die von den alten Programmen abhängen, aktualisiert werden, damit sie stattdessen von den neuen Programmen abhängen. Da das Installieren eines solchen Quellpakets in <literal>testing</literal> alle Pakete zerstört, die in <literal>testing</literal> davon abhängen, ist nun auf Folgendes zu achten: All die abhängigen Pakete müssen aktualisiert werden und selbst bereit zur Installation sein, so dass sie nicht kaputt gehen. Sobald alles bereit ist, ist normalerweise ein manuelles Eingreifen des Veröffentlichungsverwalters oder eines Assistenten nötig.
fr: Quand le jeu de paquets binaires fournis par un paquet source change de cette façon, tous les paquets qui dépendent des anciens binaires doivent être mis à jour pour dépendre plutôt de la nouvelle version. Comme l'installation d'un tel paquet source dans <literal>testing</literal> casse tous les paquets qui en dépendent dans <literal>testing</literal>, une attention particulière doit y être portée : tous les paquets en dépendant doivent être mis à jour et prêts à être installés eux-mêmes pour ne pas casser et, une fois que tout est prêt, une intervention manuelle des responsables de publication est normalement requise.
ja: 一つのソースパッケージによって提供されている一群のバイナリパッケージがこのようにして変更された場合、古いバイナリに依存しているすべてのパッケージは新しいバイナリに依存するように更新する必要があります。このようなソースパッケージを<literal>テスト版 (testing)</literal> にインストールすると<literal>テスト版 (testing)</literal> で依存しているすべてのパッケージを壊すことになるので、ここで注意をする必要があります: すべての依存しているパッケージを更新し、インストールできるように準備しておくことで壊されないようにしておき、そして、すべての準備ができたら、通常はリリースマネージャあるいはリリースアシスタントによる手動作業が必要になります。

source: If you are having problems with complicated groups of packages like this, contact &email-debian-devel; or &email-debian-release; for help.
de: Falls Sie Probleme mit komplizierten Gruppen von Paketen wie diesem haben, kontaktieren Sie &email-debian-devel; oder &email-debian-release;, um Hilfe zu erhalten.
fr: Si vous avez des problèmes avec des groupes compliqués de paquets comme ceci, demandez de l'aide sur &email-debian-devel; ou &email-debian-release;.
ja: この様に複雑な組み合わせのパッケージで問題がある場合は、&email-debian-devel; あるいは &email-debian-release; に連絡を取って手助けを求めてください。

source: Resources for Debian Developers
de: Ressourcen für Debian-Entwickler
fr: Ressources pour les responsables Debian
ja: Debian 開発者が利用可能なリソース

source: In this chapter you will find a very brief road map of the Debian mailing lists, the Debian machines which may be available to you as a developer, and all the other resources that are available to help you in your maintainer work.
de: In diesem Kapitel werden Sie einen kurzen Leitfaden der Debian-Mailinglisten finden, der Debian-Maschinen, die Ihnen als Entwickler zur Verfügung stehen, und all den anderen Ressourcen, die verfügbar sind, um Ihnen bei Ihrer Arbeit als Betreuer zu helfen.
fr: Ce chapitre décrit brièvement les listes de diffusion, les serveurs Debian à disposition des développeurs et les autres ressources utiles au travail de responsable.
ja: この章では、Debian メーリングリストについてのおおよその概略、開発者であるあなたが利用できるであろう Debian マシン、メンテナとしての作業で役立つその他全ての利用可能なリソースを確認します。

source: Mailing lists
de: Mailinglisten
fr: Listes de diffusion
ja: メーリングリスト

source: Much of the conversation between Debian developers (and users) is managed through a wide array of mailing lists we host at <literal><ulink url="http://&lists-host;/">&lists-host;</ulink></literal>. To find out more on how to subscribe or unsubscribe, how to post and how not to post, where to find old posts and how to search them, how to contact the list maintainers and see various other information about the mailing lists, please read <ulink url="&url-debian-lists;"></ulink>. This section will only cover aspects of mailing lists that are of particular interest to developers.
de: Viele Unterhaltungen zwischen Debian-Entwicklern (und Anwendern) werden durch ein weites Feld von Mailinglisten verwaltet, die auf <literal><ulink url="http://&lists-host;/">&lists-host;</ulink></literal> untergebracht sind. Mehr darüber, wie Sie sie abonnieren oder abbestellen, wie sie Artikel abschicken, wo alte Artikel gefunden werden und wie Sie sie suchen, wie Sie Listenbetreuer kontaktieren und verschiedene sonstige Informationen über Mailinglisten finden, können Sie unter <ulink url="&url-debian-lists;"></ulink> lesen. Dieser Abschnitt wird nur die Gesichtspunkte der Mailinglisten aufdecken, die von besonderem Interesse für Entwickler sind.
fr: Une grande partie des discussions entre les développeurs Debian (et les utilisateurs) a lieu dans un vaste éventail de listes de diffusion hébergées sur <literal><ulink url="http://&lists-host;/">&lists-host;</ulink></literal>. Pour en savoir plus sur la façon de s'abonner ou se désabonner, d'utiliser les listes, de consulter les archives, de contacter leurs responsables, ainsi que diverses autres informations sur les listes de diffusion, veuillez lire <ulink url="&url-debian-lists;"></ulink>. Cette section ne détaille que les informations utiles aux développeurs.
ja: Debian 開発者 (それにユーザ) の間で交わされるやり取りの大半は <literal><ulink url="http://&lists-host;/">&lists-host;</ulink></literal> で提供されている広範囲に渡るメーリングリスト群で行われています。どうやって購読／解除するのか、どうやって投稿するか（あるいはしないのか）、どこで過去の投稿を見つけるのか、どうやって過去の投稿の中から探すのか、どうやってメーリングリスト管理者と連絡をとるのか、その他メーリングリストに関する様々な情報については <ulink url="&url-debian-lists;"></ulink> を参照してください。

source: Basic rules for use
de: Grundregeln für die Benutzung
fr: Règles d'utilisation fondamentales
ja: 利用の基本ルール

source: When replying to messages on the mailing list, please do not send a carbon copy (<literal>CC</literal>) to the original poster unless they explicitly request to be copied. Anyone who posts to a mailing list should read it to see the responses.
de: Wenn Sie auf Nachrichten auf der Mailingliste antworten, senden Sie bitte keine Kopie (<literal>CC</literal>) an den ursprünglichen Verfasser, außer, wenn dieser explizit darum bittet. Jeder, der an eine Mailingliste schreibt, sollte sie lesen, um die Antworten zu sehen.
fr: Une réponse sur une liste de diffusion ne doit pas être envoyée en copie (<literal>CC</literal>) à l'expéditeur initial, sauf s'il l'a explicitement demandé. Toute personne écrivant sur une liste de diffusion devrait la suivre pour voir les réponses.
ja: メーリングリストのメッセージに返信する際には、大本の投稿者が特別に要求しない限り、同報メール (<literal>CC</literal>) を送らないようにしてください。メーリングリストに投稿する人は必ず返信を見ているはずです。

source: Cross-posting (sending the same message to multiple lists) is discouraged. As ever on the net, please trim down the quoting of articles you're replying to. In general, please adhere to the usual conventions for posting messages.
de: Kreuzversand (die gleiche Nachricht an mehrere Listen senden) ist unerwünscht. Kürzen Sie, wie immer im Netz, die Zitate von Artikeln, auf die Sie antworten. Halten Sie sich bitte an die allgemeinen Gepflogenheiten beim Versand von Nachrichten.
fr: L'envoi d'un même message à plusieurs listes (« <literal>cross-post</literal> ») est déconseillé. Conformément aux usages, veuillez réduire la citation des articles auxquels vous répondez. En règle générale, veuillez respecter les conventions habituelles d'envoi de messages.
ja: クロスポスト (同じメッセージを複数のメーリングリストに投稿する) のはお止め下さい。いつものネット上と同じ様に、返信文では引用を削って下さい。概して投稿するメッセージについては、通常の慣習をしっかりと守ってください。

source: Please read the <ulink url="&url-debian-lists;#codeofconduct">code of conduct</ulink> for more information. The <ulink url="&url-dcg;">Debian Community Guidelines</ulink> are also worth reading.
de: Bitte lesen Sie den <ulink url="&url-debian-lists;#codeofconduct">Leitfaden</ulink>, um weitere Informationen zu erhalten. Die <ulink url="&url-dcg;">Debian Community Guidelines</ulink> sind ebenfalls Wert, gelesen zu werden.
fr: Veuillez lire le <ulink url="&url-debian-lists;#codeofconduct">code de conduite</ulink> pour plus de renseignements. Les <ulink url="&url-dcg;">recommandations de la communauté Debian (« <literal>Debian Community Guidelines</literal> »)</ulink> valent également la peine d'être lue.
ja: 詳細については<ulink url="&url-debian-lists;#codeofconduct">行動規範</ulink>を参照してください。<ulink url="&url-dcg;">Debian コミュニティガイドライン</ulink>も読むと良いでしょう。

source: Core development mailing lists
de: Haupt-Entwickler-Mailinglisten
fr: Principales listes de diffusion pour les responsables
ja: 開発の中心となっているメーリングリスト

source: The core Debian mailing lists that developers should use are:
de: Die Haupt-Debian-Mailinglisten, die Entwickler nutzen sollten, sind:
fr: Les principales listes de diffusion que les développeurs devraient suivre sont :
ja: 開発者が利用すべき Debian の中核メーリングリスト:

source: &email-debian-devel-announce;, used to announce important things to developers. All developers are expected to be subscribed to this list.
de: &email-debian-devel-announce; wird benutzt, um Entwicklern wichtige Dinge anzukündigen. Es wird von allen Entwicklern erwartet, dass sie diese Liste abonnieren.
fr: &email-debian-devel-announce;, pour les annonces importantes aux développeurs. Tous les responsables Debian sont censés être inscrits à cette liste ;
ja: &email-debian-devel-announce; は開発者に重要な事を伝える際に使われます。全開発者がこのメーリングリストを購読する事が望まれます。

source: &email-debian-devel;, used to discuss various development related technical issues.
de: &email-debian-devel; wird benutzt, um über verschiedene entwicklungsbezogene technische Themen zu reden.
fr: &email-debian-devel;, pour les diverses questions techniques relatives au développement ;
ja: &email-debian-devel; は様々な技術関連の事柄を話し合うのに使われます。

source: &email-debian-policy;, where the Debian Policy is discussed and voted on.
de: &email-debian-policy; wird benutzt, um über die Debian-Richtlinien zu diskutieren und darüber abzustimmen.
fr: &email-debian-policy;, où la Charte Debian (« <literal>Debian Policy</literal> ») est discutée et votée ;
ja: &email-debian-policy; は Debian ポリシーについて話し合い、それに対して投票を行うのに使われます。

source: &email-debian-project;, used to discuss various non-technical issues related to the project.
de: &email-debian-project; wird benutzt, um über verschiedene entwicklungsbezogene, nicht technische Themen zu reden.
fr: &email-debian-project;, pour les questions diverses et non techniques relatives au projet.
ja: &email-debian-project; はプロジェクトに関する様々な非技術関連の事柄を話し合うのに使われます。

source: There are other mailing lists available for a variety of special topics; see <ulink url="http://&lists-host;/"></ulink> for a list.
de: Es sind weitere Mailinglisten für unterschiedliche Spezialthemen verfügbar. Eine Liste finden Sie unter <ulink url="http://&lists-host;/"></ulink>.
fr: D'autres listes de diffusion sont spécialisées dans différents thèmes ; voir une liste sur <ulink url="http://&lists-host;/"></ulink>.
ja: 他にも様々な事柄に特化したメーリングリストが利用できます。一覧については <ulink url="http://&lists-host;/"></ulink> を参照してください。

source: Special lists
de: Spezielle Listen
fr: Listes particulières
ja: 特別なメーリングリスト

source: &email-debian-private; is a special mailing list for private discussions amongst Debian developers. It is meant to be used for posts which for whatever reason should not be published publicly. As such, it is a low volume list, and users are urged not to use &email-debian-private; unless it is really necessary. Moreover, do <emphasis>not</emphasis> forward email from that list to anyone. Archives of this list are not available on the web for obvious reasons, but you can see them using your shell account on <literal>&master-host;</literal> and looking in the <filename>&file-debian-private-archive;</filename> directory.
de: &email-debian-private; ist eine besondere Mailingliste für private Unterhaltungen zwischen Debian-Entwicklern. Das heißt, sie sollte benutzt werden, um über Dinge zu reden, die aus irgend einem Grund nicht veröffentlicht werden sollen. Eigentlich ist es eine Liste mit geringem Umfang und Benutzer werden angehalten &email-debian-private; nicht zu benutzen, so lange es nicht wirklich nötig ist. Leiten Sie außerdem <emphasis>keine</emphasis> E-Mail von dieser Liste an jemanden weiter. Es sind aus naheliegenden Gründen keine Archive dieser Liste im Web verfügbar, aber Sie können sie sehen, indem Sie Ihr Shell-Konto auf <literal>&master-host;</literal> benutzen und in das Verzeichnis <filename>&file-debian-private-archive;</filename> schauen.
fr: &email-debian-private; est une liste de diffusion destinée aux échanges privés entre développeurs Debian. Elle sert aux messages qui, pour une raison ou une autre, ne devraient pas être rendus publics. De ce fait, c'est une liste à faible trafic. Il est déconseillé d'utiliser &email-debian-private; sauf en cas de réelle nécessité. En outre, il ne faut <emphasis>jamais</emphasis> faire suivre un message provenant de cette liste à qui que ce soit. Les archives de cette liste ne sont pas disponibles sur la toile pour des raisons évidentes, mais il est possible de les consulter dans le répertoire <filename>&file-debian-private-archive;</filename> sur <literal>&master-host;</literal>.
ja: &email-debian-private; は Debian 開発者間でのプライベートな話し合い用に使う特別なメーリングリストです。つまり、理由がなんであれここに投稿された文章は公開するべきではないものであることを意味しています。このため、これは流量が少ないメーリングリストで、ユーザは本当に必要でない限りは &email-debian-private; を使わないように勧められています。さらに、このメーリングリストから誰かへメールを転送しては<emphasis>いけません</emphasis>。様々な理由からこのメーリングリストのアーカイブはウェブから見ることはできませんが、<literal>&master-host;</literal> 上のシェルアカウントを使って <filename>&file-debian-private-archive;</filename> ディレクトリを参照することで確認できます。
