Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: Read the <ulink url="&url-bts-report;">instructions for reporting bugs</ulink> in the Debian <ulink url="&url-bts;">bug tracking system</ulink>.
de: Lesen Sie die <ulink url="&url-bts-report;">Anweisungen zum Melden von Fehlern</ulink> in der <ulink url="&url-bts;">Debian-Fehlerdatenbank</ulink>.
fr: Lisez les <ulink url="&url-bts-report;">instructions pour signaler un bogue</ulink> dans le <ulink url="&url-bts;">système de suivi des bogues</ulink> Debian.
ja: Debian <ulink url="&url-bts;">バグ追跡システム (BTS)</ulink> の <ulink url="&url-bts-report;">バグ報告のやり方について (instructions for reporting bugs)</ulink> を参照してください。

source: Try to submit the bug from a normal user account at which you are likely to receive mail, so that people can reach you if they need further information about the bug. Do not submit bugs as root.
de: Versuchen Sie, den Fehlerbericht von einem normalen Benutzerkonto zu senden, von dem Sie wahrscheinlich Mails empfangen können, so dass Leute, die weitere Informationen über den Fehler benötigen, Sie erreichen können. Senden Sie keine Fehlerberichte als Root.
fr: Essayez de signaler un bogue à partir d'un compte utilisateur normal avec lequel vous pouvez recevoir des courriers, pour que les personnes puissent vous joindre si elles ont besoin de plus d'informations à propos du bogue. Ne signalez pas de bogues en tant que root.
ja: いつも使っているメールを受け取れるユーザアカウントからバグを送ってみてください。そうすることで、開発者がそのバグに関するより詳細な情報を必要とする場合にあなたに尋ねることができます。root ユーザでバグを報告しないでください。

source: You can use a tool like <citerefentry> <refentrytitle>reportbug</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> to submit bugs. It can automate and generally ease the process.
de: Sie können ein Werkzeug wie <citerefentry> <refentrytitle>reportbug</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> benutzen, um Fehlerberichte zu senden. Es kann den Prozess automatisieren und generell erleichtern.
fr: Vous pouvez utiliser un outil comme <citerefentry> <refentrytitle>reportbug</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> pour signaler des bogues. Il peut automatiser et dans l'ensemble faciliter le processus.
ja: バグを報告するには、<citerefentry> <refentrytitle>reportbug</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> のようなツールが使えます。これによって作業を自動化し、かなり簡単なものにできます。

source: Make sure the bug is not already filed against a package. Each package has a bug list easily reachable at <literal>http://&bugs-host;/<replaceable>packagename</replaceable></literal>. Utilities like <citerefentry> <refentrytitle>querybts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> can also provide you with this information (and <command>reportbug</command> will usually invoke <command>querybts</command> before sending, too).
de: Stellen Sie sicher, dass der Fehler nicht bereits gegen das Paket eingereicht wurde. Jedes Paket hat eine Fehlerliste, die einfach unter <literal>http://&bugs-host;/<replaceable>Paketname</replaceable></literal> einsehbar ist. Hilfswerkzeuge wie <citerefentry> <refentrytitle>querybts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> können Sie ebenfalls mit diesen Informationen versorgen (und <command>reportbug</command> wird normalerweise auch vor dem Versenden <command>querybts</command> aufrufen).
fr: Assurez-vous que le bogue n'a pas déjà été signalé. Chaque paquet dispose d'une liste de bogues facilement accessible à <literal>http://&bugs-host;/<replaceable>nomdupaquet</replaceable></literal>. Des outils comme <citerefentry> <refentrytitle>querybts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> peuvent également vous fournir ces informations (et <command>reportbug</command> invoquera également normalement <command>querybts</command> avant l'envoi).
ja: パッケージに対して既にバグが報告されていないことを確認しておいてください。個々のパッケージに対するバグのリストは <literal>http://&bugs-host;/<replaceable>パッケージ名</replaceable></literal> にて簡単に確認できます。<citerefentry> <refentrytitle>querybts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> のようなユーティリティでもこの情報を入手できます (なお、<command>reportbug</command> では大抵の場合、バグを送信する前に <command>querybts</command> の実行も行っています)。

source: Try to direct your bugs to the proper location. When for example your bug is about a package which overwrites files from another package, check the bug lists for <emphasis>both</emphasis> of those packages in order to avoid filing duplicate bug reports.
de: Versuchen Sie, Ihre Fehlerberichte an die ordnungsgemäße Stelle zu lenken. Wenn Ihr Fehlerbericht zum Beispiel von einem Paket handelt, das Dateien eines anderen Pakets überschreibt, prüfen Sie die Fehlerliste <emphasis>beider</emphasis> Pakete, um das Einreichen doppelter Fehlerberichte zu vermeiden.
fr: Essayez d'envoyer vos bogues au bon endroit. Quand, par exemple, votre bogue concerne un paquet qui écrase des fichiers d'un autre paquet, vérifiez les listes des bogues pour les <emphasis>deux</emphasis> paquets afin d'éviter de créer des rapports de bogues dupliqués.
ja: 正しい所にバグを報告する様に心がけてください。例えばあるパッケージが他のパッケージのファイルを上書きしてしまうバグの場合ですが、バグ報告が重複して登録されるのを避けるため、これらのパッケージの<emphasis>両方</emphasis>のバグリストを確認してください。

source: For extra credit, you can go through other packages, merging bugs which are reported more than once, or tagging bugs `fixed' when they have already been fixed. Note that when you are neither the bug submitter nor the package maintainer, you should not actually close the bug (unless you secure permission from the maintainer).
de: Um zusätzliche Anerkennung zu erhalten, vereinigen Sie Fehler, die mehr als einmal berichtet wurden oder kennzeichnen Sie Fehler als »fixed«, die bereits behoben wurden. Beachten Sie, dass wenn Sie weder der Absender des Fehlers noch der Betreuer des Pakets sind, den Fehlerbericht nicht tatsächlich schließen sollten (es sei denn, Sie versichern sich der Erlaubnis des Betreuers).
fr: Vous pouvez également parcourir les bogues d'autres paquets, en les regroupant s'ils sont indiqués plus d'une fois, ou en les marquant avec « <literal>fixed</literal> » quand ils ont déjà été corrigés. Notez cependant que si vous n'êtes ni le rapporteur du bogue, ni le responsable du paquet, vous ne devriez pas fermer réellement le bogue (à moins d'avoir obtenu la permission du responsable).
ja: さらに言うと、他のパッケージについても、何度も報告されているバグをマージしたり既に修正されているバグに「fixed」タグをつけたりすることもできます。そのバグの報告者であったりパッケージメンテナではない場合は (メンテナから許可をもらっていなければ)、実際にバグをクローズしてはいけないことに注意してください。

source: From time to time you may want to check what has been going on with the bug reports that you submitted. Take this opportunity to close those that you can't reproduce anymore. To find out all the bugs you submitted, you just have to visit <literal>http://&bugs-host;/from:<replaceable>your-email-addr</replaceable></literal>.
de: Von Zeit zu Zeit möchten Sie vielleicht prüfen, was aus den Fehlerberichten wurde, die Sie versandt haben. Nutzen Sie diese Gelegenheit, um diejenigen zu schließen, die Sie nicht mehr reproduzieren können. Um herauszufinden, welche Fehlerberichte Sie versandt haben, besuchen Sie <literal>http://&bugs-host;/from:<replaceable>Ihre-E-Mail-Adresse</replaceable></literal>.
fr: De temps en temps, vous pourriez vouloir vérifier ce qui s'est passé à propos des bogues que vous avez signalés. Saisissez cette occasion pour fermer les bogues que vous ne pouvez plus reproduire. Pour trouver tous les bogues que vous avez signalés, vous avez simplement besoin de vous rendre à la page <literal>http://&bugs-host;/from:<replaceable>votre-adresse-de-courrier</replaceable></literal>.
ja: 時折、あなたが登録したバグ報告について何が起こっているのかをチェックしたくなることでしょう。これは、もう再現できないものをクローズするきっかけになります。報告した全てのバグ報告を確認するには、<literal>http://&bugs-host;/from:<replaceable>your-email-addr</replaceable></literal> を参照すればいいだけです。

source: Reporting lots of bugs at once (mass bug filing)
de: Viele Fehler auf einmal berichten (Masseneinreichung von Fehlern)
fr: Signalement d'un grand nombre de bogues en une fois (« <literal>mass bug filing</literal> »)
ja: 一度に大量のバグを報告するには (mass bug filing)

source: Reporting a great number of bugs for the same problem on a great number of different packages — i.e., more than 10 — is a deprecated practice. Take all possible steps to avoid submitting bulk bugs at all. For instance, if checking for the problem can be automated, add a new check to <systemitem role="package">lintian</systemitem> so that an error or warning is emitted.
de: Das Berichten einer großen Anzahl von Fehlern für dasselbe Problem für eine große Zahl von Paketen — d.h. mehr als zehn — ist eine missbilligte Vorgehensweise. Unternehmen Sie alle nötigen Schritte, um das massenhafte Versenden von Fehlerberichten tunlichst zu vermeiden. Prüfen Sie zum Beispiel, ob das Problem automatisiert werden kann, indem Sie eine neue Prüfung zu <systemitem role="package">lintian</systemitem> hinzufügen, so dass eine Fehlermeldung oder Warnung ausgegeben wird.
fr: Signaler de nombreux bogues pour le même problème sur un grand nombre de paquets — plus de dix — est une pratique déconseillée. Prenez toutes les mesures possibles pour éviter cette situation. Si le problème peut être détecté automatiquement par exemple, ajoutez un nouveau test dans le paquet <systemitem role="package">lintian</systemitem> pour générer une erreur ou un avertissement.
ja: 大量の異なるパッケージに対して、同じ問題についての非常に多くのバグ (例えば 10 個以上) を報告するのは、推奨されていないやり方です。不要なバグ報告を避けるため、可能な限りの手続きを踏むようにしましょう。例えば、問題の確認を自動化できる場合は <systemitem role="package">lintian</systemitem> に新しくチェック項目を追加すれば、エラーや警告が明確になります。

source: If you report more than 10 bugs on the same topic at once, it is recommended that you send a message to &email-debian-devel; describing your intention before submitting the report, and mentioning the fact in the subject of your mail. This will allow other developers to verify that the bug is a real problem. In addition, it will help prevent a situation in which several maintainers start filing the same bug report simultaneously.
de: Falls Sie mehr als zehn Fehler auf einmal zum gleichen Thema berichten, wird empfohlen, dass Sie eine Nachricht an &email-debian-devel; senden, in der Sie Ihre Absicht darlegen, ehe Sie den Bericht versenden und die Tatsache im Betreff Ihrer Mail erwähnen. Dies wird anderen Entwicklern ermöglichen zu prüfen, ob der Fehler ein echtes Problem darstellt. Zusätzlich wird es helfen eine Situation zu vermeiden, in der mehrere Betreuer simultan beginnen, den gleichen Fehlerbericht einzureichen.
fr: Si vous voulez signaler plus de dix rapports sur le même sujet, il est préférable d'indiquer votre intention sur la liste &email-debian-devel; et de le mentionner dans le sujet de votre message. Cela donnera à d'autres développeurs la possibilité de vérifier que le problème existe vraiment. De plus, cela permet d'éviter que plusieurs responsables ne rédigent les mêmes rapports de bogue simultanément.
ja: 同じ問題について一度に 10 個以上のバグを報告する場合は、バグ報告を登録する前に &email-debian-devel; へ送ることをお勧めします。バグ報告を送る前に注意点を記述し、メールのサブジェクトに事実を挙げておきます。これで他の開発者がそのバグが本当に問題であるかどうかを確認できるようになります。さらに、これによって複数のメンテナが平行して同じバグ報告を登録するのを防止できるようになります。

source: Please use the programs <command>dd-list</command> and if appropriate <command>whodepends</command> (from the package <systemitem role="package">devscripts</systemitem>) to generate a list of all affected packages, and include the output in your mail to &email-debian-devel;.
de: Bitte benutzen Sie das Programm <command>dd-list</command> und falls geeignet <command>whodepends</command> (aus dem Paket <systemitem role="package">devscripts</systemitem>), um eine Liste aller betroffenen Pakete zu generieren und fügen sie die Ausgabe in Ihre Mail an &email-debian-devel; ein.
fr: Veuillez utiliser les programmes <command>dd-list</command> et si nécessaire, <command>whodepends</command> (du paquet <systemitem role="package">devscripts</systemitem>) pour générer une liste de tous les paquets concernés et incluez la sortie dans votre courrier à &email-debian-devel;.
ja: <command>dd-list</command> プログラムを利用することと、明確になっているのであれば影響を受けるパッケージのリストを (<systemitem role="package">devscripts</systemitem> パッケージの) <command>whodepends</command> を使って出力して、&email-debian-devel; へのメールに含めて下さい。

source: Note that when sending lots of bugs on the same subject, you should send the bug report to <email>maintonly@&bugs-host;</email> so that the bug report is not forwarded to the bug distribution mailing list.
de: Beachten Sie, wenn Sie viele Fehlerberichte mit dem gleichen Betreff senden möchten, dass Sie den Fehlerbericht an <email>maintonly@&bugs-host;</email> senden sollten, so dass der Fehlerbericht nicht an die Fehlerverteilungs-Maillingliste weitergeleitet wird.
fr: Quand vous envoyez un grand nombre de rapports sur le même sujet, vous devriez les envoyer à <email>maintonly@&bugs-host;</email> pour éviter qu'ils soient renvoyés vers les listes de diffusion.
ja: 同じサブジェクトで大量のバグを送信する際は、バグ報告がバグ情報用メーリングリストへ転送されないように <email>maintonly@&bugs-host;</email> へバグ報告を送るべきであるの注意してください。

source: Usertags
de: Benutzerkennzeichen
fr: Étiquettes d'utilisateur « <literal>Usertags</literal> »
ja: Usertag

source: You may wish to use BTS usertags when submitting bugs across a number of packages. Usertags are similar to normal tags such as 'patch' and 'wishlist' but differ in that they are user-defined and occupy a namespace that is unique to a particular user. This allows multiple sets of developers to 'usertag' the same bug in different ways without conflicting.
de: Vielleicht möchten Sie BTS-Benutzerkennzeichen benutzen, wenn Sie Fehlerberichte über eine größere Anzahl Pakete senden. Benutzerkennzeichen sind normalen Kennzeichen wie »patch« oder »wishlist« ähnlich, unterscheiden sich aber darin, dass sie benutzerdefiniert sind und einen Namensraum belegen, der einzigartig für einen bestimmten Benutzer ist. Dies ermöglicht mehreren Gruppierungen von Entwicklern, den gleichen Fehler benutzerdefiniert auf unterschiedliche Arten zu kennzeichnen ohne Konflikte zu verursachen.
fr: Vous pouvez utiliser les étiquettes d'utilisateur du BTS lors du signalement de bogues sur un grand nombre de paquets. Les étiquettes d'utilisateur se comportent de la même façon que les étiquettes « <literal>patch</literal> » et « <literal>wishlist</literal> » à la différence qu'elles sont définies par l'utilisateur et occupent un espace de définition spécifique propre à l'utilisateur. Cela permet à plusieurs groupes de développeurs de marquer « <literal>Usertags</literal> » le même bogue de différentes façons sans conflit.
ja: 多数のパッケージに対するバグを登録する際に BTS の usertag を使いたくなるかもしれません。usertag は 'patch' や 'wishlist' のような通常のタグに似ていますが、ユーザが定義する事と特定のユーザに対して一意な名前空間を占めるという点で違っています。これによって、同じバグについて衝突する事無しに、開発者がそれぞれ別のやり方で複数の設定ができるようになります。

source: To add usertags when filing bugs, specify the <literal>User</literal> and <literal>Usertags</literal> pseudo-headers:
de: Um beim Einreichen von Fehlerberichten Benutzerkennzeichen hinzuzufügen, geben Sie die Pseudokopfzeilen <literal>User</literal> und <literal>Usertags</literal> an:
fr: Pour ajouter des étiquettes d'utilisateur lors du signalement de bogues, précisez les pseudo-en-têtes <literal>User</literal> et <literal>Usertags</literal> :
ja: バグを登録する際に usertag を追加するには、擬似ヘッダ (pseudo-header) <literal>User</literal> と <literal>Usertags</literal> を指定します。

source: To: submit@bugs.debian.org Subject: <replaceable>title-of-bug</replaceable> Package: <replaceable>pkgname</replaceable> <replaceable>[ ... ]</replaceable> User: <replaceable>email-addr</replaceable> Usertags: <replaceable>tag-name [ tag-name ... ]</replaceable> <replaceable>description-of-bug ...</replaceable>
de: To: submit@bugs.debian.org Subject: <replaceable>Titel des Fehlerberichts</replaceable> Package: <replaceable>Paketname</replaceable> <replaceable>[ ... ]</replaceable> User: <replaceable>E-Mail-Adresse</replaceable> Usertags: <replaceable>Kennzeichen [ Kennzeichen ... ]</replaceable> <replaceable>Beschreibung des Fehlers ...</replaceable>
fr: To: submit@bugs.debian.org Subject: <replaceable>titre-du-bogue</replaceable> Package: <replaceable>nom-de-paquet</replaceable> <replaceable>[ ... ]</replaceable> User: <replaceable>adresse-mail</replaceable> Usertags: <replaceable>nom-d-etiquette [ nom-d-etiquette ... ]</replaceable> <replaceable>description-du-bogue ...</replaceable>
ja: To: submit@bugs.debian.org Subject: <replaceable>バグタイトル</replaceable> Package: <replaceable>パッケージ名</replaceable> <replaceable>[ ... ]</replaceable> User: <replaceable>メールアドレス</replaceable> Usertags: <replaceable>タグ名 [ タグ名 ... ]</replaceable> <replaceable>バグの説明 ...</replaceable>

source: Note that tags are seperated by spaces and cannot contain underscores. If you are filing bugs for a particular group or team it is recommended that you set the <literal>User</literal> to an appropriate mailing list after describing your intention there.
de: Beachten Sie, dass Kennzeichnungen durch Leerzeichen getrennt werden und keine Unterstriche enthalten dürfen. Falls Sie Fehlerberichte für eine spezielle Gruppe oder ein Team einreichen, wird empfohlen, dass Sie <literal>User</literal> auf eine angemessene Mailingliste setzen, nachdem Sie Ihre Absicht dort geschildert haben.
fr: Remarquez que les étiquettes sont séparées par des espaces et ne peuvent contenir de tiret bas. Si vous signalez des bogues au nom d'un groupe ou d'une équipe spécifique, il vaut mieux définir <literal>User</literal> comme une liste diffusion appropriée après y avoir décrit votre intention.
ja: タグは空白で区切られ、アンダースコア (_) を含められないことに注意してください。特定のグループやチームについてのバグを登録する場合は、適切なメーリングリストで注意を促した上で <literal>User</literal> をそのメーリングリストに設定するのをお勧めします。

source: To view bugs tagged with a specific usertag, visit <literal>http://&bugs-host;/cgi-bin/pkgreport.cgi?users=<replaceable>email-addr</replaceable>&amp;tag=<replaceable>tag-name</replaceable></literal>.
de: Um Fehler mit einem bestimmten Benutzerkennzeichen anzusehen, besuchen Sie <literal>http://&bugs-host;/cgi-bin/pkgreport.cgi?users=<replaceable>E-Mail-Adresse</replaceable>&amp;tag=<replaceable>Kennzeichen</replaceable></literal>.
fr: Pour voir les bogues marqués par une étiquette d'utilisateur en particulier, rendez-vous sur la page <literal>http://&bugs-host;/cgi-bin/pkgreport.cgi?users=<replaceable>adresse-mail</replaceable>&amp;tag=<replaceable>nom-d-etiquette</replaceable></literal>.
ja: 特定の usertag でバグを参照する場合は <literal>http://&bugs-host;/cgi-bin/pkgreport.cgi?users=<replaceable>メールアドレス</replaceable>&amp;tag=<replaceable>タグ名</replaceable></literal> を指定してください。

source: Quality Assurance effort
de: Qualitätssicherungsbestreben
fr: Effort d'assurance qualité
ja: 品質維持の努力

source: Daily work
de: Tägliche Arbeit
fr: Travail quotidien
ja: 日々の作業

source: Even though there is a dedicated group of people for Quality Assurance, QA duties are not reserved solely for them. You can participate in this effort by keeping your packages as bug-free as possible, and as lintian-clean (see <xref linkend="lintian"/>) as possible. If you do not find that possible, then you should consider orphaning some of your packages (see <xref linkend="orphaning"/>). Alternatively, you may ask the help of other people in order to catch up with the backlog of bugs that you have (you can ask for help on &email-debian-qa; or &email-debian-devel;). At the same time, you can look for co-maintainers (see <xref linkend="collaborative-maint"/>).
de: Auch wenn es eine eigene Gruppe zur Qualitätssicherung gibt, sind QS-Pflichten nicht ausschließlich dieser Gruppe vorbehalten. Sie können an dieser Aufgabe teilnehmen, indem Sie Ihre Pakete so fehlerfrei und so Lintian-rein (siehe <xref linkend="lintian"/>) wie möglich halten. Falls Sie finden, dies sei unmöglich, dann sollten Sie darüber nachdenken, einige Ihrer Pakete zu verwaisen (siehe <xref linkend="orphaning"/>). Alternativ könnten Sie andere Leute um Hilfe bitten, um den Rückstand, den Sie bei den Fehlern haben, aufzuholen (Sie können auf &email-debian-qa; oder &email-debian-devel; nach Hilfe fragen). Gleichzeitig können Sie sich nach Mitbetreuern umsehen (siehe <xref linkend="collaborative-maint"/>).
fr: Bien qu'il y ait un groupe de personnes dédié à l'assurance qualité, les devoirs de <literal>QA</literal> ne leur sont pas exclusivement réservés. Vous pouvez participer à cet effort en conservant vos paquets aussi exempts de bogues que possible et aussi corrects que possible selon <command>lintian</command> (voir <xref linkend="lintian"/>). Si cela vous paraît impossible, vous devriez alors envisager d'abandonner certains de vos paquets (voir <xref linkend="orphaning"/>). Sinon, vous pouvez demander de l'aide à d'autres personnes pour qu'elles puissent rattraper votre retard dans la correction des bogues (vous pouvez demander de l'aide sur &email-debian-qa; ou &email-debian-devel;). En même temps, vous pouvez rechercher des co-responsables (voir <xref linkend="collaborative-maint"/>).
ja: 品質保証に割り当てられたグループの人々がいたとしても、QA 作業は彼らのみに課せられるものではありません。あなたもパッケージを可能な限りバグが無いように保ち、できるだけ lintian clean な状態 (<xref linkend="lintian"/> を参照) にすることで品質保証の作業に参加することができるのです。それが可能ではないように思えるなら、パッケージをいくつか「みなしご化 (orphan)」してください (<xref linkend="orphaning"/> 参照)。または、溜まったバグ処理に追いつくため、他の人々に助力を願い出ることも可能です (&email-debian-qa; や &email-debian-devel; で助けを求めることができます)。同時に共同メンテナ (co-maintainer) を探すことも可能です (<xref linkend="collaborative-maint"/> を参照してください)。

source: Bug squashing parties
fr: Chasses aux bogues
ja: バグ潰しパーティ (BSP)

source: From time to time the QA group organizes bug squashing parties to get rid of as many problems as possible. They are announced on &email-debian-devel-announce; and the announcement explains which area will be the focus of the party: usually they focus on release critical bugs but it may happen that they decide to help finish a major upgrade (like a new <command>perl</command> version which requires recompilation of all the binary modules).
de: Von Zeit zu Zeit organisiert die QS-Gruppe Bug-Squashing-Parties, um so viele Probleme wie möglich zu beseitigen. Sie werden auf &email-debian-devel-announce; angekündigt und in der Ankündigung wird erklärt, auf welchem Bereich der Fokus der Party liegt: Üblicherweise liegt der Fokus auf release-kritischen Fehlern, aber es kann vorkommen, dass entschieden wird, bei der Fertigstellung eines Haupt-Upgrades zu helfen (wie einer neuen <command>perl</command>-Version, die ein Neukompilieren aller binären Module erfordert).
fr: De temps en temps, le groupe d'assurance qualité organise des chasses aux bogues (« <literal>Bug Squashing Party</literal> ») pour essayer de résoudre autant de problèmes que possible. Elles sont annoncées sur &email-debian-devel-announce; en précisant quel domaine sera visé pendant la chasse : habituellement, il s'agit des bogues empêchant l'intégration du paquet dans la distribution (bogues de gravité « <literal>Release Critical</literal> »), mais il peut être décidé d'aider à finir une transition majeure (comme une nouvelle version de Perl qui demande la recompilation de tous les modules binaires).
ja: 時折、QA グループは可能な限りの問題を無くすためにバグ潰しパーティ (BSP) を開催しています。開催案内は &email-debian-devel-announce; で行われ、パーティがどの部分に集中して行われるのかが告知されます。大抵はリリースクリティカルバグ (RC) への対応に当てられますが、大きなアップグレード (新しい <command>perl</command> バージョンでの全バイナリモジュールを再コンパイルのような) を完了する手助けのために開かれることもあります。
