Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: If you have a problem with a certain service, not related to the system administration (such as packages to be removed from the archive, suggestions for the web site, etc.), generally you'll report a bug against a ``pseudo-package''. See <xref linkend="submit-bug"/> for information on how to submit bugs.
de: Falls Sie ein Problem mit einem bestimmten Dienst haben, der sich nicht auf die Systemadministration bezieht (wie beispielsweise Pakete, die aus dem Archiv entfernt werden sollen, Vorschläge für die Website, etc.) schreiben Sie einen Fehlerbericht zu einem »Pseudo-Paket«. Informationen darüber, wie Sie Fehlerberichte versenden, finden Sie unter <xref linkend="submit-bug"/>.
fr: Si le problème est lié à un service particulier, non relatif à l'administration système (paquet à supprimer de l'archive ou suggestion pour le site web par exemple), il faudra en général ouvrir un rapport de bogue sur un « pseudopaquet ». Consultez <xref linkend="submit-bug"/> pour connaître la procédure à suivre.
ja: システム管理に関連しない、特定のサービスについて問題がある場合 (アーカイブからパッケージを削除する、ウェブサイトの改善提案など) は、大抵の場合「擬似パッケージ」に対してバグを報告することになります。どうやってバグ報告をするかについては <xref linkend="submit-bug"/> を参照してください。

source: Some of the core servers are restricted, but the information from there is mirrored to another server.
de: Einige der Hauptserver werden eingeschränkt, aber die Informationen von dort werden auf einen anderen Server gespiegelt.
fr: Certains serveurs de base sont à accès restreint, mais les informations de ceux-ci sont fournies par d'autres serveurs miroirs.
ja: 中心となっているサーバのうち幾つかは利用が制限されていますが、そこにある情報は他のサーバへミラーされています。

source: The bugs server
de: Der Fehler-Server
fr: Serveur de suivi des bogues (<literal>BTS</literal>)
ja: バグ報告サーバ

source: <literal>&bugs-host;</literal> is the canonical location for the Bug Tracking System (BTS).
de: <literal>&bugs-host;</literal> ist der vorschriftsmäßige Ort für die Fehlerdatenbank, das BTS (Bug Tracking System).
fr: <literal>&bugs-host;</literal> est le serveur maître du système de suivi des bogues (« <literal>Bug Tracking System</literal> » ou <literal>BTS</literal>).
ja: <literal>&bugs-host;</literal> がバグ報告システム (BTS) の中心となっています。

source: If you plan on doing some statistical analysis or processing of Debian bugs, this would be the place to do it. Please describe your plans on &email-debian-devel; before implementing anything, however, to reduce unnecessary duplication of effort or wasted processing time.
de: Falls Sie statistische Auswertungen oder Verarbeitungen von Debian-Fehlern planen, wäre dies der richtige Ort dafür. Bitte schildern Sie indes Ihre Pläne auf &email-debian-devel; bevor Sie etwas implementieren, um unnötige Doppelarbeit oder vergeudete Ausführungszeit zu vermeiden.
fr: Si vous envisagez de manipuler les bogues ou d'en faire une analyse statistique, ce sera le bon endroit pour le faire. Informez la liste &email-debian-devel; de votre intention avant d'implémenter quoi que ce soit afin d'éviter un travail en double ou un gaspillage de temps machine.
ja: Debian のバグについて定量的な分析や処理をするような計画がある場合、ここで行ってください。ですが、不要な作業の重複や処理時間の浪費を減らすため、何であれ実装する前に &email-debian-devel; であなたの計画を説明してください。

source: The ftp-master server
de: Der FTP-Master-Server
fr: Serveur FTP principal <literal>ftp-master</literal>
ja: ftp-master サーバ

source: The <literal>&ftp-master-host;</literal> server holds the canonical copy of the Debian archive. Generally, package uploaded to &ftp-upload-host; end up on this server, see <xref linkend="upload"/>.
de: Auf dem Server <literal>&ftp-master-host;</literal> liegt die vorschriftsmäßige Kopie des Debian-Archivs. Generell landen auf &ftp-upload-host; hochgeladene Pakete auf diesem Server, siehe <xref linkend="upload"/>.
fr: Le serveur <literal>&ftp-master-host;</literal> est le serveur maître de l'archive Debian. En général, les paquets envoyés à &ftp-upload-host; aboutissent sur ce serveur, voir <xref linkend="upload"/>.
ja: <literal>&ftp-master-host;</literal> サーバは、Debian アーカイブのコピーの中心位置を占めています。通常、&ftp-upload-host; へアップロードされたパッケージは最終的にはこのサーバにあります。<xref linkend="upload"/> を参照してください。

source: It is restricted; a mirror is available on <literal>&ftp-master-mirror;</literal>.
de: Dieser Server ist eingeschränkt; ein Spiegel ist auf <literal>&ftp-master-mirror;</literal> verfügbar.
fr: Ce serveur est à accès restreint ; un miroir est disponible sur <literal>&ftp-master-mirror;</literal>.
ja: このサーバの利用は制限されています。ミラーが <literal>&ftp-master-mirror;</literal> 上で利用可能です。

source: Problems with the Debian FTP archive generally need to be reported as bugs against the <systemitem role="package">&ftp-debian-org;</systemitem> pseudo-package or an email to &email-ftpmaster;, but also see the procedures in <xref linkend="archive-manip"/>.
de: Probleme mit dem Debian-Archiv müssen generell als Fehler des Pseudo-Pakets <systemitem role="package">&ftp-debian-org;</systemitem> oder per E-Mail an &email-ftpmaster; gemeldet werden, aber sehen Sie sich auch die Vorgehensweisen in <xref linkend="archive-manip"/> an.
fr: Les problèmes avec l'archive Debian FTP doivent généralement être rapportés comme bogues sur le pseudopaquet <systemitem role="package">&ftp-debian-org;</systemitem> ou par courrier électronique à &email-ftpmaster; ; voir <xref linkend="archive-manip"/> pour connaître la procédure à suivre.
ja: Debian FTP アーカイブについて問題がある場合、通常 <systemitem role="package">&ftp-debian-org;</systemitem> 擬似パッケージに対するバグ報告を行うか、&email-ftpmaster; へメールをする必要がありますが、<xref linkend="archive-manip"/>にある手順も参照してください。

source: The www-master server
de: Der WWW-Master-Server
fr: Serveur web principal <literal>www-master</literal>
ja: www-master サーバ

source: The main web server is <literal>www-master.debian.org</literal>. It holds the official web pages, the face of Debian for most newbies.
de: Der Haupt-Webserver ist <literal>www-master.debian.org</literal>. Auf ihm liegen die offiziellen Web-Seiten, für die meisten Neulinge »das Gesicht von Debian«.
fr: Le serveur web principal est <literal>www-master.debian.org</literal>. Il héberge les pages web officielles, la façade de Debian pour la plupart des débutants.
ja: メインの web サーバが <literal>www-master.debian.org</literal> です。公式 web ページを持ち、新たな参加者に対する Debian の顔となっています。

source: If you find a problem with the Debian web server, you should generally submit a bug against the pseudo-package, <systemitem role="package">www.debian.org</systemitem>. Remember to check whether or not someone else has already reported the problem to the <ulink url="http://&bugs-host;/&www-debian-org;">Bug Tracking System</ulink>.
de: Falls Sie ein Problem mit dem Debian-Webserver finden, sollten Sie generell einene Fehlerbericht an das Pseudo-Paket <systemitem role="package">www.debian.org</systemitem> senden. Denken Sie daran zu prüfen, ob bereits sonst jemand dieses Problem an die <ulink url="http://&bugs-host;/&www-debian-org;">Fehlerdatenbank</ulink> gemeldet hat.
fr: Si vous rencontrez un problème avec un serveur web Debian, vous devriez envoyer un rapport de bogue sur le pseudopaquet <systemitem role="package">www.debian.org</systemitem>. Vérifiez d'abord sur le <ulink url="http://&bugs-host;/&www-debian-org;">système de suivi des bogues</ulink> que le problème n'a pas déjà été signalé.
ja: Debian のウェブサーバについて問題を見つけた場合、大抵の場合は擬似パッケージ <systemitem role="package">www.debian.org</systemitem> に対してバグを報告する必要があります。誰か他の人が既に<ulink url="http://&bugs-host;/&www-debian-org;">バグ追跡システム</ulink>に問題を報告していないかどうかチェックするのを忘れないようにしてください。

source: The people web server
de: Der Personen-Webserver
fr: Serveur web pour pages personnelles <literal>people</literal>
ja: people ウェブサーバ

source: <literal>people.debian.org</literal> is the server used for developers' own web pages about anything related to Debian.
de: <literal>people.debian.org</literal> ist der Server, der für die eigenen Web-Seiten der Entwickler über alles Mögliche mit Bezug zu Debian benutzt wird.
fr: <literal>people.debian.org</literal> est le serveur utilisé par les développeurs pour leurs pages concernant Debian.
ja: <literal>people.debian.org</literal> は、開発者個人の何か Debian に関連するウェブページのために使われているサーバです。

source: If you have some Debian-specific information which you want to serve on the web, you can do this by putting material in the <filename>public_html</filename> directory under your home directory on <literal>people.debian.org</literal>. This will be accessible at the URL <literal>http://people.debian.org/~<replaceable>your-user-id</replaceable>/</literal>.
de: Falls Sie einige Debian-spezifischen Informationen haben, die Sie im Web bereitstellen möchten, können Sie dies realisieren, indem Sie das Material im Verzeichnis <filename>public_html</filename> in Ihrem Home-Verzeichnis auf <literal>people.debian.org</literal> ablegen. Es kann über die URL <literal>http://people.debian.org/~<replaceable>Ihre-Benutzer-ID</replaceable>/</literal> darauf zugegriffen werden.
fr: Si vous avez des informations spécifiques à Debian que vous voulez rendre disponibles sur le web, vous pouvez le faire en les plaçant dans le répertoire <filename>public_html</filename> de votre répertoire personnel sur <literal>people.debian.org</literal>. Elles seront accessibles à l'adresse <literal>http://people.debian.org/~<replaceable>votre-identifiant</replaceable>/</literal>.
ja: ウェブに置きたい何か Debian 特有の情報を持っている場合、<literal>people.debian.org</literal> 上のホームディレクトリの <filename>public_html</filename> 以下にデータを置くことでこれが可能となっています。これには <literal>http://people.debian.org/~<replaceable>your-user-id</replaceable>/</literal> という URL でアクセス可能です。

source: You should only use this particular location because it will be backed up, whereas on other hosts it won't.
de: Sie sollten nur diesen besonderen Ort benutzen, da Datensicherungen davon erstellt werden, was auf anderen Rechnern nicht der Fall wäre.
fr: Vous ne devriez utiliser que cet emplacement particulier car il sera sauvegardé alors que sur les autres serveurs, ce ne sera pas le cas.
ja: 他のホストではバックアップされないのに対して、ここではバックアップされるので、これを使うのは特定の位置づけのものだけにするべきです。

source: Usually the only reason to use a different host is when you need to publish materials subject to the U.S. export restrictions, in which case you can use one of the other servers located outside the United States.
de: Der einzige Grund andere Rechner zu benutzen, ist üblicherweise, wenn Sie Materialien veröffentlichen möchten, die den U.S.-Exportbeschränkungen unterliegen. In diesem Fall können Sie Server benutzen, die sich außerhalb der Vereinigten Staaten befinden.
fr: Normalement, la seule raison d'utiliser un serveur différent est pour publier des informations soumises aux restrictions d'exportation américaines. Dans ce cas, vous pouvez utiliser un autre serveur situé en dehors des États-Unis.
ja: 大抵の場合、他のホストを使う唯一の理由はアメリカの輸出制限に抵触する素材を公開する必要がある時です。その様な場合はアメリカ国外に位置する他のサーバのどれかを使えます。

source: Send mail to &email-debian-devel; if you have any questions.
de: Senden Sie eine E-Mail an &email-debian-devel;, falls Sie Fragen haben.
fr: Veuillez envoyer toute question à &email-debian-devel;.
ja: 何か質問がある場合は、&email-debian-devel; にメールして下さい。

source: The VCS servers
de: Die VCS-Server
fr: Serveurs de gestion de versions (<literal>VCS</literal>)
ja: VCS (バージョン管理システム) サーバ

source: If you need to use a Version Control System for any of your Debian work, you can use one of the existing repositories hosted on Alioth or you can request a new project and ask for the VCS repository of your choice. Alioth supports CVS (cvs.alioth.debian.org/cvs.debian.org), Subversion (svn.debian.org), Arch (tla/baz, both on arch.debian.org), Bazaar (bzr.debian.org), Darcs (darcs.debian.org), Mercurial (hg.debian.org) and Git (git.debian.org). Checkout <ulink url="&url-alioth-pkg;" /> if you plan to maintain packages in a VCS repository. See <xref linkend="alioth"/> for information on the services provided by Alioth.
de: Falls Sie ein Versionskontrollsystem für Ihre Arbeit an Debian benutzen möchten, können Sie eines der existierenden auf Alioth gehosteten Depots benutzen oder Sie können ein neues Projekt mit einem VCS-Depot Ihrer Wahl beantragen. Alioth unterstützt CVS (cvs.alioth.debian.org/cvs.debian.org), Subversion (svn.debian.org), Arch (tla/baz, beide auf arch.debian.org), Bazaar (bzr.debian.org), Darcs (darcs.debian.org), Mercurial (hg.debian.org) und Git (git.debian.org). Checken Sie <ulink url="&url-alioth-pkg;" /> aus, wenn Sie planen, die Pakete in einem VCS-Depot zu verwalten. Weitere Informationen über die von Alioth bereitgestellten Dienste finden Sie unter <xref linkend="alioth"/>.
fr: Si vous avez besoin d'une gestion de versions (« <literal>Version Control System</literal> » ou <literal>VCS</literal>) pour tout travail relatif à Debian, vous pouvez utiliser un des dépôts existants hébergés sur Alioth ou demander un nouveau projet avec le système de gestion de versions de votre choix. Alioth gère <literal>CVS</literal> (cvs.alioth.debian.org/cvs.debian.org), <literal>Subversion</literal> (svn.debian.org), <literal>Arch</literal> (tla/baz, tout deux sur arch.debian.org), <literal>Bazaar</literal> (bzr.debian.org), <literal>Darcs</literal> (darcs.debian.org), <literal>Mercurial</literal> (hg.debian.org) et <literal>Git</literal> (git.debian.org). Consultez <ulink url="&url-alioth-pkg;" /> si vous avez l'intention de maintenir un paquet à l'aide d'un logiciel de gestion de versions. Voir <xref linkend="alioth"/> pour plus d'informations sur les services fournis par Alioth.
ja: あなたが行っている Debian に関連する作業にバージョン管理システムが必要であれば、Alioth にホストされている既存のリポジトリを使うことも新しいプロジェクトを作って、それにあなたが選んだ VCS のリポジトリを要求することも可能です。Alioth は CVS (cvs.alioth.debian.org/cvs.debian.org)、Subversion (svn.debian.org)、Arch (tla/baz、共に arch.debian.org 上)、Bazaar (bzr.debian.org)、Darcs (darcs.debian.org)、Mercurial (hg.debian.org) そして Git (git.debian.org)をサポートしています。パッケージを VCS リポジトリ上でメンテナンスする予定であれば、Alioth で提供されているサービスについての詳細は <xref linkend="alioth"/> を参照してください。

source: chroots to different distributions
de: Chroots auf andere Distributionen
fr: Chroots de différentes distributions
ja: 複数のディストリビューション利用のために chroot を使う

source: On some machines, there are chroots to different distributions available. You can use them like this:
de: Auf einigen Maschinen sind Chroots auf unterschiedliche Distributionen verfügbar. Sie können sie wie folgt nutzen:
fr: Sur certaines machines, des chroots de différentes distributions sont disponibles. Vous pouvez les utiliser comme ceci :
ja: 幾つかのマシン上では、異なったディストリビューション用の chroot が利用可能です。以下の様にして使うことが出来ます：

source: vore$ dchroot unstable Executing shell in chroot: /org/vore.debian.org/chroots/user/unstable
de: vore$ dchroot unstable Shell in Chroot ausführen: /org/vore.debian.org/chroots/user/unstable
fr: vore$ dchroot unstable Exécution de l'interpréteur de commandes initial dans le chroot : /org/vore.debian.org/chroots/user/unstable

source: In all chroots, the normal user home directories are available. You can find out which chroots are available via <ulink url="&url-devel-machines;"></ulink>.
de: In allen Chroots sind die normalen Home-Verzeichnisse der Benutzer verfügbar. Sie können mittels <ulink url="&url-devel-machines;"></ulink> herausfinden, welche Chroots verfügbar sind.
fr: Dans chaque chroot, les répertoires normaux des utilisateurs sont disponibles. Vous pouvez trouver quels chroots sont disponibles sur <ulink url="&url-devel-machines;"></ulink>.
ja: 全ての chroot 環境内で、一般ユーザの home ディレクトリが利用可能になっています。どの chroot が利用可能かについては <ulink url="&url-devel-machines;">&url-devel-machines;</ulink> にて確認ができます。

source: The Developers Database
de: Die Entwicklerdatenbank
fr: Base de données des développeurs
ja: 開発者データベース

source: The Developers Database, at <ulink url="&url-debian-db;"></ulink>, is an LDAP directory for managing Debian developer attributes. You can use this resource to search the list of Debian developers. Part of this information is also available through the finger service on Debian servers, try <command>finger yourlogin@db.debian.org</command> to see what it reports.
de: Die Entwicklerdatenbank unter <ulink url="&url-debian-db;"></ulink> ist ein LDAP-Verzeichnis zur Verwaltung von Debian-Entwicklereigenschaften. Sie können diese Ressource benutzen, um eine Liste der Debian-Entwickler zu durchsuchen. Ein Teil dieser Informationen ist auch durch den Dienst »finger« auf Debian-Servern verfügbar. Versuchen Sie <command>finger ihr-benutzername@db.debian.org</command>, um zu sehen, was er berichtet.
fr: La base de données des développeurs, sur <ulink url="&url-debian-db;"></ulink>, est un annuaire LDAP regroupant des informations sur les développeurs Debian. Vous pouvez utiliser cette ressource pour rechercher la liste des développeurs Debian. Une partie de ces informations est également disponible avec <literal>finger</literal> sur les serveurs Debian, essayez <command>finger votreidentifiant@db.debian.org</command> pour voir ce qu'il indique.
ja: <ulink url="&url-debian-db;"></ulink> にある開発者データベースは、Debian 開発者のアトリビュートを操作する LDAP ディレクトリです。このリソースはDebian 開発者リストの検索に使えます。この情報の一部は Debian サーバの finger サービスを通じても利用可能になっています。<command>finger yourlogin@db.debian.org</command> として何が返ってくるかを確認してみてください。

source: Developers can <ulink url="&url-debian-db-login;">log into the database</ulink> to change various information about themselves, such as:
de: Entwickler können sich <ulink url="&url-debian-db-login;">in der Datenbank anmelden</ulink>, um verschiedene Informationen über sich selbst zu ändern, wie beispielsweise:
fr: Les développeurs peuvent <ulink url="&url-debian-db-login;">se connecter à la base de données</ulink> pour modifier différentes informations les concernant, comme :
ja: 開発者らは、以下に挙げるような自身に関する様々な情報を変更するために<ulink url="&url-debian-db-login;">データベースにログイン</ulink>ができます。

source: forwarding address for your debian.org email
de: die Weiterleitungsadresse für Ihre debian.org-E-Mail
fr: l'adresse de suivi pour leur adresse debian.org ;
ja: debian.org アドレス宛のメールを転送するアドレス

source: subscription to debian-private
de: die Anmeldung zu debian-private
fr: l'abonnement à debian-private ;
ja: debian-private の購読

source: whether you are on vacation
de: ob Sie in Urlaub sind
fr: l'état en vacances ou non ;
ja: 休暇中かどうか

source: personal information such as your address, country, the latitude and longitude of the place where you live for use in <ulink url="&url-worldmap;">the world map of Debian developers</ulink>, phone and fax numbers, IRC nickname and web page
de: persönliche Informationen, wie Ihre Adresse, das Land, Längen- und Breitengrad Ihres Wohnortes für die <ulink url="&url-worldmap;">Weltkarte der Entwickler</ulink>, Telefon- und Faxnummern, IRC-Nickname und Homepage
fr: des informations personnelles comme les adresse, pays, latitude et longitude de l'endroit où ils vivent pour utilisation dans la <ulink url="&url-worldmap;">carte mondiale des développeurs Debian</ulink>, numéros de téléphone et de fax, surnom IRC et page web ;
ja: 住所、国名、<ulink url="&url-worldmap;">Debian 開発者世界地図</ulink>で使われている住んでいる地域の緯度経度、電話・ファックス番号、IRC でのニックネーム、そしてウェブページのアドレスなどの個人情報

source: password and preferred shell on Debian Project machines
de: Passwort und bevorzugte Shell auf Maschinen des Debian-Projekts
fr: le mot de passe et le shell préféré sur les machines du projet Debian.
ja: Debian プロジェクトのマシン上でのパスワードと優先的に指定するシェル

source: Most of the information is not accessible to the public, naturally. For more information please read the online documentation that you can find at <ulink url="&url-debian-db-doc;"></ulink>.
de: Natürlich kann auf die meisten der Informationen nicht durch die Öffentlichkeit zugegriffen werden. Lesen Sie für weitere Informationen die Dokumentation unter <ulink url="&url-debian-db-doc;"></ulink>.
fr: La plupart des informations ne sont naturellement pas publiques. Pour plus d'informations, veuillez lire la documentation en ligne sur <ulink url="&url-debian-db-doc;"></ulink>.
ja: 当然ですが、ほとんどの情報は外部からはアクセス可能にはなっていません。より詳細な情報については、<ulink url="&url-debian-db-doc;"></ulink> で参照できるオンラインドキュメントを読んでください。

source: Developers can also submit their SSH keys to be used for authorization on the official Debian machines, and even add new *.debian.net DNS entries. Those features are documented at <ulink url="&url-debian-db-mail-gw;"></ulink>.
de: Entwickler können auch ihre SSH-Schlüssel senden, die für die Authentifizierung auf den offiziellen Debian-Maschinen benutzt werden und sogar neue *.debian.net-DNS-Einträge hinzufügen. Diese Funktionen sind unter <ulink url="&url-debian-db-mail-gw;"></ulink> dokumentiert.
fr: Les développeurs peuvent également envoyer leurs clés SSH afin de les utiliser pour authentification sur les machines Debian officielles, et même ajouter de nouvelles entrées DNS du type *.debian.net. Ces fonctionnalités sont documentées sur <ulink url="&url-debian-db-mail-gw;"></ulink>.
ja: 開発者は公式 Debian マシンへの認証に使われる SSH 鍵を登録することもできますし、新たな *.debian.net の DNS エントリの追加すら可能です。これらの機能は <ulink url="&url-debian-db-mail-gw;"></ulink> に記述されています。

source: The Debian archive
de: Das Debian-Archiv
fr: Archive Debian
ja: Debian アーカイブ

source: The &debian-formal; distribution consists of a lot of packages (currently around &number-of-pkgs; source packages) and a few additional files (such as documentation and installation disk images).
de: Die Distribution &debian-formal; besteht aus vielen Paketen (aktuell rund &number-of-pkgs; Quellpakete) und ein paar zusätzlichen Dateien (wie beispielsweise Dokumentation und Images von Installationsmedien).
fr: La distribution &debian-formal; est composée d'un grand nombre de paquets (environ &number-of-pkgs;) et de quelques autres fichiers (comme la documentation et les images de disque d'installation).
ja: &debian-formal; ディストリビューションは大量のパッケージ (現在約 &number-of-pkgs; 個) と幾つかの追加ファイル (ドキュメントやインストール用ディスクイメージなど) から成り立っています。

source: Here is an example directory tree of a complete Debian archive:
de: Hier ist ein Beispielverzeichnisbaum eines kompletten Debian-Archivs:
fr: Voici un exemple d'arborescence pour une archive Debian complète :
ja: 以下が完全な Debian アーカイブのディレクトリツリーの例です：
