Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: Be sure to follow the <ulink url="&url-debian-policy;ch-docs.html">Policy on documentation</ulink>.
de: Achten Sie darauf, dass Sie den <ulink url="&url-debian-policy;ch-docs.html">Richtlinien für Dokumentation</ulink> folgen.
fr: Veuillez vous assurer que vous suivez la <ulink url="&url-debian-policy;ch-docs.html">Charte de documentation</ulink>.
ja: <ulink url="&url-debian-policy;ch-docs.html">ドキュメント化のポリシー</ulink>に忘れず従ってください。

source: If your package contains documentation built from XML or SGML, we recommend you not ship the XML or SGML source in the binary package(s). If users want the source of the documentation, they should retrieve the source package.
de: Falls Ihr Paket Dokumentation enthält, die aus XML oder SGML erstellt wurde, wird empfohlen, nicht die XML- oder SGML-Quellen im (in den) Binärpaket(en) mitzuliefern. Falls Anwender die Quelle der Dokumentation möchten, sollten sie die Paketquelle abrufen.
fr: Si votre paquet contient de la documentation construite à partir de fichiers XML ou SGML, il est recommandé de ne pas fournir ces fichiers source dans les paquets binaires. Les utilisateurs qui souhaiteraient disposer des sources de la documentation peuvent alors récupérer le paquet source.
ja: あなたのパッケージが XML や SGML から生成されるドキュメントを含んでいる場合、XML や SGML のソースをバイナリパッケージに含めてリリースしないことをお勧めします。ユーザがドキュメントのソースを欲しい場合には、ソースパッケージを引っ張ってくれば良いのです。

source: Policy specifies that documentation should be shipped in HTML format. We also recommend shipping documentation in PDF and plain text format if convenient and if output of reasonable quality is possible. However, it is generally not appropriate to ship plain text versions of documentation whose source format is HTML.
de: Die Richtlinie gibt an, dass die Dokumentation im HTML-Format weitergegeben werden sollte. Außerdem wird empfohlen, die Dokumentation im PDF-Format und als Klartext mitzuliefern, falls geeignet und falls die Ausgabe in einer vernünftigen Qualität möglich ist. Es ist allgemein jedoch nicht angemessen, Klartextversionen von Dokumentationen mitzuliefern, deren Quellformat HTML ist.
fr: La Charte indique que la documentation devrait être fournie en format HTML. Il est recommandé de la fournir également dans les formats PDF et texte si cela est pratique et si un affichage de qualité raisonnable est possible. Cependant, il est le plus souvent inapproprié de fournir en format texte simple des versions de documentations dont le format source est HTML.
ja: ポリシーではドキュメントは HTML 形式でリリースされるべきであると定めています。我々は、もし手がかからないで問題ない品質の出力が可能であれば、ドキュメントを PDF 形式とテキスト形式でもリリースすることをお勧めしています。ですが、ソースの形式が HTML のドキュメントを普通のテキスト版でリリースするのは、大抵の場合は適切ではありません。

source: Major shipped manuals should register themselves with <systemitem role="package">doc-base</systemitem> on installation. See the <systemitem role="package">doc-base</systemitem> package documentation for more information.
de: Bedeutende mitgelieferte Handbücher sollten sich selbst bei der Installation mit <systemitem role="package">doc-base</systemitem> registrieren. Weitere Einzelheiten erhalten Sie in der Dokumentation des Pakets <systemitem role="package">doc-base</systemitem>.
fr: Les manuels les plus importants qui sont fournis devraient être enregistrés avec <systemitem role="package">doc-base</systemitem> lors de leur installation. Veuillez consulter la documentation du paquet <systemitem role="package">doc-base</systemitem> pour plus d'informations.
ja: リリースされたメジャーなマニュアルは、インストール時に<systemitem role="package">doc-base</systemitem>で登録されるべきです。詳細については、<systemitem role="package">doc-base</systemitem> パッケージのドキュメントを参照してください。

source: Debian policy (section 12.1) directs that manual pages should accompany every program, utility, and function, and suggests them for other objects like configuration files. If the work you are packaging does not have such manual pages, consider writing them for inclusion in your package, and submitting them upstream.
de: Die Debian-Richtlinien (Abschnitt 12.1) schreiben vor, dass Handbuchseiten jedes Programm, jedes Hilfswerkzeug und jede Funktion begleiten sollten und für andere Objekte, wie Konfigurationsdateien, nahegelegt werden. Falls die von Ihnen paketierte Arbeit nicht über eine solche Handbuchseite verfügt, dann überlegen Sie sich, eine zu schreiben, die Ihrem Paket beigefügt und an die Originalautoren gesandt wird.
fr: La Charte Debian (section 12.1) indique que des pages de manuel devraient être fournies avec chaque programme, utilitaire et fonction, et suggère d'en fournir pour les autres éléments comme les fichiers de configuration. Si le travail que vous empaquetez ne fournit pas de telles pages de manuel, veuillez envisager de les écrire pour les ajouter à votre paquet, et les proposer en amont.
ja: Debian ポリシー (12.1 章) では、マニュアルページはすべてのプログラム・ユーティリティ・関数に対して付属すべきであり、設定ファイルのようなその他のものについては付属を提案を示しています。もし、あなたがパッケージングをしているものがそのようなマニュアルページを持っていない場合は、パッケージに含めるために記述を行い、開発元 (upstream) へ送付することを検討してください。

source: The manpages do not need to be written directly in the troff format. Popular source formats are Docbook, POD and reST, which can be converted using <command>xsltproc</command>, <command>pod2man</command> and <command>rst2man</command> respectively. To a lesser extent, the <command>help2man</command> program can also be used to write a stub.
de: Die Handbuchseiten müssen nicht direkt im Troff-Format geschrieben werden. Beliebte Quellformate sind Docbook, POD und reST, die mit <command>xsltproc</command>, <command>pod2man</command> beziehungsweise <command>rst2man</command> umgewandelt werden können. In geringerem Maße kann außerdem das Programm <command>help2man</command> benutzt werden, um einen Abschnitt zu schreiben.
fr: Les pages de manuel n'ont pas besoin d'être écrites directement au format troff. Les formats source populaires Docbook, POD et reST peuvent être convertis en utilisant respectivement <command>xsltproc</command>, <command>pod2man</command> et <command>rst2man</command>. De moins grande ampleur, le programme <command>help2man</command> peut aussi être utilisé pour écrire une souche.
ja: manpage は直接 troff 形式で書く必要はありません。よく使われるソース形式は、Docbook、POD、reST で、それぞれ <command>xsltproc</command>、<command>pod2man</command>、<command>rst2man</command> を使うことで変換できます。少なくとも、スタブを書くために <command>help2man</command> プログラムを使うことは可能です。

source: Specific types of packages
de: Besondere Pakettypen
fr: Catégories particulières de paquets
ja: 特定の種類のパッケージ

source: Several specific types of packages have special sub-policies and corresponding packaging rules and practices:
de: Mehrere besondere Typen von Paketen haben spezielle Unterrichtlinien und zugehörige Paketierungsregeln und -Vorgehensweisen:
fr: Plusieurs catégories particulières de paquets utilisent des chartes spécifiques avec leurs règles et leurs pratiques d'empaquetage.
ja: いくつかの特定の種類のパッケージは、特別なサブポリシーと対応するパッケージ化ルールおよびプラクティスを持っています:

source: Perl related packages have a <ulink url="&url-perl-policy;">Perl policy</ulink>, some examples of packages following that policy are <systemitem role="package">libdbd-pg-perl</systemitem> (binary perl module) or <systemitem role="package">libmldbm-perl</systemitem> (arch independent perl module).
de: Perl zugehörige Pakete haben eine <ulink url="&url-perl-policy;">Perl-Richtlinie</ulink>. Einige Beispiele für Pakete, die dieser Richtlinie folgen, sind <systemitem role="package">libdbd-pg-perl</systemitem> (binäres Perl-Modul) oder <systemitem role="package">libmldbm-perl</systemitem> (architekturunabhängiges Perl-Modul).
fr: Les paquets liés à Perl utilisent une <ulink url="&url-perl-policy;">charte Perl</ulink>. Des exemples de tels paquets qui appliquent cette charte spécifique sont <systemitem role="package">libdbd-pg-perl</systemitem> (module Perl binaire) ou <systemitem role="package">libmldbm-perl</systemitem> (module Perl indépendant de l'architecture).
ja: Perl 関連パッケージは、<ulink url="&url-perl-policy;">Perl ポリシー</ulink> があり、このポリシーに従っているパッケージの例が <systemitem role="package">libdbd-pg-perl</systemitem> (バイナリ perl モジュール) または <systemitem role="package">libmldbm-perl</systemitem> (アーキテクチャ非依存 perl モジュール) です。

source: Python related packages have their python policy; see &file-python-policy; in the <systemitem role="package">python</systemitem> package.
de: Python zugehörige Pakete haben ihre Python-Richtlinie. Siehe &file-python-policy; im Paket <systemitem role="package">python</systemitem>.
fr: Les paquets liés à Python utilisent une charte Python. Veuillez consulter le fichier &file-python-policy; du paquet <systemitem role="package">python</systemitem> pour plus d'informations.
ja: Python 関連パッケージは、python ポリシーを持っています; <systemitem role="package">python</systemitem> パッケージ中の &file-python-policy; を参照してください。

source: Emacs related packages have the <ulink url="&url-emacs-policy;">emacs policy</ulink>.
de: Emacs zugehörige Pakete haben die <ulink url="&url-emacs-policy;">Emacs-Richtlinie</ulink>.
fr: Les paquets liés à Emacs utilisent une <ulink url="&url-emacs-policy;">charte Emacs</ulink>.
ja: Emacs 関連パッケージには、<ulink url="&url-emacs-policy;">emacs ポリシー</ulink>があります。

source: Java related packages have their <ulink url="&url-java-policy;">java policy</ulink>.
de: Java zugehörige Pakete haben ihre <ulink url="&url-java-policy;">Java-Richtlinie</ulink>.
fr: Les paquets liés à Java utilisent une <ulink url="&url-java-policy;">charte Java</ulink>.
ja: Java 関連パッケージには、<ulink url="&url-java-policy;">java ポリシー</ulink>があります。

source: Ocaml related packages have their own policy, found in &file-ocaml-policy; from the <systemitem role="package">ocaml</systemitem> package. A good example is the <systemitem role="package">camlzip</systemitem> source package.
de: Ocaml zugehörige Pakete haben ihre eigene Richtlinie, die unter &file-ocaml-policy; im Paket <systemitem role="package">ocaml</systemitem> gefunden werden kann. Ein gutes Beispiel ist das Quellpaket <systemitem role="package">camlzip</systemitem>.
fr: Les paquets liés à Ocaml utilisent leur propre charte, que l'on peut trouver dans le fichier &file-ocaml-policy; du paquet <systemitem role="package">ocaml</systemitem>. Un bon exemple est fourni par le paquet source <systemitem role="package">camlzip</systemitem>.
ja: Ocaml 関連パッケージは、固有のポリシーを持っており、<systemitem role="package">ocaml</systemitem> パッケージの &file-ocaml-policy; でみることができます。良い例は <systemitem role="package">camlzip</systemitem> ソースパッケージです。

source: Packages providing XML or SGML DTDs should conform to the recommendations found in the <systemitem role="package">sgml-base-doc</systemitem> package.
de: Pakete, die XML- oder SGML-DTDs bereitstellen, sollten konform zu den Empfehlungen in Paket <systemitem role="package">sgml-base-doc</systemitem> sein.
fr: Les paquets fournissant des DTD XML ou SGML devraient suivre les recommandations données dans le paquet <systemitem role="package">sgml-base-doc</systemitem>.
ja: XML や SGML DTD を提供しているパッケージは、<systemitem role="package">sgml-base-doc</systemitem> パッケージ中の推奨に従わねばなりません。

source: Lisp packages should register themselves with <systemitem role="package">common-lisp-controller</systemitem>, about which see &file-lisp-controller;.
de: Lisp-Pakete sollten sich selbst mit <systemitem role="package">common-lisp-controller</systemitem> registrieren. Siehe dazu &file-lisp-controller;.
fr: Les paquets Lisp doivent s'enregistrer avec <systemitem role="package">common-lisp-controller</systemitem>, pour lequel plus d'information est disponible dans &file-lisp-controller;.
ja: lisp パッケージは、パッケージ自身を <systemitem role="package">common-lisp-controller</systemitem> に登録する必要があります。これについては、&file-lisp-controller; を参照してください。

source: Architecture-independent data
de: Architekturunabhängige Daten
fr: Données indépendantes de l'architecture
ja: アーキテクチャ非依存のデータ

source: It is not uncommon to have a large amount of architecture-independent data packaged with a program. For example, audio files, a collection of icons, wallpaper patterns, or other graphic files. If the size of this data is negligible compared to the size of the rest of the package, it's probably best to keep it all in a single package.
de: Es ist nicht unüblich, eine größere Menge architekturunabhängiger Daten mit einem Programm zu paketieren, Zum Beispiel Audiodateien, eine Symbolsammlung, Hintergrundmuster oder grafische Dateien. Falls die Größe dieser Daten vernachlässigbar im Vergleich zum Rest des Pakets ist, ist es wahrscheinlich am besten, alles in einem einzelnen Paket zu halten.
fr: Il est fréquent qu'un grand nombre de données indépendantes de l'architecture soient fournies avec un programme. Cela peut être par exemple des fichiers audio, un ensemble d'icônes, des motifs de papier-peint ou d'autres fichiers graphiques. Si la taille de ces données est négligeable par rapport à la taille du reste du paquet, il est probablement préférable de laisser l'ensemble dans un seul paquet.
ja: 大量のアーキテクチャ非依存データがプログラムと共にパッケージ化されるのは、良くあることではありません。例えば、音声ファイル、アイコン集、様々な模様の壁紙、その他一般的な画像ファイルです。このデータのサイズがパッケージの残りのサイズと比較して取るに足らないのであれば、おそらくは単一パッケージでひとまとめにしておくのがベストでしょう。

source: However, if the size of the data is considerable, consider splitting it out into a separate, architecture-independent package (<filename>_all.deb</filename>). By doing this, you avoid needless duplication of the same data into eleven or more .debs, one per each architecture. While this adds some extra overhead into the <filename>Packages</filename> files, it saves a lot of disk space on Debian mirrors. Separating out architecture-independent data also reduces processing time of <command>lintian</command> (see <xref linkend="tools-lint"/>) when run over the entire Debian archive.
de: Ist die Größe allerdings beachtlich, denken Sie darüber nach, sie in ein separates architekturunabhängiges Paket (<filename>_all.deb</filename>) auszulagern. Imdem Sie dies tun, vermeiden Sie nutzlose Vervielfältigung der gleichen Daten in elf oder mehr .debs, eins je Architektur. Indem dies einigen zusätzlichen Zuschlag zu den <filename>Packages</filename>-Dateien hinzufügt, spart es viel Plattenplatz auf Debian-Spiegeln. Das Heraustrennen architekturunabhängiger Daten vermindert auch die Ausführungszeit von <command>lintian</command> (siehe <xref linkend="tools-lint"/>), wenn es für das ganze Debian-Archiv ausgeführt wird.
fr: Cependant, si cette taille est importante, vous devriez réfléchir à les fournir dans un paquet séparé, indépendant de l'architecture (<filename>_all.deb</filename>). Cela permet ainsi d'éviter la duplication des mêmes données dans de nombreux paquets binaires, un par architecture. Bien que cela ajoute des entrées dans les fichiers <filename>Packages</filename>, cela permet d'économiser une place importante sur les miroirs de Debian. La séparation des données indépendantes de l'architecture réduit également le temps de traitement de <command>lintian</command> (voir <xref linkend="tools-lint"/>) lorsqu'il est utilisé sur l'archive Debian en entier.
ja: しかし、データのサイズが考えた方が良い程であれば、分かれたアーキテクチャ非依存パッケージ (<filename>_all.deb</filename>) に分割するのを考えてください。これによって、11 あるいはそれ以上の .deb ファイルについて、1アーキテクチャごとに同じデータの不必要な重複を避けられます。これは <filename>Packages</filename> ファイルに更なるオーバーヘッドを追加しますが、Debian ミラーサーバ上で多くのディスク容量を節約します。アーキテクチャ非依存のデータを分割することは、Debian アーカイブ全体に対して実行される <command>lintian</command> の処理時間の削減にもつながります (<xref linkend="tools-lint"/> 参照)。

source: Needing a certain locale during build
de: Eine bestimmte Locale wird während des Builds benötigt
fr: Besoin de paramètres régionaux spécifiques lors de la construction
ja: ビルド中に特定のロケールが必要

source: If you need a certain locale during build, you can create a temporary file via this trick:
de: Falls Sie eine bestimmte Locale während des Builds benötigen, können Sie mittels dieses Tricks eine temporäre Datei erstellen:
fr: Si des paramètres régionaux (« <literal>locale</literal> ») sont nécessaires pour la construction d'un paquet, vous pouvez créer un fichier temporaire avec l'astuce suivante.
ja: ビルド中に特定のロケールを必要とする場合、こんな技を使えば一時ファイルを作成できます:

source: If you set <varname>LOCPATH</varname> to the equivalent of <filename>/usr/lib/locale</filename>, and <varname>LC_ALL</varname> to the name of the locale you generate, you should get what you want without being root. Something like this:
de: Falls Sie <varname>LOCPATH</varname> auf die Entsprechung von <filename>/usr/lib/locale</filename> und <varname>LC_ALL</varname> auf den Namen der Locale setzen, die sie generieren, sollten Sie erreichen, was Sie möchten ohne dass Sie Root sind. Etwas wie Folgendes:
fr: Si la variable <varname>LOCPATH</varname> est placée sur l'équivalent de <filename>/usr/lib/locale</filename> et <varname>LC_ALL</varname> sur le nom des paramètres régionaux à créer, vous devriez pouvoir obtenir le résultat escompté sans avoir les privilèges du superutilisateur. La séquence ressemblera alors à :
ja: <varname>LOCPATH</varname> を <filename>/usr/lib/locale</filename> と同等のものに、そして <varname>LC_ALL</varname> を生成したロケールの名前に設定すれば、root にならなくても欲しいものが手に入ります。こんな感じです:

source: Make transition packages deborphan compliant
de: Machen Sie vorübergehende Pakete Deborphan-konform
fr: Paquets de transition conformes à <systemitem role="package">deborphan</systemitem>
ja: 移行パッケージを deboprhan に適合するようにする

source: Deborphan is a program for helping users to detect which packages can safely be removed from the system, i.e. the ones that have no packages depending on them. The default operation is to search only within the libs and oldlibs sections, to hunt down unused libraries. But when passed the right argument, it tries to catch other useless packages.
de: Deborphan ist ein Programm, das Anwendern hilft Pakete aufzuspüren, die sicher vom System entfernt werden können, d.h. diejenigen, von denen keine Pakete abhängen. Die Standardoperation ist, nur innerhalb der Abschnitte »libs« und »oldlibs« zu suchen, um Jagd auf unbenutzte Bibliotheken zu machen. Wenn aber das richtige Argument übergeben wird, versucht es auch andere nutzlose Pakete zu erwischen.
fr: Le programme <systemitem role="package">deborphan</systemitem> permet aux utilisateurs d'identifier les paquets pouvant être supprimés sans crainte du système, c'est-à-dire ceux dont aucun paquet ne dépend. Par défaut, l'utilitaire n'effectue sa recherche que parmi les paquets de bibliothèques et les sections <literal>libs</literal> et <literal>oldlibs</literal>, afin de traquer les bibliothèques inutilisées. Cependant, avec le paramètre approprié, il peut rechercher d'autres paquets inutiles.
ja: deborphan は、どのパッケージがシステムから安全に削除できるか、ユーザが検出するのを助けてくれるプログラムです; すなわち、どのパッケージも依存していないものです。デフォルトの動作は、使われていないライブラリを見つけ出すために libs と oldlibs セクションからのみ検索を行います。ですが、正しい引数を渡せば、他の使われていないパッケージを捕らえようとします。

source: For example, with <literal>--guess-dummy</literal>, <command>deborphan</command> tries to search all transitional packages which were needed for upgrade but which can now safely be removed. For that, it looks for the string dummy or transitional in their short description.
de: Mit <literal>--guess-dummy</literal> versucht <command>deborphan</command> zum Beispiel alle vorübergehenden Pakete zu suchen, die zum Upgrade benötigt wurden, die nun aber sicher entfernt werden können. Dazu sucht es nach den Zeichenketten »dummy« oder »transitional« in dessen Kurzbeschreibung.
fr: Par exemple, le paramètre <literal>--guess-dummy</literal> de la commande <command>deborphan</command> permet de rechercher les paquets de transition qui étaient nécessaires lors de mises à niveau mais peuvent être supprimés sans problème. Pour cela, il recherche la chaîne « <literal>dummy</literal> » ou « <literal>transitional</literal> » dans leur description courte.
ja: 例えば、<literal>--guess-dummy</literal> つきだと、<command>deborphan</command> はアップグレードに必要ではあったが、現在は問題なく削除できるすべての移行パッケージを探そうとします。これには、それぞれの短い説明文中に dummy あるいは transitional の文字列を探します。

source: So, when you are creating such a package, please make sure to add this text to your short description. If you are looking for examples, just run: <command>apt-cache search .|grep dummy</command> or <command>apt-cache search .|grep transitional</command>.
de: Wenn Sie also solch ein Paket erstellen, achten Sie bitte darauf, diesen Text zu Ihrer Kurzbeschreibung hinzuzufügen. Falls Sie sich nach Beispielen umsehen, führen Sie einfach <command>apt-cache search .|grep dummy</command> oder <command>apt-cache search .|grep transitional</command> aus.
fr: Ainsi, lorsque vous avez besoin de créer un tel paquet, veuillez prendre soin d'ajouter ce texte à sa description courte. Il est facile de trouver des exemples avec les commandes <command>apt-cache search .|grep dummy</command> ou <command>apt-cache search .|grep transitional</command>.
ja: ですので、あなたがそのようなパッケージを作る際には、この文章を短い説明文に必ず追加してください。例を探す場合は、以下を実行してください: <command>apt-cache search .|grep dummy</command> または <command>apt-cache search .|grep transitional</command>

source: Also, it is recommended to adjust its section to <literal>oldlibs</literal> and its priority to <literal>extra</literal> in order to ease <command>deborphan</command>'s job.
de: Außerdem wird empfohlen, den Abschnitt in <literal>oldlibs</literal> und die Priorität in <literal>extra</literal> anzupassen, um die Arbeit von <command>deborphan</command> zu erleichtern.
fr: De même, vous devriez configurer sa section en <literal>oldlibs</literal> et sa priorité en <literal>extra</literal> afin de faciliter le travail de <command>deborphan</command>.
ja: それから、<command>deborphan</command> の作業を楽にするため、section を <literal>oldlibs</literal>、priority を <literal>extra</literal> にするのもお勧めです。

source: Best practices for <filename>.orig.tar.{gz,bz2,xz}</filename> files
de: Optimale Vorgehensweisen für <filename>.orig.tar.{gz,bz2,xz}</filename>-Dateien
fr: Meilleures pratiques pour les fichiers <filename>.orig.tar.{gz,bz2,xz}</filename>
ja: <filename>.orig.tar.{gz,bz2,xz}</filename> についてのベストプラクティス

source: There are two kinds of original source tarballs: Pristine source and repackaged upstream source.
de: Es gibt zwei Arten von Original-Quell-Tarballs: unberührte Quellen und neu paketierte Quellen der Originalautoren.
fr: Il existe deux sortes différentes d'archives source d'origine. Les sources originelles (« <literal>pristine</literal> ») et les sources reconstruites (« <literal>repackaged</literal> »).
ja: オリジナルのソース tarball には 2 種類あります: 手が入れられていない素のソース (Pristine source) と再パッケージした開発元のソース (repackaged upstream source) です。

source: Pristine source
de: Unberührte Quellen
fr: Source originelle (« <literal>pristine</literal> »)
ja: 手が入れられていないソース (Pristine source)
