Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: The first and most important thing is to respond quickly to bug or issues raised by porters. Please treat porters with courtesy, as if they were in fact co-maintainers of your package (which, in a way, they are). Please be tolerant of succinct or even unclear bug reports; do your best to hunt down whatever the problem is.
de: Die Erste und Wichtigste ist es, schnell auf einen Fehler oder ein Problem zu antworten, das ein Portierer aufgetrieben hat. Behandeln Sie Portierer mit Höflichkeit, da Sie praktisch Mitbetreuer Ihres Pakets sind (was sie gewissermaßen sind). Bitte seien Sie tolerant bei knappen oder sogar unklaren Fehlerberichten. Tun Sie Ihr Bestes, um Jagd auf das zu machen, was auch immer das Problem ist.
fr: Ici, le premier et plus important point est de répondre rapidement aux rapports de bogues et problèmes soulevées par les porteurs. Traitez-les courtoisement, comme s'ils étaient co-responsables de vos paquets (ce qu'ils sont d'une certaine manière). Merci pour votre indulgence envers des rapports de bogue succincts ou peu clairs ; faites de votre mieux pour éliminer le problème.
ja: まず初めの、そして最も重要な点は、バグや移植作業者から投げかけられた問題に素早く回答することです。移植作業者をパッケージの副メンテナ (co-maintainer) であるように丁重に扱ってください (ある意味、その通りではあります)。簡潔、あるいは不明瞭なバグ報告に対して寛容になってください。問題が何であれ、原因を捉えることに最善を尽くしてください。

source: By far, most of the problems encountered by porters are caused by <emphasis>packaging bugs</emphasis> in the source packages. Here is a checklist of things you should check or be aware of.
de: Die mit Abstand meisten Probleme, die von Portierern gefunden werden, werden durch <emphasis>Paketierungsfehler</emphasis> in den Quellpaketen verursacht. Hier ist eine Prüfliste der Dinge, die Sie prüfen oder wissen sollten.
fr: Les problèmes les plus couramment rencontrés par les porteurs sont causés par des <emphasis>erreurs d'empaquetage</emphasis> dans le paquet source. Voici un pense-bête pour les points auxquels vous devez être attentif :
ja: 移植作業者が遭遇する問題のほとんどは、何といっても、ソースパッケージ内での<emphasis>パッケージ作成のバグ</emphasis>によって引き起こされます。以下は、確認あるいは注意すべき項目のリストです。

source: Make sure that your <literal>Build-Depends</literal> and <literal>Build-Depends-Indep</literal> settings in <filename>debian/control</filename> are set properly. The best way to validate this is to use the <systemitem role="package">debootstrap</systemitem> package to create an <literal>unstable</literal> chroot environment (see <xref linkend="debootstrap"/>). Within that chrooted environment, install the <systemitem role="package">build-essential</systemitem> package and any package dependencies mentioned in <literal>Build-Depends</literal> and/or <literal>Build-Depends-Indep</literal>. Finally, try building your package within that chrooted environment. These steps can be automated by the use of the <command>pbuilder</command> program which is provided by the package of the same name (see <xref linkend="pbuilder"/>).
de: Stellen Sie sicher, dass Ihre <literal>Build-Depends</literal>- und <literal>Build-Depends-Indep</literal>-Einstellungen in der Datei <filename>debian/control</filename> richtig gesetzt sind. Die beste Methode dies zu überprüfen, ist die Benutzung des Pakets <systemitem role="package">debootstrap</systemitem>, um eine <literal>unstable</literal>-Chroot-Umgebung zu erstellen (siehe <xref linkend="debootstrap"/>). Innerhalb der Chroot-Umgebung installieren Sie das Paket <systemitem role="package">build-essential</systemitem> und/oder <literal>Build-Depends-Indep</literal>. Am Ende versuchen Sie Ihr Paket innerhalb der Chroot-Umgebung zu erstellen. Diese Schritte können mit dem Programm <command>pbuilder</command> automatisiert werden, das im vom Paket mit dem gleichen Namen bereitgestellt wird (siehe<xref linkend="pbuilder"/>).
fr: vérifiez que les champs <literal>Build-Depends</literal> et <literal>Build-Depends-Indep</literal> du fichier <filename>debian/control</filename> sont corrects. Le meilleur moyen de le vérifier est d'utiliser le paquet <systemitem role="package">debootstrap</systemitem> pour créer un environnement <literal>unstable</literal> <literal>chrooté</literal> (voir <xref linkend="debootstrap"/>). Dans cet environnement <literal>chrooté</literal>, installez le paquet <systemitem role="package">build-essential</systemitem> et tous les paquets mentionnés dans les champs <literal>Build-Depends</literal> ou <literal>Build-Depends-Indep</literal>. Ensuite, essayez de fabriquer le paquet dans cet environnement. Ces étapes peuvent être automatisées en utilisant le programme <command>pbuilder</command> fourni par le paquet de même nom (voir <xref linkend="pbuilder"/>).
ja: <filename>debian/control</filename> 中の <literal>Build-Depends</literal> と <literal>Build-Depends-Indep</literal> の設定が正しいことを確認してください。これを検証するのに最も良い方法は <systemitem role="package">debootstrap</systemitem> パッケージを使って <literal>不安定版 (unstable)</literal> の chroot 環境を作成することです (<xref linkend="debootstrap"/> 参照)。chroot 環境内では、<systemitem role="package">build-essential</systemitem> パッケージと、<literal>Build-Depends</literal> または <literal>Build-Depends-Indep</literal> に記載されている依存パッケージをインストールしてください。最後に、chroot 環境でパッケージの生成を試してください。これらの手順は <command>pbuilder</command> パッケージで提供される同名のプログラムの利用によって自動化することができます (<xref linkend="pbuilder"/> 参照)。

source: If you can't set up a proper chroot, <command>dpkg-depcheck</command> may be of assistance (see <xref linkend="dpkg-depcheck"/>).
de: Falls Sie kein ordnungsgemäßes Chroot einrichten können, könnte Ihnen <command>dpkg-depcheck</command> behilflich sein (siehe <xref linkend="dpkg-depcheck"/>).
fr: En cas de difficultés pour configurer un environnement <literal>chrooté</literal>, <command>dpkg-depcheck</command> pourra peut-être vous aider (voir <xref linkend="dpkg-depcheck"/>).
ja: chroot を正しく設定できない場合は、<command>dpkg-depcheck</command> が手助けになることでしょう (<xref linkend="dpkg-depcheck"/> 参照)。

source: See the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> for instructions on setting build dependencies.
de: Anweisungen über die Einrichtung von Erstellungsabhängigkeiten finden Sie im <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>.
fr: Consultez la <ulink url="&url-debian-policy;">Charte Debian</ulink> pour en savoir plus sur les dépendances de fabrication ;
ja: ビルドの依存情報の指定方法については、<ulink url="&url-debian-policy;">Debian ポリシーマニュアル</ulink>を参照してください。

source: Don't set architecture to a value other than <literal>all</literal> or <literal>any</literal> unless you really mean it. In too many cases, maintainers don't follow the instructions in the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>. Setting your architecture to only one architecture (such as <literal>i386</literal> or <literal>amd64</literal>) is usually incorrect.
de: Setzen Sie »architecture« auf keinen anderen Wert als <literal>all</literal> oder <literal>any</literal>, außer wenn Sie das wirklich beabsichtigen. In zu vielen Fällen folgen Paketbetreuer nicht den Anweisungen im <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>. Wenn Sie Ihre »architecture« nur auf eine Architektur (wie <literal>i386</literal> oder <literal>amd64</literal>) setzen, ist dies normalerweise falsch.
fr: ne choisissez pas d'autres valeurs que <literal>all</literal> ou <literal>any</literal> pour le champ architecture sans avoir de bonnes raisons. Trop souvent, les développeurs ne respectent pas les instructions de la <ulink url="&url-debian-policy;">Charte Debian</ulink>. Choisir la valeur <literal>i386</literal> ou <literal>amd64</literal> est généralement incorrect ;
ja: 意図がある場合以外は、アーキテクチャの値を <literal>all</literal> または <literal>any</literal> 以外に指定しないでください。非常に多くの場合、メンテナが <ulink url="&url-debian-policy;">Debianポリシーマニュアル</ulink>の指示に従っていません。アーキテクチャを単一のものに指定する (<literal>i386</literal> あるいは <literal>amd64</literal> など) は大抵誤りです。

source: Make sure your source package is correct. Do <literal>dpkg-source -x <replaceable>package</replaceable>.dsc</literal> to make sure your source package unpacks properly. Then, in there, try building your package from scratch with <command>dpkg-buildpackage</command>.
de: Stellen Sie sicher, dass das Quellpaket korrekt ist. Führen Sie <literal>dpkg-source -x <replaceable>Paket</replaceable>.dsc</literal> aus, um sicherzustellen, dass Ihr Quellpaket ordnungsgemäß entpackt wird. Dann versuchen Sie dort hinein Ihr Paket von Grund auf mit <command>dpkg-buildpackage</command> zu erstellen.
fr: vérifiez que le paquet source est correct. Faites <literal>dpkg-source -x <replaceable>paquet</replaceable>.dsc</literal> pour vous assurer que le paquet se décompresse correctement. En utilisant le résultat de ce test, construisez votre paquet binaire à l'aide de la commande <command>dpkg-buildpackage</command> ;
ja: ソースパッケージが正しいことを確かめてください。ソースパッケージが正しく展開されたのを確認するため、<literal>dpkg-source -x <replaceable>package</replaceable>.dsc</literal> を実行してください。そして、ここでは、一からパッケージを <command>dpkg-buildpackage</command> でビルドするのに挑戦してみてください。

source: Make sure you don't ship your source package with the <filename>debian/files</filename> or <filename>debian/substvars</filename> files. They should be removed by the <literal>clean</literal> target of <filename>debian/rules</filename>.
de: Stellen Sie sicher, dass Sie Ihr Quellpaket nicht mit den Dateien <filename>debian/files</filename> oder <filename>debian/substvars</filename> ausliefern. Sie sollten durch das Target <literal>clean</literal> von <filename>debian/rules</filename> entfernt werden.
fr: vérifiez que les fichiers <filename>debian/files</filename> ou <filename>debian/substvars</filename> ne sont pas dans votre paquet source. Ils doivent être effacés par la cible <literal>clean</literal> de <filename>debian/rules</filename> ;
ja: <filename>debian/files</filename> や <filename>debian/substvars</filename> を含んだソースパッケージを出していないかを確かめてください。これらは、<filename>debian/rules</filename> の <literal>clean</literal> ターゲットによって削除されるべきです。

source: Make sure you don't rely on locally installed or hacked configurations or programs. For instance, you should never be calling programs in <filename>/usr/local/bin</filename> or the like. Try not to rely on programs being setup in a special way. Try building your package on another machine, even if it's the same architecture.
de: Stellen Sie sicher, dass Sie sich nicht auf lokal installierte Pakete oder gehackte Konfigurationen oder Programme verlassen. Sie sollten zum Beispiel niemals Programme in <filename>/usr/local/bin</filename> oder dergleichen aufrufen. Versuchen Sie Ihr Paket auf einem anderen Rechner zu erstellen, sogar wenn er die gleiche Architektur hat.
fr: assurez-vous de ne pas dépendre d'éléments de configuration, ou de logiciels installés ou modifiés localement. Par exemple, vous ne devriez jamais appeler des programmes du répertoire <filename>/usr/local/bin</filename> ou de répertoires équivalents. Essayez de ne pas dépendre de logiciels configurés de manière spéciale. Essayez de construire votre paquet sur une autre machine, même s'il s'agit de la même architecture ;
ja: ローカル環境にインストールされていたり、弄くられている設定やプログラムに依存していないことを確かめてください。例えば、<filename>/usr/local/bin</filename> やその類のプログラムは決して呼び出してはいけません。特殊なやり方で設定されたプログラムには依存しないようにしてください。別のマシンでパッケージをビルドしてください。それが同じアーキテクチャであっても、です。

source: Don't depend on the package you're building being installed already (a sub-case of the above issue). There are, of course, exceptions to this rule, but be aware that any case like this needs manual bootstrapping and cannot be done by automated package builders.
de: Verlassen Sie sich nicht darauf, dass das Paket, das Sie erstellen, bereits installiert ist (ein Teilaspekt des vorherigen Problems). Es gibt natürlich Ausnahmen von dieser Regel, aber seine Sie sich bewusst, dass dies auf jeden Fall manuelles Bootstrapping erfordert und nicht durch automatisierte Paket-Builder erledigt werden kann.
fr: ne vous appuyez pas sur une installation préexistante du paquet (un sous-cas de la remarque précédente). Il existe, bien sûr, des exceptions à cette règle, mais soyez conscient que chaque cas comme celui-ci demande une mise en place (« <literal>bootstrapping</literal> ») manuelle et ne peut être automatisé par les services d'empaquetage ;
ja: 構築中の既にインストールしてあるパッケージに依存しないでください (上記の話の一例です)。もちろん、このルールには例外はありますが、そのような場合には手動で一から環境を構築する必要があり、パッケージ作成マシンで自動的に構築することはできません。

source: Don't rely on the compiler being a certain version, if possible. If not, then make sure your build dependencies reflect the restrictions, although you are probably asking for trouble, since different architectures sometimes standardize on different compilers.
de: Verlassen Sie sich, wenn möglich, nicht auf eine bestimmte Version des Compilers. Falls doch, dann stellen Sie sicher, dass Ihre Build-Abhängigkeiten diese Einschränkungen widerspiegeln, obwohl Sie sich wahrscheinlich Ärger einhandeln, da verschiedene Architekturen manchmal unterschiedliche Compiler vorgeben.
fr: si possible, ne dépendez pas d'une version particulière d'un compilateur. Si vous ne pouvez pas faire autrement, assurez-vous que les dépendances de fabrication reflètent cette restriction, bien que vous cherchiez sûrement les problèmes car certaines architectures pourraient choisir un compilateur différent ;
ja: 可能であれば、特定のバージョンのコンパイラに依存しないでください。もし無理であれば、その制約をビルドの依存関係に反映されているのを確認してください。だとしても異なったアーキテクチャでは時折異なったバージョンのコンパイラで統一されているので、それでも恐らく問題を引き起こすことになるでしょう。

source: Make sure your <filename>debian/rules</filename> contains separate <literal>binary-arch</literal> and <literal>binary-indep</literal> targets, as the Debian Policy Manual requires. Make sure that both targets work independently, that is, that you can call the target without having called the other before. To test this, try to run <command>dpkg-buildpackage -B</command>.
de: Sorgen Sie dafür, dass Ihre <filename>debian/rules</filename>-Datei separate <literal>binary-arch</literal>- und <literal>binary-indep</literal>-Targets enthält, wie es das Debian Policy Manual erfordert. Stellen Sie sicher, dass beide Targets unabhängig voneinander funktionieren, damit Sie ein Target aufrufen können, ohne das Sie vorher das andere aufgerufen haben müssen. Um dies zu prüfen, führen Sie <command>dpkg-buildpackage -B</command> aus.
fr: vérifiez que le fichier <filename>debian/rules</filename> distingue les cibles <literal>binary-arch</literal> et <literal>binary-indep</literal> comme l'exige la Charte Debian. Vérifiez que ces cibles sont indépendantes l'une de l'autre, c'est-à-dire, qu'il n'est pas nécessaire d'invoquer l'une de ces cibles avant d'invoquer l'autre. Pour vérifier cela, essayez d'exécuter <command>dpkg-buildpackage -B</command>.
ja: <filename>debian/rules</filename> で、Debian ポリシーマニュアルが定めるように、<literal>binary-arch</literal> 及び <literal>binary-indep</literal> ターゲットに分かれて含まれていることを確かめてください。両方のターゲットが独立して動作するのを確かめてください。つまり、他のターゲットを事前に呼び出さなくても、ターゲットを呼び出せるのを確かめるということです。これをテストするには、<command>dpkg-buildpackage -B</command> を実行してください。

source: Guidelines for porter uploads
de: Richtlinien für Uploads von Portierern
fr: Conseils aux porteurs pour les mises à jour
ja: 移植作業者のアップロード (porter upload) に関するガイドライン

source: If the package builds out of the box for the architecture to be ported to, you are in luck and your job is easy. This section applies to that case; it describes how to build and upload your binary package so that it is properly installed into the archive. If you do have to patch the package in order to get it to compile for the other architecture, you are actually doing a source NMU, so consult <xref linkend="nmu-guidelines"/> instead.
de: Wenn das Paket aus dem Stand für die Architektur erstellt werden kann, auf die es portiert werden soll, haben Sie Glück und Ihre Arbeit ist einfach. Dieser Abschnitt befasst sich mit diesem Fall; er beschreibt, wie Ihr Binärpaket erstellt und hochgeladen wird, so dass es ordnungsgemäß im Archiv installiert werden kann. Falls Sie das Paket patchen müssen, um es für eine andere Architektur compilieren zu können, führen Sie in Wirklichkeit ein Quell-NMU durch, ziehen Sie daher stattdessen <xref linkend="nmu-guidelines"/> zu Rate.
fr: Si le paquet se construit tel quel sur l'architecture visée, vous avez de la chance et votre travail est facile. Cette section s'applique dans ce cas ; elle décrit comment construire et installer correctement le paquet binaire dans l'archive Debian. Si vous devez modifier le paquet pour le rendre compilable sur la nouvelle architecture, il faudra faire une NMU sources, consultez plutôt <xref linkend="nmu-guidelines"/>.
ja: パッケージが移植作業を行うアーキテクチャで手を入れずに構築できるのであれば、あなたは幸運で作業は簡単です。この章は、その様な場合に当てはめられます: きちんとアーカイブにインストールされるために、どうやってバイナリパッケージを構築・アップロードするかを記述しています。他のアーキテクチャでコンパイルできるようにするため、パッケージにパッチを当てる必要がある場合は、実際のところ、ソース NMU を行なうので、代わりに <xref linkend="nmu-guidelines"/> を参照してください。

source: For a porter upload, no changes are being made to the source. You do not need to touch any of the files in the source package. This includes <filename>debian/changelog</filename>.
de: Für einen Upload eines Portierern werden keine Änderungen an den Quellen vorgenommen. Sie müssen keine Dateien im Quellpaket anfassen. Dies schließt <filename>debian/changelog</filename> ein.
fr: Pour un envoi de portage, ne faites pas de changement dans les sources. Vous n'avez pas besoin de modifier les fichiers du paquet source, y compris le fichier <filename>debian/changelog</filename>.
ja: 移植作業者のアップロード (porter upload) は、ソースに何も変更を加えません。ソースパッケージ中のファイルには触る必要はありません。これは <filename>debian/changelog</filename> を含みます。

source: The way to invoke <command>dpkg-buildpackage</command> is as <literal>dpkg-buildpackage -B -m<replaceable>porter-email</replaceable></literal>. Of course, set <replaceable>porter-email</replaceable> to your email address. This will do a binary-only build of only the architecture-dependent portions of the package, using the <literal>binary-arch</literal> target in <filename>debian/rules</filename>.
de: Die Vorgehensweise <command>dpkg-buildpackage</command> aufzurufen ist wie folgt: <literal>dpkg-buildpackage -B -m<replaceable>E-Mail des Portierers</replaceable></literal>. Natürlich setzen Sie <replaceable>E-Mail des Portierers</replaceable> auf Ihre E-Mail-Adresse. Dies wird zu einem rein binären Build von nur den Paketteilen führen, die architekturabhängig sind. Dabei wird in <filename>debian/rules</filename> das Target <literal>binary-arch</literal> benutzt.
fr: La manière d'invoquer <command>dpkg-buildpackage</command> est la suivante : <literal>dpkg-buildpackage -B -m<replaceable>adresse-porteur</replaceable></literal>. Bien sûr, remplacez <replaceable>adresse-porteur</replaceable> par votre adresse électronique. Cette commande construira les parties du paquet qui dépendent de l'architecture, en utilisant la cible <literal>binary-arch</literal> de <filename>debian/rules</filename>.
ja: <command>dpkg-buildpackage</command> を <literal>dpkg-buildpackage -B -m<replaceable>porter-email</replaceable></literal> として起動してください。もちろん、<replaceable>porter-email</replaceable>にはあなたのメールアドレスを設定します。これは<filename>debian/rules</filename> の <literal>binary-arch</literal> を使ってパッケージのバイナリ依存部分のみのビルドを行います。

source: If you are working on a Debian machine for your porting efforts and you need to sign your upload locally for its acceptance in the archive, you can run <command>debsign</command> on your <filename>.changes</filename> file to have it signed conveniently, or use the remote signing mode of <command>dpkg-sig</command>.
de: Falls Sie für Ihr Portierungs-Bestreben auf einer Debian-Maschine arbeiten und Ihren Upload lokal signieren müssen, damit er im Archiv akzeptiert wird, können Sie <command>debsign</command> für Ihre <filename>.changes</filename>-Datei ausführen, um sie bequem zu signieren oder benutzen Sie den Signierungsmodus aus der Ferne von <command>dpkg-sig</command>.
fr: Si vous travaillez sur une machine Debian pour vos efforts de portage et que vous devez signer l'envoi localement pour être accepté dans l'archive, vous pouvez exécuter <command>debsign</command> sur le fichier <filename>.changes</filename> pour qu'il soit signé convenablement, ou utiliser le mode de signature à distance de <command>dpkg-sig</command>.
ja: 移植作業のために Debian マシン上で作業をしていて、アーカイブに入れてもらうためにアップロードするパッケージにローカルでサインする必要がある場合は、<filename>.changes</filename> に対して <command>debsign</command> を手軽に実行するのもできますし、<command>dpkg-sig</command> のリモート署名モードを使うこともできます。

source: Recompilation or binary-only NMU
de: Neu compilieren oder rein binärer NMU
fr: Recompilation ou mise à jour indépendante binaire (<literal>binNMU</literal>)
ja: 再コンパイル、あるいは binary-only NMU

source: Sometimes the initial porter upload is problematic because the environment in which the package was built was not good enough (outdated or obsolete library, bad compiler, etc.). Then you may just need to recompile it in an updated environment. However, you have to bump the version number in this case, so that the old bad package can be replaced in the Debian archive (<command>dak</command> refuses to install new packages if they don't have a version number greater than the currently available one).
de: Manchmal ist der erste Upload einer Portierung problematisch, da die Umgebung, in der das Paket erstellt wurde, nicht gut genug war (veraltete oder hinfällige Bibliotheken, falsche Compiler etc.). Dann könnte es nötig sein, dass Sie es nur neu in einer aktualisierten Umgebung compilieren müssen. In diesem Fall müssen Sie jedoch die Versionsnummer ändern, so dass das alte, falsche Paket im Debian-Archiv ersetzt werden kann (<command>dak</command> lehnt die Installation neuer Pakete ab, falls Sie keine höheren Versionsnummern, als das aktuell verfügbare haben).
fr: Parfois, l'envoi du porteur initial pose problème car l'environnement dans lequel le paquet a été construit n'était pas bon (bibliothèques périmées ou obsolètes, mauvais compilateur, etc.). Il se peut que vous ayez à le recompiler dans un environnement mis à jour. Cependant, dans ce cas, vous devez changer le numéro de version pour que les mauvais anciens paquets soient remplacés dans l'archive Debian (<command>dak</command> refuse d'installer un nouveau paquet s'il n'a pas un numéro de version supérieur à celui actuellement disponible).
ja: 時折、最初の移植作業者のアップロード作業は困難なものになります。パッケージが構築された環境があまり良くないからです (古すぎる、使われていないライブラリがある、コンパイラの問題、などなど…)。その場合には、更新した環境で再コンパイルする必要があるでしょう。しかし、この場合にはバージョンを上げる必要があり、古いおかしなパッケージは Debian アーカイブ中で入れ替えられることになります (現在利用可能なものよりバージョン番号が大きくない場合、<command>dak</command> は新しいパッケージのインストールを拒否します)。

source: You have to make sure that your binary-only NMU doesn't render the package uninstallable. This could happen when a source package generates arch-dependent and arch-independent packages that have inter-dependencies generated using dpkg's substitution variable <literal>$(Source-Version)</literal>.
de: Sie müssen sicherstellen, dass Ihr rein binärer NMU das Paket nicht uninstallierbar macht. Dies könnte geschehen, wenn ein Quellpaket architekturabhängige und architekturunabhängige Pakete generiert, die unter Benutzung von der ersetzbaren Dpkg-Variable <literal>$(Source-Version)</literal> wechselseitige Abhängigkeiten erzeugen.
fr: Vous devez vous assurer que votre binNMU ne rend pas le paquet non installable. Cela peut arriver si un paquet source génère des paquets dépendants et indépendants de l'architecture qui dépendent les uns des autres via <literal>$(Source-Version)</literal>.
ja: binary-only NMU がパッケージをインストール不可能にしてしまっていないことを確認する必要があります。ソースパッケージが、dpkg の substitution 変数 <literal>$(Source-Version)</literal> を使って内部依存関係を生成しているアーキテクチャ依存パッケージとアーキテクチャ非依存パッケージを生成した場合に起こる可能性があります。
