Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: &email-debian-email; is a special mailing list used as a grab-bag for Debian related correspondence such as contacting upstream authors about licenses, bugs, etc. or discussing the project with others where it might be useful to have the discussion archived somewhere.
de: &email-debian-email; ist eine besondere Mailingliste, die als Wundertüte für Debian-bezogene Korrespondenz, wie den Kontakt zu ursprünglichen Autoren über Lizenzen, Fehler, etc. oder Diskussionen über das Projekt mit anderen benutzt wird, wobei es nützlich sein könnte, dass die Diskussion irgendwo archiviert wird.
fr: &email-debian-email; est une liste de diffusion fourre-tout. Elle est utilisée pour les correspondances relatives à Debian qu'il serait utile d'archiver, telles que des échanges avec les auteurs amont à propos de licences, de bogues ou encore des discussions sur le projet avec d'autres personnes.
ja: &email-debian-email; は、特別なメーリングリストです。ライセンス、バグ、その他について upstream の作者にコンタクトを取る、他の人とプロジェクトについて議論した内容をアーカイブしておくのに役立つ Debian に関するメールをまとめた「福袋」として使われています。

source: Requesting new development-related lists
de: Antrag auf neue entwicklungsbezogene Listen
fr: Demander une nouvelle liste pour le développement
ja: 新規に開発関連のメーリングリストの開設を要求する

source: Before requesting a mailing list that relates to the development of a package (or a small group of related packages), please consider if using an alias (via a .forward-aliasname file on master.debian.org, which translates into a reasonably nice <replaceable>you-aliasname@debian.org</replaceable> address) or a self-managed mailing list on <link linkend="alioth">Alioth</link> is more appropriate.
de: Bevor Sie eine Mailingliste beantragen, die sich auf die Entwicklung eines Pakets (oder eine kleine Gruppe verwandter Pakete) bezieht, bedenken Sie bitte, dass es angebrachter ist, wenn Sie einen Alias (mittels einer »forward-aliasname«-Datei auf master.debian.org verwenden, die in einen halbwegs angenehmen <replaceable>ihr-aliasname@debian.org</replaceable> umwandelt) oder eine selbstverwaltete Mailingliste auf <link linkend="alioth">Alioth</link> benutzen.
fr: Avant de demander une liste de diffusion pour le développement d'un paquet (ou d'un petit groupe de paquets apparentés), veuillez envisager l'utilisation plus appropriée d'un alias (à l'aide d'un fichier .forward-nomdalias sur master.debian.org, qui se traduit en une adresse raisonnablement agréable <replaceable>vous-nomdalias@debian.org</replaceable>) ou d'une liste de diffusion autogérée sur <link linkend="alioth">Alioth</link>.
ja: パッケージ (や関連する小さなパッケージ群) の開発に関するメーリングリストの開設をリクエストをする前に、エイリアスを利用するのを検討してください (master.debian.org 上で .forward-aliasname ファイルを使うと、きちんと <replaceable>you-aliasname@debian.org</replaceable> アドレスに適切に変換してくれます)。あるいは、<link linkend="alioth">Alioth</link> 上で自分で管理するメーリングリストを使いましょう。

source: If you decide that a regular mailing list on &lists-host; is really what you want, go ahead and fill in a request, following <ulink url="&url-debian-lists-new;">the HOWTO</ulink>.
de: Falls Sie entscheiden, dass eine reguläre Mailingliste auf &lists-host; wirklich das ist, was Sie wollen – nur zu. Füllen Sie eine Anfrage aus und folgen Sie <ulink url="&url-debian-lists-new;">dem HOWTO</ulink>.
fr: Si une liste de diffusion standard sur &lists-host; est vraiment ce que vous voulez, lancez-vous et faites une demande en suivant <ulink url="&url-debian-lists-new;">le guide</ulink>.
ja: &lists-host; 上での通常のメーリングリストが本当に必要であると決意した場合は、<ulink url="&url-debian-lists-new;">HOWTO</ulink> に従って進めてリクエストを埋めてください。

source: IRC channels
de: IRC-Kanäle
fr: Canaux IRC
ja: IRC チャンネル

source: Several IRC channels are dedicated to Debian's development. They are mainly hosted on the <ulink url="&url-oftc;">Open and free technology community (OFTC)</ulink> network. The <literal>irc.debian.org</literal> DNS entry is an alias to <literal>irc.oftc.net</literal>.
de: Mehrere IRC-Kanäle sind für die Entwicklung von Debian bestimmt. Sie werden hauptsächlich auf dem <ulink url="&url-oftc;">Open and free technology community (OFTC)</ulink>-Netzwerk gehostet. Der DNS-Eintrag <literal>irc.debian.org</literal> ist ein Alias für <literal>irc.oftc.net</literal>.
fr: Plusieurs canaux IRC sont dédiés au développement de Debian. Ils sont principalement hébergés sur le réseau <literal><ulink url="&url-oftc;">Open and Free Technology Community (OFTC)</ulink></literal>. L'entrée DNS <literal>irc.debian.org</literal> est un alias vers <literal>irc.oftc.net</literal>.
ja: いくつもの IRC チャンネルが Debian の開発のために用意されています。チャンネルは主に <ulink url="&url-oftc;">Open and free technology community (OFTC)</ulink> のネットワーク上にホストされています。<literal>irc.debian.org</literal> の DNS エントリは <literal>irc.oftc.net</literal> へのエイリアスです。

source: The main channel for Debian in general is <literal>#debian</literal>. This is a large, general-purpose channel where users can find recent news in the topic and served by bots. <literal>#debian</literal> is for English speakers; there are also <literal>#debian.de</literal>, <literal>#debian-fr</literal>, <literal>#debian-br</literal> and other similarly named channels for speakers of other languages.
de: Der Hauptkanal für Debian ist im Allgemeinen <literal>#debian</literal>. Dies ist ein großer Kanal für allgemeine Zwecke, auf dem Benutzer aktuelle Neuigkeiten im Inhalt finden, der von Robotern bereitgestellt wird. <literal>#debian</literal> ist für englischsprachige Nutzer. Es gibt auch <literal>#debian.de</literal>, <literal>#debian-fr</literal>, <literal>#debian-br</literal> und andere Kanäle mit ähnlichen Namen für anderssprachige Nutzer.
fr: Le principal canal pour Debian est <literal>#debian</literal>. Il s'agit d'un canal important, généraliste, où les utilisateurs peuvent trouver des nouvelles récentes dans le sujet et qui est administré par des robots. <literal>#debian</literal> est destiné aux anglophones ; il existe également <literal>#debian.de</literal>, <literal>#debian-fr</literal>, <literal>#debian-br</literal> et d'autres canaux avec des noms semblables pour les personnes parlant d'autres langues.
ja: Debian 用のメインのチャンネルは一般的にいって <literal>#debian</literal> になります。これは巨大な、多目的のチャンネルで、ユーザがトピックやボットによって提供される最近のニュースを見つけることができる場所です。<literal>#debian</literal> は英語を話す人たち用のもので、他の言語を話す人達のために同様なものには <literal>#debian.de</literal>、<literal>#debian-fr</literal>、<literal>#debian-br</literal> など他にも似通った名前のチャンネルがあります。

source: The main channel for Debian development is <literal>#debian-devel</literal>. It is a very active channel; it will typically have a minimum of 150 people at any time of day. It's a channel for people who work on Debian, it's not a support channel (there's <literal>#debian</literal> for that). It is however open to anyone who wants to lurk (and learn). Its topic is commonly full of interesting information for developers.
de: Der Hauptkanal für Debian-Entwicklung ist <literal>#debian-devel</literal>. Es ist ein sehr aktiver Kanal; es werden normalerweise mindestens 150 Leute zu jeder Tageszeit dort sein. Es ist ein Kanal für Leute, die an Debian arbeiten, es ist kein Support-Kanal (dafür gibt es <literal>#debian</literal>). Das Themengebiet enthält normalerweise interessante Informationen für Entwickler.
fr: Le canal principal pour le développement de Debian est <literal>#debian-devel</literal>. C'est un canal très actif puisque plus de 150 personnes sont connectées en permanence. C'est un canal pour les personnes qui travaillent sur Debian, ce n'est pas un canal d'aide (il existe <literal>#debian</literal> pour cela). Il est cependant ouvert à tous ceux qui veulent écouter (et apprendre). Le sujet est généralement rempli d'informations intéressantes pour les développeurs.
ja: Debian 開発での中心のチャンネルは <literal>#debian-devel</literal> です。これはとてもアクティブなチャンネルで、大抵 150 人以上が常にログインしています。このチャンネルは Debian で作業する人達のためのチャンネルであって、サポート用のチャンネルではありません (そのためには <literal>#debian</literal> があります)。このチャンネルは、こっそり覗いてみたい (そして学びたい) 人に対してもオープンでもあります。このチャンネルのトピックは、開発者にとって興味深い情報に溢れています。

source: Since <literal>#debian-devel</literal> is an open channel, you should not speak there of issues that are discussed in &email-debian-private;. There's another channel for this purpose, it's called <literal>#debian-private</literal> and it's protected by a key. This key is available at <filename>master.debian.org:&file-debian-private-key;</filename>.
de: Da <literal>#debian-devel</literal> ein offener Kanal ist, sollten Sie dort nicht über Probleme sprechen, die in &email-debian-private; diskutiert werden. Es gibt einen anderen Kanal für diesen Zweck. Er heißt <literal>#debian-private</literal> und ist durch einen Schlüssel geschützt. Dieser Schlüssel ist unter <filename>master.debian.org:&file-debian-private-key;</filename> verfügbar.
fr: Comme <literal>#debian-devel</literal> est un canal ouvert, vous ne devriez pas y parler de problèmes discutés sur &email-debian-private;. Il existe un autre canal dans ce but, appelé <literal>#debian-private</literal> et protégé par clé. La clé est disponible dans le fichier <filename>master.debian.org:&file-debian-private-key;</filename>.
ja: <literal>#debian-devel</literal> は公開チャンネルなので、&email-debian-private; で話されている話題について触れるべきではありません。この目的の為には、<literal>#debian-private</literal> という鍵で守られた他のチャンネルがあります。この鍵は <filename>master.debian.org:&file-debian-private-archive;</filename> で取得可能です。

source: There are other additional channels dedicated to specific subjects. <literal>#debian-bugs</literal> is used for coordinating bug squashing parties. <literal>#debian-boot</literal> is used to coordinate the work on the debian-installer. <literal>#debian-doc</literal> is occasionally used to talk about documentation, like the document you are reading. Other channels are dedicated to an architecture or a set of packages: <literal>#debian-kde</literal>, <literal>#debian-dpkg</literal>, <literal>#debian-jr</literal>, <literal>#debian-edu</literal>, <literal>#debian-oo</literal> (OpenOffice.org package)...
de: Es gibt andere zusätzliche Kanäle die besonderen Themen gewidmet sind. <literal>#debian-bugs</literal> wird für die Koordination von Bug-Squashing-Parties benutzt. <literal>#debian-boot</literal> wird benutzt, um die Arbeit am Debian-Installationsprogramm zu koordinieren. <literal>#debian-doc</literal> wird gelegentlich benutzt, um über die Dokumentation zu reden, wie beispielsweise über das Dokument, das Sie lesen. Andere Kanäle beschäftigen sich mit einer Architektur oder einer Zusammenstellung von Paketen: <literal>#debian-kde</literal>, <literal>#debian-dpkg</literal>, <literal>#debian-jr</literal>, <literal>#debian-edu</literal>, <literal>#debian-oo</literal> (Paket OpenOffice.org) ...
fr: D'autres canaux sont dédiés à des sujets spécifiques. <literal>#debian-bugs</literal> est utilisé pour la coordination des chasses aux bogues (« <literal>bug squashing parties</literal> »). <literal>#debian-boot</literal> est utilisé pour la coordination du travail sur l'installateur Debian (« <literal>debian-installer</literal> »). <literal>#debian-doc</literal> est utilisé occasionnellement pour travailler sur la documentation comme celle que vous lisez actuellement. D'autres canaux sont dédiés à une architecture ou un ensemble de paquets : <literal>#debian-kde</literal>, <literal>#debian-dpkg</literal>, <literal>#debian-jr</literal>, <literal>#debian-edu</literal>, <literal>#debian-oo</literal> (paquet <literal>OpenOffice.org</literal>), etc.
ja: 他にも、特定の話題について専用のチャンネルがあります。<literal>#debian-bugs</literal> は、バグ潰しパーティ (BSP) を開催するために使われます。<literal>#debian-boot</literal> は、debian-installer の作業を調整するのに利用されています。<literal>#debian-doc</literal> は、今あなたが読んでいるような文章のドキュメント化について話すために時折使われています。アーキテクチャやパッケージ群について話すため、他にも専用チャンネルがあります：<literal>#debian-kde</literal>、<literal>#debian-dpkg</literal>、<literal>#debian-jr</literal>、<literal>#debian-edu</literal>、<literal>#debian-oo</literal> (OpenOffice.org パッケージ) など…

source: Some non-English developers' channels exist as well, for example <literal>#debian-devel-fr</literal> for French speaking people interested in Debian's development.
de: Es existieren außerdem einige nicht englische Entwicklerkanäle, zum Beispiel <literal>#debian-devel-fr</literal> für französchischsprachige Leute, die an der Entwicklung von Debian interessiert sind.
fr: Des canaux existent pour développeurs non anglophones, par exemple, <literal>#debian-devel-fr</literal> pour les francophones intéressés dans le développement de Debian.
ja: 同様に非英語圏の開発者のチャンネルも存在しています。例えば <literal>#debian-devel-fr</literal> は Debian の開発に興味があるフランス語を使う人々のためのチャンネルです。

source: Channels dedicated to Debian also exist on other IRC networks, notably on the <ulink url="&url-openprojects;">freenode</ulink> IRC network, which was pointed at by the <literal>irc.debian.org</literal> alias until 4th June 2006.
de: Auch in anderen IRC-Netzwerken existieren Kanäle, die für Debian bestimmt sind, insbesondere auf dem IRC-Netzwerk <ulink url="&url-openprojects;">freenode</ulink>, auf das bis zum 4.Juni 2006 vom Alias <literal>irc.debian.org</literal> verwiesen wurde.
fr: Des canaux dédiés à Debian existent sur d'autres réseaux IRC, notamment sur le réseau IRC <ulink url="&url-openprojects;">Freenode</ulink>, sur lequel pointait l'alias <literal>irc.debian.org</literal> jusqu'au 4 juin 2006.
ja: Debian 専用のチャンネルが他の IRC ネットワーク上にもあります。特に <ulink url="&url-openprojects;">freenode</ulink> IRC ネットワークは、2006 年 6 月 4 日まで <literal>irc.debian.org</literal> のエイリアスでした。

source: To get a cloak on freenode, you send Jörg Jaspert &lt;joerg@debian.org&gt; a signed mail where you tell what your nick is. Put cloak somewhere in the Subject: header. The nick should be registered: <ulink url="http://freenode.net/faq.shtml#nicksetup">Nick Setup Page</ulink>. The mail needs to be signed by a key in the Debian keyring. Please see <ulink url="http://freenode.net/faq.shtml#projectcloak">Freenode documentation</ulink> for more information about cloaks.
de: Um eine Cloak auf Freenode zu bekommen, senden Sie Jörg Jaspert &lt;joerg@debian.org&gt; eine signierte Mail, in der Sie Ihren Nicknamen mitteilen. Schreiben Sie »cloak« irgendwo in die Betreff-Kopfzeilen. Der Nickname sollte registriert werden: <ulink url="http://freenode.net/faq.shtml#nicksetup">Nick Setup Page</ulink>. Die Mail muss durch einen Schlüssel aus dem Debian-Schlüsselring signiert sein. Lesen Sie bitte die <ulink url="http://freenode.net/faq.shtml#projectcloak">Freenode-Dokumentation</ulink>, um weitere Informationen über Cloaks zu erhalten.
fr: Pour obtenir un uniforme (« <literal>cloak</literal> ») sur freenode, envoyez un message signé à Jörg Jaspert &lt;joerg@debian.org&gt; où vous indiquerez votre pseudonyme (« <literal>nick</literal> »). Indiquez « cloak » dans le sujet. Votre pseudonyme doit être enregistré conformément à la <ulink url="http://freenode.net/faq.shtml#nicksetup">page de configuration des pseudonymes</ulink>. Le message doit être signé avec une clé du porte-clés Debian. Veuillez consulter la <ulink url="http://freenode.net/faq.shtml#projectcloak">documentation de Freenode sur les uniformes</ulink> pour plus d'informations.
ja: freenode でクローク担当に手助けしてもらうには、Jörg Jaspert &lt;joerg@debian.org&gt; さんに対して、利用する nick (ニックネーム) を書いて GPG 署名したメールを送ります。メールの Subject: ヘッダのどこかに cloak の文字を入れてください。nick は登録をする必要があります：<ulink url="http://freenode.net/faq.shtml#nicksetup">ニックネームの設定の仕方を書いたページ</ulink>を参照下さい。メールは Debian keyring にある鍵でサインされている必要があります。クローク担当についての詳細は <ulink url="http://freenode.net/faq.shtml#projectcloak">Freenode のドキュメント</ulink> を参照してください。

source: This document contains a lot of information which is useful to Debian developers, but it cannot contain everything. Most of the other interesting documents are linked from <ulink url="&url-devel-docs;">The Developers' Corner</ulink>. Take the time to browse all the links, you will learn many more things.
de: Dieses Dokument enthält viele Informationen, die für Debian-Entwickler nützlich sind, es kann aber nicht alles enthalten. Die meisten anderen interessanten Dokumente sind von der <ulink url="&url-devel-docs;">Entwickler-Ecke</ulink> verlinkt. Nehmen Sie sich die Zeit all diese Links zu durchstöbern – Sie werden viele weitere Dinge lernen.
fr: Ce document contient beaucoup d'informations très utiles aux développeurs Debian, mais il ne peut pas tout contenir. La plupart des autres documents intéressants sont référencés dans le <ulink url="&url-devel-docs;">coin du développeur Debian</ulink>. Prenez le temps de parcourir tous les liens, vous apprendrez encore beaucoup de choses.
ja: このドキュメントは Debian 開発者にとって有用な情報をたくさん含んでいますが、全てを含めることは出来ていません。他の有用なドキュメントが<ulink url="&url-devel-docs;">開発者のコーナー</ulink>からリンクされています。時間を取ってリンクを全部眺めれば、より多くの事柄を学べるでしょう。

source: Debian machines
de: Debian-Maschinen
fr: Serveurs Debian
ja: Debian のマシン群

source: Debian has several computers working as servers, most of which serve critical functions in the Debian project. Most of the machines are used for porting activities, and they all have a permanent connection to the Internet.
de: Debian hat mehrere Computer, die als Server fungieren, meist um kritische Funktionen für das Debian-Projekt bereitzustellen. Die meisten dieser Maschinen werden für Portierungzwecke benutzt und alle haben eine permanente Verbindung ins Internet.
fr: Debian possède plusieurs ordinateurs employés comme serveurs, dont la plupart hébergent les fonctions critiques du projet Debian. La plupart des machines sont utilisées pour des activités de portage et elles ont toutes un accès permanent à Internet.
ja: Debian ではサーバとして動いている複数のコンピュータがあり、この多くは Debian プロジェクトにおいて重要な役割を果たしています。マシンの大半は移植作業に利用されており、全てインターネットに常時接続されています。

source: Some of the machines are available for individual developers to use, as long as the developers follow the rules set forth in the <ulink url="&url-dmup;">Debian Machine Usage Policies</ulink>.
de: Einige der Maschinen stehen einzelnen Entwicklern so lange zur Verfügung, wie die Entwickler die Regeln befolgen, die in den <ulink url="&url-dmup;">Debian-Rechner Benutzungsrichtlinien</ulink> festgelegt wurden.
fr: La plupart des machines peuvent être utilisées par les développeurs tant qu'ils respectent les règles définies dans la <ulink url="&url-dmup;">charte d'utilisation des machines Debian</ulink>.
ja: マシンのうち幾つかは、<ulink url="&url-dmup;">Debian マシン利用ポリシー</ulink>で定められたルールに従う限り、個々の開発者の利用が可能となっています。

source: Generally speaking, you can use these machines for Debian-related purposes as you see fit. Please be kind to system administrators, and do not use up tons and tons of disk space, network bandwidth, or CPU without first getting the approval of the system administrators. Usually these machines are run by volunteers.
de: Allgemein gesprochen, können Sie diese Maschinen nach Belieben für Debian-bezogene Zwecke nutzen. Bitte seien Sie freundlich zu den Systemadministratoren und verbrauchen Sie nicht massenhaft Plattenplatz, Netzwerk-Bandbreite oder CPU ohne zuerst die Zustimmung der Systemadministratoren eingeholt zu haben. Üblicherweise werden diese Maschinen von Freiwilligen betrieben.
fr: Ces machines peuvent être utilisées à votre discrétion pour des buts liés à à Debian. Veuillez cependant, par égard aux administrateurs système, ne pas utiliser de grandes quantités d'espace disque, de ressource réseau ou processeur sans obtenir auparavant l'accord des administrateurs. Ces machines sont d'habitude administrées par des bénévoles.
ja: とにかく、これらのマシンをあなたが Debian 関連の目的に合うと思ったことに利用できます。システム管理者には丁寧に接し、システム管理者からの許可を最初に得ることなく、非常に大量のディスク容量／ネットワーク帯域／CPU を消費しないようにしてください。大抵これらのマシンはボランティアによって運用されています。

source: Please take care to protect your Debian passwords and SSH keys installed on Debian machines. Avoid login or upload methods which send passwords over the Internet in the clear, such as Telnet, FTP, POP etc.
de: Bitte achten Sie darauf, Ihre Debian-Passwörter und SSH-Schlüssel, die auf Debian-Maschinen installiert sind, zu schützen. Vermeiden Sie Methoden zum Anmelden oder Hochladen, die Passwörter unverschlüsselt über das Internet übertragen, wie Telnet, FTP, POP, etc.
fr: Veuillez prendre soin de vos mots de passe Debian ainsi que des clés SSH installées sur les machines Debian. Évitez les méthodes de connexion ou d'envoi de données qui envoient les mots de passe en clair par Internet comme Telnet, FTP, POP, etc.
ja: Debian で利用しているパスワードと Debian のマシンにインストールしてある SSH 鍵を保護することに注意してください。ログインやアップロードの際にパスワードをインターネット越しに平文で送るような Telnet や FTP や POP などの利用方法は避けてください。

source: Please do not put any material that doesn't relate to Debian on the Debian servers, unless you have prior permission.
de: Bitte legen Sie kein Material auf Debian-Servern ab, das keinen Bezug zu Debian hat, nicht einmal, wenn Sie eine vorrangige Berechtigung haben.
fr: Veuillez ne pas déposer de données non relatives à Debian sur les serveurs Debian à moins d'avoir préalablement obtenu la permission de le faire.
ja: あなたが管理者でも無い限り、Debian サーバ上には Debian に関連しないものを一切置かないようにしてください。

source: The current list of Debian machines is available at <ulink url="&url-devel-machines;"></ulink>. That web page contains machine names, contact information, information about who can log in, SSH keys etc.
de: Die aktuelle liste von Debian-Maschinen ist unter <ulink url="&url-devel-machines;"></ulink> verfügbar. Diese Web-Seite enthält Maschinennamen, Kontaktinformationen darüber, wer sich anmelden kann, SSH-Schlüssel etc.
fr: La liste à jour des machines Debian est disponible sur la page : <ulink url="&url-devel-machines;"></ulink>. Cette page web contient les noms des machines, et permet d'accéder aux informations suivantes : contact, qui peut s'y connecter, clés SSH, etc.
ja: Debian のマシン一覧は <ulink url="&url-devel-machines;"></ulink> で確認可能です。このウェブページはマシン名、管理者の連絡先、誰がログイン可能か、SSH 鍵などの情報を含んでいます。

source: If you have a problem with the operation of a Debian server, and you think that the system operators need to be notified of this problem, you can check the list of open issues in the DSA queue of our request tracker at <ulink url="&url-rt;" /> (you can login with user "debian", its password is available at <filename>master.debian.org:&file-debian-rt-password;</filename>). To report a new problem, simply send a mail to &email-rt-dsa; and make sure to put the string "Debian RT" somewhere in the subject.
de: Falls Sie ein Problem mit einer Transaktion auf einem Debian-Server haben und der Ansicht sind, dass die Systemverwalter über dieses Problem informiert werden müssten, können Sie die Liste offener Probleme in der DSA-Warteschlange Ihrer Anfragenverfolgung unter <ulink url="&url-rt;" /> prüfen (Sie können sich als Benutzer »debian« anmelden, sein Passwort ist unter <filename>master.debian.org:&file-debian-rt-password;</filename> verfügbar). Um ein neues Problem zu berichten, senden Sie einfach eine E-Mail an &email-rt-dsa; und stellen Sie sicher, dass der Betreff die Zeichenkette »Debian RT« enthält.
fr: Si vous rencontrez un problème en utilisant un serveur Debian, et si vous estimez que les administrateurs système devraient en être avertis, vous pouvez vérifier la liste des tickets ouverts dans la file d'attente relative au <literal>DSA</literal> (administrateurs de système Debian « <literal>Debian System Administrators</literal> ») du gestionnaire de demandes (« <literal>request tracker</literal> ») : <ulink url="&url-rt;" /> (identifiant « debian » ; mot de passe disponible en <filename>master.debian.org:&file-debian-rt-password;</filename>). Pour signaler un nouveau problème, il suffit d'envoyer un message à &email-rt-dsa; en s'assurant d'indiquer « Debian RT » dans le sujet.
ja: Debian サーバでの作業について問題があり、システム管理者らに知らせる必要があると考えた場合は、<ulink url="&url-rt;" /> にあるリクエストトラッカーの DSA キューで公開されている問題のリストを確認できます ("debian" ユーザと <filename>master.debian.org:&file-debian-rt-password;</filename> にあるパスワードでログインできます)。新たな問題を報告するには、単に &email-rt-dsa; にメールを送ってください。"Debian RT" をサブジェクトのどこかに入れるのを忘れずに。
