Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: We cannot prevent upstream authors from changing the tarball they distribute without also incrementing the version number, so there can be no guarantee that a pristine tarball is identical to what upstream <emphasis>currently</emphasis> distributing at any point in time. All that can be expected is that it is identical to something that upstream once <emphasis>did</emphasis> distribute. If a difference arises later (say, if upstream notice that they weren't using maximal compression in their original distribution and then re-<command>gzip</command> it), that's just too bad. Since there is no good way to upload a new <filename>.orig.tar.{gz,bz2,xz}</filename> for the same version, there is not even any point in treating this situation as a bug.
de: Originalautoren können nicht daran gehindert werden, den von ihnen verteilten Tarball zu ändern, ohne die Versionsnummer zu erhöhen. Daher kann nicht gewährleistet werden, dass ein unberührter Tarball mit dem identisch ist, was die Originalautoren <emphasis>aktuell</emphasis> zu irgendeinem Zeitpunkt weitergeben. Alles was erwartet werden kann, ist, dass es identisch mit etwas ist, das die Originalautoren einmal weitergegeben <emphasis>haben</emphasis>. Falls sich später ein Unterschied ergibt (etwa, wenn die Originalautoren merken, dass sie in ihrer Verteilung des Originals keine maximale Komprimierung nutzen und es dann erneut mit <command>gzip</command> packen), ist das einfach Pech. Da es keine brauchbare Möglichkeit gibt, ein neues <filename>.orig.tar.{gz,bz2,xz}</filename> für die gleiche Version hochzuladen, gibt es auch keinen Punkt, an dem diese Situation als ein Fehler behandelt wird.
fr: Il est impossible d'empêcher les auteurs amont de modifier l'archive qu'ils distribuent sans également incrémenter le numéro de version. Il est donc impossible de garantir qu'une archive originelle est identique à ce que l'auteur amont <emphasis>distribue</emphasis> à un instant donné. Tout ce qu'il est possible de garantir est qu'elle a été identique à ce que les auteurs amont <emphasis>ont distribué</emphasis> à un moment donné. Si une différence apparaît plus tard (par exemple si les auteurs amont découvrent ne pas avoir utilisé la compression maximale dans leur distribution d'origine et la recompresse, c'est tout simplement dommage. Comme il n'existe pas de méthode adaptée pour envoyer un nouveau fichier <filename>.orig.tar.{gz,bz2,xz}</filename> pour la même version, il est même totalement inutile de traiter cette situation comme un bogue.
ja: 我々は、配布されている tarball がバージョン番号をインクリメントすることなく、開発元の作者によって変更されるのを防ぐことはできません。ですので、手が入れられていない素の tarball が、どの時点でも開発元が<emphasis>現在</emphasis>配布していると等しいものである保証はありません。期待できることは、一度は配布<emphasis>された</emphasis>ものと等しいものであるということだけです。後から違いが発生した場合 (そう、例えば upstream が元々の配布物が最大の圧縮率を使っていなかったことに気づいて、再度 <command>gzip</command> しなおした場合など)、それはとても残念なことです。同じバージョンに対して新しい <filename>.orig.tar.{gz,bz2,xz}</filename> をアップロードするのには良い方法がないので、この状況をバグと考える意味はありません。

source: The defining characteristic of a pristine source tarball is that the <filename>.orig.tar.{gz,bz2,xz}</filename> file is byte-for-byte identical to a tarball officially distributed by the upstream author.<placeholder type="footnote" id="0"/> This makes it possible to use checksums to easily verify that all changes between Debian's version and upstream's are contained in the Debian diff. Also, if the original source is huge, upstream authors and others who already have the upstream tarball can save download time if they want to inspect your packaging in detail.
de: Das charakteristische Merkmal eines unberührten Tarballs ist, dass die <filename>.orig.tar.{gz,bz2,xz}</filename>-Datei Byte für Byte identisch mit einem offiziell weitergegebenen Tarball des Originalautors ist.<placeholder type="footnote" id="0"/> Dies ermöglicht die Benutzung von Prüfsummen, um auf einfache Weise alle Änderungen zwischen Debians Version und der der Originalautoren zu prüfen, die in der Diff-Datei in Debian enthalten sind. Falls außerdem die Originalquelle riesig ist, können Originalautoren und andere, die bereits den Original-Tarball haben, Download-Zeit sparen, falls sie Ihre Paketierung im Detail inspizieren möchten.
fr: La caractéristique définissant une archive source originelle et que le fichier <filename>.orig.tar.{gz,bz2,xz}</filename> est strictement identique à l'archive fournie par l'auteur amont.<placeholder type="footnote" id="0"/> Cela permet d'utiliser des sommes de contrôle pour vérifier que toutes les modifications effectuées entre la version Debian et la version amont sont contenues dans le fichier de différences Debian. De même, si la taille des sources d'origine est importante, les auteurs amont et tous ceux qui disposent de l'archive amont d'origine peuvent économiser du temps de téléchargement s'ils souhaitent contrôler le paquet en détail.
ja: 素のソース tarball (pristine source tarball) の特徴の定義は、<filename>.orig.tar.{gz,bz2,xz}</filename> は、開発元の作者によって公式に配布された tarball と 1 バイトたりとも違わない、というものです。<placeholder type="footnote" id="0"/> これは、Debian diff 内に含まれているDebian バージョンと開発元のバージョン間のすべての違いを簡単に比較するのにチェックサムを使えるようになります。また、オリジナルのソースが巨大な場合、既に upstream の tarball を持っている upstream の作者と他の者は、あなたのパッケージを詳細に調査したい場合、ダウンロード時間を節約できます。

source: There is no universally accepted guidelines that upstream authors follow regarding to the directory structure inside their tarball, but <command>dpkg-source</command> is nevertheless able to deal with most upstream tarballs as pristine source. Its strategy is equivalent to the following:
de: Es gibt keine allgemein anerkannten Richtlinien, denen Originalautoren betreffend der Verzeichnisstruktur innerhalb ihres Tarballs folgen, aber <command>dpkg-source</command> ist dennoch in der Lage mit den meisten Tarballs von Originalautoren als unberührte Quelle umzugehen. Seine Strategie entspricht dem Folgenden:
fr: Il n'existe pas de convention universellement acceptée pour la structure de répertoires que devraient adopter les auteurs amont dans les archives qu'ils publient, mais <command>dpkg-source</command> peut de toute manière traiter le plupart des archives amont comme des sources originelles. La stratégie de cette commande est la suivante :
ja: tarball 中のディレクトリ構成に関して開発元の作者が従う、万人に受け入れられているガイドラインというものはありませんが、それにも関わらず <command>dpkg-source</command> は ほとんどの upstream の tarball を素のソース (pristine source) として対処できます。そのやり方は以下の通りです:

source: It unpacks the tarball in an empty temporary directory by doing
de: Es entpackt den Tarball in eine leeres temporäres Verzeichnis mittels
fr: elle extrait l'archive dans un répertoire temporaire :
ja: 以下のようにして空の一時ディレクトリに tarball を展開します

source: zcat path/to/<replaceable>packagename</replaceable>_<replaceable>upstream-version</replaceable>.orig.tar.gz | tar xf -
de: zcat path/to/<replaceable>Paketname</replaceable>_<replaceable>Originalversion</replaceable>.orig.tar.gz | tar xf -
fr: zcat path/to/<replaceable>nomdupaquet</replaceable>_<replaceable>version-amont</replaceable>.orig.tar.gz | tar xf -
ja: zcat path/to/<replaceable>パッケージ名</replaceable>_<replaceable>開発元のバージョン</replaceable>.orig.tar.gz | tar xf -

source: If, after this, the temporary directory contains nothing but one directory and no other files, <command>dpkg-source</command> renames that directory to <filename><replaceable>packagename</replaceable>-<replaceable>upstream-version</replaceable>(.orig)</filename>. The name of the top-level directory in the tarball does not matter, and is forgotten.
de: Falls das temporäre Verzeichnis danach nur ein Verzeichnis und keine anderen Dateien enthält, benennt <command>dpkg-source</command> dieses Verzeichnis in <filename><replaceable>Paketname</replaceable>_<replaceable>Originalversion</replaceable>(.orig)</filename> um. Der Name des Verzeichnisses auf der obersten Ebene im Tarball ist ohne Bedeutung und geht verloren.
fr: si, après cela, le répertoire temporaire ne contient qu'un seul répertoire sans fichiers, <command>dpkg-source</command> renomme ce répertoire en <filename><replaceable>nomdupaquet</replaceable>-<replaceable>version-amont</replaceable>(.orig)</filename>. Le nom du répertoire parent de l'archive tar n'a pas d'importance et est oublié ;
ja: もし、この後で、一時ディレクトリが 1 つのディレクトリ以外含まず他にどのファイルも無い場合、<command>dpkg-source</command> はそのディレクトリを <replaceable>パッケージ名</replaceable>-<replaceable>開発元のバージョン</replaceable>(.orig) にリネームします。tarball 中の最上位のディレクトリ名は問題にはされず、忘れられます。

source: Otherwise, the upstream tarball must have been packaged without a common top-level directory (shame on the upstream author!). In this case, <command>dpkg-source</command> renames the temporary directory <emphasis>itself</emphasis> to <filename><replaceable>packagename</replaceable>-<replaceable>upstream-version</replaceable>(.orig)</filename>.
de: Andernfalls muss der Tarball der Originalautoren ohne ein sonst übliches Verzeichnis der obersten Ebene gepackt worden sein (Schande über den Originalautor!). In diesem Fall benennt <command>dpkg-source</command> das temporäre Verzeichnis <emphasis>selbst</emphasis> in <filename><replaceable>Paketname</replaceable>_<replaceable>Originalversion</replaceable>(.orig)</filename> um.
fr: si ce n'est pas le cas, l'archive amont a été créée sans répertoire parent (honte à l'auteur amont !). Dans ce cas, <command>dpkg-source</command> renomme le répertoire temporaire <emphasis>lui-même</emphasis> en <filename><replaceable>nomdupaquet</replaceable>-<replaceable>version-amont</replaceable>(.orig)</filename>.
ja: それ以外の場合、upstream の tarball は共通の最上位ディレクトリ無しでパッケージされなくては いけません (upstream の作者よ、恥を知りなさい!)。この場合、<command>dpkg-source</command> は一時ディレクトリ<emphasis>そのもの</emphasis>を <replaceable>パッケージ名</replaceable>-<replaceable>開発元のバージョン</replaceable>(.orig) へリネームします。

source: Repackaged upstream source
de: Neu paketierte Originalquelle
fr: Source amont reconstruite
ja: upstream のソースをパッケージしなおす

source: You <emphasis role="strong">should</emphasis> upload packages with a pristine source tarball if possible, but there are various reasons why it might not be possible. This is the case if upstream does not distribute the source as gzipped tar at all, or if upstream's tarball contains non-DFSG-free material that you must remove before uploading.
de: Sie <emphasis role="strong">sollten</emphasis> Pakete, wenn möglich, mit einem unberührten Quell-Tarball hochladen, aber es gibt viele Gründe, warum das manchmal nicht möglich ist. Dies ist der Fall, wenn die Originalautoren die Quelle gar nicht als Gzip-gepackte Tar-Datei weitergeben oder falls der Tarball der Originalautoren nicht DFSG-freies Material enthält, das Sie vor den Hochladen entfernen müssen.
fr: Vous <emphasis role="strong">devriez</emphasis> envoyer les paquets avec une archive source inchangée, dans la mesure du possible. Il existe cependant plusieurs raisons qui peuvent rendre cela impossible. C'est notamment le cas si les auteurs amont ne distribuent pas d'archive tar compressée du tout ou si l'archive amont contient des parties non conformes aux principes du logiciel libre selon Debian, qui doivent être supprimées avant l'envoi.
ja: パッケージは手が入っていない素のソース tarball と共にアップロード<emphasis role="strong">すべき</emphasis>ですが、それが可能ではない場合が色々とあります。upstream がソースを gzip 圧縮した tarball を全く配布していない場合や、upstream の tarball が DFSG-free ではない、あなたがアップロード前に削除しなければならない素材を含んでいる場合がこれにあたります。

source: In these cases the developer must construct a suitable <filename>.orig.tar.{gz,bz2,xz}</filename> file themselves. We refer to such a tarball as a repackaged upstream source. Note that a repackaged upstream source is different from a Debian-native package. A repackaged source still comes with Debian-specific changes in a separate <filename>.diff.gz</filename> or <filename>.debian.tar.{gz,bz2,xz}</filename> and still has a version number composed of <replaceable>upstream-version</replaceable> and <replaceable>debian-version</replaceable>.
de: In diesen Fällen muss der Entwickler selbst eine geeignete <filename>.orig.tar.{gz,bz2,xz}</filename>-Datei bauen. Solch ein Tarball wird neu paketierten Originalquellen zugeordnet. Beachten Sie, dass sich eine neu paketierte Originalquelle von einem nativen Debian-Paket unterscheidet. Eine neu paketierte Quelle kommt mit Debian-spezifischen Änderungen in einem separaten <filename>.diff.gz</filename> oder <filename>.debian.tar.{gz,bz2,xz}</filename> daher und hat eine Versionsnummer, die sich aus der <replaceable>Originalversion</replaceable> und der <replaceable>Debian-version</replaceable> zusammensetzt.
fr: Dans ces cas, les responsables doivent construire eux-mêmes une archive <filename>.orig.tar.{gz,bz2,xz}</filename>. Cette archive sera appelée une archive amont reconstruite. Il est important de noter qu'elle reste différente d'un paquet natif. Une archive reconstruite est toujours fournie avec les changements propres à Debian dans un fichier <filename>.diff.gz</filename> ou <filename>.debian.tar.{gz,bz2,xz}</filename> séparé et son numéro de version est toujours composé de <replaceable>upstream-version</replaceable> et <replaceable>debian-version</replaceable>.
ja: この様な場合、開発者は適切な <filename>.orig.tar.{gz,bz2,xz}</filename> ファイルを自身で準備する必要があります。この様な tarball を、再パッケージした開発元のソース (repackaged upstream source) と呼びます。再パッケージした開発元のソースでは Debian ネイティブパッケージとは違うことに注意してください。再パッケージしたソースは、Debian 固有の変更点は分割された <filename>.diff.gz</filename> または <filename>.debian.tar.{gz,bz2,xz}</filename> のままであり、バージョン番号は <replaceable>開発元のバージョン</replaceable> と <replaceable>debian リビジョン</replaceable> から構成されたままです。

source: There may be cases where it is desirable to repackage the source even though upstream distributes a <filename>.tar.{gz,bz2,xz}</filename> that could in principle be used in its pristine form. The most obvious is if <emphasis>significant</emphasis> space savings can be achieved by recompressing the tar archive or by removing genuinely useless cruft from the upstream archive. Use your own discretion here, but be prepared to defend your decision if you repackage source that could have been pristine.
de: Es könnte Gründe geben, aus denen es wünschenswert wäre, die Quelle neu zu paketieren, obwohl die Originalautoren ein <filename>.tar.{gz,bz2,xz}</filename> verteilen, dass im Prinzip in seiner unberührten Form benutzt werden könnte. Der naheliegendste Grund ist, wenn <emphasis>signifikante</emphasis> Platzersparnis durch Neukomprimierung des Tar-Archivs oder Entfernen von wirklich nutzlosem Müll aus dem Qriginalarchiv erzielt werden kann. Handeln Sie hier nach eigenem Ermessen, aber seien Sie darauf vorbereitet, Ihre Entscheidung zu verteidigen, falls Sie eine Quelle neu paketieren, die unberührt sein könnte.
fr: Il peut exister des cas où il est souhaitable de reconstruire une archive source alors que les auteurs amont fournissent bien une archive <filename>.tar.{gz,bz2,xz}</filename> qui pourrait être utilisée directement. Le plus évident est la recherche d'un gain de place <emphasis>significatif</emphasis> par recompression ou par suppression de scories inutiles de l'archive source d'origine. Il est important que le responsable exerce avec discernement son propre jugement et soit prêt à le justifier si l'archive source est reconstruite alors qu'elle aurait pu être fournie telle quelle.
ja: 開発元が、原則的にはそのままの形で使える <filename>.tar.{gz,bz2,xz}</filename> を配布していたとしても再パッケージをしたくなるという場合がありえます。最も明解なのは、tar アーカイブを再圧縮することや upstream のアーカイブから純粋に使われていないゴミを削除することで、<emphasis>非常に</emphasis>容量を節約できる時です。ここで慎重になって頂きたいのですが、ソースを再パッケージする場合は、決定を貫く用意をしてください。

source: A repackaged <filename>.orig.tar.{gz,bz2,xz}</filename>
de: Ein neu paketiertes <filename>.orig.tar.{gz,bz2,xz}</filename>
fr: Un fichier <filename>.orig.tar.{gz,bz2,xz}</filename> reconstruit :
ja: <filename>.orig.tar.{gz,bz2,xz}</filename> についてのベストプラクティス

source: <emphasis role="strong">should</emphasis> be documented in the resulting source package. Detailed information on how the repackaged source was obtained, and on how this can be reproduced should be provided in <filename>debian/copyright</filename>. It is also a good idea to provide a <literal>get-orig-source</literal> target in your <filename>debian/rules</filename> file that repeats the process, as described in the Policy Manual, <ulink url="&url-debian-policy;ch-source.html#s-debianrules">Main building script: <filename>debian/rules</filename></ulink>.
de: <emphasis role="strong">sollte</emphasis> im resultierenden Quellpaket dokumentiert sein. Detaillierte Informationen, wie die neu paketierte Quelle gewonnen wurde und wie dies reproduziert werden kann, sollten in <filename>debian/copyright</filename> bereitgestellt werden. Es ist außerdem eine gute Idee, ein <literal>get-orig-source</literal>-Target in Ihrer <filename>debian/rules</filename>-Datei bereitzustellen, die den Prozess wiederholt, wie im Richtlinien-Handbuch beschrieben <ulink url="&url-debian-policy;ch-source.html#s-debianrules">Main building script: <filename>debian/rules</filename></ulink>.
fr: <emphasis role="strong">devrait</emphasis> être documenté dans le fichier source. Des informations détaillées sur la façon dont les sources ont été obtenues et comment il est possible de refaire l'opération devraient être fournies dans le fichier <filename>debian/copyright</filename>. Il est également suggéré de fournir une cible <literal>get-orig-source</literal> dans le fichier <filename>debian/rules</filename>, qui permette de refaire cette opération, comme indiqué dans la Charte Debian à propos du <ulink url="&url-debian-policy;ch-source.html#s-debianrules">script de construction principal : <filename>debian/rules</filename></ulink> ;
ja: ソースパッケージの由来を<emphasis role="strong">ドキュメントにすべき</emphasis>です。どうやってソースを得たのかという詳細情報が得たのか、どの様にすれば再生成できるのかを <filename>debian/copyright</filename> で提供しましょう。ポリシーマニュアルで、<ulink url="&url-debian-policy;ch-source.html#s-debianrules">メイン構築スクリプト: <filename>debian/rules</filename></ulink> に記述しているように、<filename>debian/rules</filename> に作業を繰り返してくれる <literal>get-orig-source</literal> ターゲットを追加するのも良い考えです。

source: As a special exception, if the omission of non-free files would lead to the source failing to build without assistance from the Debian diff, it might be appropriate to instead edit the files, omitting only the non-free parts of them, and/or explain the situation in a <filename>README.source</filename> file in the root of the source tree. But in that case please also urge the upstream author to make the non-free components easier separable from the rest of the source.
de: Als besondere Ausnahme könnte, falls das Auslassen unfreier Dateien dazu führen würde, dass das Build der Quelle ohne Unterstützung aus dem Debian-Diff fehlschlägt, das Bearbeiten der Dateien anstelle des Weglassens unfreier Teile davon und/oder Erklären der Situation in einer <filename>README.source</filename>-Datei im Wurzelverzeichnis der Quelle angemessen sein. Ermahnen Sie in diesem Fall aber auch den Originalautor, unfreie Komponenten leichter aus dem Quelltext heraustrennbar zu machen.
fr: Avec pour exception particulière, si l'omission de fichiers non libres provoque une erreur de compilation sans l'aide du fichier de modification Debian, de pouvoir modifier les fichiers pour enlever les portions non libres, ou d'expliquer la situation dans un fichier <filename>README.source</filename> à la racine de l'arbre des sources. Veuillez dans ce cas solliciter l'auteur amont de rendre les portions non libres faciles à séparer du reste des sources.
ja: 特別な例外として、non-free なファイルが Debian diff からの助けが無いとソースからのビルド失敗を引き起こす場合、適切な処置はファイルを編集するのではなく、non-free な部分を削除して、ソースツリーのルートに <filename>README.source</filename> ファイルとして状況を説明することです。ですがその場合、開発元の作者に non-free なコンポーネントを残りのソースから分離しやすくするように促してください。

source: <emphasis role="strong">should not</emphasis> contain any file that does not come from the upstream author(s), or whose contents has been changed by you.<placeholder type="footnote" id="0"/>
de: <emphasis role="strong">sollte keine</emphasis> Datei enthalten, die nicht von dem/den Origianlautor(en) stammt oder deren Inhalt von Ihnen geändert wurde.<placeholder type="footnote" id="0"/>
fr: <emphasis role="strong">ne devrait pas</emphasis> contenir de fichier non distribué par les auteurs amont, ou dont vous avez modifié le contenu ;<placeholder type="footnote" id="0"/>
ja: 開発元の作者由来ではないファイルや、あなたが内容を変更したファイルを含める<emphasis role="strong">べきではありません</emphasis>。<placeholder type="footnote" id="0"/>

source: <emphasis role="strong">should</emphasis>, except where impossible for legal reasons, preserve the entire building and portablility infrastructure provided by the upstream author. For example, it is not a sufficient reason for omitting a file that it is used only when building on MS-DOS. Similarly, a <filename>Makefile</filename> provided by upstream should not be omitted even if the first thing your <filename>debian/rules</filename> does is to overwrite it by running a configure script.
de: <emphasis role="strong">sollte</emphasis> außer, wenn es aus rechtlichen Gründen unmöglich ist, die ganze Erstellungs- und Portierungsinfrastruktur aufbewahren, die vom Originalautor bereitgestellt wurde. Es ist zum Beispiel kein ausreichender Grund für das Weglassen einer Datei, wenn sie nur für die Erstellung unter MS-DOS benutzt wird. Gleichermaßen sollte ein <filename>Makefile</filename>, das vom Originalautor bereitgestellt wurde nicht einmal dann weggelassen werden, wenn das erste, was Ihre <filename>debian/rules</filename> tut, das Überschreiben durch Ausführen eines Konfigurationsskripts ist.
fr: <emphasis role="strong">devrait</emphasis>, sauf si c'est impossible pour des raisons légales, préserver l'intégralité de l'infrastructure de construction et de portabilité fournie par l'auteur amont. Par exemple, il ne faut pas enlever un fichier sous prétexte qu'il ne sert qu'à la compilation sur MS-DOS. De même, un <filename>Makefile</filename> fourni en amont n'a pas de raison d'être enlevé si la première action de <filename>debian/rules</filename> est de l'écraser en exécutant un script de configuration.
ja: 法的理由から不可能であるものを除いて、開発元の作者が提供しているビルドおよび移植作業環境を完全に<emphasis role="strong">保全すべき</emphasis>です。例えば、ファイルを省略する理由として MS-DOS でのビルドにしか使われないから、というのは十分な理由にはなりません。同様に、開発元から提供されている <filename>Makefile</filename> を省略すべきではありません。たとえ <filename>debian/rules</filename> が最初にすることが configure スクリプトを実行してそれを上書きすることであったとしても、です。

source: (<emphasis>Rationale:</emphasis> It is common for Debian users who need to build software for non-Debian platforms to fetch the source from a Debian mirror rather than trying to locate a canonical upstream distribution point).
de: (<emphasis>Begründung:</emphasis> Es ist üblich für Debian-Anwender, die Software für nicht-Debian-Plattformen erstellen möchten, die Quellen von einem Debian-Spiegel abzurufen, anstatt den Punkt der ordnungsgemäßen Originaldistribution zu suchen).
fr: (<emphasis>Raison :</emphasis> les utilisateurs Debian ont l'habitude, pour compiler des logiciels sur des systèmes non Debian, de prendre les sources depuis les miroirs Debian plutôt que d'essayer de trouver le dépôt officiel amont) ;
ja: (<emphasis>理由:</emphasis> Debian 以外のプラットフォームのためにソフトウェアをビルドする必要がある Debian ユーザが、開発元の一次配布先を探そうとせずに Debian ミラーからソースを取得する、というのは普通です)。
