Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: We are quite proud of this system, since it has so many possible uses. Independent development groups can use the system for different sub-flavors of Debian, which may or may not really be of general interest (for instance, a flavor of Debian built with <command>gcc</command> bounds checking). It will also enable Debian to recompile entire distributions quickly.
de: Debian ist ziemlich stolz auf dieses System, da es so viele Verwendungsmöglichkeiten gibt. Unabhängige Entwicklergruppen können das System benutzen, um unterschiedliche Untergeschmacksrichtungen von Debian, die von allgemeinem Interesse sein können oder auch nicht (zum Beispiel eine Debian-Geschmacksrichtung, die mit »bounds checking« von <command>gcc</command> erstellt wurde) zu erstellen. Dadurch wird Debian auch in die Lage versetzt, ganze Distributionen schnell neu zu compilieren.
fr: Ce système est une fierté de Debian car il a de nombreux usages potentiels. Il peut être utilisé par des groupes de développeurs indépendants pour créer différentes variantes de Debian d'intérêt général ou non (par exemple, une variante de Debian compilée avec des vérifications de limites (« <literal>bounds checking</literal> ») de <command>gcc</command>). Ce système permettra aussi de recompiler rapidement toute une distribution.
ja: 我々はこのシステムを極めて誇りに思っています。何故ならば、様々な利用方法の可能性があるからです。独立した開発グループは、実際に一般的な用途に合うかどうか分からない異なった別アプローチの Debian にシステムを使うことができます (例えば、<command>gcc</command> の配列境界チェック付きでビルドした Debian など)。そして、Debian がディストリビューション全体を素早く再コンパイルできるようにもなります。

source: The wanna-build team, in charge of the buildds, can be reached at <literal>debian-wb-team@lists.debian.org</literal>. To determine who (wanna-build team, release team) and how (mail, BTS) to contact, refer to <ulink url="&url-wb-team;"></ulink>.
de: Das Wanna-Build-Team, das für Buildds verantwortlich ist, ist unter <literal>debian-wb-team@lists.debian.org</literal> erreichbar. Um festzustellen, wen (Wanna-Build-Team, Release-Team) Sie kontaktieren sollten und wie (E-Mail, BTS), sei auf <ulink url="&url-wb-team;"></ulink> verwiesen.
fr: L'équipe de <systemitem role="package">wanna-build</systemitem>, en charge des empaqueteurs (« <literal>buildd</literal> »), peut être contactée à l'adresse électronique <literal>debian-wb-team@lists.debian.org</literal>. Pour savoir qui (équipe de <systemitem role="package">wanna-build</systemitem>, équipe de publication) et comment (courrier électronique, BTS) contacter, se reporter à <ulink url="&url-wb-team;"></ulink>.
ja: buildd の担当である wanna-build チームには、<literal>debian-wb-team@lists.debian.org</literal> で連絡が取れます。誰 (wanna-build チーム、リリースチーム) に連絡を取るのか、どうやって (メール、BTS) 連絡するのかを決めるには、<ulink url="&url-wb-team;"></ulink> を参照してください。

source: When requesting binNMUs or give-backs (retries after a failed build), please use the format described at <ulink url="&url-release-wb;"/>.
de: Wenn Sie um BinNMUs oder Give-Backs (erneute Versuche nach gescheitertem Build) ersuchen, benutzen Sie bitte das unter <ulink url="&url-release-wb;"/> beschriebene Format.
fr: Lors d'une demande de mise à jour indépendante binaire (<literal>binNMU</literal>) ou de « rendu » (« <literal>give-back</literal> » : nouvel essai suite à une compilation échouée), veuillez utiliser le format décrit en <ulink url="&url-release-wb;"/>.
ja: binNMU や give-back (ビルド失敗後のやり直し) を依頼する時には、<ulink url="&url-release-wb;"/> で記述されている形式を使ってください。

source: When your package is <emphasis>not</emphasis> portable
de: Wenn Ihr Paket <emphasis>nicht</emphasis> portierbar ist
fr: Paquet <emphasis>non</emphasis> portable
ja: あなたのパッケージが移植可能なものでは<emphasis>ない</emphasis>場合

source: Some packages still have issues with building and/or working on some of the architectures supported by Debian, and cannot be ported at all, or not within a reasonable amount of time. An example is a package that is SVGA-specific (only available for <literal>i386</literal> and <literal>amd64</literal>), or uses other hardware-specific features not supported on all architectures.
de: Einige Pakete haben immer noch Probleme mit der Erstellung und/oder Ihrer Funktion auf einigen der von Debian unterstützten Architekturen und können überhaupt nicht oder nicht in einem akzeptablen Zeitraum portiert werden. Ein Beispiel ist ein Paket, das SVGA-spezifisch ist (nur auf <literal>i386</literal> und <literal>amd64</literal> verfügbar) oder andere Hardware-spezifische Funktionen benutzt, die nicht von allen Architekturen unterstützt werden.
fr: Certains paquets ont encore des problèmes pour être construits ou pour fonctionner sur certaines architectures prises en charge par Debian, et ne peuvent pas du tout être portés, ou pas dans un délai raisonnable. Par exemple, un paquet spécifique à SVGA (disponible uniquement sur <literal>i386</literal> et <literal>amd64</literal>), ou qui utilise des fonctionnalités spécifiques au matériel non gérées sur toutes les architectures.
ja: いくつかのパッケージでは、Debian でサポートされているアーキテクチャのうちの幾つかで、構築や動作に問題を抱えており、全く移植できない、あるいは十分な時間内では移植ができないものがあります。例としては、SVGA に特化したパッケージ (<literal>i386</literal> と <literal>amd64</literal> のみで利用可能)や、すべてのアーキテクチャではサポートされていないようなハードウェア固有の機能があります。

source: In order to prevent broken packages from being uploaded to the archive, and wasting buildd time, you need to do a few things:
de: Um zu verhindern, dass kaputte Pakete in das Archiv hochgeladen werden und Buildd-Zeit vergeuden, müssen Sie ein paar Dinge tun:
fr: Pour éviter que des paquets cassés soient envoyés dans l'archive et qu'ils fassent perdre le temps des empaqueteurs (« <literal>buildd</literal> »), vous devez faire plusieurs choses :
ja: 壊れたパッケージがアーカイブにアップロードされたり buildd の時間が無駄に費やされたりするのを防ぐため、幾つかしなければならないことがあります:

source: First, make sure your package <emphasis>does</emphasis> fail to build on architectures that it cannot support. There are a few ways to achieve this. The preferred way is to have a small testsuite during build time that will test the functionality, and fail if it doesn't work. This is a good idea anyway, as this will prevent (some) broken uploads on all architectures, and also will allow the package to build as soon as the required functionality is available.
de: Stellen Sie zuerst sicher, dass das Erstellen Ihres Pakets auf Architekturen, die es nicht unterstützt <emphasis>fehlschlägt</emphasis>. Es gibt mehrere Möglichkeiten dies zu bewirken. Der bevorzugte Weg ist es, während des Erstellens eine kleine Test-Suite zu verwenden, die die Funktionalität prüft und fehlschlägt, wenn es nicht funktioniert. Dies ist sowieso eine gute Idee, da es (einige) kaputte Uploads auf allen Architekturen verhindert und außerdem ermöglicht, das Paket zu erstellen, sobald die benötigte Funktionalität verfügbar ist.
fr: tout d'abord, assurez-vous que votre paquet <emphasis>échoue</emphasis> à la compilation sur les architectures qu'il ne gère pas. Il y a plusieurs façons de faire cela. Le meilleur moyen est d'avoir une petite suite de tests pendant la construction qui vérifiera la fonctionnalité et échouera si cela ne fonctionne pas. C'est de toute façon une bonne idée et empêchera (certains) des envois cassés pour toutes les architectures, cela permettra également au paquet d'être construit dès que la fonctionnalité nécessaire sera disponible.
ja: まず、サポートできないアーキテクチャ上ではパッケージがビルドに<emphasis>失敗する</emphasis>のを確認しておく必要があります。これを行うには幾つかやり方があります。お勧めの方法は構築時に機能をテストする小さなテストスイートを用意して、動かない場合に失敗するようにすることです。これは、全てのアーキテクチャ上で、壊れたものをアップロードするのを防ぎ、必要な機能が動作するようになればパッケージがビルドできるようになる、良い考えです。

source: Additionally, if you believe the list of supported architectures is pretty constant, you should change <literal>any</literal> to a list of supported architectures in <filename>debian/control</filename>. This way, the build will fail also, and indicate this to a human reader without actually trying.
de: Zusätzlich sollten Sie in <filename>debian/control</filename> <literal>any</literal> auf eine Liste der unterstützten Architekturen ändern, falls Sie glauben, die Liste der unterstützten Architekturen sei ziemlich gleichbleibend. Auf diese Art wird das Erstellen ebenfalls fehlschlagen und dies einem menschlichen Leser ohne tatsächliche Versuche anzeigen.
fr: De plus, si vous croyez que la liste des architectures gérées est plutôt stable, vous devriez changer <literal>any</literal> en une liste des architectures gérées dans le fichier <filename>debian/control</filename>. Ainsi, la construction échouera également et l'indiquera à un lecteur humain sans vraiment essayer ;
ja: さらに、サポートしているアーキテクチャ一覧が一定量であると信ずるのであれば、<filename>debian/control</filename> 内で <literal>any</literal> からサポートしているアーキテクチャの一覧に変更するべきです。この方法であれば、ビルドが同様に失敗するようになるのに加え、実際に試すことなく人間である読み手にサポートしているアーキテクチャが分かるようにできます。

source: In order to prevent autobuilders from needlessly trying to build your package, it must be included in <filename>Packages-arch-specific</filename>, a list used by the <command>wanna-build</command> script. The current version is available as <ulink url="&url-buildd-p-a-s;"/>; please see the top of the file for whom to contact for changes.
de: Um zu verhindern, dass Autobuilder unnötig versuchen Ihr Paket zu erstellen, muss es in <filename>Packages-arch-specific</filename> enthalten sein, einer Liste, die vom <command>wanna-build</command>-Skript benutzt wird. Die aktuelle Version ist unter <ulink url="&url-buildd-p-a-s;"/> verfügbar. Bitte lesen am Anfang der Datei, wer wegen der Änderungen kontaktiert wird.
fr: pour empêcher les compilateurs automatiques de tenter sans raison de construire votre paquet, il doit être inclus dans <filename>Packages-arch-specific</filename>, une liste utilisée par le script <command>wanna-build</command>. La version actuelle est disponible en <ulink url="&url-buildd-p-a-s;"/> ; veuillez consulter le début du fichier pour savoir qui contacter pour le modifier.
ja: autobuilder が必要もなくパッケージをビルドしようとしないように、<command>wanna-build</command> スクリプトが使うリストである <filename>Packages-arch-specific</filename> に追加しておく必要があります。現在のバージョンは <ulink url="&url-buildd-p-a-s;"/> から入手できます: 変更依頼をする相手はファイルの一番上を参照してください。

source: Please note that it is insufficient to only add your package to <filename>Packages-arch-specific</filename> without making it fail to build on unsupported architectures: A porter or any other person trying to build your package might accidently upload it without noticing it doesn't work. If in the past some binary packages were uploaded on unsupported architectures, request their removal by filing a bug against <systemitem role="package">ftp.debian.org</systemitem>.
de: Bitte beachten Sie, dass es nicht ausreicht, Ihr Paket nur zu <filename>Packages-arch-specific</filename> hinzuzufügen ohne dafür zu sorgen, dass das Erstellen auf nicht unterstützten Architekturen fehlschlägt: Ein Portierer oder jemand anderes, der versucht Ihr Paket zu erstellen, könnte Ihr Paket fälschlicherweise hochladen ohne zu bemerken, dass es nicht funktioniert. Wenn in der Vergangenheit einige Binärpakete auf nicht unterstützte Architekturen hochgeladen wurden, bitten Sie um Ihre Entfernung, indem Sie einen Fehlerbericht gegen <systemitem role="package">ftp.debian.org</systemitem> einreichen.
fr: Il ne suffit pas d'ajouter votre paquet à <filename>Packages-arch-specific</filename> sans le faire échouer lors de compilation sur les architectures non gérées : un porteur ou toute autre personne essayant de construire votre paquet peut accidentellement l'envoyer sans remarquer qu'il ne fonctionne pas. Si par le passé, certains paquets binaires ont été envoyés pour des architectures non gérées, demandez leur suppression en remplissant un bogue sur <systemitem role="package">ftp.debian.org</systemitem>.
ja: サポートしていないアーキテクチャ上でビルドが失敗するようにせずに、パッケージを単に <filename>Packages-arch-specific</filename> に付け加えるだけでは不十分であることに注意してください: 移植作業者、あるいはあなたのパッケージをビルドしようとしている他の人は、それが動かないのに気づかないで誤ってアップロードするかもしれません。過去に、サポートされてないアーキテクチャ上にバイナリパッケージがアップロードされてしまった場合、削除依頼は <systemitem role="package">ftp.debian.org</systemitem> に対するバグを登録することによって行われました。

source: Marking non-free packages as auto-buildable
de: Unfreie Pakete als automatisch erstellbar kennzeichnen
fr: Paquets non libres pouvant être automatiquement construits
ja: non-free のパッケージを auto-build 可能であるとマークする

source: By default packages from the <literal>non-free</literal> section are not built by the autobuilder network (mostly because the license of the packages could disapprove). To enable a package to be build you need to perform the following steps:
de: Standardmäßig werden Pakete aus dem Bereich <literal>non-free</literal> nicht durch das Autobuilder-Netzwerk gebaut (meistens, weil die Lizenz der Pakete dem entgegen stehen könnte). Um zu aktivieren, dass ein Paket gebaut wird, müssen Sie die folgenden Schritte durchführen:
fr: Par défaut, les paquet de la section <literal>non-free</literal> ne sont pas construits sur le réseau d'empaqueteurs automatiques (surtout parce que la licence des paquets pourrait l'interdire). Pour permettre à un paquet d'être construit, vous devez suivre les étapes suivantes :
ja: <literal>non-free</literal> セクションのパッケージは、デフォルトでは autobuilder ネットワークではビルドされません (多くの場合は、パッケージのライセンスによって許可されていないためです)。パッケージをビルドできるようにするには、以下の手順を踏む必要があります:

source: Check whether it is legally allowed and technically possible to auto-build the package;
de: Prüfen, ob es rechtlich erlaubt und technisch möglich ist, das Paket automatisch zu bauen;
fr: vérifier s'il est légalement permis et techniquement possible de construire automatiquement le paquet ;
ja: 法的に許可されているか、技術的にパッケージが auto-build 可能かどうかを確認する;

source: Add <literal>XS-Autobuild: yes</literal> into the header part of <filename>debian/control</filename>;
de: <literal>XS-Autobuild: yes</literal> zu den Kopfzeilen von <filename>debian/control</filename> hinzufügen;
fr: ajouter <literal>XS-Autobuild: yes</literal> dans la partie en-tête de <filename>debian/control</filename> ;
ja: <filename>debian/control</filename> のヘッダ部分に <literal>XS-Autobuild: yes</literal> を追加する;

source: Send an email to &email-nonfree-release; and explain why the package can legitimately and technically be auto-built.
de: eine E-Mail an &email-nonfree-release; senden und erklären, warum das Paket rechtlich und technisch automatisch gebaut werden kann.
fr: envoyer un courrier à &email-nonfree-release; et expliquer pourquoi le paquet peut légalement et automatiquement être construit.
ja: メールを &email-nonfree-release; に送り、何故パッケージが合法的、かつ技術的に auto-build できるものなのかを説明する

source: Non-Maintainer Uploads (NMUs)
fr: Mises à jour indépendantes (<literal>NMU</literal>)
ja: Non-Maintainer Upload (NMU)

source: Every package has one or more maintainers. Normally, these are the people who work on and upload new versions of the package. In some situations, it is useful that other developers can upload a new version as well, for example if they want to fix a bug in a package they don't maintain, when the maintainer needs help to respond to issues. Such uploads are called <emphasis>Non-Maintainer Uploads (NMU)</emphasis>.
de: Jedes Paket hat einen oder mehrere Betreuer. Normalerweise sind das Leute, die daran arbeiten und neue Versionen des Pakets hochladen. In einigen Situationen ist es nützlich, dass auch andere Entwickler neue Versionen hochladen können, zum Beispiel, falls sie einen Fehler in einem Paket beheben möchten, das sie nicht betreuen, wenn der Betreuer Hilfe benötigt, um auf Probleme zu antworten. Solche Uploads werden <emphasis>Non-Maintainer Uploads (NMU)</emphasis> genannt.
fr: Chaque paquet est géré par un ou plusieurs responsables. Normalement, ce sont eux qui travaillent sur les paquets et s'occupent de les mettre à jour. Dans certains cas, il est utile que d'autres développeurs puissent aussi envoyer une nouvelle version, par exemple pour résoudre un bogue dans un paquet dont ils ne sont pas responsables, lorsque le responsable a besoin d'aide pour réagir aux problèmes. De tels envois sont appelés <emphasis>mises à jour indépendantes (« <literal>Non-Maintainer Uploads</literal> » ou <literal>NMU</literal>)</emphasis>.
ja: すべてのパッケージには最低一人のメンテナがいます。通常、この人達がパッケージに対して作業をし、新しいバージョンをアップロードします。時折、他の開発者らが新しいバージョンをアップロードできると便利な場合があります。例えば、彼らがメンテナンスしていないパッケージにあるバグを修正したいが、メンテナが問題に対応するのには助けが必要な場合です。このようなアップロードは <emphasis>Non-Maintainer Upload (NMU)</emphasis> と呼ばれます。

source: When and how to do an NMU
de: Wann und wie ein NMU durchgeführt wird
fr: NMU : quand et comment
ja: いつ、どうやって NMU を行うか

source: Before doing an NMU, consider the following questions:
de: Beachten Sie die folgenden Fragen, bevor Sie einen NMU durchführen:
fr: Avant de procéder à une NMU, veuillez prendre en considération les questions suivantes.
ja: NMU を行う前に、以下の質問について考えてください:

source: Does your NMU really fix bugs? Fixing cosmetic issues or changing the packaging style in NMUs is discouraged.
de: Behebt Ihr NMU wirklich Fehler? Kosmetische Probleme zu beheben oder den Paketierungsstil in NMUs zu ändern ist unerwünscht.
fr: Votre NMU corrige-t-elle vraiment des bogues ? La correction de problème superficiel ou la modification du mode d'empaquetage lors d'une NMU est déconseillée.
ja: NMU は本当にバグを修正しますか? NMU では、些細な問題の修正やパッケージ方式の変更は推奨されません。

source: Did you give enough time to the maintainer? When was the bug reported to the BTS? Being busy for a week or two isn't unusual. Is the bug so severe that it needs to be fixed right now, or can it wait a few more days?
de: Haben Sie dem Paketbetreuer genug Zeit gegeben? Wann wurde der Fehler an das BTS gemeldet? Es ist nicht unüblich, für eine oder zwei Wochen beschäftigt zu sein. Ist der Fehler so schwer, dass er jetzt sofort behoben werden muss oder kann er noch ein paar Tage warten?
fr: Avez-vous laissé suffisamment de temps au responsable ? Quand le bogue a-t-il été reporté au BTS ? Être occupé pendant une semaine ou deux n'est pas exceptionnel. Le bogue est-il si grave qu'il doive être corrigé immédiatement, ou cela peut-il attendre encore quelques jours ?
ja: メンテナに十分な時間を与えましたか? BTS にバグが報告されたのは何時ですか? 一、二週間忙しいことはあり得ないことでは無いです。そのバグはすぐに修正しなければならないほど重大ですか? それとも、あと数日待てるものですか?

source: How confident are you about your changes? Please remember the Hippocratic Oath: "Above all, do no harm." It is better to leave a package with an open grave bug than applying a non-functional patch, or one that hides the bug instead of resolving it. If you are not 100% sure of what you did, it might be a good idea to seek advice from others. Remember that if you break something in your NMU, many people will be very unhappy about it.
de: Wie überzeugt sind Sie von Ihren Änderungen? Bitte erinnern Sie sich an den hippokratischen Eid: »Schaden Sie vor allem nicht«. Es ist besser, ein Paket mit einem offenen schweren Fehler zu belassen, als ein nicht funktionierendes Patch darauf anzuwenden oder eins, das den Fehler versteckt, anstatt Ihn zu beheben. Falls Sie nicht 100% sicher sind, was Sie getan haben, könnte es eine gute Idee sein, den Rat anderer zu suchen. Vergessen Sie nicht, das viele Leute sauer sind, falls Ihr NMU etwas kaputt macht.
fr: Quelle confiance avez-vous dans vos modifications ? Souvenez-vous du serment d'Hippocrate : « je m'abstiendrai de tout mal ». Il est préférable de laisser un paquet avec un bogue ouvert grave plutôt qu'appliquer un correctif non fonctionnel ou un correctif qui cache le bogue sans le résoudre. Si vous n'êtes pas absolument sûr de vous, il pourrait être judicieux de chercher des conseils autour de vous. Rappelez-vous que si quelque chose est cassé par votre NMU, de nombreuses personnes seront mécontentes.
ja: その変更にどれくらい自信がありますか? ヒポクラテスの誓いを思い出してください: 「何よりも、害を及ぼすことなかれ」 動かないパッチを当てるよりもパッケージの重大なバグをそのままオープンな状態にしておく方が良いですし、パッチによってバグを解決するのではなく隠してしまうかもしれません。自分が 100% 何をしたのか分かっていないのであれば、他の人からアドバイスをもらうのも良い考えでしょう。NMU で何かを壊したのであれば、多くの人がとても不幸になるであろうことを覚えておいてください。

source: Have you clearly expressed your intention to NMU, at least in the BTS? It is also a good idea to try to contact the maintainer by other means (private email, IRC).
de: Haben Sie Ihre Absicht, einen NMU durchzuführen, zumindest im BTS klar ausgedrückt? Es ist außerdem ratsam zu versuchen, den Paketbetreuer auf andere Arten zu kontaktieren (private E-Mail, IRC).
fr: Avez-vous clairement manifesté votre intention de procéder à une NMU, au moins dans le BTS ? C'est aussi une bonne idée d'essayer de contacter le responsable par d'autres moyen (courrier personnel, IRC).
ja: 少なくとも BTS で、NMU するのを明確に表明しましたか? 他の手段 (プライベートなメール、IRC) でメンテナに連絡をとるのも良い考えです。

source: If the maintainer is usually active and responsive, have you tried to contact them? In general it should be considered preferable that maintainers take care of an issue themselves and that they are given the chance to review and correct your patch, because they can be expected to be more aware of potential issues which an NMUer might miss. It is often a better use of everyone's time if the maintainer is given an opportunity to upload a fix on their own.
de: Haben Sie versucht den Betreuer zu kontaktieren, falls er normalerweise aktiv und zugänglich ist? Im Allgemeinen sollte es als wünschenswert erachtet werden, dass sich Betreuer selbst um ein Problem kümmern und dass sie die Möglichkeit haben, Ihr Patch zu überprüfen und zu korrigieren, da sie potentielle Probleme kennen sollten, die demjenigen fehlen könnten, der den NMU durchführt. Die Zeit wird meist besser investiert, wenn dem Betreuer die Gelegenheit gegeben wird, eine Fehlerbehebung selbst hochzuladen.
fr: Si le responsable est habituellement actif et réactif, avez-vous tenté de le contacter ? En général il est préférable que le responsable prenne en charge lui-même un problème et qu'il lui soit offert une chance d'examiner et corriger votre correctif, car il est censé être mieux placé pour découvrir d'éventuels problèmes que vous pourriez rater. C'est souvent un gain de temps pour tout le monde si le responsable a la possibilité d'envoyer lui même une correction.
ja: メンテナがいつも活動的で応答してくれる場合、彼に連絡を取ろうとしましたか? 大概の場合、メンテナ自身が問題に対応して、あなたのパッチをレビューする機会が与えられる方が好ましいと思われます。これは、NMU をする人が見落としているだろう潜在的な問題にメンテナは気付くことができるからです。大抵、メンテナが自分でアップロードする機会が与えられる方が、皆の時間を使うよりも良いやり方です。

source: When doing an NMU, you must first make sure that your intention to NMU is clear. Then, you must send a patch with the differences between the current package and your proposed NMU to the BTS. The <command>nmudiff</command> script in the <systemitem role="package">devscripts</systemitem> package might be helpful.
de: Wenn Sie einen NMU durchführen, sollten Sie zuerst dafür sorgen, dass Ihre Absicht einen NMU durchzuführen klar ist. Dann müssen Sie ein Patch mit den Unterschieden zwischen dem aktuellen Paket und dem geplanten NMU an das BTS senden. Das Skript <command>nmudiff</command> im Paket <systemitem role="package">devscripts</systemitem> könnte hilfreich sein.
fr: Lors d'une NMU, vous devez d'abord vous assurer que votre intention est sans ambiguïté. Ensuite, vous devez envoyer un correctif contenant les différences entre le paquet actuel et votre proposition de NMU au BTS. Le script <command>nmudiff</command> du paquet <systemitem role="package">devscripts</systemitem> pourrait être utile.
ja: NMU をする際には、まず NMU をする意図を明確にしておかねばなりません。それから、BTS へ現在のパッケージと提案する NMU との差分をパッチとして送付する必要があります。<systemitem role="package">devscripts</systemitem> パッケージにある <command>nmudiff</command> スクリプトが役に立つでしょう。
