Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: While changes in <literal>stable</literal> are discouraged, they are possible. Whenever a security problem is reported, you should collaborate with the security team to provide a fixed version (see <xref linkend="bug-security"/>). When bugs of severity important (or more) are reported against the <literal>stable</literal> version of your packages, you should consider providing a targeted fix. You can ask the <literal>stable</literal> release team whether they would accept such an update and then prepare a <literal>stable</literal> upload (see <xref linkend="upload-stable"/>).
de: Obwohl von Änderungen in <literal>stable</literal> abgeraten wird, sind diese dennoch möglich. Immer wenn ein Sicherheitsproblem gemeldet wird, sollten Sie mit dem Sicherheits-Team zusammenarbeiten, um eine reparierte Version bereitzustellen (siehe <xref linkend="bug-security"/>). Wenn Fehler des Schweregrads »important« (oder höher) gemeldet werden, sollten Sie in Betracht ziehen, eine gezielte Fehlerbehebung zur Verfügung zu stellen. Sie können das <literal>stable</literal>-Release-Team fragen, ob es eine solche Aktualisierung akzeptieren würde und dann einen <literal>stable</literal>-Upload vorbereiten (siehe <xref linkend="upload-stable"/>).
fr: Même si les modifications dans <literal>stable</literal> sont déconseillées, elles sont possibles. Chaque fois qu'un problème de sécurité est signalé, vous devriez collaborer avec l'équipe en charge de la sécurité pour fournir une version corrigée (consultez <xref linkend="bug-security"/>). Quand des bogues de sévérité <literal>important</literal> (ou plus) sont soumis sur la version <literal>stable</literal> de vos paquets, vous devriez envisager la possibilité de fournir une correction spécifique. Vous pouvez interroger l'équipe en charge de la publication <literal>stable</literal> pour savoir si elle accepterait une telle mise à jour puis préparer un envoi vers <literal>stable</literal> (consultez <xref linkend="upload-stable"/>).
ja: <literal>安定版 (stable)</literal> への変更は推奨されてはいませんが、可能です。セキュリティ問題が報告された時はいつでも、セキュリティチームと修正版を提供するように協力する必要があります (<xref linkend="bug-security"/> 参照)。important (あるいはそれ以上) な重要度のバグが<literal>安定版 (stable)</literal> のバージョンのパッケージに報告されたら、対象のとなる修正の提供を検討する必要があります。<literal>安定版 (stable)</literal> リリースマネージャに、そのような更新を受け入れられるかどうかを尋ね、それから<literal>安定版 (stable)</literal> のアップロードを準備するなどができます (<xref linkend="upload-stable"/> 参照)。

source: Manage release-critical bugs
de: Verwalten release-kritischer Fehler
fr: Gestion des bogues critiques pour la publication
ja: リリースクリティカルバグに対処する

source: Generally you should deal with bug reports on your packages as described in <xref linkend="bug-handling"/>. However, there's a special category of bugs that you need to take care of — the so-called release-critical bugs (RC bugs). All bug reports that have severity <literal>critical</literal>, <literal>grave</literal> or <literal>serious</literal> make the package unsuitable for inclusion in the next <literal>stable</literal> release. They can thus delay the Debian release (when they affect a package in <literal>testing</literal>) or block migrations to <literal>testing</literal> (when they only affect the package in <literal>unstable</literal>). In the worst scenario, they will lead to the package's removal. That's why these bugs need to be corrected as quickly as possible.
de: Sie sollten Fehlerberichte zu Ihren Paketen generell so erledigen, wie es in <xref linkend="bug-handling"/> beschrieben wird. Es gibt jedoch eine spezielle Fehlerkategorie, auf die Sie besonders Acht geben sollten – sogenannte release-kritische Fehler (release critical bugs/RC-Fehler). Alle Fehlerberichte, mit den Schweregrad <literal>critical</literal>, <literal>grave</literal> oder <literal>serious</literal> machen das Paket ungeeignet für eine Aufnahme in die nächste <literal>stable</literal>-Veröffentlichung. Sie können daher die Debian-Veröffentlichung verzögern (wenn sie ein Paket in <literal>testing</literal> beeinflussen) oder Migrationen nach <literal>testing</literal> blockieren (wenn sie nur ein Paket in <literal>unstable</literal> beeinflussen). Im schlimmsten Fall führen Sie zum Entfernen des Pakets. Daher müssen diese Fehler so schnell wie möglich behoben werden.
fr: Habituellement, vous devriez traiter les rapports de bogue sur vos paquets tel que cela est décrit en <xref linkend="bug-handling"/>. Cependant, une catégorie spéciale de bogues nécessite particulièrement votre attention : les bogues critiques pour la publication (« <literal>release-critical</literal> » ou <literal>RC</literal>). Tous les rapports de bogue de gravité <literal>critical</literal>, <literal>grave</literal> ou <literal>serious</literal> rendent le paquet inapproprié pour être inclus dans la prochaine version <literal>stable</literal>. Ils peuvent donc retarder la publication de Debian (quand ils concernent un paquet de <literal>testing</literal>) ou bloquer des migrations vers <literal>testing</literal> (quand ils concernent seulement le paquet d'<literal>unstable</literal>). Au pire, ils pourraient conduire à la suppression du paquet. C'est pourquoi ces bogues doivent être corrigés au plus tôt.
ja: 大抵の場合、パッケージに対するバグ報告については <xref linkend="bug-handling"/>で記述されているように対応する必要があります。しかしながら、注意を必要とする特別なカテゴリのバグがあります—リリースクリティカルバグ (RC bug) と呼ばれるものです。<literal>critical</literal>、<literal>grave</literal>、<literal>serious</literal> の重要度が付けられている全てのバグ報告によって、そのパッケージは次の<literal>安定版 (stable)</literal> リリースに含めるのには適切ではないとされます。そのため、(<literal>テスト版 (testing)</literal> にあるパッケージに影響する場合に) Debian のリリースを遅らせたり、(<literal>不安定版 (unstable)</literal> にあるパッケージにのみ影響する場合に) <literal>テスト版 (testing)</literal> への移行をブロックする可能性があります。最悪の場合は、パッケージの削除を招きます。これが RC バグを可能な限り素早く修正する必要がある理由です。

source: If, for any reason, you aren't able fix an RC bug in a package of yours within 2 weeks (for example due to time constraints, or because it's difficult to fix), you should mention it clearly in the bug report and you should tag the bug <literal>help</literal> to invite other volunteers to chime in. Be aware that RC bugs are frequently the targets of Non-Maintainer Uploads (see <xref linkend="nmu"/>) because they can block the <literal>testing</literal> migration of many packages.
de: Falls Sie aus irgend einem Grund nicht in der Lage sind, den Fehler in einem Paket innerhalb von zwei Wochen zu beheben (zum Beispiel aus Termingründen oder weil er schwer zu beheben ist), sollten Sie es klar im Fehlerbericht vermerken und den Fahler mit <literal>help</literal> kennzeichnen, um Freiwillige einzuladen, sich einzuschalten. Seien Sie sich bewusst, dass release-kritische Fehler oft das Ziel von Uploads durch Nicht-Betreuer (»Non-Maintainer Uploads«, siehe <xref linkend="nmu"/>) sind, da sie die Migration vieler Pakete nach <literal>testing</literal> blockieren können.
fr: Si pour une raison ou une autre, vous ne pouvez pas corriger un bogue critique pour la publication dans un de vos paquets en moins de deux semaines (par exemple à cause de contraintes de temps, ou parce que c'est compliqué à corriger) vous devriez le signaler clairement dans le rapport de bogue en l'étiquetant <literal>help</literal> pour encourager d'autres volontaires à s'impliquer. Sachez que les bogues critiques pour la publication sont souvent les cibles de mises à jour indépendantes (consultez <xref linkend="nmu"/>) car ils peuvent bloquer la migration vers <literal>testing</literal> de plusieurs paquets.
ja: もし、何らかの理由で 2 週間以内に RC バグを修正できない場合 (例えば時間の制約上、あるいは修正が難しいなど)、明示的にバグ報告にそれを述べて、他のボランティアを招き入れて参加してもらうためにバグに <literal>help</literal> タグを打ってください。大量のパッケージが<literal>テスト版 (testing)</literal> へ移行するのを妨げることがあるので、RC バグは頻繁に Non-Maintainer Upload の対象になることに注意してください (<xref linkend="nmu"/> 参照)。

source: Lack of attention to RC bugs is often interpreted by the QA team as a sign that the maintainer has disappeared without properly orphaning their package. The MIA team might also get involved, which could result in your packages being orphaned (see <xref linkend="mia-qa" />).
de: Mangel an Aufmerksamkeit gegenüber release-kritischen Fehler wird vom Release-Team oft als Zeichen interpretiert, dass der Betreuer verschwunden ist, ohne sein Paket ordentlich zu verwaisen. Das MIA-Team könnte außerdem eingeschaltet werden, was dazu führen könnte, dass Ihre Pakete verwaist werden (siehe <xref linkend="mia-qa"/>).
fr: Un manque d'attention aux bogues critiques pour la publication est souvent considéré par l'équipe d'assurance qualité comme un signe de disparition d'un responsable n'ayant pas abandonné correctement son paquet. L'équipe MIA pourrait aussi s'impliquer, avec comme éventuelle conséquence l'abandon de vos paquets (consultez <xref linkend="mia-qa" />).
ja: RC バグへの関心の無さは、しばしば QA チームによって、メンテナが正しくパッケージをみなしご化せずに消えてしまったサインとして判断されます。MIA チームが関わることもあり、その場合はパッケージがみなしご化されます (<xref linkend="mia-qa" /> 参照)。

source: Coordination with upstream developers
de: Abstimmung mit Originalautoren
fr: Coordination avec les développeurs amont
ja: 開発元/上流 (upstream) の開発者との調整

source: A big part of your job as Debian maintainer will be to stay in contact with the upstream developers. Debian users will sometimes report bugs that are not specific to Debian to our bug tracking system. You have to forward these bug reports to the upstream developers so that they can be fixed in a future upstream release.
de: Ein Großteil Ihrer Arbeit als Debian-Betreuer wird darin bestehen, mit den Autoren des Programms Kontakt zu halten. Manchmal melden Debian-Anwender Fehler an die Debian-Fehlerdatenbank, die nicht Debian-spezifisch sind. Sie müssen diese Fehler an die Programmautoren weiterleiten, so dass die Programmautoren sie in einer zukünftigen Veröffentlichung beheben können.
fr: Une grande part du travail de responsable Debian sera de rester en contact avec les développeurs amont. Parfois, les utilisateurs signalent des bogues qui ne sont pas spécifiques à Debian. Vous devez transmettre ces rapports de bogue aux développeurs amont pour qu'ils soient corrigés dans les versions suivantes.
ja: Debian メンテナとしての仕事のうちで重要な位置を占めるのは、開発元/上流 (upstream) の開発者との窓口であることです。Debian ユーザは、時折バグ報告システムに Debian 特有ではないバグを報告する事があります。Debian メンテナは、いつか上流のリリースで修正できるようにする為、このようなバグ報告を上流の開発者に転送しなくてはなりません。

source: While it's not your job to fix non-Debian specific bugs, you may freely do so if you're able. When you make such fixes, be sure to pass them on to the upstream maintainers as well. Debian users and developers will sometimes submit patches to fix upstream bugs — you should evaluate and forward these patches upstream.
de: Obwohl es nicht Ihre Arbeit ist, nicht Debian-spezifische Fehler zu beheben, können Sie dies dennoch tun, wenn Sie dazu in der Lage sind. Wenn Sie solche Fehler beheben, stellen Sie sicher, dass Sie ihre Korrekturen auch an die ursprünglichen Betreuer weiterleiten. Debian-Anwender und -Entwickler werden manchmal Patchs schicken, um Fehler im Ursprungsprogramm zu beheben – Sie sollten diese Patchs auswerten und an die ursprünglichen Autoren weiterleiten.
fr: Bien qu'il ne soit pas de votre responsabilité de corriger les bogues non spécifiques à Debian, vous pouvez le faire si vous en êtes capable. Quand vous faites de telles corrections, assurez-vous de les envoyer également au développeur amont. Les utilisateurs et responsables Debian proposent souvent des correctifs pour corriger des bogues amont, il vous faudra alors évaluer ce correctif puis le transmettre aux développeurs amont.
ja: Debian 固有ではないバグの修正はあなたの義務ではないとはいえ、できるなら遠慮なく修正してください。そのような修正を行った際は、上流の開発者にも送ってください。時折 Debian ユーザ／開発者が上流のバグを修正するパッチを送ってくる事があります。その場合は、あなたはパッチを確認して上流へ転送する必要があります。

source: If you need to modify the upstream sources in order to build a policy compliant package, then you should propose a nice fix to the upstream developers which can be included there, so that you won't have to modify the sources of the next upstream version. Whatever changes you need, always try not to fork from the upstream sources.
de: Falls Sie die ursprünglichen Quellen verändern müssen, um ein den Richtlinien entsprechendes Paket zu erstellen, dann sollten Sie freundlich eine Korrektur vorschlagen, die dort eingefügt werden kann, so dass Sie die Quellen bei der nächsten Version der Urprungsautoren nicht ändern müssen. Ganz gleich, welche Änderungen sie möchten – versuchen Sie ein Verzweigen von den ursprünglichen Quellen zu vermeiden.
fr: Si vous avez besoin de modifier les sources d'un logiciel pour fabriquer un paquet conforme à la Charte Debian, vous devriez proposer un correctif aux développeurs amont pour qu'il soit inclus dans leur version. Ainsi, vous n'aurez plus besoin de modifier les sources lors des mises à jour amont suivantes. Quels que soient les changements dont vous avez besoin, il faut toujours essayer de rester dans la lignée des sources amont.
ja: ポリシーに準拠したパッケージをビルドするために上流のソースに手を入れる必要がある場合、以降の上流でのリリースにおいて手を入れなくても済むために、ここで含まれる修正を上流の開発者にとって良い形で提案する必要があります。必要な変更が何であれ、上流のソースからフォークしないように常に試みてください。

source: If you find that the upstream developers are or become hostile towards Debian or the free software community, you may want to re-consider the need to include the software in Debian. Sometimes the social cost to the Debian community is not worth the benefits the software may bring.
de: Wenn Sie der Ansicht sind, dass die ursprünglichen Entwickler Debian oder der Gemeinschaft rund um freie Software ablehnend gegenüber stehen, könnten Sie es sich nochmal überlegen, ob Sie die Software in Debian einbringen möchten. Manchmal sind es die gesellschaftlichen Kosten höher, als der Gewinn, den die Software mitbringt.
fr: Si vous estimez que les développeurs amonts sont ou deviennent hostiles envers Debian ou la communauté libre, vous pouvez vouloir reconsidérer le besoin d'inclure le logiciel dans Debian. Parfois, le coût social à la communauté Debian ne vaut pas le bénéfice que le logiciel peut apporter.
ja: 開発元の開発者らが Debian やフリーソフトウェアコミュニティに対して敵対的である、あるいは敵対的になってきているのを見つけた場合は、ソフトウェアを Debian に含める必要があるかを再考しなければならなくなるでしょう。時折 Debian コミュニティに対する社会的なコストは、そのソフトウェアがもたらすであろう利益に見合わない場合があります。

source: Administrative Duties
de: Verwaltungspflichten
fr: Devoirs administratifs
ja: 管理者的な責務

source: A project of the size of Debian relies on some administrative infrastructure to keep track of everything. As a project member, you have some duties to ensure everything keeps running smoothly.
de: Ein Projekt der Größe von Debian beruht auf einer Verwaltungsinfrastruktur, um über alles den Überblick zu behalten. Als Projektmitglied haben Sie einige Pflichten, um sicherzustellen, dass alles glatt läuft.
fr: Un projet de la taille de Debian repose sur certaines structures administratives pour garder une trace de tout. En tant que membre du projet, vous avez quelques devoirs pour veiller à ce que tout se déroule sans problème.
ja: Debian のような大きさのプロジェクトは、あらゆる事を追いかけられる管理者用のインフラに依っています。プロジェクトメンバーとして、あらゆる物事が滞り無く進むように、あなたにはいくつかの義務があります。

source: Maintaining your Debian information
de: Verwaltung Ihrer Debian-Informationen
fr: Mise à jour des renseignements auprès de Debian
ja: あなたの Debian に関する情報をメンテナンスする

source: There's a LDAP database containing information about Debian developers at <ulink url="&url-debian-db;"></ulink>. You should enter your information there and update it as it changes. Most notably, make sure that the address where your debian.org email gets forwarded to is always up to date, as well as the address where you get your debian-private subscription if you choose to subscribe there.
de: Es gibt unter <ulink url="&url-debian-db;"></ulink> eine LDAP-Datenbank, die Informationen über Debian-Entwickler enthält. Sie sollten Ihre Informationen dort eintragen und bei Änderungen aktualisieren. Stellen Sie insbesondere sicher, dass Ihre Weiterleitungsadresse für Ihre debian.org-E-Mails immer aktuell ist. Das gilt auch für die Adresse, zu der Ihre »debian-private«-E-Mails versendet werden, wenn Sie sich auch dort angemeldet haben.
fr: Une base de données LDAP contient des informations sur les développeurs Debian en <ulink url="&url-debian-db;"></ulink>. Vous devriez y entrer vos informations et les mettre à jour quand elles changent. Le plus important est de vous assurer que l'adresse vers laquelle est renvoyée le courrier à destination de votre adresse debian.org est toujours à jour, de même que l'adresse à laquelle vous recevez votre abonnement à debian-private si vous choisissez d'être abonné à cette liste.
ja: Debian 開発者に関する情報が含まれた LDAP データベースが <ulink url="&url-debian-db;"></ulink> にあります。ここに情報を入力して、情報に変更があった際に更新する必要があります。特に、あなたの debian.org アドレス宛メールの転送先アドレスが常に最新になっているのを必ず確認してください。debian-private の購読をここで設定した場合、そのメールを受け取るアドレスについても同様です。

source: For more information about the database, please see <xref linkend="devel-db"/>.
de: Um weitere Informationen über die Datenbank zu erhalten, lesen Sie bitte <xref linkend="devel-db"/>.
fr: Pour plus d'informations sur cette base de données, veuillez consulter <xref linkend="devel-db"/>.
ja: データベースについての詳細は <xref linkend="devel-db"/> を参照してください。

source: Maintaining your public key
de: Verwalten Ihres öffentlichen Schlüssels
fr: Gestion de clé publique
ja: 公開鍵をメンテナンスする

source: Be very careful with your private keys. Do not place them on any public servers or multiuser machines, such as the Debian servers (see <xref linkend="server-machines"/>). Back your keys up; keep a copy offline. Read the documentation that comes with your software; read the <ulink url="&url-pgp-faq;">PGP FAQ</ulink>.
de: Gehen Sie sehr vorsichtig mit Ihren privaten Schlüsseln um. Legen Sie sie nicht auf öffentlichen Servern oder Maschinen mit mehreren Benutzern ab, wie den Debian-Servern (siehe <xref linkend="server-machines"/>). Sichern Sie Ihre Schlüssel. Behalten Sie eine Kopie offline. Lesen Sie die Dokumentation, die Ihrer Software beiliegt. Lesen Sie die <ulink url="&url-pgp-faq;">PGP-FAQ</ulink>.
fr: Soyez très vigilant en utilisant votre clé privée. Ne la placez pas sur un serveur public ou sur des machines multi-utilisateurs telles que les serveurs Debian (voir <xref linkend="server-machines"/>). Sauvegardez vos clés et gardez-en une copie hors connexion. Lisez la documentation fournie avec votre logiciel et la <ulink url="&url-pgp-faq;">FAQ PGP</ulink>.
ja: 秘密鍵の取扱いには十二分に注意してください。Debian サーバ (<xref linkend="server-machines"/> 参照) のような公開サーバや複数のユーザがいるマシンには置かないようにしてください。鍵をバックアップして、コピーはオフラインな場所に置きましょう。ソフトウェアの使い方については付属のドキュメントを参照してください。<ulink url="&url-pgp-faq;">PGP FAQ</ulink> を読みましょう。

source: You need to ensure not only that your key is secure against being stolen, but also that it is secure against being lost. Generate and make a copy (best also in paper form) of your revocation certificate; this is needed if your key is lost.
de: Sie müssen nicht nur dafür sorgen, dass Ihr Schlüssel sicher vor Diebstahl ist, sondern auch, dass er nicht verloren geht. Generieren Sie Ihr Widerrufs-Zertifikat und erstellen Sie eine Kopie davon (am besten in Papierform). Dies wird benötigt, wenn Sie Ihren Schlüssel verloren haben.
fr: Assurez-vous que votre clé est non seulement à l'abri des vols, mais aussi d'une perte. Générez et faites une copie (c'est même mieux sur papier) de votre certificat de révocation ; il est nécessaire si votre clé est perdue ou volée.
ja: 鍵が盗難に対してだけではなく、紛失についても安全であることを保証する必要があります。失効証明書 (revocation certificate) を生成してコピーを作って下さい (紙にも出力しておくのがベストです)。これは鍵を紛失した場合に必要になります。

source: If you add signatures to your public key, or add user identities, you can update the Debian key ring by sending your key to the key server at <literal>&keyserver-host;</literal>.
de: Falls Sie Ihrem öffentlichen Schlüssel Signaturen oder Benutzerkennungen hinzufügen, können Sie den Debian-Schlüsselring aktualisieren, indem Sie Ihren Schlüssel an den Schlüsselserver unter <literal>&keyserver-host;</literal> senden.
fr: Si vous ajoutez des signatures ou des identifiants à votre clé publique, vous pouvez mettre à jour le porte-clés Debian en envoyant votre clé publique à <literal>&keyserver-host;</literal>.
ja: 公開鍵に対して、署名したり身元情報を追加したりなどしたら、鍵を <literal>&keyserver-host;</literal> の鍵サーバに送付することで Debian key ring を更新できます。

source: If you need to add a completely new key or remove an old key, you need to get the new key signed by another developer. If the old key is compromised or invalid, you also have to add the revocation certificate. If there is no real reason for a new key, the Keyring Maintainers might reject the new key. Details can be found at <ulink url="http://&keyserver-host;/replacing_keys.html"></ulink>.
de: Wenn Sie einen komplett neuen Schlüssel hinzufügen oder einen alten entfernen möchten, benötigen Sie den durch einen anderen Entwickler neu signierten Schlüssel. Falls der alte Schlüssel kompromittiert oder ungültig ist, müssen Sie außerdem das Widerrufs-Zertifikat hinzufügen. Falls es keinen vernünftigen Grund für einen neuen Schlüssel gibt, können die Betreuer des Schlüsselrings den neuen Schlüssel ablehnen. Details finden Sie unter <ulink url="http://&keyserver-host;/replacing_keys.html"></ulink>.
fr: Pour ajouter une nouvelle clé ou supprimer une ancienne clé, vous devez faire signer la nouvelle clé par un autre développeur. Si l'ancienne clé est compromise ou invalide, vous devez également ajouter le certification de révocation. S'il n'y pas de bonne raison pour une nouvelle clé, les responsables du trousseau peuvent rejeter la nouvelle clé. Vous trouverez plus de détails en <ulink url="http://&keyserver-host;/replacing_keys.html"></ulink>.
ja: まったく新しい鍵を追加したりあるいは古い鍵を削除したりする必要がある時は、別の開発者に署名された新しい鍵が必要になります。以前の鍵が侵害されたり利用不可能になった場合には、失効証明書 (revocation certificate) も追加する必要があります。新しい鍵が本当に必要な理由が見当たらない場合は、Keyring メンテナは新しい鍵を拒否することがあります。詳細は <ulink url="http://&keyserver-host;/replacing_keys.html"></ulink> で確認できます。

source: The same key extraction routines discussed in <xref linkend="registering"/> apply.
de: Es werden die gleichen Schlüssel-Extrahierungsroutinen angewandt, wie sie unter <xref linkend="registering"/> besprochen wurden.
fr: Les mêmes routines d'extraction de clé décrites en <xref linkend="registering"/> s'appliquent.
ja: 同様に鍵の取り出し方について <xref linkend="registering"/> で説明されています。

source: You can find a more in-depth discussion of Debian key maintenance in the documentation of the <systemitem role="package">debian-keyring</systemitem> package.
de: Eine weiterreichende Erörterung der Debian-Schlüsselverwaltung können Sie in der Dokumentation des Pakets <systemitem role="package">debian-keyring</systemitem> finden.
fr: Une présentation approfondie de la gestion de clé Debian peut être trouvée dans la documentation du paquet <systemitem role="package">debian-keyring</systemitem>.
ja: Debian での鍵のメンテナンスについて、より突っ込んだ議論を <systemitem role="package">debian-keyring</systemitem> パッケージ中のドキュメントで知ることができます。

source: Voting
de: Abstimmungen
fr: Votes
ja: 投票をする

source: Even though Debian isn't really a democracy, we use a democratic process to elect our leaders and to approve general resolutions. These procedures are defined by the <ulink url="&url-constitution;">Debian Constitution</ulink>.
de: Obwohl Debian nicht wirklich demokratisch ist, werden demokratische Prozesse benutzt, um das Führungspersonal auszuwählen und generellen Entschlüssen zuzustimmen. Diese Prozeduren sind durch die <ulink url="&url-constitution;">Debian-Verfassung</ulink> definiert.
fr: Bien que Debian ne soit pas vraiment une démocratie, le projet utilise un processus démocratique pour élire les responsables de projet et approuver les résolutions générales. Ces procédures sont définies par la <ulink url="&url-constitution;">constitution Debian</ulink>.
ja: Debian は本来の意味での民主主義ではありませんが、我々はリーダーの選出や一般投票の承認において民主主義的なプロセスを利用しています。これらの手続きについては、<ulink url="&url-constitution;">Debian 憲章</ulink>で規程されています。
