Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: To ensure that your upload will be accepted, you should discuss the changes with the stable release team before you upload. For that, file a bug against the <systemitem role="package">release.debian.org</systemitem> pseudo-package using <command>reportbug</command>, including the patch you want to apply to the package version currently in <literal>stable</literal>. Always be verbose and detailed in your changelog entries for uploads to the <literal>stable</literal> distribution.
de: Um sicherzustellen, dass Ihr Upload akzeptiert wird, sollten Sie die Änderungen mit dem Stable-Release-Team besprechen bevor Sie es hochladen. Dazu reichen Sie mittels <command>reportbug</command> einen Fehlerbericht gegen das Pseudo-Paket <systemitem role="package">release.debian.org</systemitem> ein, einschließlich dem Patch, das Sie auf die derzeit in <literal>stable</literal> enthaltene Paketversion anwenden möchten. Schreiben sie beim Upload in die Distribution <literal>stable</literal> stets detaillierte und ausführliche Änderungsprotokolleinträge.
fr: Pour qu'un paquet soit accepté, vous devriez contacter l'équipe de publication <literal>stable</literal> avant de l'envoyer. Pour ce faire, soumettez un bogue sur le pseudopaquet <systemitem role="package">release.debian.org</systemitem> en utilisant <command>reportbug</command> avec le correctif que vous avez l'intention d'appliquer à la version du paquet présent dans <literal>stable</literal>. Il faut toujours détailler précisément le journal de modification pour un envoi vers la distribution <literal>stable</literal>.
ja: アップロードが許可されるのを確実にするには、アップロードの前に変更点について安定版リリースチームと協議する必要があります。そのためには、<command>reportbug</command> コマンドを使って、現在の<literal>安定版 (stable)</literal> へ適用したいパッチを含めて <systemitem role="package">release.debian.org</systemitem> 擬似パッケージへバグを登録してください。<literal>安定版 (stable)</literal> ディストリビューションへアップロードするパッケージの changelog のエントリは、常にくどいほど詳細にしてください。

source: Extra care should be taken when uploading to <literal>stable</literal>. Basically, a package should only be uploaded to <literal>stable</literal> if one of the following happens:
de: Sie sollten beim Hochladen nach <literal>stable</literal> besonders vorsichtig sein. Grundsätzlich sollte ein Paket nur nach <literal>stable</literal> hochgeladen werden, wenn folgendes geschieht:
fr: Une mise à jour de paquet pour la distribution <literal>stable</literal> requiert des soins supplémentaires. Un paquet de cette distribution ne devrait être mis à jour que dans les cas suivants :
ja: <literal>安定版 (stable)</literal> へのアップロード時には特に注意を払うことが必要です。基本的に、以下のいずれかが起こった際にのみ <literal>安定版 (stable)</literal> へパッケージはアップロードされます:

source: a truly critical functionality problem
de: ein wirklich kritisches Funktionalitätsproblem
fr: un problème fonctionnel vraiment critique ;
ja: 本当に致命的な機能の問題がある

source: the package becomes uninstallable
de: Das Paket ist wird uninstallierbar.
fr: un paquet devenu non installable ;
ja: パッケージがインストールできなくなる

source: a released architecture lacks the package
de: Einer veröffentlichten Architektur fehlt das Paket.
fr: un paquet indisponible pour une architecture.
ja: リリースされたアーキテクチャにパッケージが無い

source: In the past, uploads to <literal>stable</literal> were used to address security problems as well. However, this practice is deprecated, as uploads used for Debian security advisories are automatically copied to the appropriate <filename>proposed-updates</filename> archive when the advisory is released. See <xref linkend="bug-security"/> for detailed information on handling security problems. If the security teams deems the problem to be too benign to be fixed through a <literal>DSA</literal>, the stable release managers are usually willing to include your fix nonetheless in a regular upload to <literal>stable</literal>.
de: Früher wurden Uploads nach <literal>stable</literal> benutzt, um auch Sicherheitsprobleme anzugehen. Diese Praxis ist jedoch missbilligt, da Uploads für Debian-Sicherheitswarnungen automatisch in das entsprechende Archiv <filename>proposed-updates</filename> kopiert werden, wenn die Warnung veröffentlicht wird. Weitere detailliertere Informationen über die Handhabung von Sicherheitsproblemem finden Sie unter <xref linkend="bug-security"/>. Falls das Sicherheits-Team das Problem als zu harmlos erachtet, um es durch ein <literal>DSA</literal> zu beheben. sind die Veröffentlichungsverwalter nichtsdestotrotz bereit, Ihre Fehlerbehebung bei einem regulären Upload nach <literal>stable</literal> einzufügen.
fr: Par le passé, les envois vers <literal>stable</literal> étaient également utilisés pour corriger les problèmes de sécurité. Cependant, cette pratique est déconseillée car les mises à jour pour les avis de sécurité Debian (« <literal>Debian security advisory</literal> » ou <literal>DSA</literal>) sont automatiquement copiés dans l'archive <filename>proposed-updates</filename> appropriée quand l'avis est publié. Reportez-vous en <xref linkend="bug-security"/> pour des informations plus détaillées sur la gestion des problèmes de sécurité. Si l'équipe en charge de la sécurité estime le problème trop insignifiant pour justifier un <literal>DSA</literal>, les responsables de la publication <literal>stable</literal> seront cependant plus facilement disposés à intégrer votre correctif via un envoi ordinaire vers <literal>stable</literal>.
ja: 以前、<literal>安定版 (stable)</literal> へのアップロードはセキュリティ問題への対処と同等に取り扱われていました。しかし、この慣習は廃れており、Debian セキュリティ勧告がリリースされた際、セキュリティ勧告へのアップロードに使われたものが自動的に適切な <filename>proposed-updates</filename> アーカイブにコピーされます。セキュリティ情報の取り扱い方の詳細については <xref linkend="bug-security"/> を参照してください。セキュリティチームがその問題は <literal>DSA</literal> を通じて修正するには軽微過ぎると思った場合であっても、安定版のリリースマネージャらはそれに関わらず <literal>安定版 (stable)</literal> への定期アップロードに修正を含めようとするでしょう。

source: Changing anything else in the package that isn't important is discouraged, because even trivial fixes can cause bugs later on.
de: Es wird abgeraten, etwas anderes unwichtiges im Paket zu ändern, da sogar einfache Fehlerbehebungen zu weiteren Fehlern führen können.
fr: Il est fortement déconseillé de changer quoi que ce soit de non important car même une modification triviale peut provoquer un bogue.
ja: 些細な修正でも後ほどバグを引き起こすことがあるので、重要でないものは何であろうと変更するのは推奨されません。

source: Packages uploaded to <literal>stable</literal> need to be compiled on systems running <literal>stable</literal>, so that their dependencies are limited to the libraries (and other packages) available in <literal>stable</literal>; for example, a package uploaded to <literal>stable</literal> that depends on a library package that only exists in <literal>unstable</literal> will be rejected. Making changes to dependencies of other packages (by messing with <literal>Provides</literal> or <filename>shlibs</filename> files), possibly making those other packages uninstallable, is strongly discouraged.
de: Pakete, die nach <literal>stable</literal> hochgeladen werden, müssen auf Systemen compiliert werden, auf denen <literal>stable</literal> läuft, so dass sich ihre Abhängigkeiten auf die Bibliotheken (und anderen Pakete) beschränken, die auf <literal>stable</literal> verfügbar sind. Ein Paket, das zum Beispiel nach <literal>stable</literal> hochgeladen wurde, das von einem Bibliothekspaket abhängt, das nur in <literal>unstable</literal> existiert, wird zurückgewiesen. Von Änderungen an Abhängigkeiten von anderen Paketen (durch Murksen mit <literal>Provides</literal>- oder <filename>shlibs</filename>-Dateien), die diese anderen Pakete möglicherweise uninstallierbar machen, wird dringend abgeraten.
fr: Les paquets à destination de <literal>stable</literal> doivent être compilés sur un système qui tourne sous <literal>stable</literal>, afin de limiter les dépendances aux bibliothèques (et autres paquets) disponibles dans <literal>stable</literal> ; par exemple, un paquet pour <literal>stable</literal> qui dépend de bibliothèques uniquement disponibles dans <literal>unstable</literal> sera rejeté. Modifier les dépendances d'autres paquets (en semant la pagaille avec les champs <literal>Provides</literal> ou les fichiers <filename>shlibs</filename>), au risque de rendre d'autres paquets impossible à installer, est fortement déconseillé.
ja: <literal>安定版 (stable)</literal> にアップロードされるパッケージは<literal>安定版 (stable)</literal> を動作しているシステム上でコンパイルされていなければならず、ライブラリ (やその他のパッケージ) への依存は<literal>安定版 (stable)</literal> で入手可能なものに限られます。例えば、<literal>安定版 (stable)</literal> にアップロードされたパッケージが<literal>不安定版 (unstable)</literal> にのみ存在するライブラリパッケージに依存していると reject されます。他のパッケージへの依存を (<literal>提供 (Provides)</literal> や <filename>shlibs</filename> をいじることで) 変更するのは、他のパッケージをインストールできないようにする可能性があるので認められません。

source: Uploads to the <literal>oldstable</literal> distributions are possible as long as it hasn't been archived. The same rules as for <literal>stable</literal> apply.
de: Uploads nach <literal>oldstable</literal>-Distributionen sind möglich, solange sie nicht archiviert sind. Es gelten die gleichen Regekn, wie für <literal>stable</literal>.
fr: Les mises à jour de la distribution <literal>oldstable</literal> sont possibles tant qu'elle n'a pas été archivée. Les mêmes règles que pour <literal>stable</literal> s'appliquent.
ja: <literal>旧安定版 (oldstable)</literal> ディストリビューションへのアップロードはアーカイブされてない限り可能です。<literal>安定版 (stable)</literal>と同じルールが適用されます。

source: Special case: uploads to <literal>testing/testing-proposed-updates</literal>
de: Ein Sonderfall sind Uploads nach <literal>testing/testing-proposed-updates</literal>
fr: Cas particulier : <literal>testing/testing-proposed-updates</literal>
ja: 特別な例: <literal>testing/testing-proposed-updates</literal> へアップロードする

source: Please see the information in the <link linkend="t-p-u">testing section</link> for details.
de: Bitte lesen Sie die Informationen im <link linkend="t-p-u">Bereich Testing</link>, um weitere Einzelheiten zu erfahren.
fr: Veuillez consulter les informations de la <link linkend="t-p-u">section relative à <literal>testing</literal></link> pour plus de détails.
ja: 詳細については、<link linkend="t-p-u">testing section</link> にある情報を参照してください。

source: Uploading a package
de: Ein Paket hochladen
fr: Envois de paquets
ja: パッケージをアップロードする

source: Uploading to <literal>ftp-master</literal>
de: Hochladen auf <literal>ftp-master</literal>
fr: Envois sur <literal>ftp-master</literal>
ja: <literal>ftp-master</literal> にアップロードする

source: To upload a package, you should upload the files (including the signed changes and dsc-file) with anonymous ftp to <literal>&ftp-upload-host;</literal> in the directory <ulink url="ftp://&ftp-upload-host;&upload-queue;">&upload-queue;</ulink>. To get the files processed there, they need to be signed with a key in the Debian Developers keyring or the Debian Maintainers keyring (see <ulink url="&url-wiki-dm;"></ulink>).
de: Um ein Paket hochzuladen, sollten Sie die Dateien (einschließlich der signierten Änderungen an der dsc-Datei) mit anonymem FTP nach <literal>&ftp-upload-host;</literal> in das Verzeichnis <ulink url="ftp://&ftp-upload-host;&upload-queue;">&upload-queue;</ulink> hochladen. Damit die Dateien dort verarbeitet werden, benötigen Sie einen signierten Schlüssel im Debian-Entwickler-Schlüsselbund (siehe <ulink url="&url-wiki-dm;"></ulink>).
fr: Pour envoyer un paquet, il faut envoyer les fichiers (y compris les fichiers <filename>changes</filename> et <filename>dsc</filename> signés) par FTP anonyme sur <literal>&ftp-upload-host;</literal> dans le répertoire <ulink url="ftp://&ftp-upload-host;&upload-queue;">&upload-queue;</ulink>. Pour que les fichiers y soient traités, ils doivent être signés avec une clé du porte-clés (<literal>keyring</literal>) des développeurs ou des responsables Debian (voir <ulink url="&url-wiki-dm;"></ulink>).
ja: パッケージをアップロードするには、ファイル (署名された changes ファイルと dsc ファイル) を anonymous ftp で <literal>&ftp-upload-host;</literal> の <ulink url="ftp://&ftp-upload-host;&upload-queue;">&upload-queue;</ulink> へアップロードする必要があります。そこでファイルを処理するためには、Debian Developers keyring または Debian Maintainers keyring (<ulink url="&url-wiki-dm;"></ulink> 参照) にある鍵で署名しておく必要があります。

source: Please note that you should transfer the changes file last. Otherwise, your upload may be rejected because the archive maintenance software will parse the changes file and see that not all files have been uploaded.
de: Bitte beachten Sie, dass Sie die Datei »changes« zuletzt übertragen sollten. Andernfalls könnte Ihr Upload abgelehnt werden, da die Archivverwaltungs-Software die »changes«-Datei auswertet und feststellt, dass nicht alle Dateien hochgeladen wurden.
fr: Attention, il est préférable de transférer le fichier <filename>changes</filename> en dernier. Dans le cas contraire, votre envoi pourrait être rejetée car l'outil de maintenance de l'archive pourrait lire le fichier <filename>changes</filename> et constater que les fichiers ne sont pas tous présents.
ja: changes ファイルは最後に転送する必要があることに注意してください。そうしないとアーカイブのメンテナンスを行っているソフトが changes ファイルをパースして全てのファイルがアップロードされていないと判断して、アップロードは reject されるかもしれません。

source: You may also find the Debian packages <link linkend="dupload">dupload</link> or <link linkend="dput">dput</link> useful when uploading packages.These handy programs help automate the process of uploading packages into Debian.
de: Vielleicht finden Sie auch die Debian-Pakete <link linkend="dupload">dupload</link> oder <link linkend="dput">dput</link> nützlich, wenn Sie Pakete hochladen. Diese praktischen Programme helfen den Prozess des Hochladens von Paketen nach Debian zu automatisieren.
fr: Les paquets <link linkend="dupload">dupload</link> ou <link linkend="dput">dput</link> pourront vous faciliter le travail lors du téléchargement. Ces programmes bien pratiques aident à automatiser le processus d'envoi de paquets vers Debian.
ja: パッケージのアップロードを行う際には <link linkend="dupload">dupload</link> や <link linkend="dput">dput</link> が便利なことにも気づくことでしょう。これらの便利なプログラムは、パッケージを Debian にアップロードする作業を自動化するのに役立ちます。

source: For removing packages, please see <ulink url="ftp://&ftp-upload-host;&upload-queue;README"/> and the Debian package <link linkend="dcut">dcut</link>.
de: Um Pakete zu entfernen, sehen Sie sich bitte <ulink url="ftp://&ftp-upload-host;&upload-queue;README"/> und das Debian-Paket <link linkend="dcut">dcut</link> an.
fr: Pour supprimer des paquets, veuillez lire le fichier <ulink url="ftp://&ftp-upload-host;&upload-queue;README"/> et le paquet Debian <link linkend="dcut">dcut</link>.
ja: パッケージを削除するには <ulink url="ftp://&ftp-upload-host;&upload-queue;README"/> と <link linkend="dcut">dcut</link> Debian パッケージを参照してください。

source: Delayed uploads
de: Verzögerte Uploads
fr: Envois différés
ja: 遅延アップロード

source: It is sometimes useful to upload a package immediately, but to want this package to arrive in the archive only a few days later. For example, when preparing a <link linkend="nmu">Non-Maintainer Upload</link>, you might want to give the maintainer a few days to react.
de: Manchmal ist es nützlich ein Paket sofort hochzuladen, aber zu wünschen, dass dieses Paket das Archiv erst ein paar Tage später erreicht. Sie könnten, wenn Sie beispielsweise einen <link linkend="nmu">Non-Maintainer Upload</link> vorbereiten, dem Betreuer ein paar Tage Zeit geben wollen, damit er reagieren kann.
fr: Il peut être utile d'envoyer un paquet à un moment donné, mais vouloir que ce paquet n'entre dans l'archive que quelques jours plus plus tard. Par exemple, lors de la préparation d'une <link linkend="nmu">mise à jour indépendante (« <literal>Non-Maintainer Upload</literal> » ou NMU)</link>, vous pourriez donner quelques jours pour au responsable pour réagir.
ja: パッケージを直ちにアップロードするのが良い時もありますが、パッケージがアーカイブに入るのが数日後であるのが良いと思う時もあります。例えば、<link linkend="nmu">Non-Maintainer アップロード</link>の準備をする際は、メンテナに対して猶予期間を数日間与えたいと思うでしょう。

source: An upload to the delayed directory keeps the package in <ulink url="http://ftp-master.debian.org/deferred.html">the deferred uploads queue</ulink>. When the specified waiting time is over, the package is moved into the regular incoming directory for processing. This is done through automatic uploading to <literal>&ftp-upload-host;</literal> in upload-directory <literal>DELAYED/<replaceable>X</replaceable>-day</literal> (<replaceable>X</replaceable> between 0 and 15). 0-day is uploaded multiple times per day to <literal>&ftp-upload-host;</literal>.
de: Ein Upload des Pakets in das Verzögerungsverzeichnis, wird es in der <ulink url="http://ftp-master.debian.org/deferred.html">deferred uploads queue</ulink> halten. Wenn die angegebene Wartezeit vorüber ist, wird das Paket zur Verarbeitung in das reguläre Eingangsverzeichnis verschoben. Dies wird durch automatisches Hochladen nach <literal>&ftp-upload-host;</literal> in das Upload-Verzeichnis <literal>DELAYED/<replaceable>X</replaceable>-day</literal> (<replaceable>X</replaceable> zwischen 0 und 15). 0-day wird mehrmals täglich nach <literal>&ftp-upload-host;</literal> hochgeladen.
fr: Les envois vers le répertoire différé sont gardés dans <ulink url="http://ftp-master.debian.org/deferred.html">la file d'attente différée</ulink>. Une fois le temps d'attente indiqué terminé, le paquet est déplacé dans le répertoire <filename>incoming</filename> normal pour être traité. Ceci est réalisé par une mise à jour automatique en envoyant dans le répertoire <literal>DELAYED/<replaceable>X</replaceable>-day</literal> (<replaceable>X</replaceable> compris entre 0 et 15) de <literal>&ftp-upload-host;</literal>. Le contenu de <literal>0-day</literal> est envoyé plusieurs fois par jour vers <literal>&ftp-upload-host;</literal>.
ja: delayed ディレクトリにアップロードされると、パッケージは <ulink url="http://ftp-master.debian.org/deferred.html">the deferred uploads queue</ulink> に保存されます。指定した待ち時間が終わると、パッケージは処理のため通常の incoming ディレクトリに移動されます。この作業は <literal>&ftp-upload-host;</literal> の <literal>DELAYED/<replaceable>X</replaceable>-day</literal> ディレクトリへのアップロードを通じて自動的に処理されます (<replaceable>X</replaceable> は 0 から 15 の間です)。0-day は一日に複数回 <literal>&ftp-upload-host;</literal> へアップロードするのに使われます。

source: With dput, you can use the <literal>--delayed <replaceable>DELAY</replaceable></literal> parameter to put the package into one of the queues.
de: Mit Dput können Sie den Parameter <literal>--delayed <replaceable>VERZÖGERUNG</replaceable></literal> benutzen, um das Paket in eine der Warteschlangen einzureihen.
fr: Avec <command>dput</command>, le paramètre <literal>--delayed <replaceable>DELAY</replaceable></literal> permet de placer le paquet dans une de ces files d'attente.
ja: dput を使うと、パッケージを遅延キューに入れるのに <literal>--delayed <replaceable>DELAY</replaceable></literal> パラメータを使えます。

source: Security uploads
de: Sicherheits-Uploads
fr: Envois de sécurité
ja: セキュリティアップロード

source: Do <emphasis role="strong">NOT</emphasis> upload a package to the security upload queue (<literal>oldstable-security</literal>, <literal>stable-security</literal>, etc.) without prior authorization from the security team. If the package does not exactly meet the team's requirements, it will cause many problems and delays in dealing with the unwanted upload. For details, please see <xref linkend="bug-security"/>.
fr: N'envoyez <emphasis role="strong">jamais</emphasis> un paquet vers la file d'envoi de sécurité <literal>oldstable-security</literal>, <literal>stable-security</literal>, etc.) sans avoir obtenu au préalable l'autorisation de l'équipe de sécurité. Si le paquet ne correspond pas tout à fait aux besoins de cette équipe, il entraînera beaucoup de problèmes et de retards dans la gestion de cet envoi non désiré. Pour plus de détails, voir <xref linkend="bug-security"/>.
ja: セキュリティアップロードキュー (<literal>oldstable-security</literal>、<literal>stable-security</literal> 等) には、セキュリティチームからの事前許可無しにパッケージを<emphasis role="strong">アップロードしないでください</emphasis>。パッケージがチームの要求に完全に合致していない場合、望まれないアップロードに対処するために多くの問題が引き起こされたり遅延が生じることになります。詳細については <xref linkend="bug-security"/> を参照してください。

source: Other upload queues
de: Andere Upload-Warteschlangen
fr: Les autres files d'envoi
ja: 他のアップロードキュー

source: There is an alternative upload queue in Europe at <ulink url="ftp://&ftp-eu-upload-host;&upload-queue;"/>. It operates in the same way as <literal>&ftp-upload-host;</literal>, but should be faster for European developers.
de: Es gibt in Europa eine alternative Upload-Warteschlange unter <ulink url="ftp://&ftp-eu-upload-host;&upload-queue;"/>. Sie arbeitet auf die gleiche Weise wie <literal>&ftp-upload-host;</literal>, sollte aber für europäische Entwickler schneller sein.
fr: Une file d'attente alternative en Europe est disponible sur <ulink url="ftp://&ftp-eu-upload-host;&upload-queue;"/>. Son fonctionnement est similaire à <literal>&ftp-upload-host;</literal>, mais devrait être plus rapide pour les responsables européens.
ja: ヨーロッパにはもう一つのアップロードキューが <ulink url="ftp://&ftp-eu-upload-host;&upload-queue;"/> にあります。操作方法は <literal>&ftp-upload-host;</literal> と同じですが、ヨーロッパ圏の開発者に対しては、より速いはずです。

source: Packages can also be uploaded via ssh to <literal>&ssh-upload-host;</literal>; files should be put <literal>/srv/upload.debian.org/UploadQueue</literal>. This queue does not support <link linkend="delayed-incoming">delayed uploads</link>.
de: Pakete können auch per SSH nach <literal>&ssh-upload-host;</literal> hochgeladen werden. Dateien sollten in <literal>/srv/upload.debian.org/UploadQueue</literal> abgelegt werden. Diese Warteschlange unterstützt keine <link linkend="delayed-incoming">verzögerten Uploads</link>.
fr: Les paquets peuvent également être envoyés via ssh sur <literal>&ssh-upload-host;</literal> ; les fichiers doivent être placés dans <literal>/srv/upload.debian.org/UploadQueue</literal>. Cette file d'attente ne permet pas les <link linkend="delayed-incoming">envois différés</link>.
ja: パッケージは ssh を使って <literal>&ssh-upload-host;</literal> へアップロードすることも可能です。ファイルは <literal>/srv/upload.debian.org/UploadQueue</literal> に置く必要があります。このキューは<link linkend="delayed-incoming">遅延アップロード</link>をサポートしていません。

source: Notification that a new package has been installed
de: Benachrichtigung, dass eine neues Paket instaliert wurde
fr: Notification d'installation de nouveau paquet
ja: 新しいパッケージがインストールされたことの通知
