Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: You can search it for a specific issue, but also on package name. Look for your package to see which issues are still open. If you can, please provide more information about those issues, or help to address them in your package. Instructions are on the tracker web pages.
de: Sie können Sie nach einem bestimmten Thema durchsuchen, aber auch nach einem Paketnamen. Schauen Sie nach Ihrem Paket, um zu sehen, welche Themen noch offen sind. Bitte stellen Sie, falls Sie können, weitere Informationen über diese Themen bereit oder helfen Sie, sie in Ihrem Paket zu behandeln. Anweisungen finden Sie auf dem Webseiten der Fehlerverfolgung.
fr: Il est possible de rechercher un problème particulier, mais aussi un paquet. Cherchez parmi vos paquets afin de prendre connaissance de problèmes non encore résolus. Si vous le pouvez, veuillez fournir plus d'informations sur ces problèmes, ou aidez à les corriger dans vos paquets. Le mode d'emploi est disponible sur les pages web du gestionnaire.
ja: 特定の問題について検索することもできますし、パッケージ名でも検索できます。あなたのパッケージを探して、どの問題がまだ未解決かを確認してください。できれば追加情報を提供するか、パッケージの問題に対処するのを手伝ってください。やり方は追跡システムのウェブページにあります。

source: Confidentiality
de: Vertraulichkeit
fr: Confidentialité
ja: 秘匿性

source: Unlike most other activities within Debian, information about security issues must sometimes be kept private for a time. This allows software distributors to coordinate their disclosure in order to minimize their users' exposure. Whether this is the case depends on the nature of the problem and corresponding fix, and whether it is already a matter of public knowledge.
de: Anders als bei den meisten Aktivitäten innerhalb von Debian, werden Informationen über Sicherheitsthemen eine Zeit lang geheim gehalten. Dies erlaubt es Software-Verteibern, ihre Offenlegung zu koordinieren, um die Belastung ihrer Anwender zu minimieren. Ob dies der Fall ist, hängt von der Natur des Problems und der zugehörigen Fehlerbehebung ab und ob bereits eine Angelegenheit an die Öffentlichkeit gesickert ist.
fr: À la différence de la plupart des autres activités de Debian, les problèmes de sécurité doivent parfois être tenus secrets un certain temps. Ceci permet aux distributeurs de logiciels de coordonner leur divulgation afin de minimiser l'exposition de leurs utilisateurs. Cette décision dépend de la nature du problème, de l'existence d'une solution correspondante, et de sa publicité.
ja: Debian 内での他の多くの活動とは違い、セキュリティ問題に関する情報については、暫くの間秘密にしておく必要がしばしばあります。これによって、ソフトウェアのディストリビュータがユーザが危険にさらされるのを最小限にするため、公開時期を合わせることができます。今回がそうであるかは、問題と対応する修正の性質や、既に既知のものとなっているかどうかによります。

source: There are several ways developers can learn of a security problem:
de: Es gibt mehrere Möglichkeiten, wie Entwickler von einem Sicherheitsproblem erfahren:
fr: Il existe plusieurs façons pour un développeur de prendre connaissance d'un problème de sécurité :
ja: 開発者がセキュリティ問題を知る方法はいくつかあります:

source: they notice it on a public forum (mailing list, web site, etc.)
de: sie bemerken es in einem öffentlichen Forum (Maillingliste, Website etc.)
fr: il le remarque sur un forum public (liste de diffusion, site web, etc.) ;
ja: 公開フォーラム (メーリングリスト、ウェブサイトなど) で知らせる

source: someone files a bug report
de: jemand verfasst einen Fehlerbericht
fr: quelqu'un soumet un rapport de bogue ;
ja: 誰かがバグ報告を登録している

source: someone informs them via private email
de: jemand informiert sie per privater E-Mail
fr: quelqu'un l'informe en privé.
ja: 誰かがプライベートなメールで教えてきた

source: In the first two cases, the information is public and it is important to have a fix as soon as possible. In the last case, however, it might not be public information. In that case there are a few possible options for dealing with the problem:
de: In den ersten beiden Fällen ist die Information öffentlich und es ist wichtig, so schnell wie möglich eine Fehlerbehebung zu haben. Im letzen Fall könnte die Information nicht öffentlich sein, In diesem Fall gibt es ein paar mögliche Optionen, mit dem Problem umzugehen:
fr: Dans les deux premiers cas, l'information est publique et il est important de régler le problème au plus vite. Dans le dernier cas, cependant, l'information n'est pas forcément publique. Il existe alors différentes possibilités pour traiter le problème :
ja: 最初の二つのケースでは、情報は公開されていて可能な限り早く修正することが重要です。しかしながら最後のケースは、公開情報ではないかもしれません。この場合は、問題に対処するのに幾つか取り得る選択肢があります:

source: If the security exposure is minor, there is sometimes no need to keep the problem a secret and a fix should be made and released.
de: Falls die Offenlegung der Sicherheit gering ist, ist es manchmal nicht nötig, das Problem geheim zu halten und es sollte eine Fehlerbehebung erstellt und veröffentlicht werden.
fr: si l'exposition est mineure, il n'y a parfois pas besoin de garder le secret sur le problème et une correction devrait être mise en œuvre et diffusée ;
ja: セキュリティの影響度が小さい場合、問題を秘密にしておく必要はなく、修正を行ってリリースするのが良い場合がしばしばあります。

source: If the problem is severe, it is preferable to share the information with other vendors and coordinate a release. The security team keeps in contact with the various organizations and individuals and can take care of that.
de: Falls das Problem ernst ist, sollte diese Information vorzugsweise mit anderen Anbietern geteilt werden, um eine Veröffentlichung zu koordinieren. Das Sicherheits-Team hält Kontakt zu verschiedenen Organisationen und Einzelpersonen, die sich darum kümmern.
fr: si le problème est grave, il vaut mieux partager cette information avec d'autres distributeurs et de coordonner une publication. L'équipe de sécurité est en contact avec les différentes organisations et individus et peut s'en occuper.
ja: 問題が深刻な場合、他のベンダと情報を共有してリリースをコーディネイトする方が望ましいでしょう。セキュリティチームは様々な組織／個人と連絡を取りつづけ、この問題に対応することができます。

source: In all cases if the person who reports the problem asks that it not be disclosed, such requests should be honored, with the obvious exception of informing the security team in order that a fix may be produced for a stable release of Debian. When sending confidential information to the security team, be sure to mention this fact.
de: Wenn die Person, die das Problem meldet, bittet, dass es nicht offengelegt wird, sollte diese Anfrage auf alle Fälle mit der einleuchtenden Ausnahme gewürdigt werden, das Sicherheits-Team zu informieren, damit der Fehler für ein Stable-Release von Debian erstellt werden kann. Vergessen Sie nicht, diese Tatsache zu erwähnen, wenn vertrauliche Informationen zum Sicherheits-Team gesandt werden.
fr: Dans tous les cas, si la personne ayant indiqué le problème demande à ce que l'information ne soit pas diffusée, cela devrait être respecté, avec l'évidente exception d'informer l'équipe de sécurité pour préparer un correctif de la version <literal>stable</literal> de Debian. Quand vous envoyez des informations confidentielles à l'équipe de sécurité, assurez-vous de bien le préciser.
ja: どのような場合でも、問題を報告した人がこれを公開しないように求めているのであれば、明白な例外として Debian の安定版リリースに対する修正を作成してもらうためにセキュリティチームへ連絡すること以外、この様な要求は尊重されるべきです。機密情報をセキュリティチームに送る場合は、この点を明示しておくのを忘れないでください。

source: Please note that if secrecy is needed you may not upload a fix to <literal>unstable</literal> (or anywhere else, such as a public VCS repository). It is not sufficient to obfuscate the details of the change, as the code itself is public, and can (and will) be examined by the general public.
de: Bitte beachten Sie, dass Sie keine Fehlerbehebung nach <literal>unstable</literal> (oder an eine andere Stelle, wie ein öffentliches VCS-Depot) senden können, wenn Geheimhaltung nötig ist. Es reicht nicht aus, die Einzelheiten der Änderung zu verschleiern, da der Code selbst öffentlich ist und von der Allgemeinheit untersucht werden kann (und soll).
fr: Si le secret est nécessaire, vous ne pourrez pas envoyer de correctif vers <literal>unstable</literal> (ou ailleurs, comme un système de gestion de version public). Il ne suffit pas d'occulter les détails des modifications : puisque le code lui même est publique, il peut être (et sera) étudié.
ja: 機密を要する場合は、修正を<literal>不安定版 (unstable)</literal> (や公開 VCS リポジトリなどその他どこへも) へ修正をアップロードしないよう、注意してください。コードその物が公開されている場合、変更の詳細を難読化するだけでは十分ではなく、皆によって解析され得る (そしてされる) でしょう。

source: There are two reasons for releasing information even though secrecy is requested: the problem has been known for a while, or the problem or exploit has become public.
de: Es gibt zwei Gründe, Informationen sogar dann zu veröffentlichen, wenn um Geheimhaltung gebeten wurde: Das Problem ist bereits seit einer Weile bekannt oder es wurde ein Exploit veröffentlicht.
fr: Il existe deux raisons de diffuser l'information même si le secret est demandé : le problème est connu depuis un certain temps, ou le problème ou son exploitation est devenu public.
ja: 機密であることを要求されたにも関わらず、情報を公開するのには 2 つの理由があります: 問題が一定期間既知の状態になっている、あるいは問題や攻撃コードが公開された場合です。

source: The Security Team has a PGP-key to enable encrypted communication about sensitive issues. See the <ulink url="http://www.debian.org/security/faq#contact">Security Team FAQ</ulink> for details.
de: Das Sicherheits-Team hat einen PGP-Schlüssel, um verschlüsselte Kommunikation über sensible Themen zu aktivieren. Einzelheiten finden Sie in der <ulink url="http://www.debian.org/security/faq#contact">Debian Sicherheits-FAQ</ulink>.
fr: L'équipe de sécurité dispose d'une clé PGP pour permettre de chiffrer tout échange d'informations pour les problèmes sensibles. Voir la <ulink url="http://www.debian.org/security/faq#contact">FAQ de l'équipe Debian sur la sécurité</ulink> pour plus de détails.
ja: セキュリティチームは、機密事項に関して通信を暗号化できる PGP 鍵を持っています。詳細については、<ulink url="http://www.debian.org/security/faq#contact">セキュリティチーム FAQ</ulink> を参照してください。

source: Security Advisories
de: Sicherheitswarnungen
fr: Annonces de sécurité
ja: セキュリティ勧告

source: Security advisories are only issued for the current, released stable distribution, and <emphasis>not</emphasis> for <literal>testing</literal> or <literal>unstable</literal>. When released, advisories are sent to the &email-debian-security-announce; mailing list and posted on <ulink url="&url-debian-security-advisories;">the security web page</ulink>. Security advisories are written and posted by the security team. However they certainly do not mind if a maintainer can supply some of the information for them, or write part of the text. Information that should be in an advisory includes:
de: Sicherheitswarnungen werden nur für die aktuelle, veröffentlichte Stable-Distribution ausgegeben und <emphasis>nicht</emphasis> für <literal>testing</literal> oder <literal>unstable</literal>. Wenn Sie veröffentlicht werden, werden sie an die Mailingliste &email-debian-security-announce; und an die Website <ulink url="&url-debian-security-advisories;">Sicherheits-Informationen</ulink> geschickt. Sicherheitswarnungen werden vom Sicherheits-Team verfasst und verschickt. Es macht natürlich nichts aus, wenn ein Paketbetreuer einige Informationen dazu bereitstellen kann oder einen Teil des Textes verfasst. Informationen in einer Warnung sollten Folgendes umfassen:
fr: Les annonces de sécurité ne sont émises que pour la distribution actuellement <literal>stable</literal>, mais <emphasis>pas</emphasis> pour <literal>testing</literal> ou <literal>unstable</literal>. Une fois diffusée, l'annonce est envoyée à la liste &email-debian-security-announce; et mise en ligne sur la page d'<ulink url="&url-debian-security-advisories;">informations de sécurité</ulink>. Les annonces de sécurité sont écrites et mises en ligne par les membres de l'équipe en charge de la sécurité. Cependant, ils ne verront aucun inconvénient à ce qu'un responsable leur apporte des informations ou écrive une partie du texte. Les informations d'une annonce devraient comporter :
ja: セキュリティ勧告は現在のところ、リリースされた安定版ディストリビューションについてのみ、取り扱われます。<literal>テスト版 (testing)</literal> や <literal>不安定版 (unstable)</literal> についてでは<emphasis>ありません</emphasis>。リリースされると、セキュリティ勧告は email-debian-security-announce; メーリングリストに送られ、<ulink url="&url-debian-security-advisories;">セキュリティのウェブページ</ulink>に掲載されます。セキュリティ勧告はセキュリティチームによって記述、掲載されます。しかし、メンテナが情報を提供できたり、文章の一部を書けるのであれば、彼らは当然そんなことは気にしません。勧告にあるべき情報は以下を含んでいます:

source: A description of the problem and its scope, including:
de: eine Beschreibung des Problems und seines Geltungsbereichs, einschließlich:
fr: une description du problème et de sa portée, y compris :
ja: 以下のようなものを含めた問題の説明と範囲:

source: The type of problem (privilege escalation, denial of service, etc.)
de: dem Typ des Problems (Rechteausweitung, Dienstverweigerung etc.)
fr: le type du problème (usurpation de privilège, déni de service, etc.) ;
ja: 問題の種類 (権限の上昇、サービス拒否など)

source: What privileges may be gained, and by whom (if any)
de: Welche Privilegien können erlangt werden und durch wen (falls durch jemanden)?
fr: quels sont les privilèges obtenus et par quels utilisateurs (si c'est le cas) ;
ja: 何の権限が得られるのか、(もし分かれば) 誰が得るのか

source: How it can be exploited
de: Wie kann dies ausgenutzt werden?
fr: comment il peut être exploité ;
ja: どのようにして攻撃が可能なのか

source: Whether it is remotely or locally exploitable
de: Ist es aus der Ferne oder lokal ausnutzbar?
fr: si le problème peut être exploité à distance ou localement ;
ja: 攻撃はリモートから可能なのかそれともローカルから可能なのか

source: How the problem was fixed
de: Wie wurde das Problem gelöst?
fr: comment le problème a été corrigé ;
ja: どのようにして問題が修正されたのか

source: This information allows users to assess the threat to their systems.
de: Diese Informationen ermöglichen es Anwendern die Bedrohung ihrer Systeme zu beurteilen.
fr: ces informations permettant aux utilisateurs d'estimer la menace pesant sur leurs systèmes ;
ja: この情報によって、ユーザがシステムに対する脅威を評価できるようになります。

source: Version numbers of affected packages
de: Versionsnummern betroffener Pakete
fr: les numéros de version des paquets affectés ;
ja: 影響を受けるパッケージのバージョン番号

source: Version numbers of fixed packages
de: Versionsnummern reparierter Pakete
fr: les numéros de version des paquets corrigés ;
ja: 修正されたパッケージのバージョン番号

source: Information on where to obtain the updated packages (usually from the Debian security archive)
de: Informationen, woher man die aktualisierten Pakete bekommen kann (üblicherweise aus dem Debian-Sicherheitsarchiv)
fr: une information sur la façon de récupérer les paquets mis à jour (habituellement l'archive de sécurité Debian) ;
ja: どこで更新されたパッケージを得るかという情報 (通常は Debian のセキュリティアーカイブからです)

source: References to upstream advisories, <ulink url="http://cve.mitre.org">CVE</ulink> identifiers, and any other information useful in cross-referencing the vulnerability
de: Referenzen zu Warnungen der Originalautoren, <ulink url="http://cve.mitre.org">CVE</ulink>-Bezeichner und jede andere nützliche Informationen in Querverweisen zur Schwachstelle
fr: des références à des annonces amont, des identifiants <ulink url="http://cve.mitre.org">CVE</ulink> et toute autre information utile pour recouper les références de la vulnérabilité.
ja: 開発元のアドバイザリへの参照、<ulink url="http://cve.mitre.org">CVE</ulink> 番号、脆弱性の相互参照について役立つその他の情報

source: Preparing packages to address security issues
de: Pakete vorbereiten, um Sicherheitsthemen anzugehen
fr: Préparation de paquets pour les problèmes de sécurité
ja: セキュリティ問題に対処するパッケージを用意する

source: One way that you can assist the security team in their duties is to provide them with fixed packages suitable for a security advisory for the stable Debian release.
de: Eine Möglichkeit, dem Sicherheits-Team bei seinen Aufgaben beizustehen besteht darin, es mit reparierten Paketen zu versorgen, die für eine Sicherheitswarnung des Stable-Releases geeignet sind.
fr: Une façon d'aider l'équipe de sécurité dans sa tâche est de lui fournir des paquets corrigés adéquats pour une annonce de sécurité de la version <literal>stable</literal> de Debian.
ja: あなたがセキュリティチームに対し、彼らの職務に関して手助けできる方法の一つは、安定版 Debian リリース用のセキュリティ勧告に適した修正版パッケージを提供することです。

source: When an update is made to the stable release, care must be taken to avoid changing system behavior or introducing new bugs. In order to do this, make as few changes as possible to fix the bug. Users and administrators rely on the exact behavior of a release once it is made, so any change that is made might break someone's system. This is especially true of libraries: make sure you never change the API or ABI, no matter how small the change.
de: Wenn eine Aktualisierung am Stable-Release vorgenommen wird, muss dies behutsam getan werden, damit eine Änderung des Systemverhaltens vermieden wird und keine neuen Fehler eingeschleppt werden. Um dies zu erreichen, ändern Sie so wenig wie möglich, wenn Sie Fehler beheben. Anwender und Administratoren verlassen sich auf das exakte Verhalten des Release nachdem es veröffentlicht wurde, so dass jegliche vorgenommene Änderung das System von jemandem stören könnte. Dies trifft im Besonderen auf Bibliotheken zu: Stellen Sie sicher, dass Sie nie das API oder das ABI ändern, egal wie klein die Änderung auch sein mag.
fr: Quand une mise à jour de la version <literal>stable</literal> est effectuée, un soin particulier doit être apporté pour éviter de modifier le comportement du système ou d'introduire de nouveaux bogues. Pour cela, faites le moins de changements possibles pour corriger le bogue. Les utilisateurs et les administrateurs s'attendent à conserver un comportement strictement dans une distribution lorsque celle-ci est publiée, donc toute modification est susceptible de casser le système de quelqu'un. Ceci est spécialement vrai pour les bibliothèques : assurez-vous ne de jamais changer l'API ou l'ABI, aussi minimal que soit le changement.
ja: 安定版について更新が作成される際、システムの挙動の変化や新しいバグの導入を避けるように注意が必要です。これを行うため、バグを修正するための変更は可能な限り少なくします。ユーザや管理者は一旦リリースされたものの厳密な挙動を当てにしているので、どのような変更でも誰かのシステムを壊しかねません。これは特にライブラリについて当てはまります: API や ABI を決して変更していないことを確認してください。変更がどれほど小さいものでも関係ありません。

source: This means that moving to a new upstream version is not a good solution. Instead, the relevant changes should be back-ported to the version present in the current stable Debian release. Generally, upstream maintainers are willing to help if needed. If not, the Debian security team may be able to help.
de: Dies bedeutet, dass das Umschwenken auf eine neue Originalversion keine gute Lösung ist. Stattdessen sollten die passenden Änderungen auf die Versionen im aktuellen Debian-Stable-Release zurückportiert werden. Generell sind Original-Paketbetreuer bereit zu helfen, wenn nötig. Falls nicht, könnte das Debian-Sicherheits-Team in der Lage sein zu helfen.
fr: Cela signifie que passer à une version amont supérieure n'est pas une bonne solution. À la place, les changements pertinents devraient être rétroportés vers la version présente dans la distribution <literal>stable</literal> de Debian. Habituellement, les développeurs amont veulent bien aider. Sinon, l'équipe de sécurité Debian peut le faire.
ja: これは、開発元の新しいリリースバージョン (new upstream version) への移行が良い解決策ではないことを意味しています。代わりに、関連する変更を現在の Debian 安定版リリースに存在しているバージョンへバックポートするべきです。通常、開発元のメンテナは助けが必要であれば手伝おうとしてくれます。そうでない場合は、Debian セキュリティチームが手助けすることができます。

source: In some cases, it is not possible to back-port a security fix, for example when large amounts of source code need to be modified or rewritten. If this happens, it may be necessary to move to a new upstream version. However, this is only done in extreme situations, and you must always coordinate that with the security team beforehand.
de: In manchen Fällen ist es unmöglich eine Sicherheitsreparatur zurück zu portieren, zum Beispiel, wenn große Teile des Quelltextes geändert oder überschrieben werden müssen. Falls dies geschieht, könnte es nötig sein, zu einer neue Originalversion zu wechseln. Dies wird jedoch nur in extremen Situationen getan und Sie müssen dies immer vorab mit dem Sicherheits-Team abstimmen.
fr: Dans certains cas, il n'est pas possible de rétroporter un correctif de sécurité, par exemple, quand de grandes quantités de code source doivent être modifiées ou réécrites. Si cela se produit, il peut être nécessaire de passer à une nouvelle version amont. Cependant, ceci n'est fait que dans des situations extrêmes et vous devez toujours coordonner cela avec l'équipe de sécurité auparavant.
ja: いくつかのケースでは、例えば大量のソースコードの変更や書き直しが必要など、セキュリティ修正をバックポートできないことがあります。この様な場合、新しいバージョン (new upstream version) へ移行する必要があるかもしれません。しかし、これは極端な状況の場合にのみ行われるものであり、実行する前に必ずセキュリティチームと調整をしなければなりません。

source: Related to this is another important guideline: always test your changes. If you have an exploit available, try it and see if it indeed succeeds on the unpatched package and fails on the fixed package. Test other, normal actions as well, as sometimes a security fix can break seemingly unrelated features in subtle ways.
de: Darauf bezieht sich eine weitere wichtige Richtlinie: Testen Sie immer Ihre Änderungen. Falls Sie über ein Exploit verfügen, probieren Sie es aus und sehen Sie, ob es wirklich beim nicht reparierten Paket erfolgreich ist und am reparierten Paket scheitert. Testen Sie auch andere normale Aktionen, da eine Sicherheitsreparatur manchmal scheinbar nicht betroffene Funktionen auf raffinierte Weise stört.
fr: Une autre règle importante découle de ce qui précède : testez toujours vos changements. Si une exploitation du problème existe, essayez-la et vérifiez qu'elle réussit sur le paquet non corrigé et échoue sur le paquet corrigé. Testez aussi les autres actions normales, car un correctif de sécurité peut parfois casser de manière subtile des fonctionnalités apparemment découplées.
ja: これに関してはもう一つ重要な指針があります: 必ず変更についてテストをしてください。攻撃用コード (exploit) が入手可能な場合には、それを試してみて、パッチを当てていないパッケージで成功するか、修正したパッケージでは失敗することかどうかを確かめてみてください。他の確認として、セキュリティ修正は時折表面上はそれと関係が無いような機能を壊すことがあるので、通常の動作も同様にテストしてください。

source: Do <emphasis role="strong">NOT</emphasis> include any changes in your package which are not directly related to fixing the vulnerability. These will only need to be reverted, and this wastes time. If there are other bugs in your package that you would like to fix, make an upload to proposed-updates in the usual way, after the security advisory is issued. The security update mechanism is not a means for introducing changes to your package which would otherwise be rejected from the stable release, so please do not attempt to do this.
de: Nehmen Sie <emphasis role="strong">KEINE</emphasis> Änderungen in Ihr Paket auf, die sich nicht direkt auf die Reparatur der Schwachstelle beziehen. Diese müssten rückgängig gemacht werden, was Zeit kostet. Falls es in Ihrem Paket andere Fehler gibt, die Sie gerne beheben würden, machen Sie auf dem üblichen Weg ein Upload nach »proposed-updates«, nachdem die Sicherheitswarnung veröffentlicht wurde. Der Sicherheits-Aktualisierungsmechanismus ist kein Mittel, um Änderungen an Ihrem Paket einzuführen, die andernfalls vom Stable-Release abgelehnt worden wären, unterlassen sie es also.
fr: N'ajoutez <emphasis role="strong">pas</emphasis> de modifications au paquet qui ne soient pas directement liés à la correction de la vulnérabilité. Celles-ci devraient alors être enlevées ce qui ne représentera qu'une perte de temps. S'il y a d'autres bogues dans votre paquet que vous aimeriez corriger, faites un envoi vers proposed-updates de la façon habituelle, après l'envoi de l'alerte de sécurité. Le mécanisme de mise à jour de sécurité n'est pas un moyen d'introduire des changements dans votre paquet qui serait sinon rejeté de la distribution stable, veuillez donc ne pas essayer de le faire.
ja: 脆弱性の修正に直接関係しない変更をパッケージへ<emphasis role="strong">加えない</emphasis>ようにしてください。この様な変更は元に戻さなくてはならなくなるだけで、時間を無駄にします。他に直したいバグがパッケージにある場合は、セキュリティ勧告が発行された後、通常通りに proposed-update にアップロードを行ってください。セキュリティ更新の仕組みは、それ以外の方法では安定版リリースから reject されるであろう変更をあなたのパッケージに加える方法ではありませんので、この様な事はしないでください。
