Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: <systemitem role="package">devscripts</systemitem> is a package containing wrappers and tools which are very helpful for maintaining your Debian packages. Example scripts include <command>debchange</command> and <command>dch</command>, which manipulate your <filename>debian/changelog</filename> file from the command-line, and <command>debuild</command>, which is a wrapper around <command>dpkg-buildpackage</command>. The <command>bts</command> utility is also very helpful to update the state of bug reports on the command line. <command>uscan</command> can be used to watch for new upstream versions of your packages. <command>debrsign</command> can be used to remotely sign a package prior to upload, which is nice when the machine you build the package on is different from where your GPG keys are.
de: <systemitem role="package">devscripts</systemitem> ist ein Paket, das Wrapper und Werkzeuge enthält, die die sehr hilfreich für die Verwaltung von Debian-Paketen sind. Beispielskripte beinhalten <command>debchange</command> und <command>dch</command>, die Ihre <filename>debian/changelog</filename>-Datei von der Befehlszeile manipulieren und <command>debuild</command>, das ein Wrapper um <command>dpkg-buildpackage</command> ist. Außerdem ist das Hilfswerkzeug <command>bts</command> sehr hilfreich, um den Status von Fehlerberichten auf der Befehlszeile zu aktualisieren. <command>uscan</command> kann benutzt werden, um neue Versionen Ihres Pakets von den Originalautoren zu beobachten. <command>debrsign</command> kann benutzt werden, um ein Paket vor dem Upload aus der Ferne zu signieren, was angenehm ist, wenn der Rechner, auf dem Sie das Paket erstellen, sich von dem unterscheidet, auf dem die GPG-Schlüssel liegen.
fr: <systemitem role="package">devscripts</systemitem> contient des scripts et outils très pratiques pour maintenir les paquets Debian. Parmi ces scripts, <command>debchange</command> et <command>dch</command> manipulent le fichier <filename>debian/changelog</filename> en ligne de commande et <command>debuild</command> est une sur-couche à <command>dpkg-buildpackage</command>. L'utilitaire <command>bts</command> est aussi très pratique pour mettre à jour l'état des rapports de bogue en ligne de commande. <command>uscan</command> permet de suivre les nouvelles versions amont de vos paquets. <command>debrsign</command> permet de signer un paquet à distance avant de l'envoyer, ce qui est bien utile quand la machine de construction de paquet est différente de celle où résident vos clés GPG.
ja: <systemitem role="package">devscripts</systemitem> は、Debian パッケージをメンテナンスするのに非常に有用なラッパーやツールを含むパッケージです。スクリプトの例としては <filename>debian/changelog</filename> ファイルをコマンドラインから操作する <command>debchange</command> および <command>dch</command>、そして <command>dpkg-buildpackage</command> 関連のラッパーである <command>debuild</command> を含んでいます。<command>bts</command> ユーティリティも、バグ報告の状態をコマンドライン上で更新するのにとても役立ちます。<command>uscan</command> はパッケージの新しいバージョン (new upstream version) をチェックするのに使えます。<command>debrsign</command> は、リモートでアップロード前にパッケージにサインするのに利用できます。これは GPG があるのとは違うマシンでパッケージをビルドした際に便利です。

source: See the <citerefentry> <refentrytitle>devscripts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> manual page for a complete list of available scripts.
de: Eine vollständige Liste der verfügbaren Skripte finden Sie auf der Handbuchseite <citerefentry> <refentrytitle>devscripts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
fr: Voir la page de manuel <citerefentry> <refentrytitle>devscripts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> pour une liste complète des scripts disponibles.
ja: 利用可能なスクリプトの全リストについては <citerefentry> <refentrytitle>devscripts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> マニュアルページを参照してください。

source: <systemitem role="package">autotools-dev</systemitem> contains best practices for people who maintain packages which use <command>autoconf</command> and/or <command>automake</command>. Also contains canonical <filename>config.sub</filename> and <filename>config.guess</filename> files which are known to work on all Debian ports.
de: <systemitem role="package">autotools-dev</systemitem> enthält optimale Vorgehensweisen für Leute, die Pakete betreuen, die <command>autoconf</command> und/oder <command>automake</command> benutzen. Außerdem anthält es vorschriftsmäßige <filename>config.sub</filename>- und <filename>config.guess</filename>-Dateien, von denen bekannt ist, dass sie auf allen Debian-Portierungen funktionieren.
fr: <systemitem role="package">autotools-dev</systemitem> contient les meilleurs pratiques pour les responsables des paquets qui utilisent <command>autoconf</command> ou <command>automake</command>. Il contient également les fichiers canoniques <filename>config.sub</filename> et <filename>config.guess</filename>, connus pour fonctionner avec tous les portages Debian.
ja: <systemitem role="package">autotools-dev</systemitem> は、<command>autoconf</command> や <command>automake</command> を使っているパッケージをメンテナンスする人にとってのベストプラクティスを含んでいます。また、全ての Debian 移植版で動作することを知られている正規の <filename>config.sub</filename> および <filename>config.guess</filename> ファイルを含んでいます。

source: <command>dpkg-repack</command> creates Debian package file out of a package that has already been installed. If any changes have been made to the package while it was unpacked (e.g., files in <filename>/etc</filename> were modified), the new package will inherit the changes.
de: <command>dpkg-repack</command> erstellt eine Debian-Paketdatei aus einem Paket, das bereits installiert wurde. Falls irgendwelche Änderungen vorgenommen wurden, während das Pakert entpackt war (es wurden z.B. Dateien in <filename>/etc</filename> verändert), wird das neue Paket die Änderungen erben.
fr: <systemitem role="package">dpkg-repack</systemitem> crée un paquet Debian à partir d'un paquet déjà installé. Si des changements ont été effectués sur le paquet depuis qu'il a été installé (des fichiers de <filename>/etc</filename> modifiés par exemple), le nouveau paquet héritera de ces changements.
ja: <command>dpkg-repack</command> は既にインストールされているパッケージから Debian パッケージを生成します。パッケージが展開されてから何かしら変更が加えられている場合 (例えば、<filename>/etc</filename> にあるファイルが変更されているなど)、新しいパッケージは変更を含みます。

source: This utility can make it easy to copy packages from one computer to another, or to recreate packages which are installed on your system but no longer available elsewhere, or to save the current state of a package before you upgrade it.
de: Dieses Hilfswerkzeug kann das Kopieren von Paketen von einem Rechner zu einem anderen, das Neuerstellen von Paketen, die auf Ihrem System installiert wurden, aber nirgendwo mehr verfügbar sind oder das Sichern des derzeitigen Paketstatus vor dem Upgrade vereinfachen.
fr: Cet utilitaire peut faciliter la copie de paquet d'un ordinateur à un autre, ou la recréation de paquets installés sur un système qui ne sont plus disponibles ailleurs, ou pour sauvegarder l'état actuel d'un paquet avant de le mettre à jour.
ja: このユーティリティは、一つのコンピュータから他のコンピュータへパッケージをコピーするのを簡単にできるようにしてくれます。また、あなたのシステムにはインストールされているがどこでも入手できなくなってしまったパッケージを再作成したり、アップグレード前にパッケージの現在の状態を保存するのに使えます。

source: <command>alien</command> converts binary packages between various packaging formats, including Debian, RPM (RedHat), LSB (Linux Standard Base), Solaris, and Slackware packages.
de: <command>alien</command> wandelt Binärpakete zwischen verschiedenen Paketformaten, einschließlich Debian, RPM (RedHat), LSB (Linux Standard Base), Solaris und Slackware um.
fr: <systemitem role="package">alien</systemitem> convertit des paquets binaires entre différents formats de paquets, y compris des paquets Debian, RPM (RedHat), LSB (Linux Standard Base), Solaris et Slackware.
ja: <command>alien</command> は、Debian、RPM (RedHat)、LSB (Linux Standard Base)、Solaris、Slackware などの各種バイナリパッケージのパッケージ形式を変換します。

source: <command>debsums</command> checks installed packages against their MD5 sums. Note that not all packages have MD5 sums, since they aren't required by Policy.
de: <command>debsums</command> überprüft die MD5-Prüfsummen von installierten Paketen. Beachten Sie, dass nicht alle Pakete MD5-Prüfsummen haben, da diese nicht von den Richtlinien vorgeschrieben werden.
fr: <systemitem role="package">debsums</systemitem> vérifie des paquets installés par rapport à leurs sommes de contrôle MD5. Remarquez que les paquets n'ont pas tous des sommes de contrôle MD5 car elles ne sont pas requises par la Charte.
ja: <command>debsums</command> は、インストールされたパッケージについて MD5 sum をチェックします。ポリシーでは必要とされていないため、全てのパッケージが MD5 sum を持ってはいないことに注意ください。

source: <systemitem role="package">dpkg-dev-el</systemitem> is an Emacs lisp package which provides assistance when editing some of the files in the <filename>debian</filename> directory of your package. For instance, there are handy functions for listing a package's current bugs, and for finalizing the latest entry in a <filename>debian/changelog</filename> file.
de: <systemitem role="package">dpkg-dev-el</systemitem> ist ein Emacs-Lisp-Paket, das Unterstützung beim Bearbeiten von Dateien im <filename>debian</filename>-Verzeichnis Ihres Pakets bietet. Es gibt dort zum Beispiel praktische Funktionen, um die aktuellen Fehler eines Programm aufzulisten und um den letzten Eintrag in einer <filename>debian/changelog</filename>-Datei zu beenden.
fr: <systemitem role="package">dpkg-dev-el</systemitem> fournit des macros Emacs Lisp pour faciliter l'édition des fichiers du répertoire <filename>debian</filename>. Par exemple, des fonctions pratiques permettent de lister les bogues actuels d'un paquet et de finaliser la dernière entrée d'un fichier <filename>debian/changelog</filename>.
ja: <systemitem role="package">dpkg-dev-el</systemitem> は、パッケージの <filename>debian</filename> ディレクトリにあるファイルを編集する際に手助けしてくれる Emacs lisp パッケージです。例えば、パッケージの現在のバグをリストアップしてくれたり、<filename>debian/changelog</filename> ファイル中の最新のエントリの終端処理してくれたりするのための手軽な機能があります。

source: <command>dpkg-depcheck</command> (from the <systemitem role="package">devscripts</systemitem> package, <xref linkend="devscripts"/>) runs a command under <command>strace</command> to determine all the packages that were used by the said command.
de: <command>dpkg-depcheck</command> (aus dem Paket <systemitem role="package">devscripts</systemitem>, <xref linkend="devscripts"/>) führt einen Befehl unter <command>strace</command> aus, um festzustellen, welche Pakete vom angegebenen Befehl benutzt werden.
fr: <command>dpkg-depcheck</command> (du paquet <systemitem role="package">devscripts</systemitem>, <xref linkend="devscripts"/>) exécute une commande sous <command>strace</command> pour déterminer tous les paquets utilisés par la commande.
ja: (<systemitem role="package">devscripts</systemitem> パッケージ、<xref linkend="devscripts"/> より) <command>dpkg-depcheck</command> は、指定されたコマンドによって使われた全てのパッケージを確認するため、コマンドを <command>strace</command> の下で実行します。

source: For Debian packages, this is useful when you have to compose a <literal>Build-Depends</literal> line for your new package: running the build process through <command>dpkg-depcheck</command> will provide you with a good first approximation of the build-dependencies. For example:
de: Für Debian-Pakete ist dies nützlich, wenn Sie eine <literal>Build-Depends</literal>-Zeile für Ihr neues Paket verfassen müssen: den Build-Prozess durch <command>dpkg-depcheck</command> auszuführen wird Sie mit einer guten ersten Annäherung von Build-Abhängigkeiten versorgen. Zum Beispiel:
fr: Pour les paquets Debian, c'est utile pour créer une ligne <literal>Build-Depends</literal> d'un nouveau paquet : exécuter le processus de compilation avec <command>dpkg-depcheck</command> fournira une bonne première approximation des dépendances de compilation. Par exemple :
ja: Debian パッケージについていうと、これは新しいパッケージの <literal>Build-Depends</literal> 行を構成するのが必要になった際に役立ちます。<command>dpkg-depcheck</command> を通してビルド作業を実行すると、最初の大まかなビルドの依存関係を良い形で得られます。例えば以下の様にします:

source: <command>dpkg-depcheck</command> can also be used to check for run-time dependencies, especially if your package uses <citerefentry> <refentrytitle>exec</refentrytitle> <manvolnum>2</manvolnum> </citerefentry> to run other programs.
de: <command>dpkg-depcheck</command> kann außerdem benutzt werden um Laufzeitabhängigkeiten zu prüfen, insbesondere, wenn Ihr Paket <citerefentry> <refentrytitle>exec</refentrytitle> <manvolnum>2</manvolnum> </citerefentry> benutzt, um andere Programme auszuführen.
fr: <systemitem role="package">dpkg-depcheck</systemitem> peut aussi être utilisé pour vérifier les dépendances d'exécution, d'autant plus si le paquet utilise <citerefentry> <refentrytitle>exec</refentrytitle> <manvolnum>2</manvolnum> </citerefentry> pour exécuter d'autres programmes.
ja: <command>dpkg-depcheck</command> は、特にパッケージが他のプログラムを実行するのに <citerefentry> <refentrytitle>exec</refentrytitle> <manvolnum>2</manvolnum> </citerefentry> を使っている場合に実行時の依存性を確認するのにも使えます。

source: For more information please see <citerefentry> <refentrytitle>dpkg-depcheck</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
de: Weitere Informationen finden Sie unter <citerefentry> <refentrytitle>dpkg-depcheck</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
fr: Pour plus d'informations, veuillez voir <citerefentry> <refentrytitle>dpkg-depcheck</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ja: より詳細については、<citerefentry> <refentrytitle>dpkg-depcheck</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> を参照してください。

source: Porting tools
de: Portierungswerkzeuge
fr: Outils de portage
ja: 移植用ツール

source: The following tools are helpful for porters and for cross-compilation.
de: Die folgenden Werkzeuge sind hilfreich für Portierer und Kompilierung für andere Plattformen.
fr: Les outils suivants sont pratiques pour les porteurs et la compilation croisée (« <literal>cross-compilation</literal> »).
ja: 以下のツールが、移植作業者やクロスコンパイル作業に役立ちます。

source: <systemitem role="package">quinn-diff</systemitem> is used to locate the differences from one architecture to another. For instance, it could tell you which packages need to be ported for architecture <replaceable>Y</replaceable>, based on architecture <replaceable>X</replaceable>.
de: <systemitem role="package">quinn-diff</systemitem> wird benutzt, um die Unterschiede zwischen zwei Architekturen zu finden. Es könnte zum Beispiel aufzeigen, welche Pakete für die Architektur <replaceable>Y</replaceable> basierend auf Architektur <replaceable>X</replaceable> portiert werden müssen.
fr: <systemitem role="package">quinn-diff</systemitem> est utilisé pour localiser les différences d'une architecture à l'autre. Il permet de déterminer, par exemple, quels paquets de l'architecture <replaceable>X</replaceable> doivent être portés sur l'architecture <replaceable>Y</replaceable>.
ja: <systemitem role="package">quinn-diff</systemitem> は、あるアーキテクチャと他のアーキテクチャとの違いを確認するのに使われます。例えば、<replaceable>X</replaceable> アーキテクチャをベースに <replaceable>Y</replaceable> アーキテクチャに移植するにはどのパッケージが必要なのかを教えてくれます。

source: <systemitem role="package">dpkg-cross</systemitem> is a tool for installing libraries and headers for cross-compiling in a way similar to <systemitem role="package">dpkg</systemitem>. Furthermore, the functionality of <command>dpkg-buildpackage</command> and <command>dpkg-shlibdeps</command> is enhanced to support cross-compiling.
de: <systemitem role="package">dpkg-cross</systemitem> ist ein Werkzeug, um Bibliotheken und Header zum Kompilieren auf anderen Plattformen auf eine Art zu installieren, die <systemitem role="package">dpkg</systemitem> ähnlich ist. Weiterhin wird die Funktionalität von <command>dpkg-buildpackage</command> und <command>dpkg-shlibdeps</command> durch die Unterstützung vom Kompilieren auf anderen Plattformen verbessert.
fr: <systemitem role="package">dpkg-cross</systemitem> est un outil qui installe les bibliothèques et les en-têtes nécessaires à une compilation croisée (« <literal>cross-compilation</literal> ») d'une manière similaire à <systemitem role="package">dpkg</systemitem>. De plus, les fonctionnalités de <command>dpkg-buildpackage</command> et <command>dpkg-shlibdeps</command> ont été améliorées pour accepter les compilations croisées.
ja: <systemitem role="package">dpkg-cross</systemitem> は、<systemitem role="package">dpkg</systemitem> に似た方法でクロスコンパイルするためのライブラリとヘッダをインストールするツールです。さらに、<command>dpkg-buildpackage</command> および <command>dpkg-shlibdeps</command> の機能がクロスコンパイルをサポートするように拡張されます。

source: Documentation and information
de: Dokumentation und Information
fr: Documentation et information
ja: ドキュメントと情報について

source: The following packages provide information for maintainers or help with building documentation.
de: Die folgenden Pakete stellen Informationen für Betreuer zur Verfügung oder helfen bei der Erstellung von Dokumentation.
fr: Les paquets suivants fournissent des informations pour les responsables ou de l'aide pour construire de la documentation.
ja: 以下のパッケージが、メンテナへの情報提供やドキュメントの作成に役立ちます。

source: <systemitem role="package">docbook-xml</systemitem> provides the DocBook XML DTDs, which are commonly used for Debian documentation (as is the older debiandoc SGML DTD). This manual, for instance, is written in DocBook XML.
de: <systemitem role="package">docbook-xml</systemitem> stellt die DocBook-XML-DTDen bereit, die häufig für Debian-Dokumentation benutzt werden (genauso wie die ältere Debiandoc-SGML-DTD). Dieses Handbuch wurde zum Beispiel in Docbook-XML verfasst.
fr: <systemitem role="package">docbook-xml</systemitem> fournit la définition de type de document (« <literal>Document Type Definition</literal> » ou <literal>DTD</literal>) XML pour DocBook, souvent utilisé pour la documentation Debian (de même que la plus ancienne DTD SGML pour DebianDoc). Ce manuel, par exemple, est écrit en XML pour DocBook.
ja: <systemitem role="package">docbook-xml</systemitem> は Debian のドキュメントで一般的に使われている DocBook XML DTD を提供します (古いものは debiandoc SGML DTD を使っています) 。例えば、このマニュアルは DocBook XML で書かれています。

source: The <systemitem role="package">docbook-xsl</systemitem> package provides the XSL files for building and styling the source to various output formats. You will need an XSLT processor, such as <systemitem role="package">xsltproc</systemitem>, to use the XSL stylesheets. Documentation for the stylesheets can be found in the various <systemitem role="package">docbook-xsl-doc-*</systemitem> packages.
de: Das Paket <systemitem role="package">docbook-xsl</systemitem> stellt die XSL-Dateien zum Erstellen und Gestalten der Quelle in verschiedenen Ausgabeformaten bereit. Sie benötigen ein XSLT-Bearbeitungsprogramm wie <systemitem role="package">xsltproc</systemitem>, um die XSL-Stylesheets zu verwenden. Dokumentation für die Stylesheets kann in den verschiedenen <systemitem role="package">docbook-xsl-doc-*</systemitem>-Paketen gefunden werden.
fr: <systemitem role="package">docbook-xsl</systemitem> fournit les fichiers XSL pour construire et décliner les sources en de multiples formats de sortie. Vous devriez utiliser un processeur de ligne de commande XSLT, tel que <systemitem role="package">xsltproc</systemitem>, pour utiliser les feuilles de style XSL. La documentation des feuilles de style est disponible dans les nombreux paquets <systemitem role="package">docbook-xsl-doc-*</systemitem>.
ja: <systemitem role="package">docbook-xsl</systemitem> パッケージは、ソースをビルドして様々な出力フォーマットに整形する XSL ファイルを提供します。XSL スタイルシートを使うには <systemitem role="package">xsltproc</systemitem> のような XSLT プロセッサが必要になります。スタイルシートのドキュメントは各種 <systemitem role="package">docbook-xsl-doc-*</systemitem> パッケージで確認できます。

source: To produce PDF from FO, you need an FO processor, such as <systemitem role="package">xmlroff</systemitem> or <systemitem role="package">fop</systemitem>. Another tool to generate PDF from DocBook XML is <systemitem role="package">dblatex</systemitem>.
de: Um PDF aus FO zu erstellen, benötigen Sie ein FO-Bearbeitungsprogramm wie <systemitem role="package">xmlroff</systemitem> oder <systemitem role="package">fop</systemitem>. Ein weiteres Werkzeug, um PDF aus DocBook-XML zu generieren ist <systemitem role="package">dblatex</systemitem>.
fr: Pour fabriquer des PDF à partir des FO (« <literal>Formatting Objects</literal> »), il faut un processeur de FO comme <systemitem role="package">xmlroff</systemitem> ou <systemitem role="package">fop</systemitem>. <systemitem role="package">dblatex</systemitem> est un autre outil pour générer des PDF à partir des XML pour DocBook.
ja: FO から PDF を生成するには、<systemitem role="package">xmlroff</systemitem> や <systemitem role="package">fop</systemitem> のような FO プロセッサが必要です。他に DocBook XML から PDF を生成するツールとしては <systemitem role="package">dblatex</systemitem> があります。

source: <systemitem role="package">debiandoc-sgml</systemitem> provides the DebianDoc SGML DTD, which is commonly used for Debian documentation, but is now deprecated (<systemitem role="package">docbook-xml</systemitem> should be used instead). It also provides scripts for building and styling the source to various output formats.
de: <systemitem role="package">debiandoc-sgml</systemitem> stellt die DebianDoc-SGML-DTD bereit, die normalerweise für Debian-Dokumentation benutzt aber nun missbilligt wird (stattdessen sollte <systemitem role="package">docbook-xml</systemitem> benutzt werden). Es stellt außerdem Skripte zum Erstellen und Gestalten der Quelle in verschiedenen Ausgabeformaten bereit.
fr: <systemitem role="package">debiandoc-sgml</systemitem> fournit la définition de type de document (« <literal>Document Type Definition</literal> » ou <literal>DTD</literal>) SGML pour DebianDoc, souvent utilisé pour la documentation Debian, mais est maintenant déconseillé (<systemitem role="package">docbook-xml</systemitem> devrait être utilisé à la place). Il fournit également des scripts pour construire et décliner les sources en de multiples formats de sortie.
ja: <systemitem role="package">debiandoc-sgml</systemitem> は Debian のドキュメントで一般的に使われている DebianDoc SGML DTD を提供します。しかし、現在は非推奨 (deprecated) となっています (代わりに<systemitem role="package">docbook-xml</systemitem> を使うようにしてください)。これも、ソースをビルドして様々な出力フォーマットに整形するスクリプトを提供します。

source: Documentation for the DTD can be found in the <systemitem role="package">debiandoc-sgml-doc</systemitem> package.
de: Dokumentation für die DTD kann im Paket <systemitem role="package">debiandoc-sgml-doc</systemitem> gefunden werden.
fr: De la documentation sur la DTD est disponible dans le paquet <systemitem role="package">debiandoc-sgml-doc</systemitem>.
ja: ドキュメント用の DTD は <systemitem role="package">debiandoc-sgml-doc</systemitem> パッケージで確認できます。

source: Contains the public GPG and PGP keys of Debian developers. See <xref linkend="key-maint"/> and the package documentation for more information.
de: enthält die öffentlichen GPG- und PGP-Schlüssel der Debian-Entwickler. Siehe <xref linkend="key-maint"/> und die Paketdokumentation für weitere Informationen.
fr: Contient les clés publiques GPG et PGP des développeurs Debian. Voir <xref linkend="key-maint"/> et la documentation du paquet pour plus d'informations.
ja: Debian 開発者の公開 GPG/PGP 鍵を含んでいます。詳細については <ulink url="&url-wiki-dm;"></ulink> とパッケージ内のドキュメントを参照してください。

source: Contains the public GPG keys of Debian Maintainers. See <ulink url="&url-wiki-dm;"></ulink> for more information.
de: enthält die öffentlichen GPG-Schlüssel der Debian-Betreuer. Siehe <ulink url="&url-wiki-dm;"></ulink> für weitere Informationen.
fr: Contient les clés publiques GPG des responsables Debian. Voir <ulink url="&url-wiki-dm;"></ulink> et la documentation du paquet pour plus d'informations.
ja: Debian メンテナの公開 GPG 鍵を含んでいます。詳細については <ulink url="&url-wiki-dm;"></ulink> を参照してください。
