Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: Rather than being a question per se, this datatype indicates a note that can be displayed to the user. It should be used only for important notes that the user really should see, since debconf will go to great pains to make sure the user sees it; halting the install for them to press a key, and even mailing the note to them in some cases.
de: Statt per se eine Frage zu sein, gibt dieser Datentyp eine Anmerkung an, die dem Benutzer angezeigt werden kann. Sie sollte nur für wichtige Anmerkungen benutzt werden, die der Benutzer wirklich sehen sollte, weil Debconf großen Aufwand betreibt, um sicherzustellen, dass der Benutzer sie sieht und die Installation anhält, so dass der Benutzer eine Taste drückt und sogar in manchen Fällen eine Benachrichtigung per E-Mail bekommt.
fr: plus qu'une vraie question, ce type indique une note affichée aux utilisateurs. Elle doit être réservée à des informations importantes que l'utilisateur doit absolument voir, car <systemitem role="package">debconf</systemitem> fera tout pour s'assurer qu'elle soit visible, en interrompant l'installation jusqu'à ce qu'une touche soit appuyée, voire en envoyant la note par courrier électronique dans certains cas.
ja: 本来質問ではありませんが、このデータ型が示すのはユーザに表示することができる覚え書きです。debconf はユーザが必ず参照するようにするため、多大な苦痛を与えることになる (キーを押すためにインストールを休止したり、ある場合にはメモをメールさえする) ので、ユーザが知っておく必要がある重要な記述にのみ使うべきです。

source: text
fr: <literal>text</literal>

source: This type is now considered obsolete: don't use it.
de: Dieser Typ wird nun als veraltet angesehen: Benutzen Sie ihn nicht.
fr: ce type est maintenant obsolète : il ne faut pas l'utiliser.
ja: この type は現状では古すぎるものと考えられています: 使わないでください。

source: error
fr: <literal>error</literal>

source: This type is designed to handle error messages. It is mostly similar to the note type. Frontends may present it differently (for instance, the dialog frontend of cdebconf draws a red screen instead of the usual blue one).
de: Dieser Typ wurde entworfen, um Fehlermeldungen zu handhaben. Er ist meist dem Typ »note« ähnlich. Oberflächen könnten ihn unterschiedlich anzeigen (die Oberfläche von Cdebconf zeichnet beispielsweise einen roten statt des üblichen blauen Bildschirms).
fr: ce type permet de gérer des messages d'erreur. Il est analogue au type <literal>note</literal>. Les interfaces utilisateur peuvent le présenter différemment (par exemple l'interface <literal>cdebconf</literal> dessine un écran à fond rouge au lieu de l'écran bleu habituel).
ja: この type はエラーメッセージを取り扱うためにデザインされています。ほとんど note 型と似通っています。違いはフロントエンドが存在しているであろうことです (例えば、cdebconf の dialog フロントエンドは通常の青い画面ではなく、赤い画面を描画します)。

source: It is recommended to use this type for any message that needs user attention for a correction of any kind.
de: Es wird empfohlen, diesen Typ für jegliche Nachricht zu verwenden, die die Aufmerksamkeit des Anwenders für irgendeine Art von Korrektur auf sich ziehen muss.
fr: Il est recommandé d'utiliser ce type pour tout message qui requiert l'attention de l'utilisateur pour procéder à une correction, quelle qu'elle soit.
ja: 何かを補正するためにユーザの注意を引く必要があるメッセージに対し、この type を使うのがお勧めです。

source: Description: short and extended description
de: Description: Kurze und längere Beschreibung
fr: <literal>Description</literal> : descriptions courte et étendue
ja: Description: short および extended 説明文

source: Template descriptions have two parts: short and extended. The short description is in the Description: line of the template.
de: Schablonenbeschreibungen haben zwei Teile: kurz und länger. Die Kurzbeschreibung steht in der Zeile »Description:« der Schablone.
fr: Les descriptions de modèles comportent deux parties : la partie courte et la partie étendue. La partie courte est celle qui est placée sur la ligne <literal>Description</literal> du modèle.
ja: テンプレート説明文は 2 つのパートに分かれます: short と extended です。短い説明文 (short description) はテンプレートの Description: 行にあります。

source: The short description should be kept short (50 characters or so) so that it may be accommodated by most debconf interfaces. Keeping it short also helps translators, as usually translations tend to end up being longer than the original.
de: Die Kurzbeschreibung sollte knapp gehalten werden (ungefähr 50 Zeichen), so dass sie in den meisten Debconf-Schnittstellen untergebracht werden kann. Es hilft obendrein Übersetzern, wenn sie kurz gehalten wird, da Übersetzungen normalerweise dazu neigen, länger als das Original zu sein.
fr: La partie courte doit rester courte (une cinquantaine de caractères) afin d'être gérée par la majorité des interfaces de <systemitem role="package">debconf</systemitem>. La garder courte facilite également le travail des traducteurs car les traductions sont souvent plus longues que les textes originaux.
ja: 短い説明文は、ほとんどの debconf インターフェイスに適用するように、短く (50 文字程度に) しておく必要があります。通常、翻訳はオリジナルよりも長くなる傾向にあるので、短くすることは翻訳作業者を助けます。

source: The short description should be able to stand on its own. Some interfaces do not show the long description by default, or only if the user explicitely asks for it or even do not show it at all. Avoid things like What do you want to do?
de: Die Kurzbeschreibung sollte für sich allein stehen können. Einige Schnittstellen zeigen standardmäßig die ausführliche Beschreibung nicht, nur dann, wenn der Benutzer danach fragt oder sogar überhaupt nicht an. Vermeiden Sie Dinge wie »Was möchten Sie tun?«
fr: La description courte doit être autonome. Certaines interfaces ne montrent pas la description longue par défaut ou ne la montrent que si l'utilisateur le demande explicitement. Il est ainsi déconseillé d'utiliser des phrases comme « <literal>What do you want to do?</literal> » (« Que voulez vous faire ? »)
ja: 短い説明文はそれ単体で成り立つようにしておく必要があります。いくつかのインターフェイスは、デフォルトでは長い説明文を表示せず、ユーザが明示的に尋ねたときに表示するか、あるいは全く表示しません。「What do you want to do?」のような表現を避けてください。

source: The short description does not necessarily have to be a full sentence. This is part of the keep it short and efficient recommendation.
de: Die Kurzbeschreibung muss nicht notwendigerweise aus einem vollständigen Satz bestehen. Dies ist Teil der Forderung nach kurzen, brauchbaren Empfehlungen.
fr: La description courte ne doit pas nécessairement être une phrase entière. C'est une façon de la garder courte et efficace.
ja: 短い説明文は完全な文章である必要はありません。これは文章を短くしておき、効率的に推奨を行うためです。

source: The extended description should not repeat the short description word for word. If you can't think up a long description, then first, think some more. Post to debian-devel. Ask for help. Take a writing class! That extended description is important. If after all that you still can't come up with anything, leave it blank.
de: Die längere Beschreibung sollte die Kurzbeschreibung nicht Wort für Wort wiederholen. Falls Ihnen keine ausführliche Beschreibung einfällt, denken Sie zuerst etwas mehr nach. Schreiben Sie an Debian-devel. Bitten Sie um Hilfe. Nehmen Sie Schreibunterricht! Diese längere Beschreibung ist wichtig. Falls Sie nach allem noch immer nicht damit zurecht kommen, lassen Sie sie leer.
fr: La partie longue ne doit pas répéter la partie courte. Si vous ne trouvez pas de partie longue appropriée, réfléchissez un peu plus. Demandez dans debian-devel. Demandez de l'aide. Prenez un cours d'écriture ! La description longue est importante. Si, malgré tout cela, vous ne trouvez rien d'intéressant à ajouter, laissez-la vide.
ja: 拡張された説明文 (extended description) は、短い説明文を一語一句繰り返しをしてはなりません。長い説明文章を思いつかなければ、まず、もっと考えてください。debian-devel に投稿しましょう。助けを求めましょう。文章の書き方講座を受講しましょう! この拡張された説明文は重要です。もし、まったく何も思いつかなければ、空のままにしておきましょう。

source: The extended description should use complete sentences. Paragraphs should be kept short for improved readability. Do not mix two ideas in the same paragraph but rather use another paragraph.
de: Die längere Beschreibung sollte in ganzen Sätzen verfasst sein. Absätze sollten kurz gehalten werden, um die Leserlichkeit zu verbessern. Vermischen Sie nicht zwei Ideen in einem Absatz, sondern benutzen Sie lieber einen anderen Absatz.
fr: La partie longue doit utiliser des phrases complètes. Les paragraphes doivent rester courts pour améliorer la lisibilité. Ne placez pas deux idées différentes dans le même paragraphe mais séparez-les en deux paragraphes.
ja: 拡張された説明文は完全な文章である必要があります。段落を短くしておくのは可読性を高めます。同じ段落で 2 つの考えを混ぜてはいけません。代わりに別の段落を書きます。

source: Don't be too verbose. User tend to ignore too long screens. 20 lines are by experience a border you shouldn't cross, because that means that in the classical dialog interface, people will need to scroll, and lot of people just don't do that.
de: Seien Sie nicht zu gesprächig. Benutzer tendieren dazu, zu lange Bildflächen zu ignorieren. 20 Zeilen sind erfahrungsgemäß die Grenze, die Sie nicht überschreiten sollten, da dies bedeuted, dass Anwender klassische Dialogfenster nicht scrollen müssen und viele Leute tun das einfach nicht.
fr: Ne soyez pas trop verbeux. Les utilisateurs ont tendance à ne pas lire les écrans trop longs. Une vingtaine de lignes est une limite que vous ne devriez pas dépasser car, avec l'interface <literal>dialog</literal> standard, les utilisateurs devront monter et descendre avec des ascenseurs, ce que la plupart des utilisateurs ne feront simplement pas.
ja: あまり冗長にしないようにしてください。ユーザは長すぎる画面を無視しようとします。経験からすると、20 行が越えてはならない境界です。何故ならば、クラシックなダイアログインターフェイスでは、スクロールする必要がでてくることになり、そして多くの人がスクロールなどしないからです。

source: The extended description should <emphasis role="strong">never</emphasis> include a question.
de: Die längere Beschreibung sollte <emphasis role="strong">keine</emphasis> Frage enthalten.
fr: La partie longue de la description ne devrait <emphasis role="strong">jamais</emphasis> comporter de question.
ja: 拡張された説明文では、質問を含めては<emphasis role="strong">決していけません</emphasis>。

source: For specific rules depending on templates type (string, boolean, etc.), please read below.
de: Um etwas über besondere Regeln zu erfahren, die vom Schablonentyp (string, boolean etc.) abhängen, lesen Sie das Folgende.
fr: Les parties qui suivent donnent des recommandations spécifiques pour certains types de modèles (<literal>string</literal>, <literal>boolean</literal>, etc.).
ja: テンプレートの type (string、boolean など) に応じた特別なルールについては、以下を読んでください。

source: Choices
fr: <literal>Choices</literal>

source: This field should be used for select and multiselect types. It contains the possible choices which will be presented to users. These choices should be separated by commas.
de: Dieses Feld sollte für »select«- und »multiselect«-Typen verwandt werden. Es enthält die Auswahlmöglichkeiten, die dem Benutzer angezeigt werden. Diese Auswahlmöglichkeiten sollten durch Kommas getrennt werden.
fr: Ce champ doit être utilisé pour les types <literal>select</literal> et <literal>multiselect</literal>. Il contient les choix proposés aux utilisateurs. Ces choix doivent être séparés par des virgules.
ja: このフィールドは select あるいは multiselect 型に使ってください。これには、ユーザに表示される可能な選択肢が含まれます。これらの選択肢はコンマで区切る必要があります。

source: Default
fr: <literal>Default</literal>

source: This field is optional. It contains the default answer for string, select and multiselect templates. For multiselect templates, it may contain a comma-separated list of choices.
de: Dieses Feld ist optional. Es enthält die vorgegebene Antwort für die »string«-, »select«- und »multiselect«-Schablonen. Für »multiselect«-Schablonen könnte es eine durch Kommas getrennte Auswahlliste enthalten.
fr: Ce champ optionnel contient la réponse par défaut pour les modèles <literal>string</literal>, <literal>select</literal> et <literal>multiselect</literal>. Dans ce dernier cas, il peut comporter une liste de choix multiples, séparés par des virgules.
ja: このフィールドはオプションです。これには、string、select あるいは multiselect のデフォルトでの答えが含まれます。multiselect テンプレートの場合、コンマで区切られた選択肢一覧が含まれます。

source: Templates fields specific style guide
de: Stil-Anleitung speziell für Schablonenfelder
fr: Guide de style spécifique à certains modèles
ja: テンプレートのフィールド固有スタイルガイド

source: Type field
de: Feld »Type«
fr: Champ <literal>Type</literal>
ja: Type フィールド

source: No specific indication except: use the appropriate type by referring to the previous section.
de: keine besondere Angabe, außer: Benutzen Sie den geeigneten Typ bezogen auf den vorhergehenden Abschnitt.
fr: Pas d'indication particulière si ce n'est choisir le type adapté en se référant à la section précédente.
ja: 特別な指定はありません。一点だけ、その前のセクションを参照して適切な type を使ってください。

source: Description field
de: Feld »Description«
fr: Champ <literal>Description</literal>
ja: Description フィールド

source: Below are specific instructions for properly writing the Description (short and extended) depending on the template type.
de: Es folgen spezifische Anweisungen für ordnungsgemäßes Verfassen der Beschreibung (kurz und länger), abhängig vom Schablonentyp.
fr: Vous trouverez ici des instructions particulières pour l'écriture du champ <literal>Description</literal> (parties courte et longue) selon le type de modèle.
ja: 以下は、テンプレートの型に応じて適切な Description (short および extended) を書くための特別な指示です。

source: String/password templates
de: »string«-/»password«-Schablonen
fr: Modèles <literal>string</literal> et <literal>password</literal>
ja: String/password テンプレート

source: The short description is a prompt and <emphasis role="strong">not</emphasis> a title. Avoid question style prompts (IP Address?) in favour of opened prompts (IP address:). The use of colons is recommended.
de: Die Kurzbeschreibung ist eine Abfrage und <emphasis role="strong">kein</emphasis> Titel. Vermeiden Sie den Fragestil (IP address?) und geben Sie offenen Abfragen (IP address:) den Vorzug. Es wird empfohlen Doppelpunkte zu benutzen.
fr: La description courte est une invite et <emphasis role="strong">pas</emphasis> un titre. Il faut éviter la forme interrogative (« <literal>IP Address?</literal> ») au profit d'une invite ouverte (« <literal>IP address:</literal> »). L'utilisation d'un deux-points final est recommandée.
ja: 短い説明文は、プロンプトであってタイトルでは<emphasis role="strong">ありません</emphasis>。質問形式のプロンプト (IP アドレスは?) を避け、代わりに閉じていない形のプロンプト (IP アドレス:) を使ってください。コロン (:) の使用をお勧めします。

source: The extended description is a complement to the short description. In the extended part, explain what is being asked, rather than ask the same question again using longer words. Use complete sentences. Terse writing style is strongly discouraged.
de: Die längere Beschreibung ist eine Ergänzung der Kurzbeschreibung. Im erweiterten Teil erklären Sie, was gefragt ist, anstatt die gleiche Frage in längerer Formulierung wieder zu stellen. Benutzen Sie ganze Sätze. Von knappem Schreibstil wird strikt abgeraten.
fr: La partie longue complète la partie courte. Il est conseillé d'y expliquer ce qui est demandé, plutôt que répéter la même demande. Utilisez des phrases complètes. Un style d'écriture abrégé est déconseillé.
ja: 拡張された説明文は、短い説明文を補足します。拡張の部分では、長い文章を使って同じ質問を繰り返すのではなく、何を質問されているのかを説明します。完全な文章を書いてください。簡潔な書き方は強く忌避されます。

source: Boolean templates
de: »boolean«-Schablonen
fr: Modèles <literal>boolean</literal>
ja: Boolean テンプレート

source: The short description should be phrased in the form of a question which should be kept short and should generally end with a question mark. Terse writing style is permitted and even encouraged if the question is rather long (remember that translations are often longer than original versions).
de: Die Kurzbeschreibung sollte in der Frageform ausgedrückt werden, die kurz gehalten und generell mit einem Fragezeichen beendet werden sollte. Knapper Schreibstil ist erlaubt und sogar gewollt, falls die Frage eher lang ist. (Denken Sie daran, dass Übersetzungen oft länger als die Originalversionen sind.)
fr: La partie courte devrait utiliser la forme interrogative et se terminer par un point d'interrogation. Un style abrégé est toléré et même encouragé si la question est complexe (les traductions vont être plus longues que la version originale).
ja: 短い説明文は、短いままで大抵の場合は ? で終わる質問の体裁の言い回しをせねばなりません。簡潔な書き方は許されており、質問が若干長い場合は推奨されすらしています (翻訳文は、大抵の場合原文よりも長くなるのを覚えておきましょう)。

source: Again, please avoid referring to specific interface widgets. A common mistake for such templates is if you answer Yes-type constructions.
de: Nochmals: Bitte vermeiden Sie, sich auf Schnittstellen-spezifische Dinge zu beziehen. Es ist ein häufiges Missverständnis bei solchen Schablonen, wenn Sie Ja-Typ-Konstruktionen antworten.
fr: Il est important de ne pas faire référence aux spécificités de certaines interfaces. Une erreur classique est d'utiliser une construction comme « <literal>If you answer Yes...</literal> » (« Si vous répondez Oui... »).
ja: 繰り返しますが、特定のインターフェイスのウィジェットを参照するのを避けてください。このようなテンプレートで良くある間違いは、「はい」と答える形かどうかです。

source: Select/Multiselect
fr: Modèles <literal>select</literal> et <literal>multiselect</literal>

source: The short description is a prompt and <emphasis role="strong">not</emphasis> a title. Do <emphasis role="strong">not</emphasis> use useless Please choose... constructions. Users are clever enough to figure out they have to choose something...:)
de: Die Kurzbeschreibung ist eine Abfrage und <emphasis role="strong">kein</emphasis> Titel. Benutzen Sie <emphasis role="strong">keine</emphasis> nutzlosen »Please choose...«-Konstruktionen. Anwender sind klug genug herauszufinden, dass sie etwas auswählen sollen ... :)
fr: La description courte est une invite et <emphasis role="strong">pas</emphasis> un titre. N'utilisez <emphasis role="strong">pas</emphasis> de constructions comme « <literal>Please choose...</literal> » (« Veuillez choisir... »). Les utilisateurs sont suffisamment intelligents pour comprendre qu'il est nécessaire de choisir quelque chose.
ja: 短い説明文は、プロンプトであってタイトルでは<emphasis role="strong">ありません</emphasis>。「Please choose...」のような意味の無い文章を文章を<emphasis role="strong">使わないで</emphasis>ください。ユーザは何かを選ぶ必要があるくらいには十分賢いです... :)

source: The extended description will complete the short description. It may refer to the available choices. It may also mention that the user may choose more than one of the available choices, if the template is a multiselect one (although the interface often makes this clear).
de: Die längere Beschreibung wird die Kurzbeschreibung vervollständigen. Sie könnte sich auf die verfügbaren Auswahlmöglichkeiten beziehen. Sie könnte zudem erwähnen, dass der Anwender unter mehr als einer verfügbaren Auswahlmöglichkeit wählen kann, falls es sich um eine »multiselect«-Schablone handelt.
fr: La description longue complète la partie courte. Elle peut faire référence aux choix disponibles. Elle peut aussi indiquer que l'utilisateur peut sélectionner plus d'un choix parmi ceux disponibles, pour les modèles <literal>multiselect</literal> (bien que l'interface rende en général cela tout à fait clair).
ja: 拡張された説明文は、短い説明文を完備します。これでは、利用可能な選択肢に言及することがあります。テンプレートが multiselect なものの場合、ユーザが選べる選択肢が 1 つではないことについても言及するかもしれません (インターフェイスが大抵これを明確にはしてくれますが)。

source: Notes
fr: Modèles <literal>note</literal>
ja: Note

source: The short description should be considered to be a <emphasis role="strong">title</emphasis>.
de: Die Kurzbeschreigung sollte als <emphasis role="strong">Titel</emphasis> betrachtet werden.
fr: La description courte doit être considérée comme un <emphasis role="strong">titre</emphasis>.
ja: 短い説明文は<emphasis role="strong">タイトル</emphasis>として扱われます。

source: The extended description is what will be displayed as a more detailed explanation of the note. Phrases, no terse writing style.
de: Die längere Beschreibung ist das, was als detaillierte Erklärung der Notiz angezeigt wird. Sätze, kein knapper Schreibstil.
fr: La partie longue est ce qui sera affiché comme description plus détaillée de la note. Il est déconseillé d'y utiliser un style abrégé.
ja: 拡張された説明文では、note のより詳細な説明を表示します。フレーズで、簡潔過ぎない書き方です。

source: <emphasis role="strong">Do not abuse debconf.</emphasis> Notes are the most common way to abuse debconf. As written in debconf-devel manual page: it's best to use them only for warning about very serious problems. The <filename>NEWS.Debian</filename> or <filename>README.Debian</filename> files are the appropriate location for a lot of notes. If, by reading this, you consider converting your Note type templates to entries in <filename>NEWS.Debian</filename> or <filename>README.Debian</filename>, plus consider keeping existing translations for the future.
de: <emphasis role="strong">Missbrauchen Sie Debconf nicht.</emphasis> Notizen sind die häufigste Art, auf die Debconf missbraucht wird. Wie steht doch in der Handbuchseite von »debconf-devel« geschrieben: Es ist am Besten, dies nur für Warnungen über sehr ernsthafte Probleme zu benutzen. Die Dateien <filename>NEWS.Debian</filename> oder <filename>README.Debian</filename> sind für viele Notizen der passende Ort. Denken Sie, wenn Sie dies lesen, darüber nach, Ihre Schablonen des Typs »notes« zu Einträgen in <filename>NEWS.Debian</filename> oder <filename>README.Debian</filename> umzuwandeln und existierende Übersetzungen für die Zukunft aufzubewahren.
fr: <emphasis role="strong">N'abusez pas de <systemitem role="package">debconf</systemitem>.</emphasis> Les notes sont un des abus les plus fréquents de debconf. Comme indiqué dans la page de manuel de debconf, elles devraient être réservées pour avertir les utilisateurs de problèmes très importants. Les fichiers <filename>NEWS.Debian</filename> ou <filename>README.Debian</filename> sont les endroits appropriés pour l'information qu'affichent la majorité des notes. Si, à la lecture de ces conseils, vous envisagez de convertir vos modèles de type note en entrée dans <filename>NEWS.Debian</filename> ou <filename>README.Debian</filename>, pensez à conserver d'éventuelles traductions existantes.
ja: <emphasis role="strong">debconf を乱用しないでください。</emphasis> note は、debconf の乱用で最も良く使われます。debconf-devel マニュアルページに書かれています: とても深刻な問題について警告する場合のみに使うのがベストです。多くの覚え書きについては、<filename>NEWS.Debian</filename> ファイルや <filename>README.Debian</filename> ファイルが適切な場所です。もし、これを読んで、Note 型のテンプレートを <filename>NEWS.Debian</filename> あるいは <filename>README.Debian</filename> 中のエントリに変換することを考えた場合、既存の翻訳を捨てないことを検討してください。

source: Choices field
de: Das Feld »Choices«
fr: Champ <literal>Choices</literal>
ja: Choices フィールド

source: If the Choices are likely to change often, please consider using the __Choices trick. This will split each individual choice into a single string, which will considerably help translators for doing their work.
de: Falls sich »Choices« zu oft ändert, sollten Sie in Betracht ziehen, zum __Choices-Trick zu greifen. Dies wird jede einzelne Auswahl in eine einzelne Zeichenkette aufteilen, was Übersetzern beträchtlich bei ihrer Arbeit helfen wird.
fr: Si les choix changent souvent, il est suggéré d'utiliser l'astuce « <literal>__Choices</literal> ». Avec ce format, chaque choix sera une chaîne différente proposée à la traduction, ce qui facilite grandement le travail des traducteurs.
ja: もし Choise が頻繁に変わるようであれば、__Choices という使い方をするのを検討してください。これは個々の選択項目を単一の文字列に分割するので、翻訳作業者が作業を行うのを助けてくれると考えられています。

source: Default field
de: Das Feld »Default«
fr: Champ <literal>Default</literal>
ja: Default フィールド

source: If the default value, for a select template, is likely to vary depending on the user language (for instance, if the choice is a language choice), please use the _Default trick.
de: Falls der Vorgabewert für eine Auswahlschablone sich wahrscheinlich abhängig von der Sprache des Anwenders unterscheidet (zum Beispiel, weil es sich bei der Auswahl um eine Sprachauswahl handelt), benutzen Sie bitte den _Default-Trick.
fr: Si la valeur par défaut d'un modèle <literal>select</literal> peut être dépendante de la langue utilisée (par exemple s'il s'agit du choix d'une langue par défaut), pensez à utiliser l'astuce « <literal>_Default</literal> ».
ja: select のテンプレートで、デフォルト値がユーザの言語に応じて変化するようであれば、_Default という使い方をしてください (例えば、選択肢が言語の選択の場合等) 。
