Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: The changelog entries should <emphasis role="strong">not</emphasis> document generic packaging issues (Hey, if you're looking for foo.conf, it's in /etc/blah/.), since administrators and users are supposed to be at least remotely acquainted with how such things are generally arranged on Debian systems. Do, however, mention if you change the location of a configuration file.
de: Die Änderungsprotokolleinträge sollten <emphasis role="strong">keine</emphasis> allgemeinen Paketierungsthemen dokumentieren (Hey, falls Sie die Foo.conf suchen, die ist in /etc/blah/.), da von Administratoren und Anwendern angenommen wird, dass sie zumindest entfernt damit vertraut sind, wie solche Dinge im Allgemeinen auf Debian-Systemen eingerichtet sind. Erwähnen Sie jedoch, wenn Sie den Ort einer Konfigurationsdatei ändern.
fr: Les entrées de journal des modifications ne devraient <emphasis role="strong">pas</emphasis> documenter les points spécifiques de la réalisation du paquet (« si vous cherchez le fichier toto.conf, il est situé dans /etc/titi ») car les administrateurs et les utilisateurs sont censés avoir l'habitude de la façon dont ces aspects sont traités sur un système Debian. Pensez, par contre, à documenter la modification de l'emplacement d'un fichier de configuration.
ja: changelog エントリは、一般的なパッケージ化の事柄 (ほら、foo.conf を探しているなら /etc/blah にあるよ) を記載するべきでは<emphasis role="strong">ありません</emphasis>。何故なら、管理者やユーザは少なくとも Debian システム上でそのようなことがどのように扱われるかを多少は知らされているでしょうから。ですが、設定ファイルの場所を変更したのであれば、それは一言添えておくべきです。

source: The only bugs closed with a changelog entry should be those that are actually fixed in the same package revision. Closing unrelated bugs in the changelog is bad practice. See <xref linkend="upload-bugfix"/>.
de: Die einzigen Fehler, die mit einem Änderungsprotokolleintrag geschlossen werden, sollten Fehler sein, die tatsächlich in der gleichen Überarbeitung des Pakets behoben werden. Das Schließen von Fehlern ohne Bezug dazu, ist eine falsche Vorgehensweise. Siehe <xref linkend="upload-bugfix"/>.
fr: Les seuls bogues fermés par une entrée de journal de modifications devraient être ceux qui sont corrigés par la version correspondante du paquet. Fermer de cette manière des bogues qui n'ont aucun rapport avec la nouvelle version est considéré comme une mauvaise habitude. Veuillez consulter <xref linkend="upload-bugfix"/>.
ja: changelog エントリでクローズされるバグは、実際にそのパッケージリビジョンで修正されたものだけにすべきです。changelog で関係ないバグを閉じるのは良くない習慣です。<xref linkend="upload-bugfix"/> を参照してください。

source: The changelog entries should <emphasis role="strong">not</emphasis> be used for random discussion with bug reporters (I don't see segfaults when starting foo with option bar; send in more info), general statements on life, the universe and everything (sorry this upload took me so long, but I caught the flu), or pleas for help (the bug list on this package is huge, please lend me a hand). Such things usually won't be noticed by their target audience, but may annoy people who wish to read information about actual changes in the package. See <xref linkend="bug-answering"/> for more information on how to use the bug tracking system.
de: Die Änderungsprotokolleinträge sollten <emphasis role="strong">nicht</emphasis> für zufällige Diskussionen mit Leuten, die Fehler melden (Ich kann keine Schutzverletzungen sehen, wenn ich Foo mit der Option Bar starte. Senden Sie weitere Informationen.), allgemeine Äußerungen über das Leben, das Universum und alles mögliche (Entschuldigung, dass der Upload so lange brauchte, aber ich hatte die Grippe.) oder Hilfeersuchen (Die Fehlerliste für dieses Paket ist riesig, bitte packen Sie mit an) benutzt werden. Solche Dinge werden normalerweise nicht von Ihrer Zielgruppe bemerkt, könnten aber viele Leute stören, die Informationen über tatsächliche Änderungen am Paket lesen möchten. Weitere Informationen über die Benutzung der Fehlerdatenbank finden Sie unter <xref linkend="bug-answering"/>.
fr: Les entrées du journal des modifications ne devraient <emphasis role="strong">pas</emphasis> être utilisées pour des discussions variées avec les émetteurs des rapports de bogues (par exemple : « je n'ai pas d'erreur de segmentation quand je lance toto avec l'option titi, merci d'envoyer plus d'informations »). De même, les considérations générales sur la vie, l'univers et le reste (« désolé, cet envoi m'a pris plus longtemps que prévu, mais j'avais un rhume ») ou encore des demandes d'aide (« la liste de bogues de ce paquet est très longue, merci de me donner un coup de main ») sont à éviter. Ces mentions ne seront généralement pas remarquées par leur public potentiel et peuvent ennuyer les personnes qui cherchent à lire les modifications concrètes du paquet. Voir <xref linkend="bug-answering"/> pour plus d'informations sur l'utilisation du système de gestion des bogues.
ja: changelog エントリは、バグ報告者との各種の議論の場 (foo をオプション bar 付きで起動した際にはセグメンテーションフォルトは見られません; もっと詳しい情報を送ってください)、生命、宇宙、そして万物についての概要 (すいませんが、このアップロードに時間がかかったので風邪をひきました)、手助けの求め (このパッケージのバグ一覧は巨大です、手を貸してください) に使うべきでは<emphasis role="strong">ありません</emphasis>。そのようなことは、大抵の場合対象としている読者は気づくことが無く、パッケージで実際にあった変更点の情報について読みたい人々を悩ますことでしょう。どの様にバグ報告システムを使えばいいのかについて、詳細な情報は<xref linkend="bug-answering"/>を参照してください。

source: It is an old tradition to acknowledge bugs fixed in non-maintainer uploads in the first changelog entry of the proper maintainer upload. As we have version tracking now, it is enough to keep the NMUed changelog entries and just mention this fact in your own changelog entry.
de: Es ist ein alter Brauch im ersten regulären Upload des Paketbetreuers das Beheben von Fehlern durch Non-Maintainer-Uploads zu bestätigen. Da Debian nun über eine Versionsverwaltung verfügt, reicht es aus, die NMU-Änderungsprotokolleinträge aufzubewahren und diese Tatsache nur in Ihrem eigenen Änderungsprotokolleintrag zu erwähnen.
fr: Une tradition assez ancienne veut que les bogues corrigés dans les NMU soient pris en compte dans la première entrée du journal des modifications d'une nouvelle version construite par le responsable. Depuis l'existence du suivi de version pour le système de gestion de bogues, cette pratique est obsolète à condition de conserver les entrées du journal des modifications des NMU. Il est éventuellement possible de simplement mentionner les NMU dans votre propre entrée de journal des modifications.
ja: 正式なメンテナによるアップロードの changelog エントリの最初で、non-maintainer upload で修正されたバグを承認するのは、古い慣習です。今はバージョン管理を行っているので、NMU された changelog エントリを残しておいて自分の changelog エントリ中でその事実に触れるだけで十分です。

source: Common errors in changelog entries
de: Häufige Fehler in Änderungsprotokolleinträgen
fr: Erreurs usuelles dans les entrées de journalisation
ja: changelog のエントリ中のよくある間違い

source: The following examples demonstrate some common errors or examples of bad style in changelog entries.
de: Die folgenden Beispiele demonstrieren einige häufige Fehler oder Beispiele für schlechten Stil in Änderungsprotokolleinträgen.
fr: Les exemples suivants sont des erreurs usuelles ou des exemples de mauvaises pratiques dans le style des entrées de journaux de modifications (NdT : le texte est volontairement laissé non traduit).
ja: 以下の例で、changelog エントリ中のよくある間違いや間違ったスタイルの例を挙げます。

source: This doesn't tell readers anything too useful, obviously.
de: Dies teilt den Lesern offensichtlich nichts Nützliches mit.
fr: Cela ne donne évidemment aucune indication au lecteur.
ja: これは、全く読み手に何も有用なことを教えてくれません。

source: What was the patch about?
de: Was war das für ein Patch?
fr: Que faisait ce correctif ?
ja: 何についてのパッチですか?

source: Overhaul which accomplished what? Is the mention of late night supposed to remind us that we shouldn't trust that code?
de: Welche Reparatur wurde ausgeführt? Soll die Erwähnung der späten Nacht daran erinnern, dass man dem Code nicht trauen sollte?
fr: Qu'est-ce que cela a amené ? Est-ce que la mention du fait que cela ait été fait tard la nuit doit nous alerter sur la probable mauvaise qualité du code ?
ja: 何をオーバーホールしてどうなったのですか? 深夜というのに言及しているのは、私たちにこのコードを信用するなと言いたいのですか?

source: Too many acronyms, and it's not overly clear what the, uh, fsckup (oops, a curse word!) was actually about, or how it was fixed.
de: Zu viele Abkürzungen und es ist nicht klar, wovon der äh ... Mist (Hoppla, ein Schimpfwort) tatsächlich handelt oder wie er repariert wurde.
fr: Trop d'acronymes qui rendent difficile de savoir ce qu'était le « merdoyage » (NdT : FU signifie « fsckup », donc cet exemple ajoute la vulgarité à l'incompréhensibilité) ou comment il a été corrigé.
ja: 略称が多すぎます。そして、ええっと、fsckup (あぁ、ひどい言葉!) は実際何だったのか、あるいはどうやって修正したのかがまったく明らかではありません。

source: First of all, there's absolutely no need to upload the package to convey this information; instead, use the bug tracking system. Secondly, there's no explanation as to why the report is not a bug.
de: Erst einmal ist es absolut unnötig, das Paket hochzuladen, um diese Information zu übermitteln. Benutzen Sie stattdessen die Fehlerdatenbank. Zweitens fehlt die Erklärung, warum dieser Bericht kein Fehler ist.
fr: Il est inutile de faire un nouvel envoi de paquet pour envoyer cette information. Il suffit de simplement utiliser le système de suivi des bogues. De plus, aucune explication n'est donnée sur les raisons qui font que le problème n'est pas un bogue.
ja: まず初めに、この情報を伝えるためにパッケージをアップロードする必要は、全くありません; 代わりにバグ追跡システムを使ってください。次に、何故この報告がバグではなかったのかについての説明がありません。

source: If for some reason you didn't mention the bug number in a previous changelog entry, there's no problem, just close the bug normally in the BTS. There's no need to touch the changelog file, presuming the description of the fix is already in (this applies to the fixes by the upstream authors/maintainers as well, you don't have to track bugs that they fixed ages ago in your changelog).
de: Falls Sie aus irgend einem Grund die Fehlernummer in einem früheren Änderungsprotokolleintrag nicht erwähnt haben, ist das kein Problem. Schließen Sie den Fehler einfach im BTS. Es ist nicht nötig, die Änderungsprotokolldatei anzurühren, vorausgesetzt, die Beschreibung der Fehlerbehebung ist bereits darin enthalten (Dies gilt auch für Reparaturen durch die Originalautoren/-Betreuer. Sie müssen keine Fehler verfolgen, die diese bereits vor Jahren in Ihrem Änderungsprotokoll behoben haben).
fr: Si, pour une raison donnée, vous avez omis de mentionner un numéro de bogue dans une entrée précédente, ce n'est pas grave : il suffit de clôturer le bogue normalement dans le système de suivi des bogues. Il est inutile de changer le journal des modifications si on suppose que les explications sur la correction du bogue sont dans le bogue lui-même (cela s'applique également au suivi des bogues des auteurs amont : il est inutile de suivre, dans le journal des modifications, les bogues qu'ils ont corrigés depuis longtemps).
ja: 何らかの理由で以前の changelog エントリ内でバグ番号について触れていなかったとしても、何も問題はありません。単にいつも通りに BTS でバグをクローズしてください。修正の記述が既にあるものと考えて、changelog ファイルに触れる必要はありません (これは、開発元の作者／メンテナによる修正にも同様に適用されます。彼らがずっと前に修正したバグを、あなたの changelog 内で追いかける必要はありません)。

source: Where's the description? If you can't think of a descriptive message, start by inserting the title of each different bug.
de: Wo ist die Beschreibung? Falls Ihnen keine aussagekräftige Nachricht einfällt, beginnen Sie, die Titel der verschiedenen Fehler einzufügen.
fr: Où est la description ? Si vous ne trouvez pas de message suffisamment explicite, vous pouvez au moins utiliser le titre du rapport de bogue.
ja: 説明はどこ? 説明文を考えられないのなら、それぞれのバグのタイトルを入れるところから始めてください。

source: Supplementing changelogs with <filename>NEWS.Debian</filename> files
de: Änderungsprotokolle mit <filename>NEWS.Debian</filename>-Dateien ergänzen
fr: Complément des journaux de modifications dans les fichiers <filename>NEWS.Debian</filename>
ja: <filename>NEWS.Debian</filename> ファイルで changelog を補足する

source: Important news about changes in a package can also be put in <filename>NEWS.Debian</filename> files. The news will be displayed by tools like <systemitem role="package">apt-listchanges</systemitem>, before all the rest of the changelogs. This is the preferred means to let the user know about significant changes in a package. It is better than using <systemitem role="package">debconf</systemitem> notes since it is less annoying and the user can go back and refer to the <filename>NEWS.Debian</filename> file after the install. And it's better than listing major changes in <filename>README.Debian</filename>, since the user can easily miss such notes.
de: Wichtige Nachrichten über Änderungen in einem Paket können auch in die <filename>NEWS.Debian</filename>-Dateien geschrieben werden. Die Nachrichten werden durch Werkzeuge wie <systemitem role="package">apt-listchanges</systemitem> vor dem ganzen Rest des Änderungsprotokolls angezeigt. Dies ist das vorzugsweise Mittel, dem Anwender bedeutende Änderungen in einem Paket mitzuteilen. Es ist besser, als <systemitem role="package">debconf</systemitem>-Notizen zu benutzen, da es weniger stört und der Anwender nach der Installation zurückgehen und in der <filename>NEWS.Debian</filename>-Datei nachschlagen kann. Es ist auch besser, als die Hauptänderungen in <filename>README.Debian</filename> aufzuführen, da der Anwender solche Notizen leicht übersehen kann.
fr: Les nouvelles importantes sur les modifications survenues dans un paquet peuvent être placées dans des fichiers <filename>NEWS.Debian</filename>. Ces nouvelles seront affichées par des outils tels que <systemitem role="package">apt-listchanges</systemitem>, avant tout le reste des modifications. Cette méthode est à privilégier pour diffuser aux utilisateurs d'un paquet les modifications importantes qu'il subit. Il est préférable de l'utiliser plutôt que des notes <systemitem role="package">debconf</systemitem> car ce système permet de revenir lire les fichiers <filename>NEWS.Debian</filename> après l'installation. Il est également préférable de faire la liste des modifications majeures dans <filename>README.Debian</filename>, car un utilisateur peut assez facilement ne pas remarquer l'affichage d'une note <systemitem role="package">debconf</systemitem> (Ndt : a contrario, les fichiers <filename>NEWS.Debian</filename> ne peuvent être traduits).
ja: パッケージの変更に関する重要なニュースは <filename>NEWS.Debian</filename> ファイルにも書くことができます。このニュースは <systemitem role="package">apt-listchanges</systemitem> のようなツールで、残りすべての changelog の前に表示されます。これは、ユーザにパッケージ内の著しい変更点について知らせるのに好ましいやり方です。インストール後にユーザが一旦戻って <filename>NEWS.Debian</filename> ファイルを参照できるので、<systemitem role="package">debconf</systemitem> の notes を使うより良いです。そして、目立った変更点を <filename>README.Debian</filename> に列挙するより良いです。何故ならば、ユーザは容易にそのような注意書きを見逃すからです。

source: The file format is the same as a debian changelog file, but leave off the asterisks and describe each news item with a full paragraph when necessary rather than the more concise summaries that would go in a changelog. It's a good idea to run your file through <literal>dpkg-parsechangelog</literal> to check its formatting as it will not be automatically checked during build as the changelog is. Here is an example of a real <filename>NEWS.Debian</filename> file:
de: Das Dateiformat entspricht dem des Änderungsprotokolls, die Sternchen werden allerdings weggelassen und jedes Nachrichtenelement wird, wenn nötig, mit einem vollständigen Satz beschrieben, statt der kurz gefassten Zusammenfassungen, die in ein Änderungsprotokoll einfließen. Sie sind gut beraten, Ihre Datei durch <literal>dpkg-parsechangelog</literal> laufen zu lassen, um ihre Formatierung zu prüfen, da sie nicht automatisch während des Builds getestet wird, so wie dies beim Änderungsprotokoll getan wird. Hier nun ein Beispiel einer echten <filename>NEWS.Debian</filename>-Datei:
fr: Le format de ce fichier est analogue à un journal de modifications Debian, mais n'utilise pas d'astérisque et chaque nouveau message utilise un paragraphe complet plutôt que les mentions succinctes qui seraient utilisées dans le journal des modifications. Il est conseillé de traiter le fichier avec <literal>dpkg-parsechangelog</literal>, ce qui permet d'en vérifier la mise en forme, car il ne sera pas automatiquement modifié pendant la construction du paquet, contrairement au journal des modifications. Voici un exemple de fichier <filename>NEWS.Debian</filename> réel :
ja: ファイル形式は debian changelog ファイルと同じですが、アスタリスク (*) を取って各ニュースを changelog に書くような簡潔な要約ではなく、必要に応じて完全な段落で記述してください。changelog のようにビルド中に自動的にはチェックされないので、ファイルを <literal>dpkg-parsechangelog</literal> を実行してチェックするのは良い考えです。実際の <filename>NEWS.Debian</filename> ファイルの例が、以下になります:

source: The <filename>NEWS.Debian</filename> file is installed as <filename>/usr/share/doc/<replaceable>package</replaceable>/NEWS.Debian.gz</filename>. It is compressed, and always has that name even in Debian native packages. If you use <literal>debhelper</literal>, <literal>dh_installchangelogs</literal> will install <filename>debian/NEWS</filename> files for you.
de: Die Datei <filename>NEWS.Debian</filename> wird als <filename>/usr/share/doc/<replaceable>Paket</replaceable>/NEWS.Debian.gz</filename> installiert. Sie ist komprimiert und hat immer diesen Namen, auch in nativen Debian-Paketen. Falls Sie <literal>debhelper</literal> benutzen, wird <literal>dh_installchangelogs</literal> die <filename>debian/NEWS</filename>-Dateien für Sie installieren.
fr: Le fichier <filename>NEWS.Debian</filename> est installé sous le nom <filename>/usr/share/doc/<replaceable>paquet</replaceable>/NEWS.Debian.gz</filename>. Il est compressé et porte toujours ce nom même pour les paquets Debian natifs. Si vous utilisez <literal>debhelper</literal>, <literal>dh_installchangelogs</literal> installera les fichiers <filename>debian/NEWS</filename> automatiquement.
ja: <filename>NEWS.Debian</filename> ファイルは <filename>/usr/share/doc/<replaceable>package</replaceable>/NEWS.Debian.gz</filename> ファイルとしてインストールされます。圧縮されていて、Debian ネイティブパッケージ中でも常にこの名前です。<literal>debhelper</literal> を使う場合は、<literal>dh_installchangelogs</literal> が <filename>debian/NEWS</filename> ファイルをインストールしてくれます。

source: Unlike changelog files, you need not update <filename>NEWS.Debian</filename> files with every release. Only update them if you have something particularly newsworthy that user should know about. If you have no news at all, there's no need to ship a <filename>NEWS.Debian</filename> file in your package. No news is good news!
de: Anders als Änderungsprotokolldateien, müssen Sie die <filename>debian/NEWS</filename>-Dateien nicht bei jeder Veröffentlichung aktualisieren. Aktualisieren Sie sie nur, wenn Sie etwas besonders berichtenswertes haben, worüber der Anwender Bescheid wissen sollte. Falls Sie überhaupt keine Nachrichten haben, ist es nicht nötig, Ihrem Paket eine <filename>debian/NEWS</filename>-Datei mitzugeben. Keine Nachricht ist eine gute Nachricht!
fr: À la différence des journaux de modifications, vous n'avez pas besoin de mettre <filename>NEWS.Debian</filename> à jour à chaque nouvelle version. Il est suffisant de le mettre à jour quand une information importante doit être diffusée aux utilisateurs. Si vous n'avez pas d'information importante à diffuser, il n'est pas nécessaire d'utiliser un fichier <filename>NEWS.Debian</filename> avec le paquet. Pas de nouvelles, bonnes nouvelles !
ja: changelog ファイルと違って、毎回のリリースごとに <filename>NEWS.Debian</filename> ファイルを更新する必要はありません。何か特にユーザが知るべき目新しいことがあったときにのみ、更新してください。全くニュースがない場合、<filename>NEWS.Debian</filename> ファイルをパッケージに入れてリリースする必要はありません。便りが無いのは良い知らせ、です (No news is good news!)。

source: Best practices for maintainer scripts
de: Optimale Vorgehensweisen für Betreuerskripte
fr: Meilleures pratiques pour les scripts du responsable
ja: メンテナスクリプトのベストプラクティス

source: Maintainer scripts include the files <filename>debian/postinst</filename>, <filename>debian/preinst</filename>, <filename>debian/prerm</filename> and <filename>debian/postrm</filename>. These scripts take care of any package installation or deinstallation setup which isn't handled merely by the creation or removal of files and directories. The following instructions supplement the <ulink url="&url-debian-policy;">Debian Policy</ulink>.
de: Betreuerskripte beinhalten die Dateien <filename>debian/postinst</filename>, <filename>debian/preinst</filename>, <filename>debian/prerm</filename> und <filename>debian/postrm</filename>. Diese Skripte geben auf jede Installations- oder Deinstallationseinrichtung des Pakets acht, die bloß durch Erstellen und Entfernen von Dateien und Verzeichnissen gehandhabt wird. Die folgenden Anweisungen ergänzen die <ulink url="&url-debian-policy;">Debian Policy</ulink>.
fr: Les scripts du responsable (« <literal>maintainer scripts</literal> ») sont les fichiers <filename>debian/postinst</filename>, <filename>debian/preinst</filename>, <filename>debian/prerm</filename> and <filename>debian/postrm</filename>. Ces scripts peuvent prendre en charge les phases d'installation ou de désinstallation non automatiquement gérées par la création ou la suppression de fichiers ou de répertoires. Les instructions qui suivent complètent celles de la Charte Debian.
ja: メンテナスクリプトには <filename>debian/postinst</filename>、<filename>debian/preinst</filename>、<filename>debian/prerm</filename>、<filename>debian/postrm</filename> ファイルが含まれます。これらのスクリプトは、単なるファイルやディレクトリの作成や削除では扱われない、パッケージのインストールと削除のセットアップの面倒をみます。以下の説明は、<ulink url="&url-debian-policy;">Debian ポリシー</ulink>を補完します。

source: Maintainer scripts must be idempotent. That means that you need to make sure nothing bad will happen if the script is called twice where it would usually be called once.
de: Betreuerskripte müssen Idempotent sein. Dies bedeuted, dass Sie sicherstellen müssen, dass nichts Schlimmes passiert, wenn das Skript zweimal aufgerufen wird, während es normalerweise einmal aufgerufen würde.
fr: Les scripts du responsable doivent être idempotents. Cela signifie que vous devez vous assurer que rien de grave ne se produit si un script est lancé deux fois au lieu d'une.
ja: メンテナスクリプトは冪等でなければなりません。これは、通常は 1 回呼ばれるスクリプトが 2 回呼ばれた場合、何も悪いことが起きないのを保証する必要があるという意味です。

source: Standard input and output may be redirected (e.g. into pipes) for logging purposes, so don't rely on them being a tty.
de: Standardein- und -ausgabe könnten zu Protokollierungszwecken umgeleitet werden (z.B. in Pipes), verlassen Sie sich daher nicht darauf, dass sie ein Terminal sind.
fr: L'entrée et la sortie standard peuvent être redirigées (par exemple dans des tuyaux, ou « <literal>pipes</literal> ») pour des besoins de journalisation. Il est donc recommandé qu'ils ne soient pas dépendants d'un terminal.
ja: 標準入出力はログの取得のためにリダイレクトされることがあります (例: パイプへ向けられる)。ですので、これらが tty であることに依存してはいけません。

source: All prompting or interactive configuration should be kept to a minimum. When it is necessary, you should use the <systemitem role="package">debconf</systemitem> package for the interface. Remember that prompting in any case can only be in the <literal>configure</literal> stage of the <filename>postinst</filename> script.
de: Jegliche Bedienerführung oder interaktive Konfiguration sollte so gering wie möglich gehalten werden. Wenn es nötig ist, sollten Sie das Paket <systemitem role="package">debconf</systemitem> für die Schnittstelle benutzen. Denken Sie daran, dass diese Bedienerführung nur in der <literal>configure</literal>-Stufe des <filename>postinst</filename>-Skripts stattfinden kann.
fr: Toute interaction avec l'utilisateur doit être limitée au maximum. Lorsqu'elle est nécessaire, vous devriez utiliser le paquet <systemitem role="package">debconf</systemitem> comme interface. Veuillez noter que l'interaction doit impérativement se faire à l'étape <literal>configure</literal> du script <filename>postinst</filename>.
ja: 質問や対話的な設定はすべて最小限に止めておく必要があります。必要になった時は、インターフェイスに <systemitem role="package">debconf</systemitem> パッケージを使いましょう。どのような場合でも、質問は <filename>postinst</filename> スクリプトの <literal>configure</literal> 段階にのみ、配置することができます。
