Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: When you have found an advocate, have your GnuPG key signed and have already contributed to Debian for a while, you're ready to apply. You can simply register on our <ulink url="&url-newmaint-apply;">application page</ulink>. After you have signed up, your advocate has to confirm your application. When your advocate has completed this step you will be assigned an Application Manager who will go with you through the necessary steps of the New Maintainer process. You can always check your status on the <ulink url="&url-newmaint-db;">applications status board</ulink>.
de: Wenn Sie einen Fürsprecher gefunden haben, Ihr GnuPG-Schlüssel signiert ist und Sie bereits eine Weile zu Debian beigetragen haben, sind Sie bereit, sich zu bewerben. Sie können sich einfach auf der <ulink url="&url-newmaint-apply;">Bewerbungsseite für neue Betreuer</ulink> registrieren. Nachdem Sie unterschrieben haben, muss Ihr Befürworter Ihre Bewerbung bestätigen. Wenn Ihr Befürworter diesen Schritt abgeschlossen hat, wird Ihnen ein Bewerbungsbetreuer zugewiesen, der mit Ihnen die nötigen Schritte des Prozesses für neue Betreuer durchläuft. Sie können jederzeit den Status auf der <ulink url="&url-newmaint-db;">Bewerberstatusanzeige</ulink> prüfen.
fr: Une fois trouvé un intercesseur, votre clé GnuPG signée et que vous avez déjà contribué au projet, vous êtes prêt à faire acte de candidature. Il vous suffit pour cela de vous enregistrer sur la <ulink url="&url-newmaint-apply;">page de candidature</ulink>. Ensuite, votre intercesseur devra confirmer votre candidature. Quand il aura accompli cette tâche, un responsable de candidature (« <literal>application manager</literal> ») sera désigné pour vous accompagner dans le processus d'enregistrement. Vous pouvez toujours consulter le <ulink url="&url-newmaint-db;">tableau de bord des candidatures</ulink> pour connaître l'état de votre candidature.
ja: 支持者 (Advocate) を見つけ、GnuPG 鍵に署名をしてもらい、既にある程度の間 Debian に対して貢献的な作業をしているのであれば、応募の準備は完了です。すぐに <ulink url="&url-newmaint-apply;">応募のページ</ulink>で登録できます。登録後、支持者 (Advocate) はあなたの応募に関してその意志を確認をする必要があります。支持者がこの手順を完了すると応募管理者 (Application Manager) に割り当てられます。応募管理者は、新規メンテナプロセスで必要となる手順をあなたと共に歩んでいく存在です。進捗状況については、常に <ulink url="&url-newmaint-db;">applications status board</ulink> のページで確認ができます。

source: For more details, please consult <ulink url="&url-newmaint;">New Maintainer's Corner</ulink> at the Debian web site. Make sure that you are familiar with the necessary steps of the New Maintainer process before actually applying. If you are well prepared, you can save a lot of time later on.
de: Für weitere Details besuchen Sie bitte die <ulink url="&url-newmaint;">New-Maintainer-Ecke</ulink> auf der Debian-Website. Stellen Sie sicher, dass sie mit den nötigen Schritten des Prozesses für neue Betreuer vertraut sind, bevor Sie sich tatsächlich bewerben. Wenn Sie gut vorbereitet sind, können Sie nachher viel Zeit sparen.
fr: Pour en savoir plus, consultez le <ulink url="&url-newmaint;">coin des nouveaux responsables</ulink> sur le site Debian. Assurez-vous de bien connaître les étapes nécessaires au processus d'enregistrement avant de vous porter candidat. Vous gagnerez beaucoup de temps si vous êtes bien préparé.
ja: より詳しい内容については Debian ウェブサイトの <ulink url="&url-newmaint;">新規メンテナのコーナー</ulink> を参考にしてください。実際の応募前に、新規メンテナプロセスでの必要な手順についてに詳しく理解しておいてください。十分に準備ができていたら、後で費やす時間を大いに減らすことができます。

source: Managing Packages
de: Pakete verwalten
fr: Gestion des paquets
ja: パッケージの取扱い方

source: This chapter contains information related to creating, uploading, maintaining, and porting packages.
de: Dieses Kapitel enthält Informationen, die sich auf das Erstellen, Hochladen Verwalten und Portieren von Paketen beziehen.
fr: Ce chapitre contient des informations relatives à la création, l'envoi, la maintenance et le portage des paquets.
ja: この章では、パッケージの作成、アップロード、メンテナンス、移植についての情報を扱います。

source: New packages
de: Neue Pakete
fr: Nouveaux paquets
ja: 新規パッケージ

source: If you want to create a new package for the Debian distribution, you should first check the <ulink url="&url-wnpp;">Work-Needing and Prospective Packages (WNPP)</ulink> list. Checking the WNPP list ensures that no one is already working on packaging that software, and that effort is not duplicated. Read the <ulink url="&url-wnpp;">WNPP web pages</ulink> for more information.
de: Falls Sie eine neues Paket für die Debian-Distribution erstellen möchten, sollten Sie zuerst die Liste der <ulink url="&url-wnpp;">Arbeit-bedürfenden und voraussichtlichen Pakete (WNPP)</ulink> prüfen. Die Prüfung der WNPP-Liste stellt sicher, dass nicht bereits jemand an der Paketierung dieser Software arbeitet und kein doppelter Aufwand betrieben wird. Weitere Informationen finden Sie auf den <ulink url="&url-wnpp;">WNPP-Web-Seiten</ulink>.
fr: Si vous voulez créer un nouveau paquet pour la distribution Debian, vous devriez commencer par consulter la liste des <ulink url="&url-wnpp;">paquets en souffrance et paquets souhaités (« <literal>Work-Needing and Prospective Packages</literal> » ou <literal>WNPP</literal>)</ulink>. Vous pourrez ainsi vérifier que personne ne travaille déjà sur ce paquet et éviter un travail en double. Consultez aussi cette page si vous voulez en savoir plus.
ja: もしあなたが Debian ディストリビューションに対して新たなパッケージを作成したいという場合、まず <ulink url="&url-wnpp;">作業が望まれるパッケージ (Work-Needing and Prospective Packages (WNPP))</ulink> の一覧をチェックする必要があります。WNPP 一覧をチェックすることで、まだ誰もそのソフトをパッケージ化していないことや、作業が重複していないことを確認します。詳細については <ulink url="&url-wnpp;">WNPP のページ</ulink> を読んでください。

source: Assuming no one else is already working on your prospective package, you must then submit a bug report (<xref linkend="submit-bug"/>) against the pseudo-package <systemitem role="package">wnpp</systemitem> describing your plan to create a new package, including, but not limiting yourself to, a description of the package, the license of the prospective package, and the current URL where it can be downloaded from.
de: Ausgehend von der Annahme, dass noch niemand an Ihrem zukünftigen Paket arbeitet, müssen Sie einen Fehlerbericht (<xref linkend="submit-bug"/>) zu dem Pseudopaket <systemitem role="package">wnpp</systemitem> senden, in dem Sie Ihren Plan vorstellen, ein neues Paket zu erzeugen, einschließlich, aber nicht nur auf eine Beschreibung des Pakets beschränkt, der Lizenz des zukünftigen Pakets und der derzeitigen URL, von der es heruntergeladen werden kann.
fr: Supposons que personne ne travaille sur le paquet que vous visez, vous devez alors envoyer un rapport de bogue (voir <xref linkend="submit-bug"/>) concernant le pseudopaquet <systemitem role="package">wnpp</systemitem>. Ce courrier devra décrire le paquet que vous projetez de créer, la licence de ce paquet et l'URL à laquelle le code source peut être téléchargé. Cette liste n'est pas limitative.
ja: パッケージ化しようとしているソフトについて、誰もまだ作業していないようであれば、まずは <systemitem role="package">wnpp</systemitem> 擬似パッケージ (pseudo-package) に対してバグ報告を投稿する必要があります (<xref linkend="submit-bug"/>)。このバグ報告には、パッケージの説明、作業しようとしているパッケージのライセンス、ダウンロードが可能な現在の URL を含めた新規パッケージの作成予定 (自分自身が分かるだけではないもの) を記述します。

source: You should set the subject of the bug to <literal>ITP: <replaceable>foo</replaceable> -- <replaceable>short description</replaceable></literal>, substituting the name of the new package for <replaceable>foo</replaceable>. The severity of the bug report must be set to <literal>wishlist</literal>. Please send a copy to &email-debian-devel; by using the X-Debbugs-CC header (don't use CC:, because that way the message's subject won't indicate the bug number). If you are packaging so many new packages (>10) that notifying the mailing list in separate messages is too disruptive, send a summary after filing the bugs to the debian-devel list instead. This will inform the other developers about upcoming packages and will allow a review of your description and package name.
de: Sie sollten den Betreff des Fehlers auf <literal>ITP: <replaceable>Paketname</replaceable> -- <replaceable>kurze Beschreibung</replaceable></literal> setzen, wobei Sie <replaceable>Paketname</replaceable> durch den Namen Ihres Pakets ersetzen. Der Schweregrad des Fehlerberichts sollte auf <literal>wishlist</literal> gesetzt werden. Bitte senden Sie mit der Kopfzeile X-Debbugs-CC eine Kopie an &email-debian-devel; (benutzen Sie nicht CC:, da in diesem Fall der Betreff der Nachricht die Fehlernummer nicht angibt). Falls Sie so viele (mehr als zehn) neue Pakete paketieren, dass die Benachrichtigung auf der Liste als störend empfunden würde, senden Sie stattdessen nach dem Einreichen des Fehlers eine Zusammenfassung an die Liste »debian-devel«. Dies wird andere Entwickler über die bevorstehenden Pakete informieren und eine Überprüfung Ihrer Beschreibung und Ihres Paketnamens ermöglichen.
fr: Le sujet du rapport de bogue pour déclarer votre intention d'empaqueter (« <literal>Intent To Package</literal> » ou <literal>ITP</literal>) devra être <literal>ITP: <replaceable>NomDuPaquet</replaceable> -- <replaceable>description courte</replaceable></literal>, en remplaçant <replaceable>NomDuPaquet</replaceable> par le nom du paquet. La gravité du bogue sera <literal>wishlist</literal>. Si vous le jugez nécessaire, envoyez une copie à &email-debian-devel; en mettant cette adresse dans le champ <literal>X-Debbugs-CC</literal> de l'en-tête du message. N'utilisez pas le champ <literal>CC</literal> sinon le sujet du message ne contiendrait pas le numéro du bogue. Si vous empaquetez tellement de paquets (plus de dix) que les signaler sur la liste de diffusion soit trop perturbant, envoyez plutôt un résumé sur la liste <literal>debian-devel</literal> après avoir rempli les rapports de bogue. Cela informera les autres développeurs de l'arrivée de nouveaux paquets et permettra une relecture des description et nom de paquet.
ja: サブジェクトを <literal>ITP: <replaceable>foo</replaceable> -- <replaceable>short description</replaceable></literal> に設定する必要があります。ここでは <replaceable>foo</replaceable> は新規パッケージの名前に置き換えます。バグ報告の重要度は <literal>wishlist</literal> に設定しなければなりません。X-Debbugs-CC ヘッダを使ってコピーを &email-debian-devel; に送信してください (CC: は使わないでください。CC: を使った場合はメールのサブジェクトにバグ番号が付与されないためです)。大量の新規パッケージの作成 (11 個以上) を行っている場合、メーリングリストへ個別に通知するのは鬱陶しいので、代わりにバグを登録した後で debian-devel メーリングリストへ要約を送信してください。これによって、他の開発者らに次に来るパッケージを知らせ、説明とパッケージ名のレビューが可能になります。

source: Please include a <literal>Closes: #<replaceable>nnnnn</replaceable></literal> entry in the changelog of the new package in order for the bug report to be automatically closed once the new package is installed in the archive (see <xref linkend="upload-bugfix"/>).
de: Bitte fügen Sie im Änderungsprotokoll des neuen Pakets den Eintrag <literal>Closes: #<replaceable>nnnnn</replaceable></literal> hinzu, um den Fehlerbericht automatisch zu schließen, sobald das neue Paket im Archiv installiert wird (siehe <xref linkend="upload-bugfix"/>).
fr: Veuillez ajouter « <literal>Closes: #<replaceable>nnnnn</replaceable></literal> » au journal de modification (<filename>changelog</filename>) du nouveau paquet. Cette indication provoquera la fermeture automatique du rapport de bogue à l'installation du nouveau paquet dans l'archive (voir <xref linkend="upload-bugfix"/>).
ja: 新規パッケージがアーカイブへインストールされる際にバグ報告を自動的に閉じるため、<literal>Closes: #<replaceable>nnnnn</replaceable></literal> というエントリを新規パッケージの changelog 内に含めてください (<xref linkend="upload-bugfix"/> を参照)。

source: If you think your package needs some explanations for the administrators of the NEW package queue, include them in your changelog, send to &email-ftpmaster; a reply to the email you receive as a maintainer after your upload, or reply to the rejection email in case you are already re-uploading.
de: Falls Sie der Ansicht sind, Ihr Paket bedürfe einiger Erklärungen für die Administratoren der Paketwarteschlange NEW, so fügen Sie diese dem Änderungsprotokoll hinzu, senden Sie die E-Mail, die Sie als Betreuer nach dem Upload zurückbekommen haben an &email-ftpmaster; oder antworten Sie auf die ablehnende E-Mail, im Fall dass Sie bereits erneut hochladen.
fr: Si vous jugez nécessaire d'ajouter des explications pour les administrateurs de la file d'attente de nouveaux paquets (<literal>NEW</literal>), veuillez les ajouter au fichier <filename>changelog</filename>, envoyer à &email-ftpmaster; une réponse au message reçu en tant que responsable suite à votre envoi de paquet, ou une réponse au message de rejet si vous envoyez à nouveau le paquet.
ja: パッケージについて、NEW パッケージキューの管理者への説明が必要だろうと思う場合は、changelog に説明を含めて &email-ftpmaster; へ送ってください。アップロード後であればメンテナとして受け取ったメールに返信してください。もしくは既に再アップロード最中の場合は reject メールに対して返信してください。

source: When closing security bugs include CVE numbers as well as the <literal>Closes: #<replaceable>nnnnn</replaceable></literal>. This is useful for the security team to track vulnerabilities. If an upload is made to fix the bug before the advisory ID is known, it is encouraged to modify the historical changelog entry with the next upload. Even in this case, please include all available pointers to background information in the original changelog entry.
de: Wenn sicherheitskritische Fehler geschlossen werden, fügen Sie die CVE-Nummern sowie <literal>Closes: #<replaceable>nnnnn</replaceable></literal> bei. Dies ist nützlich zur Verfolgung von Schwachstellen durch das Sicherheits-Team. Falls etwas hochgeladen wird, bevor die Warnungs-ID bekannt ist, sollte beim nächsten Upload der historische Änderungsprotokolleintrag geändert werden. Bitte fügen Sie sogar in diesem Fall dem Original-Änderungsprotokolleintrag alle verfügbaren Hinweise auf Hintergrundinformationen hinzu.
fr: Lors de la fermeture de bogues de sécurité, indiquez les numéros CVE en plus de « <literal>Closes: #<replaceable>nnnnn</replaceable></literal> ». Ceci permet à l'équipe de sécurité de suivre les failles. Si un envoi est effectué pour corriger le bogue avant que l'identifiant d'alerte soit connu, il est conseillé de modifier la mention existante du fichier <filename>changelog</filename> lors d'un envoi suivant. Même dans ce cas, veuillez inclure toutes les indications disponibles sur les origines de la situation dans la première entrée de <filename>changelog</filename>.
ja: セキュリティバグを閉じる場合は、CVE 番号を <literal>Closes: #<replaceable>nnnnn</replaceable></literal> と同じく含めるようにしてください。これは、セキュリティチームが脆弱性を追跡するのに役立ちます。アドバイザリの ID が分かる前にバグ修正のためのアップロードが行われた場合は、以前の changelog エントリを次のアップロード時に修正するのが推奨されています。このような場合でも、元々の changelog での記載に可能な限り背景情報へのポインタを全て含めてください。

source: There are a number of reasons why we ask maintainers to announce their intentions:
de: Es gibt eine Vielzahl von Gründen, weshalb Paketbetreuer um die Ankündigung ihrer Absichten gebeten werden:
fr: Les responsables sont priés d'annoncer leurs intentions pour plusieurs raisons :
ja: 我々がメンテナに意図しているところをアナウンスする様に求めるのには、いくつもの理由があります。

source: It helps the (potentially new) maintainer to tap into the experience of people on the list, and lets them know if anyone else is working on it already.
de: Es hilft dem (möglicherweise neuen) Betreuer, die Erfahrung der Leute auf der Liste anzuzapfen und teilt ihm mit, ob jemand anderes bereits daran arbeitet.
fr: afin d'être informés si quelqu'un travaille déjà sur le paquet, et pour permettre à d'autres membres de la liste de partager leur expérience ;
ja: (潜在的な新たな) メンテナが、メーリングリストの人々の経験を活かすのを手助けし、もし他の誰かが既に作業を行っていた場合に知らせる。

source: It lets other people thinking about working on the package know that there already is a volunteer, so efforts may be shared.
de: Es zeigt anderen Leuten, die darüber nachdenken am Paket zu arbeiten, dass es bereits einen Freiwilligen gibt, so dass der Aufwand verteilt werden kann.
fr: si d'autres personnes envisagent de travailler sur le même paquet, elles apprendront qu'il existe un volontaire et pourront proposer de partager le travail ;
ja: そのパッケージについての作業を検討している他の人へ、既に作業をしているボランティアがいることを知らせ、労力が共有される。

source: It lets the rest of the maintainers know more about the package than the one line description and the usual changelog entry ``Initial release'' that gets posted to &email-debian-devel-changes;.
de: Es sagt den übrigen Betreuern mehr über das Paket, als nur eine Beschreibungszeile und der übliche Eintrag im Änderungsprotokoll »Initial release«, der an &email-debian-devel-changes; gesandt wird.
fr: cela permet aux autres responsables d'en apprendre plus sur le nouveau paquet que la description courte et la formule consacrée du journal de modification « <literal>Initial release</literal> » (publication initiale) envoyée sur &email-debian-devel-changes; ;
ja: &email-debian-devel-changes; に流される一行の説明文 (description) と通常どおりの「Intial release」という changelog エントリよりも、残った他のメンテナがパッケージに関してより深く知ることができる。

source: It is helpful to the people who live off <literal>unstable</literal> (and form our first line of testers). We should encourage these people.
de: Es ist hilfreich für Leute, die von <literal>unstable</literal> zehren (und die die vorderste Frontlinie von Testern bilden). Diese Leute sollten ermutigt werden.
fr: cette information est utile aux utilisateurs d'<literal>unstable</literal> qui sont les premiers testeurs. Ces personnes devraient être incitées à essayer le nouveau paquet ;
ja: <literal>不安定版 (unstable)</literal> で暮らす人 (そして最前線のテスターである人) の助けになる。我々はそのような人々を推奨すべきである。

source: The announcements give maintainers and other interested parties a better feel of what is going on, and what is new, in the project.
de: Die Ankündigungen geben Betreuern und anderen interessierten Parteien ein besseres Gefühl dafür, was gerade geschieht und was im Projekt neu ist.
fr: ces annonces donnent aux responsables et autres personnes intéressées une meilleure idée des évolutions et des nouveautés du projet.
ja: メンテナや他に興味を持つ人々へ、プロジェクトで何が行われているのか、何か新しいことがあるかということ関して、告知は良い印象を与える。

source: Please see <ulink url="http://&ftp-master-host;/REJECT-FAQ.html"></ulink> for common rejection reasons for a new package.
de: Bitte lesen Sie unter <ulink url="http://&ftp-master-host;/REJECT-FAQ.html"></ulink> die häufigsten Gründe für die Ablehnung neuer Pakete.
fr: Veuillez consulter <ulink url="http://&ftp-master-host;/REJECT-FAQ.html"></ulink> pour les raisons courantes de rejet des nouveaux paquets.
ja: 新しいパッケージに対するよくある拒否理由については <ulink url="http://&ftp-master-host;/REJECT-FAQ.html"></ulink> を参照してください。

source: Recording changes in the package
de: Änderungen im Paket aufzeichnen
fr: Enregistrement des modifications
ja: パッケージの変更を記録する

source: Changes that you make to the package need to be recorded in the <filename>debian/changelog</filename>. These changes should provide a concise description of what was changed, why (if it's in doubt), and note if any bugs were closed. They also record when the package was completed. This file will be installed in <filename>/usr/share/doc/<replaceable>package</replaceable>/changelog.Debian.gz</filename>, or <filename>/usr/share/doc/<replaceable>package</replaceable>/changelog.gz</filename> for native packages.
de: Von Ihnen vorgenommene Änderungen müssen in <filename>debian/changelog</filename> aufgezeichnet werden. Diese Änderungen sollten eine kurzgefasste Beschreibung bereitstellen, was geändert wurde, warum (falls dies zweifelhaft ist) und vermerken, ob irgendwelche Fehler geschlossen wurden. Sie zeichnen außerdem auf, wenn das Paket vervollständigt wurde. Diese Datei wird in <filename>/usr/share/doc/<replaceable>Paket</replaceable>/changelog.Debian.gz</filename> oder <filename>/usr/share/doc/<replaceable>Paket</replaceable>/changelog.gz</filename> für native Pakete installiert.
fr: Les modifications apportées au paquet doivent être consignées dans le fichier <filename>debian/changelog</filename>. Ces notes doivent donner une description concise des changements, expliquer les raisons de ceux-ci (si ce n'est pas clair) et indiquer quels rapports de bogue ont été clos. Il faut aussi indiquer quand le paquet a été terminé. Ce fichier sera installé dans <filename>/usr/share/doc/<replaceable>paquet</replaceable>/changelog.Debian.gz</filename> ou <filename>/usr/share/doc/<replaceable>paquet</replaceable>/changelog.gz</filename> pour un paquet natif.
ja: パッケージについて行った変更は <filename>debian/changelog</filename> に記録されなくてはいけません。これらの変更には、何が変更されたのか、(不確かであれば) 何故なのか、そしてどのバグが閉じられたのかの簡潔な説明文を付加する必要があります。このファイルは <filename>/usr/share/doc/<replaceable>package</replaceable>/changelog.Debian.gz</filename>、あるいはネイティブパッケージの場合は <filename>/usr/share/doc/<replaceable>package</replaceable>/changelog.gz</filename> にインストールされます。

source: The <filename>debian/changelog</filename> file conforms to a certain structure, with a number of different fields. One field of note, the <literal>distribution</literal>, is described in <xref linkend="distribution"/>. More information about the structure of this file can be found in the Debian Policy section titled <filename>debian/changelog</filename>.
de: Die Datei <filename>debian/changelog</filename> entspricht einer bestimmten Struktur mit einer Anzahl unterschiedlicher Felder. Ein bedeutendes Feld, die <literal>distribution</literal>, wird in <xref linkend="distribution"/> beschrieben. Weitere Informationen über die Struktur dieser Datei können im Abschnitt <filename>debian/changelog</filename> der Debian-Richtlinien gefunden werden.
fr: Le fichier <filename>debian/changelog</filename> a une structure précise comportant différents champs. Le champ <literal>distribution</literal> est décrit en <xref linkend="distribution"/>. Plus d'informations sur la structure de ce fichier sont disponibles dans la section « <filename>debian/changelog</filename> » de la Charte Debian (« <literal>Debian Policy</literal> »).
ja: <filename>debian/changelog</filename> ファイルは、幾つもの異なった項目からなる特定の構造に従っています。一点を取り上げてみると、<literal>distribution</literal> については<xref linkend="distribution"/>に記述されています。このファイルの構造について、より詳細な情報は Debian ポリシーの <filename>debian/changelog</filename> という章で確認できます。

source: Changelog entries can be used to automatically close Debian bugs when the package is installed into the archive. See <xref linkend="upload-bugfix"/>.
de: Wenn das Paket im Archiv installiert ist, können Einträge im Änderungsprotokoll benutzt werden, um Debian-Fehler automatisch zu schließen. Siehe <xref linkend="upload-bugfix"/>.
fr: Certaines indications du fichier <filename>changelog</filename> peuvent provoquer la fermeture automatique des rapports de bogue au moment où le paquet est installé dans l'archive. Voir <xref linkend="upload-bugfix"/>.
ja: changelog への記載は、パッケージがアーカイブにインストールされる際、自動的に Debian バグを閉じるのに利用できます。<xref linkend="upload-bugfix"/> を参照してください。

source: It is conventional that the changelog entry of a package that contains a new upstream version of the software looks like this:
de: Es ist üblich, dass der Änderungsprotokolleintrag eines Pakets, der eine neue Originalversion der Software enthält, wie folgt aussieht:
fr: Par convention, quand un paquet contient une nouvelle version amont, le fichier <filename>changelog</filename> comporte une ligne qui ressemble à :
ja: ソフトウェアの新しい開発元のバージョン (new upstream version) を含むパッケージの changelog エントリは、以下のようにするのが慣習です:

source: There are tools to help you create entries and finalize the <filename>changelog</filename> for release — see <xref linkend="devscripts"/> and <xref linkend="dpkg-dev-el"/>.
de: Es gibt Werkzeuge, die Ihnen helfen Einträge zu erstellen und das <filename>changelog</filename> zur Veröffentlichung fertigzustellen – siehe <xref linkend="devscripts"/> und <xref linkend="dpkg-dev-el"/>.
fr: Certains outils peuvent aider à éditer et finaliser le fichier <filename>changelog</filename> — voir <xref linkend="devscripts"/> et <xref linkend="dpkg-dev-el"/>.
ja: <filename>changelog</filename> エントリの作成と仕上げ処理に使えるツールがあります。<xref linkend="devscripts"/> と <xref linkend="dpkg-dev-el"/> を参照してください。
