Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: <emphasis role="strong">should</emphasis> use <filename><replaceable>packagename</replaceable>-<replaceable>upstream-version</replaceable>.orig</filename> as the name of the top-level directory in its tarball. This makes it possible to distinguish pristine tarballs from repackaged ones.
de: <emphasis role="strong">sollte</emphasis> als Namen des Verzeichnisses auf der obersten Ebene des Tarballs <filename><replaceable>Paketname</replaceable>-<replaceable>Originalversion</replaceable>.orig</filename> benutzen. Dies ermöglicht die Unterscheidung von unberührten und neu paketierten Tarballs.
fr: <emphasis role="strong">devrait</emphasis> utiliser <filename><replaceable>nomdupaquet</replaceable>-<replaceable>version-amont</replaceable>(.orig)</filename> comme nom de répertoire racine de l'archive. Cela permet de distinguer les sources originelles des sources reconstruites ;
ja: tarball の最上位ディレクトリの名前として <replaceable>パッケージ名</replaceable>-<replaceable>開発元のバージョン</replaceable>.orig を<emphasis role="strong">使うべき</emphasis>です。これは、大元の使用されていない tarball と再パッケージしたものを判別できるようにしてくれます。

source: <emphasis role="strong">should</emphasis> be gzipped or bzipped with maximal compression.
de: <emphasis role="strong">sollte</emphasis> mit Gzip oder Bzip mit der maximalen Komprimierung gepackt werden.
fr: <emphasis role="strong">devrait</emphasis> utiliser le taux de compression maximal.
ja: gzip あるいは bzip で最大限<emphasis role="strong">圧縮されるべき</emphasis>です。

source: Changing binary files
de: Ändern binärer Dateien
fr: Modification de fichier binaire
ja: バイナリファイルの変更

source: Sometimes it is necessary to change binary files contained in the original tarball, or to add binary files that are not in it. This is fully supported when using source packages in “3.0 (quilt)” format, see the <citerefentry><refentrytitle>dpkg-source</refentrytitle><manvolnum>1</manvolnum></citerefentry> manual page for details. When using the older format “1.0”, binary files can't be stored in the <filename>.diff.gz</filename> so you must store an <command>uuencode</command>d (or similar) version of the file(s) and decode it at build time in <filename>debian/rules</filename> (and move it in its official location).
de: Manchmal ist es nötig, binäre Dateien zu ändern, die im Original-Tarball enthalten sind oder binäre Dateien hinzuzufügen, die nicht darin enthalten sind. Dies wird vollständig unterstützt, wenn Sie Quellpakete im Format »3.0 (quilt)« benutzen. Lesen Sie die Handbuchseite <citerefentry><refentrytitle>dpkg-source</refentrytitle><manvolnum>1</manvolnum></citerefentry>, um weitere Einzelheiten zu erfahren. Wenn Sie das ältere Format »1.0« benutzen, können binäre Dateien nicht im <filename>.diff.gz</filename> gespeichert werden, daher müssen Sie eine mit <command>uuencode</command> (oder ähnlichem) kodierte Version der Datei(en) speichern und zur Erstellungszeit in <filename>debian/rules</filename> entschlüsseln (und an ihren offiziellen Platz verschieben).
fr: Il est parfois nécessaire de modifier les fichiers binaires contenus dans l'archive d'origine, ou d'ajouter des fichiers binaires. C'est tout à fait possible avec les paquets au format « 3.0 (quilt) ». Consultez la page de manuel <citerefentry><refentrytitle>dpkg-source</refentrytitle><manvolnum>1</manvolnum></citerefentry> pour plus de détails. Avec le plus ancien format « 1.0 », <filename>.diff.gz</filename> ne peut pas contenir de fichiers binaires, ce qui oblige à utiliser <command>uuencode</command> (ou une fonction similaire) pour les stocker, puis de les reconstruire lors de la compilation dans <filename>debian/rules</filename> (et les remettre à leur place).
ja: オリジナルの tarball に含まれているバイナリファイルを変更する、あるいは存在していなかったバイナリファイルを追加する必要がある場合がしばしばあります。これは、ソースパッケージが“3.0 (quilt)”形式を使っている場合は完全にサポートされています。詳細は <citerefentry><refentrytitle>dpkg-source</refentrytitle><manvolnum>1</manvolnum></citerefentry> マニュアルのページを参照してください。古い“1.0”形式を使っている場合、バイナリファイルを <filename>.diff.gz</filename> 中に保存できないので、<command>uuencode</command> (か類似のもの) を使ったファイルを保存し、<filename>debian/rules</filename> 中でビルド時にデコードします (そしてファイルを正しい位置へ移動する)。

source: Best practices for debug packages
de: Optimale Vorgehensweisen für Debug-Pakete
fr: Meilleures pratiques pour les paquets de débogage
ja: デバッグパッケージのベストプラクティス

source: A debug package is a package with a name ending in -dbg, that contains additional information that <command>gdb</command> can use. Since Debian binaries are stripped by default, debugging information, including function names and line numbers, is otherwise not available when running <command>gdb</command> on Debian binaries. Debug packages allow users who need this additional debugging information to install it, without bloating a regular system with the information.
de: Ein Debug-Paket ist ein Paket, dessen Name mit -dbg endet. Es enthält zusätzliche Informationen, die <command>gdb</command> benutzen kann. Da Debian-Programme standardmäßig unverhüllt sind, sind Debugging-Informationen, einschließlich Namen und Zeilennummern andernfalls nicht verfügbar, wenn <command>gdb</command> auf Debian-Programmen ausgeführt wird. Debug-Pakete ermöglichen Anwendern, die diese zusätzlichen Debugging-Informationen benötigen, sie zu installieren ohne das normale System mit diesen Informationen aufzublähen.
fr: Un paquet de débogage est un paquet dont le nom se termine par « -dbg », et qui contient des informations supplémentaires que <command>gdb</command> peut utiliser. Puisque les informations de débogage, comme les noms de fonction et de numéro de ligne, sont par défaut absentes des paquets binaires Debian, elles ne pourraient autrement pas être disponibles lors de l'utilisation de <command>gdb</command>. Les paquets de débogage permettent aux utilisateurs qui le désirent d'ajouter ces informations de débogage supplémentaires, sans augmenter la taille d'un système normal avec ces informations.
ja: デバッグパッケージは名前が -dbg で終わっているもので、<command>gdb</command> が利用可能な追加情報を含んでいます。Debian のバイナリはデフォルトで strip されているので、関数名や行番号を含むデバッグ情報は、Debian のバイナリに <command>gdb</command> を走らせたときに利用できません。デバッグパッケージは、この追加デバッグ情報を必要とするユーザが、通常のシステムを巨大化させること無く使えるようにしてくれます。

source: It is up to a package's maintainer whether to create a debug package or not. Maintainers are encouraged to create debug packages for library packages, since this can aid in debugging many programs linked to a library. In general, debug packages do not need to be added for all programs; doing so would bloat the archive. But if a maintainer finds that users often need a debugging version of a program, it can be worthwhile to make a debug package for it. Programs that are core infrastructure, such as apache and the X server are also good candidates for debug packages.
de: Es liegt beim Paketbetreuer, ob ein Debug-Paket erstellt wird oder nicht. Betreuer werden aufgefordert Debug-Pakete für Bibliothekenpakete zu erstellen, da dies bei der Fehlersuche in vielen Programmen helfen kann, die mit der Bibliothek verlinkt werden. Im Allgemeinen gibt es keine Notwendigkeit für Debug-Pakete zu allen Programmen; dies würde das Archiv aufblähen. Falls aber ein Betreuer findet, dass Anwender oft die Debugging-Version eines Programms benötigen, kann es lohnenswert sein, ein Debug-Paket dafür zu erstellen. Programme die zur Kerninfrastruktur gehören, wie Apache oder der X-Server sind ebenfalls geeignete Kandidaten für Debug-Pakete.
fr: C'est à la discrétion des responsables de paquet de créer ou non un paquet de débogage. Il est conseillé de créer des paquets de débogage pour les bibliothèques, puisque cela peut faciliter le débogage de nombreux programmes liés à ces bibliothèques. Normalement, les paquets de débogage n'ont pas besoin d'être ajoutés systématiquement, sinon la taille de l'archive augmenterait considérablement. En revanche, si un responsable estime que des utilisateurs peuvent avoir souvent besoin d'une version de débogage de son programme, il peut être judicieux de fournir un paquet de débogage. Les programmes faisant partie des applications principales de l'infrastructure, comme Apache ou le serveur X, sont également de bons candidats pour les paquets de débogage.
ja: デバッグパッケージを作るか否かは、パッケージのメンテナ次第です。メンテナは、ライブラリパッケージについてデバッグパッケージを作成するのが推奨されています。これは、ライブラリにリンクしている沢山のプログラムをデバッグする助けになるからです。一般的に言って、デバッグパッケージはすべてのプログラムに追加する必要はありません; これを行うとアーカイブが巨大なものになるでしょう。しかし、メンテナは、ユーザがデバッグ版のプログラムを頻繁に必要とするのに気づいた場合、デバッグパッケージを作るのに値するでしょう。インフラストラクチャの核となっている、apache や X サーバのようプログラムも、デバッグパッケージの良い作成候補です。

source: Some debug packages may contain an entire special debugging build of a library or other binary, but most of them can save space and build time by instead containing separated debugging symbols that <command>gdb</command> can find and load on the fly when debugging a program or library. The convention in Debian is to keep these symbols in <filename>/usr/lib/debug/<replaceable>path</replaceable></filename>, where <replaceable>path</replaceable> is the path to the executable or library. For example, debugging symbols for <filename>/usr/bin/foo</filename> go in <filename>/usr/lib/debug/usr/bin/foo</filename>, and debugging symbols for <filename>/usr/lib/libfoo.so.1</filename> go in <filename>/usr/lib/debug/usr/lib/libfoo.so.1</filename>.
de: Einige Debug-Pakete könnten ein ganz spezielles Debugging-Build einer Bibliothek oder eines anderen Programms haben, aber die meisten können Speicher und Build-Zeit sparen, indem sie stattdessen separate Debugging-Symbole enthalten, die <command>gdb</command> spontan finden und laden kann, wenn in einem Programm oder einer Bibliothek nach Fehlern gesucht wird. Die Konvention in Debian besagt, dass diese Symbole in <filename>/usr/lib/debug/<replaceable>Pfad</replaceable></filename> aufbewahrt werden, wobei <replaceable>Pfad</replaceable> der Pfad zum ausführbaren Programm oder der Bibliothek ist. Debugging-Symbole für <filename>/usr/bin/foo</filename> wandern beispielsweise nach <filename>/usr/lib/debug/usr/bin/foo</filename> und Debugging-Symbole für <filename>/usr/lib/libfoo.so.1</filename> nach <filename>/usr/lib/debug/usr/lib/libfoo.so.1</filename>.
fr: Certains paquets de débogage peuvent contenir une compilation spécifique de débogage complète d'une bibliothèque ou d'un autre programme, mais la plupart peuvent préserver de la place et du temps de compilation en contenant plutôt séparément les symboles de débogage que <command>gdb</command> peut trouver et charger à la volée lors du débogage d'un programme ou d'une bibliothèque. Par convention dans Debian, ces symboles sont gardés dans <filename>/usr/lib/debug/<replaceable>chemin</replaceable></filename>, où <replaceable>chemin</replaceable> est l'arborescence vers l'exécutable ou la bibliothèque. Par exemple, les symboles de débogage pour <filename>/usr/bin/truc</filename> sont dans <filename>/usr/lib/debug/usr/bin/truc</filename>, et les symboles de débogage pour <filename>/usr/lib/libtruc.so.1</filename> sont dans <filename>/usr/lib/debug/usr/lib/libtruc.so.1</filename>.
ja: デバッグパッケージのうちいくつかは、ライブラリあるいは他のバイナリの完全に特別なデバッグビルドを含むでしょうが、それらの大半は容量やビルドする時間を節約できます。<filename>/usr/lib/debug/<replaceable>path</replaceable></filename> の場合、<replaceable>path</replaceable> は実行ファイルかライブラリへのパスになります。例えば、<filename>/usr/bin/foo</filename> のデバッグシンボルは <filename>/usr/lib/debug/usr/bin/foo</filename> に行き、<filename>/usr/lib/libfoo.so.1</filename> のデバッグシンボルは <filename>/usr/lib/debug/usr/lib/libfoo.so.1</filename> になります。

source: The debugging symbols can be extracted from an object file using <command>objcopy --only-keep-debug</command>. Then the object file can be stripped, and <command>objcopy --add-gnu-debuglink</command> used to specify the path to the debugging symbol file. <citerefentry> <refentrytitle>objcopy</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> explains in detail how this works.
de: Die Debugging-Symbole können mit <command>objcopy --only-keep-debug</command> aus einer Objektdatei extrahiert werden. Dann kann die Objektdatei enthüllt und <command>objcopy --add-gnu-debuglink</command> benutzt werden, um den Pfad zur Debugging-Symboldatei anzugeben. <citerefentry> <refentrytitle>objcopy</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> erklärt im Detail, wie dies funktioniert.
fr: Les symboles de débogage peuvent être extraits d'un fichier objet à l'aide de <command>objcopy --only-keep-debug</command>. Ensuite les informations de débogage peuvent être supprimées du fichier objet, et <command>objcopy --add-gnu-debuglink</command> peut être utilisé pour préciser le chemin vers le fichier contenant les symboles de débogage. <citerefentry> <refentrytitle>objcopy</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> explique en détail le fonctionnement.
ja: デバッグシンボルは <command>objcopy --only-keep-debug</command> を使ってオブジェクトファイルから展開できます。そうすればオブジェクトファイルを strip することができ、<command>objcopy --add-gnu-debuglink</command> がデバッグシンボルファイルへのパスを指定するのに使われます。<citerefentry> <refentrytitle>objcopy</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> で、これがどの様に動作するのかを詳細に説明しています。

source: The <command>dh_strip</command> command in <systemitem role="package">debhelper</systemitem> supports creating debug packages, and can take care of using <command>objcopy</command> to separate out the debugging symbols for you. If your package uses <systemitem role="package">debhelper</systemitem>, all you need to do is call <command>dh_strip --dbg-package=libfoo-dbg</command>, and add an entry to <filename>debian/control</filename> for the debug package.
de: Der Befehl <command>dh_strip</command> in <systemitem role="package">debhelper</systemitem> unterstützt das Erstellen von Debug-Paketen und kann sich um die Benutzung von <command>objcopy</command> kümmern, um die Debugging-Symbole für Sie herauszusuchen. Falls Ihr Paket <systemitem role="package">debhelper</systemitem> benutzt, müssen Sie nur <command>dh_strip --dbg-package=libfoo-dbg</command> aufrufen und einen Eintrag in <filename>debian/control</filename> für das Debug-Paket hinzufügen.
fr: La commande <command>dh_strip</command> de <systemitem role="package">debhelper</systemitem> permet de créer les paquets de débogage, et prend soin d'utiliser <command>objcopy</command> pour séparer les symboles de débogage à votre place. Si le paquet utilise <systemitem role="package">debhelper</systemitem>, il suffit d'appeler <command>dh_strip --dbg-package=libtruc-dbg</command>, et d'ajouter une entrée à <filename>debian/control</filename> pour le paquet de débogage.
ja: <systemitem role="package">debhelper</systemitem> 中の <command>dh_strip</command> コマンドは、デバッグパッケージの作成をサポートし、デバッグシンボルを分離するのに <command>objcopy</command> の利用の面倒を見てくれます。あなたのパッケージが <systemitem role="package">debhelper</systemitem> を使っている場合、あなたがする必要があるのは <command>dh_strip --dbg-package=libfoo-dbg</command> を呼び出し、<filename>debian/control</filename> にデバッグパッケージのエントリを追加することだけです。

source: Note that the debug package should depend on the package that it provides debugging symbols for, and this dependency should be versioned. For example:
de: Beachten Sie, dass Debug-Pakete von dem Paket abhängen sollten, für das sie Debugging-Symbole bereitstellen und diese Abhängigkeit sollte mit einer Version versehen werden. Zum Beispiel:
fr: Remarquez que le paquet de débogage devrait dépendre du paquet dont il fournit les symboles de débogage, et que cette dépendance devrait être spécifique à la version. Par exemple
ja: デバッグパッケージは、そのパッケージがデバッグシンボルを提供するパッケージに依存する必要があり、この依存関係はバージョン指定が必要であるということに注意してください。以下のような例になります:

source: Depends: libfoo (= ${binary:Version})
fr: Depends: libtruc (= ${binary:Version})

source: Best practices for meta-packages
de: Optimale Vorgehensweisen für Meta-Pakete
fr: Meilleures pratiques pour les métapaquets
ja: メタパッケージのベストプラクティス

source: A meta-package is a mostly empty package that makes it easy to install a coherent set of packages that can evolve over time. It achieves this by depending on all the packages of the set. Thanks to the power of APT, the meta-package maintainer can adjust the dependencies and the user's system will automatically get the supplementary packages. The dropped packages that were automatically installed will be also be marked as removal candidates (and are even automatically removed by <command>aptitude</command>). <systemitem role="package">gnome</systemitem> and <systemitem role="package">linux-image-amd64</systemitem> are two examples of meta-packages (built by the source packages <systemitem role="package">meta-gnome2</systemitem> and <systemitem role="package">linux-latest</systemitem>).
de: Ein Meta-Paket ist meist ein leeres Paket, das es vereinfacht, eine Zusammenstellung von Paketen zu installieren, die sich im Lauf der Zeit weiterentwickeln können. Es erreicht dies, indem es von allen Paketen der Zusammenstellung abhängt. Dank der Fähigkeiten von APT kann der Betreuer des Meta-Pakets die Abhängigkeiten anpassen und das System des Anwenders wird automatisch die zusätzlichen Pakete erhalten. Die weggelassenen Pakete, die automatisch installiert wurden, werden außerdem als Kandidaten für das Entfernen gekennzeichnet (und werden sogar durch <command>aptitude</command> automatisch entfernt). <systemitem role="package">gnome</systemitem> und <systemitem role="package">linux-image-amd64</systemitem> sind zwei Beispiele für Meta-Pakete (gebaut durch die Quellpakete <systemitem role="package">meta-gnome2</systemitem> und <systemitem role="package">linux-latest</systemitem>).
fr: Un métapaquet est un paquet principalement vide qui facilite l'installation d'un ensemble de paquets cohérents qui peut évoluer avec le temps. Il atteint cet objectif en dépendant de tous les paquets de l'ensemble. Grâce à la puissance d'APT, le responsable du métapaquet peut configurer les dépendances et le système de l'utilisateur obtiendra automatiquement les paquets supplémentaires. Les paquets devenus inutiles qui avaient été installés automatiquement seront aussi marqués comme candidats à la suppression (et même automatiquement supprimés par <command>aptitude</command>). Par exemple <systemitem role="package">gnome</systemitem> et <systemitem role="package">linux-image-amd64</systemitem> sont deux métapaquets (construits par les paquets source <systemitem role="package">meta-gnome2</systemitem> et <systemitem role="package">linux-latest</systemitem>).
ja: メタパッケージは、時間がかかる一貫したセットのパッケージをインストールするのを楽にしてくれる、ほぼ空のパッケージです。そのセットの全パッケージに依存することで、これを実現しています。APT の力のおかげで、メタパッケージのメンテナは依存関係を調整すればユーザのシステムが自動的に追加パッケージを得ることができます。自動的にインストールされていてメタパッケージから落とされたパッケージは、削除候補としてマークされます (そして <command>aptitude</command> によって自動的に削除もされます)。<systemitem role="package">gnome</systemitem> と <systemitem role="package">linux-image-amd64</systemitem> は、メタパッケージの 2 つの例です (ソースパッケージ <systemitem role="package">meta-gnome2</systemitem> and <systemitem role="package">linux-latest</systemitem> から生成されています)。

source: The long description of the meta-package must clearly document its purpose so that the user knows what they will lose if they remove the package. Being explicit about the consequences is recommended. This is particularly important for meta-packages which are installed during initial installation and that have not been explicitly installed by the user. Those tend to be important to ensure smooth system upgrades and the user should be discouraged from uninstalling them to avoid potential breakages.
de: Die ausführliche Beschreibung des Meta-Pakets muss ihren Zweck klar dokumentieren, so dass die Benutzer wissen, was sie verlieren, wenn sie das Paket entfernen. Es wird empfohlen, genau über die Konsequenzen zu informieren. Dies ist besonders für Meta-Pakete wichtig, die während der anfänglichen Installation installiert werden und nicht explizit durch den Benutzer installiert wurden. Diese neigen dazu, wichtig für reibungslose Upgrades des Systems zu sein und der Benutzer sollte entmutigt werden, sie zu entfernen, um mögliche Schäden zu vermeiden.
fr: La description longue du métapaquet doit clairement expliquer son objectif, afin d'informer les utilisateurs sur ce qu'ils perdront s'ils suppriment le paquet. Vous devriez être explicite sur les conséquences. C'est tout particulièrement important pour les métapaquets installés lors de l'installation initiale qui n'ont pas été installés explicitement par l'utilisateur. Ils ont tendance à être importants pour garantir les mises à niveau du système et la description devrait essayer de dissuader les utilisateurs de les désinstaller pour éviter d'éventuels dommages.
ja: メタパッケージの長い説明文は、目的を明確に記述している必要があります。これによって、ユーザはもしそのパッケージを削除した場合に何を失うことになるのかを知ることができます。のちの影響について明示的にするのもお勧めです。これは、初めのインストール時にインストールされており、ユーザが明示的にインストールしたわけではないメタパッケージにとって、特に重要です。システムのアップグレードをスムースに保証するのに重要になり、潜在的な破損をさけるためにユーザに対してアンインストールする気をなくさせることでしょう。

source: Beyond Packaging
de: Jenseits der Paketierung
fr: Au-delà de l'empaquetage
ja: パッケージ化、そして…

source: Debian is about a lot more than just packaging software and maintaining those packages. This chapter contains information about ways, often really critical ways, to contribute to Debian beyond simply creating and maintaining packages.
de: Debian ist weit mehr als nur Software zu paketieren und diese Pakete zu verwalten. Dieses Kapitel enthält Informationen über Wege, oft wirklich kritische Wege, fernab von einfachem Erstellen und Verwalten von Paketen zu Debian beizutragen.
fr: Debian, c'est beaucoup plus que de l'empaquetage de logiciels et de la maintenance de paquets. Ce chapitre contient des informations sur les façons, souvent vraiment importantes, de contribuer à Debian au-delà de la simple création et maintenance de paquets.
ja: Debian は、単にソフトウェアのパッケージを作ってメンテナンスをしているだけではありません。この章では、単にパッケージを作ってメンテナンスする以外で Debian へ協力・貢献するやり方、多くの場合とても重要となるやり方の情報を取り扱います。

source: As a volunteer organization, Debian relies on the discretion of its members in choosing what they want to work on and in choosing the most critical thing to spend their time on.
de: Als eine Organisation von Freiwilligen verlässt sich Debian auf das Ermessen seiner Mitglieder, die auswählen, an was sie arbeiten möchten und was die kritischste Sache ist, in die sie Zeit investieren.
fr: En tant qu'organisation de volontaires, Debian repose sur la liberté de choisir ce sur quoi l'on désire travailler et de choisir la partie la plus importante à laquelle on veut consacrer son temps.
ja: ボランティア組織の例にたがわず、Debian の活動はメンバーが何をしたいのか、時間を割くのに最も重大だと思われることが何か、というメンバーの判断に依っています。

source: Bug reporting
de: Fehler berichten
fr: Signalement de bogues
ja: バグ報告

source: We encourage you to file bugs as you find them in Debian packages. In fact, Debian developers are often the first line testers. Finding and reporting bugs in other developers' packages improves the quality of Debian.
de: Bitte reichen Sie Fehlerberichte ein, wenn Sie Fehler in Debian-Paketen finden. Tatsächlich bilden Debian-Entwickler oftmals die erste Reihe der Tester. Fehler in den Paketen anderer Entwickler zu finden und zu melden, erhöht die Qualität von Debian.
fr: Nous vous encourageons à signaler des bogues quand vous en trouvez dans les paquets Debian. En fait, les développeurs Debian sont souvent les testeurs de première ligne. Trouver et signaler les bogues dans les paquets d'autres développeurs améliore la qualité de Debian.
ja: 我々としては、Debian パッケージで見つけたバグを登録することを勧めています。実際のところ、大抵の場合は Debian 開発者が第一線でのテスト作業者となっています。他の開発者のパッケージで見つけたバグを報告することで Debian の品質が向上されています。
