Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: If you have fixed a bug in your local copy, or if a fix has been committed to the VCS repository, you may tag the bug as <literal>pending</literal> to let people know that the bug is corrected and that it will be closed with the next upload (add the <literal>closes:</literal> in the <filename>changelog</filename>). This is particularly useful if you are several developers working on the same package.
de: Falls Sie einen Fehler in Ihrer lokalen Kopie behoben haben oder eine Fehlerbehebung in das VCS-Depot übertragen wird, können Sie den Fehler als <literal>pending</literal> kennzeichnen, um die Leute wissen zu lassen, dass der Fehler behoben ist und mit dem nächsten Upload geschlossen wird (dem <filename>changelog</filename> wird <literal>closes:</literal> hinzugefügt). Dies ist besonders nützlich, falls Sie zusammen mit mehreren Entwicklern am Paket arbeiten.
fr: si un bogue a été corrigé sur la copie locale ou sur le système de gestion de version, il peut être marqué <literal>pending</literal> (en attente) pour signaler qu'il est corrigé, et sera fermé à la prochaine mise à jour (ajouter « <literal>closes:</literal> » dans <filename>changelog</filename>). C'est d'autant plus utile si plusieurs développeurs travaillent sur le même paquet ;
ja: ローカル環境でバグを修正した、あるいは VCS リポジトリに修正をコミットした場合には、バグに <literal>pending</literal> タグを付けてバグが修正されたことと次のアップロードでバグが閉じられるであろうことを回りに知らせます (<filename>changelog</filename> に <literal>closes:</literal> を追加します)。これは複数の開発者が同一のパッケージで作業している際に特に役立ちます。

source: Once a corrected package is available in the archive, the bug should be closed indicating the version in which it was fixed. This can be done automatically, read <xref linkend="upload-bugfix"/>.
de: Sobald ein korrigiertes Paket im Archiv verfügbar ist, sollte der Fehler geschlossen und dei Version, in der er behoben wurde, angegeben werden. Dies kann automatisch geschehen – lesen Sie <xref linkend="upload-bugfix"/>.
fr: une fois le paquet corrigé disponible dans l'archive, le bogue devrait être fermé en précisant dans quelle version du paquet il a été réglé. Ceci peut être fait automatiquement, voir <xref linkend="upload-bugfix"/>.
ja: 一旦修正されたパッケージがアーカイブから入手可能になったら、バグはどのバージョンで修正されたかを指定して閉じられる必要があります。これは自動的に行われます。<xref linkend="upload-bugfix"/> を読んでください。

source: When bugs are closed by new uploads
de: Wann Fehler durch neue Uploads geschlossen werden
fr: Fermeture des rapports de bogue lors des mises à jour
ja: 新規アップロードでバグがクローズされる時

source: As bugs and problems are fixed in your packages, it is your responsibility as the package maintainer to close these bugs. However, you should not close a bug until the package which fixes the bug has been accepted into the Debian archive. Therefore, once you get notification that your updated package has been installed into the archive, you can and should close the bug in the BTS. Also, the bug should be closed with the correct version.
de: Da Fehler und Probleme in Ihren Paketen behoben werden, liegt es in Ihrer Verantwortung als Paketbetreuer, diese Fehler zu schließen. Sie sollten jedoch keinen Fehler schließen, bis das Paket, das den Fehler schließt, im Debian-Archiv akzeptiert wurde. Daher können und sollen Sie, sobald Sie die Benachrichtigung erhalten, dass Ihr aktualisiertes Paket in das Archiv installiert wurde, den Fehler im BTS schließen. Außerdem sollte der Fehler mit der korrekten Version geschlossen werden.
fr: Au fur et à mesure que les bogues et problèmes sont corrigés dans vos paquets, il est de votre responsabilité en tant que responsable du paquet de fermer les rapports de bogue associés. Cependant, vous ne devez pas les fermer avant que le paquet n'ait été accepté dans l'archive Debian. C'est pourquoi, vous pouvez et devriez clore les rapports dans le système de suivi des bogues une fois que vous avez reçu l'avis indiquant que votre nouveau paquet a été installé dans l'archive. Le bogue devrait être fermé avec la bonne version.
ja: バグや問題があなたのパッケージで修正されたとしたら、そのバグを閉じるのはパッケージメンテナとしての責任になります。しかし、バグを修正したパッケージが Debian アーカイブに受け入れられるまではバグを閉じてはいけません。従って、一旦更新したパッケージがアーカイブにインストールされたという通知を受け取った場合は、BTS でバグを閉じることができますし、そうしなければいけません。もちろん、バグは正しいバージョンで閉じなくてはいけません。

source: However, it's possible to avoid having to manually close bugs after the upload — just list the fixed bugs in your <filename>debian/changelog</filename> file, following a certain syntax, and the archive maintenance software will close the bugs for you. For example:
de: Es ist jedoch möglich, das manuelle Schließen von Fehlern nach dem Upload zu vermeiden – führen Sie die behobenen Fehler in Ihrer <filename>debian/changelog</filename>-Datei auf. Folgen Sie dabei einer bestimmten Syntax, dann wird die Verwaltungssoftware die Fehler für Sie schließen. Zum Beispiel:
fr: Cependant, il est possible de fermer automatiquement les bogues après l'envoi — indiquez simplement les bogues corrigés dans le fichier <filename>debian/changelog</filename> en suivant une syntaxe précise, et le logiciel de maintenance de l'archive s'occupera de le fermer pour vous. Par exemple :
ja: ですが、アップロード後に手動でバグをクローズしなくても済む方法があります — <filename>debian/changelog</filename> に以下の特定の書き方にて修正したバグを列挙すれば、それだけで後はアーカイブのメンテナンスソフトがバグをクローズしてくれます。例:

source: Technically speaking, the following Perl regular expression describes how bug closing changelogs are identified:
de: Technisch gesehen beschreibt der folgende reguläre Perl-Ausdruck, wie das Schließen von Fehlern in Änderungsprotokollen identifiziert wird:
fr: D'un point de vue technique, l'expression rationnelle Perl suivante décrit comment sont identifiées les fermetures de bogue dans les lignes de <filename>changelog</filename> :
ja: 技術的に言うと、どの様にしてバグを閉じる changelog が判別されているかを以下の Perl の正規表現にて記述しています:

source: We prefer the <literal>closes: #<replaceable>XXX</replaceable></literal> syntax, as it is the most concise entry and the easiest to integrate with the text of the <filename>changelog</filename>. Unless specified different by the <literal>-v</literal>-switch to <command>dpkg-buildpackage</command>, only the bugs closed in the most recent changelog entry are closed (basically, exactly the bugs mentioned in the changelog-part in the <filename>.changes</filename> file are closed).
de: Die Syntax <literal>closes: #<replaceable>XXX</replaceable></literal> wird bevorzugt, da sie die kürzeste Art des Eintrags ist und am einfachsten in dem Text von <filename>changelog</filename> integriert werden kann. Falls nicht durch den Schalter <literal>-v</literal> von <command>dpkg-buildpackage</command> etwas anderes angegeben wurde, werden nur die Fehler im aktuellsten Eintrag des Änderungsprotokolls geschlossen (grundsätzlich werden exakt die Fehler geschlossen, die in der Datei <filename>.changes</filename> im »changelog-part« genannt werden).
fr: La syntaxe « <literal>closes: #<replaceable>XXX</replaceable></literal> » est à préférer, car c'est la plus concise et facile à intégrer au texte de <filename>changelog</filename>. À moins de spécifier un comportement différent avec l'option <literal>-v</literal> de <command>dpkg-buildpackage</command>, seuls les bogues ainsi marqués dans l'entrée la plus récente de <filename>changelog</filename> seront fermés (de fait, seuls les bogues signalés dans la partie relative au journal de modification du fichier <filename>.changes</filename> sont fermés).
ja: <literal>closes: #<replaceable>XXX</replaceable></literal> という書き方が推奨されています。これは、最も分かり易いエントリで、<filename>changelog</filename> の本文に挿入するのがもっとも簡単だからです。<command>dpkg-buildpackage</command> に <literal>-v</literal> スイッチを指定して別バージョンを指定しない限り、最も新しい changelog のエントリにあるバグだけが閉じられます (基本的には、です。正確には <filename>.changes</filename> ファイルの changelog-part で明示されたバグが閉じられます)。

source: Historically, uploads identified as <link linkend="nmu">non-maintainer upload (NMU)</link> were tagged <literal>fixed</literal> instead of being closed, but that practice was ceased with the advent of version-tracking. The same applied to the tag <literal>fixed-in-experimental</literal>.
de: Früher wurden Uploads, die als <link linkend="nmu">Non-Maintainer Upload (NMU)</link> erkannt wurden, als <literal>fixed</literal> statt als »closed« gekennzeichnet, aber diese Praxis wurde mit dem Beginn der Versionsverfolgung eingestellt. Das gleiche wurde mit der Markierung <literal>fixed-in-experimental</literal> getan.
fr: Historiquement, les envois identifiés comme <link linkend="nmu">mise à jour indépendante (« <literal>non-maintainer upload</literal> » ou NMU)</link> étaient marqués comme <literal>fixed</literal> au lieu d'être fermés, mais cette pratique a cessé avec l'ajout du suivi des versions. Le même raisonnement s'applique à l'étiquette <literal>fixed-in-experimental</literal>.
ja: 歴史的に、<link linkend="nmu">non-maintainer upload (NMU)</link> と判別されるアップロードは closed ではなく <literal>fixed</literal> とタグがされてきましたが、この習慣はバージョントラッキングの進化によって廃れています。同じことが <literal>fixed-in-experimental</literal> タグにも言えます。

source: If you happen to mistype a bug number or forget a bug in the changelog entries, don't hesitate to undo any damage the error caused. To reopen wrongly closed bugs, send a <literal>reopen <replaceable>XXX</replaceable></literal> command to the bug tracking system's control address, &email-bts-control;. To close any remaining bugs that were fixed by your upload, email the <filename>.changes</filename> file to <email><replaceable>XXX</replaceable>-done@&bugs-host;</email>, where <replaceable>XXX</replaceable> is the bug number, and put Version: <replaceable>YYY</replaceable> and an empty line as the first two lines of the body of the email, where <replaceable>YYY</replaceable> is the first version where the bug has been fixed.
de: Falls Sie sich bei der Fehlernummer vertippt haben oder einen Fehler in den Änderungsprotokolleinträgen vergessen haben, zögern Sie nicht, jeglichen durch den Fehler verursachten Schaden rückgängig zu machen. Um fälschlicherweise geschlossene Fehler neu zu öffnen, senden Sie den Befehl <literal>reopen <replaceable>XXX</replaceable></literal> an die Steuerungsadresse &email-bts-control; der Fehlerdatenbank. Um irgendwelche verbleibenden Fehler zu schließen, die durch Ihren Upload behoben wurden, mailen Sie die Datei <filename>.changes</filename> an <email><replaceable>XXX</replaceable>-done@&bugs-host;</email>, wobei <replaceable>XXX</replaceable> die Fehlernummer ist und tragen Sie Version: <replaceable>YYY</replaceable> und eine leere Zeile als erste zwei Zeilen in den Textteil der Mail ein, wobei <replaceable>YYY</replaceable> die erste Version ist, in der der Fehler behoben wurde.
fr: Si vous entrez un numéro de bogue incorrect ou si vous oubliez un bogue dans les entrées du fichier <filename>changelog</filename>, n'hésitez pas à annuler tout dommage que l'erreur a entraîné. Pour rouvrir un bogue fermé par erreur, envoyez une commande <literal>reopen <replaceable>XXX</replaceable></literal> à l'adresse de contrôle du système de suivi des bogues, &email-bts-control;. Pour fermer tous les bogues restants qui ont été corrigés par votre envoi, envoyez le fichier <filename>.changes</filename> à <email><replaceable>XXX</replaceable>-done@&bugs-host;</email> où <replaceable>XXX</replaceable> est le numéro du bogue et placez « Version: <replaceable>YYY</replaceable> » et une ligne vide comme deux premières lignes du corps du courrier où <replaceable>YYY</replaceable> est la première version dans laquelle le bogue a été corrigé.
ja: もしバグ場号を間違って入力したり、changelog のエントリにバグを入れ忘れた場合、そのミスが起こすであろうダメージを防ぐのを躊躇わないでください。誤って閉じたバグを再度オープンにするには、バグトラッキングシステムのコントロールアドレスである &email-bts-control; に <literal>reopen <replaceable>XXX</replaceable></literal> コマンドを投げます。アップロードで修正されたがまだ残っているバグを閉じるには <filename>.changes</filename> ファイルを <email><replaceable>XXX</replaceable>-done@&bugs-host;</email> にメールします。<replaceable>XXX</replaceable> はバグ番号で、メールの本文の最初の 2 行に Version: <replaceable>YYY</replaceable> と空白行を入れます。<replaceable>YYY</replaceable> はバグが修正された最初のバージョンです。

source: Bear in mind that it is not obligatory to close bugs using the changelog as described above. If you simply want to close bugs that don't have anything to do with an upload you made, do it by emailing an explanation to <email><replaceable>XXX</replaceable>-done@&bugs-host;</email>. Do <emphasis role="strong">not</emphasis> close bugs in the changelog entry of a version if the changes in that version of the package don't have any bearing on the bug.
de: Behalten Sie im Gedächnis, dass es nicht verpflichend ist, Fehler unter Benutzung des Änderungsprotokolls zu schließen, wie oben beschrieben. Falls Sie nur einfach einen Fehler schließen möchten, der mit dem von Ihnen getätigten Upload nichts zu tun hat, können Sie dies durch Mailen einer Erläuterung an <email><replaceable>XXX</replaceable>-done@&bugs-host;</email> erledigen. Schließen Sie <emphasis role="strong">keine</emphasis> Fehler im Änderungsprotokolleintrag einer Version, wenn die Änderungen in dieser Version des Pakets keine Bedeutung für den Fehler haben.
fr: Rappelez-vous qu'il n'est pas obligatoire de fermer les bogues en utilisant le <filename>changelog</filename> tel que décrit ci-dessus. Si vous désirez simplement fermer les bogues qui n'ont rien à voir avec l'un de vos envois, faites-le simplement en envoyant une explication à <email><replaceable>XXX</replaceable>-done@&bugs-host;</email>. Vous ne devez <emphasis role="strong">jamais</emphasis> fermer des bogues dans une entrée du journal de modification (<filename>changelog</filename>) si les changements dans cette version n'ont rien à voir avec le bogue.
ja: 上に書いたような changelog を使ったバグの閉じ方は必須ではない、ということは念頭に置いておいてください。行ったアップロードとは無関係に単にバグを閉じたい、という場合は、説明をメールに書いて <email><replaceable>XXX</replaceable>-done@&bugs-host;</email> に送ってバグを閉じてください。そのバージョンのパッケージでの変更がバグに何も関係ない場合は、そのバージョンの changelog エントリではバグを<emphasis role="strong">閉じないで</emphasis>ください。

source: For general information on how to write your changelog entries, see <xref linkend="bpp-debian-changelog"/>.
de: Allgemeine Informationen über das Verfassen von Änderungsprotokolleinträgen finden Sie unter <xref linkend="bpp-debian-changelog"/>.
fr: Pour une information plus générale sur ce qu'il faut mettre dans les entrées du journal de modification (<filename>changelog</filename>), voir <xref linkend="bpp-debian-changelog"/>.
ja: どのように changelog のエントリを書くのか、一般的な情報については <xref linkend="bpp-debian-changelog"/> を参照してください。

source: Handling security-related bugs
de: Handhabung von sicherheitsrelevanten Fehlern
fr: Gestion des bogues de sécurité
ja: セキュリティ関連バグの取扱い

source: Due to their sensitive nature, security-related bugs must be handled carefully. The Debian Security Team exists to coordinate this activity, keeping track of outstanding security problems, helping maintainers with security problems or fixing them themselves, sending security advisories, and maintaining <literal>security.debian.org</literal>.
de: Aufgrund ihrer sensiblen Natur müssen sicherheitsrelevante Fehler vorsichtig gehandhabt werden. Das Debian-Sicherheits-Team existiert, um diese Aktivitäten zu koordinieren, ausstehende Sicherheitsprobleme zu verfolgen, Paketbetreuern bei Sicherheitsproblemen zu helfen oder sie selbst zu beheben, Sicherheitswarnungen zu senden und <literal>security.debian.org</literal> zu verwalten.
fr: À cause de leur nature sensible, les bogues liés à la sécurité doivent être soigneusement traités. L'équipe de sécurité de Debian est là pour coordonner cette activité, pour faire le suivi des problèmes de sécurité en cours, pour aider les responsables ayant des problèmes de sécurité ou pour les corriger elle-même, pour envoyer les annonces de sécurité et pour maintenir <literal>security.debian.org</literal>.
ja: 機密性が高いその性質上、セキュリティ関連のバグは注意深く取り扱わねばなりません。この作業をコーディネイトし、未処理のセキュリティ問題を追い続け、セキュリティ問題についてメンテナを手助けしたり修正自体を行い、セキュリティ勧告を出し、<literal>security.debian.org</literal> を維持するために Debian セキュリティチームが存在します。

source: When you become aware of a security-related bug in a Debian package, whether or not you are the maintainer, collect pertinent information about the problem, and promptly contact the security team, preferably by filing a ticket in their Request Tracker. See <ulink url="http://wiki.debian.org/rt.debian.org#Security_Team"></ulink>. Alternatively you may email &email-security-team;. <emphasis role="strong">DO NOT UPLOAD</emphasis> any packages for <literal>stable</literal> without contacting the team. Useful information includes, for example:
de: Wenn Sie einen sicherheitsrelevanten Fehler in einem Debian-Paket bemerken, dessen Betreuer Sie sind oder nicht, sammeln Sie sachdienliche Informationen über das Problem und kontaktieren Sie umgehend das Sicherheits-Team, vorzugsweise durch Einreichen eines Eintrags in der Anfragenverfolgung (»Request Tracker«). Siehe <ulink url="http://wiki.debian.org/rt.debian.org#Security_Team"></ulink>. Alternativ können Sie eine E-Mail an &email-security-team; senden. <emphasis role="strong">LADEN SIE KEINE</emphasis> Pakete für <literal>stable</literal> hoch, ohne das Team zu kontaktieren. Nützliche Informationen enthalten beispielsweise:
fr: Si vous prenez connaissance d'un bogue lié à un problème de sécurité sur un paquet Debian, que vous soyez ou non le responsable, regroupez les informations pertinentes sur le problème et contactez rapidement l'équipe de sécurité, de préférence en remplir un ticket sur leur système de suivi de requêtes. Consultez <ulink url="http://wiki.debian.org/rt.debian.org#Security_Team"></ulink>. Sinon, vous pourriez envoyer un courrier à &email-security-team;. <emphasis role="strong">n'envoyez pas</emphasis> de paquet pour <literal>stable</literal> sans contacter l'équipe de sécurité. Les informations utiles comprennent, par exemple :
ja: Debian パッケージ中のセキュリティ関連のバグに気づいたら、あなたがメンテナであるかどうかに関わらず、問題に関する正確な情報を集めて、まずはセキュリティチームに連絡を取ってください。この場合、リクエストトラッカーにチケットを登録するのが好ましいです。<ulink url="http://wiki.debian.org/rt.debian.org#Security_Team"></ulink> を参照してください。あるいは &email-security-team; にメールすることもできます。チームに問い合わせること無く <literal>安定版 (stable)</literal> 向けのパッケージを<emphasis role="strong">アップロードしないでください</emphasis>。例えば、役に立つ情報は以下を含んでいます:

source: Whether or not the bug is already public.
de: ob der Fehler bereits öffentlich ist oder nicht.
fr: si le bogue a déjà été rendu public on non ;
ja: バグが既に公開されているか否か

source: Which versions of the package are known to be affected by the bug. Check each version that is present in a supported Debian release, as well as <literal>testing</literal> and <literal>unstable</literal>.
de: von welchen Versionen des Pakets bekannt ist, dass sie vom Fehler betroffen sind. Prüfen Sie jede Version, die es in einem unterstützten Debian-Release gibt, ebenso wie <literal>testing</literal> und <literal>unstable</literal>.
fr: les versions du paquet affectées par le bogue. Vérifiez chaque version présente dans les distributions maintenues par Debian ainsi que dans <literal>testing</literal> et <literal>unstable</literal> ;
ja: バグによって、どのバージョンが影響を受けると分かっているか。サポートされている Debian のリリース、ならびに <literal>テスト版 (testing)</literal> 及び <literal>不安定版 (unstable)</literal> にある各バージョンをチェックしてください。

source: The nature of the fix, if any is available (patches are especially helpful)
de: die Art der Fehlerbehebung, falls verfügbar (Patchs sind besonders hilfreich)
fr: la nature d'une solution si elle existe (les correctifs sont particulièrement utiles) ;
ja: 利用可能なものがあれば、修正内容 (パッチが特に望ましい)

source: Any fixed packages that you have prepared yourself (send only the <filename>.diff.gz</filename> and <filename>.dsc</filename> files and read <xref linkend="bug-security-building"/> first)
de: jedes reparierte Paket, das Sie für sich selbst vorbereitet haben (senden Sie nur die Dateien <filename>.diff.gz</filename> und <filename>.dsc</filename> und lesen Sie zuerst <xref linkend="bug-security-building"/>)
fr: tout paquet corrigé préparé par vous-même (envoyez seulement les fichiers <filename>.diff.gz</filename> et <filename>.dsc</filename> et lisez d'abord <xref linkend="bug-security-building"/>) ;
ja: 自身で準備した修正パッケージ (まずは <xref linkend="bug-security-building"/> を読んで、<filename>.diff.gz</filename> と <filename>.dsc</filename> ファイルだけを送ってください)

source: Any assistance you can provide to help with testing (exploits, regression testing, etc.)
de: jede Unterstützung, die sie zur Hilfe beim Testen anbieten können (Exploits, Regressionstest etc.)
fr: toute assistance possible pour aider à tester (exploitation de faille, tests de régression, etc.) ;
ja: テストについて何かしらの手助けになるもの (攻撃コード、リグレッションテストなど)

source: Any information needed for the advisory (see <xref linkend="bug-security-advisories"/>)
de: jede Information, die für die zur Warnung nötig ist (siehe <xref linkend="bug-security-advisories"/>)
fr: toute information utile pour l'annonce de sécurité (voir <xref linkend="bug-security-advisories"/>).
ja: 勧告に必要になる情報 (<xref linkend="bug-security-advisories"/> 参照)

source: As the maintainer of the package, you have the responsibility to maintain it, even in the stable release. You are in the best position to evaluate patches and test updated packages, so please see the sections below on how to prepare packages for the Security Team to handle.
de: Als Betreuer des Pakets sind sie verantwortlich für dessen Verwaltung, sogar im Stable-Release. Sie sind in der besten Position, um Patchs zu beurteilen und aktualisierte Pakete zu testen, sehen Sie daher bitte in die folgenden Abschnitte, wie Pakete vorbereitet werden, damit sie vom Sicherheits-Team gehandhabt werden können.
fr: En tant que responsable d'un paquet, il est de votre devoir de le maintenir, même dans la distribution stable. Vous êtes le mieux placé pour apprécier les correctifs et tester les paquets mis à jour, donc merci de vous référer aux sections suivantes sur la façon de préparer les paquets pour l'équipe en charge de la sécurité.
ja: パッケージメンテナとして、あなたは安定版リリースについてもメンテナンスする責任を持ちます。あなたがパッチの評価と更新パッケージのテストを行うのに最も適任な人です。ですから、以下のセキュリティチームによって取り扱ってもらうため、どのようにしてパッケージを用意するかについての章を参照してください。

source: The Security Tracker
de: Die Sicherheits-Fehlerverfolgung
fr: Gestionnaire de sécurité (« <literal>Security Tracker</literal> »)
ja: セキュリティ追跡システム

source: The security team maintains a central database, the <ulink url="http://security-tracker.debian.org/">Debian Security Tracker</ulink>. This contains all public information that is known about security issues: which packages and versions are affected or fixed, and thus whether stable, testing and/or unstable are vulnerable. Information that is still confidential is not added to the tracker.
de: Das Sicherheits-Team verwaltet eine zentrale Datenbank, die <ulink url="http://security-tracker.debian.org/">Debian-Sicherheits-Fehlerverfolgung</ulink>. Diese enthält alle öffentlich verfügbaren Informationen, die über Sicherheitsthemen verfügbar sind: welche Pakete und Versionen betroffen oder repariert sind und ob daher Stable, Testing und/oder Unstable angreifbar sind. Informationen, die immer noch vertraulich sind, werden nicht zur Fehlerverfolgung hinzugefügt.
fr: L'équipe en charge de la sécurité gère une base de donnée centralisée, le <ulink url="http://security-tracker.debian.org/">gestionnaire de sécurité Debian (« <literal>Debian Security Tracker</literal> »)</ulink>. Il contient tous les renseignements possibles à propos des problèmes de sécurité connus : quelles sont les paquets et versions affectés et non affectés, et par conséquent si <literal>stable</literal>, <literal>testing</literal> et <literal>unstable</literal> sont vulnérables. Les informations encore confidentielles ne sont pas ajoutées à la base de données.
ja: セキュリティチームは集約的なデータベース、<ulink url="http://security-tracker.debian.org/">Debian セキュリティ追跡システム (Debian Security Tracker)</ulink>をメンテナンスしています。これはセキュリティ問題として知られている全ての公開情報を含んでいます: どのパッケージ／バージョンが影響を受ける／修正されているか、つまりは安定版、テスト版、不安定版が脆弱かどうか、という情報です。まだ機密扱いの情報は追跡システムには追加されません。
