Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: To acknowledge an NMU, include its changes and changelog entry in your next maintainer upload. If you do not acknowledge the NMU by including the NMU changelog entry in your changelog, the bugs will remain closed in the BTS but will be listed as affecting your maintainer version of the package.
de: Um einen NMU anzuerkennen, schließen Sie dessen Änderungen und Änderungsprotokolleinträge in Ihren nächsten Upload ein. Falls Sie den NMU nicht anerkennen, schließen Sie den Änderungsprotokolleintrag des NMUs in Ihr Änderungsprotokoll ein, die Fehler bleiben im BTS geschlossen, werden aber als Ihre Betreuerversion des Pakets betreffend aufgeführt.
fr: Pour prendre en compte une NMU, intégrez ses modifications et l'entrée de journal de modification (<filename>changelog</filename>) lors de votre envoi suivant. Si vous ne prenez pas en compte la NMU en conservant l'entrée de <filename>changelog</filename> correspondante, le bogue restera fermé dans le BTS mais sera listé comme affectant votre version du paquet.
ja: NMU を承認するには、変更と changelog のエントリを次のメンテナアップロードに含めます。バグは BTS で close されたままになりますが、パッケージのメンテナバージョンに影響していると表示されます。

source: Source NMUs vs Binary-only NMUs (binNMUs)
de: Quell-NMUs gegenüber rein binären NMUs (binNMUs)
fr: Mise à jour indépendante source (<literal>NMU</literal>) et binaire (<literal>binNMU</literal>)
ja: ソース NMU vs バイナリのみの NMU (binNMU)

source: The full name of an NMU is <emphasis>source NMU</emphasis>. There is also another type, namely the <emphasis>binary-only NMU</emphasis>, or <emphasis>binNMU</emphasis>. A binNMU is also a package upload by someone other than the package's maintainer. However, it is a binary-only upload.
de: Der vollständige Name eines NMUs ist <emphasis>Quell-NMU</emphasis>. Es gibt auch einen anderen Typ, der <emphasis>rein binärer NMU</emphasis> oder <emphasis>binNMU</emphasis> genannt wird. Ein binNMU ist ebenfalls ein Paket-Upload durch jemand anderes als den Paketbetreuer. Er ist jedoch rein binär.
fr: Le nom complet pour une NMU est <emphasis>mise à jour indépendante source (« <literal>source NMU</literal> »)</emphasis>. Il en existe aussi d'un autre type, appelé <emphasis>mise à jour indépendante binaire (« <literal>binary-only NMU</literal> » ou « <literal>binNMU</literal> »)</emphasis>. Une binNMU est aussi un paquet envoyé par quelqu'un d'autre que le responsable du paquet. Cependant, seul le paquet binaire est mis à jour.
ja: NMU のフルネームは<emphasis>ソース NMU</emphasis> です。もう一つ別の種類があって、<emphasis>バイナリのみの NMU (binary-only NMU)</emphasis> あるいは <emphasis>binNMU</emphasis> と名付けられています。binNMU も、パッケージメンテナ以外の誰かによるパッケージのアップロードです。しかし、これはバイナリのみのアップロードです。

source: When a library (or other dependency) is updated, the packages using it may need to be rebuilt. Since no changes to the source are needed, the same source package is used.
de: Wenn eine Bibliothek (oder andere Abhängigkeit) aktualisiert wird, könnte es notwendig sein, das Paket neu zu erstellen. Da keine Änderungen am Quellcode nötig sind, wird das gleiche Quellpaket benutzt.
fr: Lorsqu'une bibliothèque (ou toute autre dépendance) est mise à jour, les paquets l'utilisant risquent de devoir être reconstruits. Puisque le code source n'a pas besoin d'être modifié, le même paquet source est utilisé.
ja: ライブラリ (や他の依存関係) が更新された時、それを使っているパッケージを再ビルドする必要があるかもしれません。ソースへの変更は必要ないので、同じソースパッケージが利用されます。

source: BinNMUs are usually triggered on the buildds by wanna-build. An entry is added to <filename>debian/changelog</filename>, explaining why the upload was needed and increasing the version number as described in <xref linkend="binary-only-nmu"/>. This entry should not be included in the next upload.
de: BinNMUs werden üblicherweise auf Buildds durch Wanna-Build ausgelöst. <filename>debian/changelog</filename> wird ein Eintrag hinzugeführt, der erklärt, warum der Upload nötig war und die Versionsnummer wird, wie in <xref linkend="binary-only-nmu"/> beschrieben, erhöht. Dieser Eintrag sollte nicht im nächsten Upload enthalten sein.
fr: Les binNMU sont généralement déclenchées sur les empaqueteurs (« <literal>buildd</literal> ») par <systemitem role="package">wanna-build</systemitem>. Une entrée est ajoutée à <filename>debian/changelog</filename> expliquant pourquoi un envoi était requis et le numéro de version est augmenté tel que décrit en <xref linkend="binary-only-nmu"/>. Cette entrée ne devrait pas être gardée lors de l'envoi suivant.
ja: binNMU は、通常 wanna-build によって buildd 上で引き起こされます。<filename>debian/changelog</filename> にエントリが追加され、なぜアップロードが必要だったのか、という説明と <xref linkend="binary-only-nmu"/> で記述されているようにバージョン番号を増やします。このエントリは、その次のアップロードに含めるべきではありません。

source: Buildds upload packages for their architecture to the archive as binary-only uploads. Strictly speaking, these are binNMUs. However, they are not normally called NMU, and they don't add an entry to <filename>debian/changelog</filename>.
de: Buildds lädt Pakete für seine Architektur als rein binäre Uploads in das Archiv. Genaugenommen sind dies binNMUs. Sie werden jedoch normalerweise nicht als NMU bezeichnet und fügen <filename>debian/changelog</filename> keinen Eintrag hinzu.
fr: Les empaqueteurs (« <literal>buildd</literal> ») envoient les paquets de leur architecture comme des mises à jour binaire. Au sens strict, ce sont des binNMU. Cependant, elles ne sont généralement pas appelées NMU, et aucune entrée n'est ajoutée à <filename>debian/changelog</filename>.
ja: buildd は、アーカイブするために、バイナリのみのアップロードとして、そのアーキテクチャに対してパッケージをアップロードします。厳密に言えば、これは binNMU です。しかし、これは通常 NMU とは呼ばれず、<filename>debian/changelog</filename> にエントリを追加しません。

source: NMUs vs QA uploads
de: NMUs gegenüber QS-Uploads
fr: NMU et envoi de <literal>QA</literal>
ja: NMU vs QA アップロード

source: NMUs are uploads of packages by somebody else than their assigned maintainer. There is another type of upload where the uploaded package is not yours: QA uploads. QA uploads are uploads of orphaned packages.
de: NMUs sind Uploads von Paketen durch jemand anderes als den ihnen zugewiesenen Betreuer. Es gibt noch einen anderen Upload-Typ, bei dem ihm das hochgeladene Paket nicht gehört: QS-Uploads. QS-Uploads sind Uploads verwaister Pakete.
fr: Les NMU sont des envois effectués par quelqu'un d'autre que le responsable attitré. Il existe un autre type d'envoi où le paquet n'est pas le sien : les envois de <literal>QA</literal>, qui sont des envois pour les paquets orphelins.
ja: NMU は、割り当てられているメンテナ以外の誰かによるパッケージのアップロードです。自分のものではないパッケージのアップロードについては、もう一つ、別の種類のアップロードがあります: QA アップロードです。QAアップロードは、みなしご化されたパッケージのアップロードです。

source: QA uploads are very much like normal maintainer uploads: they may fix anything, even minor issues; the version numbering is normal, and there is no need to use a delayed upload. The difference is that you are not listed as the <literal>Maintainer</literal> or <literal>Uploader</literal> for the package. Also, the changelog entry of a QA upload has a special first line:
de: QS-Uploads sind normalen Betreuer-Uploads sehr ähnlich: sie können alles reparieren, sogar kleine Probleme. Die Versionsnummerierung ist normal und es sind keine verzögerten Uploads nötig. Der Unterschied besteht darin, dass Sie nicht als <literal>Maintainer</literal> oder <literal>Uploader</literal> des Pakets aufgeführt werden. Außerdem hat der Änderungsprotokolleintrag eines QS-Uploads eine spezielle erste Zeile:
fr: Les envois de <literal>QA</literal> ressemblent beaucoup à des envois normaux de responsable : ils peuvent corriger quelque chose, même un problème mineur ; la numérotation de version est normale, et il n'est pas nécessaire d'utiliser d'envoi retardé. La différence est que vous ne faites pas partie des responsables (<literal>Maintainer</literal> ou <literal>Uploader</literal>) du paquet. Ainsi, l'entrée du journal de modification (<filename>changelog</filename>) d'un envoi de <literal>QA</literal> commence par la ligne :
ja: QA アップロードは、ほとんど通常のメンテナによるアップロードと同じです: 些細な問題であっても、なんでも修正します。バージョン番号の付け方は通常のものですし、delay アップロードをする必要もありません。違いは、パッケージのメンテナあるいはアップローダとして記載されていない点です。また、QA アップロードの changelog のエントリは以下のように最初の一行が特別になっています:

source: If you want to do an NMU, and it seems that the maintainer is not active, it is wise to check if the package is orphaned (this information is displayed on the package's Package Tracking System page). When doing the first QA upload to an orphaned package, the maintainer should be set to <literal>Debian QA Group &lt;packages@qa.debian.org&gt;</literal>. Orphaned packages which did not yet have a QA upload still have their old maintainer set. There is a list of them at <ulink url="&url-orphaned-not-qa;"/>.
de: Falls Sie einen NMU durchführen möchten und es so aussieht, als sei der Betreuer nicht aktiv, ist es vernünftig zu prüfen, ob das Paket verwaist ist (diese Information wird auf der Seite des Pakets im Paketverfolgungssystem »PTS« angezeigt). Beim ersten QS-Upload zu einem verwaisten Paket, sollte der Betreuer auf <literal>Debian QA Group &lt;packages@qa.debian.org&gt;</literal> gesetzt werden. Bei verwaisten Paketen, für die noch kein QS-Upload durchgeführt wurde, ist immer noch der alte Betreuer gesetzt. Eine Liste dieser Pakete finden Sie unter <ulink url="&url-orphaned-not-qa;"/>.
fr: Si vous voulez faire une NMU, et que le responsable ne semble pas actif, il est judicieux de vérifier le paquet pour voir s'il est orphelins (cette information est disponible sur la page du PTS relative au paquet). Lors d'un premier envoi de <literal>QA</literal> sur un paquet orphelin, veuillez positionner le responsable à « <literal>Debian QA Group &lt;packages@qa.debian.org&gt;</literal> ». La liste actuelle des paquets orphelins dont le responsable n'a pas encore été modifié est disponible en <ulink url="&url-orphaned-not-qa;"/>.
ja: あなたが NMU をしたいと思い、かつ、メンテナが活動的ではない場合、パッケージがみなしご化されてないかどうかを確認するのが賢明です (この情報はパッケージ追跡システム (PTS) のページで表示されています)。みなしご化されたパッケージに対して最初の QA アップロードを行うときは、メンテナは <literal>Debian QA Group &lt;packages@qa.debian.org&gt;</literal> に設定する必要があります。まだ QA アップロードがされていないみなしご化されたパッケージには、以前のメンテナが設定されています。この一覧は <ulink url="&url-orphaned-not-qa;"/> で手に入ります。

source: Instead of doing a QA upload, you can also consider adopting the package by making yourself the maintainer. You don't need permission from anybody to adopt an orphaned package, you can just set yourself as maintainer and upload the new version (see <xref linkend="adopting"/>).
de: Anstatt einen QS-Upload durchzuführen, können Sie auch erwägen das Paket zu adoptieren, indem Sie sich selbst zum Betreuer machen. Sie benötigen von niemandem eine Erlaubnis, um ein verwaistes Paket zu adoptieren, Sie müssen sich nur selbst als Betreuer einsetzen und die neue Version hochladen (siehe <xref linkend="adopting"/>).
fr: Plutôt que faire un envoi de <literal>QA</literal>, vous pouvez envisager l'adoption du paquet en devenant son responsable. Vous n'avez besoin de la permission de personne pour adopter un paquet orphelin, il suffit de vous configurer comme responsable et d'envoyer la nouvelle version (voir <xref linkend="adopting"/>).
ja: QA アップロードをする代わりに、メンテナをあなた自身に変更してパッケージを引き取ることも考えられます。みなしご化されたパッケージを引き取るのには、誰からの許可も必要としません。メンテナをあなた自身に設定して新しいバージョンをアップロードするだけです (<xref linkend="adopting"/> を参照)。

source: NMUs vs team uploads
de: NMUs gegenüber Team-Uploads
fr: NMU et envoi d'équipe
ja: NMU vs チームアップロード

source: Sometimes you are fixing and/or updating a package because you are member of a packaging team (which uses a mailing list as <literal>Maintainer</literal> or <literal>Uploader</literal>, see <xref linkend="collaborative-maint"/>) but you don't want to add yourself to <literal>Uploaders</literal> because you do not plan to contribute regularly to this specific package. If it conforms with your team's policy, you can perform a normal upload without being listed directly as <literal>Maintainer</literal> or <literal>Uploader</literal>. In that case, you should start your changelog entry with the following line:
de: Manchmal reparieren und/oder aktualisieren Sie ein Paket, weil Sie Mitglied des Paketierungs-Teams sind (das als <literal>Maintainer</literal> oder <literal>Uploader</literal> eine Mailingliste benutzt, siehe <xref linkend="collaborative-maint"/>), aber Sie möchten sich selbst nicht zu den <literal>Uploaders</literal> hinzufügen, da Sie nicht planen, regulär an diesem speziellen Paket mitzuarbeiten. Falls dies mit den Richtlinien Ihres Teams in Einklang steht, können Sie einen normalen Upload durchführen ohne direkt als <literal>Maintainer</literal> oder <literal>Uploader</literal> aufgeführt zu werden. In diesem Fall sollten Sie Ihren Änderungsprotokolleintrag mit der folgenden Zeile beginnen:
fr: Parfois, vous corrigez ou envoyez un paquet car vous êtes membre d'une équipe de responsables (qui utilise une liste de diffusion comme responsable (<literal>Maintainer</literal> ou <literal>Uploader</literal>), voir <xref linkend="collaborative-maint"/>), mais vous ne voulez pas vous ajouter comme co-responsable (<literal>Uploaders</literal>) car vous n'avez pas l'intention de participer régulièrement à ce paquet. Si cela est conforme avec la politique de votre équipe, vous pouvez procéder à un envoi normal sans être listé parmi les responsables (<literal>Maintainer</literal> ou <literal>Uploader</literal>). Dans ce cas, vous devriez commencer l'entrée du journal de modification (<filename>changelog</filename>) par la ligne suivante :
ja: パッケージングチーム (<literal>Maintainer</literal> あるいは <literal>Uploader</literal> としてメーリングリストを使う。<xref linkend="collaborative-maint"/> 参照) の一員であるため、時々パッケージを修正あるいは更新しているが、常にこの特定パッケージに貢献する予定は無いので自分を <literal>Uploaders</literal> には加えたくはない、という時があります。これがあなたのチームの方針に沿っているなら、直接 <literal>Maintainer</literal> 欄や <literal>Uploader</literal> 欄に記載せずとも通常のアップロードが可能です。この場合、changelog のエントリを以下の行で始める必要があります:

source: Collaborative maintenance
de: Gemeinschaftliche Verwaltung
fr: Maintenance collective
ja: 共同メンテナンス

source: Collaborative maintenance is a term describing the sharing of Debian package maintenance duties by several people. This collaboration is almost always a good idea, since it generally results in higher quality and faster bug fix turnaround times. It is strongly recommended that packages with a priority of <literal>standard</literal> or which are part of the base set have co-maintainers.
de: Gemeinschaftliche Verwaltung ist ein Begriff, der die gemeinsamen Verwaltungspflichten von Debian-Paketen durch mehrere Leute beschreibt. Diese Zusammenarbeit ist fast immer eine gute Idee, da sie generell in einer höheren Qualität und einer schnelleren Fehlerbehebungszeit resultiert. Es wird dringend empfohlen, dass Pakete, die die Priorität <literal>standard</literal> haben, oder Teil der grundlegenden Zusammenstellung sind, Mitbetreuer haben.
fr: « Maintenance collective » est un terme décrivant le partage des devoirs de la maintenance d'un paquet Debian par plusieurs personnes. Cette collaboration est presque toujours une bonne idée car il en résulte généralement une meilleure qualité et un temps de correction de bogues plus court. Il est fortement recommandé que les paquets de priorité <literal>standard</literal> ou qui font partie de la base aient des co-responsables.
ja: 共同メンテナンス (collaborative maintenance) は、Debian パッケージのメンテナンス責任を数人でシェアすることを指す用語です。この共同作業は、通常はより上質で短いバグ修正時間をもたらすので、大抵の場合は常に良い考えです。優先度が標準 (<literal>standard</literal>) あるいは基本セット (base) の一部であるパッケージは、副メンテナ (co-maintainer) を持つことを強くお勧めします。

source: Generally there is a primary maintainer and one or more co-maintainers. The primary maintainer is the person whose name is listed in the <literal>Maintainer</literal> field of the <filename>debian/control</filename> file. Co-maintainers are all the other maintainers, usually listed in the <literal>Uploaders</literal> field of the <filename>debian/control</filename> file.
de: Generell gibt es einen Hauptbetreuer und einen oder mehrere Mitbetreuer. Der Hauptbetreuer ist die Person, deren Name im Feld <literal>Maintainer</literal> der Datei <filename>debian/control</filename> steht. Mitbetreuer sind alle anderen Betreuer. Sie werden normalerweise in der Datei <filename>debian/control</filename> im Feld <literal>Uploaders</literal> aufgeführt.
fr: Habituellement, il y a un responsable principal et un ou plusieurs co-responsables. Le responsable principal est la personne dont le nom est indiqué dans le champ <literal>Maintainer</literal> du fichier <filename>debian/control</filename>. Les co-responsables sont tous les autres responsables, normalement listés dans le champs <literal>Uploaders</literal> du fichier <filename>debian/control</filename>.
ja: 大抵の場合、主メンテナに加えて一人か二人の副メンテナが居ます。主メンテナは <filename>debian/control</filename> ファイルの <literal>Maintainer</literal> 欄に名前が記載されている人です。副メンテナは他のすべてのメンテナで、通常 <filename>debian/control</filename> ファイルの <literal>Uploaders</literal> に記載されています。

source: In its most basic form, the process of adding a new co-maintainer is quite easy:
de: In seiner grundlegendsten Form ist der Prozess neue Mitbetreuer hinzuzufügen ziemlich einfach:
fr: Dans sa forme la plus simple, ajouter un nouveau co-responsable est assez facile :
ja: もっとも基本的なやり方では、新しい副メンテナの追加は大変簡単です:

source: Setup the co-maintainer with access to the sources you build the package from. Generally this implies you are using a network-capable version control system, such as <literal>CVS</literal> or <literal>Subversion</literal>. Alioth (see <xref linkend="alioth"/>) provides such tools, amongst others.
de: Richten Sie den Mitbetreuer mit Zugriff auf die Quellen ein, aus denen Sie das Paket erstellen. Dies impliziert, dass Sie ein netzwerkfähiges Versionskontrollsystem wie <literal>CVS</literal> oder <literal>Subversion</literal> benutzen. Unter anderem stellt Alioth solche Werkzeuge bereit (siehe <xref linkend="alioth"/>).
fr: donner au co-responsable un accès aux sources à partir desquelles vous construisez le paquet. Habituellement, cela implique que vous utilisiez un système de gestion de version comme <literal>CVS</literal> ou <literal>Subversion</literal>. Alioth (voir <xref linkend="alioth"/>) fournit entre autres de tels outils ;
ja: 副メンテナが、あなたがビルドしたパッケージのソースにアクセスできるように設定します。一般に、これはあなたが <literal>CVS</literal> や <literal>Subversion</literal> のようなネットワークを利用するバージョン管理システムを利用しているということを意味しています。Alioth (<xref linkend="alioth"/> 参照) はこの様なツールを提供しており、他でも同様です。

source: Add the co-maintainer's correct maintainer name and address to the <literal>Uploaders</literal> field in the first paragraph of the <filename>debian/control</filename> file.
de: Fügen Sie im Feld <literal>Uploaders</literal> im ersten Absatz der Datei <filename>debian/control</filename> den korrekten Namen und die Adresse des Mitbetreuers ein.
fr: ajouter les nom et adresse correctes du co-responsable au champ <literal>Uploaders</literal> dans le premier paragraphe du fichier <filename>debian/control</filename> ;
ja: 副メンテナの正確なメンテナ名とアドレスを <filename>debian/control</filename> ファイルの最初の段落の <literal>Uploaders</literal> 欄に追加します。

source: Using the PTS (<xref linkend="pkg-tracking-system"/>), the co-maintainers should subscribe themselves to the appropriate source package.
de: Wird das PTS (<xref linkend="pkg-tracking-system"/>) benutzt, sollten sich die Mitbetreuer selbst für das entsprechende Quellpaket einschreiben.
fr: en utilisant le PTS (<xref linkend="pkg-tracking-system"/>), les co-responsables devraient s'inscrire eux-mêmes aux paquet source.
ja: PTS (<xref linkend="pkg-tracking-system"/>) を使う場合、副メンテナは適切なソースパッケージの購読をする必要があります。

source: Another form of collaborative maintenance is team maintenance, which is recommended if you maintain several packages with the same group of developers. In that case, the <literal>Maintainer</literal> and <literal>Uploaders</literal> field of each package must be managed with care. It is recommended to choose between one of the two following schemes:
de: Eine andere Form der gemeinschaftlichen Verwaltung stellt die Team-Verwaltung dar. Sie wird empfohlen, falls Sie mehrere Pakete mit der gleichen Entwicklergruppe verwalten. In diesem Fall müssen die Felder <literal>Maintainer</literal> und <literal>Uploaders</literal> jedes Pakets mit Vorsicht verwaltet werden. Es wird empfohlen eines der beiden folgenden Schemen auszuwählen:
fr: Une autre forme de maintenance collective est une maintenance en équipe, recommandée si vous gérez plusieurs paquets avec le même groupe de développeurs. Dans ce cas, les champs de responsables (<literal>Maintainer</literal> et <literal>Uploaders</literal>) de chaque paquet doivent être gérés avec attention. Il est conseillé de choisir parmi les deux possibilités suivantes :
ja: 共同メンテナンスのもう一つの形態はチームメンテナンスです。これは、複数のパッケージを同じ開発者グループでメンテナンスする場合にお勧めです。その場合、各パッケージの <literal>Maintainer</literal> 欄と <literal>Uploaders</literal> 欄は注意して扱わねばいけません。以下の二つの案からいずれかを選ぶのがお勧めです:

source: Put the team member mainly responsible for the package in the <literal>Maintainer</literal> field. In the <literal>Uploaders</literal>, put the mailing list address, and the team members who care for the package.
de: Setzen Sie den Hauptverantwortlichen für das Paket in das Feld <literal>Maintainer</literal> ein. In <literal>Uploaders</literal> werden die Adresse der Mailingliste und die Team-Mitglieder, die sich um das Paket kümmern, eingetragen.
fr: placer un membre de l'équipe comme responsable principal du paquet dans le champ <literal>Maintainer</literal>. En <literal>Uploaders</literal>, placer l'adresse de la liste de diffusion, et les membres de l'équipe qui s'occupent du paquet ;
ja: パッケージの主に担当をするチームメンバーを <literal>Maintainer</literal> 欄に追加します。<literal>Uploaders</literal> 欄には、メーリングリストのアドレスとパッケージの面倒をみるチームメンバーを追加します。

source: Put the mailing list address in the <literal>Maintainer</literal> field. In the <literal>Uploaders</literal> field, put the team members who care for the package. In this case, you must make sure the mailing list accept bug reports without any human interaction (like moderation for non-subscribers).
de: Setzen Sie die Adresse der Mailingliste in das Feld <literal>Maintainer</literal> ein. Im Feld <literal>Uploaders</literal> werden die Team-Mitglieder eingetragen, die sich um das Paket kümmern. In diesem Fall müssen Sie sicherstellen, dass die Mailingliste Fehlerberichte ohne menschliches Eingreifen akzeptiert (wie Moderation für Nicht-Abonnenten).
fr: placer l'adresse de la liste de diffusion dans le champ <literal>Maintainer</literal>. En <literal>Uploaders</literal>, placer les membres de l'équipe qui s'occupent du paquet. Dans ce cas, vous devez vous assurer que la liste de diffusion peut recevoir les rapports de bogue sans interaction humaine (modération pour les non inscrits par exemple).
ja: メーリングリストのアドレスを <literal>Maintainer</literal> 欄に追加します。<literal>Uploaders</literal> 欄には、パッケージの面倒をみるチームメンバーを追加します。この場合、メーリングリストは (購読者以外に対するモデレーションなどの) 人手を介さずにバグ報告を受け取ることを確認する必要があります。
