Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: For every file, ask yourself why the file is there and whether it's the right way to achieve the desired result. Is the maintainer following the best packaging practices (see <xref linkend="best-pkging-practices"/>)?
de: Fragen Sie sich für jede Datei, warum diese Datei dort ist und ob dies der richtige Weg ist das gewünschte Ergebnis zu erzielen. Folgt der Betreuer den optimalen Vorgehensweisen beim Paketieren (siehe <xref linkend="best-pkging-practices"/>)?
fr: Pour chaque fichier, demandez-vous pourquoi le fichier est là et si c'est la bonne façon d'atteindre le but voulu. Est-ce que le responsable suit les meilleurs pratiques d'empaquetage (consultez <xref linkend="best-pkging-practices"/>) ?
ja: すべてのファイルについて、そのファイルが何故そこにあるのか、望んでいる結果をもたらすためにそれが正しいやり方かどうかを自身に問いかけてください。メンテナはパッケージ化のベストプラクティスに従っていますか? (<xref linkend="best-pkging-practices"/> 参照)

source: Build the packages, install them and try the software. Ensure you can remove and purge the packages. Maybe test them with <command>piuparts</command>.
de: erstellen Sie die Pakete, installieren Sie sie und probieren Sie die Software aus. Stellen Sie sicher, dass Sie die Pakete entfernen und vollständig beseitigen können. Eventuell testen Sie sie mit <command>piuparts</command>.
fr: Construisez les paquets, installez-les et essayez le logiciel. Vérifiez de pouvoir supprimer et purger les paquets. Essayez-les si possible avec <command>piuparts</command>.
ja: パッケージをビルドし、インストールし、ソフトウェアを使ってみてください。パッケージを削除 (remove)、及び完全削除 (purge) できることを確認してください。<command>piuparts</command> でテストすると良いかもしれません。

source: If the audit did not reveal any problem, you can build the package and upload it to Debian. Remember that even if you're not the maintainer, as a sponsor you are still responsible for what you upload to Debian. That's why you're encouraged to keep up with the package through the <xref linkend="pkg-tracking-system"/>.
de: Falls die Kontrolle kein Problem offenbarte, können Sie das Paket erstellen und zu Debian hochladen. Denken Sie daran, dass, obwohl Sie nicht der Betreuer sind, Sie als ein Sponsor immer noch für das verantwortlich sind, was Sie zu Debian hochladen. Daher sei Ihnen geraten, das Paket durch das <xref linkend="pkg-tracking-system"/> im Auge zu behalten.
fr: Si la vérification n'a révélé aucun problème, vous pouvez construire le paquet et l'envoyer dans Debian. Rappelez-vous que même sans être le responsable du paquet, le parrain est toujours responsable de ce qu'il envoie dans Debian. C'est pourquoi vous devriez suivre le paquet avec le <xref linkend="pkg-tracking-system"/>.
ja: 監査で何も問題が見つからなかった場合には、パッケージをビルドして Debian へアップロードすることができます。あなたがメンテナでなかったとしても、スポンサーとして Debian へアップロードされたものへの責任を持つことを覚えておいてください。これが、 <xref linkend="pkg-tracking-system"/> を使ってパッケージを追いかけておくことが推奨される理由です。

source: Note that you should not need to modify the source package to put your name in the <filename>changelog</filename> or in the <filename>control</filename> file. The <literal>Maintainer</literal> field of the <filename>control</filename> file and the <filename>changelog</filename> should list the person who did the packaging, i.e. the sponsoree. That way they will get all the BTS mail.
de: Beachten Sie, dass Sie das Quellpaket nicht verändern sollten, um Ihren Namen in die Datei <filename>changelog</filename> oder <filename>control</filename> einzutragen. Das Feld <literal>Maintainer</literal> der Dateien <filename>control</filename> und <filename>changelog</filename> sollte die Person aufführen, die das Paket erstellte, d.h. den Gesponsorten. Auf diese Art wird er die gesamten Nachrichten des BTS erhalten.
fr: Remarquez que vous ne devriez pas avoir à modifier le paquet source pour mettre votre nom dans les fichiers <filename>changelog</filename> ou <filename>control</filename>. Le champ <literal>Maintainer</literal> du fichier <filename>control</filename> et le fichier <filename>changelog</filename> devraient afficher la personne qui a fait l'empaquetage, c'est-à-dire, le filleul. Ainsi, il recevra tous les courriers du système de suivi des bogues (BTS).
ja: <filename>changelog</filename> ファイルや <filename>control</filename> ファイルにあなたの名前を入れるために、ソースパッケージを変更する必要はないことに注意してください。<filename>control</filename> ファイルの<literal>Maintainer</literal> 欄と <filename>changelog</filename> にはパッケージ作業を行った人を記載する必要があります。つまりはスポンサー対象者、ということです。そうすることで、メンテナはすべての BTS メールを受け取るようになります。

source: Instead you should instruct <command>dpkg-buildpackage</command> to use your key for the signature. You do that with the <literal>-k</literal> option:
de: Stattdessen sollten Sie <command>dpkg-buildpackage</command> anweisen, Ihren Schlüssel für die Signatur zu benutzen. Sie erreichen dies mit der Option <literal>-k</literal>:
fr: À la place, vous devriez indiquer à <command>dpkg-buildpackage</command> d'utiliser votre clef en signature. L'option <literal>-k</literal> le permet :
ja: 代わりに、署名にあなたの鍵を使うために <command>dpkg-buildpackage</command> に指示する必要があります。これは <literal>-k</literal> オプションを使って行います:

source: dpkg-buildpackage -k<replaceable>KEY-ID</replaceable>
de: dpkg-buildpackage -k<replaceable>SCHLÜSSELNUMMER</replaceable>
fr: dpkg-buildpackage -k<replaceable>identifiant_de_clef</replaceable>

source: If you use <command>debuild</command> and <command>debsign</command>, you can even configure it permanently in <filename>~/.devscripts</filename>:
de: Falls Sie <command>debuild</command> und <command>debsign</command> benutzen, können sie das sogar permanent in <filename>~/.devscripts</filename> konfigurieren:
fr: Si vous utilisez <command>debuild</command> et <command>debsign</command>, vous pouvez même le configurer de façon permanente dans <filename>~/.devscripts</filename> :
ja: <command>debuild</command> と <command>debsign</command> を使う場合は、<filename>~/.devscripts</filename> に設定を決め打ちで書いても構いません:

source: DEBSIGN_KEYID=<replaceable>KEY-ID</replaceable>
de: DEBSIGN_KEYID=<replaceable>SCHLÜSSELNUMMER</replaceable>
fr: DEBSIGN_KEYID=<replaceable>identifiant_de_clef</replaceable>

source: Sponsoring an update of an existing package
de: Eine Aktualisierung eines existierenden Pakets sponsoren
fr: Parrainage de la mise à jour d'un paquet existant
ja: 既存パッケージの更新をスポンサーする

source: You will usually assume that the package has already gone through a full review. So instead of doing it again, you will carefully analyze the difference between the current version and the new version prepared by the maintainer. If you have not done the initial review yourself, you might still want to have a more deeper look just in case the initial reviewer was sloppy.
de: Sie werden normalerweise davon ausgehen, dass das Paket bereits eine vollständige Überprüfung durchlief. Daher werden Sie, anstatt dies wieder zu tun, die Unterschiede zwischen der akutellen und der neu vom Betreuer vorbereiteten Version sorgsam analysieren. Falls Sie die anfängliche Überprüfung nicht selbst durchgeführt haben, können Sie immer noch einen genaueren Blick darauf werfen, nur für den Fall, dass der erste Prüfer nachlässig war.
fr: Vous pourrez en général supposer que le paquet a déjà été vérifié complètement. Au lieu de recommencer depuis le début, vous devriez analyser précautionneusement les différences entre la version actuelle et la nouvelle version préparée par le responsable. Si vous n'avez pas fait la vérification initiale vous-même, vous pourriez tout de même regarder de plus près au cas où elle aurait été négligée.
ja: 通常、パッケージは既に全体的なレビューを受けているとします。ですので、もう一度すべてを行う代わりに、現在のバージョンとメンテナによって準備された新しいバージョンとの差分を注意深く分析することになります。最初のレビューをあなた自身が行っていない場合は、最初のレビュワーがいい加減であった場合に備えて、より子細に確認を行った方が良いかもしれません。

source: To be able to analyze the difference you need both versions. Download the current version of the source package (with <command>apt-get source</command>) and rebuild it (or download the current binary packages with <command>aptitude download</command>). Download the source package to sponsor (usually with <command>dget</command>).
de: Um in der Lage zu sein, die Unterschiede zu untersuchen, benötigen Sie beide Versionen. Laden Sie die aktuelle Version des Quellpakets herunter (mit <command>apt-get source</command>) und erstellen Sie es (oder laden Sie die aktuellen Binärpakete mit <command>aptitude download</command> herunter). Laden Sie das Quellpaket zum Sponsorn (üblicherweise mit <command>dget</command>).
fr: Afin de comparer les différences, il vous faudra les deux paquets. Téléchargez la version actuelle du paquet source (avec <command>apt-get source</command>) et reconstruisez-le (ou téléchargez les paquets binaires actuels avec <command>aptitude download</command>). Téléchargez le paquet source à parrainer (normalement avec <command>dget</command>).
ja: 差分を分析する為には両方のバージョンが必要です。ソースパッケージの現在のバージョンをダウンロードし (<command>apt-get source</command>)、リビルドします (あるいは <command>aptitude download</command> で現在のバイナリパッケージをダウンロードします)。それから、スポンサー用のソースパッケージをダウンロードします (通常、<command>dget</command> を使います)。

source: Read the new changelog entry, it should tell you what to expect during the review. The main tool you will use is <command>debdiff</command> (provide by the <systemitem role="package">devscripts</systemitem> package), you can run it with two source packages (<filename>.dsc</filename> files), or two binary packages, or two <filename>.changes</filename> files (it will then compare all the binary packages listed in the <filename>.changes</filename>).
de: Lesen Sie den Änderungsprotokolleintrag, er sollte mitteilen, was Sie während der Überprüfung erwartet. Das Hauptwerkzeug, das Sie benutzen werden, ist <command>debdiff</command> (bereitgestellt vom Paket <systemitem role="package">devscripts</systemitem>). Sie können es mit zwei Quellpaketen (<filename>.dsc</filename>-Dateien), zwei Binärpaketen oder zwei <filename>.changes</filename>-Dateien (dann wird es alle Binärpakete vergleichen, die in <filename>.changes</filename> aufgeführt sind) ausführen.
fr: Lisez la nouvelle entrée du journal de modification, elle devrait vous apprendre ce que vous devriez trouver lors de la vérification. L'outil principal à utiliser est <command>debdiff</command> (du paquet <systemitem role="package">devscripts</systemitem>), vous pouvez l'exécuter avec deux paquets source (fichiers <filename>.dsc</filename>), deux paquets binaires, ou deux fichiers <filename>.changes</filename> (seront alors comparés tous les paquets binaires présents dans le fichier <filename>.changes</filename>).
ja: まず、changelog の新しいエントリを読みます。これで、レビュー中に予期しておく事柄を知ることができます。使うことになる主なツールは <command>debdiff</command> です (<systemitem role="package">devscripts</systemitem> パッケージに含まれています)。2 つのソースパッケージ (<filename>.dsc</filename> ファイル) に対して実行するか、2 つのバイナリパッケージ、あるいは 2 つの <filename>.changes</filename> ファイルに対して実行することができます (その場合は <filename>.changes</filename> に記載されているすべてのバイナリファイルを比較します)。

source: If you compare the source packages (excluding upstream files in the case of a new upstream version, for example by filtering the output of <command>debdiff</command> with <command>filterdiff -i '*/debian/*'</command>), you must understand all the changes you see and they should be properly documented in the Debian changelog.
de: Falls Sie die Quellpakete vergleichen (ausschließlich der Originaldateien im Fall einer neuen Originalversion, zum Beispiel durch Filtern der Ausgabe von <command>debdiff</command> mit <command>filterdiff -i '*/debian/*'</command>), müssen Sie alle Änderungen verstehen und sie sollten ordentlich im Debian-Änderungsprotokoll dokumentiert sein.
fr: Si vous comparez les paquets source (à l'exception des fichiers amont dans le cas d'une nouvelle version amont, en filtrant par exemple la sortie de <command>debdiff</command> avec <command>filterdiff -i '*/debian/*'</command>), vous devez comprendre toutes les modifications et elles devraient être convenablement documentées dans le journal de modification Debian.
ja: ソースパッケージを比較した場合 (新しい開発元のバージョンの場合には、例えば <command>debdiff</command> の出力を <command>filterdiff -i '*/debian/*'</command> などとして、開発元のファイルを除外します)、確認したすべての変更点を理解して、この変更点が Debian の changelog に正しく記載されている必要があります。

source: If everything is fine, build the package and compare the binary packages to verify that the changes on the source package have no unexpected consequences (like some files dropped by mistake, missing dependencies, etc.).
de: Falls alles in Ordnung ist, erstellen Sie das Paket und vergleichen Sie die Binärpakete, um zu prüfen, ob die Änderungen am Quellpaket keine unerwarteten Folgen haben (wie einige versehentlich entfallenen Dateien, fehlende Abhängigkeiten etc.
fr: Si tout est correct, construisez le paquet et comparez les paquets binaires pour vérifier que les modifications du paquet source n'ont pas des conséquences inattendues (comme certains fichiers supprimés par erreur, des dépendances manquantes, etc.)
ja: 何も問題がなければ、パッケージをビルドし、ソースパッケージ上の変更が期待していない結果 (ミスのためファイルがなくなっている、依存関係の欠落など) をもたらしていないかを確認するため、バイナリパッケージを比較します。

source: You might want to check out the Package Tracking System (see <xref linkend="pkg-tracking-system"/>) to verify if the maintainer has not missed something important. Maybe there are translations updates sitting in the BTS that could have been integrated. Maybe the package has been NMUed and the maintainer forgot to integrate the changes from the NMU into their package. Maybe there's a release critical bug that they have left unhandled and that's blocking migration to <literal>testing</literal>. If you find something that they could have done (better), it's time to tell them so that they can improve for next time, and so that they have a better understanding of their responsibilities.
de: Sie möchten möglicherweise das Package-Tracking-System austesten (siehe <xref linkend="pkg-tracking-system"/>), um zu überprüfen, ob der Betreuer nichts Wichtiges versäumt hat. Möglicherweise gibt es Übersetzungsaktualisierungen, die im BTS liegen und hätten integriert werden können. Möglicherweise wurde ein NMU des Pakets durchgeführt und der Betreuer vergaß, die Änderungen des NMUs in sein Paket einzubauen. Vielleicht ist ein release-kritischer Fehler unbehandelt geblieben und dies blockiert die Migration nach <literal>testing</literal>. Was auch immer. Falls Sie etwas finden, was (besser) erledigt werden könnte, ist es an der Zeit ihm dies mitzuteilen, so dass er es das nächste Mal besser machen kann und dass er seine Verantwortlichkeiten besser versteht.
fr: Vous pourriez consulter le système de suivi des paquets (consultez <xref linkend="pkg-tracking-system"/>) pour vérifier que le responsable n'a rien oublié d'important. Des mises à jour de traductions pourraient attendre d'être intégrées dans le BTS. Le paquet pourrait avoir été la cible d'une NMU précédente et le responsable pourrait avoir oublié d'intégrer les modifications apportées. Un bogue critique pour la publication oublié pourrait empêcher la migration vers <literal>testing</literal>. Si vous trouvez quelque chose à améliorer, il est temps de le signaler pour que le responsable puisse s'améliorer la prochaine fois, et ainsi lui donner l'opportunité de mieux comprendre ses responsabilités.
ja: メンテナが何か重要なことを見逃していないかを確認する為に、パッケージ追跡システム (PTS、<xref linkend="pkg-tracking-system"/> 参照) を見るのが良いかもしれません。追加が可能な翻訳の更新が BTS にあるかもしれません。パッケージが NMU されていて、メンテナが NMU での変更をパッケージへ取り入れるのを忘れているかもしれません。リリースクリティカルバグがあって、メンテナが放置しているために<literal>テスト版 (testing)</literal> への移行が阻まれているかもしれません。メンテナが何か (より良く) できることを見つけたら、それを伝えましょう。次回に改善ができますし、メンテナは責務についてより深く理解することになります。

source: If you have found no major problem, upload the new version. Otherwise ask the maintainer to provide you a fixed version.
de: Falls Sie kein bedeutendes Problem gefunden haben, laden Sie die neue Version hoch. Andernfalls bitten Sie den Betreuer, Ihnen eine reparierte Version zur Verfügung zu stellen.
fr: Si vous n'avez pas trouvé de problème majeur, envoyez la nouvelle version. Sinon, demandez au responsable de fournir une version corrigée.
ja: 何も大きな問題を見つけなければ、新しいバージョンをアップロードします。そうでなければ、メンテナに修正したバージョンをアップロードするよう要請します。

source: Advocating new developers
de: Neue Entwickler befürworten
fr: Recommandation d'un nouveau développeur
ja: 新たな開発者を支持する (advocate)

source: See the page about <ulink url="&url-newmaint-advocate;">advocating a prospective developer</ulink> at the Debian web site.
de: Lesen Sie die Seite <ulink url="&url-newmaint-advocate;">Einen zukünftigen Entwickler befürworten</ulink> auf der Debian-Website.
fr: Les <ulink url="&url-newmaint-advocate;">recommandations pour un futur développeur</ulink> sont disponibles sur le site web de Debian.
ja: Debian ウェブサイトの<ulink url="&url-newmaint-advocate;">開発者志願者の支持者になる (advocating a prospective developer)</ulink>のページを参照してください。

source: Handling new maintainer applications
de: Handhabung von Bewerbungen neuer Betreuer
fr: Gestion des nouvelles candidatures
ja: 新規メンテナ申請 (new maintainer applications) を取り扱う

source: Please see <ulink url="&url-newmaint-amchecklist;">Checklist for Application Managers</ulink> at the Debian web site.
de: Lesen Sie bitte die <ulink url="&url-newmaint-amchecklist;">Checkliste für Bewerbungsleiter</ulink> auf der Debian-Website.
fr: La <ulink url="&url-newmaint-amchecklist;">liste de contrôle pour les responsables de candidature</ulink> est disponible sur le site web de Debian.
ja: Debian のウェブサイトにある <ulink url="&url-newmaint-amchecklist;">申請管理者用チェックリスト (Checklist for Application Managers)</ulink> を参照してください。

source: Debian Developer's Duties
de: Pflichten von Debian-Entwicklern
fr: Devoirs du développeur Debian
ja: Debian 開発者の責務

source: Package Maintainer's Duties
de: Pflichten von Paketbetreuern
fr: Devoirs du responsable de paquet
ja: パッケージメンテナの責務

source: As a package maintainer, you're supposed to provide high-quality packages that are well integrated in the system and that adhere to the Debian Policy.
de: Als Paketbetreuer sollen Sie Pakete hoher Qualität bereitstellen, die gut in das System integriert sind und die den Debian-Richtlinien folgen.
fr: En tant que responsable de paquet, vous êtes censé fournir des paquets de haute qualité qui s'intégreront correctement dans le système et qui sont conformes à la Charte Debian.
ja: あなたはパッケージメンテナとして、システムにうまく適合し、Debian ポリシーにしっかり則っている高品質のパッケージを提供していることでしょう。

source: Work towards the next <literal>stable</literal> release
de: Auf die nächste <literal>stable</literal>-Veröffentlichung hinarbeiten
fr: Œuvrer pour la prochaine publication <literal>stable</literal>
ja: 次期<literal>安定版 (stable)</literal> リリースへの作業

source: Providing high-quality packages in <literal>unstable</literal> is not enough, most users will only benefit from your packages when they are released as part of the next <literal>stable</literal> release. You are thus expected to collaborate with the release team to ensure your packages get included.
de: Es reicht nicht aus, Pakete hoher Qualität in <literal>unstable</literal> bereitzustellen, die meisten Anwender werden nur von Ihren Paketen profitieren, wenn Sie Teil der nächsten <literal>stable</literal>-Veröffentlichung sind. Es wird daher von Ihnen erwartet, dass Sie mit dem Release-Team zusammenarbeiten, um sicherzustellen, dass Ihre Pakete dort berücksichtigt werden.
fr: Fournir des paquets de haute qualité dans <literal>unstable</literal> ne suffit pas, la plupart des utilisateurs ne profiteront de vos paquets que quand ils seront publiés avec la prochaine version <literal>stable</literal>. Vous êtes donc censé collaborer avec l'équipe en charge de la publication pour veiller à ce que vos paquets soient intégrés.
ja: 高品質のパッケージを<literal>不安定版 (unstable)</literal> へ提供するだけでは十分ではありません。多くのユーザは、パッケージが次期<literal>安定版 (stable)</literal> の一部としてリリースされた時にのみ、その恩恵を受けるからです。ですから、パッケージが次期の<literal>安定版 (stable)</literal> に含まれるようにリリースチームと上手く共同で作業することが期待されています。

source: More concretely, you should monitor whether your packages are migrating to <literal>testing</literal> (see <xref linkend="testing"/>). When the migration doesn't happen after the test period, you should analyze why and work towards fixing this. It might mean fixing your package (in the case of release-critical bugs or failures to build on some architecture) but it can also mean updating (or fixing, or removing from <literal>testing</literal>) other packages to help complete a transition in which your package is entangled due to its dependencies. The release team might provide you some input on the current blockers of a given transition if you are not able to identify them.
de: Konkreter ausgedrückt, sollten Sie überwachen, ob Ihre Pakete nach <literal>testing</literal> (siehe <xref linkend="testing"/>) wandern. Wenn die Migration nicht nach der Testperiode stattfindet, sollten Sie analysieren, warum und darauf hinarbeiten, dies zu beheben. Es könnte heißen, das Sie Ihr Paket reparieren müssen (im Fall release-kritischer Fehler oder wenn das Bauen auf einigen Architekturen fehlschlägt), aber es kann auch heißen, dass andere Pakete aktualisiert (oder repariert oder aus <literal>testing</literal> entfernt) werden müssen, um bei einem Übergang zu helfen, in den Ihr Paket aufgrund von Abhängigkeiten verstrickt ist. Das Release-Team könnte Ihnen einige Informationen liefern, was derzeit einen gegebenen Übergang blockiert, falls Sie das nicht erkennen können.
fr: Plus concrètement, vous devriez surveiller si vos paquets migrent vers <literal>testing</literal> (consultez <xref linkend="testing"/>). Lorsque la migration n'a pas lieu après la période d'essai, vous devriez analyser pourquoi et œuvrer pour corriger cela. Votre paquet pourrait avoir besoin d'être corrigé (dans le cas de bogues critiques pour la publication ou d'échecs de construction sur certaines architectures) mais cela peut également signifier mettre à jour (ou corriger, ou supprimer de <literal>testing</literal>) d'autres paquets pour permettre de terminer une transition dans laquelle votre paquet est enchevêtré à cause de ses dépendances. L'équipe en charge de la publication devrait pouvoir vous renseigner sur ce qui bloque actuellement une transition donnée si vous ne parvenez pas à l'identifier.
ja: より具体的には、パッケージが<literal>テスト版 (testing)</literal> に移行しているかどうかを見守る必要があります (<xref linkend="testing"/> 参照) 。テスト期間後に移行が行われない場合は、その理由を分析してこれを修正する必要があります。(リリースクリティカルバグや、いくつかのアーキテクチャでビルドに失敗する場合) あなたのパッケージを修正するのが必要な場合もありますし、依存関係でパッケージが絡まっている状態からの移行を完了する手助けとして、他のパッケージを更新 (あるいは修正、または<literal>テスト版 (testing)</literal> からの削除) が必要な事を意味する場合もあります。障害となる理由 (blocker) を判別できない場合は、リリースチームが先の移行に関する現在の障害に関する情報を与えてくれることでしょう。

source: Maintain packages in <literal>stable</literal>
de: Pakete in <literal>stable</literal> betreuen
fr: Maintenance de paquets dans <literal>stable</literal>
ja: <literal>安定版 (stable)</literal> にあるパッケージをメンテナンスする

source: Most of the package maintainer's work goes into providing updated versions of packages in <literal>unstable</literal>, but their job also entails taking care of the packages in the current <literal>stable</literal> release.
de: Die meiste Arbeit von Paketbetreuern geht in das Bereitstellen aktualisierter Paketversionen in <literal>unstable</literal>, aber ihre Aufgabe bedingt auch, sich um Pakete in der aktuellen Veröffentlichung von <literal>stable</literal> zu kümmern.
fr: La plupart du travail de responsable de paquet consiste à fournir des versions de paquets mis à jour dans <literal>unstable</literal>, mais son travail implique aussi de s'occuper des paquets dans la publication <literal>stable</literal> actuelle.
ja: パッケージメンテナの作業の大半は、パッケージの更新されたバージョンを<literal>不安定版 (unstable)</literal> へ放り込むことですが、現状の<literal>安定版 (stable)</literal> リリースのパッケージの面倒をみることも伴っています。
