Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: The following paragraphs should answer the following questions: Why do I as a user need this package? What other features does the package have? What outstanding features and deficiencies are there compared to other packages (e.g., if you need X, use Y instead)? Is this package related to other packages in some way that is not handled by the package manager (e.g., this is the client for the foo server)?
de: Die folgenden Absätze sollten die folgenden Fragen beantworten: Warum benötige ich als Benutzer dieses Paket? Welche anderen Funktionen bietet das Paket? Welche herausragenden Funktionen und Mängel gibt es im Vergleich zu anderen Paketen (z.B. falls Sie X benötigen, benutzen Sie Y)? Steht das Paket in einem Zusammenhang mit anderen Paketen, die nicht vom Paketmanager gehandhabt werden (z.B. ist dies der Client für den Foo-Server)?
fr: Les paragraphes suivants devraient répondre aux questions : « Pourquoi, en tant qu'utilisateur, ai-je besoin de ce paquet ? », « Quelles autres fonctionnalités ce paquet apporte-t-il ? », « Quelles fonctionnalités et défauts comporte-t-il par rapport à d'autres paquets (par exemple, « si vous avez besoin de X, utilisez plutôt Y ») ? », « Ce paquet est-il lié à d'autres paquets d'une manière non gérée par le système de gestion des paquets (par exemple, « ceci est le client destiné au serveur toto ») ? ».
ja: 続く段落は以下の質問に答える必要があります: 何故私はユーザーとしてこのパッケージを必要とするの? パッケージは他にどんな機能を持っているの? 他のパッケージと比べて、どんな特別な機能や不足している部分があるがあるの? (例: X が必要な場合、代わりに Y を使いましょう) このパッケージはパッケージマネージャーで管理していない、何らかの方法で他のパッケージに関連している? (例: これは foo サーバのクライアントです)

source: Be careful to avoid spelling and grammar mistakes. Ensure that you spell-check it. Both <command>ispell</command> and <command>aspell</command> have special modes for checking <filename>debian/control</filename> files:
de: Seien Sie vorsichtig, um Rechtschreib- und Grammatikfehler zu vermeiden. Sorgen Sie für eine Rechtschreibprüfung. Sowohl <command>ispell</command> als auch <command>aspell</command> haben spezielle Modi zur Prüfung von <filename>debian/control</filename>-Dateien:
fr: Veillez à éviter les erreurs d'orthographe et de grammaire. Vérifiez l'orthographe avec un outil adapté. Les deux programmes <command>ispell</command> et <command>aspell</command> comportent un mode spécial permettant de contrôler un fichier <filename>debian/control</filename> files :
ja: スペルミスや文法の間違いを避けるよう、注意してください。スペルチェックを確実に行ってください。<command>ispell</command> と <command>aspell</command> の双方に、<filename>debian/control</filename> ファイルをチェックするための特別なモードがあります:

source: Users usually expect these questions to be answered in the package description:
de: Anwender erwarten normalerweise, dass diese Fragen in der Paketbeschreibung beantwortet werden:
fr: Les utilisateurs attendent en général des descriptions de paquets les réponses aux questions suivantes.
ja: 通常、ユーザは以下のような疑問がパッケージ説明文で答えられることを期待しています:

source: What does the package do? If it is an add-on to another package, then the short description of the package we are an add-on to should be put in here.
de: Was tut das Paket? Falls es eine Erweiterung eines anderen Pakets ist, dann sollte eines Kurzbeschreibung des Pakets, das es erweitert, hier eingefügt werden.
fr: Que fait ce paquet ? S'il s'agit d'un additif à un autre paquet, la description de cet autre paquet doit y être reprise.
ja: パッケージは何をするの? 他のパッケージのアドオンだった場合、パッケージがアドオンであるということを概要文に書く必要があります。

source: Why should I want this package? This is related to the above, but not the same (this is a mail user agent; this is cool, fast, interfaces with PGP and LDAP and IMAP, has features X, Y, and Z).
de: Warum sollte ich dieses Paket wollen? Dies bezieht sich auf das vorhergehende, aber nicht das gleiche (dies ist ein Mail-Client. Er ist toll, schnell, hat Schnittstellen zu PGP, LDAP und IMAP, hat die Funktionen X, Y und Z).
fr: Pourquoi ai-je besoin de ce paquet ? Cela est lié à la remarque précédente, de manière différente (ceci est un agent utilisateur pour le courrier électronique, avec une interface rapide et pratique vers PGP, LDAP et IMAP et les fonctionnalités X, Y ou Z).
ja: なぜこのパッケージを使うべきなの? これは上記に関連しますが、同じではありません (これはメールユーザーエージェントです; クールで速く、PGP や LDAP や IMAP のインターフェイスがあり、X や Y や Z の機能があります)。

source: If this package should not be installed directly, but is pulled in by another package, this should be mentioned.
de: Falls dieses Paket nicht direkt installiert werden sollte, sondern von einem anderen Paket mitinstalliert wird, sollte die erwähnt werden.
fr: Si ce paquet ne doit pas être installé seul, mais est installé par un autre paquet, cela devrait être mentionné.
ja: パッケージが直接インストールされるべきではないが、他のパッケージから引っ張ってこられる時には、付記しておく必要があります。

source: If the package is <literal>experimental</literal>, or there are other reasons it should not be used, if there are other packages that should be used instead, it should be here as well.
de: Falls das Paket <literal>experimental</literal> ist oder es andere Gründe gibt, weshalb es nicht benutzt werden sollte und wenn es andere Pakete gibt, die stattdessen benutzt werden sollen, sollte dies auch hier stehen.
fr: Si le paquet est <literal>expérimental</literal> ou ne doit pas être utilisé pour toute autre raison et que d'autres paquets doivent être utilisés à la place, cela doit également être mentionné.
ja: パッケージが<literal>実験的</literal>である、あるいは使われない方が良い他の理由がある場合、同様にここに記載する必要があります。

source: How is this package different from the competition? Is it a better implementation? more features? different features? Why should I choose this package.
de: Was unterscheidet dieses Paket von der Konkurrenz? Ist es eine bessere Implementierung? Mehr Funktionen? Andere Funktionen? Warum sollte die Wahl auf dieses Paket fallen?
fr: En quoi ce paquet diffère-t-il de ses concurrents ? Est-il une meilleure implémentation ? A-t-il plus de fonctionnalités ? Des fonctionnalités différentes ? Pourquoi devrais-je choisir ce paquet ?
ja: パッケージは競合のものと比べてどうでしょうか? より良い実装なのでしょうか? 機能がより豊富なのでしょうか? 違った機能があるのでしょうか? このパッケージを選ぶ理由は何でしょう。

source: Upstream home page
de: Homepage der Originalautoren
fr: Page d'accueil amont
ja: 開発元のホームページ

source: We recommend that you add the URL for the package's home page in the <literal>Homepage</literal> field of the <literal>Source</literal> section in <filename>debian/control</filename>. Adding this information in the package description itself is considered deprecated.
de: Es wird empfohlen, dass Sie die URL der Homepage des Pakets in das Feld <literal>Homepage</literal> im Abschnitt <literal>Source</literal> von <filename>debian/control</filename> hinzufügen. Diese Information in die Paketbeschreibung selbst einzutragen, wird als missbilligt angesehen.
fr: Il est recommandé d'ajouter l'URL d'accès à la page d'accueil du paquet dans le champ <literal>Homepage</literal> de la section <literal>Source</literal> du fichier <filename>debian/control</filename>. L'ajout de cette information à la description même du paquet est une pratique considérée obsolète.
ja: <filename>debian/control</filename> 中の <literal>Source</literal> セクションの <literal>Homepage</literal> フィールドへ、パッケージのホームページの URL を追加することをお勧めします。この情報をパッケージ説明文自身に追加するのは推奨されない (deprecated) であると考えられています。

source: Version Control System location
de: Ort des Versionsverwaltungssystems
fr: Emplacement du système de gestion de versions
ja: バージョン管理システムの場所

source: There are additional fields for the location of the Version Control System in <filename>debian/control</filename>.
de: Es gibt zusätzliche Felder für den Ort des Versionsverwaltungssystems in <filename>debian/control</filename>.
fr: Des champs supplémentaires permettent d'indiquer l'emplacement du système de gestion de versions dans <filename>debian/control</filename>.
ja: <filename>debian/control</filename> には、バージョン管理システムの場所についての追加フィールドがあります。

source: Value of this field should be a <literal>http://</literal> URL pointing to a web-browsable copy of the Version Control System repository used to maintain the given package, if available.
de: Der Wert dieses Feldes sollte eine <literal>http://</literal>-URL sein, die auf eine via Web durchstöberbare Kopie des Versionsverwaltungssystems-Depots verweist, das benutzt wird, um das angegebene Paket zu verwalten, falls verfügbar.
fr: La valeur de ce champ doit être une URL <literal>http://</literal> pointant sur la copie navigable par le web du dépôt de gestion de versions utilisé pour la maintenance du paquet, s'il est disponible.
ja: このフィールドの値は、指定したパッケージのメンテナンスに使われているバージョン管理システムのリポジトリのコピーがもしあれば、それを指し示す <literal>http://</literal> URL である必要があります。

source: The information is meant to be useful for the final user, willing to browse the latest work done on the package (e.g. when looking for the patch fixing a bug tagged as <literal>pending</literal> in the bug tracking system).
de: Die Information ist dazu gedacht, dem Endanwender zu nutzen, der gewillt ist, die letzte am Paket geleistete Arbeit zu durchstöbern (z.B. wenn nach einem Patch gesucht wird, der einen Fehler behebt, der in der Fehlerdatenbank als <literal>pending</literal> gekennzeichnet ist).
fr: Cette information est destinée à l'utilisateur final qui voudrait parcourir le travail en cours sur le paquet (par exemple à la recherche d'un correctif qui corrige un bogue marqué <literal>pending</literal> (en attente) dans le système de suivi des bogues.
ja: この情報は、パッケージに行われた最新の作業を閲覧したいエンドユーザにとって有用であるのが目的です (例: バグ追跡システムで <literal>pending</literal> とタグがつけられているバグを修正するパッチを探している場合)。

source: Value of this field should be a string identifying unequivocally the location of the Version Control System repository used to maintain the given package, if available. <literal>*</literal> identify the Version Control System; currently the following systems are supported by the package tracking system: <literal>arch</literal>, <literal>bzr</literal> (Bazaar), <literal>cvs</literal>, <literal>darcs</literal>, <literal>git</literal>, <literal>hg</literal> (Mercurial), <literal>mtn</literal> (Monotone), <literal>svn</literal> (Subversion). It is allowed to specify different VCS fields for the same package: they will all be shown in the PTS web interface.
de: Der Wert dieses Feldes sollte eine Zeichenkette sein, die den Ort des Versionsverwaltungssystem-Depots eindeutig identifiziert, das zur Verwaltung des angegebenen Pakets benutzt wird, falls verfügbar. <literal>*</literal> identifiziert das Versionsverwaltungssystem. Aktuell werden die folgenden vom Paketverfolgungssystem unterstützt: <literal>arch</literal>, <literal>bzr</literal> (Bazaar), <literal>cvs</literal>, <literal>darcs</literal>, <literal>git</literal>, <literal>hg</literal> (Mercurial), <literal>mtn</literal> (Monotone) und <literal>svn</literal> (Subversion). Es ist erlaubt, mehrere unterschiedliche Versionsverwaltungssystem-Felder für das gleiche Paket anzugeben: Sie werden alle auf der PTS-Web-Schnittstelle angezeigt.
fr: La valeur de ce champ doit être une chaîne identifiant sans équivoque l'emplacement du dépôt de gestion de versions utilisé pour la maintenance de ce paquet, s'il est disponible. <literal>*</literal> doit être remplacé par le système de gestion de versions. Les systèmes suivants sont actuellement gérés par le système de suivi des paquets : <literal>arch</literal>, <literal>bzr</literal> (Bazaar), <literal>cvs</literal>, <literal>darcs</literal>, <literal>git</literal>, <literal>hg</literal> (Mercurial), <literal>mtn</literal> (Monotone), <literal>svn</literal> (Subversion). Il est possible d'indiquer plusieurs champs VCS pour le même paquet : ils seront alors tous mentionnés dans l'interface web du système de suivi des paquets.
ja: このフィールドの値は、もし利用可能でなのであれば、指定されたパッケージをメンテナンスするのに使われているバージョン管理システムの位置を明確に識別できる文字列である必要があります。<literal>*</literal> はバージョン管理システムの識別に使われます; 現在では、以下のシステムがパッケージ追跡システムによってサポートされています: <literal>arch</literal>、<literal>bzr</literal> (Bazaar)、<literal>cvs</literal>、<literal>darcs</literal>、<literal>git</literal>、<literal>hg</literal> (Mercurial)、<literal>mtn</literal> (Monotone)、<literal>svn</literal> (Subversion)。同じパッケージについて異なった VCS を指定することも可能です: これらはすべて PTS のウェブインターフェイスに表示されます。

source: The information is meant to be useful for a user knowledgeable in the given Version Control System and willing to build the current version of a package from the VCS sources. Other uses of this information might include automatic building of the latest VCS version of the given package. To this end the location pointed to by the field should better be version agnostic and point to the main branch (for VCSs supporting such a concept). Also, the location pointed to should be accessible to the final user; fulfilling this requirement might imply pointing to an anonymous access of the repository instead of pointing to an SSH-accessible version of the same.
de: Die Information ist für Benutzer bestimmt, die im gegebenen Versionsverwaltungssystem sachkundig sind und bereit, die aktuelle Version des Pakets aus den VCS-Quellen zu erstellen. Andere Nutzungen dieser Information könnten das automatische Erstellen der letzen VCS-Version des Pakets umfassen. Dazu sollte der vom Feld angegebene Ort, die Version nicht kennen und auf den Hauptzweig zeigen (bei Versionsverwaltungssystemen, die dieses Konzept unterstützen). Außerdem sollte der Endanwender auf den Ort, auf den verwiesen wird, zugreifen können. Die Erfüllung dieser Anforderungen könnte einen anonymen Zugriff voraussetzen, statt auf eine Version davon zu verweisen, auf die über SSH zugegriffen wird.
fr: Cette information est destinée aux utilisateurs qui ont une connaissance suffisante du système de gestion de versions et qui veulent construire une version à jour du paquet depuis les sources du système de suivi. Une autre utilisation possible de cette information pourrait être la construction automatique de la dernière version, dans le système de suivi, d'un paquet donné. À cet effet, l'emplacement pointé devrait éviter d'être lié à une version spécifique et pointer vers la branche principale de développement (pour les systèmes qui ont un tel concept). De plus, l'emplacement indiqué doit être accessible à l'utilisateur final, par exemple en indiquant une adresse d'accès anonyme au dépôt, plutôt qu'une version accessible par SSH.
ja: この情報は、そのバージョン管理システムについて知識があり、VCS ソースから現在のバージョンパッケージを生成ユーザにとって有益であるよう意図されています。この情報の他の使い方としては、指定されたパッケージの最新の VCS バージョンを自動ビルドするなどがあるかもしれません。このため、フィールドによって指し示される場所は、バージョンに関係なく、(そのようなコンセプトをサポートしている VCS であれば) メインブランチを指すのが良いでしょう。また、指し示される場所は一般ユーザがアクセス可能である必要があります; この要求を満たすには SSH アクセス可能なリポジトリを指すのではなく、匿名アクセスが可能なリポジトリを指すようにすることを意味します。

source: In the following example, an instance of the field for a Subversion repository of the <systemitem role="package">vim</systemitem> package is shown. Note how the URL is in the <literal>svn://</literal> scheme (instead of <literal>svn+ssh://</literal>) and how it points to the <filename>trunk/</filename> branch. The use of the <literal>Vcs-Browser</literal> and <literal>Homepage</literal> fields described above is also shown.
de: Im folgenden Beispiel wird ein Fall von einem Feld eines Subversions-Depots des Pakets <systemitem role="package">vim</systemitem> gezeigt. Beachten Sie, wie die URL im <literal>svn://</literal>-Schema aufgebaut ist (im Gegensatz zu <literal>svn+ssh://</literal>) und wie sie auf den Zweig <filename>trunk/</filename> zeigt. Außerdem wird die Benutzung der Felder <literal>Vcs-Browser</literal> und <literal>Homepage</literal>, wie oben beschrieben, ebenfalls gezeigt.
fr: L'exemple qui suit montre une instance de ce champ pour un dépôt Subversion du paquet <systemitem role="package">vim</systemitem>. Veuillez noter que l'URL a la forme <literal>svn://</literal> (au lieu de <literal>svn+ssh://</literal>) et pointe sur la branche <filename>trunk/</filename>. Une utilisation des champs <literal>Vcs-Browser</literal> et <literal>Homepage</literal>, décrits précédemment, est aussi indiquée.
ja: 以下の例では、<systemitem role="package">vim</systemitem> パッケージの Subversion リポジトリに対するフィールドの例が挙げられています。(<literal>svn+ssh://</literal> ではなく) <literal>svn://</literal> スキーム中で URL がどのようになっているか、<filename>trunk/</filename> ブランチをどのように指し示しているかに注意してください。上で挙げられた <literal>Vcs-Browser</literal> フィールドと <literal>Homepage</literal> フィールドの使い方も出ています。

source: Best practices for <filename>debian/changelog</filename>
de: Optimale Vorgehensweisen für <filename>debian/changelog</filename>
fr: Meilleures pratiques pour <filename>debian/changelog</filename>
ja: <filename>debian/changelog</filename> のベストプラクティス

source: The following practices supplement the <ulink url="&url-debian-policy;ch-docs.html#s-changelogs">Policy on changelog files</ulink>.
de: Die folgenden Vorgehensweisen ergänzen die <ulink url="&url-debian-policy;ch-docs.html#s-changelogs">Richtlinien für Änderungsprotokolldateien</ulink>.
fr: Les indications de cette partie complètent la <ulink url="&url-debian-policy;ch-docs.html#s-changelogs">Charte Debian pour ce qui concerne les fichiers de journaux des modifications (« <filename>changelog</filename> »)</ulink>.
ja: 以下のプラクティスは <ulink url="&url-debian-policy;ch-docs.html#s-changelogs">changelog ファイルに対するポリシー</ulink>を補完します。

source: Writing useful changelog entries
de: Verfassen nützlicher Änderungsprotokolleinträge
fr: Entrées de journalisation utiles
ja: 役立つ changelog のエントリを書く

source: The changelog entry for a package revision documents changes in that revision, and only them. Concentrate on describing significant and user-visible changes that were made since the last version.
de: Der Änderungsprotokolleintrag einer Paketüberarbeitung dokumentiert Änderungen in nur dieser Überarbeitung. Der Schwerpunkt liegt auf der Beschreibung bedeutender und für den Anwender sichtbarer Änderungen, die seit der letzten Version vorgenommen wurden.
fr: Le journal des modifications (« <filename>changelog</filename> ») présente uniquement les changements intervenus dans la version courante. Il est suggéré de mettre l'accent sur les modifications visibles ou affectant potentiellement les utilisateurs, réalisées depuis la version précédente.
ja: パッケージリビジョンに対する changelog エントリは、そのリビジョンでの変更それだけを記載します。最後のバージョンから行われた、重要な、そしてユーザに見える形の変更を記述することに集中しましょう。

source: Focus on <emphasis>what</emphasis> was changed — who, how and when are usually less important. Having said that, remember to politely attribute people who have provided notable help in making the package (e.g., those who have sent in patches).
de: Der Fokus liegt darauf, <emphasis>was</emphasis> geändert wurde – wer, wie und wann ist normalerweise nicht so wichtig. Erinnern Sie gleichwohl höflich an die Leute, die merklich Hilfe beim Erstellen des Pakets geleistet haben (die z.B. Patchs gesandt haben).
fr: Il est conseillé de mettre l'accent sur <emphasis>ce</emphasis> qui a été modifié, plutôt que comment, par qui et quand elle a été réalisée. Cela dit, il est conseillé, par courtoisie, d'indiquer les auteurs qui ont apporté une aide significative à la maintenance du paquet (par exemple lorsque ces personnes ont envoyé des correctifs).
ja: <emphasis>何が</emphasis>変更されたかについて集中しましょう — 誰が、どうやって、何時なのか通常あまり重要ではありません。そうは言っても、パッケージ作成について明記すべき手助けをしてくれた人々 (例えば、パッチを送ってくれた人) を丁寧に明記するのを忘れないようにしましょう。

source: There's no need to elaborate the trivial and obvious changes. You can also aggregate several changes in one entry. On the other hand, don't be overly terse if you have undertaken a major change. Be especially clear if there are changes that affect the behaviour of the program. For further explanations, use the <filename>README.Debian</filename> file.
de: Es ist nicht nötig, die belanglosen und offensichtlichen Änderungen näher auszuführen. Sie können außerdem mehrere Änderungen in einem Eintrag zusammenfassen. Fassen Sie sich andererseits nicht zu kurz, falls Sie eine größere Änderung vorgenommen haben. Stellen Sie insbesondere klar, falls es Änderungen gibt, die das Verhalten des Programms ändern. Benutzen Sie für weitere Erklärungen die Datei <filename>README.Debian</filename>.
fr: Il n'est pas indispensable d'indiquer les détails des modifications triviales. Il est également possible de grouper plusieurs modifications sur une même entrée. Cependant, évitez une documentation trop concise pour les modifications majeures. Il est particulièrement conseillé d'être très clair sur les modifications qui affectent le comportement du programme. Pour des explications plus détaillées, vous pouvez aussi utiliser le fichier <filename>README.Debian</filename>.
ja: 些細で明白な変更を詳細に書く必要はありません。複数の変更点を一つのエントリにまとめることもできます。逆に言えば、大きな変更をした場合には、あまりに簡潔にしすぎないようにしましょう。プログラムの動作に影響を与える変更がある場合には、特に確認しておきましょう。詳細な説明については、<filename>README.Debian</filename> ファイルを使ってください。

source: Use common English so that the majority of readers can comprehend it. Avoid abbreviations, tech-speak and jargon when explaining changes that close bugs, especially for bugs filed by users that did not strike you as particularly technically savvy. Be polite, don't swear.
de: Benutzen Sie geläufiges Englisch, so dass die Mehrheit der Leser es begreifen kann. Vermeiden Sie Abkürzungen, technische Begriffe und Fachsprache, wenn Sie Änderungen erklären, die Fehlerberichte schließen, insbesondere bei Fehlern, die von Anwendern eingereicht wurden, die Ihnen als technisch unerfahren aufgefallen sind. Seien Sie höflich, fluchen Sie nicht.
fr: Utilisez un anglais simple que la majorité des lecteurs puissent comprendre. Évitez les abréviations et le jargon technique lorsque des modifications permettent la clôture de bogues. Cela est vrai notamment quand vous pensez que les utilisateurs qui les ont envoyés n'ont pas de connaissances techniques importantes. Une formulation polie est à préférer et la vulgarité à prohiber.
ja: 平易な英語を使いましょう。そうすれば読者の大半が理解できます。バグをクローズする変更を説明する際には略語や、テクニカルな言い方やジャーゴンを避けましょう。特に、技術的に精通していないと思われるユーザによって登録されたバグを閉じる際には気をつけましょう。礼儀正しく、断言をしないように。

source: It is sometimes desirable to prefix changelog entries with the names of the files that were changed. However, there's no need to explicitly list each and every last one of the changed files, especially if the change was small or repetitive. You may use wildcards.
de: Manchmal ist es wünschenswert, den Änderungsprotokolleinträgen die Namen der Dateien voranzustellen, die geändert wurden. Es ist jedoch nicht nötig, explizit jede einzelne geänderte Datei aufzuführen, insbesondere dann nicht, wenn die Änderung klein oder wiederholend war. Sie können Platzhalter verwenden.
fr: Il est parfois souhaitable de faire précéder les entrées du journal des modifications par les noms des fichiers modifiés. Cependant, rien n'oblige à mentionner le moindre fichier modifié, notamment si la modification est simple ou répétitive. L'utilisation de caractères joker est possible.
ja: 時折、changelog エントリに変更したファイルの名前を頭に付けたくなることがあります。ですが、個々のすべての変更したファイルを一覧にする必要性はありません。特に変更点が小さくて繰り返される場合です。ワイルドカードを使いましょう。

source: When referring to bugs, don't assume anything. Say what the problem was, how it was fixed, and append the closes: #nnnnn string. See <xref linkend="upload-bugfix"/> for more information.
de: Treffen Sie keine Annahmen, wenn Sie sich auf Fehler beziehen. Sagen Sie, welches Problem vorlag, wie es behoben wurde und hängen Sie die Zeichenkette »closes: #nnnnn« an. Weitere Informatioenn erhalten Sie unter <xref linkend="upload-bugfix"/>.
fr: Ne faites pas de suppositions lorsque vous faites référence à un bogue. Indiquez quel était le problème, comment il a été corrigé et ajoutez la chaîne closes: #nnnnn. Veuillez consulter <xref linkend="upload-bugfix"/> pour plus d'informations.
ja: バグに触れる際には、何も仮定しないようにしましょう。何が問題だったのか、どうやってそれが直されたのかについて言い、closes: #nnnnn の文字列を追加しましょう。詳細については <xref linkend="upload-bugfix"/> を参照してください。

source: Common misconceptions about changelog entries
de: Häufige Missverständnisse über Änderungsprotokolleinträge
fr: Idées reçues sur les entrées de journalisation
ja: changelog のエントリに関するよくある誤解
