Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: I18N &amp; L10N FAQ for translators
de: I18n- &amp; L10n-FAQ für Übersetzer
fr: FAQ I18N et L10N pour les traducteurs
ja: 翻訳者への I18N &amp; L10N FAQ

source: While reading this, please keep in mind that there is no general procedure within Debian concerning these points, and that in any case, you should collaborate with your team and the package maintainer.
de: Behalten Sie während Sie dies lesen im Hinterkopf, dass es über diese Punkte innerhalb Debian keine Einigkeit gibt und dass Sie auf jeden Fall mit Ihrem Team und dem Paketbetreuer zusammenarbeiten sollten.
fr: Lorsque vous lirez cela, gardez à l'esprit qu'il n'y a pas de procédure générale dans Debian concernant ces points et que, dans tous les cas, vous devriez collaborer avec votre équipe et les responsables des paquets.
ja: これを読み進める間、Debian においてこれらの点に関する一般的な手続きは存在していないこと、そしていかなる場合でもチームやパッケージメンテナと協調して作業する必要があることを念頭においてください。

source: How to help the translation effort
de: Wie bei Übersetzungsbemühungen geholfen wird
fr: Comment aider l'effort de traduction
ja: どの様にして翻訳作業を支援するか

source: Choose what you want to translate, make sure that nobody is already working on it (using your debian-l10n-XXX mailing list), translate it, get it reviewed by other native speakers on your l10n mailing list, and provide it to the maintainer of the package (see next point).
de: Wählen Sie aus, was Sie übersetzen möchten und stellen Sie sicher, dass nicht bereits jemand daran arbeitet (benutzen Sie Ihre debian-l10n-XXX-Mailingliste), übersetzen Sie es, lassen Sie es durch andere mit dieser Muttersprache auf Ihrer L10n-Mailingliste überprüfen und stellen Sie es dem Paketbetreuer zur Verfügung (siehe nächsten Punkt).
fr: Choisissez ce que vous désirez traduire, assurez-vous que personne ne travaille déjà dessus (en utilisant votre liste de diffusion debian-l10n-XXX), traduisez-le, faites-le relire par d'autres personnes dont c'est également la langue maternelle sur votre liste de diffusion l10n et fournissez-le au responsable du paquet (voir le point suivant).
ja: 翻訳したい文章を選び、誰もまだ作業をしていないことを確認し (debian-l10n-XXX メーリングリストを参照。日本語の場合は debian-doc@debian.or.jp を参照してください)、翻訳し、l10n メーリングリストで他のネイティブスピーカーにレビューをしてもらい、パッケージメンテナに提供します (次の段を参照)。

source: How to provide a translation for inclusion in a package
de: Wie eine Übersetzung zur Eingliederung in ein Paket bereitgestellt wird
fr: Comment fournir une traduction pour inclusion dans un paquet
ja: どの様にして提供した翻訳をパッケージに含めてもらうか

source: Make sure your translation is correct (asking for review on your l10n mailing list) before providing it for inclusion. It will save time for everyone, and avoid the chaos resulting in having several versions of the same document in bug reports.
de: Stellen Sie sicher, dass Ihre Übersetzung korrekt ist (bitten Sie auf Ihrer L10n-Mailingliste um eine Überprüfung), bevor Sie sie zur Eingliederung bereitgestellen. Es wird für jeden eine Zeitersparnis sein und das Chaos vermeiden, das daraus resultiert, dass Sie mehrere Versionen des gleichen Dokuments in Fehlerberichten haben.
fr: Assurez-vous que votre traduction est correcte (en demandant une relecture sur votre liste de discussion l10n) avant de la fournir pour inclusion. Cela fera gagner du temps à tout le monde et évitera le chaos qui résulterait d'avoir plusieurs versions du même document dans les rapports de bogue.
ja: 含めてもらう翻訳が正しいかどうかを提供する前に確認してください (l10n メーリングリストでレビューを依頼しましょう)。皆の時間を節約し、バグレポートに複数バージョンの同じ文章があるというカオス状態を避けることになります。

source: The best solution is to file a regular bug containing the translation against the package. Make sure to use the 'PATCH' tag, and to not use a severity higher than 'wishlist', since the lack of translation never prevented a program from running.
de: Die beste Lösung ist es, einen regulären Fehlerbericht gegen das Paket einzureichen, der die Übersetzung enthält. Stellen Sie sicher, dass Sie die Kennzeichnung »PATCH« und keinen Schweregrad höher als »wishlist« verwenden, da das Fehlen einer Übersetzung ein Programm niemals an der Ausführung hindert.
fr: La meilleure solution est de créer un rapport de bogue standard contenant la traduction sur le paquet. Assurez-vous d'utiliser l'étiquette <literal>patch</literal> et n'utilisez pas une gravité supérieure à <literal>wishlist</literal> car l'absence de traduction n'a jamais empêché un programme de fonctionner.
ja: 最も良いやり方は、パッケージに対して翻訳を含めて通常のバグとして登録することです。忘れずに「patch」タグを使い、翻訳が欠けていたとしてもプログラムの動作に支障は無いので「wishlist」以上の重要度を使わないようにしましょう。

source: Best current practice concerning l10n
de: Beste aktuelle Vorgehensweise bezüglich L10n
fr: Meilleures pratiques actuelles concernant la l10n
ja: l10n に関する現状でのベストプラクティス

source: As a maintainer, never edit the translations in any way (even to reformat the layout) without asking on the corresponding l10n mailing list. You risk for example breaking the encoding of the file by doing so. Moreover, what you consider an error can be right (or even needed) in the given language.
de: Bearbeiten Sie als Betreuer niemals die Übersetzungen in irgendeiner Weise (auch um das Aussehen neu zu formatieren) ohne mit der entsprechenden L10n-Mailingliste zu sprechen. Sie riskieren zum Beispiel, die Zeichencodierung der Datei zu zerstören, wenn Sie dies tun. Außerdem könnte das, was Sie als Fehler betrachen, in der vorliegenden Sprache richtig sein (oder sogar nötig).
fr: En tant que responsable, ne modifiez jamais les traductions en aucune façon (même pour reformater l'affichage) sans demander à la liste de diffusion l10n correspondante. Vous risquez, par exemple, de casser l'encodage du fichier en agissant ainsi. De plus, ce que vous considérez comme une erreur peut être correct (ou même nécessaire) pour une langue donnée.
ja: メンテナとしては、翻訳については関連の l10n メーリングリストに尋ねること無くどの様な方法であれいじらないこと (レイアウトを変えることでさえしないこと) です。もしいじってしまうと、例えばファイルのエンコーディングを破壊する危険があります。さらに、あなたが間違いだと思っていることがその言語では正解である (または必要ですらある) ことがあり得ます。

source: As a translator, if you find an error in the original text, make sure to report it. Translators are often the most attentive readers of a given text, and if they don't report the errors they find, nobody will.
de: Falls Sie als Übersetzer einen Fehler im Originaltext finden, stellen Sie sicher, dass er gemeldet wird. Übersetzer sind oft die aufmerksamsten Leser eines vorliegenden Textes und falls Sie die gefundenen Fehler nicht melden, wird es niemand tun.
fr: En tant que traducteur, si vous trouvez une erreur dans le texte d'origine, assurez-vous de l'indiquer. Les traducteurs sont souvent les lecteurs les plus attentifs d'un texte donné et s'ils ne signalent pas les erreurs découvertes, personne ne le fera.
ja: 翻訳者としては、元の文章に間違いを見つけた場合は必ず報告することです。翻訳者はしばしばその文章の最も注意深い読者であり、翻訳者が見つけた間違いを報告しないのならば誰も報告しないでしょう。

source: In any case, remember that the major issue with l10n is that it requires several people to cooperate, and that it is very easy to start a flamewar about small problems because of misunderstandings. So if you have problems with your interlocutor, ask for help on the corresponding l10n mailing list, on debian-i18n, or even on debian-devel (but beware, l10n discussions very often become flamewars on that list :)
de: Denken Sie auf jeden Fall daran, dass der Hauptstreitpunkt mit L10n darin besteht, dass mehrere Leute für eine Zusammenarbeit nötig sind und dass es sehr leicht ist, einen Flame-War über kleine Probleme aufgrund von Missverständnissen heraufzubeschwören. Falls Sie daher Probleme mit einem Gesprächspartner haben, fragen Sie auf der entsprechenden L10n-Mailingliste, Debian-I18n oder sogar Debian-Devel nach Hilfe (aber Vorsicht, L10n-Diskussionen führen auf dieser Liste oft zu Flame-Wars :) ).
fr: Dans tous les cas, rappelez-vous que le problème principal avec la l10n est qu'elle demande la coopération de plusieurs personnes et qu'il est très facile de démarrer une guerre incendiaire à propos de petits problèmes dûs à des incompréhensions. Donc, si vous avez des problèmes avec votre interlocuteur, demandez de l'aide sur la liste de diffusion l10n correspondante, sur debian-i18n ou même sur debian-devel (attention, cependant, les discussions sur la l10n tournent très souvent à l'incendie sur cette liste :)
ja: いずれの場合でも、l10n に関する最も大きな問題は複数人の協調であり、誤解から小さな問題でフレームウォーを起こすのはとても簡単だということです。ですから、もし、あなたの話し相手と問題が起こっている場合は、関連する l10n メーリングリストや debian-i18n メーリングリスト、さらにあるいは debian-devel メーリングリストに助けを求めてください (ですが、ご注意を。l10n 関連の議論は debian-devel では頻繁にフレームウォーになります :)

source: In any case, cooperation can only be achieved with <emphasis role="strong">mutual respect</emphasis>.
de: Kooperation kann auf jeden Fall nur mit <emphasis role="strong">gegenseitigem Respekt</emphasis> erreicht werden.
fr: En tous cas, la coopération ne peut être atteinte qu'avec un <emphasis role="strong">respect mutuel</emphasis>.
ja: 何にせよ、協調は<emphasis role="strong">互いを尊敬しあうこと</emphasis>によってのみ成し得ます。

source: Applying to Become a Maintainer
de: Bewerbung als Betreuer
fr: Candidature de responsable Debian
ja: 開発者になるために応募する

source: Getting started
de: Erste Schritte
fr: Entrée en matière
ja: さあ、はじめよう

source: So, you've read all the documentation, you've gone through the <ulink url="&url-newmaint-guide;">Debian New Maintainers' Guide</ulink>, understand what everything in the <systemitem role="package">hello</systemitem> example package is for, and you're about to Debianize your favorite piece of software. How do you actually become a Debian developer so that your work can be incorporated into the Project?
de: Also, Sie haben all die Dokumentationen gelesen, Sie sind die<ulink url="&url-newmaint-guide;">Anleitung für zukünftige Debian-Betreuer</ulink> durchgegangen, verstehen alles, was im Beispielpaket <systemitem role="package">hello</systemitem> vorkommt und es geht Ihnen darum, Ihre Lieblings-Software zu debianisieren. Möchten Sie wirklich ein Debian-Entwickler werden, damit Ihre Arbeit in das Projekt aufgenommen wird?
fr: Vous avez lu toute la documentation, vous avez examiné le <ulink url="&url-newmaint-guide;">guide du nouveau responsable</ulink>, vous comprenez l'intérêt de tout ce qui se trouve dans le paquet d'exemple <systemitem role="package">hello</systemitem> et vous vous apprêtez à empaqueter votre logiciel préféré. Comment devenir responsable Debian et intégrer votre travail au projet ?
ja: さて、あなたは全てのドキュメントを読み終え、<ulink url="&url-newmaint-guide;">Debian 新メンテナガイド</ulink>を通して例題の <systemitem role="package">hello</systemitem> パッケージがどの様になっているのか全てを理解し、お気に入りのソフトウェアの一つを Debianize (Debian パッケージ化) しようとしているところです。実際のところ、どうやったら Debian 開発者になってプロジェクトに成果を受け入れてもらえるようになるのでしょうか?

source: Firstly, subscribe to &email-debian-devel; if you haven't already. Send the word <literal>subscribe</literal> in the <literal>Subject</literal> of an email to &email-debian-devel-req;. In case of problems, contact the list administrator at &email-listmaster;. More information on available mailing lists can be found in <xref linkend="mailing-lists"/>. &email-debian-devel-announce; is another list which is mandatory for anyone who wishes to follow Debian's development.
de: Falls Sie das nicht bereits getan haben, schreiben Sie sich zuerst in &email-debian-devel; ein. Senden Sie das Wort <literal>subscribe</literal> im Betreff einer E-Mail an &email-debian-devel-req;. Falls es Probleme gibt, wenden Sie sich unter &email-listmaster; an den Administrator der Liste. Weitere Informationen über verfügbare Listen finden Sie unter <xref linkend="mailing-lists"/>. &email-debian-devel-announce; ist eine Pflichtlektüre für jeden, der die Entwicklung von Debian verfolgen möchte.
fr: Si vous ne l'avez pas encore fait, commencez par vous inscrire à la liste &email-debian-devel;. Pour cela, envoyez un courrier à &email-debian-devel-req; avec le mot <literal>subscribe</literal> en objet (champ <literal>Subject</literal>) de message. En cas de problème, contactez l'administrateur de la liste &email-listmaster;. Vous trouverez plus d'informations en <xref linkend="mailing-lists"/>. &email-debian-devel-announce; est une autre liste incontournable pour suivre les développements de Debian.
ja: まず始めに、まだであれば &email-debian-devel; を購読しましょう。<literal>subscribe</literal> という単語を<literal>サブジェクト</literal>に書いた &email-debian-devel-req; へのメールを送ってください。何か問題がある場合は、&email-listmaster; のメーリングリスト管理者に確認をとりましょう。メーリングリストについての詳しい情報は <xref linkend="mailing-lists"/> で見つけられます。そして &email-debian-devel-announce; は、Debian の開発に携わりたいという人は誰でも読む義務がある、もう一つのメーリングリストです。

source: You should subscribe and lurk (that is, read without posting) for a bit before doing any coding, and you should post about your intentions to work on something to avoid duplicated effort.
de: Sie sollten sich einschreiben und ein wenig mitlesen ohne selbst Beiträge zu verfassen, bevor Sie irgend etwas codieren. Teilen Sie mit an was Sie arbeiten möchten, um doppelten Aufwand zu vermeiden.
fr: Vous devriez suivre les discussions de cette liste (sans poster) pendant quelque temps avant de coder quoi que ce soit et vous informerez la liste de votre intention de travailler sur quelque chose pour éviter de dupliquer le travail d'un autre.
ja: 参加後、何かコーディングを始める前に、しばらくの間「待ち」(投稿せずに読むだけ) の状態でいるのが良いでしょう。それから、重複作業を避けるために何の作業をしようとしているのか表明をする必要があります。

source: Another good list to subscribe to is &email-debian-mentors;. See <xref linkend="mentors"/> for details. The IRC channel <literal>#debian</literal> can also be helpful; see <xref linkend="irc-channels"/>.
de: Auch &email-debian-mentors; ist ein sinnvolles Abonnement. Lesen Sie <xref linkend="mentors"/> für Details. Auch der IRC-Kanal <literal>#debian</literal> kann hilfreich sein. Siehe <xref linkend="irc-channels"/>.
fr: Une autre liste intéressante est &email-debian-mentors;. Voir <xref linkend="mentors"/> pour les détails. Le canal IRC <literal>#debian</literal> pourra aussi être utile ; voir <xref linkend="irc-channels"/>.
ja: もう一つ、購読すると良いのが &email-debian-mentors; です。詳細は <xref linkend="mentors"/> を参照してください。IRC チャンネル <literal>#debian</literal> も役に立つでしょう。<xref linkend="irc-channels"/> を見てください。

source: When you know how you want to contribute to &debian-formal;, you should get in contact with existing Debian maintainers who are working on similar tasks. That way, you can learn from experienced developers. For example, if you are interested in packaging existing software for Debian, you should try to get a sponsor. A sponsor will work together with you on your package and upload it to the Debian archive once they are happy with the packaging work you have done. You can find a sponsor by mailing the &email-debian-mentors; mailing list, describing your package and yourself and asking for a sponsor (see <xref linkend="sponsoring"/> and <ulink url="&url-mentors;"></ulink> for more information on sponsoring). On the other hand, if you are interested in porting Debian to alternative architectures or kernels you can subscribe to port specific mailing lists and ask there how to get started. Finally, if you are interested in documentation or Quality Assurance (QA) work you can join maintainers already working on these tasks and submit patches and improvements.
de: Wenn Sie wissen ,wie Sie zu &debian-formal; beitragen möchten, sollten Sie Kontakt mit existierenden Debian-Betreuern aufnehmen, die an ähnlichen Aufgaben arbeiten. Auf diesem Weg können Sie von erfahrenen Entwicklern lernen. Falls Sie zum Beispiel daran interessiert sind, in Debian existierende Software zu paketieren, sollten Sie versuchen einen Sponsor zu finden. Ein Sponsor wird mit Ihnen zusammen an Ihrem Paket arbeiten und es in das Debian-Archiv hochladen, sobald er mit Ihrer Paketierung zufrieden ist. Sie können Sponsoren auf der Mailingliste &email-debian-mentors; finden, indem Sie dort Ihr Paket und sich selbst beschreiben und nach einem Sponsor fragen (lesen Sie <xref linkend="sponsoring"/> und <ulink url="&url-mentors;"></ulink>, um weitere Informationen über Sponsoring zu erhalten). Wenn Sie andererseits daran interessiert sind, Debian auf alternative Architekturen oder Kernel zu portieren, können Sie spezielle Mailinglisten zur Portierung abonnieren und dort nachfragen, wie der Einstieg gelingt. Abschließend, falls Sie daran interessiert sind, an der Dokumentation oder Qualitätssicherung (QS) zu arbeiten, können Sie sich den Betreuern anschließen, die an diesen Aufgaben arbeiten und Patchs sowie Verbesserungen einsenden.
fr: Une fois choisie une façon de contribuer au projet &debian-formal;, vous devriez entrer en contact avec les responsables Debian qui travaillent sur des tâches similaires. Ainsi, vous pourrez apprendre auprès de personnes expérimentées. Si, par exemple, vous voulez empaqueter des logiciels existants, trouvez-vous un parrain. Un parrain est une personne qui travaillera sur vos paquets avec vous et les enverra dans l'archive Debian une fois satisfait de l'empaquetage. Pour trouver un parrain, envoyez une demande de parrainage à la liste &email-debian-mentors; en vous présentant et en décrivant votre paquet (voir <xref linkend="sponsoring"/> et <ulink url="&url-mentors;"></ulink> pour en savoir plus sur le sujet). Si vous préférez porter Debian sur une architecture ou un noyau alternatif, abonnez-vous aux listes dédiées au portage et demandez-y comment démarrer. Finalement, si vous êtes intéressé par la documentation ou l'assurance qualité (<literal>QA</literal>), contactez les responsables qui travaillent déjà sur ces tâches et proposer des correctifs et des améliorations.
ja: 何らかの方法で &debian-formal; に対して貢献したいと思った時、同じような作業に従事している既存の Debian メンテナにコンタクトしてみてください。そうすれば経験豊かな開発者から学ぶことができます。例えば、既にあるソフトウェアを Debian 用にパッケージ化するのに興味を持っている場合、スポンサーを探しましょう。スポンサーはあなたと一緒にパッケージ化作業を手伝い、あなたの作業が満足する出来になったら Debian アーカイブにパッケージをアップロードしてくれます。スポンサーは、&email-debian-mentors; メーリングリストへパッケージとあなた自身の説明とスポンサーを探していることをメールして見つけましょう (詳細については <xref linkend="sponsoring"/> および <ulink url="&url-mentors;"></ulink> を参照)。さらに、Debian を他のアーキテクチャやカーネルへ移植するのに興味を持っている場合、移植関連のメーリングリストに参加して、どうやって始めればいいのかを尋ねましょう。最後に、ドキュメントや品質保証 (Quality Assuarance、QA) の作業に興味がある場合は、この様な作業を行っているメンテナ達の集まりに参加して、パッチや改善案を送ってください。

source: One pitfall could be a too-generic local part in your mailadress: Terms like mail, admin, root, master should be avoided, please see <ulink url="&url-debian-lists;"></ulink> for details.
de: Eine Schwierigkeit könnte ein zu generischer lokaler Teil in Ihrer Mailadresse sein. Begriffe wie »mail«, »admin«, »root« und »master« sollten vermieden werden. Bitte lesen Sie <ulink url="&url-debian-lists;"></ulink> für Details.
fr: Évitez d'avoir la partie locale de votre adresse électronique trop générique : des termes comme mail, admin, root, master ou debian devraient être évitées. Veuillez consulter <ulink url="&url-debian-lists;"></ulink> pour plus de détails.
ja: メールアドレスのローカルパートが非常に一般的な場合、落とし穴にハマる可能性があります。mail、admin、root、master のような単語は使わないようにするべきです。詳しくは <ulink url="&url-debian-lists;"></ulink> を参照してください。

source: Debian mentors and sponsors
de: Debian-Mentoren und -Sponsoren
fr: Mentors et parrains Debian
ja: Debian メンター (mentors) とスポンサー (sponsors) について

source: The mailing list &email-debian-mentors; has been set up for novice maintainers who seek help with initial packaging and other developer-related issues. Every new developer is invited to subscribe to that list (see <xref linkend="mailing-lists"/> for details).
de: Die Mailingliste &email-debian-mentors; wurde für Einsteiger unter den Betreuern eingerichtet, die sich um Hilfe beim Paketieren Ihrer ersten Pakete und anderen entwicklerbezogenen Themen bemühen. Jeder neue Entwickler ist eingeladen, sich auf dieser Liste einzuschreiben (siehe <xref linkend="mailing-lists"/> für Details).
fr: La liste de diffusion &email-debian-mentors; a été mise en place pour les responsables débutants recherchant de l'aide avec l'empaquetage initial et d'autres problèmes de développeur. Chaque nouveau développeur est invité à s'abonner à cette liste (voir <xref linkend="mailing-lists"/> pour les détails).
ja: メーリングリスト &email-debian-mentors; が、パッケージ化の第一歩目や他の開発者と調整が必要な問題などで手助けを必要としている新米メンテナに用意されています。新たな開発者は皆、このメーリングリストに参加することをお勧めします (詳細は <xref linkend="mailing-lists"/> を参照してください)。

source: Those who prefer one-on-one help (e.g., via private email) should also post to that list and an experienced developer will volunteer to help.
de: Diejenigen, die persönliche Hilfe bevorzugen (z.B. mittels privater E-Mail), sollten auch an diese Liste schreiben und ein erfahrener Entwickler wird freiwillig helfen.
fr: Ceux qui préfèrent recevoir une aide plus personnalisée (par exemple, par courrier privé) devraient également envoyer des messages à cette liste et un développeur expérimenté se proposera de les aider.
ja: 一対一での指導 (つまり、プライベートなメールのやり取りで) の方が良い、という人もこのメーリングリストに投稿しましょう。経験豊かな開発者が助けになってくれるはずです。

source: In addition, if you have some packages ready for inclusion in Debian, but are waiting for your new maintainer application to go through, you might be able find a sponsor to upload your package for you. Sponsors are people who are official Debian Developers, and who are willing to criticize and upload your packages for you. Please read the debian-mentors FAQ at <ulink url="&url-mentors;"></ulink> first.
de: Falls Sie darüberhinaus einige Paket haben, die bereit für die Aufnahme in Debian sind, aber darauf warten, dass Sie Ihre Bewerbung als neuer Betreuer durchlaufen, könnten Sie einen Sponsor suchen, der Ihr Paket für Sie hochlädt. Sponsoren sind offizielle Debian-Entwickler und bereit, Pakete für Sie zu beurteilen und hochzuladen. Bitte lesen Sie zuerst die FAQ für Debian-Mentoren unter <ulink url="&url-mentors;"></ulink>.
fr: De plus, si vous avez des paquets prêts à être inclus dans Debian, mais que vous attendez que votre demande pour devenir responsable soit acceptée, vous pouvez trouver un parrain pour envoyer vos paquets pour vous. Les parrains sont des développeurs Debian officiels qui sont volontaires pour critiquer et envoyer vos paquets pour vous. Veuillez lire en premier la FAQ de debian-mentors à <ulink url="&url-mentors;"></ulink>.
ja: 付け加えておくと、Debian にパッケージを含める準備が出来ているものの、新規メンテナ応募作業の完了を待っているような場合は、パッケージをアップロードしてくれるスポンサーを探すことも出来ます。スポンサーは公式 Debian 開発者で、あなたのパッケージに対して問題を探したりアップロードしようとしてくれる人達です。まずは <ulink url="&url-mentors;"></ulink> にある debian-mentors FAQ を読んでください。

source: If you wish to be a mentor and/or sponsor, more information is available in <xref linkend="newmaint"/>.
de: Falls Sie ein Mentor und/oder Sponsor werden möchten, sind weitere Informationen in <xref linkend="newmaint"/> verfügbar.
fr: Pour devenir mentor ou parrain, plus d'informations sont disponible en <xref linkend="newmaint"/>.
ja: メンターあるいはスポンサーになりたいという人は、<xref linkend="newmaint"/> でより詳細な情報が手に入ります。

source: Registering as a Debian developer
de: Als Debian-Entwickler registrieren
fr: Enregistrement comme responsable Debian
ja: Debian 開発者への登録を行う
