Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: The <literal>experimental</literal> distribution is a special distribution. It is not a full distribution in the same sense as <literal>stable</literal>, <literal>testing</literal> and <literal>unstable</literal> are. Instead, it is meant to be a temporary staging area for highly experimental software where there's a good chance that the software could break your system, or software that's just too unstable even for the <literal>unstable</literal> distribution (but there is a reason to package it nevertheless). Users who download and install packages from <literal>experimental</literal> are expected to have been duly warned. In short, all bets are off for the <literal>experimental</literal> distribution.
de: Die Distribution <literal>experimental</literal> ist eine Spezialdistribution. Sie ist keine vollständige Distribution im Sinn von <literal>stable</literal>, <literal>testing</literal> und <literal>unstable</literal>. Stattdessen ist sie als temporärer Sammelpunkt für hoch experimentelle Software gedacht, bei der eine gute Chance besteht, das ganze System zu zerstören oder von Software, die nur zu instabil ist, sogar für die Distribution <literal>unstable</literal> (bei der es aber dennoch einen Grund gibt, sie zu paketieren). Von Benutzern, die Pakete aus <literal>experimental</literal> herunterladen und installieren, wird erwartet, dass sie ausreichend gewarnt wurden. Kurz gesagt, ist in der Distribution <literal>experimental</literal> alles möglich.
fr: La distribution <literal>experimental</literal> est particulière. Ce n'est pas une distribution à part entière comme le sont <literal>stable</literal>, <literal>testing</literal> et <literal>unstable</literal>. Elle sert de plate-forme de développement pour les projets expérimentaux qui risquent vraiment de détruire le système ou pour des logiciels vraiment trop instables pour être inclus dans la distribution <literal>unstable</literal> (mais pour lesquels une mise en paquet est justifiée). Les utilisateurs qui téléchargent et installent des paquets d'<literal>experimental</literal> sont prévenus : on ne peut pas faire confiance à la distribution <literal>experimental</literal>.
ja: <literal>試験版 (experimental) </literal> は特殊なディストリビューションです。これは、`安定版' や `不安定版' と同じ意味での完全なディストリビューションではありません。その代わり、ソフトウェアがシステムを破壊する可能性がある、あるいは<literal>不安定版</literal>ディストリビューションに導入することですら不安定過ぎる (だが、それにもかかわらず、パッケージにする理由はある) ものであるような、とても実験的な要素を含むソフトウェアの一時的な置き場であることを意味しています。<literal>試験版 (experimental)</literal> からパッケージをダウンロードしてインストールするユーザは、十分に注意を受けているのを期待されています。要するに、<literal>試験版 (experimental)</literal> ディストリビューションを利用すると、どのようになるかは全くわからないということです。

source: These are the <citerefentry> <refentrytitle>sources.list</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> lines for <literal>experimental</literal>:
de: Dies sind die Zeilen der <citerefentry> <refentrytitle>sources.list</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> für <literal>experimental</literal>:
fr: Voici les lignes de <citerefentry> <refentrytitle>sources.list</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> pour <literal>experimental</literal> :
ja: 以下が、<literal>試験版 (experimental)</literal> 用の <citerefentry> <refentrytitle>sources.list</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>です:

source: If there is a chance that the software could do grave damage to a system, it is likely to be better to put it into <literal>experimental</literal>. For instance, an experimental compressed file system should probably go into <literal>experimental</literal>.
de: Falls eine Chance besteht, dass die Software ein System schwer beschädigen könnte, ist es wahrscheinlich besser, sie in <literal>experimental</literal> abzulegen. Zum Beispiel sollte ein experimentell komprimiertes Dateisystem wahrscheinlich nach <literal>experimental</literal> wandern.
fr: Si un logiciel peut causer des dégâts importants, il sera sûrement préférable de le mettre dans la distribution <literal>experimental</literal>. Un système de fichiers compressé expérimental, par exemple, devrait probablement aller dans <literal>experimental</literal>.
ja: ソフトウェアがシステムに多大なダメージを与える可能性がある場合、<literal>試験版 (experimental)</literal> へ配置する方が良いでしょう。例えば、実験的な圧縮ファイルシステムは恐らく<literal>試験版 (experimental)</literal> に行くことになるでしょう。

source: Whenever there is a new upstream version of a package that introduces new features but breaks a lot of old ones, it should either not be uploaded, or be uploaded to <literal>experimental</literal>. A new, beta, version of some software which uses a completely different configuration can go into <literal>experimental</literal>, at the maintainer's discretion. If you are working on an incompatible or complex upgrade situation, you can also use <literal>experimental</literal> as a staging area, so that testers can get early access.
de: Jedes Mal, wenn eine neue Originalversion eines Pakets vorliegt, das neue Funktionen mitbringt, aber ältere beschädigt, sollte es entweder nicht oder nach <literal>experimental</literal> hochgeladen werden. Eine neue Beta-Version einer Software, die eine völlig unterschiedliche Konfiguration nutzt, kann nach Ermessen des Betreuers nach <literal>experimental</literal> wandern. Falls Sie an einer inkompatiblen oder komplexen Situation bei Upgrades arbeiten, können sie <literal>experimental</literal> auch als Sammelpunkt benutzen, damit Tester frühzeitig Zugriff darauf haben.
fr: Une nouvelle version amont de paquet qui introduit de nouvelles fonctions tout en supprimant de nombreuses autres ne devra pas être ajoutée à l'archive Debian, elle pourra cependant être ajoutée à <literal>experimental</literal>. Une nouvelle version non finalisée d'un logiciel qui utilise une méthode de configuration complètement différente pourrait aller dans <literal>experimental</literal> au gré du responsable. Si vous travaillez sur un cas de mise à niveau complexe ou incompatible, vous pouvez aussi utiliser <literal>experimental</literal> comme plate-forme d'intégration et ainsi fournir un accès aux testeurs.
ja: パッケージの新しい上流バージョンが新しい機能を導入するが多くの古い機能を壊してしまう場合であれば、アップロードしないでおくか<literal>試験版 (experimental)</literal> へアップロードするかしましょう。新しいバージョン、ベータ版などで、利用する設定が完全に変わっているソフトウェアは、メンテナの配慮に従って<literal>試験版 (experimental)</literal> へ入れることができます。もしも非互換性や複雑なアップグレード対応について作業している場合などは、<literal>試験版 (experimental)</literal> をステージングエリアとして利用することができるのです。その結果、テストユーザは早期に新しいバージョンの利用が可能になります。

source: Some experimental software can still go into <literal>unstable</literal>, with a few warnings in the description, but that isn't recommended because packages from <literal>unstable</literal> are expected to propagate to <literal>testing</literal> and thus to <literal>stable</literal>. You should not be afraid to use <literal>experimental</literal> since it does not cause any pain to the ftpmasters, the experimental packages are periodically removed once you upload the package in <literal>unstable</literal> with a higher version number.
de: Einige experimentelle Software kann immer noch, mit ein paar Warnungen in der Beschreibung, nach <literal>unstable</literal> wandern, dies wird aber nicht empfohlen, da von Paketen aus <literal>unstable</literal> erwartet wird, dass sie sich nach <literal>testing</literal> und dann nach <literal>stable</literal> ausbreiten. Sie sollten keine Angst haben <literal>experimental</literal> zu benutzen, da es dem FTP-Master keine Mühe macht. Die experimentellen Pakete werden reglemäßig entfernt, wenn Sie das Paket mit einer höheren Versionsnummer nach <literal>unstable</literal> hochladen.
fr: Quelques logiciels expérimentaux peuvent cependant aller dans <literal>unstable</literal>, avec un avertissement dans la description, mais ce n'est pas recommandé car les paquets d'<literal>unstable</literal> se propagent dans <literal>testing</literal> et aboutissent dans <literal>stable</literal>. Vous ne devriez pas avoir peur d'utiliser <literal>experimental</literal> car ceci ne cause aucun souci aux responsables de l'archive (« <literal>ftpmasters</literal> »), les paquets expérimentaux sont périodiquement enlevés quand vous envoyez le paquet dans <literal>unstable</literal> avec un numéro de version supérieur.
ja: 試験版 (experimental) のソフトウェアは<literal>不安定版 (unstable)</literal> へ説明文に幾つかの警告を加えた上で入れることも可能ではありますが、お勧めはできません。それは、<literal>不安定版 (unstable)</literal> のパッケージは<literal>テスト版 (testing)</literal> へ移行し、そして<literal>安定版 (stable)</literal> になることが期待されているからです。<literal>試験版 (experimental)</literal> を使うのをためらうべきではありません。何故なら ftpmaster には何の苦痛も与えませんし、試験版 (experimental) のパッケージは一旦<literal>不安定版 (unstable)</literal> により大きなバージョン番号でアップロードされると定期的に削除されるからです。

source: New software which isn't likely to damage your system can go directly into <literal>unstable</literal>.
de: Neue Software, die das System voraussichtlich nicht schädigt, kann direkt in <literal>unstable</literal> wandern.
fr: Un nouveau logiciel qui ne risque pas d'endommager le système ira directement dans <literal>unstable</literal>.
ja: システムにダメージを与えないような新しいソフトウェアは直接<literal>不安定版 (unstable)</literal> へ入れることが可能です。

source: An alternative to <literal>experimental</literal> is to use your personal web space on <literal>people.debian.org</literal>.
de: Eine Alternative zu <literal>experimental</literal> ist die Benutzung Ihres persönlichen Webspaces auf <literal>people.debian.org</literal>.
fr: Une solution de rechange à <literal>experimental</literal> consiste à utiliser vos pages personnelles sur le serveur <literal>people.debian.org</literal>.
ja: <literal>試験版 (experimental)</literal> の代わりとなる方法は、<literal>people.debian.org</literal> 上の個人的な web ページを使うことです。

source: Release code names
de: Codenamen der Veröffentlichungen
fr: Noms de code des distributions
ja: リリースのコードネーム

source: Every released Debian distribution has a <literal>code name</literal>: Debian 1.1 is called <literal>buzz</literal>; Debian 1.2, <literal>rex</literal>; Debian 1.3, <literal>bo</literal>; Debian 2.0, <literal>hamm</literal>; Debian 2.1, <literal>slink</literal>; Debian 2.2, <literal>potato</literal>; Debian 3.0, <literal>woody</literal>; Debian 3.1, <literal>sarge</literal>; Debian 4.0, <literal>etch</literal>; Debian 5.0, <literal>lenny</literal>; Debian 6.0, <literal>squeeze</literal> and the next release will be called <literal>wheezy</literal>. There is also a ``pseudo-distribution'', called <literal>sid</literal>, which is the current <literal>unstable</literal> distribution; since packages are moved from <literal>unstable</literal> to <literal>testing</literal> as they approach stability, <literal>sid</literal> itself is never released. As well as the usual contents of a Debian distribution, <literal>sid</literal> contains packages for architectures which are not yet officially supported or released by Debian. These architectures are planned to be integrated into the mainstream distribution at some future date.
de: Jede veröffentlichte Debian-Distribution hat einen <literal>code name</literal>: Debian 1.1 wird <literal>buzz</literal> genannt, Debian 1.2 <literal>rex</literal>, Debian 1.3 <literal>bo</literal>, Debian 2.0 <literal>hamm</literal>, Debian 2.1 <literal>slink</literal>, Debian 2.2 <literal>potato</literal>, Debian 3.0 <literal>woody</literal>, Debian 3.1 <literal>sarge</literal>, Debian 4.0 <literal>etch</literal>, Debian 5.0 <literal>lenny</literal>, Debian 6.0, <literal>squeeze</literal> und die nächste Veröffentlichung wird <literal>wheezy</literal> genannt. Es gibt außerdem eine »Pseudo-Distribution« mit dem Namen <literal>sid</literal>, die der aktuellen Distribution <literal>unstable</literal> entspricht. Da Pakete von <literal>unstable</literal> nach <literal>testing</literal> wandern, wenn sie stabil werden, wird <literal>sid</literal> selbst nie veröffentlicht. Ebenso wie die üblichen Inhalte der Debian-Distribution, enthält <literal>sid</literal> Pakete für Architekturen, die noch nicht offiziell durch Debian unterstützt werden. Es ist geplant, diese Architekturen an irgendeinem zukünftigen Datum in die Hauptdistribution zu integrieren.
fr: Chaque distribution Debian diffusée a un <literal>nom de code</literal> : Debian 1.1 s'appelle <literal>Buzz</literal> ; Debian 1.2, <literal>Rex</literal> ; Debian 1.3, <literal>Bo</literal> ; Debian 2.0, <literal>Hamm</literal> ; Debian 2.1, <literal>Slink</literal> ; Debian 2.2, <literal>Potato</literal> ; Debian 3.0, <literal>Woody</literal> ; Debian 3.1, <literal>Sarge</literal> ; Debian 4.0, <literal>Etch</literal> ; Debian 5.0, <literal>Lenny</literal> ; Debian 6.0, <literal>Squeeze</literal> et la prochaine publication sera appelée <literal>Wheezy</literal>. Il existe aussi une « pseudodistribution » nommée <literal>Sid</literal>, il s'agit de la distribution <literal>unstable</literal> ; comme les paquets sont déplacés d'<literal>unstable</literal> vers <literal>testing</literal> quand ils sont suffisamment stables, la distribution <literal>Sid</literal> n'est jamais publiée. En plus du contenu habituel d'une distribution Debian, <literal>Sid</literal> contient des paquets pour des architectures qui ne sont pas encore officiellement prises en charge ou pour lesquelles la distribution n'a pas encore été publiée. Ces architectures seront intégrées ultérieurement à la distribution principale.
ja: リリースされた Debian ディストリビューションは全て<literal>コードネーム</literal>を持っています： Debian 1.1 は <literal>buzz</literal>、Debian 1.2 は <literal>rex</literal>、Debian 1.3 は <literal>bo</literal>、Debian 2.0 は <literal>hamm</literal>、Debian 2.1 は <literal>slink</literal>、Debian 2.2 は <literal>potato</literal>、Debian 3.0 は <literal>woody</literal>、Debian 3.1 は <literal>sarge</literal>、Debian 4.0 は <literal>etch</literal>、Debian 5.0 は <literal>lenny</literal>、Debian 6.0 は <literal>squeeze</literal>、そして次のリリースは <literal>wheezy</literal> と呼ばれています。<literal>sid</literal> と呼ばれる「擬似ディストリビューション」もあり、これは現在の <literal>unstable</literal> ディストリビューションを指します。パッケージは安定に近づくと <literal>unstable</literal> から <literal>testing</literal> へと移動されるので、<literal>sid</literal> そのものは決してリリースされません。通常の Debian ディストリビューションの内容同様に、<literal>sid</literal> は Debian ではまだ公式にサポートあるいはリリースされていないアーキテクチャのパッケージを含んでいます。これらのアーキテクチャは、いつか主流ディストリビューションに統合される予定です。

source: Since Debian has an open development model (i.e., everyone can participate and follow the development) even the <literal>unstable</literal> and <literal> testing</literal> distributions are distributed to the Internet through the Debian FTP and HTTP server network. Thus, if we had called the directory which contains the release candidate version <literal>testing</literal>, then we would have to rename it to <literal>stable</literal> when the version is released, which would cause all FTP mirrors to re-retrieve the whole distribution (which is quite large).
de: Da Debian ein offenes Entwicklungsmodell hat (d.h. jeder kann teilnehmen und der Entwicklung folgen), werden sogar die Distributionen <literal>unstable</literal> und <literal> testing</literal> über das Internet durch die Debian-FTP- und -HTTP-Netzwerkserver verteilt. Folglich müsste, falls das Verzeichnis, das die Kandidatenversion für die Veröffentlichung enthält, <literal>testing</literal> genannt würde, es beim Veröffentlichen der Version in <literal>stable</literal> umbenannt werden, was dazu führen würde, dass alle FTP-Spiegel die ganze Distribution erneut erhalten müssten (die ziemlich groß ist).
fr: Comme Debian est un projet de développement ouvert (où tout le monde peut participer et suivre les développements), même les distributions <literal>unstable</literal> et <literal>testing</literal> sont disponibles sur les serveurs HTTP et FTP de Debian. Si nous avions nommé le répertoire qui contient la future distribution « <literal>testing</literal> », il aurait fallu changer son nom en « <literal>stable</literal> » au moment de la publication, ce qui aurait forcé les miroirs FTP à télécharger de nouveau la distribution complète (qui est plutôt volumineuse).
ja: Debian はオープンな開発体制 (つまり、誰もが開発について参加／追いかけが可能) となっており、<literal>不安定版 (unstable)</literal> および <literal>テスト版 (testing)</literal> ディストリビューションすら Debian の FTP および HTTP サーバネットワークを通じてインターネットへ提供されています。従って、リリース候補版を含むディレクトリを<literal>テスト版 (testing)</literal> と呼んだ場合、このバージョンがリリースされる際に<literal>安定版 (stable)</literal> へとリネームする必要があるということを意味しており、すべての FTP ミラーがディストリビューションすべて (とても巨大です) を再回収することになります。

source: On the other hand, if we called the distribution directories <literal>Debian-x.y</literal> from the beginning, people would think that Debian release <literal>x.y</literal> is available. (This happened in the past, where a CD-ROM vendor built a Debian 1.0 CD-ROM based on a pre-1.0 development version. That's the reason why the first official Debian release was 1.1, and not 1.0.)
de: Wären andererseits von Anfang an die Distributionsverzeichnisse <literal>Debian-x.y</literal> genannt worden, würden die Leute denken, die Debian-Veröffentlichung <literal>x.y</literal> sei verfügbar. (Dies geschah früher, als ein CD-Verkäufer eine Debian 1.0 CD-ROM erstellte, die auf einer pre-1.0-Entwicklerversion basierte. Das ist der Grund, weshalb die erste offizielle Debian-Veröffentlichung 1.1 und nicht 1.0 war.)
fr: D'un autre côté, si une distribution s'appelait <literal>Debian-x.y</literal> dès le départ, des personnes pourraient s'imaginer que la version <literal>x.y</literal> de Debian est disponible. (Cela s'est produit par le passé : un distributeur avait gravé un CD-ROM Debian 1.0 en utilisant une version de développement pré-1.0. C'est pour cette raison que la première version officielle était la version 1.1 et non la 1.0.)
ja: 一方、最初からディストリビューションディレクトリを <literal>Debian-x.y</literal> と呼んでいた場合、皆 Debian リリース <literal>x.y</literal> が利用可能になっていると考えるでしょう。(これは過去にあったことで、CD-ROM ベンダが Debian 1.0 の CD-ROM を pre-1.0 開発版を元に作成したことによります。これが。何故最初の公式 Debian のリリース版が 1.0 ではなく 1.1 であったかという理由です)。

source: Thus, the names of the distribution directories in the archive are determined by their code names and not their release status (e.g., `squeeze'). These names stay the same during the development period and after the release; symbolic links, which can be changed easily, indicate the currently released stable distribution. That's why the real distribution directories use the <literal>code names</literal>, while symbolic links for <literal>stable</literal>, <literal>testing</literal>, and <literal>unstable</literal> point to the appropriate release directories.
de: Dadurch werden die Namen der Distributionsverzeichnisse im Archiv durch ihre Codenamen festgelegt und nicht durch ihren Veröffentlichungsstatus. (z.B. »squeeze«). Diese Namen bleiben während der Entwicklungszeit und nach der Veröffentlichung erhalten. Symbolische Links, die einfach geändert werden können, geben die aktuell veröffentlichte stabile Distribution an. Das ist der Grund, weshalb die echten Distributionsverzeichnisse <literal>code names</literal> benutzen, während symbolische Links für <literal>stable</literal>, <literal>testing</literal> und <literal>unstable</literal> auf die entsprechenden Veröffentlichungsverzeichnisse verweisen.
fr: En conséquence, les noms de répertoire de distribution dans l'archive sont déterminés par leur nom de code plutôt que par leur état de publication (« <literal>squeeze</literal> » par exemple). Ces noms sont identiques pendant la période de développement et une fois la distribution diffusée ; des liens symboliques, qui peuvent être modifiés facilement, indiquent la distribution stable actuelle. Tout ceci explique pourquoi les répertoires des distributions sont nommés à partir des <literal>noms de code</literal> des distributions alors que <literal>stable</literal>, <literal>testing</literal>, et <literal>unstable</literal> sont des liens symboliques qui pointent vers les répertoires appropriés.
ja: 従って、アーカイブ内のディストリビューションディレクトリの名前はリリースの状態ではなくコードネームで決定されます (例えば `squeeze' など)。これらの名称は開発期間中とリリース後も同じものであり続けます。そして、簡単に変更可能なシンボリックリンクによって、現在の安定版リリースディストリビューションを示すことになります。これが、<literal>stable</literal>、<literal>testing</literal>、<literal>unstable</literal> へのシンボリックリンクがそれぞれ相応しいリリースディレクトリを指しているのに対して、実際のディストリビューションディレクトリでは<literal>コードネーム</literal>を使っている理由です。

source: Debian mirrors
de: Debian-Spiegel
fr: Miroirs Debian
ja: Debian ミラーサーバ

source: The various download archives and the web site have several mirrors available in order to relieve our canonical servers from heavy load. In fact, some of the canonical servers aren't public — a first tier of mirrors balances the load instead. That way, users always access the mirrors and get used to using them, which allows Debian to better spread its bandwidth requirements over several servers and networks, and basically makes users avoid hammering on one primary location. Note that the first tier of mirrors is as up-to-date as it can be since they update when triggered from the internal sites (we call this push mirroring).
de: Für die verschiedenen Archive zum Herunterladen und die Website stehen mehrere Spiegel zur Verfügung, um die vorschriftsmäßigen Server vor großer Auslastung zu bewahren. Eigentlich sind einige der vorschriftsmäßigen Server nicht öffentlich zugänglich – eine erste Schicht von Spiegeln balanciert stattdessen die Last aus. Auf diese Art greifen die Anwender immer auf die Spiegel zu und sind es gewöhnt sie zu benutzen. Dies ermöglich es Debian, seine Bandbreitenanforderungen besser über mehrere Server und Netzwerke zu verteilen und vermeidet grundsätzlich, dass Benutzer auf den einen primären Ort aufschlagen. Beachten Sie, dass die erste Schicht von Spiegelservern so aktuell wie möglich ist, da ihre Aktualisierung durch die internen Sites ausgelöst wird (dies wird »push mirroring« genannt).
fr: Les différentes archives de téléchargement et le site web disposent de plusieurs miroirs pour soulager les serveurs principaux d'une charge importante. En fait, certains serveurs principaux ne sont pas publics — la charge est répartie sur une première série de serveurs. De cette façon, les utilisateurs ont toujours accès aux miroirs et s'y habituent, ce qui permet à Debian de mieux répartir les besoins en bande passante sur plusieurs serveurs et réseaux, et évite aux utilisateurs de surcharger l'emplacement primaire. Dans cette première série, les serveurs sont aussi à jour que possible car la mise à jour est déclenchée par les sites maîtres internes.
ja: 各種ダウンロードアーカイブサイトおよびウェブサイトは、中央サーバを巨大なトラフィックから守るために複数ミラーが利用可能となっています。実際のところ、中央サーバのいくつかは公開アクセスが出来るようにはなっていません - 代わりに一次ミラーが負荷を捌いています。このようにして、ユーザは常にミラーにアクセスして利用可能になっており、Debian を多くのサーバやネットワーク越しに配布するのに必要な帯域が楽になり、ユーザが一次配布元に集中しすぎてサイトがダウンしてしまうのをおおよそ避けられるようになります。一次配布ミラーは内部サイトからのトリガーによって更新されるので、可能な限り最新になっている (我々はこれをプッシュミラーと呼んでいます)。

source: All the information on Debian mirrors, including a list of the available public FTP/HTTP servers, can be found at <ulink url="&url-debian-mirrors;"></ulink>. This useful page also includes information and tools which can be helpful if you are interested in setting up your own mirror, either for internal or public access.
de: All die Informationen über Debian-Spiegel, einschließlich der verfügbaren FTP-/HTTP-Server, können unter <ulink url="&url-debian-mirrors;"></ulink> gefunden werden. Diese nützliche Seite enthält auch Informationen und Werkzeuge, die hilfreich sein können, falls Sie daran interessiert sind, entweder für internen oder öffentlichen Zugriff, Ihren eigenen Spiegel einzurichten.
fr: Toutes les informations sur les miroirs Debian peuvent être trouvées sur <ulink url="&url-debian-mirrors;"></ulink>, y compris une liste des miroirs publics disponibles par FTP et HTTP. Cette page utile inclut également des informations et des outils pour créer son propre miroir, en interne ou pour un accès public.
ja: 利用可能な公開 FTP/HTTP サーバのリストを含む、Debian ミラーサーバについての全ての情報が <ulink url="&url-debian-mirrors;"></ulink> から入手可能です。この役立つページには、内部的なものであれ公開されるものであれ、自分のミラーを設定することに興味を持った場合に役立つ情報とツールも含まれています。
