Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: Other than the yearly leader election, votes are not routinely held, and they are not undertaken lightly. Each proposal is first discussed on the &email-debian-vote; mailing list and it requires several endorsements before the project secretary starts the voting procedure.
de: Im Gegensatz zur jährlichen Wahl des Projektleiters werden keine regelmäßigen Abstimmungen abgehalten und wenn doch, dann nicht einfach so. Jeder Vorschlag wird zuerst auf der Mailingliste &email-debian-vote; besprochen und benötigt mehrere Befürworter, bevor der Projektsekretär die Abstimmungsprozedur in Gang setzt.
fr: En dehors de l'élection annuelle du responsable de projet, les votes ne se tiennent pas régulièrement et ne sont pas entrepris à la légère. Chaque proposition est tout d'abord discutée sur la liste de diffusion &email-debian-vote; et a besoin de plusieurs approbations avant que le secrétaire du projet n'entame la procédure de vote.
ja: 毎年のリーダー選挙以外には、投票は定期的には実施されず、軽々しく提案されるものではありません。提案はそれぞれ &email-debian-vote; メーリングリストでまず議論され、プロジェクトの書記担当者が投票手順を開始する前に複数のエンドースメントを必要とします。

source: You don't have to track the pre-vote discussions, as the secretary will issue several calls for votes on &email-debian-devel-announce; (and all developers are expected to be subscribed to that list). Democracy doesn't work well if people don't take part in the vote, which is why we encourage all developers to vote. Voting is conducted via GPG-signed/encrypted email messages.
de: Sie müssen vor der Abstimmung nicht alle Diskussionen verfolgen, da der Sekretär mehrere Aufrufe zur Abstimmung auf &email-debian-devel-announce; herausgibt (Und von allen Entwicklern wird erwartet, das sie diese Liste abonniert haben). Demokratie funktioniert nicht richtig, wenn die Leute nicht an Abstimmungen teilnehmen, daher wird allen Entwicklern empfohlen abzustimmen. Die Abstimmung wird mittels GPG-signierte/verschlüsselte E-Mails durchgeführt.
fr: Vous n'avez pas besoin de suivre les discussions précédant le vote car le secrétaire enverra plusieurs appels au vote sur la liste &email-debian-devel-announce; (et tous les développeurs devraient être inscrits à cette liste). La démocratie ne fonctionne pas si les personnes ne prennent pas part au vote, c'est pourquoi nous encourageons tous les développeurs à voter. Le vote est conduit par messages signés ou chiffrés par GPG.
ja: 書記担当者が &email-debian-devel-announce; 上で複数回投票の呼びかけを行うので、投票前の議論を追いかける必要はありません (全開発者がこのメーリングリストを購読することが求められています)。民主主義は、人々が投票に参加しないと正常に機能しません。これが我々が全ての開発者に投票を勧める理由です。投票は GPG によって署名／暗号化されたメールによって行われます。

source: The list of all proposals (past and current) is available on the <ulink url="&url-vote;">Debian Voting Information</ulink> page, along with information on how to make, second and vote on proposals.
de: Die Liste aller(früheren und aktuellen) Vorschläge ist auf der Seite <ulink url="&url-vote;">Debian-Abstimmungs-Informationen</ulink> verfügbar, ebenso die Informationen, wie Vorschläge gemacht und unterstützt werden und darüber abgestimmt wird.
fr: La liste de toutes les propositions (passées et présentes) est disponible sur la page des <ulink url="&url-vote;">informations sur les votes Debian</ulink>, ainsi que des informations complémentaires sur la procédure à suivre pour effectuer une proposition, la soutenir et voter pour elle.
ja: (過去と現在の) 全ての提案リストが <ulink url="&url-vote;">Debian 投票情報</ulink>ページで閲覧できます。提案について、どの様に起案され、支持され、投票が行われたのかという関連情報の確認が可能になっています。

source: Going on vacation gracefully
de: Elegant Urlaub machen
fr: Départ en vacances poli
ja: 優雅に休暇を取る

source: It is common for developers to have periods of absence, whether those are planned vacations or simply being buried in other work. The important thing to notice is that other developers need to know that you're on vacation so that they can do whatever is needed if a problem occurs with your packages or other duties in the project.
de: Es ist bei Entwicklern üblich, dass es Zeiten gibt, in denen sie abwesend sind, entweder wegen geplanten Ferien oder einfach, weil sie unter anderer Arbeit begraben sind. Am wichtigsten ist, dass Sie daran denken, andere Entwickler über Ihren Urlaub zu informieren, damit diese bei Problemen mit Ihren Paketen oder anderweitigen Pflichten im Projekt die erforderlichen Maßnahmen ergreifen können.
fr: Il est courant pour les développeurs de s'absenter, que ce soit pour des vacances prévues ou parce qu'ils sont submergés de travail. L'important est que les autres développeurs ont besoin de savoir si vous êtes indisponible pour pouvoir agir en conséquence si un problème se produit sur vos paquets ou autre pendant votre absence.
ja: 予定していた休暇にせよ、それとも単に他の作業で忙しいにせよ、開発者が不在になることがあるのはごく普通のことです。注意すべき重要な点は、他の開発者達があなたが休暇中であるのを知る必要があることと、あなたのパッケージについて問題が起こった場合やプロジェクト内での責務を果たすのに問題が生じたという様な場合は、必要なことを彼らが何であってもできるようにすることです。

source: Usually this means that other developers are allowed to NMU (see <xref linkend="nmu"/>) your package if a big problem (release critical bug, security update, etc.) occurs while you're on vacation. Sometimes it's nothing as critical as that, but it's still appropriate to let others know that you're unavailable.
de: Üblicherweise bedeutet dies, dass andere Entwickler ein NMU (siehe <xref linkend="nmu"/>) Ihres Pakets durchführen dürfen, weil ein großes Problem (release-kritischer Fehler, Sicherheitsaktualisierung etc.) auftritt während Sie in Ferien sind. Manchmal ist dies etwas weniger kritisches, aber es ist trotzdem angemessen, andere wissen zu lassen, dass Sie nicht verfügbar sind.
fr: Habituellement, cela signifie que les autres développeurs peuvent faire des NMU (voir <xref linkend="nmu"/>) sur votre paquet si un gros problème (bogue empêchant l'intégration dans la distribution, mise à jour de sécurité, etc.) se produit pendant que vous êtes en vacances. Parfois, ce n'est pas très important, mais il est de toute façon approprié d'indiquer aux autres que vous n'êtes pas disponible.
ja: 通常、これはあなたが休暇中にあなたのパッケージが大きな問題 (リリースクリティカルバグやセキュリティ更新など) となっている場合に、他の開発者に対して NMU (<xref linkend="nmu"/> 参照) を許可することを意味しています。大抵の場合はそれほど致命的なことはおきませんが、他の開発者に対してあなたが作業できない状態であることを知らせるのは重要です。

source: This is so that the message can be easily filtered by people who don't want to read vacation notices.
de: Dies geschieht so, dass die Nachricht einfach von Leuten gefiltert werden kann, die keine Urlaubsbenachrichtigungen lesen möchten.
fr: Ainsi, le message peut être facilement filtré par les personnes qui ne veulent pas lire ces annonces de vacances.
ja: これは、休暇のメッセージを読みたくない人がメッセージを簡単に振り分け可能にするためです。

source: In order to inform the other developers, there are two things that you should do. First send a mail to <email>debian-private@&lists-host;</email> with [VAC] prepended to the subject of your message<placeholder type="footnote" id="0"/> and state the period of time when you will be on vacation. You can also give some special instructions on what to do if a problem occurs.
de: Um andere Entwickler zu informieren, gibt es zwei Dinge, die Sie tun sollten. Zuerst senden Sie eine E-Mail an <email>debian-private@&lists-host;</email> bei der Sie [VAC] vor den Betreff Ihrer Nachricht schreiben<placeholder type="footnote" id="0"/> und die Dauer angeben, wie lange Sie Urlaub machen. Sie können außerdem einige besondere Anweisungen geben, was beim Auftreten von Fehlern zu tun ist.
fr: Il y a deux choses à faire pour informer les autres développeurs. Premièrement, envoyez un courrier électronique à <email>debian-private@&lists-host;</email> en commençant le sujet de votre message par « [VAC] »<placeholder type="footnote" id="0"/> et donnez la période de vos vacances. Vous pouvez également donner quelques instructions pour indiquer comment agir si un problème survenait.
ja: 他の開発者に通知するために行わなければならないことが 2 つあります。まず、<email>debian-private@&lists-host;</email> にサブジェクトの先頭に [VAC] と付けたメールを送り<placeholder type="footnote" id="0"/>、いつまで休暇なのかを示しておきます。何か問題が起きた際への特別な指示を書いておくこともできます。

source: The other thing to do is to mark yourself as on vacation in the <link linkend="devel-db">Debian developers' LDAP database</link> (this information is only accessible to Debian developers). Don't forget to remove the on vacation flag when you come back!
de: Das andere, was Sie tun sollten, ist, sich selbst in der <link linkend="devel-db">LDAP-Entwicklerdatenbank von Debian</link> als abwesend zu kennzeichnen (auf diese Information können nur Debian-Entwickler zugreifen). Vergessen Sie nicht, die Urlaubskennzeichnung zu entfernen, wenn Sie wieder zurück sind.
fr: L'autre chose à faire est de vous signaler comme en vacances (« <literal>on vacation</literal> ») dans la <link linkend="devel-db">base de données Debian LDAP</link> (l'accès à cette information est réservé aux développeurs). N'oubliez pas de retirer l'indicateur <literal>on vacation</literal> à votre retour !
ja: 他に行うべき事は <link linkend="devel-db">Debian developers' LDAP database</link> 上 であなたを vacation とマークする事です (この情報は Debian 開発者のみがアクセスできます)。休暇から戻った時には vacation フラグを削除するのを忘れないように!

source: Ideally, you should sign up at the <ulink url="&url-gpg-coord;">GPG coordination pages</ulink> when booking a holiday and check if anyone there is looking for signing. This is especially important when people go to exotic places where we don't have any developers yet but where there are people who are interested in applying.
de: Idealerweise sollten Sie sich auf den <ulink url="&url-gpg-coord;">GPG-Koordinierungsseiten</ulink> anmelden, wenn Sie Urlaub buchen und prüfen, ob es dort jemanden gibt, der eine Signatur benötigt. Dies ist besonders dann wichtig, wenn Leute an exotische Orte fahren, an denen es noch keine Entwickler gibt, aber Leute, die an einer Bewerbung interessiert sind.
fr: Dans l'idéal, vous devriez vous connecter sur les <ulink url="&url-gpg-coord;">pages de coordination GPG</ulink> quand vous prévoyez un départ et vérifier si quelqu'un recherche un échange de signatures. Cela est particulièrement important quand des personnes vont à des endroits exotiques où nous n'avons pas encore de développeurs, mais où il y a des personnes intéressées pour poser leur candidature.
ja: 理想的には、休暇にあわせて <ulink url="&url-gpg-coord;">GPG coordination pages</ulink> に登録して、誰かサインを希望している人がいるかどうかをチェックします。開発者がまだ誰もいないけれども応募に興味を持っている人がいるようなエキゾチックな場所に行く場合、これは特に重要です。

source: Retiring
de: Sich zurückziehen
fr: Démission
ja: 脱退について

source: If you choose to leave the Debian project, you should make sure you do the following steps:
de: Falls Sie das Debian-Projekt verlassen wollen, sollten Sie die folgenden Schritte einhalten:
fr: Si vous décidez de quitter le projet Debian, veillez procéder comme suit :
ja: Debian プロジェクトから去るのを決めた場合は、以下の手順に従ってください:

source: Orphan all your packages, as described in <xref linkend="orphaning"/>.
de: Verwaisen Sie all Ihre Pakete, wie in <xref linkend="orphaning"/> beschrieben.
fr: abandonnez tous vos paquets comme décrit en <xref linkend="orphaning"/> ;
ja: <xref linkend="orphaning"/> の記述に従って、全てのパッケージをみなしご化 (orphan) してください。

source: Send an gpg-signed email about why you are leaving the project to <email>debian-private@&lists-host;</email>.
de: Senden Sie eine GPG-signierte E-Mail mit den Gründen, weshalb Sie das Projekt verlassen, an <email>debian-private@&lists-host;</email>.
fr: envoyez un courrier électronique signé par GnuPG à <email>debian-private@&lists-host;</email> indiquant pourquoi vous quittez le projet ;
ja: 何故プロジェクトを去るのかについて GPG でサインされたメールを <email>debian-private@&lists-host;</email> に投げてください。

source: Notify the Debian key ring maintainers that you are leaving by opening a ticket in Debian RT by sending a mail to &email-keyring; with the words 'Debian RT' somewhere in the subject line (case doesn't matter).
de: Benachrichtigen Sie die Debian-Schlüsselverwalter über Ihren Weggang, indem Sie ein Ticket in Debian-RT öffnen. Dies geschieht durch Senden einer E-Mail an &email-keyring; mit den Wörtern »Debian RT« in der Betreffzeile (Groß- und Kleinschreibung spielt keine Rolle).
fr: signalez aux responsables du porte-clés Debian que vous quittez le projet en ouvrant un ticket en écrivant à &email-keyring; avec les mots « Debian RT » dans le sujet (peu importe la casse).
ja: 'Debian RT' という単語 (大文字小文字は関係なし) がサブジェクトのどこかに入ったメールを &email-keyring; に投げて Debian RT でチケットをオープンして、あなたがプロジェクトを去るのを Debian key ring メンテナに知らせてください。

source: It is important that the above process is followed, because finding inactive developers and orphaning their packages takes significant time and effort.
de: Es ist wichtig, obigem Prozess zu folgen, da die Suche nach inaktiven Entwicklern und das Verwaisen ihrer Pakete spürbar Zeit und Mühe kostet.
fr: Le processus précédemment décrit devrait absolument être suivi, car trouver les développeurs inactifs et abandonner leurs paquets est une tâche longue et fastidieuse.
ja: 上記のプロセスに従うのは重要です。何故なら活動を停止している開発者を探してパッケージをみなしご化するのは、非常に時間と手間がかかることだからです。

source: Returning after retirement
de: Nach dem Ausscheiden zurückkehren
fr: Revenir après démission
ja: リタイア後に再加入する

source: A retired developer's account is marked as "emeritus" when the process in <xref linkend="s3.7"/> is followed, and "disabled" otherwise. Retired developers with an "emeritus" account can get their account re-activated as follows:
de: Das Konto eines zurückgetretenen Entwicklers ist als »emeritus« markiert, wenn dem Prozess in <xref linkend="s3.7"/> gefolgt wird und ansonsten als »disabled«. Zurückgetretene Entwickler mit einem »emeritus«-Konto können Ihr Konto wie folgt neu aktivieren:
fr: Le compte d'un développeur est marqué « emeritus » (honoraire) quand le processus précédent en <xref linkend="s3.7"/> est suivi, et « disabled » (désactivé) sinon. Un développeur ayant démissionné avec un compte « emeritus » peut réactiver son compte de la façon suivante :
ja: リタイアした開発者のアカウントは、<xref linkend="s3.7"/> の手続きが開始された際に「emeritus」であるとマークされ、それ以外の場合は「disabled」となります。「emeritus」アカウントになっているリタイアした開発者は、以下のようにすればアカウントを再度有効にできます:

source: Contact &email-debian-account-manager;.
de: Kontaktieren Sie &email-debian-account-manager;.
fr: contacter &email-debian-account-manager; ;
ja: &email-debian-account-manager; に連絡を取ります

source: Go through a shortened NM process (to ensure that the returning developer still knows important parts of P&amp;P and T&amp;S).
de: Durchlaufen Sie den verkürzten NM-Prozess (um sicherzustellen, dass der zurückgekehrte Entwickler noch immer die wichtigen Teile von P&amp;P – »Philosophie und Prozeduren« und T&amp;S – »Aufgaben und Fertigkeiten« kennt).
fr: passer le processus raccourci de nouveau responsable (pour s'assurer qu'il connaît toujours les parties importantes de « philosophie et procédures » et « tâches et compétences ») ;
ja: 短縮された NM プロセスを通過します (リタイアした開発者が P&amp;P および T&amp;S の肝心な部分を覚えているのを確認するためです)。

source: Prove that they still control the GPG key associated with the account, or provide proof of identify on a new GPG key, with at least two signatures from other developers.
de: Beweisen Sie, dass Sie immer noch den mit dem Konto verbundenen GPG-Schlüssel kontrollieren oder stellen Sie den Nachweis Ihrer Identität für einen neuen GPG-Schlüssel mit mindestens zwei Signaturen anderer Entwickler bereit.
fr: démontrer qu'il possède toujours la clef GPG associée au compte, ou fournir des preuves d'identité sur une nouvelle clef GPG, avec au moins deux signatures d'autres développeurs Debian.
ja: アカウントに紐付けられた GPG 鍵を今でも管理していることを証明する、あるいは新しい GPG 鍵について、他の開発者から少なくとも 2 つの書名を受けることにより身分証明を行う。

source: Retired developers with a "disabled" account need to go through NM again.
de: Zurückgetretene Entwickler mit einem »disabled«-Konto müssen den NM-Prozess erneut durchlaufen.
fr: Les développeurs ayant démissionné avec un compte « disabled » doivent repasser le processus complet de nouveau développeur.
ja: リタイアした開発者で「disabled」アカウントの人は、NM をもう一度通り抜ける必要があります。

source: en
de: de
fr: fr
ja: ja

source: Debian Developer's Reference
de: Debian Entwickler-Referenz
fr: Référence du développeur Debian
ja: Debian 開発者リファレンス

source: <author> <othername>Developer's Reference Team</othername> &email-devel-ref; </author> <author> <firstname>Andreas</firstname> <surname>Barth</surname> </author> <author> <firstname>Adam</firstname> <surname>Di Carlo</surname> </author> <author> <firstname>Raphaël</firstname> <surname>Hertzog</surname> </author> <author> <firstname>Lucas</firstname> <surname>Nussbaum</surname> </author> <author> <firstname>Christian</firstname> <surname>Schwarz</surname> </author> <author> <firstname>Ian</firstname> <surname>Jackson</surname> </author>
de: <author> <othername>Autoren der Entwickler-Referenz</othername> &email-devel-ref; </author> <author> <firstname>Andreas</firstname> <surname>Barth</surname> </author> <author> <firstname>Adam</firstname> <surname>Di Carlo</surname> </author> <author> <firstname>Raphaël</firstname> <surname>Hertzog</surname> </author> <author> <firstname>Lucas</firstname> <surname>Nussbaum</surname> </author> <author> <firstname>Christian</firstname> <surname>Schwarz</surname> </author> <author> <firstname>Ian</firstname> <surname>Jackson</surname> </author>
fr: <author> <othername>Équipe de la référence du développeur</othername> &email-devel-ref; </author> <author> <firstname>Andreas</firstname> <surname>Barth</surname> </author> <author> <firstname>Adam</firstname> <surname>Di Carlo</surname> </author> <author> <firstname>Raphaël</firstname> <surname>Hertzog</surname> </author> <author> <firstname>Lucas</firstname> <surname>Nussbaum</surname> </author> <author> <firstname>Christian</firstname> <surname>Schwarz</surname> </author> <author> <firstname>Ian</firstname> <surname>Jackson</surname> </author>

source: ver. &version;
de: Version &version;
fr: Version &version;

source: This manual is free software; you may redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2, or (at your option) any later version.
de: Dieses Handbuch ist freie Software. Sie können es unter den Bedingungen der GNU General Public License, wie von der Free Software Foundation veröffentlicht, weitergeben und/oder modifizieren, entweder gemäß Version 2 der Lizenz oder (nach Ihrer Option) jeder späteren Version.
fr: Ce manuel est un logiciel libre ; il peut être redistribué ou modifié selon les termes de la licence publique générale du projet GNU (GNU GPL), telle que publiée par la « Free Software Foundation » (version 2 ou toute version postérieure).
ja: このマニュアルはフリーソフトウェアです。あなたは、Free Software Foundation が発行した GNU 一般公衆利用許諾契約書の第二版あるいはそれ以降のいずれかの版の条件に基づき、本文書の再配付および変更をすることができます。

source: This is distributed in the hope that it will be useful, but <emphasis>without any warranty</emphasis>; without even the implied warranty of merchantability or fitness for a particular purpose. See the GNU General Public License for more details.
de: Die Veröffentlichung dieses Dokuments erfolgt in der Hoffnung, daß es Ihnen von Nutzen sein wird, aber <emphasis>ohne irgendeine Garantie</emphasis>, sogar ohne die implizite Garantie der MARKTREIFE oder der VERWENDBARKEIT FÜR EINEN BESTIMMTEN ZWECK. Details finden Sie in der GNU General Public License.
fr: Il est distribué dans l'espoir qu'il sera utile, mais <emphasis>sans aucune garantie</emphasis>, sans même la garantie implicite d'une possible valeur marchande ou d'une adéquation à un besoin particulier. Consultez la licence publique générale du projet GNU pour plus de détails.
ja: 本文書はその有用性が期待されて配付されるものですが、市場性や特定の目的への適合性に関する暗黙の保証も含め、<emphasis>いかなる保証も行ないません</emphasis>。詳細については GNU 一般公衆利用許諾契約書をお読みください。

source: A copy of the GNU General Public License is available as &file-GPL; in the &debian-formal; distribution or on the World Wide Web at <ulink url="&url-gpl;">the GNU web site</ulink>. You can also obtain it by writing to the &fsf-addr;.
de: Eine Kopie der GNU General Public Licence ist als &file-GPL; in der Distribution &debian-formal; oder im World-Wide-Web auf der <ulink url="&url-gpl;">GNU Website</ulink> verfügbar. Sie können sie ebenfalls erhalten, indem Sie an &fsf-addr; schreiben.
fr: Une copie de la licence publique générale du projet GNU est disponible dans le fichier &file-GPL; de la distribution &debian-formal; ou sur la toile : <ulink url="&url-gpl;">la licence publique générale du projet GNU</ulink>. Vous pouvez également l'obtenir en écrivant à la &fsf-addr;.
ja: GNU 一般公衆利用許諾契約書の写しは、Debian GNU/Linux ディストリビューション中の &file-GPL; 、あるいは World Wide Web 上の <ulink url="&url-gpl;">GNU ウェブサイト</ulink>で入手できます。また &fsf-addr; へ手紙 (英語) で依頼し入手することもできます。

source: If you want to print this reference, you should use the <ulink url="developers-reference.pdf">pdf version</ulink>. This page is also available in <ulink url="index.fr.html">French</ulink>, <ulink url="index.de.html">German</ulink> and <ulink url="index.ja.html">Japanese</ulink>.
de: Wenn Sie diese Referenz ausdrucken möchten, sollten Sie die <ulink url="developers-reference.pdf">PDF-Version</ulink> verwenden. Diese Seite ist auch auf <ulink url="index.html">Englisch</ulink> und <ulink url="index.fr.html">Französisch</ulink> und <ulink url="index.ja.html">Japanisch</ulink> verfügbar. Die deutsche Übersetzung wurde 2011 von Chris Leick &lt;c.leick@vollbio.de&gt; verfasst.
fr: Si vous désirez imprimer cette référence, vous devriez utiliser la <ulink url="developers-reference.fr.pdf">version PDF</ulink>. Cette page est également disponible en <ulink url="index.de.html">allemand</ulink>, <ulink url="index.html">anglais</ulink> et <ulink url="index.ja.html">japonais</ulink>.
ja: このリファレンスを印刷したい場合は、<ulink url="developers-reference.pdf">PDF 版</ulink>を利用すると良いでしょう。このページは <ulink url="index.fr.html">フランス語</ulink>、<ulink url="index.de.html">ドイツ語</ulink>、<ulink url="index.ja.html">日本語</ulink>でも利用可能です。

source: Internationalization and Translations
de: Internationalisierung und Übersetzungen
fr: Internationalisation et traduction
ja: 国際化と翻訳

source: Debian supports an ever-increasing number of natural languages. Even if you are a native English speaker and do not speak any other language, it is part of your duty as a maintainer to be aware of issues of internationalization (abbreviated i18n because there are 18 letters between the 'i' and the 'n' in internationalization). Therefore, even if you are ok with English-only programs, you should read most of this chapter.
de: Debian unterstützt eine immer größer werdende Zahl natürlicher Sprachen. Selbst wenn Englisch Ihre Muttersprache ist und Sie keine andere Sprache sprechen, gehört es zu Ihren Pflichten als Paketbetreuer, die Probleme der Internationalisierung zu kennen (abgekürzt I18n, weil 18 Buchstaben zwischen »i« und »n« im englischen Wort »internationalization« stehen). Daher sollten Sie sogar, wenn Sie mit rein englischen Programmen klarkommen, das meiste in diesem Kapitel lesen.
fr: Debian prend en charge un nombre toujours croissant de langues naturelles. Même si l'anglais est votre langue maternelle et que vous ne parlez pas d'autre langue, il est de votre devoir de responsable d'être conscient des problèmes d'internationalisation (abrégé en i18n à cause des 18 lettres entre le « i » et le « n » d' « internationalisation »). C'est pourquoi, même si des programmes seulement en anglais vous suffisent, vous devriez lire la plupart de ce chapitre.
ja: Debian がサポートしている自然言語の数は未だ増え続けています。あなたが英語圏のネイティブスピーカーで他の言語を話さないとしても、国際化の問題について注意を払うことはメンテナとしてのあなたの責務です (internationalization の 'i' と 'n' の間に 18 文字があるので i18n と略されます)。つまり、あなたが英語のみのプログラムを扱っていて問題がない場合であっても、この章の大部分を読んでおく必要があるということです。
