Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: Before you decide to register with &debian-formal;, you will need to read all the information available at the <ulink url="&url-newmaint;">New Maintainer's Corner</ulink>. It describes in detail the preparations you have to do before you can register to become a Debian developer. For example, before you apply, you have to read the <ulink url="&url-social-contract;">Debian Social Contract</ulink>. Registering as a developer means that you agree with and pledge to uphold the Debian Social Contract; it is very important that maintainers are in accord with the essential ideas behind &debian-formal;. Reading the <ulink url="&url-gnu-manifesto;">GNU Manifesto</ulink> would also be a good idea.
de: Bevor Sie sich entscheiden, sich bei &debian-formal; zu registrieren, werden Sie alle in <ulink url="&url-newmaint;">Debians New-Maintainer-Ecke</ulink> verfügbaren Informationen lesen müssen. Dort wird im Detail beschrieben, welche Vorbereitungen Sie treffen müssen, bevor Sie sich registrieren können, um Debian-Entwickler zu werden. Zum Beispiel müssen Sie, bevor Sie sich bewerben, den <ulink url="&url-social-contract;">Debian-Gesellschaftsvertrag</ulink> lesen. Die Registrierung als Debian-Entwickler bedeutet, dass Sie ihm zustimmen und versprechen, den Debian-Gesellschaftsvertrag zu unterstützen. Es ist sehr wichtig, dass Betreuer mit den grundsätzlichen Ideen hinter &debian-formal; einverstanden sind. Es wäre außerdem empfehlenswert, das <ulink url="&url-gnu-manifesto;">GNU-Manifest</ulink> zu lesen.
fr: Avant de décider de devenir responsable Debian, il vous faudra lire toute la documentation disponible dans le <ulink url="&url-newmaint;">coin du nouveau responsable</ulink>. Elle décrit en détail toutes les étapes préparatoires qu'il vous faudra franchir avant de déposer votre candidature. Par exemple, avant d'être candidat, il vous faudra lire le <ulink url="&url-social-contract;">contrat social Debian</ulink>. Devenir responsable Debian implique que vous adhériez à ce contrat social et que vous vous engagiez à le soutenir ; il est très important que les responsables soient en accord avec les principes fondamentaux qui animent le projet &debian-formal;. Lire le <ulink url="&url-gnu-manifesto;">Manifeste GNU</ulink> est aussi une bonne idée.
ja: &debian-formal; への登録を決める前に、<ulink url="&url-newmaint;">新メンテナのコーナー</ulink>で手に入る全ての情報に目を通してください。Debian 開発者になるための登録をする前に必要な準備がすべて記載されています。例えば、応募の前に <ulink url="&url-social-contract;">Debian 社会契約</ulink>を読む必要があります。開発者として登録するということは、Debian 社会契約に同意し、遵守し続けることを意味します。メンテナにとって &debian-formal; の背景にある根本的な理念に従うのは大変重要な事です。<ulink url="&url-gnu-manifesto;">GNU Manifesto</ulink>を読むのも良い考えでしょう。

source: The process of registering as a developer is a process of verifying your identity and intentions, and checking your technical skills. As the number of people working on &debian-formal; has grown to over &number-of-maintainers; and our systems are used in several very important places, we have to be careful about being compromised. Therefore, we need to verify new maintainers before we can give them accounts on our servers and let them upload packages.
de: Der Aufnahmeprozess für Entwickler werden Ihre Identität, Absichten und technischen Fähigkeiten geprüft werden. Als die Anzahl der Leute, die an &debian-formal; arbeiteten auf über &number-of-maintainers; wuchs und das System an mehreren sehr wichtigen Stellen lief, war Vorsicht geboten, um nicht kompromittiert zu werden. Daher müssen neue Betreuer überprüft werden, bevor Sie Konten auf den Servern erhalten und Pakete hochladen dürfen.
fr: Le processus d'enregistrement a pour but de vérifier votre identité, vos intentions et vos compétences. Le nombre de personnes travaillant pour &debian-formal; a atteint &number-of-maintainers; et notre système est utilisé dans plusieurs endroits très importants : nous devons rester vigilants pour éviter un acte malveillant. C'est pourquoi nous contrôlons les nouveaux responsables avant de leur donner un compte sur nos serveurs et de les autoriser à ajouter des paquets dans l'archive.
ja: 開発者としての登録手順は、あなたのアイデンティティと意図と技術的なスキルレベルの確認手順でもあります。&debian-formal; について作業をする人の数は &number-of-maintainers; を越えて増えつづけています。そして、我々のシステムは幾多の重要な場所で使われており、セキュリティ侵害には十分に注意しなければなりません。つまり、我々のサーバのアカウントを与えたりパッケージのアップロードを許可したりする前には新たなメンテナを審査する必要があるのです。

source: Before you actually register you should have shown that you can do competent work and will be a good contributor. You show this by submitting patches through the Bug Tracking System and having a package sponsored by an existing Debian Developer for a while. Also, we expect that contributors are interested in the whole project and not just in maintaining their own packages. If you can help other maintainers by providing further information on a bug or even a patch, then do so!
de: Bevor Sie sich tatsächlich registrieren, sollten Sie zeigen, dass Sie kompetent arbeiten und gute Beiträge leisten. Sie zeigen dies, indem Sie Patchs an die Debian-Fehlerdatenbank senden und ein Paket haben, das ein existierender Debian-Entwickler für eine Zeit lang sponsort. Außerdem wird erwartet, dass Mitwirkende sich für das ganze Projekt interessieren und nicht nur ihre eigenen Pakete betreuen. Falls Sie anderen Betreuern helfen können, weitere Informationen zu einem Fehler oder sogar ein Patch bereitzustellen, dann tun Sie dies!
fr: Pour devenir responsable, il faudra montrer que vous pouvez faire du bon travail et que vous serez un bon contributeur. Pour cela, vous pourrez proposer des correctifs par le système de suivi des bogues (BTS) et maintenir un paquet parrainé par un responsable Debian pendant un temps. Nous attendons aussi des contributeurs qu'ils soient intéressés par le projet dans son ensemble et pas uniquement par leurs propres paquets. Si vous pouvez aider d'autres responsables en fournissant des informations sur un bogue ou même avec un correctif, faites-le !
ja: 実際に登録する前に、あなたは良い仕事ができる貢献者となり得ることを示さねばなりません。バグ追跡システムを介してパッチを送ったり、既存の Debian 開発者のスポンサーによるパッケージの管理をしばらくの間行うなどして、これをアピールします。付け加えておくと、我々は貢献してくれる人達が単に自分のパッケージをメンテナンスするだけにではなく、プロジェクト全体について興味を持ってくれることを期待しています。バグについての追加情報、できればパッチの提供などによって他のメンテナを手助けできるのであれば、早速実行しましょう!

source: Registration requires that you are familiar with Debian's philosophy and technical documentation. Furthermore, you need a GnuPG key which has been signed by an existing Debian maintainer. If your GnuPG key is not signed yet, you should try to meet a Debian Developer in person to get your key signed. There's a <ulink url="&url-gpg-coord;">GnuPG Key Signing Coordination page</ulink> which should help you find a Debian Developer close to you. (If there is no Debian Developer close to you, alternative ways to pass the ID check may be permitted as an absolute exception on a case-by-case-basis. See the <ulink url="&url-newmaint-id;">identification page</ulink> for more information.)
de: Für die Registrierung ist es erforderlich, dass Sie mit der Debian-Philosophie und der technischen Dokumentation vertraut sind. Weiterhin benötigen Sie einen GnuPG-Schlüssel, der von einem existierenden Debian-Betreuer signiert wurde. Falls Ihr GnuPG-Schlüssel noch nicht signiert wurde, sollten Sie versuchen einen Debian-Entwickler persönlich zu treffen, damit Ihr Schlüssel signiert wird. Es gibt eine <ulink url="&url-gpg-coord;">GnuPG Key Signing Coordination page</ulink>, die Ihnen helfen sollte, einen Debian-Entwickler in Ihrer Nähe zu finden. (Falls es in Ihrer Nähe keinen Debian-Entwickler gibt, können als absolute Ausnahme fallspezifisch alternative Identitätsprüfungen erlaubt werden. Lesen Sie die Texte zur <ulink url="&url-newmaint-id;">Identitätsprüfung</ulink>, um weitere Informationen zu erhalten.
fr: Pour votre candidature, vous devrez être familiarisé avec la philosophie du projet Debian et avec sa documentation technique. Il vous faudra aussi une clé GnuPG signée par un responsable Debian. Si votre clé GnuPG n'est pas encore signée, vous devriez essayer de rencontrer un responsable Debian pour le faire. La <ulink url="&url-gpg-coord;">page de coordination des signatures de clé GnuPG</ulink> devrait aider à trouver un responsable Debian près de chez vous. (S'il n'y a pas de responsable près de chez vous, il peut y avoir des moyens alternatifs pour valider votre identité en tant qu'exception absolue étudiée au cas par cas. Reportez-vous à la <ulink url="&url-newmaint-id;">page d'identification</ulink> pour en savoir plus.)
ja: 登録に際しては Debian の考え方と技術文書を充分理解している必要があります。さらに、既存のメンテナに署名をしてもらった GnuPG 鍵が必要です。まだ GnuPG 鍵に署名してもらっていない場合は、あなたの鍵に署名してくれる Debian 開発者に会いましょう。<ulink url="&url-gpg-coord;">GnuPG Key Signing Coordination page</ulink> が近くの Debian 開発者を探す手助けとなるでしょう。(近くに Debian 開発者がいない場合は、ID チェックを通過する別の方法としてケースバイケースで例外処理として扱うことも可能です。詳細については <ulink url="&url-newmaint-id;">身分証明のページ</ulink> を参照してください)。

source: If you do not have an OpenPGP key yet, generate one. Every developer needs an OpenPGP key in order to sign and verify package uploads. You should read the manual for the software you are using, since it has much important information which is critical to its security. Many more security failures are due to human error than to software failure or high-powered spy techniques. See <xref linkend="key-maint"/> for more information on maintaining your public key.
de: Falls Sie noch keinen OpenPGP-Schlüssel haben, generieren Sie sich einen. Jeder Entwickler benötigt einen OpenPGP-Schlüssel, um das Hochladen von Paketen zu signieren und zu prüfen. Sie sollten das Handbuch der Software lesen, die Sie benutzen, da es wichtige Informationen enthält, was für die Sicherheit kritisch ist. Es sind viel mehr Sicherheitslücken auf menschliche Fehler zurückzuführen, als auf Softwarefehler oder leistungsstarke Spionagetechniken. Lesen Sie <xref linkend="key-maint"/>, um weitere Informationen über die Verwaltung öffentlicher Schlüssel zu erhalten.
fr: Si vous n'avez pas de clé OpenPGP, créez-la. Tout responsable a besoin d'une clé OpenPGP pour signer et vérifier les mises à jour de paquets. Vous lirez la documentation du logiciel de cryptographie que vous utiliserez car elle contient des informations indispensables pour la sécurité de votre clé. Les défaillances de sécurité sont bien plus souvent dues à des erreurs humaines qu'à des problèmes logiciels ou à des techniques d'espionnage avancées. Voir <xref linkend="key-maint"/> pour plus d'informations sur la gestion de votre clé publique.
ja: OpenPGP 鍵をまだ持っていない場合は生成してください。全ての開発者がパッケージをアップロードする際に署名と確認の為に OpenPGP 鍵を必要とします。必ず、使っているソフトのマニュアルを読んでおいてください。何故ならば、セキュリティに直結している重要な情報を含んでいるからです。多くのセキュリティ事故は、殆どがソフトウェアの問題や高度なスパイテクニックではなく、人間が犯すミスや勘違いによるものです。公開鍵の管理についての詳細は <xref linkend="key-maint"/> を参照してください。

source: Debian uses the <literal>GNU Privacy Guard</literal> (package <systemitem role="package">gnupg</systemitem> version 1 or better) as its baseline standard. You can use some other implementation of OpenPGP as well. Note that OpenPGP is an open standard based on <ulink url="&url-rfc2440;">RFC 2440</ulink>.
de: Debian benutzt den <literal>GNU Privacy Guard</literal> (Paket <systemitem role="package">gnupg</systemitem> Version 1 oder besser) als grundlegenden Standard. Sie können auch einige andere Implementierungen von OpenPGP benutzen. Beachten Sie, dass OpenPGP ein offener Standard ist, der auf <ulink url="&url-rfc2440;">RFC 2440</ulink> basiert.
fr: Debian utilise <literal>GNU Privacy Guard</literal> (paquet <systemitem role="package">gnupg</systemitem> version 1 ou supérieure) comme standard de base. Vous pouvez aussi utiliser une autre implémentation d'OpenPGP. OpenPGP est un standard ouvert basé sur la <ulink url="&url-rfc2440;">RFC 2440</ulink>.
ja: Debian では <literal>GNU Privacy Guard</literal> (<systemitem role="package">gnupg</systemitem> パッケージ、バージョン 1 以降) を標準として利用しています。他の OpenPGP 実装も同様に利用できます。OpenPGP は <ulink url="&url-rfc2440;">RFC 2440</ulink> に準拠したオープン標準です。

source: Version 4 keys are keys conforming to the OpenPGP standard as defined in RFC 2440. Version 4 is the key type that has always been created when using GnuPG. PGP versions since 5.x also could create v4 keys, the other choice having been pgp 2.6.x compatible v3 keys (also called legacy RSA by PGP).
de: Schlüssel der Version 4 folgen dem in RFC 2440 definierten OpenPGP-Standard. Bei Verwendung von GnuPG wurden immer Version-4-Schlüssel erstellt. PGP-Versionen seit 5.x könnten außerdem Schlüssel der Version 4 erstellen, die andere Wahl waren PGP 2.6.x-kompatible Schlüssel der Version 3 (auch altes RSA durch PGP genannt).
fr: Les clés en version 4 sont conformes au standard OpenPGP défini dans la RFC 2440. La version 4 est le type de clé qui a toujours été créé avec GnuPG. Les versions de PGP depuis la version 5.x peuvent également créer des clés version 4, l'autre choix ayant été des clés compatibles pgp 2.6.x (également appelées « legacy RSA » par PGP).
ja: バージョン 4 の鍵は、RFC 2440 で規定されているように OpenPGP 標準に適合します。GnuPG を使って鍵を作ると、鍵のタイプは常にバージョン 4 になります。PGP はバージョン 5.x からバージョン 4 の鍵を作ることもできるようになっています。別の選択肢としては、v3 の鍵 (PGP ではレガシー RSA とも呼ばれます) と互換性のある pgp 2.6.x になります。

source: Version 4 (primary) keys can either use the RSA or the DSA algorithms, so this has nothing to do with GnuPG's question about which kind of key do you want: (1) DSA and Elgamal, (2) DSA (sign only), (5) RSA (sign only). If you don't have any special requirements just pick the default.
de: (Primär-) Schlüssel der Version 4 können entweder die RSA- oder DSA-Algorithmen benutzen. Das hat dies nichts mit der Frage von GnuPG zu tun, welche Schlüsselart Sie möchten: (1) DSA und Elgamal, (2) DSA (nur signieren), (5) RSA (nur signieren). Falls Sie keine besonderen Anforderungen haben, nehmen Sie ruhig die Voreinstellung.
fr: Les clés (primaires) en version 4 peuvent soit utiliser l'algorithme RSA, soit l'algorithme DSA, cela n'a donc rien à voir avec la question de GnuPG à propos de la question du type de clé que vous désirez : (1) DSA et Elgamal, (2) DSA (signature seule), (5) RSA (signature seule). Si vous n'avez pas des besoin spécifiques, choisissez simplement la valeur par défaut.
ja: バージョン 4 (primary) 鍵は RSA アルゴリズムか DSA アルゴリズムのどちらでも利用できます。つまり、GnuPG が (1) DSA and Elgamal, (2) DSA (sign only), (5) RSA (sign only) の中からどの種類の鍵を使いたいか質問してきても何も迷うことはありません。特別な理由がない限りは単にデフォルトを選んでください。

source: The easiest way to tell whether an existing key is a v4 key or a v3 (or v2) key is to look at the fingerprint: Fingerprints of version 4 keys are the SHA-1 hash of some key material, so they are 40 hex digits, usually grouped in blocks of 4. Fingerprints of older key format versions used MD5 and are generally shown in blocks of 2 hex digits. For example if your fingerprint looks like <literal>5B00 C96D 5D54 AEE1 206B AF84 DE7A AF6E 94C0 9C7F</literal> then it's a v4 key.
de: Die einfachste Möglichkeit festzustellen, ob ein existierender Schlüssel Version 3 oder 4 (oder 2) hat, besteht darin auf den Fingerabdruck zu untersuchen: Fingerabdrücke der Version 4 sind der SHA-1-Hash von einigem Schlüsselmaterial. Daher besteht er aus 40 hexadezimale Ziffern, die üblicherweise in Viererblöcken gruppiert sind. Fingerabdrücke älterer Schlüsselformatversionen benutzten MD5 und werden generell als Blöcke zweier hexadezimaler Ziffern angezeigt. Falls Ihr Fingerabdruck zum Beispiel so aussieht wie <literal>5B00 C96D 5D54 AEE1 206B AF84 DE7A AF6E 94C0 9C7F</literal>, dann ist es ein Schlüssel der Version 4.
fr: Le moyen le plus simple de dire si une clé existante est une clé v4 ou une clé v3 (ou v2) est de regarder son empreinte : les empreintes des clés en version 4 sont des sommes de contrôle SHA-1 d'une partie de la clé, il s'agit donc d'une suite de 40 chiffres hexadécimaux, habituellement groupés par blocs de quatre. Les empreintes des anciennes versions de clé utilisaient MD5 et sont généralement affichées par blocs de 2 chiffres hexadécimaux. Par exemple, si votre empreinte ressemble à <literal>5B00 C96D 5D54 AEE1 206B AF84 DE7A AF6E 94C0 9C7F</literal> alors il s'agit d'une clé v4.
ja: 今ある鍵が v4 の鍵なのか v3 (あるいは v2) の鍵なのかを判断するもっとも簡単な方法はフィンガープリントを見ることです。バージョン 4 鍵のフィンガープリントは、鍵要素の一部を SHA-1 ハッシュにしたもので、通常 4 文字ごとに区切られた 40 文字の 16 進数になります。古いバージョンの鍵形式では、フィンガープリントは MD5 を使っており、2 文字ごとに区切られた 16 進数で表示されます。例えば、あなたのフィンガープリントが <literal>5B00 C96D 5D54 AEE1 206B AF84 DE7A AF6E 94C0 9C7F</literal> のようになっている場合は、v4 鍵です。

source: Another possibility is to pipe the key into <command>pgpdump</command>, which will say something like Public Key Packet - Ver 4.
de: Eine andere Möglichkeit besteht darin, den Schlüssel über eine Pipe an <command>pgpdump</command> zu leiten, das dann etwas wie »Public Key Packet - Ver 4.« ausgibt.
fr: Une autre possibilité est d'envoyer la clé dans <command>pgpdump</command>, qui dira quelque chose comme « Public Key Packet - Ver 4 ».
ja: 別のやり方として、鍵をパイプで <command>pgpdump</command> に渡して Public Key Packet - Ver 4 のような出力を得るという方法もあります。

source: Also note that your key must be self-signed (i.e. it has to sign all its own user IDs; this prevents user ID tampering). All modern OpenPGP software does that automatically, but if you have an older key you may have to manually add those signatures.
de: Beachten Sie außerdem, dass Ihr Schlüssel selbstsigniert sein muss (d.h. er muss für alle eigenen Benutzer-IDs signiert werden. Dies verhindert eine Manipulation von Benutzer-IDs). Sämtliche modernen OpenPGP-Programme erledigen dies automatisch. Falls Sie aber einen älteren Schlüssel haben, müssen Sie diese Signaturen manuell hinzufügen.
fr: Remarquez également que votre clé doit être auto-signée (c'est-à-dire qu'elle doit signer tous ses propres identifiants d'utilisateur ; cela empêche la falsification d'identité). Tous les logiciels OpenPGP modernes font cela automatiquement, mais si vous avez une ancienne clé, il se peut que vous deviez ajouter manuellement ces signatures.
ja: もちろん、鍵が自己署名されている必要があります (つまり、全ての鍵は所有者の ID によって署名されている必要があります。これによって、ユーザ ID の偽造 (タンパリング) を防いでいます)。最近の OpenPGP ソフトウェアは皆これを自動的に行いますが、古い鍵を持っているような場合は自分でこの署名を追加する必要があるでしょう。

source: You need a version 4 key for use in Debian Development. <ulink url="http://lists.debian.org/20090520092534.GG22906@earth.li">Your key length must be greater than 1024 bits</ulink>; there is no reason to use a smaller key, and doing so would be much less secure.<placeholder type="footnote" id="0"/>
de: Für die Debian-Entwicklung benötigen Sie einen Schlüssel der Version 4. <ulink url="http://lists.debian.org/20090520092534.GG22906@earth.li">Ihr Schlüssel muss mindestens 1024 Bit lang sein.</ulink> Es gibt keinen Grund, einen kürzeren Schlüssel zu verwenden und dies wäre auch wesentlich unsicherer.<placeholder type="footnote" id="0"/>
fr: Vous avez besoin d'une clé en version 4 à utiliser pour le développement Debian. <ulink url="http://lists.debian.org/20090520092534.GG22906@earth.li">La longueur de votre clé doit être plus grande que 1024 bits</ulink> ; il n'y a pas de raison d'utiliser une clé plus petite et faire cela serait bien moins sûr.<placeholder type="footnote" id="0"/>
ja: Debian での開発においては、バージョン 4 の鍵の利用が求められます。<ulink url="http://lists.debian.org/20090520092534.GG22906@earth.li">鍵の長さは少なくとも 1024 ビットが必要です</ulink>。それより短い鍵を利用する理由は何もありませんし、使った場合はあまり安全ではなくなります。<placeholder type="footnote" id="0"/>

source: If your public key isn't on a public key server such as &pgp-keyserv;, please read the documentation available at <ulink url="&url-newmaint-id;">NM Step 2: Identification</ulink>. That document contains instructions on how to put your key on the public key servers. The New Maintainer Group will put your public key on the servers if it isn't already there.
de: Falls Ihr öffentlicher Schlüssel nicht auf einem öffentlichen Server wie &pgp-keyserv; liegt, lesen Sie bitte <ulink url="&url-newmaint-id;">NM Schritt 2: Identitätsprüfung</ulink>. Dieses Dokument enthält Anweisungen, wie Sie Ihren Schlüssel auf öffentliche Schlüsselserver ablegen. Die »New Maintainer Group« wird Ihren öffentlichen Schlüssel auf den Servern ablegen, wenn er nicht bereits dort ist.
fr: Si votre clé publique n'est pas sur un serveur public tel que &pgp-keyserv;, reportez-vous à la documentation disponible à <ulink url="&url-newmaint-id;">Étape 2 : Vérification d'identité</ulink>. Cette documentation explique comment placer votre clé publique sur un serveur. L'équipe en charge des nouveaux responsables placera votre clé publique sur les serveurs de clés si elle n'y est pas déjà.
ja: あなたの公開鍵が &pgp-keyserv; などの公開鍵サーバにない場合は、<ulink url="&url-newmaint-id;">新規メンテナ 手順 2: 身分証明</ulink> にあるドキュメントを読んでください。このドキュメントにはどうやって公開鍵サーバに鍵を登録するのかが記載されています。新規メンテナグループは、まだ登録されていない場合はあなたの公開鍵をサーバに登録します。

source: Some countries restrict the use of cryptographic software by their citizens. This need not impede one's activities as a Debian package maintainer however, as it may be perfectly legal to use cryptographic products for authentication, rather than encryption purposes. If you live in a country where use of cryptography even for authentication is forbidden then please contact us so we can make special arrangements.
de: Einige Länder schränken den Gebrauch kryptografischer Software durch Ihre Bürger ein. Dies muss jedoch die Aktivitäten als Debian-Paketbetreuer nicht behindern, da es vollkommen legal sein kann, kryptografische Produkte für die Authentifizierung anstatt für Verschlüsselungszwecke zu verwenden. Wenn Sie in einem Land leben, in dem Kryptografie sogar für Authentifizierung verboten ist, so kontaktieren Sie bitte Debian, so dass besondere Vereinbarungen getroffen werden können.
fr: Certains pays limitent l'usage des logiciels de cryptographie. Cela ne devrait cependant pas avoir d'impact sur l'activité d'un responsable de paquet car il peut être tout à fait légal d'utiliser des logiciels de cryptographie pour l'authentification plutôt que pour le chiffrement. Si vous vivez dans un pays où l'utilisation de la cryptographie pour authentification est interdite, contactez-nous pour que nous prenions des dispositions particulières.
ja: 幾つかの国では、一般市民の暗号関連ソフトウェアの使用について制限をかけています。しかし、このことは暗号関連ソフトウェアを暗号化ではなく認証に利用する際には完全に合法であるような場合には、Debian パッケージメンテナとしての活動を妨げることにはなりません。あなたが認証目的にすら暗号技術の利用が制限される国に住んでいる、と言う場合は、我々に連絡をしていただければ特別な措置を講じることができます。

source: To apply as a new maintainer, you need an existing Debian Developer to support your application (an <literal>advocate</literal>). After you have contributed to Debian for a while, and you want to apply to become a registered developer, an existing developer with whom you have worked over the past months has to express their belief that you can contribute to Debian successfully.
de: Um sich als neuer Betreuer zu bewerben, benötigen Sie die Fürsprache eines existierenden Debian-Entwicklers, der Ihre Bewerbung unterstützt (einen <literal>advocate</literal>). Nachdem Sie eine Weile zu Debian beigetragen haben und Sie sich als ein registrierter Entwickler bewerben, benötigen Sie die Fürsprache eines existierenden Entwicklers, mit dem Sie während der letzten Monate zusammengearbeitet haben. Dieser muss sein Vertrauen kundtun, dass Sie erfolgreich zu Debian beitragen können.
fr: Pour faire acte de candidature, il vous faut un responsable Debian qui soutiendra votre candidature (un intercesseur ou « <literal>advocate</literal> » en anglais). Après avoir contribué au projet Debian pendant un temps, quand vous choisissez de devenir un responsable Debian officiel, un responsable déjà enregistré avec qui vous aurez travaillé dans les derniers mois devra exprimer que, d'après lui, vous pouvez contribuer avec succès au projet Debian.
ja: 新規メンテナの応募をするのであれば、既存の Debian 開発者にあなたの応募をサポートしてもらう (<literal>支持者 (Advocate)</literal> になってもらう) 必要があります。ある程度の期間 Debian に対して貢献を行った後で、登録された開発者になるために応募をしたい場合、過去何ヶ月かに渡って一緒に作業をした既存の開発者に、あなたが Debian に間違いなく貢献できることを信じている旨を表明してもらう必要があります。
