Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: Review and test your changes as much as possible. Check the differences from the previous version repeatedly (<command>interdiff</command> from the <systemitem role="package">patchutils</systemitem> package and <command>debdiff</command> from <systemitem role="package">devscripts</systemitem> are useful tools for this, see <xref linkend="debdiff"/>).
de: Überprüfen und testen Sie Ihre Änderungen so ausgiebig wie möglich. Prüfen Sie die Unterschiede zur vorherigen Version mehrmals (<command>interdiff</command> aus dem Paket <systemitem role="package">patchutils</systemitem> und <command>debdiff</command> aus <systemitem role="package">devscripts</systemitem> sind nützlich Werkzeuge dafür, siehe <xref linkend="debdiff"/>).
fr: Examinez et testez autant que possible vos changements. Vérifiez les différences avec la version précédente de manière répétée (<command>interdiff</command> du paquet <systemitem role="package">patchutils</systemitem> et <command>debdiff</command> du paquet <systemitem role="package">devscripts</systemitem> sont des outils pratiques pour cela, voir <xref linkend="debdiff"/>).
ja: 変更点を可能な限り見直してください。以前のバージョンとの変更点を繰り返し確認してください (これには <systemitem role="package">patchutils</systemitem> パッケージの <command>interdiff</command> や <systemitem role="package">devscripts</systemitem> の <command>debdiff</command> が役立ちます。<xref linkend="debdiff"/> を参照してください)。

source: Be sure to verify the following items:
de: Überprüfen Sie unbedingt folgende Elemente:
fr: Assurez-vous de garder les points suivants à l'esprit :
ja: 以下の項目を必ず確認してください

source: <emphasis role="strong">Target the right distribution</emphasis> in your <filename>debian/changelog</filename>. For <literal>stable</literal> this is <literal>stable-security</literal> and for <literal>testing</literal> this is <literal>testing-security</literal>, and for the previous stable release, this is <literal>oldstable-security</literal>. Do not target <replaceable>distribution</replaceable><literal>-proposed-updates</literal> or <literal>stable</literal>!
fr: <emphasis role="strong">ciblez la bonne distribution</emphasis> dans votre fichier <filename>debian/changelog</filename>. Pour <literal>stable</literal> il s'agit de <literal>stable-security</literal>, pour <literal>testing</literal> il s'agit de <literal>testing-security</literal>, et pour l'ancienne distribution stable, il s'agit de <literal>oldstable-security</literal>. Ne ciblez ni <replaceable>distribution</replaceable><literal>-proposed-updates</literal>, ni <literal>stable</literal> !
ja: <filename>debian/changelog</filename> で <emphasis role="strong">正しいディストリビューションを対象にする</emphasis>。<literal>安定版 (stable)</literal> の場合、これは <literal>stable-security</literal> になり、<literal>テスト版 (testing)</literal> の場合は <literal>testing-security</literal> に、そして以前の安定版リリースへの場合は <literal>oldstable-security</literal> となります。<replaceable>distribution</replaceable><literal>-proposed-updates</literal> や <literal>stable</literal> を対象にしないでください!

source: The upload should have <emphasis role="strong">urgency=high</emphasis>.
de: Der Upload sollte die <emphasis role="strong">urgency=high</emphasis> haben.
fr: l'envoi devra être fait avec <emphasis role="strong">urgency=high</emphasis> ;
ja: アップロードは <emphasis role="strong">urgency=high</emphasis> で行う必要があります。

source: Make descriptive, meaningful changelog entries. Others will rely on them to determine whether a particular bug was fixed. Add <literal>closes:</literal> statements for any <emphasis role="strong">Debian bugs</emphasis> filed. Always include an external reference, preferably a <emphasis role="strong">CVE identifier</emphasis>, so that it can be cross-referenced. However, if a CVE identifier has not yet been assigned, do not wait for it but continue the process. The identifier can be cross-referenced later.
de: Verfassen Sie anschauliche, aussagekräftige Änderungsprotokolleinträge. Andere werden sich darauf verlassen, um zu bestimmen, ob ein bestimmter Fehler behoben wurde. Fügen Sie für alle eingereichten <emphasis role="strong">Debian-Fehler</emphasis> <literal>closes:</literal>-Angaben hinzu. Beziehen Sie immer einen externen Bezug ein, vorzugsweise einen <emphasis role="strong">CVE-Bezeichner</emphasis>, so dass Querverweise darauf möglich sind. Wenn ein CVE-Bezeichner jedoch noch nicht zugewiesen wurde, warten Sie nicht darauf, fahren Sie aber mit dem Prozess fort. Ein späterer Querverweis auf den Bezeichner ist möglich.
fr: fournissez des entrées de <filename>changelog</filename> descriptives et complètes. D'autres personnes se baseront dessus pour déterminer si un bogue particulier a été corrigé. Déclarez <literal>closes:</literal> pour tout <emphasis role="strong">bogue Debian</emphasis>. Intégrez toujours une référence externe, de préférence un <emphasis role="strong">identifiant CVE</emphasis>, pour qu'elle puisse être recoupée. Néanmoins, si aucun identifiant CVE n'a encore été assigné, ne l'attendez pas et continuez le processus. L'identifiant pourra être référencé plus tard ;
ja: 説明が十分にされている、意味がある changelog エントリを書くこと。他の人は、これらを元に特定のバグが修正されているのかを見つけ出します。登録されている <emphasis role="strong">Debian バグ</emphasis> に対して <literal>closes:</literal> 行を追加すること。外部のリファレンス、できれば <emphasis role="strong">CVE 識別番号</emphasis> を常に含めること、そうすれば相互参照が可能になります。しかし、CVE 識別番号がまだ付与されていない場合には、それを待たずに作業を進めてください。識別番号は後ほど付与することができます。

source: Make sure the <emphasis role="strong">version number</emphasis> is proper. It must be greater than the current package, but less than package versions in later distributions. If in doubt, test it with <literal>dpkg --compare-versions</literal>. Be careful not to re-use a version number that you have already used for a previous upload, or one that conflicts with a binNMU. The convention is to append <literal>+</literal><replaceable>codename</replaceable><literal>1</literal>, e.g. <literal>1:2.4.3-4+lenny1</literal>, of course increasing 1 for any subsequent uploads.
de: Stellen Sie sicher, dass die <emphasis role="strong">Versionsnummer</emphasis> angemessen ist. Sie muss größer als die des aktuellen Pakets, aber kleiner als die von Paketversionen in neueren Distributionen sein. Falls es Zweifel gibt, prüfen Sie es mit <literal>dpkg --compare-versions</literal>. Seien Sie vorsichtig, dass Sie keine Versionsnummer wiederverwenden, die Sie für einen vorherigen Upload benutzt haben oder eine, die Konflikte mit einem binNMU auslöst. Es ist Brauch <literal>+</literal><replaceable>Codename</replaceable><literal>1</literal> anzuhängen, z.B. <literal>1:2.4.3-4+lenny1</literal> und natürlich bei nachfolgenden Uploads um eins zu erhöhen.
fr: assurez-vous que le <emphasis role="strong">numéro de version</emphasis> est correct. Il doit être plus élevé que celui du paquet actuel, mais moins que celui des paquets des distributions suivantes. En cas de doute, testez-le avec <literal>dpkg --compare-versions</literal>. Soyez attentif à ne pas réutiliser un numéro de version déjà utilisé pour un précédent envoi, ou qui entrerait en conflit avec une mise à jour indépendante binaire (<literal>binNMU</literal>). Par convention, ajoutez <literal>+</literal><replaceable>nomdecode</replaceable><literal>1</literal>, par exemple <literal>1:2.4.3-4+lenny1</literal>, bien sûr, incrémentez le nombre qui suit le nom de code (1 ici) lors des mises à jour suivantes ;
ja: <emphasis role="strong">バージョン番号</emphasis>が正しいことを確認する。現在のパッケージより大きく、しかし以降のディストリビューションよりパッケージバージョンが小さい必要があります。分からない場合は <literal>dpkg --compare-versions</literal> でテストしてください。以前のアップロードで既に使っているバージョン番号を再利用しないように注意してください。そうしないと番号が binNMU と衝突します。<literal>+</literal><replaceable>codename</replaceable><literal>1</literal> を追加するのが通例です。例えば <literal>1:2.4.3-4+lenny1</literal> とします。もちろん 1 はアップロードするごとに増やします。

source: Unless the upstream source has been uploaded to <literal>security.debian.org</literal> before (by a previous security update), build the upload <emphasis role="strong">with full upstream source</emphasis> (<literal>dpkg-buildpackage -sa</literal>). If there has been a previous upload to <literal>security.debian.org</literal> with the same upstream version, you may upload without upstream source (<literal>dpkg-buildpackage -sd</literal>).
de: Sofern die Originalquelle nicht vorher nach <literal>security.debian.org</literal> hochgeladen wurde, (durch eine vorhergehende Sicherheitsaktualisierung) erstellen Sie den Upload <emphasis role="strong">aus vollständigen Originalquellen</emphasis> (<literal>dpkg-buildpackage -sa</literal>). Falls es einen vorhergehenden Upload nach <literal>security.debian.org</literal> mit der gleichen Originalversion gab, könnten Sie ohne die Originalquelle hochladen (<literal>dpkg-buildpackage -sd</literal>).
fr: à moins que l'archive sources amont n'ait déjà été envoyée à <literal>security.debian.org</literal> (lors d'une précédente mise à jour de sécurité), construisez le paquet en incluant l'archive <emphasis role="strong">source amont complète</emphasis> (<literal>dpkg-buildpackage -sa</literal>). Si l'archive source amont a déjà été envoyée à <literal>security.debian.org</literal>, vous pouvez préparer le paquet en l'excluant (<literal>dpkg-buildpackage -sd</literal>).
ja: これまでに (以前のセキュリティ更新によって) <literal>security.debian.org</literal> へ開発元のソースコードをアップロードしていなければ、<emphasis role="strong">開発元のソースコードを全て含めて</emphasis>アップロードするパッケージをビルドする (<literal>dpkg-buildpackage -sa</literal>)。以前、同じ開発元のバージョンで <literal>security.debian.org</literal> にアップロードしたことがある場合は、開発元のソースコード無しでアップロードしても構いません (<literal>dpkg-buildpackage -sd</literal>)。

source: Be sure to use the <emphasis role="strong">exact same <filename>*.orig.tar.{gz,bz2,xz}</filename></emphasis> as used in the normal archive, otherwise it is not possible to move the security fix into the main archives later.
de: Tragen Sie Sorge, dass die <emphasis role="strong">exakt gleiche <filename>*.orig.tar.{gz,bz2,xz}</filename></emphasis>-Datei, wie im normalen Archiv benutzt wird. Andernfalls ist es nicht möglich, die Sicherheitsfehlerbehebung später in die Hauptarchive zu verschieben.
fr: assurez-vous d'utiliser <emphasis role="strong">exactement le même <filename>*.orig.tar.{gz,bz2,xz}</filename></emphasis> que celui utilisé dans l'archive normale, sinon il ne sera pas possible de déplacer plus tard le correctif de sécurité dans l'archive principale ;
ja: 通常のアーカイブで使われているのと<emphasis role="strong">全く同じ <filename>*.orig.tar.{gz,bz2,xz}</filename></emphasis>を必ず使うようにしてください。さもなくば、後ほどセキュリティ修正を main アーカイブに移動することができません。

source: Build the package on a <emphasis role="strong">clean system</emphasis> which only has packages installed from the distribution you are building for. If you do not have such a system yourself, you can use a debian.org machine (see <xref linkend="server-machines"/>) or setup a chroot (see <xref linkend="pbuilder"/> and <xref linkend="debootstrap"/>).
de: Erstellen Sie das Paket auf einem <emphasis role="strong">einwandfreien System</emphasis>, auf dem nur Pakete der Distribution installiert sind, für die Sie es erstellen. Falls Sie selbst nicht über ein solches System verfügen, können Sie eine debian.org-Maschine verwenden (siehe <xref linkend="server-machines"/>) oder richten Sie ein Chroot ein (siehe <xref linkend="pbuilder"/> und <xref linkend="debootstrap"/>).
fr: compilez le paquet sur un <emphasis role="strong">système propre</emphasis>, où tous les paquets appartiennent à la distribution pour laquelle vous construisez le paquet. Si vous ne disposez pas un tel système, vous pouvez utiliser l'une des machines de debian.org (voir <xref linkend="server-machines"/>) ou mettre en place un chroot (voir <xref linkend="pbuilder"/> et <xref linkend="debootstrap"/>).
ja: ビルドを行っているディストリビューションからインストールしたパッケージだけが含まれている<emphasis role="strong">クリーンなシステム上で</emphasis>パッケージをビルドしてください。その様なシステムを自分で持っていない場合は、debian.org マシン (<xref linkend="server-machines"/> を参照してください) を使うこともできますし、chroot を設定することもできます (<xref linkend="pbuilder"/> と <xref linkend="debootstrap"/> を参照してください)。

source: Uploading the fixed package
de: Hochladen eines reparierten Pakets
fr: Mise à jour du paquet corrigé
ja: 修正したパッケージをアップロードする

source: Do <emphasis role="strong">NOT</emphasis> upload a package to the security upload queue (<literal>oldstable-security</literal>, <literal>stable-security</literal>, etc.) without prior authorization from the security team. If the package does not exactly meet the team's requirements, it will cause many problems and delays in dealing with the unwanted upload.
fr: Vous ne devez <emphasis role="strong">jamais</emphasis> envoyer un paquet dans la file d'attente des envois de sécurité (<literal>oldstable-security</literal>, <literal>stable-security</literal>, etc.) sans l'accord préalable de l'équipe de sécurité. Si le paquet ne remplit pas exactement les exigences de l'équipe, il causera beaucoup de problèmes, ainsi que des retards dans la gestion de l'envoi indésirable.
ja: セキュリティアップロードキュー (<literal>oldstable-security</literal>、<literal>stable-security </literal> 等) には、セキュリティチームからの事前許可無しにパッケージを<emphasis role="strong">アップロードしないでください</emphasis>。パッケージがチームの要求に完全に合致していない場合、望まれないアップロードに対処するために多くの問題が引き起こされたり遅延が生じることになります。詳細については <xref linkend="bug-security"/> を参照してください。

source: Do <emphasis role="strong">NOT</emphasis> upload your fix to <literal>proposed-updates</literal> without coordinating with the security team. Packages from <literal>security.debian.org</literal> will be copied into the <literal>proposed-updates</literal> directory automatically. If a package with the same or a higher version number is already installed into the archive, the security update will be rejected by the archive system. That way, the stable distribution will end up without a security update for this package instead.
de: Laden Sie ihre Fehlerbehebung <emphasis role="strong">NICHT</emphasis> nach <literal>proposed-updates</literal> ohne Abstimmung mit dem Sicherheits-Team hoch. Pakete von <literal>security.debian.org</literal> werden automatisch direkt in das Verzeichnis <literal>proposed-updates</literal> kopiert. Falls bereits ein Paket mit der gleichen oder einer höheren Versionsnummer im Archiv installiert ist, wird die Sicherheitsaktualisierung durch das Archivsystem abgelehnt. Stattdessen endet auf diese Weise die Distribution Stable ohne eine Sicherheitsaktualisierung für dieses Paket.
fr: Vous ne devez <emphasis role="strong">jamais</emphasis> envoyer votre correction dans <literal>proposed-updates</literal> sans vous coordonner avec l'équipe de sécurité. Les paquets seront copiés de <literal>security.debian.org</literal> au répertoire <literal>proposed-updates</literal> automatiquement. Si un paquet avec le même numéro de version ou un numéro plus grand est déjà installé dans l'archive, la mise à jour de sécurité sera rejetée par le système d'archive. Ainsi, la distribution <literal>stable</literal> se retrouvera plutôt sans la mise à jour de sécurité de ce paquet.
ja: セキュリティチームと調整する事無しに <literal>proposed-updates</literal> へ修正したものをアップロード<emphasis role="strong">しない</emphasis>ようにしてください。<literal>security.debian.org</literal> からパッケージは <literal>proposed-updates</literal> ディレクトリに自動的にコピーされます。アーカイブに同じ、あるいはより高いバージョン番号のものが既にインストールされている場合は、セキュリティアップデートはアーカイブシステムに reject されます。そうすると、安定版ディストリビューションはこのパッケージに対するセキュリティ更新無しで終了してしまうでしょう。

source: Once you have created and tested the new package and it has been approved by the security team, it needs to be uploaded so that it can be installed in the archives. For security uploads, the place to upload to is <literal>ftp://security-master.debian.org/pub/SecurityUploadQueue/</literal>.
de: Sobald Sie das neue Paket erstellt und getestet haben und es vom Sicherheits-Team zugelassen wurde, muss es hochgeladen werden, so dass es in den Archiven installiert werden kann. Sicherheits-Uploads werden nach <literal>ftp://security-master.debian.org/pub/SecurityUploadQueue/</literal> hochgeladen.
fr: Une fois le nouveau paquet créé et testé, et qu'il a été approuvé par l'équipe de sécurité, il doit être envoyé pour être installé dans les archives. Pour les envois de sécurité, l'adresse d'envoi est <literal>ftp://security-master.debian.org/pub/SecurityUploadQueue/</literal>.
ja: 一旦、新しいパッケージを作成してテストし、セキュリティチームによって許可を受けたら、アーカイブへインストールできるようにするためにアップロードをする必要があります。セキュリティに関するアップロードの場合、アップロード先は <literal>ftp://security-master.debian.org/pub/SecurityUploadQueue/</literal> になります。

source: Once an upload to the security queue has been accepted, the package will automatically be built for all architectures and stored for verification by the security team.
de: Sobald ein Upload in die Sicherheitheitswarteschlange akzeptiert wurde, wird das Paket automatisch für alle Architekturen erstellt und zur Überprüfung durch das Sicherheits-Team gespeichert.
fr: Une fois l'envoi vers la file d'attente de sécurité accepté, le paquet sera automatiquement recompilé pour toutes les architectures et stocké pour vérification par l'équipe de sécurité.
ja: セキュリティキューへアップロードしたものが許可されると、パッケージは自動的にすべてのアーキテクチャに対してビルドされ、セキュリティチームによる確認の為に保存されます。

source: Uploads which are waiting for acceptance or verification are only accessible by the security team. This is necessary since there might be fixes for security problems that cannot be disclosed yet.
de: Auf Uploads, die auf Zustimmung oder Prüfung warten, kann nur das Sicherheits-Team zugreifen. Dies ist nötig, da es sich um Fehlerbehebungen für Sicherheitsprobleme handeln könnte, die noch nicht offengelegt werden können.
fr: Les envois en attente d'acceptation ou de vérification ne sont accessibles que par l'équipe de sécurité. C'est obligatoire car il pourrait y avoir des correctifs pour des problèmes de sécurité qui ne peuvent pas encore être diffusés.
ja: 許可、あるいは確認を待っているアップロードには、セキュリティチームのみがアクセスできます。これは、まだ公開できないセキュリティ問題の修正があるかも知れないためです。

source: If a member of the security team accepts a package, it will be installed on <literal>security.debian.org</literal> as well as proposed for the proper <replaceable>distribution</replaceable><literal>-proposed-updates</literal> on <literal>&ftp-master-host;</literal>.
de: Falls ein Mitglied des Sicherheits-Teams ein Paket akzeptiert, wird es auf <literal>security.debian.org</literal> installiert. Ebenso wird es für das passende <replaceable>Distribution</replaceable><literal>-proposed-updates</literal> auf <literal>&ftp-master-host;</literal> vorgeschlagen.
fr: Si une personne de l'équipe de sécurité accepte un paquet, il sera installé sur <literal>security.debian.org</literal> et proposé pour le répertoire <replaceable>distribution</replaceable><literal>-proposed-updates</literal> adéquat sur <literal>&ftp-master-host;</literal>.
ja: セキュリティチームのメンバーがパッケージを許可した場合は、proposed パッケージに対する <literal>&ftp-master-host;</literal> 上の適切な <replaceable>distribution</replaceable><literal>-proposed-updates</literal> と同様に <literal>security.debian.org</literal> 上にインストールされます。

source: Some archive manipulation operations are not automated in the Debian upload process. These procedures should be manually followed by maintainers. This chapter gives guidelines on what to do in these cases.
de: Einige Operationen zum Manipulieren von Archiven sind im Debian-Upload-Prozess nicht automatisiert. Diesen Prozeduren sollte manuell durch Paketbetreuer gefolgt werden. Dieses Kapitel gibt einen Leitfaden, was in diesen Fällen zu tun ist.
fr: Certaines manipulations de l'archive ne sont pas possibles avec le processus de mise à jour automatisé. Elles sont effectuées manuellement par les responsables. Cette partie décrit la marche à suivre dans ces situations.
ja: アーカイブの変更作業のいくつかは、Debian のアップロードプロセスでは自動的なものにはなっていません。これらの手続きはメンテナによる手動での作業である必要があります。この章では、この様な場合に何をするかのガイドラインを提供します。

source: Moving packages
de: Pakete verschieben
fr: Déplacement de paquet
ja: パッケージの移動

source: See the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> for guidelines on what section a package belongs in.
de: Einen Leitfaden, in welchen Bereich ein Paket gehört, finden Sie im <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>.
fr: Reportez-vous à la <ulink url="&url-debian-policy;">Charte Debian (« <literal>Debian Policy Manual</literal> »)</ulink> pour savoir dans quelle section un paquet doit être classé.
ja: パッケージがどのセクションに属するかのガイドラインは <ulink url="&url-debian-policy;">Debian ポリシーマニュアル</ulink>を参照してください。

source: Sometimes a package will change its section. For instance, a package from the <literal>non-free</literal> section might be GPL'd in a later version, in which case the package should be moved to `main' or `contrib'.<placeholder type="footnote" id="0"/>
de: Manchmal ändert ein Paket seinen Bereich. Ein Paket aus dem Bereich <literal>non-free</literal> könnte zum Beispiel in einer neueren Version unter der GPL erscheinen. In diesem Fall sollte es nach »main« oder »contrib« verschoben werden.<placeholder type="footnote" id="0"/>
fr: Il arrive parfois qu'un paquet change de section. Un paquet de la section <literal>non-free</literal> pourrait, par exemple, être distribuée sous licence GNU GPL dans une nouvelle version ; dans ce cas, le paquet devrait être déplacé vers la section <literal>main</literal> ou <literal>contrib</literal>.<placeholder type="footnote" id="0"/>
ja: 時折、パッケージは属しているセクションが変わることがあります。例えば「<literal>non-free</literal>」セクションのパッケージが新しいバージョンで GPL になった場合、パッケージは「main」か「contrib」に移動する必要があります。<placeholder type="footnote" id="0"/>

source: If you need to change the section for one of your packages, change the package control information to place the package in the desired section, and re-upload the package (see the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> for details). You must ensure that you include the <filename>.orig.tar.{gz,bz2,xz}</filename> in your upload (even if you are not uploading a new upstream version), or it will not appear in the new section together with the rest of the package. If your new section is valid, it will be moved automatically. If it does not, then contact the ftpmasters in order to understand what happened.
de: Falls Sie für eines Ihrer Pakete den Bereich ändern müssen, ändern Sie die Paketsteuerungsinformation, um das Paket in den gewünschten Bereich zu platzieren und laden Sie das Paket erneut hoch (Einzelheiten finden Sie im <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>). Sie müssen sicherstellen, dass Sie Ihrem Upload die <filename>.orig.tar.{gz,bz2,xz}</filename>-Datei beifügen (sogar, wenn Sie keine neue Originalversion hochladen) sonst es wird nicht zusammen mit dem Rest des Pakets in dem neuen Bereich erscheinen. Falls Ihr neuer Bereich gültig ist, wird es automatisch verschoben. Falls dies nicht geschieht, wenden Sie sich an die Ftpmasters, damit Sie verstehen, was geschehen ist.
fr: Pour changer la section d'un paquet, modifiez les informations de contrôle pour le placer dans la section voulue et envoyez-le à nouveau dans l'archive (voir la <ulink url="&url-debian-policy;">Charte Debian</ulink> pour plus d'informations). Assurez-vous d'inclure le fichier <filename>.orig.tar.{gz,bz2,xz}</filename> dans l'envoi (même si vous n'envoyez pas de nouvelle version amont) sinon il n'apparaîtra pas dans la nouvelle section avec le reste du paquet. Si la nouvelle section est valide, il sera déplacé automatiquement. Si ce n'est pas le cas, contactez les responsables de l'archive (« <literal>ftpmasters</literal> ») pour comprendre ce qui s'est passé.
ja: パッケージのどれかがセクションを変更する必要がある場合、希望するセクションにパッケージを配置するためパッケージの control 情報を変更してから再アップロードします (詳細については <ulink url="&url-debian-policy;">Debian ポリシーマニュアル</ulink>を参照してください)。必ず <filename>.orig.tar.{gz,bz2,xz}</filename> を (開発元のバージョンが新しいものになったのではなくても) アップロードに含める必要があります。新しいセクションが正しい場合は、自動的に移動されます。移動されない場合には、何が起こったのかを理解するために ftpmaster に連絡を取ります。
