Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: In any case, it is a bad idea to automatically put all team members in the <literal>Uploaders</literal> field. It clutters the Developer's Package Overview listing (see <xref linkend="ddpo"/>) with packages one doesn't really care for, and creates a false sense of good maintenance. For the same reason, team members do not need to add themselves to the <literal>Uploaders</literal> field just because they are uploading the package once, they can do a “Team upload” (see <xref linkend="nmu-team-upload"/>). Conversely, it is a bad idea to keep a package with only the mailing list address as a <literal>Maintainer</literal> and no <literal>Uploaders</literal>.
de: Es ist jedenfalls ein schlechter Einfall, automatisch alle Team-Mitglieder in das Feld <literal>Uploaders</literal> einzutragen. Es überfüllt die Paketübersicht des Entwicklers (siehe <xref linkend="ddpo"/>) mit Paketen, um die sich nicht wirklich jemand kümmert und erweckt den falschen Eindruck einer guten Betreuung. Aus dem gleichen Grund müssen sich Team-Mitglieder nicht selbst im Feld <literal>Uploaders</literal> hinzufügen, nur weil sie das Paket einmal hochgeladen haben. Sie können einen Team-Upload durchführen (siehe <xref linkend="nmu-team-upload"/>). Im umgekehrten Fall ist es eine schlechte Idee ein Paket mit nur der Adresse der Mailingliste im Feld <literal>Maintainer</literal> zu behalten und keinen <literal>Uploaders</literal>.
fr: En tout cas, il faut éviter de placer automatiquement tous les membres de l'équipe dans le champ <literal>Uploaders</literal>. Cela encombre la vue d'ensemble des paquets d'un développeur (voir <xref linkend="ddpo"/>) avec des paquets dont il ne s'occupe pas vraiment, et donne la fausse impression d'un bon suivi. De même, les membres de l'équipe n'ont pas besoin de s'ajouter dans le champ <literal>Uploaders</literal> pour faire un envoi ponctuel, ils peuvent le faire en « envoi d'équipe » (voir <xref linkend="nmu-team-upload"/>). En revanche, c'est une mauvaise idée de garder un paquet avec seulement l'adresse de la liste de diffusion dans le champ <literal>Maintainer</literal> et sans <literal>Uploaders</literal>.
ja: どのような場合でも、すべてのチームメンバーを <literal>Uploaders</literal> 欄に入れるのは良くない考えです。これは、Developer's Package Overview の一覧 (<xref linkend="ddpo"/> 参照) を実際には対応していないパッケージで散らかしてしまい、偽りの良いメンテナンス状態を作り出します。同じ理由から、パッケージを一回アップロードするのであれば、「チームアップロード (Team Upload)」ができるので、チームメンバーは <literal>Uploaders</literal> 欄へ自分を追加する必要はありません (<xref linkend="nmu-team-upload"/> 参照)。逆にいえば、<literal>Maintainer</literal> 欄にメーリングリストのアドレスのみで <literal>Uploaders</literal> 欄に誰も追加していないままにしておくのは良くない考えです。

source: The testing distribution
de: Die Distribution Testing
fr: La distribution <literal>testing</literal>
ja: テスト版ディストリビューション

source: Basics
de: Grundlagen
fr: Bases
ja: 基本

source: Packages are usually installed into the <literal>testing</literal> distribution after they have undergone some degree of <literal>testing</literal> in <literal>unstable</literal>.
de: Pakete werden normalerweise in die Distribution Testing installiert, nachdem sie einem gewissen Maß von <literal>testing</literal> in <literal>unstable</literal> unterzogen wurden.
fr: Les paquets sont habituellement installés dans la distribution <literal>testing</literal> après avoir été suffisamment éprouvés dans <literal>unstable</literal>.
ja: 通常、パッケージは<literal>不安定版 (unstable)</literal> での必要ないくつかのテストを潜り抜けた後で、<literal>テスト版ディストリビューション(testing)</literal> にインストールされます。

source: They must be in sync on all architectures and mustn't have dependencies that make them uninstallable; they also have to have generally no known release-critical bugs at the time they're installed into <literal>testing</literal>. This way, <literal>testing</literal> should always be close to being a release candidate. Please see below for details.
de: Sie müssen auf allen Architekturen synchron sein sein und dürfen keine Abhängigkeiten haben, die sie uninstallierbar machen; sie dürfen außerdem zum Zeitpunkt, an dem sie in <literal>testing</literal> installiert werden, keine bekannten release-kritischen Fehler haben. Auf diese Art sollte <literal>testing</literal> immer ein potentieller Release-Kandidat sein. Bitte lesen Sie das Folgende, um weitere Einzelheiten zu erfahren.
fr: Ils doivent être en synchronisation pour toutes les architectures et ne doivent pas avoir de dépendances qui les rendraient non installables ; ils doivent également être exempts de bogue critique pour la publication (« <literal>release-critical</literal> ») au moment où ils sont installés dans <literal>testing</literal>. Ainsi, <literal>testing</literal> devrait toujours être prête à devenir une version candidate pour la publication. Veuillez voir ci-dessous pour les détails.
ja: これらは、すべてのアーキテクチャ上で同期していなければならず、インストールできなくなるような依存関係を持ってはいけません。また、<literal>テスト版 (testing)</literal> にインストールされる際に既知のリリースクリティカルバグを持っていない必要があります。このようにして、<literal>テスト版 (testing)</literal> は常にリリース候補に近いものである必要があります。詳細は以下を参照してください。

source: Updates from unstable
de: Aktualisierungen von Unstable
fr: Mise à jour depuis <literal>unstable</literal>
ja: 不安定版からの更新

source: The scripts that update the <literal>testing</literal> distribution are run twice each day, right after the installation of the updated packages; these scripts are called <literal>britney</literal>. They generate the <filename>Packages</filename> files for the <literal>testing</literal> distribution, but they do so in an intelligent manner; they try to avoid any inconsistency and to use only non-buggy packages.
de: Die Skripte, die die Distribution <literal>testing</literal> aktualisieren, werden zweimal täglich ausgeführt, gleich nach der Installation der aktualisierten Pakete. Diese Skripte werden <literal>britney</literal> genannt. Sie generieren die <filename>Packages</filename>-Dateien für die Distribution <literal>testing</literal>, aber sie tun dies auf eine clevere Art; sie versuchen jede Unstimmigkeit zu vermeiden und nur fehlerfreie Pakete zu benutzen.
fr: Les scripts de mise à jour de la distribution <literal>testing</literal> sont exécutés deux fois par jour, juste après l'installation des paquets mis à jour ; ces scripts sont appelés <literal>britney</literal>. Ils fabriquent les fichiers <filename>Packages</filename> pour la distribution <literal>testing</literal>, mais ils le font d'une manière intelligente pour éviter toute incohérence et essayer de n'utiliser que des paquets sans bogue.
ja: <literal>テスト版 (testing)</literal> ディストリビューションを更新するスクリプトは、日に二回、更新されたパッケージのインストール直後に動作します。これらのスクリプトは <literal>britney</literal> と呼ばれます。これは、<literal>テスト版 (testing)</literal> ディストリビューションに対して <filename>Packages</filename> ファイルを生成しますが、不整合を避けてバグが無いパッケージのみを利用しようとする気の利いたやり方で行います。

source: The inclusion of a package from <literal>unstable</literal> is conditional on the following:
de: Die Aufnahme eines Pakets von <literal>unstable</literal> ist durch Folgendes bedingt:
fr: L'inclusion d'un paquet d'<literal>unstable</literal> est soumise aux conditions suivantes :
ja: <literal>不安定版 (unstable)</literal> からのパッケージの取り込みは以下の条件です:

source: The package must have been available in <literal>unstable</literal> for 2, 5 or 10 days, depending on the urgency (high, medium or low). Please note that the urgency is sticky, meaning that the highest urgency uploaded since the previous <literal>testing</literal> transition is taken into account;
de: Das Paket muss zwei, fünf oder zehn Tage in <literal>unstable</literal> verfügbar gewesen sein, abhängig von der Dringlichkeit (hoch, mittel oder niedrig). Bitte beachten Sie, dass die Dringlichkeit unnachgiebig ist, was bedeutet, dass die höchste Dringlichkeit mit der seit dem letzten Übergang nach <literal>testing</literal> hochgeladen wurde, berücksichtigt wird.
fr: le paquet doit avoir été disponible dans <literal>unstable</literal> depuis deux, cinq ou dix jours selon le champ d'urgence de l'envoi (élevée, moyenne ou basse). Veuillez noter que cette urgence est « collante » (« <literal>sticky</literal> »), ce qui signifie que l'envoi avec l'urgence la plus élevée depuis la précédente transition dans <literal>testing</literal> est prise en compte ;
ja: パッケージは、urgency に応じて (high、medium、low)、2日、5日、10日の間、<literal>不安定版 (unstable)</literal> で利用可能になっていなければいけません。urgency は貼り付くことに注意してください。つまり、前回の <literal>テスト版 (testing)</literal> への移行を考慮に入れてから最大の urgency でアップロードされるということです;

source: It must not have new release-critical bugs (RC bugs affecting the version available in <literal>unstable</literal>, but not affecting the version in <literal>testing</literal>);
de: Es darf keine veröffentlichungskritischen Fehler haben (release-kritische Fehler betreffend die in <literal>unstable</literal> verfügbare Version, aber nicht die in <literal>testing</literal>);
fr: il ne doit pas introduire de nouveau bogue critique pour la publication (« <literal>RC bug</literal> » affectant la version disponible dans <literal>unstable</literal>, mais pas celle de <literal>testing</literal>) ;
ja: 新たなリリースクリティカルバグを持っていないこと (<literal>不安定版 (unstable)</literal>で利用可能なバージョンに影響する RC バグであって、<literal>テスト版 (testing)</literal> にあるバージョンに影響するものではない);

source: It must be available on all architectures on which it has previously been built in <literal>unstable</literal>. <link linkend="dak-ls">dak ls</link> may be of interest to check that information;
de: Es muss auf allen Architekturen verfügbar sein, auf denen es vorher in <literal>unstable</literal> erstellt wurde. Um diese Information zu prüfen, könnte <link linkend="dak-ls">dak ls</link> von Interesse sein.
fr: il doit être disponible pour toutes les architectures pour lesquelles il a déjà été construit dans <literal>unstable</literal>. <link linkend="dak-ls">dak ls</link> permet de vérifier cette information ;
ja: あらかじめ <literal>unstable</literal> でビルドされた際に、全アーキテクチャで利用可能になっていなくてはいけません。この情報をチェックするのに <link linkend="dak-ls">dak ls</link> に興味を持つかもしれません;

source: It must not break any dependency of a package which is already available in <literal>testing</literal>;
de: Es darf keine Abhängigkeiten von Paketen zerstören, die bereits in <literal>testing</literal> verfügbar sind.
fr: il ne doit pas casser les dépendances d'un paquet déjà disponible dans <literal>testing</literal> ;
ja: 既に<literal>テスト版 (testing)</literal> で利用可能になっているパッケージの依存関係を壊さないこと;

source: The packages on which it depends must either be available in <literal>testing</literal> or they must be accepted into <literal>testing</literal> at the same time (and they will be if they fulfill all the necessary criteria);
de: Die Pakete, von denen es abhängt, müssen entweder in <literal>testing</literal> verfügbar sein oder sie müssen zur gleichen Zeit in <literal>testing</literal> akzeptiert werden (und das werden sie, falls sie alle nötigen Kriterien erfüllen).
fr: les paquets dont il dépend doivent soit être déjà disponibles dans <literal>testing</literal>, soit être acceptés dans <literal>testing</literal> au même moment (et ils doivent remplir tous les critères nécessaires) ;
ja: パッケージが依存するものは、<literal>テスト版 (testing)</literal> で利用可能なものか、<literal>テスト版 (testing)</literal> に同時に受け入れられるものでなくてはいけない (そして、それらは必要な条件をすべて満たしていれば、<literal>テスト版 (testing)</literal>) に入る);

source: The phase of the project. I.e. automatic transitions are turned off during the <emphasis>freeze</emphasis> of the <literal>testing</literal> distribution.
de: die Phase des Projekts. D.h. automatische Übergänge werden während des <emphasis>Freeze</emphasis> der Distribution <literal>testing</literal> ausgesetzt.
fr: L'état du projet. C'est-à-dire que les transitions automatiques sont arrêtées pendant le <emphasis>freeze</emphasis> (gel) de la distribution <literal>testing</literal>.
ja: プロジェクトの状況。つまり、<literal>テスト版 (testing)</literal> ディストリビューションの<emphasis>フリーズ</emphasis>中は、自動的な移行がオフになります。

source: To find out whether a package is progressing into <literal>testing</literal> or not, see the <literal>testing</literal> script output on the <ulink url="&url-testing-maint;">web page of the testing distribution</ulink>, or use the program <command>grep-excuses</command> which is in the <systemitem role="package">devscripts</systemitem> package. This utility can easily be used in a <citerefentry> <refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> to keep yourself informed of the progression of your packages into <literal>testing</literal>.
de: Um herauszufinden, ob ein Paket nach <literal>testing</literal> fortschreitet oder nicht, sehen Sie die Ausgabe des <literal>testing</literal>-Skripts auf der Web-Seite <ulink url="&url-testing-maint;">Debian »Testing«-Distribution</ulink> oder benutzen Sie das Programm <command>grep-excuses</command> aus dem Paket <systemitem role="package">devscripts</systemitem>. Dieses Hilfswerkzeug kann einfach in einer <citerefentry> <refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> benutzt werden, um sich selbst auf dem aktuellen Stand über den Fortschritt des Pakets nach <literal>testing</literal> zu informieren.
fr: Pour savoir si un paquet a progressé ou non dans <literal>testing</literal>, veuillez voir la sortie du script de <literal>testing</literal> sur la <ulink url="&url-testing-maint;">page web de la distribution <literal>testing</literal></ulink> ou utilisez le programme <command>grep-excuses</command> du paquet <systemitem role="package">devscripts</systemitem>. Pour rester informé de la progression de vos paquets dans <literal>testing</literal>, vous pouvez facilement le mettre dans une <citerefentry> <refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
ja: パッケージが<literal>テスト版 (testing)</literal> に入る処理がされるかどうかは、<ulink url="&url-testing-maint;">テスト版ディストリビューションのウェブページ</ulink>の<literal>テスト版 (testing)</literal> スクリプトの出力を参照するか、<systemitem role="package">devscripts</systemitem> パッケージ中の <command>grep-excuses</command> プログラムを使ってください。このユーティリティは、パッケージが<literal>テスト版 (testing)</literal> への進行の通知をし続けるのに、<citerefentry> <refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> で手軽に使うことができます。

source: The <filename>update_excuses</filename> file does not always give the precise reason why the package is refused; you may have to find it on your own by looking for what would break with the inclusion of the package. The <ulink url="&url-testing-maint;">testing web page</ulink> gives some more information about the usual problems which may be causing such troubles.
de: Die Datei <filename>update_excuses</filename> gibt nicht immer den genauen Grund an, weshalb ein Paket abgelehnt wurde. Sie können es selbst herausfinden, indem Sie schauen, was durch die Aufnahme des Pakets zerstört würde. Die Web-Seite <ulink url="&url-testing-maint;">Debian »Testing«-Distribution</ulink> stellt einige weitere Informationen über die üblichen Probleme bereit, die derartigen Ärger verursachen.
fr: Le fichier <filename>update_excuses</filename> ne donne pas toujours la raison précise pour laquelle un paquet est refusé ; il peut être nécessaire de la chercher soi-même en regardant ce qui serait cassé avec l'inclusion du paquet. La <ulink url="&url-testing-maint;">page web de la distribution <literal>testing</literal></ulink> donne plus d'informations sur les problèmes courants pouvant occasionner cela.
ja: <filename>update_excuses</filename> は、なぜパッケージが拒否されたのか正確な理由を必ずしも表示しません。自分自身で何がパッケージが含まれるのを妨げているのか、探す必要があるかもしれません。<ulink url="&url-testing-maint;">テスト版のウェブページ</ulink>が、そのような問題を引き起こす良くある問題についての情報を与えてくれるでしょう。

source: Sometimes, some packages never enter <literal>testing</literal> because the set of interrelationship is too complicated and cannot be sorted out by the scripts. See below for details.
de: Manchmal errreichen einige Pakete <literal>testing</literal> niemals, da die Zusammensetzung wechselseitiger Beziehungen zu kompliziert ist und durch das Skript nicht aufgelöst werden können. Im Folgenden finden Sie Einzelheiten.
fr: Parfois, certains paquets n'entrent jamais dans <literal>testing</literal> parce que le jeu des inter-relations est trop compliqué et ne peut être résolu par le script. Voir ci-dessous pour des détails.
ja: 時折、相互依存関係の組み合わせが非常に難解なのでスクリプトが解決できないことがあるため、パッケージが<literal>テスト版 (testing)</literal> に決して入らないことがあります。詳細は下記を参照してください。

source: Some further dependency analysis is shown on <ulink url="http://release.debian.org/migration/"></ulink> — but be warned, this page also shows build dependencies which are not considered by britney.
de: Einige weitere Abhängigkeitsanalysen werden unter <ulink url="http://release.debian.org/migration/"></ulink> angezeigt — aber seien Sie gewarnt, diese Seite zeigt außerdem Build-Abhängigkeiten, die nicht von Britney berücksichtigt werden.
fr: Des analyses de dépendances plus avancées sont présentées sur <ulink url="http://release.debian.org/migration/"></ulink> — mais, attention, cette page affiche également des dépendances de construction qui ne sont pas prises en compte par <literal>britney</literal>.
ja: 依存性についてのさらなる分析は、<ulink url="http://release.debian.org/migration/"></ulink> で表示されています — ですが、このページが britney が処理した依存性ではないものも表示しているのに注意してください。

source: Out-of-date
de: Veraltet
fr: Désynchronisation
ja: 時代遅れ (Out-of-date)

source: For the <literal>testing</literal> migration script, outdated means: There are different versions in <literal>unstable</literal> for the release architectures (except for the architectures in fuckedarches; fuckedarches is a list of architectures that don't keep up (in <filename>update_out.py</filename>), but currently, it's empty). outdated has nothing whatsoever to do with the architectures this package has in <literal>testing</literal>.
de: Für das <literal>testing</literal>-Migrations-Skript bedeutet veraltet: Es gibt in <literal>unstable</literal> verschiedene Versionen für die Release-Architektur (außer für Architekturen in Fuckedarches; Fuckedarches ist eine Liste von Architekturen, die nicht weitergeführt werden (in <filename>update_out.py</filename>), aber gegenwärtig ist sie leer). Veraltet hat nichts damit zu tun, welche Architekturen dieses Paket in <literal>testing</literal> unterstützt.
fr: Pour le script de migration dans <literal>testing</literal>, « désynchronisé » (« <literal>outdated</literal> ») signifie : il y a différentes versions dans <literal>unstable</literal> pour les architectures de publication (à l'exception des architectures dans <literal>fuckedarches</literal> ; <literal>fuckedarches</literal> est une liste des architectures qui ne suivent pas le rythme (dans <filename>update_out.py</filename>), mais actuellement cette liste est vide). « Désynchronisé » n'a rien à voir avec les architectures que le paquet fournit pour <literal>testing</literal>.
ja: <literal>テスト版 (testing)</literal> への移行スクリプトの場合、時代遅れ (outdated) というのが意味しているのは: リリースアーキテクチャに対して、複数の異なったバージョンが<literal>不安定版 (unstable)</literal> にある (fuckedarches にあるアーキテクチャを除く。fuckedarches は (<filename>update_out.py</filename> 中で) 更新を行わないアーキテクチャの一覧ですが、現在のところは空になっています)。時代遅れ (outdated) の場合、<literal>テスト版 (testing)</literal> でこのパッケージが存在しているアーキテクチャに対して全く何もしません。

source: Consider this example:
de: Sehen Sie sich dieses Beispiel an:
fr: Considérons cet exemple :
ja: 以下の例を考えてみましょう:

source: The package is out of date on <literal>alpha</literal> in <literal>unstable</literal>, and will not go to <literal>testing</literal>. Removing the package would not help at all, the package is still out of date on <literal>alpha</literal>, and will not propagate to <literal>testing</literal>.
de: Das Paket ist auf <literal>alpha</literal> in <literal>unstable</literal> veraltet und wird nicht nach <literal>testing</literal> gelangen. Das Paket zu entfernen würde überhaupt nicht helfen. Das Paket ist immer noch auf <literal>alpha</literal> veraltet und wird sich nicht nach <literal>testing</literal> ausbreiten.
fr: Le paquet est désynchronisé pour <literal>alpha</literal> dans <literal>unstable</literal> et n'entrera pas dans <literal>testing</literal>. Supprimer le paquet de <literal>testing</literal> n'aiderait en rien, le paquet serait toujours désynchronisé pour <literal>alpha</literal> et ne se propagerait pas dans <literal>testing</literal>.
ja: <literal>不安定版 (unstable)</literal> での <literal>alpha</literal> のパッケージは時代遅れになっているので、<literal>テスト版 (testing)</literal> に入りません。パッケージの削除は全く役に立たず、<literal>alpha</literal> ではパッケージは時代遅れのままで、<literal>テスト版 (testing)</literal> には移行しません。

source: However, if ftp-master removes a package in <literal>unstable</literal> (here on <literal>arm</literal>):
de: Falls FTP-Master jedoch ein Paket in <literal>unstable</literal> entfernt (hier auf <literal>arm</literal>):
fr: Cependant, si <literal>ftp-master</literal> supprime un paquet d'<literal>unstable</literal> (ici pour <literal>arm</literal>) :
ja: ですが、もしも ftp-master が<literal>不安定版 (unstable)</literal> のパッケージ (ここでは <literal>arm</literal> の) を削除した場合:

source: In this case, the package is up to date on all release architectures in <literal>unstable</literal> (and the extra <literal>hurd-i386</literal> doesn't matter, as it's not a release architecture).
de: In diesem Fall ist das Paket auf allen Architekturen in <literal>unstable</literal> aktuell (und das zusätzliche <literal>hurd-i386</literal> tut nichts zur Sache, da es keine Release-Architektur ist).
fr: Dans ce cas, le paquet est synchronisé pour toutes les architectures de version dans <literal>unstable</literal> (et l'architecture supplémentaire <literal>hurd-i386</literal> ne compte pas car ce n'est pas une architecture de publication).
ja: この場合、パッケージは<literal>不安定版 (unstable)</literal> ですべてのリリースアーキテクチャで最新になります (それから、もう一つの <literal>hurd-i386</literal> は、リリースアーキテクチャではないので問題になりません)。

source: Sometimes, the question is raised if it is possible to allow packages in that are not yet built on all architectures: No. Just plainly no. (Except if you maintain glibc or so.)
de: Manchmal kommt die Frage auf, ob es möglich ist, Pakete aufzunehmen, die noch nicht auf allen Architekturen erstellt wurden: Nein. Einfach nur nein. (Außer Sie betreuen Glibc oder so).
fr: Quelquefois, la question est soulevée de savoir s'il est possible de permettre à des paquets de passer dans <literal>testing</literal> alors qu'ils ne sont pas encore construits pour toutes les architectures : non. Simplement non. (Excepté si vous êtes responsable de glibc ou équivalent).
ja: 時折、すべてのアーキテクチャでまだビルドされていていないパッケージを入れられるか、という質問がでてきます: いいえ。 単純にいいえ、です (glibc などをメンテしている場合を除きます)。

source: Removals from testing
de: Entfernen aus Testing
fr: Suppression de <literal>testing</literal>
ja: テスト版からの削除
