Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: Keep the maintainer scripts as simple as possible. We suggest you use pure POSIX shell scripts. Remember, if you do need any bash features, the maintainer script must have a bash shebang line. POSIX shell or Bash are preferred to Perl, since they enable <systemitem role="package">debhelper</systemitem> to easily add bits to the scripts.
de: Halten Sie die Betreuerskripte so einfach wie möglich. Es wird empfohlen, nur reine POSIX-Shell-Skripte zu benutzen. Falls Sie irgendwelche Bash-Funktionen benötigen, vergessen Sie nicht, dass das Betreuerskript eine Shebang-Zeile haben muss. POSIX-Shell oder Bash werden für Perl bevorzugt, da sie <systemitem role="package">debhelper</systemitem> ermöglichen, den Skripten einfach Teile hinzuzufügen.
fr: Les scripts du responsable doivent rester aussi simples que possible et utiliser de préférence des scripts shell POSIX stricts. Veuillez noter que si vous avez besoin de spécificités de Bash, vous devez utiliser une ligne « <literal>shebang</literal> » pour Bash. Les scripts POSIX ou Bash sont encouragés par rapport aux scripts Perl, car <systemitem role="package">debhelper</systemitem> peut alors y ajouter des fonctions.
ja: メンテナスクリプトは、できる限りシンプルなものにしておきましょう。我々は、あなたは純粋な POSIX シェルスクリプトを使っているものだと考えています。覚えておいて欲しいのですが、何かしら bash の機能が必要になったら、メンテナスクリプトは bash のシェバン行にしておく必要があります。スクリプトへ簡単にちょっとした変更を追加するのに <systemitem role="package">debhelper</systemitem> を使えるので、Perl より POSIX シェル、あるいは Bash の方が好まれます。

source: If you change your maintainer scripts, be sure to test package removal, double installation, and purging. Be sure that a purged package is completely gone, that is, it must remove any files created, directly or indirectly, in any maintainer script.
de: Falls Sie Ihre Betreuerskripte ändern, stellen Sie sicher, dass Sie das Entfernen des Pakets, die mehrmalige Installation und das vollständige Entfernen testen. Vergewissern Sie sich, dass nach dem vollständigen Entfernen des Pakets alles komplett weg ist, sprich, es muss jede erzeugte Datei entfernen, die direkt oder indirekt in irgendeinem Betreuerskript erstellt wurde.
fr: Si vous modifiez les scripts du responsable, veillez à vérifier la suppression du paquet, la double installation et la purge. Vérifiez qu'un paquet purgé est entièrement éliminé, c'est-à-dire que les fichiers créés, directement ou indirectement dans les scripts du responsable, sont tous supprimés.
ja: メンテナスクリプトを変更したら、パッケージの削除や二重インストール、purge のテストを確認してください。purge されたパッケージが完全に削除されたことを確認してください。つまり、メンテナスクリプト中で直接／間接を問わず作成されたファイルを削除する必要があるということです。

source: If you need to check for the existence of a command, you should use something like
de: Falls Sie prüfen möchten, ob ein Befehl existiert, sollten Sie so etwas benutzen:
fr: Pour vérifier l'existence d'une commande, vous devriez utiliser quelque chose comme :
ja: コマンドの存在をチェックする必要がある場合は、このような感じで行います

source: If you don't wish to hard-code the path of a command in your maintainer script, the following POSIX-compliant shell function may help:
de: Falls Sie nicht dem Pfad eines Befehls fest ins Betreuerskript schreiben möchten, könnte die folgende POSIX-konforme Shell-Funktion helfen:
fr: Pour ne pas coder en dur le chemin d'une commande dans les scripts de responsable, la fonction shell conforme à POSIX suivante peut aider :
ja: メンテナスクリプト中でコマンドの path をハードコードしたくない場合には、以下の POSIX 互換シェル機能が役立つでしょう:

source: You can use this function to search <varname>$PATH</varname> for a command name, passed as an argument. It returns true (zero) if the command was found, and false if not. This is really the most portable way, since <literal>command -v</literal>, <command>type</command>, and <command>which</command> are not POSIX.
de: Sie können diese Funktion benutzen, um <varname>$PATH</varname> nach einem Befehlsnamen zu durchsuchen, der als Argument übergegeben wird. Sie gibt »true« (null) zurück, falls der Befehl gefunden wurde und »false«, falls nicht. Dies ist wirklich die portierbarste Möglichkeit, da <literal>command -v</literal>, <command>type</command> und <command>which</command> nicht POSIX-konform sind.
fr: Vous pouvez utiliser cette fonction pour rechercher dans <varname>$PATH</varname> une commande donnée, passée en paramètre. Elle renvoie « <literal>true</literal> » (zéro) si la commande est trouvée et « <literal>false</literal> » dans le cas contraire. Il s'agit de la méthode la plus portable car <literal>command -v</literal>, <command>type</command>, et <command>which</command> ne sont pas conformes à POSIX.
ja: コマンド名を引数として渡すことで、<varname>$PATH</varname> の検索するのにこの関数を使うことができます。コマンドが見つかった場合は true (ゼロ) を返し、そうでない場合は false を返します。<literal>command -v</literal>、<command>type</command>、<command>which</command> は POSIX に無いので、これがもっとも汎用性の高いやり方です。

source: While <command>which</command> is an acceptable alternative, since it is from the required <systemitem role="package">debianutils</systemitem> package, it's not on the root partition. That is, it's in <filename>/usr/bin</filename> rather than <filename>/bin</filename>, so one can't use it in scripts which are run before the <filename>/usr</filename> partition is mounted. Most scripts won't have this problem, though.
de: Obwohl <command>which</command> eine akzeptable Alternative ist, da es aus dem benötigten Paket <systemitem role="package">debianutils</systemitem> stammt, liegt es nicht auf der Wurzel-Partition. Zumindest liegt es eher in <filename>/usr/bin</filename> als in <filename>/bin</filename>, so dass es nicht in Skripten benutzt werden kann, die vor dem Einhängen von <filename>/usr</filename> ausgeführt werden. Dieses Problem werden allerdings die meisten Skripte nicht haben.
fr: Bien que <command>which</command> soit acceptable car fourni dans le paquet requis <systemitem role="package">debianutils</systemitem>, il n'est pas disponible sur la partition racine mais est situé dans le répertoire <filename>/usr/bin</filename> au lieu de <filename>/bin</filename>, ce qui rend son utilisation impossible si <filename>/usr</filename> n'est pas encore monté. La plupart des scripts ne seront toutefois pas affectés par cela.
ja: <command>which</command> は、Required となっている <systemitem role="package">debianutils</systemitem> パッケージにあるので、別解として利用可能ですが、ルートパーティションにありません。つまり、<filename>/usr/bin</filename> にあって <filename>/bin</filename> ではないので、<filename>/usr</filename> パーティションがマウントする前に走るスクリプトの中では使えないということです。ほとんどのスクリプトは、この問題を持つようなことはありませんが。

source: Configuration management with <systemitem role="package">debconf</systemitem>
de: Konfigurationsverwaltung mit <systemitem role="package">debconf</systemitem>
fr: Gestion de la configuration avec <systemitem role="package">debconf</systemitem>
ja: <systemitem role="package">debconf</systemitem> による設定管理

source: <systemitem role="package">Debconf</systemitem> is a configuration management system which can be used by all the various packaging scripts (<filename>postinst</filename> mainly) to request feedback from the user concerning how to configure the package. Direct user interactions must now be avoided in favor of <systemitem role="package">debconf</systemitem> interaction. This will enable non-interactive installations in the future.
de: <systemitem role="package">Debconf</systemitem> ist ein Konfigurationsverwaltungssystem, das von allerlei Paketierungsskripten (hauptsächlich <filename>postinst</filename>) benutzt werden kann, um Rückmeldungen von Anwendern betreffend der Paketkonfiguration abzufragen. Direkte Benutzer-Interaktion muss nun zugunsten der Interaktion mit <systemitem role="package">debconf</systemitem> vermieden werden. Dies wird in Zukunft nicht interaktive Installationen ermöglichen.
fr: <systemitem role="package">debconf</systemitem> est un système de gestion de configuration utilisable par les divers scripts des paquets (<filename>postinst</filename> notamment) pour interagir avec l'utilisateur sur des choix à opérer pour la configuration du paquet. Les interactions directes avec l'utilisateur doivent maintenant être évitées en faveur de <systemitem role="package">debconf</systemitem>, notamment pour permettre des installations non interactives.
ja: <systemitem role="package">debconf</systemitem> は、(主に <filename>postinst</filename> をはじめとする) すべての様々なパッケージスクリプトが、ユーザはどの様にパッケージを設定したいのかというフィードバックを問い合わせるのに使うことが可能な設定管理システムです。直接ユーザとの対話処理は、<systemitem role="package">debconf</systemitem> での処理の方を選んだので、現状では避けるべきです。これにより、将来には非対話的なインストールが可能になる予定です。

source: Debconf is a great tool but it is often poorly used. Many common mistakes are listed in the <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> man page. It is something that you must read if you decide to use debconf. Also, we document some best practices here.
de: Debconf ist ein großartiges Werkzeug, aber es wird oft mangelhaft benutzt. Viele alltägliche Fehler sind auf der Handbuchseite <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> aufgeführt. Manchmal ist es nötig zu lesen, falls Sie sich entscheiden Debconf zu benutzen. Außerdem werden hier ein paar optimale Vorgehensweisen vorgestellt.
fr: <systemitem role="package">debconf</systemitem> est un outil très pratique mais souvent mal utilisé. De nombreuses erreurs classiques sont mentionnées dans la page de manuel <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>. Il est indispensable de lire cette page de manuel avant de décider d'utiliser debconf. Quelques bonnes pratiques sont également indiquées dans le présent document.
ja: debconf は素晴らしいツールですが、しばしば適当に扱われています。多くの共通する失敗は、<citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> man ページに記載されています。これは、debconf を使うのを決めた時、あなたが読むべきものです。また、ここではベストプラクティスを記述しています。

source: These guidelines include some writing style and typography recommendations, general considerations about debconf usage as well as more specific recommendations for some parts of the distribution (the installation system for instance).
de: Diese Richtlinien enthalten einige Schreibstil- und Typografie-Empfehlungen, allgemeine Betrachtungen über die Benutzung von Debconf, ebenso wie spezifischere Empfehlungen für einige Teile der Distribution (das Installationssystem besispielsweise).
fr: Les conseils qui suivent comportent des indications sur le style d'écriture et la typographie, des considérations générales sur l'utilisation de <systemitem role="package">debconf</systemitem> ainsi que des recommandations plus spécifiques relatives à certaines parties de la distribution (le système d'installation notamment).
ja: これらのガイドラインは、ディストリビューションの一部 (例えば、インストールシステム) に関する、より明確な推奨と同様に、幾つかの書き方と体裁に関する推奨、そして debconf の使い方についての一般的な考慮すべき事柄を含んでいます。

source: Do not abuse debconf
de: Missbrauchen Sie Debconf nicht
fr: Proscrire les abus de <systemitem role="package">debconf</systemitem>
ja: debconf を乱用しない

source: Since debconf appeared in Debian, it has been widely abused and several criticisms received by the Debian distribution come from debconf abuse with the need of answering a wide bunch of questions before getting any little thing installed.
de: Seit Debconf in Debian erschien, wurde es verbreitet missbraucht und viel von der Kritik, die bei der Debian-Distribution einging, rührte vom Debconf-Missbrauch mit der Notwendigkeit, ein großes Fragenbündel zu beantworten, bevor eine Kleinigkeit installiert war.
fr: Depuis que <systemitem role="package">debconf</systemitem> est apparu dans Debian, il a été tellement utilisé que de nombreuses critiques ont été émises à l'encontre de la distribution Debian pour abus d'utilisation de <systemitem role="package">debconf</systemitem>, avec la nécessité de répondre à un nombre très important de questions avant d'avoir un quelconque outil installé.
ja: debconf が Debian に現れて以来、広く乱用され続けています。そして、debconf の乱用によって、ちょっとしたものをインストールする前に、大量の質問に答える必要があることに由来するいくつもの非難が Debian ディストリビューションに寄せられました。

source: Keep usage notes to what they belong: the <filename>NEWS.Debian</filename>, or <filename>README.Debian</filename> file. Only use notes for important notes which may directly affect the package usability. Remember that notes will always block the install until confirmed or bother the user by email.
de: Behalten Sie Aufrufnotizen dort, wozu sie gehören: den Dateien <filename>NEWS.Debian</filename> oder <filename>README.Debian</filename>. Benutzen Sie nur Notizen für wichtige Anmerkungen, die direkt die Benutzbarkeit des Pakets beeinflussen. Bedenken Sie, dass Notizen die Installation immer blockieren, bis Sie bestätigt wurden oder den Anwender per E-Mail bleästigt haben.
fr: Les notes d'utilisation doivent être réservées à leur emplacement naturel : le fichier <filename>NEWS.Debian</filename> ou <filename>README.Debian</filename>. N'utilisez les notes que pour des points importants qui peuvent directement concerner l'utilisabilité du paquet. Les notes interrompent l'installation tant qu'elles ne sont pas confirmées et elles peuvent conduire à des envois de courriers électroniques aux utilisateurs.
ja: 使い方のメモは載せるべきところへ載せましょう: <filename>NEWS.Debian</filename>、または <filename>README.Debian</filename> ファイルです。notes はパッケージのユーザビリティに直接影響する重要な記述にだけ使いましょう。notes は確認する (あるいはメールでユーザを悩ます) まで、インストールを常にブロックすることを覚えておいてください。

source: Carefully choose the questions priorities in maintainer scripts. See <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> for details about priorities. Most questions should use medium and low priorities.
de: Wählen Sie die Prioritäten der Fragen in Betreuerskripten sorgfältig. Einzelheiten über Prioritäten finden Sie unter <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>. Die meisten Fragen sollten mittlere oder niedrige Prioritäten nutzen.
fr: Choisissez soigneusement les questions posées dans les scripts du responsable. Veuillez consulter la page de manuel <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> pour plus de détails sur les priorités. La plupart des questions devraient utiliser les priorités intermédiaire (<literal>medium</literal>) ou basse (<literal>low</literal>).
ja: メンテナスクリプト中の質問の優先度を注意深く選びましょう。優先度の詳細については、<citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> を参照してください。ほとんどの質問は優先度が medium あるいは low を使うべきです。

source: General recommendations for authors and translators
de: Allgemeine Empfehlungen für Autoren und Übersetzer
fr: Recommandations générales pour les auteurs et les traducteurs
ja: 作者と翻訳者に対する雑多な推奨

source: Write correct English
de: Schreiben Sie korrektes Englisch.
fr: Utilisation d'un anglais correct
ja: 正しい英語を書く

source: Most Debian package maintainers are not native English speakers. So, writing properly phrased templates may not be easy for them.
de: Die meisten Debian-Paketbetreuer haben nicht Englisch als Muttersprache. Daher ist es für sie nicht einfach, korrekt formulierte Schablonen zu verfassen.
fr: La plupart des responsables de paquets Debian ne sont pas anglophones. Il n'est donc pas nécessairement facile pour eux d'écrire des écrans correctement.
ja: ほとんどの Debian パッケージメンテナはネイティブの英語話者ではありません。ですので、正しいフレーズのテンプレートを書くのは彼らにとっては容易ではありません。

source: Please use (and abuse) &email-debian-l10n-english; mailing list. Have your templates proofread.
de: Bitte benutzen (und missbrauchen) Sie die Mailingliste &email-debian-l10n-english;. Lassen Sie Ihre Schablonen korrekturlesen.
fr: Pensez à utiliser (voire abuser de) la liste &email-debian-l10n-english;. Faites relire vos écrans.
ja: &email-debian-l10n-english; メーリングリストを利用してください (むしろ乱用してください)。テンプレートを査読してもらいましょう。

source: Badly written templates give a poor image of your package, of your work... or even of Debian itself.
de: Schlecht geschriebene Schablonen werfen ein armseliges Bild auf Ihr Paket, Ihre Arbeit ... oder sogar auf Debian selbst.
fr: Des écrans mal écrits fournissent une image négative de votre paquet, de votre travail ou même de Debian en général.
ja: 下手に書かれたテンプレートは、パッケージに対して、そしてあなたの作業に対して、さらには Debian それ自体にすら対して、悪い印象を与えます。

source: Avoid technical jargon as much as possible. If some terms sound common to you, they may be impossible to understand for others. If you cannot avoid them, try to explain them (use the extended description). When doing so, try to balance between verbosity and simplicity.
de: Vermeiden Sie soweit möglich technische Fachsprache. Wenn sich einige Begriffe für Sie vertraut anhören, könnten sie für andere unverständlich sein. Falls sie sich nicht vermeiden lassen, versuchen Sie sie zu erklären (benutzen Sie die längere Beschreibung). Versuchen Sie dabei, zwischen Aussagekraft und Einfachheit abzuwägen.
fr: Évitez autant que possible le jargon technique. Si certains termes vous sont familiers, ils peuvent être incompréhensibles à d'autres. Si vous ne pouvez les éviter, tentez de les expliquer (avec la description étendue). Dans ce cas, tentez de faire la part des choses entre simplicité et verbosité.
ja: 可能な限り技術的なジャーゴンを避けましょう。いくつかの用語があなたにとっては普通に聞こえても、他の人には理解不可能かもしれません。避けられない場合には、 (説明文を使って) 解説してみましょう。その場合には、冗長さとシンプルさのバランスを取るようにしましょう。

source: Be kind to translators
de: Seien sie nett zu Übersetzern
fr: Courtoisie avec les traducteurs
ja: 翻訳者へ丁寧に接する

source: Debconf templates may be translated. Debconf, along with its sister package <command>po-debconf</command> offers a simple framework for getting templates translated by translation teams or even individuals.
de: Debconf-Schablonen können übersetzt werden. Debconf bietet zusammen mit seinem Schwesterpaket <command>po-debconf</command> ein einfaches Gerüst, um Schablonen durch Übersetzer-Teams oder sogar einzelne Personen übersetzen zu lassen.
fr: Les écrans <systemitem role="package">debconf</systemitem> peuvent être traduits. Les paquets <systemitem role="package">debconf</systemitem> et <systemitem role="package">po-debconf</systemitem> fournissent un cadre simple permettant la traduction des écrans par des équipes de traduction ou des traducteurs isolés.
ja: debconf テンプレートは翻訳されるでしょう。debconf、そして関連する姉妹パッケージ <command>po-debconf</command> は、テンプレートを翻訳チームやさらには個人が翻訳できるようにする、シンプルなフレームワークを提供します。

source: Please use gettext-based templates. Install <systemitem role="package">po-debconf</systemitem> on your development system and read its documentation (<command>man po-debconf</command> is a good start).
de: Bitte benutzen Sie Gettext-basierte Schablonen. Installieren Sie <systemitem role="package">po-debconf</systemitem> auf Ihrem Entwicklungssystem und lesen Sie dessen Dokumentation (<command>man po-debconf</command> ist ein guter Anfang).
fr: Utilisez des écrans permettant l'utilisation de <systemitem role="package">gettext</systemitem>. Installez le paquet <systemitem role="package">po-debconf</systemitem> sur votre machine de développement et lisez sa documentation (<command>man po-debconf</command> est un bon début).
ja: gettext ベースのテンプレートを使ってください。開発用のシステムに <systemitem role="package">po-debconf</systemitem> をインストールしてドキュメントを読みましょう (<command>man po-debconf</command> が取っ掛かりとして良いでしょう)。

source: Avoid changing templates too often. Changing templates text induces more work to translators which will get their translation fuzzied. A fuzzy translation is a string for which the original changed since it was translated, therefore requiring some update by a translator to be usable. When changes are small enough, the original translation is kept in PO files but marked as <literal>fuzzy</literal>.
de: Vermeiden Sie, Schablonen häufig zu ändern. Das Ändern von Schablonen führt zu Mehrarbeit für Übersetzer, deren Übersetzungen unvollständig werden. Eine unvollständige Übersetzung ist eine Zeichenkette, bei der sich seit dem Übersetzen das Original geändert hat und das daher eine Aktualisierung durch den Übersetzer benötigt. Wenn die Änderungen klein genug sind, wird die Originalübersetzung in den PO-Dateien beibehalten und mit <literal>fuzzy</literal> gekennzeichnet.
fr: Évitez de changer les écrans trop souvent. Les modifications de texte ont une incidence sur le travail des traducteurs dont les traductions vont devenir approximatives (« <literal>fuzzy</literal> »). Une chaîne de caractères devient approximative quand la version originale a été modifiée depuis la traduction, demandant ainsi une mise à jour par un traducteur pour être utilisable. Si les modifications sont mineures, la traduction originale est conservée dans le fichier PO mais marquée <literal>fuzzy</literal>.
ja: テンプレートを頻繁に変更しすぎることを避けましょう。テンプレート文の変更は、翻訳を fuzzy にして、さらなる作業を翻訳作業者に強います。fuzzy になっている翻訳文は、翻訳されてから元の文章が変更された文字列であり、使えるようにするには翻訳作業者による若干の更新が必要なものです。変更点が十分に小さい場合、<literal>fuzzy</literal> とマークされますが、元の翻訳文は PO ファイル中に保持されます。

source: If you plan to do changes to your original templates, please use the notification system provided with the <systemitem role="package">po-debconf</systemitem> package, namely the <command>podebconf-report-po</command>, to contact translators. Most active translators are very responsive and getting their work included along with your modified templates will save you additional uploads. If you use gettext-based templates, the translator's name and e-mail addresses are mentioned in the PO files headers and will be used by <command>podebconf-report-po</command>.
de: Falls Sie planen, Änderungen an Ihren Originalschablonen vorzunehmen, benutzen Sie bitte das Benachrichtigungssystem namens <command>podebconf-report-po</command>, das vom Paket <systemitem role="package">po-debconf</systemitem> bereitgestellt wird, um die Übersetzer zu kontaktieren. Die meisten aktiven Übersetzer sind sehr zugänglich und Ihre Arbeit zusammen mit Ihren geänderten Schablonen einzubeziehen, wird Sie vor zusätzlichen Uploads bewahren. Falls Sie Gettext-basierte Schablonen verwenden, werden die Namen und E-Mail-Adressen der Übersetzer in den Kopfzeilen der PO-Dateien erwähnt und von <command>podebconf-report-po</command> benutzt.
fr: Si vous prévoyez de modifier les écrans d'origine, veuillez utiliser le système de notification <command>podebconf-report-po</command>, fourni avec le paquet <systemitem role="package">po-debconf</systemitem>, pour contacter les traducteurs. La plupart des traducteurs sont réactifs, et inclure leur mise à jour en même temps que les modifications des écrans d'origine vous évitera des envois ultérieurs pour mettre à jour des traductions. Si vous utilisez des écrans se servant de <systemitem role="package">gettext</systemitem>, le nom et l'adresse électronique des traducteurs sont mentionnés dans les en-têtes des fichiers PO et seront utilisés par <command>podebconf-report-po</command>.
ja: 大本のテンプレートを変更する予定がある場合、<systemitem role="package">po-debconf</systemitem> パッケージで提供されている、<command>podebconf-report-po</command> という名の通知システムを使って翻訳作業者にコンタクトを取ってください。ほとんどのアクティブな翻訳作業者たちはとても反応が良く、変更を加えたテンプレートに対応するための作業をしてくれ、あなたが追加でアップロードする必要を減らしてくれます。gettext ベースのテンプレートを使っている場合、翻訳作業者の名前とメールアドレスは PO ファイルのヘッダに表示されており、<command>podebconf-report-po</command> によって使われます。

source: A recommended use of that utility is:
de: Ein empfohlene Art, das Hilfswerkzeug zu benutzen ist:
fr: Une façon recommandée de se servir de cet utilitaire est :
ja: このユーティリティの使い方のお勧めの使い方:
