Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: <systemitem role="package">debview</systemitem> provides an Emacs mode for viewing Debian binary packages. This lets you examine a package without unpacking it.
de: <systemitem role="package">debview</systemitem> stellt einen Emacs-Modus bereit, um Debian-Binärpakete anzusehen. Dies ermöglicht Ihnen ein Paket zu untersuchen ohne es zu installieren.
fr: <systemitem role="package">debview</systemitem> fournit un mode Emacs pour voir les paquets binaires Debian. Il vous permet d'examiner un paquet sans le décompresser.
ja: <systemitem role="package">debview</systemitem> は、Debian バイナリパッケージを参照する Emacs モードを提供します。これを使うと、パッケージを展開しなくても実行できるようになります。

source: Documentation
de: Dokumentation
ja: ドキュメント化

source: Actually, there are other possible distributions: <replaceable>codename</replaceable><literal>-security</literal>, but read <xref linkend="bug-security"/> for more information on those.
de: Tatsächlich gibt es andere mögliche Distributionen: <replaceable>Codename</replaceable><literal>-security</literal>, aber lesen Sie <xref linkend="bug-security"/>, um weitere Informationen darüber zu erhalten.

source: Do <emphasis role="strong">NOT</emphasis> upload a package to the security upload queue (on <literal>security-master.debian.org</literal>) without prior authorization from the security team. If the package does not exactly meet the team's requirements, it will cause many problems and delays in dealing with the unwanted upload. For details, please see <xref linkend="bug-security"/>.
de: Laden Sie <emphasis role="strong">KEIN</emphasis> Paket in die Sicherheits-Upload-Warteschlange (auf <literal>security-master.debian.org</literal> hoch, ohne vorher eine Erlaubnis vom Sicherheits-Team erhalten zu haben. Falls das Paket nicht exakt den Anforderungen des Teams entspricht, wird es viele Probleme und Verzögerungen in der Behandlung des unerwünschten Uploads verursachen. Um Einzelheiten zu erhalten, lesen Sie <xref linkend="bug-security"/>.

source: <emphasis role="strong">Target the right distribution</emphasis> in your <filename>debian/changelog</filename>: <replaceable>codename</replaceable><literal>-security</literal> (e.g. <literal>wheezy-security</literal>). Do not target <replaceable>distribution</replaceable><literal>-proposed-updates</literal> or <literal>stable</literal>!
de: <emphasis role="strong">Visieren Sie</emphasis> in Ihrem <filename>debian/changelog</filename> die richtige Version an: <replaceable>Codename</replaceable><literal>-security</literal> (z.B. <literal>wheezy-security</literal>). Peilen Sie nicht <replaceable>Distribution</replaceable><literal>-proposed-updates</literal> oder <literal>stable</literal> an!

source: Do <emphasis role="strong">NOT</emphasis> upload a package to the security upload queue (on <literal>security-master.debian.org</literal>) without prior authorization from the security team. If the package does not exactly meet the team's requirements, it will cause many problems and delays in dealing with the unwanted upload.
de: Laden Sie <emphasis role="strong">KEIN</emphasis> Paket in die Sicherheits-Upload-Warteschlange (auf <literal>security-master.debian.org</literal>) ohne vorherige Genehmigung des Sicherheits-Teams. Falls das Paket nicht exakt den Anforderungen des Teams entspricht, wird es viele Probleme und Verzögerungen im Umgang mit dem unerwünschten Upload verursachen.

source: Moving, removing, renaming, orphaning, adopting, and reintroducing packages
de: Verschieben, Entfernen, Verwaisen, Adoptieren und Wiedereinführen von Paketen

source: Reintroducing packages
de: Wiedereinführen vom Paketen

source: Packages are often removed due to release-critical bugs, absent maintainers, too few users or poor quality in general. While the process of reintroduction is similar to the initial packaging process, you can avoid some pitfalls by doing some historical research first.
de: Pakete werden oft aufgrund release-kritischer Fehler, fehlender Paketbetreuer, zu weniger Benutzer oder allgemein schlechter Qualität entfernt. Obwohl der Prozess der Wiedereinführung dem anfänglichen Paketierungsprozess ähnlich ist, können Sie einige Tücken umgehen, indem Sie zuerst etwas historische Recherche betreiben.

source: You should check why the package was removed in the first place. This information can be found in the removal item in the news section of the PTS page for the package or by browsing the log of <ulink url="http://&ftp-master-host;/#removed">removals</ulink>. The removal bug will tell you why the package was removed and will give some indication of what you will need to work on in order to reintroduce the package. It may indicate that the best way forward is to switch to some other piece of software instead of reintroducing the package.
de: An erster Stelle sollten Sie prüfen, weshalb das Paket entfernt wurde. Diese Information kann im Element für das Entfernen im Bereich News der PTS-Seite des Pakets gefunden werden oder durch Durchstöbern des Protokolls unter <ulink url="http://&ftp-master-host;/#removed">Removed packages</ulink>. Der Fehlerbericht für das Entfernen wird Ihnen sagen, weshalb das Paket entfernt wurde und einen Hinweis darauf geben, woran Sie arbeiten müssen, um das Paket wieder einzuführen. Es gibt möglicherweise an, dass Sie am Besten mit einer anderen Software weitermachen, anstatt das Paket wieder einzuführen.

source: It may be appropriate to contact the former maintainers to find out if they are working on reintroducing the package, interested in co-maintaining the package or interested in sponsoring the package if needed.
de: Es ist vielleicht angebracht, die früheren Paketbetreuer zu kontaktieren, um herauszufinden, ob sie an der Wiedereinführung des Pakets arbeiten, ob sie es mitbetreuen möchten oder ob sie interessiert sind, das Paket, falls nötig, zu sponsern.

source: You should do all the things required before introducing new packages (<xref linkend="newpackage"/>).
de: Sie sollten all die erforderlichen Dinge tun, bevor Sie neue Pakete einführen (<xref linkend="newpackage"/>).

source: You should base your work on the latest packaging available that is suitable. That might be the latest version from <literal>unstable</literal>, which will still be present in the <ulink url="&snap-debian-org;">snapshot archive</ulink>.
de: Sie sollten auf Basis der letzten verfügbaren Paketierung arbeiten, die sich eignet. Dies kann die letzte Version aus <literal>unstable</literal> sein, die immer noch im <ulink url="&snap-debian-org;">Schnappschussarchiv</ulink> vorhanden ist.

source: The version control system used by the previous maintainer might contain useful changes, so it might be a good idea to have a look there. Check if the <filename>control</filename> file of the previous package contained any headers linking to the version control system for the package and if it still exists.
de: Das vom letzten Paketbetreuer benutzte Versionskontrollsystem kann nützliche Änderungen enthalten, daher ist es vermutlich eine gute Idee, dort nachzusehen. Prüfen Sie, ob die Datei <filename>control</filename> des vorherigen Paket irgendwelche Kopfzeilen enthält, die auf das Versionskontrollsystem des Pakets verweisen und ob es noch existiert.

source: Package removals from <literal>unstable</literal> (not <literal>testing</literal>, <literal>stable</literal> or <literal>oldstable</literal>) trigger the closing of all bugs related to the package. You should look through all the closed bugs (including archived bugs) and unarchive and reopen any that were closed in a version ending in <literal>+rm</literal> and still apply. Any that no longer apply should be marked as fixed in the correct version if that is known.
de: Entfernen von Paketen aus <literal>unstable</literal> (nicht <literal>testing</literal>, <literal>stable</literal> oder <literal>oldstable</literal>) löst das Schließen aller Fehler aus, die sich auf das Paket beziehen. Sie sollten alle geschlossenen Fehler durchsehen (einschließlich archivierter Fehler) und diejenigen aus dem Archiv nehmen und wieder öffnen, die mit einer Version geschlossen wurden, die auf <literal>+rm</literal> endet und die immer noch zutreffen.

source: If you upload a package to testing or stable, you sometimes need to "fork" the version number tree. This is the case for security uploads, for example. For this, a version of the form <literal>+deb<replaceable>X</replaceable>u<replaceable>Y</replaceable></literal> should be used, where <replaceable>X</replaceable> is the major release number, and <replaceable>Y</replaceable> is a counter starting at <literal>1</literal>. For example, while Wheezy (Debian 7.0) is stable, a security NMU to stable for a package at version <literal>1.5-3</literal> would have version <literal>1.5-3+deb7u1</literal>, whereas a security NMU to Jessie would get version <literal>1.5-3+deb8u1</literal>.
de: Falls Sie ein Paket nach Testing oder Stable hochladen, müssen Sie manchmal den Versionsnummernbaum »verzweigen«. Dies ist zum Beispiel der Fall beim Hochladen von Sicherheitsaktualisierungen. Dazu sollte eine Version der Form <literal>+deb<replaceable>X</replaceable>u<replaceable>Y</replaceable></literal> benutzt werden, wobei <replaceable>X</replaceable> die Major-Release-Nummer und <replaceable>Y</replaceable> eine fortlaufende, bei <literal>1</literal> beginnende Nummer ist. Während zum Beispiel Wheezy (Debian 7.0) Stable ist, hätte ein Sicherheits-NMU für Stable für ein Paket mit der Version <literal>1.5-3</literal> die Version <literal>1.5-3+deb7u1</literal>, während ein Sicherheits-NMU für Jessie die Version <literal>1.5-3+deb8u1</literal> erhalten würde.

source: Sections
de: Abschnitte
ja: セクション

source: Architectures
de: Architekturen
ja: アーキテクチャ

source: Distributions
de: Distributionen
ja: ディストリビューション

source: Template: geneweb/lang Type: select __Choices: Afrikaans (af), Bulgarian (bg), Catalan (ca), Chinese (zh), Czech (cs), Danish (da), Dutch (nl), English (en), Esperanto (eo), Estonian (et), Finnish (fi), French (fr), German (de), Hebrew (he), Icelandic (is), Italian (it), Latvian (lv), Norwegian (no), Polish (pl), Portuguese (pt), Romanian (ro), Russian (ru), Spanish (es), Swedish (sv) # This is the default choice. Translators may put their own language here # instead of the default. # WARNING : you MUST use the ENGLISH NAME of your language # For instance, the french translator will need to put French (fr) here. _Default: English[ translators, please see comment in PO files] _Description: Geneweb default language:
ja: Template: geneweb/lang Type: select __Choices: Afrikaans (af), Bulgarian (bg), Catalan (ca), Chinese (zh), Czech (cs), Danish (da), Dutch (nl), English (en), Esperanto (eo), Estonian (et), Finnish (fi), French (fr), German (de), Hebrew (he), Icelandic (is), Italian (it), Japanese (ja), Latvian (lv), Norwegian (no), Polish (pl), Portuguese (pt), Romanian (ro), Russian (ru), Spanish (es), Swedish (sv) # This is the default choice. Translators may put their own language here # instead of the default. # WARNING : you MUST use the ENGLISH NAME of your language # For instance, the french translator will need to put French (fr) here. _Default: English[ translators, please see comment in PO files] _Description: Geneweb default language:

source: LOCALE_PATH=debian/tmpdir/usr/lib/locale LOCALE_NAME=en_IN LOCALE_CHARSET=UTF-8 mkdir -p $LOCALE_PATH localedef -i $LOCALE_NAME.$LOCALE_CHARSET -f $LOCALE_CHARSET $LOCALE_PATH/$LOCALE_NAME.$LOCALE_CHARSET # Using the locale LOCPATH=$LOCALE_PATH LC_ALL=$LOCALE_NAME.$LOCALE_CHARSET date
ja: LOCALE_PATH=debian/tmpdir/usr/lib/locale LOCALE_NAME=en_IN LOCALE_CHARSET=UTF-8 mkdir -p $LOCALE_PATH localedef -i $LOCALE_NAME.$LOCALE_CHARSET -f $LOCALE_CHARSET $LOCALE_PATH/$LOCALE_NAME.$LOCALE_CHARSET # ロケールを使う LOCPATH=$LOCALE_PATH LC_ALL=$LOCALE_NAME.$LOCALE_CHARSET date

source: testing
ja: テスト版

source: unstable
ja: 不安定版
