Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: Note that mirrors are generally run by third-parties who are interested in helping Debian. As such, developers generally do not have accounts on these machines.
de: Beachten Sie, dass Spiegel generell durch Dritte betrieben werden, die ein Interesse daran haben, Debian zu helfen. Daher haben Entwickler generell keine Konten auf diesen Maschinen.
fr: Les miroirs sont souvent mis en œuvre par des tiers qui veulent aider Debian. C'est pourquoi les développeurs n'ont en général pas de compte sur ces machines.
ja: 注意してほしいのは、ミラーは大抵 Debian の支援に興味を抱いてくれた第三者によって運用されていることです。そのため、開発者は通常これらのマシン上にはアカウントを持ってはいません。

source: The Incoming system
de: Das Eingangssystem
fr: Système « <literal>Incoming</literal> »
ja: Incoming システム

source: The Incoming system is responsible for collecting updated packages and installing them in the Debian archive. It consists of a set of directories and scripts that are installed on <literal>&ftp-master-host;</literal>.
de: Das Eingangssystem ist dafür verantwortlich aktualisierte Pakete zu sammeln und im Debian-Archiv zu installieren. Es besteht aus einer Zusammenstellung von Verzeichnissen und Skripten, die auf <literal>&ftp-master-host;</literal> installiert sind.
fr: Le système « <literal>Incoming</literal> » est responsable de la collecte des paquets mis à jour et leur installation dans l'archive Debian. Il est constitué d'un ensemble de répertoires et de scripts sur <literal>&ftp-master-host;</literal>.
ja: Incoming システムは、更新されたパッケージを集めて Debian アーカイブにインストールする役割を果たしています。これは <literal>&ftp-master-host;</literal> 上にインストールされたディレクトリとスクリプトの集合体です。

source: Packages are uploaded by all the maintainers into a directory called <filename>UploadQueue</filename>. This directory is scanned every few minutes by a daemon called <command>queued</command>, <filename>*.command</filename>-files are executed, and remaining and correctly signed <filename>*.changes</filename>-files are moved together with their corresponding files to the <filename>unchecked</filename> directory. This directory is not visible for most Developers, as ftp-master is restricted; it is scanned every 15 minutes by the <command>dak process-upload</command> script, which verifies the integrity of the uploaded packages and their cryptographic signatures. If the package is considered ready to be installed, it is moved into the <filename>done</filename> directory. If this is the first upload of the package (or it has new binary packages), it is moved to the <filename>new</filename> directory, where it waits for approval by the ftpmasters. If the package contains files to be installed by hand it is moved to the <filename>byhand</filename> directory, where it waits for manual installation by the ftpmasters. Otherwise, if any error has been detected, the package is refused and is moved to the <filename>reject</filename> directory.
de: Pakete werden durch alle Betreuer in ein Verzeichnis hochgeladen, das <filename>UploadQueue</filename> heißt. Dieses Verzeichnis wird alle paar Minuten durch einen Daemon gescannt, der <command>queued</command> genannt wird, es werden <filename>*.command</filename>-Dateien ausgeführt und verbleibende, korrekt signierte <filename>*.changes</filename>-Dateien werden zusammen mit ihren zugehörigen Dateien in das Verzeichnis <filename>unchecked</filename> verschoben. Dieses Verzeichnis ist für die meisten Entwickler unsichtbar, da FTP-Master eingeschränkt wurde. Es wird alle 15 Minuten durch das Skript <command>dak process-upload</command> gelesen, das die Richtigkeit der hochgeladenen Pakete und ihre kryptografischen Signaturen prüft. Falls das Paket für installationsbereit befunden wird, wird es in das Verzeichnis <filename>done</filename> verschoben. Falls dies das erste Hochladen des Pakets ist (oder es neue Binärpakete enthält), wird es in das Verzeichnis <filename>new</filename> verschoben, wo es auf die Freigabe durch die FTP-Master wartet. Falls das Paket Dateien enthält, die manuell installiert werden müssen, wird es in das Verzeichnis <filename>byhand</filename> verschoben, wo es auf die manuelle Installation durch die FTP-Master wartet. Andernfalls, falls ein Fehler aufgespürt wurde, wird das Paket abgewiesen und landet im Verzeichnis <filename>reject</filename>.
fr: Les paquets sont envoyés par tous les responsables Debian dans un répertoire nommé <filename>UploadQueue</filename>. Ce répertoire est parcouru toutes les quelques minutes par un démon appelé <command>queued</command>, les fichiers <filename>*.command</filename> sont exécutés et les fichiers <filename>*.changes</filename> restants et correctement signés sont déplacés avec leurs fichiers correspondants dans le répertoire <filename>unchecked</filename>. Ce répertoire n'est pas visible pour la plupart des développeurs car ftp-master est à accès restreint ; il est parcouru toutes les 15 minutes par le script <command>dak process-upload</command> qui vérifie l'intégrité des paquets envoyés et leurs signatures numériques. Si le paquet est considéré comme prêt à être installé, il est déplacé dans le répertoire <filename>done</filename>. S'il s'agit du premier envoi du paquet (ou s'il a de nouveaux paquets binaires), il est déplacé dans le répertoire <filename>new</filename> où il attend l'approbation des responsables de l'archive. Si le paquet contient des fichiers devant être installés manuellement, il est déplacé dans le répertoire <filename>byhand</filename> où il attend une installation manuelle par les responsables de l'archive. Sinon, quand une erreur a été détectée, le paquet est refusé et déplacé dans le répertoire <filename>reject</filename>.
ja: 全てのメンテナによってアップロードされたパッケージは <filename>UploadQueue</filename> というディレクトリに置かれます。このディレクトリは、毎分 <command>queued</command> と呼ばれるデーモンによってスキャンされ、<filename>*.command</filename> ファイルが実行されて、そのまま正しく署名された <filename>*.changes</filename> ファイルが対応するファイルと共に <filename>unchecked</filename> ディレクトリに移動されます。このディレクトリは ftp-master の様に制限されており、ほとんどの開発者には見えるようにはなっていません。ディレクトリはアップロードされたパッケージと暗号署名の完全性を照合する <command>dak process-upload</command> スクリプトによって15分毎にスキャンされます。パッケージがインストール可能であると判断されると、<filename>done</filename> ディレクトリに移動されます。これがパッケージの初アップロードの場合 (あるいは新たなバイナリパッケージを含んでいる場合)、ftpmaster による許可を待つ場所である <filename>new</filename> ディレクトリに移動されます。パッケージが ftpmaster によって手動でインストールされるファイルを含む場合は <filename>byhand</filename> ディレクトリ に移動します。それ以外の場合は、エラーが検出されるとパッケージは拒否されて <filename>reject</filename> ディレクトリへと移動されます。

source: Once the package is accepted, the system sends a confirmation mail to the maintainer and closes all the bugs marked as fixed by the upload, and the auto-builders may start recompiling it. The package is now publicly accessible at <ulink url="&url-incoming;"></ulink> until it is really installed in the Debian archive. This happens four times a day (and is also called the `dinstall run' for historical reasons); the package is then removed from incoming and installed in the pool along with all the other packages. Once all the other updates (generating new <filename>Packages</filename> and <filename>Sources</filename> index files for example) have been made, a special script is called to ask all the primary mirrors to update themselves.
de: Sobald das Paket akzeptiert wurde, sendet das System dem Betreuer per E-Mail eine Bestätigung, schließt alle Fehler, die durch das Hochladen als behoben markiert wurden und die Auto-Builder können beginnen, es erneut zu kompilieren. Das Paket ist nun öffentlich unter <ulink url="&url-incoming;"></ulink> zugänglich, bis es wirklich im Debian-Archiv installiert wird. Dies geschieht viermal täglich (und wird aus historischen Gründen »dinstall run« genannt). Das Paket wird dann aus dem Eingangssystem entfernt und zusammen mit den anderen Paketen in den Pool installiert. Sobald alle anderen Aktualisierungen (Erzeugen neuer <filename>Packages</filename>- und <filename>Sources</filename>-Indexdateien zum Beispiel) durchgeführt wurden, wird ein Spezialskript aufgerufen, das alle Primärspiegel auffordert, sich selbst zu aktualisieren.
fr: Une fois le paquet accepté, le système envoie une confirmation par courrier au responsable et ferme les bogues corrigés. Ensuite, les compilateurs automatiques peuvent commencer leur travail. À ce moment, le paquet est accessible sur <ulink url="&url-incoming;"></ulink> avant d'être vraiment installé dans l'archive Debian. Cette opération se produit quatre fois par jour (elle est aussi appelée « <literal>dinstall run</literal> » pour des raisons historiques) ; le paquet est alors supprimé de <filename>incoming</filename> et installé dans le <filename>pool</filename> avec les autres paquets. Une fois toutes les autres mises à jour (fabrication des nouveaux fichiers d'index <filename>Packages</filename> et <filename>Sources</filename> par exemple) effectuées, un script spécifique déclanche la mise à jour les miroirs primaires.
ja: パッケージが受け入れられると、システムは確認のメールをメンテナに送り、アップロードの際に修正済みとされたバグをクローズし、auto-builder がパッケージのリコンパイルを始めます。Debian アーカイブに実際にインストールされるまで、パッケージはすぐに <ulink url="&url-incoming;"></ulink> にてアクセス可能になります。この作業は 1 日に 4 回行われます (様々な経緯から `dinstall run' とも呼ばれています)。そしてパッケージは incoming から削除され、他のパッケージ全てと共に pool にインストールされます。他のすべての更新 (例えば <filename>Packages</filename> インデックスファイルや <filename>Sources</filename> インデックスファイル) が作成されると、一次ミラー全てを更新する特別なスクリプトが呼び出されます。

source: The archive maintenance software will also send the OpenPGP/GnuPG signed <filename>.changes</filename> file that you uploaded to the appropriate mailing lists. If a package is released with the <literal>Distribution</literal> set to <literal>stable</literal>, the announcement is sent to &email-debian-changes;. If a package is released with <literal>Distribution</literal> set to <literal>unstable</literal> or <literal>experimental</literal>, the announcement will be posted to &email-debian-devel-changes; instead.
de: Die Archivverwaltungs-Software wird außerdem die OpenPGP-/GnuPG-signierte <filename>.changes</filename>-Datei senden, die Sie an die entsprechenden Mailinglisten gesandt haben. Falls ein Paket veröffentlicht wird, bei dem die Distribution auf <literal>stable</literal> gesetzt ist, wird die Ankündigung an &email-debian-changes; gesandt. Falls ein Paket veröffentlicht wird, bei dem die Distribution auf <literal>unstable</literal> oder <literal>experimental</literal> gesetzt ist, wird die Ankündigung stattdessen an &email-debian-devel-changes; gesandt.
fr: Le logiciel de maintenance de l'archive enverra également le fichier <filename>.changes</filename> signé avec OpenPGP/GnuPG à la liste de diffusion appropriée. Pour un paquet avec le champ <literal>Distribution</literal> à « <literal>stable</literal> », l'annonce sera envoyée à &email-debian-changes;. Pour un paquet avec le champ <literal>Distribution</literal> à « <literal>unstable</literal> » ou « <literal>experimental</literal> », l'annonce sera envoyée à &email-debian-devel-changes;.
ja: アーカイブメンテナンスのソフトウェアは、あなたがアップロードした OpenPGP/GnuPG で署名された <filename>.changes</filename> ファイルも適切なメーリングリストへと送信します。パッケージの <literal>Distribution</literal> が<literal>stable</literal> に設定されてリリースされた場合、案内は &email-debian-changes; に送られます。パッケージの <literal>Distribution</literal> として <literal>unstable</literal> や <literal>experimental</literal> が設定されている場合、案内は代わりに &email-debian-devel-changes; へと投稿されます。

source: Though ftp-master is restricted, a copy of the installation is available to all developers on <literal>&ftp-master-mirror;</literal>.
de: Obwohl der FTP-Master eingeschränkt wurde, ist eine Kopie für alle Entwickler unter <literal>&ftp-master-mirror;</literal> verfügbar.
fr: Bien que ftp-master soit à accès restreint, une copie de l'installation est disponible à tous les développeurs sur <literal>&ftp-master-mirror;</literal>.
ja: ftp-master は利用が制限されているサーバなので、インストールされたもののコピーは <literal>&ftp-master-mirror;</literal> 上で全ての開発者が利用できるようになっています。

source: Package information
de: Paketinformationen
fr: Informations sur un paquet
ja: パッケージ情報

source: On the web
de: Im Web
fr: Sur le web
ja: ウェブ上から

source: Each package has several dedicated web pages. <literal>http://&packages-host;/<replaceable>package-name</replaceable></literal> displays each version of the package available in the various distributions. Each version links to a page which provides information, including the package description, the dependencies, and package download links.
de: Jedes Paket hat mehrere zugehörige Web-Seiten. <literal>http://&packages-host;/<replaceable>Paketname</replaceable></literal> zeigt jede Version des Pakets, die in verschiedenen Distributionen verfügbar ist. Jede Version verweist auf eine Seite, die Informationen einschließlich der Paketbeschreibung, der Abhängigkeiten und der Links zum Herunterladen, bereitstellt.
fr: Chaque paquet a plusieurs pages web dédiées. <literal>http://&packages-host;/<replaceable>nom-de-paquet</replaceable></literal> affiche chaque version du paquet disponible dans les différentes distributions. Les informations détaillées par version comme la description du paquet, les dépendances et des liens pour télécharger le paquet.
ja: パッケージはそれぞれ複数の目的別のウェブページを持っています。<literal>http://&packages-host;/<replaceable>package-name</replaceable></literal> は各ディストリビューション中でそれぞれ利用可能なパッケージバージョンを表示します。バージョン毎のリンク先のページはパッケージの説明、依存関係、ダウンロードへのリンクを含んだ情報を提供しています。

source: The bug tracking system tracks bugs for each package. You can view the bugs of a given package at the URL <literal>http://&bugs-host;/<replaceable>package-name</replaceable></literal>.
de: Die Fehlerdatenbank verfolgt Fehler für jedes Paket. Sie können die Fehler unter der URL <literal>http://&bugs-host;/<replaceable>Paketname</replaceable></literal> ansehen.
fr: Le système de suivi des bogues trie les bogues par paquet. Les bogues de chaque paquet sont disponibles sur <literal>http://&bugs-host;/<replaceable>nom-de-paquet</replaceable></literal>.
ja: バグ追跡システムは個々のパッケージのバグを記録していきます。<literal>http://&bugs-host;/<replaceable>package-name</replaceable></literal> というような URL で与えたパッケージ名のバグを閲覧できます。

source: The <command>dak ls</command> utility
de: Das Hilfswerkzeug <command>dak ls</command>
fr: Utilitaire <command>dak ls</command>
ja: <command>dak ls</command> ユーティリティ

source: <command>dak ls</command> is part of the dak suite of tools, listing available package versions for all known distributions and architectures. The <command>dak</command> tool is available on <literal>&ftp-master-host;</literal>, and on the mirror on <literal>&ftp-master-mirror;</literal>. It uses a single argument corresponding to a package name. An example will explain it better:
de: <command>dak ls</command> ist Teil der Werkzeugsammlung Dak, die verfügbare Paketversionen für alle bekannten Distributionen und Architekturen auflistet. Das Werkzeug <command>dak</command> ist auf <literal>&ftp-master-host;</literal> und auf dem Spiegel <literal>&ftp-master-mirror;</literal> verfügbar. Es benutzt ein einziges Argument, das einem Paketnamen entspricht. Ein Beispiel erklärt es besser:
fr: <command>dak ls</command> fait partie de la suite <literal>dak</literal> (« <literal>Debian Archive Kit</literal> ») et liste les versions disponibles de paquet pour toutes les distributions et architectures connues. L'outil <command>dak</command> est disponible sur <literal>&ftp-master-host; </literal> et sur le miroir <literal>&ftp-master-mirror;</literal>. Il utilise un seul paramètre qui correspond au nom du paquet. Un exemple vaut mieux qu'un long discours :
ja: <command>dak ls</command> は dak ツールスイートの一部で、全ディストリビューションおよびアーキテクチャの中から利用可能なパッケージバージョンをリストアップします。<command>dak</command> ツールは <literal>&ftp-master-host;</literal> 上と、<literal>&ftp-master-mirror;</literal> 上のミラーにて利用できます。パッケージ名に対して一つの引数を使います。実際に例を挙げた方が分かりやすいでしょう:

source: In this example, you can see that the version in <literal>unstable</literal> differs from the version in <literal>testing</literal> and that there has been a binary-only NMU of the package for all architectures. Each version of the package has been recompiled on all architectures.
de: An diesem Beispiel können Sie sehen, dass sich die Version in <literal>unstable</literal> von der Version in <literal>testing</literal> unterscheidet und dass dort ein rein binärer NMU des Pakets für alle Architekturen durchgeführt wurde. Jede Version des Pakets wurde auf allen Architekturen neu kompiliert.
fr: Dans cet exemple, on peut voir que la version dans <literal>unstable</literal> n'est pas la même que dans <literal>testing</literal> où seul le binaire a été mis à jour indépendamment (« <literal>binary-only NMU</literal> ») pour toutes les architectures. Chaque version du paquet a été recompilé sur toutes les architectures.
ja: この例では、<literal>不安定版 (unstable)</literal> でのバージョンは <literal>テスト版 (testing)</literal> のバージョンと違っており、テスト版のパッケージは全アーキテクチャについて、binary-only NMU されたパッケージになっています。それぞれのバージョンのパッケージは、全アーキテクチャ上で再コンパイルされています。

source: The Package Tracking System
de: Das Paketverfolgungssystem
fr: Système de suivi des paquets (<literal>PTS</literal>)
ja: パッケージ追跡システム

source: The Package Tracking System (PTS) is an email-based tool to track the activity of a source package. This really means that you can get the same emails that the package maintainer gets, simply by subscribing to the package in the PTS.
de: Das Paketverfolgungssystem (Package Tracking System/PTS) ist ein E-Mail-basiertes Werkzeug, das die Aktivität eines Quellpakets verfolgt. Dies bedeutet tatsächlich, dass Sie die gleichen E-Mails wie der Paketbetreuer erhalten, indem Sie einfach sich einfach im PTS beim Paket einschreiben.
fr: Le système de suivi des paquets (« <literal>Package Tracking System</literal> » ou <literal>PTS</literal>) est un outil de suivi par courrier de l'activité d'un paquet source. Cela signifie que l'on peut vraiment recevoir les mêmes courriers que le responsable, simplement en s'inscrivant au paquet dans le PTS.
ja: パッケージ追跡システム (PTS) は、ソースパッケージの動きを追いかけるメールベースのツールです。これが意味する所は、PTS のパッケージに対して購読 (subscribe) を行うだけで、パッケージメンテナが受け取るメールとまったく同じものを受け取れるということです。

source: Each email sent through the PTS is classified under one of the keywords listed below. This will let you select the mails that you want to receive.
de: Jede E-Mail, die durch das PTS versandt wird, ist unter einem der nachfolgenden Schlüsselwörter aufgelistet. Dies wird Ihnen sie Auswahl erleichtern, welche E-Mails Sie erhalten möchten.
fr: Chaque courrier envoyé par le PTS est classé sous l'un des mots-clés listés ci-dessous. Ceci permet de sélectionner les courriers à recevoir.
ja: PTS から送られるメールは以下のキーワードリストのうち一つに分類されます。これによって、受け取りたいメールを選別できます。

source: By default you will get:
de: Standardmäßig erhalten Sie:
fr: Par défaut, sont reçus :
ja: デフォルトで受け取るもの:

source: All the bug reports and following discussions.
de: alle Fehlerberichte und folgenden Diskussioen
fr: tous les rapports de bogue et les discussions qui suivent ;
ja: バグ報告とそれに続くディスカッション全て。

source: The email notifications from <email>control@&bugs-host;</email> about bug report status changes.
de: die E-Mail-Benachrichtigungen von <email>control@&bugs-host;</email> über Statusänderungen von Fehlermeldungen
fr: les courriers d'information de <email>control@&bugs-host;</email> lors des changements d'état de rapport de bogue ;
ja: バグ報告の状態変更について、<email>control@&bugs-host;</email> からのメール通知。

source: The email notification from <command>dak</command> when an uploaded source package is accepted.
de: die E-Mail-Benachrichtigung von <command>dak</command>, wenn ein hochgeladenes Quellpaket akzeptiert wird
fr: le courrier d'information de <command>dak</command> quand un paquet source est accepté ;
ja: アップロードされたソースパッケージが受理された際の <command>dak</command> からのメール通知。

source: Other warning and error emails from <command>dak</command> (such as an override disparity for the section and/or the priority field).
de: andere Warn- und Fehler-E-Mails von <command>dak</command> (wie beispielsweise Unterschiedlichkeit beim Überschreiben eines Abschnitts oder eines Prioritätsfelds).
fr: les autres courriers d'avertissement et d'erreur de <command>dak</command> (comme une incohérence de modification des champs de section ou de priorité) ;
ja: <command>dak</command> からの他の警告／エラーメール (セクション (section) や優先度 (priority) フィールドの相違の上書きなど)。

source: Build failures notifications sent by the network of build daemons, they contain a pointer to the build logs for analysis.
de: Benachrichtigungen über das Fehlschlagen der Paketerstellung, gesandt durch das Netzwerk der Paketerstellungs-Daemons. Sie enthalten für Analysen einen Zeiger auf die Erstellungsprotokolle.
fr: les courriers d'information envoyées par le réseau des démons de compilation, qui mentionnent un lien vers les journaux de compilation afin de les analyser ;
ja: ビルド失敗の通知はビルドデーモンのネットワークによって送信されます。この通知には分析のためのビルドログへのポインタが含まれています。

source: Any non-automatic email sent to the PTS by people who wanted to contact the subscribers of the package. This can be done by sending mail to <literal><replaceable>sourcepackage</replaceable>@&pts-host;</literal>. In order to prevent spam, all messages sent to these addresses must contain the <literal>X-PTS-Approved</literal> header with a non-empty value.
de: jede nicht automatische E-Mail, die durch Leute an das PTS geschickt wird, die Kontakt zu den Abonnenten des Pakets aufnehmen möchten. Dies kann durch Senden einer E-Mail an <literal><replaceable>Quellpaket</replaceable>@&pts-host;</literal> erledigt werden. Um Spam zu vermeiden, müssen alle Nachrichten, die an diese Adressen gesandt werden, die Kopfzeile <literal>X-PTS-Approved</literal> mit einem nicht leeren Wert enthalten.
fr: tout courrier non automatique envoyé au PTS pour contacter les inscrits au paquet. Ceci peut être fait en envoyant un courrier à <literal><replaceable>paquet-source</replaceable>@&pts-host;</literal>. Pour prévenir l'envoi de pourriels, tous les courriers envoyés à ces adresses doivent contenir l'en-tête <literal>X-PTS-Approved</literal> avec une valeur non vide ;
ja: 自動ではない、パッケージの購読者にコンタクトしたい人によって PTS に送られるメール。これは、<literal><replaceable>sourcepackage</replaceable>@&pts-host;</literal> にメールすることで可能になります。spam メールを防ぐため、このアドレスに送られるメッセージは全て空の値の <literal>X-PTS-Approved</literal> ヘッダを含む必要があります。

source: Mails sent to the maintainer through the *@packages.debian.org email aliases.
de: Mails, die dem Betreuer mittels der *@packages.debian.org-E-Mail-Aliase gesandt werden.
fr: les courriers envoyés au responsable via l'alias <literal>*@packages.debian.org</literal> ;
ja: *@packages.debian.org のメールエイリアスを通じてメンテナに送信されたメール。

source: Regular summary emails about the package's status, including progression into <literal>testing</literal>, <ulink url="&url-dehs;">DEHS</ulink> notifications of new upstream versions, and a notification if the package is removed or orphaned.
de: regelmäßige Zusammenfassungs-E-Mails über den Status des Pakets, einschließlich Fortschritt in <literal>testing</literal>, <ulink url="&url-dehs;">DEHS</ulink>-Benachrichtigungen von neuen Originalversionen und einer Benachrichtigung, falls das Paket entfernt oder verwaist wird.
fr: les courriers de résumé réguliers sur l'état du paquet, comme la progression du paquet dans <literal>testing</literal>, les notifications de l'<ulink url="&url-dehs;">état de santé extérieur à Debian (« <literal>Debian External Health Status</literal> » ou <literal>DEHS</literal>)</ulink> lors qu'une nouvelle version amont est disponible, et la notification si un paquet est enlevé de l'archive ou orphelin.
ja: <literal>testing</literal> への移行や、<ulink url="&url-dehs;">DEHS</ulink> での開発元の新しいバージョンの通知、パッケージが削除あるいはみなしごか (orphaned) されたなどを含むパッケージの状態について、定期的なメールでのサマリ。

source: You can also decide to receive additional information:
de: Sie können sich außerdem entscheiden, zusätzliche Informationen zu erhalten:
fr: Il est également possible de recevoir des informations supplémentaires :
ja: 受け取るかどうかを決められる追加情報:
