Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: <systemitem role="package">debhelper</systemitem> is a collection of programs which can be used in <filename>debian/rules</filename> to automate common tasks related to building binary Debian packages. <systemitem role="package">debhelper</systemitem> includes programs to install various files into your package, compress files, fix file permissions, and integrate your package with the Debian menu system.
de: <systemitem role="package">debhelper</systemitem> ist eine Programmsammlung, die in <filename>debian/rules</filename> benutzt werden kann, um häufige Aufgaben zu automatisieren, die sich auf das Erstellen binärer Debian-Pakete beziehen. <systemitem role="package">debhelper</systemitem> enthält Programme, um verschiedene Dateien in Ihre Pakete zu installieren, Dateien zu komprimieren, Dateirechte zu korrigieren und Ihr Paket in das Debian-Menüsystem zu integrieren.
fr: <systemitem role="package">debhelper</systemitem> regroupe un ensemble de programmes pouvant être utilisés dans <filename>debian/rules</filename> pour automatiser les tâches courantes relatives à la fabrication de paquets Debian binaires. <systemitem role="package">debhelper</systemitem> inclut des programmes pour installer différents fichiers, les compresser, ajuster leurs droits et intégrer votre paquet dans le système de menu Debian.
ja: <systemitem role="package">debhelper</systemitem> は、Debian パッケージのバイナリを作成するにあたっての共通な作業を自動化するため、<filename>debian/rules</filename> 内で使うことができるプログラムの集合体です。<systemitem role="package">debhelper</systemitem> は、パッケージに様々なファイルをインストールし、ファイルを圧縮し、ファイルの権限を修正し、パッケージを Debian のメニューシステムに統合するプログラムを含んでいます。

source: Unlike some approaches, <systemitem role="package">debhelper</systemitem> is broken into several small, simple commands which act in a consistent manner. As such, it allows more fine-grained control than some of the other debian/rules tools.
de: Anders als bei einigen Herangehensweisen ist <systemitem role="package">debhelper</systemitem> in mehrere kleine einfache Befehle unterteilt, die auf eine durchgängige Art zusammenarbeiten. Als solches erlaubt es eine detailliertere Steuerung, als andere Werkzeuge für »debian/rules«.
fr: À la différence d'autres approches, <systemitem role="package">debhelper</systemitem> est divisé en plusieurs petits utilitaires simples qui agissent de manière cohérente. Ce découpage permet un contrôle des opérations plus fin que certains des autres outils pour <filename>debian/rules</filename>.
ja: いくつかのアプローチとは違って、<systemitem role="package">debhelper</systemitem> は複数の小さな、シンプルな一貫した方法で動作するコマンドに分割されています。そのため、他の debian/rules 用ツールよりも細やかなコントロールが可能になっています。

source: There are a number of little <systemitem role="package">debhelper</systemitem> add-on packages, too transient to document. You can see the list of most of them by doing <literal>apt-cache search ^dh-</literal>.
de: Es gibt eine zu große Zahl kleiner Erweiterungspakete für <systemitem role="package">debhelper</systemitem>, die zu kurzlebig sind, um sie zu dokumentieren. Sie können die Liste der meisten von Ihnen ansehen, indem Sie <literal>apt-cache search ^dh-</literal> aufrufen.
fr: Il existe aussi un certain nombre de petites extensions <systemitem role="package">debhelper</systemitem> trop éphémères pour être documentées ici. La plupart seront listés avec <literal>apt-cache search ^dh-</literal>.
ja: ここに記すには一時的な、大量の小さな <systemitem role="package">debhelper</systemitem> のアドオンパッケージがあります。<literal>apt-cache search ^dh-</literal> と実行することで一覧の多くを参照できます。

source: The <systemitem role="package">dh-make</systemitem> package contains <command>dh_make</command>, a program that creates a skeleton of files necessary to build a Debian package out of a source tree. As the name suggests, <command>dh_make</command> is a rewrite of <systemitem role="package">debmake</systemitem> and its template files use <command>dh_*</command> programs from <systemitem role="package">debhelper</systemitem>.
de: Das Paket <systemitem role="package">dh-make</systemitem> enthält ein Programm gleichen Namens, das ein Gerüst von Dateien erstellt, die nötig sind, um Debian-Pakete aus einem Quellcodeverzeichnisbaum zu erstellen. Wie der Name schon nahelegt, ist <command>dh_make</command> eine Neufassung von <systemitem role="package">debmake</systemitem> dessen Schablonendateien <command>dh_*</command>-Programme von <systemitem role="package">debhelper</systemitem> benutzen.
fr: <systemitem role="package">dh-make</systemitem> contient <command>dh_make</command>, un programme qui crée un squelette de fichiers nécessaires à la construction d'un paquet Debian à partir d'une arborescence source. Comme le nom le suggère, <command>dh_make</command> est une réécriture de <systemitem role="package">debmake</systemitem> et ses fichiers modèles utilisent les programmes <command>dh_*</command> de <systemitem role="package">debhelper</systemitem>.
ja: <systemitem role="package">dh-make</systemitem> パッケージは、ソースツリーを Debian パッケージをビルドするのに必要な雛形ファイルを作成するプログラム <command>dh_make</command> を含んでいます。その名が示すように、<command>dh_make</command> は <systemitem role="package">debmake</systemitem> を書き直したもので、そのテンプレートファイルは<systemitem role="package">debhelper</systemitem> の <command>dh_*</command> プログラムを使うようになっています。

source: While the rules files generated by <command>dh_make</command> are in general a sufficient basis for a working package, they are still just the groundwork: the burden still lies on the maintainer to finely tune the generated files and make the package entirely functional and Policy-compliant.
de: Während die von <command>dh_make</command> generierten »rules«-Dateien im Allgemeinen eine ausreichende Basis für ein funktionierendes Paket bilden, gibt es immer noch die grundlegenden Arbeiten: Die Last für die Feinabstimmung und das Paket funktional und richtlinienkonform zu machen, liegt immer noch beim Betreuer.
fr: Quoique les fichiers de règles fabriqués par <command>dh_make</command> constituent en général une base suffisante pour un paquet fonctionnel, ce ne sont que les fondations : la charge incombe toujours au responsable d'affiner les fichiers générés et de rendre le paquet complètement fonctionnel et en conformité avec la Charte.
ja: <command>dh_make</command> によって生成された rules ファイルは、大抵の場合作業するパッケージに対して十分な基礎にはなりますが、まだこれは下地でしかありません。メンテナに残っている責務は、生成されたファイルをきれいに整理して、完全に動作してポリシーに準拠したパッケージにすることです。

source: <systemitem role="package">equivs</systemitem> is another package for making packages. It is often suggested for local use if you need to make a package simply to fulfill dependencies. It is also sometimes used when making ``meta-packages'', which are packages whose only purpose is to depend on other packages.
de: <systemitem role="package">equivs</systemitem> ist ein weiteres Paket für die Paketerstellung. Es wird oft für den lokalen Gebrauch vorgeschlagen, falls Sie einfach ein Paket erstellen müssen, um Abhängigkeiten zu erfüllen. Es wird manchmal auch benutzt, um »Meta-Pakete« zu erstellen. Dabei handelt es sich um Pakete, deren einziger Zweck darin besteht, von anderen Paketen abzuhängen.
fr: <systemitem role="package">equivs</systemitem> est encore un assistant. Il est souvent conseillé pour un usage local, pour faire un paquet qui satisfasse des dépendances. Il est aussi parfois utilisé pour faire des « métapaquets », dont l'unique objet est de dépendre d'autres paquets.
ja: <systemitem role="package">equivs</systemitem> はパッケージ作成用のもう一つのパッケージです。単純に依存関係を満たしたいだけのパッケージを作成する必要がある場合に、しばしばローカルでの使用を勧められます。時折、他のパッケージに依存することだけが目的のパッケージ、「メタパッケージ (meta-packages)」を作る際にも使われます。

source: Package builders
de: Paket-Builder
fr: Construction de paquets
ja: パッケージ作成ツール

source: The following packages help with the package building process, general driving <command>dpkg-buildpackage</command> as well as handling supporting tasks.
de: Die folgenden Pakete helfen beim Prozess der Paketerstellung und führen im Allgemeinen <command>dpkg-buildpackage</command> aus, um unterstützende Aufgaben zu behandeln.
fr: Les paquets suivants facilitent le processus de construction des paquets, en contrôlant globalement <command>dpkg-buildpackage</command> ainsi que la gestion des tâches.
ja: 以下のパッケージは、パッケージ作成作業を手助けしてくれます。通常実行する <command>dpkg-buildpackage</command> と同様に、パッケージ作成支援の作業を取り扱ってくれます。

source: <systemitem role="package">cvs-buildpackage</systemitem> provides the capability to inject or import Debian source packages into a CVS repository, build a Debian package from the CVS repository, and helps in integrating upstream changes into the repository.
de: <systemitem role="package">cvs-buildpackage</systemitem> stellt die Fähigkeit bereit, wichtige Debian-Quellpakete in ein CVS-Depot einzuspeisen, ein Debian-Paket aus dem CVS-Depot zu erstellen und bei der Integration von Änderungen der Originalautoren in das CVS-Depot zu helfen.
fr: <systemitem role="package">cvs-buildpackage</systemitem> permet de mettre à jour ou de récupérer des paquets source dans un référentiel CVS, il permet de fabriquer un paquet Debian depuis le référentiel CVS et assiste le responsable lors de l'intégration de modifications amont dans le référentiel.
ja: <systemitem role="package">cvs-buildpackage</systemitem> は、Debian ソースパッケージを CVS リポジトリに挿入あるいはインポートし、Debian パッケージを CVS リポジトリから生成、そして開発元での変更をリポジトリに統合するのに役立つ機能を提供します。

source: These utilities provide an infrastructure to facilitate the use of CVS by Debian maintainers. This allows one to keep separate CVS branches of a package for <literal>stable</literal>, <literal>unstable</literal> and possibly <literal>experimental</literal> distributions, along with the other benefits of a version control system.
de: Diese Hilfswerkzeuge bieten eine Infrastruktur, um Debian-Betreuern den Gebrauch von CVS zu erleichtern. Dies ermöglicht getrennte Zweige von Paketen für die Distributionen <literal>stable</literal>, <literal>unstable</literal> und möglicherweise <literal>experimental</literal> vorzuhalten, zusammen mit den anderen Vorteilen eines Versionsverwaltungssystems.
fr: Ce paquet fournit l'infrastructure facilitant l'utilisation de CVS pour le responsable Debian. Il permet de conserver des branches CVS distinctes pour les distributions <literal>stable</literal>, <literal>unstable</literal> et éventuellement <literal>experimental</literal> et de bénéficier des avantages d'un système de gestion de version.
ja: これらのユーティリティは、Debian メンテナによる CVS の利用を促進するインフラストラクチャを提供します。これは、バージョンコントロールシステムの他の利点と同様に、<literal>stable</literal>、<literal>unstable</literal>、おそらく <literal>experimental</literal> ディストリビューション用にパッケージに個々の CVS ブランチを持つことができます。

source: The <systemitem role="package">debootstrap</systemitem> package and script allows you to bootstrap a Debian base system into any part of your filesystem. By base system, we mean the bare minimum of packages required to operate and install the rest of the system.
de: Das Paket und Skript <systemitem role="package">debootstrap</systemitem> ermöglicht Ihnen das Urladen eines Debian-Basissystems in irgendeinen Teil Ihres Dateisystems. Mit Basissystem ist ein Minimum an installierten Paketen gemeint, die nötig sind, um des Rest des Systems zu betreiben und zu installieren.
fr: <systemitem role="package">debootstrap</systemitem> permet d'amorcer un système Debian de base à n'importe quel endroit de votre système de fichiers. « Système de base » signifie ici le strict minimum de paquets nécessaires pour fonctionner et installer le reste du système.
ja: <systemitem role="package">debootstrap</systemitem> パッケージとスクリプトは、システムのどこででも Debian ベースシステムをブートストラップできるようにしてくれます。ベースシステムとは、操作するのに必要となる素の最小限パッケージ群を意味し、それに加えてシステムの残りの部分をインストールします。

source: Having a system like this can be useful in many ways. For instance, you can <command>chroot</command> into it if you want to test your build dependencies. Or you can test how your package behaves when installed into a bare base system. Chroot builders use this package; see below.
de: Ein solches System zu haben, kann in vielerlei Hinsicht nützlich sein. Sie können zum Beispiel mit <command>chroot</command> in das System gehen und wenn Sie wollen, Ihre Build-Abhängigkeiten testen. Oder Sie können testen, wie sich Ihr Paket verhält, wenn es in ein nacktes Basissystem installiert wird. Chroot-Builder benutzen dieses Paket; siehe Folgendes.
fr: Un système comme celui-ci peut être utilisé de nombreuses façons différentes. Par exemple, avec <command>chroot</command>, vous pouvez y tester les dépendances de construction. Vous pouvez aussi vérifier le comportement d'un paquet installé dans un environnement minimum. Les automates de constructions « <literal>chrootés</literal> » utilisent ce paquet ; voir ci-après.
ja: この様なシステムを持つことは、様々な面で役に立つでしょう。例えば、ビルドの依存関係をテストしたい場合に <command>chroot</command> でそのシステムの中に入ることができます。あるいは素のベースシステムにインストールした際にパッケージがどのように振る舞うかをテストできます。chroot 作成ツールはこのパッケージを使います。以下を参照ください。

source: <systemitem role="package">pbuilder</systemitem> constructs a chrooted system, and builds a package inside the chroot. It is very useful to check that a package's build-dependencies are correct, and to be sure that unnecessary and wrong build dependencies will not exist in the resulting package.
de: <systemitem role="package">pbuilder</systemitem> konstruiert ein Chroot-System und erstellt ein Paket innerhalb der Chroot-Umgebung. Es ist sehr nützlich, um zu prüfen, ob die Build-Abhängigkeiten des Pakets korrekt sind und um sicher zu sein, dass keine unnötigen oder falschen Build-Abhängigkeiten in dem resultierenden Paket existieren.
fr: <systemitem role="package">pbuilder</systemitem> construit un système « <literal>chrooté</literal> » et compile des paquets dans ce système. C'est très pratique pour vérifier que les dépendances de compilation d'un paquet sont correctes et pour s'assurer qu'aucune dépendance de construction inutile ou incorrecte n'existe dans le paquet résultant.
ja: <systemitem role="package">pbuilder</systemitem> は chroot されたシステムを構築し、パッケージを chroot 内部でビルドします。パッケージのビルド依存関係が正しいかどうかをチェックするのにとても役立ち、生成されたパッケージに不必要な誤ったビルド依存関係が存在していないことを確かめられるでしょう。

source: A related package is <systemitem role="package">pbuilder-uml</systemitem>, which goes even further by doing the build within a User Mode Linux environment.
de: Ein verwandtes Paket ist <systemitem role="package">pbuilder-uml</systemitem>, das sogar noch weiter geht, indem es den Build innerhalb einer User-Mode-Linux-Umgebung durchführt.
fr: <systemitem role="package">pbuilder-uml</systemitem> est un paquet similaire, qui va même plus loin en réalisant la construction au sein d'un environnement « <literal>User Mode Linux</literal> ».
ja: User Mode Linux 環境でビルドを実行することで、よりさらに推し進めた関連パッケージが <systemitem role="package">pbuilder-uml</systemitem> です。

source: <systemitem role="package">sbuild</systemitem> is another automated builder. It can use chrooted environments as well. It can be used stand-alone, or as part of a networked, distributed build environment. As the latter, it is part of the system used by porters to build binary packages for all the available architectures. See <xref linkend="wanna-build"/> for more information, and <ulink url="&url-buildd;"></ulink> to see the system in action.
de: <systemitem role="package">sbuild</systemitem> ist ein weiterer automatisierter Builder. Er kann auch Chroot-Umgebungen benutzen. Er kann eigenständig benutzt werden oder als Teil einer verteilten Build-Umgebung über ein Netzwerk. Als letzteres ist er Teil des Systems, das Portierer benutzen, um Binärpakete für all die verfügbaren Architekturen zu erstellen. Weitere Informationen finden Sie unter <xref linkend="wanna-build"/> und das System können Sie unter <ulink url="&url-buildd;"></ulink> in Aktion sehen.
fr: <systemitem role="package">sbuild</systemitem> est un autre compilateur automatique. Il peut également être utilisé dans un environnement « <literal>chrooté</literal> ». Il peut être utilisé seul ou comme partie d'un environnement de compilation distribué en réseau. Comme le précédent, il fait partie du système utilisé par les porteurs pour construire des paquets binaires pour toutes les architectures disponibles. Voir <xref linkend="wanna-build"/> pour plus d'informations et <ulink url="&url-buildd;"></ulink> pour voir le système en fonctionnement.
ja: <systemitem role="package">sbuild</systemitem> はもう一つの自動ビルドシステムです。同様に chroot された環境を使うことが出来ます。単独で使うことも、分散ビルド環境のネットワークの一部として使うこともできます。文字通り、移植者たちによって利用可能な全アーキテクチャのバイナリパッケージをビルドするのに使われているシステムの一部です。詳細については<xref linkend="wanna-build"/> を参照してください。それからシステムの動作については <ulink url="&url-buildd;"></ulink> を参照してください。

source: Package uploaders
de: Programme zum Hochladen von Paketen
fr: Envoi de paquets
ja: パッケージのアップロード用ツール

source: The following packages help automate or simplify the process of uploading packages into the official archive.
de: Die folgenden Pakete helfen den Prozess, Pakete in das offizielle Archiv hochzuladen, zu automatisieren oder zu vereinfachen.
fr: Les paquets suivants aident à automatiser ou simplifier le processus d'envoi de paquets dans l'archive officielle.
ja: 以下のパッケージはパッケージを公式アーカイブにアップロードする作業を自動化、あるいは単純化してくれるのに役立ちます。

source: <systemitem role="package">dupload</systemitem> is a package and a script to automatically upload Debian packages to the Debian archive, to log the upload, and to send mail about the upload of a package. You can configure it for new upload locations or methods.
de: <systemitem role="package">dupload</systemitem> ist ein Paket und ein Skript, um Debian-Pakete automatisch in das Debian-Archiv hochzuladen, den Upload zu protokollieren und Mails über den Upload eines Pakets zu versenden. Sie können es für neue Upload-Orte und -Methoden konfigurieren.
fr: <systemitem role="package">dupload</systemitem> contient un script du même nom pour envoyer des paquets dans l'archive Debian, suivre les envois, et les annoncer par courrier électronique. Il peut être configuré pour envoyer les paquets ailleurs ou avec d'autres méthodes.
ja: <systemitem role="package">dupload</systemitem> は、自動的に Debian パッケージを Debian アーカイブにアップロードし、アップロードを記録し、パッケージのアップロードについてのメールを送信してくれるパッケージであり、スクリプトです。新しいアップロード先や方法を設定することもできます。

source: The <systemitem role="package">dput</systemitem> package and script does much the same thing as <systemitem role="package">dupload</systemitem>, but in a different way. It has some features over <systemitem role="package">dupload</systemitem>, such as the ability to check the GnuPG signature and checksums before uploading, and the possibility of running <command>dinstall</command> in dry-run mode after the upload.
de: Das Paket und Skript <systemitem role="package">dput</systemitem> tut das gleiche wie <systemitem role="package">dupload</systemitem>, aber auf eine andere Art. Es hat einige Funktionalitäten mehr als <systemitem role="package">dupload</systemitem>, wie die Fähigkeit GnuPG-Signaturen und Prüfsummen vor dem Upload zu überprüfen und die Möglichkeit nach dem Upload <command>dinstall</command> im Leerlaufmodus auszuführen.
fr: <systemitem role="package">dput</systemitem> fait à peu près la même chose que <systemitem role="package">dupload</systemitem>, mais autrement. Il possède quelques fonctions supplémentaires comme la possibilité de vérifier la signature GnuPG et les sommes de contrôles avant l'envoi, ainsi que la possibilité de démarrer <command>dinstall</command> en mode simulation (« <literal>dry-run</literal> ») après l'envoi.
ja: <systemitem role="package">dput</systemitem> パッケージとスクリプトは <systemitem role="package">dupload</systemitem> と同じことを違ったやり方で行います。GnuPG 署名とチェックサムをアップロード前にチェックする機能や、アップロード後に <command>dinstall</command> を dry-run モードで実行できるなど、<systemitem role="package">dupload</systemitem> よりもいくつか機能が多くなっています。

source: The <command>dcut</command> script (part of the package <systemitem role="package">dput</systemitem>, <xref linkend="dput"/>) helps in removing files from the ftp upload directory.
de: Das Skript <command>dcut</command> (Teil des Pakets <systemitem role="package">dput</systemitem>, <xref linkend="dput"/>) hilft beim Entfernen von Dateien aus dem FTP-Upload-Verzeichnis.
fr: <command>dcut</command> (du paquet <systemitem role="package">dput</systemitem>, <xref linkend="dput"/>) permet de supprimer des fichiers du répertoire d'envoi FTP.
ja: <command>dcut</command> スクリプト (<systemitem role="package">dput</systemitem> パッケージの一部、<xref linkend="dput"/> 参照)は、ftp アップロードディレクトリからファイルを削除するのに役立ちます。

source: Maintenance automation
de: Verwaltungsautomatisierung
fr: Automatisation de la maintenance
ja: メンテナンスの自動化

source: The following tools help automate different maintenance tasks, from adding changelog entries or signature lines and looking up bugs in Emacs to making use of the newest and official <filename>config.sub</filename>.
de: Die folgenden Werkzeuge helfen verschiedene Verwaltungsaufgaben vomHinzufügen von Änderungsprotokolleinträgen oder Signaturzeilen bis zum Nachschlagen von Fehlern in Emacs zum Gebrauch vom neusten und offiziellen <filename>config.sub</filename> zu automatisieren.
fr: Les outils suivants permettent d'automatiser les différentes tâches de maintenance en ajoutant des entrées au journal de modification ou des lignes de signatures, en cherchant des bogues depuis Emacs et en utilisant le fichier officiel <filename>config.sub</filename> le plus récent.
ja: 以下のツールは changelog のエントリや署名行の追加、Emacs 内でのバグの参照から最新かつ公式の <filename>config.sub</filename> を使うようにするまで、様々なメンテナンス作業を自動化するのに役立ちます。
