Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: This command will first synchronize the PO and POT files in <filename>debian/po</filename> with the templates files listed in <filename>debian/po/POTFILES.in</filename>. Then, it will send a call for new translations, in the &email-debian-i18n; mailing list. Finally, it will also send a call for translation updates to the language team (mentioned in the <literal>Language-Team</literal> field of each PO file) as well as the last translator (mentioned in <literal>Last-translator</literal>).
de: Dieser Befehl wird zuerst die PO- und POT-Dateien in <filename>debian/po</filename> mit dem Schablonendateien synchronisieren, die in <filename>debian/po/POTFILES.in</filename> aufgeführt sind. Dann wird er einen Aufruf für neue Übersetzungen an die Mailingliste &email-debian-i18n; senden. Am Schluss wird er außerdem einen Aufruf für neue Übersetzungen an das Sprach-Team (im Feld <literal>Language-Team</literal> jeder PO-Datei erwähnt) sowie den letzten Übersetzer (erwähnt in <literal>Last-translator</literal>) senden.
fr: Cette commande synchronisera d'abord les fichiers PO et POT de <filename>debian/po</filename> avec les fichiers d'écrans listés en <filename>debian/po/POTFILES.in</filename>. Ensuite, elle déclenchera un appel à de nouvelles traductions sur la liste de diffusion &email-debian-i18n;. Enfin, elle déclenchera un appel à mise à jour de traduction aux équipes de traductions (indiquées dans le champ <literal>Language-Team</literal> de chaque fichier PO) ainsi qu'au dernier traducteur (indiqué en <literal>Last-translator</literal>).
ja: このコマンドは、まず <filename>debian/po</filename> にある PO ファイルと POT ファイルを <filename>debian/po/POTFILES.in</filename> に記載しているテンプレートファイルを使って同期します。そして、&email-debian-i18n; メーリングリストに call for new translations (新しい翻訳作業の募集) を送信します。最後に、call for translation updates (翻訳更新作業者の募集) を (各 PO ファイルの <literal>Language-Team</literal> 欄に記載されている) 各言語チームおよび (<literal>Last-translator</literal> に記載されている) 最後の翻訳者に送信します。

source: Giving a deadline to translators is always appreciated, so that they can organize their work. Please remember that some translation teams have a formalized translate/review process and a delay lower than 10 days is considered as unreasonable. A shorter delay puts too much pressure on translation teams and should be kept for very minor changes.
de: Es wird immer gewürdigt, wenn Sie den Übersetzern einen Abgabetermin geben, so dass sie ihre Arbeit organisieren können. Bitte denken Sie daran, dass einige Übersetzer-Teams einen formalisierten Übersetzung-/Korrekturprozess haben und eine Zeitspanne, die kürzer als zehn Tage ist, als unangemessen angesehen wird. Eine kürzere Frist übt zuviel Druck auf die Übersetzer-Teams aus und sollte für sehr kleine Änderungen genommen werden.
fr: La mention d'une date limite aux traducteurs est toujours appréciée, pour leur permettre d'organiser leur travail. Veuillez ne pas oublier que certaines équipes ont formalisé leur processus de traduction et révision de telle sorte qu'un délai inférieur à dix jours n'est pas considéré comme raisonnable. Un délai plus court met trop de pression sur les équipes de traduction et ne devrait être réservé qu'aux modifications mineures.
ja: 翻訳作業者に締切りを伝えるのは常にお勧めです。それによって、彼らは作業を調整できます。いくつかの翻訳作業チームは形式化された翻訳／レビュープロセスを整えており、10 日未満の猶予は不合理であると考えられています。より短い猶予期間は強すぎるプレッシャーを翻訳チームに与えるので、非常に些細な変更点に対してのみに留めるべきです。

source: If in doubt, you may also contact the translation team for a given language (debian-l10n-xxxxx@&lists-host;), or the &email-debian-i18n; mailing list.
de: Im Zweifelsfall können Sie auch das Übersetzer-Team für eine bestimmte Sprache (debian-l10n-xxxxx@&lists-host;) oder die Mailingliste &email-debian-i18n; kontaktieren.
fr: Dans le doute, vous pouvez également contacter l'équipe de traduction d'une langue donnée (debian-l10n-xxxxx@&lists-host;) ou la liste de diffusion &email-debian-i18n;.
ja: 迷った場合は、該当の言語の翻訳チーム (debian-l10n-xxxxx@&lists-host;) か &email-debian-i18n; にも問い合わせましょう。

source: Unfuzzy complete translations when correcting typos and spelling
de: Entfernen Sie die Fuzzy-Markierungen in vollständigen Übersetzungen, wenn Sie Tipp- und Rechtschreibfehler korrigieren.
fr: Correction (« <literal>unfuzzy</literal> ») des traductions pour des erreurs typographiques ou de frappe
ja: 誤字やミススペルを修正する際に fuzzy を取る

source: When the text of a debconf template is corrected and you are <emphasis role="strong">sure</emphasis> that the change does <emphasis role="strong">not</emphasis> affect translations, please be kind to translators and <emphasis>unfuzzy</emphasis> their translations.
de: Wenn der Text einer Debconf-Schablone korrigiert wurde und Sie <emphasis role="strong">sicher</emphasis> sind, dass die Änderung <emphasis role="strong">keine</emphasis> Übersetzungen beeinflusst, seien Sie so nett zu Übersetzern, die <emphasis>Fuzzy</emphasis>-Markierungen aus deren Übersetzungen zu entfernen.
fr: Lorsque le texte d'un écran <systemitem role="package">debconf</systemitem> est corrigé et que vous avez la <emphasis role="strong">certitude</emphasis> que la modification n'affecte <emphasis role="strong">pas</emphasis> les traductions, pensez aux traducteurs et rendez leur traductions à nouveau complètes (« <emphasis>unfuzzy</emphasis> »).
ja: debconf テンプレートの文章が修正されて、その変更が翻訳に<emphasis role="strong">影響しない</emphasis>と<emphasis role="strong">確信している</emphasis>場合には、翻訳作業者を労って翻訳文を <emphasis>fuzzy を取り除いて</emphasis>ください。

source: If you don't do so, the whole template will not be translated as long as a translator will send you an update.
de: Falls Sie dies nicht tun, wird die ganze Schablone nicht übersetzt, bis Ihnen ein Übersetzer eine Aktualisierung zusendet.
fr: Si cela n'est pas fait, l'ensemble de l'écran <systemitem role="package">debconf</systemitem> ne sera plus traduit tant qu'un traducteur n'aura pas envoyé de mise à jour.
ja: そうしないと、翻訳作業者が更新をあなたに送るまでテンプレート全体は翻訳されていない状態になります。

source: To <emphasis>unfuzzy</emphasis> translations, you can use <command>msguntypot</command> (part of the <systemitem role="package">po4a</systemitem> package).
de: Um die <emphasis>Fuzzy</emphasis>-Markierungen aus Übersetzungen zu entfernen, können Sie <command>msguntypot</command> benutzen (Teil des Pakets <systemitem role="package">po4a</systemitem>).
fr: Pour rendre les traductions à nouveau complètes (« <emphasis>unfuzzy</emphasis> »), vous pouvez utiliser <command>msguntypot</command> (du paquet <systemitem role="package">po4a</systemitem>).
ja: 翻訳を<emphasis>fuzzy ではなくす</emphasis>ために、(<systemitem role="package">po4a</systemitem> パッケージの一部である)<command>msguntypot</command> を使うことができます。

source: Regenerate the POT and PO files.
de: Erzeugen Sie die POT- und PO-Dateien neu.
fr: Recréez les fichiers POT et PO.
ja: POT ファイルと PO ファイルを再生成する。

source: Make a copy of the POT file.
de: Erstellen Sie eine Kopie der POT-Datei.
fr: Faites une copie du fichier POT.
ja: POT ファイルのコピーを作成する。

source: Make a copy of all the PO files.
de: Erstellen Sie eine Kopie aller PO-Dateien.
fr: Faites une copie de tous les fichiers PO.
ja: すべての PO ファイルのコピーを作成する。

source: mkdir po_fridge; cp *.po po_fridge
fr: mkdir po_orig; cp *.po po_orig

source: Change the debconf template files to fix the typos.
de: Ändern Sie die Debconf-Schablonen-Dateien, um den Tippfehler zu korrigieren.
fr: Modifier les fichiers d'écrans <systemitem role="package">debconf</systemitem> (<filename>templates</filename>) pour corriger les fautes de frappe.
ja: debconf テンプレートファイルを誤字修正のために変更する。

source: Regenerate the POT and PO files (again).
de: Erzeugen Sie die POT- und PO-Dateien (wieder) neu.
fr: Recréez les fichiers POT et PO (de nouveau).
ja: POT ファイルと PO ファイルを再生成する (もう一度)。

source: At this point, the typo fix fuzzied all the translations, and this unfortunate change is the only one between the PO files of your main directory and the one from the fridge. Here is how to solve this.
de: An dieser Stelle markiert die Korrektur des Tippfehlers alle Übersetzungen mit »fuzzy« und diese unglückliche Änderung ist die einzige zwischen den PO-Dateien Ihres Hauptverzeichnisses und den aus dem Kühlschrank. Hier nun eine Erklärung, wie das gelöst wird.
fr: À ce moment-là, la correction a marqué certaines chaînes approximatives, et ce changement est malheureusement la seule modification entre les fichiers PO du répertoire et ceux de po_orig. Voici comment corriger cela.
ja: この時点では、typo 修正はすべての翻訳を fuzzy にしており、この残念な変更はメインディレクトリの PO ファイルと fridge の PO ファイルのみに適用されている。ここではどの様にしてこれを解決するかを示す。

source: Discard fuzzy translation, restore the ones from the fridge.
de: Verwerfen Sie die mit »fuzzy« markierte Übersetzung und stellen Sie die aus dem Kühlschrank wieder her.
fr: Abandonnez les traductions approximatives, récupérer celles du répertoire originel.
ja: fuzzy になった翻訳を捨て、fridge から作り直す。

source: cp po_fridge/*.po .
fr: cp po_orig/*.po .

source: Manually merge the PO files with the new POT file, but taking the useless fuzzy into account.
de: Führen Sie manuell die PO-Dateien mit der neuen POT-Datei zusammen, aber berücksichtigen Sie das nutzlose »fuzzy«.
fr: Fusionnez manuellement les fichiers PO avec le nouveau fichier POT, en prenant en compte le fait que les étiquettes « fuzzy » sont inutiles.
ja: 手動で PO ファイルと新しい POT ファイルをマージするが、不要な fuzzy を考慮に入れる。

source: Clean up.
de: Räumen Sie auf.
fr: Nettoyage.
ja: ゴミ掃除。

source: rm -rf templates.pot.orig po_fridge
fr: rm -rf templates.pot.orig po_orig

source: Do not make assumptions about interfaces
de: Treffen Sie keine Annahmen über Schnittstellen.
fr: Proscrire toute supposition sur les interfaces utilisateurs
ja: インターフェイスについて仮定をしない

source: Templates text should not make reference to widgets belonging to some debconf interfaces. Sentences like <emphasis>If you answer Yes...</emphasis> have no meaning for users of graphical interfaces which use checkboxes for boolean questions.
de: Schablonentext sollte keinen Bezug auf Steuerelemente herstellen, die zu irgendwelchen Debconf-Schnittstellen gehören. Sätze wie <emphasis>If you answer Yes...</emphasis> haben keinen Sinn für Benutzer grafischer Oberflächen, die für die Beantwortung logischer Fragen Kontrollkästchen verwenden.
fr: Les textes des écrans ne devraient pas faire référence aux éléments disponibles sur certaines interfaces de <systemitem role="package">debconf</systemitem>. Des phrases telles que « <emphasis>If you answer Yes</emphasis> » ne signifient rien avec les interfaces graphiques où des boutons radio sont utilisés pour les questions booléennes.
ja: テンプレートのテキストは、debconf のインターフェイスに属するウィジェットには言及してはいけません。<emphasis>「はい」と答えた場合には...</emphasis> のような文章は、2 択の質問に対してチェックボックスを使うようなグラフィカルインターフェイスのユーザには何の意味もありません。

source: String templates should also avoid mentioning the default values in their description. First, because this is redundant with the values seen by the users. Also, because these default values may be different from the maintainer choices (for instance, when the debconf database was preseeded).
de: Zeichenkettenschablonen sollten außerdem vermeiden, Vorgabewerte in ihrer Beschreibung zu erwähnen. Erstens sind diese zusätzlich zu den Werten, die der Anwender sieht, vorhanden. Außerdem könnten sich diese Werte von der Auswahl des Paketbetreuers unterscheiden (zum Beispiel, wenn die Debconf-Datenbank vorbelegt war).
fr: Les écrans de type <literal>string</literal> ne devraient pas faire référence aux valeurs par défaut dans leur description. Cela est tout d'abord redondant avec les valeurs visibles par les utilisateurs. Mais également, les valeurs présentées par défaut peuvent être différentes du choix du responsable (par exemple, lorsque la base de données de <systemitem role="package">debconf</systemitem> a été pré-renseignée).
ja: 文字列テンプレートは、説明文中でのデフォルト値について言及することも避けましょう。まず、ユーザによってそして、デフォルト値はメンテナの考え方によって違う場合があるからです (たとえば、debconf データベースが preseed で指定されている場合など)。

source: More generally speaking, try to avoid referring to user actions. Just give facts.
de: Versuchen Sie, allgemein ausgedrückt, Bezug auf Benutzeraktionen zu vermeiden. Geben Sie nur Tatsachen wieder.
fr: De manière plus générale, évitez de faire référence à des actions particulières des utilisateurs et donnez simplement des faits.
ja: より一般的に言うと、ユーザの行動を参照させるのを避けるようにしましょう。単に事実を与えましょう。

source: Do not use first person
de: Reden Sie nicht in der ersten Person.
fr: Proscrire l'utilisation de la première personne
ja: 一人称を使わない

source: You should avoid the use of first person (<emphasis>I will do this...</emphasis> or <emphasis>We recommend...</emphasis>). The computer is not a person and the Debconf templates do not speak for the Debian developers. You should use neutral construction. Those of you who already wrote scientific publications, just write your templates like you would write a scientific paper. However, try using active voice if still possible, like <emphasis>Enable this if ...</emphasis> instead of <emphasis>This can be enabled if...</emphasis>.
de: Sie sollten vermeiden, in der ersten Person zu reden (<emphasis>I will do this...</emphasis> oder <emphasis>We recommend...</emphasis>). Der Rechner ist keine Person und die Debconf-Schablonen sprechen nicht stellvertretend für Debian-Entwickler. Sie sollten neutrale Formulierungen benutzen. Diejenigen unter Ihnen, die bereits wissenschaftliche Publikationen verfasst haben, können ihre Schablonen so schreiben, als würden Sie wissenschaftliche Papiere verfassen. Versuchen Sie jedoch, wenn möglich, eine aktive Anrede zu verwenden, wie <emphasis>Enable this if ...</emphasis> anstelle von <emphasis>This can be enabled if...</emphasis>.
fr: Vous devriez éviter l'utilisation de la première personne (« <emphasis>I will do this...</emphasis> » ou « <emphasis>We recommend...</emphasis> »). L'ordinateur n'est pas une personne et les écrans de <systemitem role="package">debconf</systemitem> ne parlent pas au nom des développeurs de Debian. Vous devriez utiliser des constructions neutres. Pour les personnes familières de la publication scientifique, il suffit en général d'adopter le style d'écriture qui y est utilisé. Tentez cependant d'utiliser la forme active si possible. Par exemple : « <emphasis>Enable this if...</emphasis> » au lieu de « <emphasis>This can be enabled if...</emphasis> ».
ja: (<emphasis>I will do this...</emphasis> や <emphasis>We recommend...</emphasis> などの) 一人称の利用を避けましょう。コンピュータは人ではなく、debconf テンプレートは Debian 開発者を代弁するものではありません。中立的な解釈を行いましょう。あなたが科学論文を書いたことがあるならば、論文を書くのと同様にテンプレートを書きましょう。ですが、可能であれば <emphasis>This can be enabled if...</emphasis> ではなく <emphasis>Enable this if ...</emphasis> などとして生の声を届けるようにしましょう。

source: Be gender neutral
de: Formulieren Sie geschlechtsneutral
fr: Neutralité en genre
ja: 性差に対して中立であれ

source: The world is made of men and women. Please use gender-neutral constructions in your writing.
de: Die Welt wird von Männern und Frauen bevölkert. Bitte benutzen Sie in Ihren Texten geschlechtsneutrale Formulierungen.
fr: Le monde est fait d'hommes et de femmes. Veuillez utiliser des constructions neutres en genre dans vos écrits.
ja: 世界は、男と女によって成り立っています。記述の際には、性差に対して中立な書き方を行ってください。

source: Templates fields definition
de: Definition von Schablonenfeldern
fr: Définition des champs de modèles (« <literal>templates</literal> »).
ja: テンプレートのフィールド定義

source: This part gives some information which is mostly taken from the <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> manual page.
de: Dieser Teil stellt einige Informationen bereit, die meistens von der Handbuchseite <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> abgefragt wird.
fr: Les informations présentées dans cette partie proviennent pour l'essentiel de la page de manuel <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>.
ja: この章の情報は、ほとんどを <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> マニュアルページから得ています。

source: Type
fr: <literal>Type</literal>

source: string
fr: <literal>string</literal>

source: Results in a free-form input field that the user can type any string into.
de: resultiert in einem Eingabefeld freier Form, in das der Benutzer jegliche Zeichenkette eingeben kann.
fr: offre un champ de saisie où l'utilisateur peut entrer n'importe quelle chaîne de caractères.
ja: ユーザがどのような文字列でも記述可能な自由記述形式の入力フィールドの結果。

source: password
fr: <literal>password</literal>

source: Prompts the user for a password. Use this with caution; be aware that the password the user enters will be written to debconf's database. You should probably clean that value out of the database as soon as is possible.
de: gibt dem Benutzer eine Eingabeaufforderung für ein Passwort aus. Benutzen Sie dies mit Vorsicht. Vergegenwärtigen Sie sich, dass das Passwort, das der Benutzer eingibt, in die Debconf-Datenbank geschrieben wird. Sie sollten diesen Wert möglicherweise aus der Datenbank löschen, sobald dies möglich ist.
fr: demande un mot de passe. Ce champ est à utiliser avec précaution car le mot de passe saisi sera conservé dans la base de données de <systemitem role="package">debconf</systemitem>. Il est conseillé d'effacer cette valeur de la base de données dès que possible.
ja: ユーザにパスワードの入力を求めます。これを使う場合は注意して使ってください: ユーザが入力したパスワードは debconf のデータベースに書き込まれることに注意してください。おそらく、この値をデータベースから可能な限り早く消す必要があります。

source: boolean
fr: <literal>boolean</literal>

source: A true/false choice. Remember: true/false, <emphasis role="strong">not yes/no</emphasis>...
de: eine Auswahl »wahr/falsch«. Denken Sie daran: true/false, nicht <emphasis role="strong">yes/no</emphasis> ...
fr: offre un choix du type « vrai » ou « faux ». N'oubliez pas, c'est bien un choix « vrai » ou « faux », <emphasis role="strong">pas « oui » ou « non »</emphasis>...
ja: true/false の選択です。注意点: true/false であって、<emphasis role="strong">yes/no ではありません</emphasis>...

source: select
fr: <literal>select</literal>

source: A choice between one of a number of values. The choices must be specified in a field named 'Choices'. Separate the possible values with commas and spaces, like this: <literal>Choices: yes, no, maybe</literal>.
de: Eine Auswahl aus mehreren Werten. Die Auswahlmöglichkeiten müssen in einem »Choices« benannten Feld angegeben werden. Trennen Sie die möglichen Werte mit Komma und Leerzeichen, wie hier: <literal> Choices: yes, no, maybe</literal>.
fr: offre le choix entre différentes valeurs. Les choix doivent être indiqués dans un champ appelé « <literal>Choices</literal> ». Les différentes valeurs doivent être séparées par des virgules et des espaces, comme ceci : « <literal>Choices: yes, no, maybe</literal> ».
ja: 複数の値から一つを選びます。選択するものは 'Choices' というフィールド名で指定されている必要があります。利用可能な値をコンマとスペースで区切ってください。以下のようになります: <literal>Choices: yes, no, maybe</literal>

source: If choices are translatable strings, the 'Choices' field may be marked as translatable by using <literal>__Choices</literal>. The double underscore will split out each choice in a separate string.
de: Falls Auswahlmöglichkeiten übersetzbare Zeichenketten sind, könnte das Feld durch Benutzung von <literal>__Choices</literal> als übersetzbar gekennzeichnet werden. Der doppelte Unterstrich wird jede Auswahl in eine separate Zeichenkette heraustrennen.
fr: Si les choix sont traduisibles, le champ « <literal>Choices</literal> » peut être marqué traduisible en utilisant « <literal>__Choices</literal> ». Les deux tirets bas permettent à chaque choix de devenir une chaîne différente proposée à la traduction.
ja: 選択肢が翻訳可能な文字列である場合、'Choices' フィールドは <literal>__Choices</literal> を使って翻訳可能であることを示しておくと良いでしょう。2つのアンダースコアは、各選択肢を分かれた文字列に分割してくれます。

source: The <command>po-debconf</command> system also offers interesting possibilities to only mark <emphasis role="strong">some</emphasis> choices as translatable. Example:
de: Das System <command>po-debconf</command> bietet außerdem interessante Möglichkeiten nur <emphasis role="strong">einige</emphasis> Auswahlmöglichkeiten als übersetzbar zu kennzeichnen. Ein Beispiel:
fr: Le système <command>po-debconf</command> offre également la possibilité intéressante de ne marquer que <emphasis role="strong">certains</emphasis> choix traduisibles. Par exemple :
ja: <command>po-debconf</command> システムは、翻訳可能な<emphasis role="strong">いくつかの</emphasis>選択肢のみをマークする面白い機能を提供してくれます。例:

source: Template: foo/bar Type: Select #flag:translate:3 __Choices: PAL, SECAM, Other _Description: TV standard: Please choose the TV standard used in your country.
fr: Template: truc/bidule Type: Select #flag:translate:3 __Choices: PAL, SECAM, Other _Description: TV standard: Please choose the TV standard used in your country.

source: In that example, only the 'Other' string is translatable while others are acronyms that should not be translated. The above allows only 'Other' to be included in PO and POT files.
de: In diesem Beispiel ist nur die Zeichenkette »Other« übersetzbar, während das andere Abkürzungen sind, die nicht übersetzt werden sollten. Obiges ermöglicht, dass nur »Other« in die POT- und PO-Dateien eingefügt wird.
fr: Dans cet exemple, seule la chaîne « <literal>Other</literal> » est traduisible, alors que les autres sont des acronymes qui ne devraient pas êtres traduits. Seul « <literal>Other</literal> » sera inclus dans les fichiers PO et POT.
ja: この例では、他は頭文字から構成されていて翻訳できませんが、'Other' 文字列だけは翻訳可能です。上記では 'Other' だけが PO および POT ファイルに含めることができます。

source: The debconf templates flag system offers many such possibilities. The <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> manual page lists all these possibilities.
de: Das Schaltersystem der Debconf-Schablonen bietet viele solcher Möglichkeiten. Die Handbuchseite <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> führt all diese Möglichkeiten auf.
fr: Le système d'indicateur (« <literal>flag</literal> ») d'écrans <systemitem role="package">debconf</systemitem> permet de faire de telles choses. La page de manuel <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> documente toutes ces possibilités.
ja: debconf テンプレートのフラグシステムは、この様な機能をたくさん提供します。<citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> マニュアルページでは、これらの利用可能な機能をすべて列挙しています。

source: multiselect
fr: <literal>multiselect</literal>

source: Like the select data type, except the user can choose any number of items from the choices list (or chose none of them).
de: Wie der Datentyp »select«, außer dass der Benutzer eine beliebige Anzahl von Elementen aus der Auswahlliste auswählen kann (oder gar keins).
fr: similaire au type <literal>select</literal>, mais permet de choisir plusieurs (ou aucune) valeurs parmi la liste de choix.
ja: select データ型とそっくりですが、ユーザが選択肢一覧からいくつでも項目を選べる (あるいはどれも選ばないこともできる) 点だけが違います。

source: note
fr: <literal>note</literal>
