Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: Despite the required modification of the changelog, these are called binary-only NMUs — there is no need in this case to trigger all other architectures to consider themselves out of date or requiring recompilation.
de: Ungeachtet der nötigen Modifikation des Änderungsprotokolls, werden diese rein binäre NMUs genannt – es ist nicht nötig in diesem Fall dafür zu sorgen, dass alle anderen Architekturen sich selbst als veraltet oder eines erneuten Compilierens bedürfig betrachten.
fr: Malgré la modification nécessaire du journal de modification (<filename>changelog</filename>), ce type de mise à jour est appelé binNMU — il n'est pas nécessaire de reconsidérer le statut des paquets binaires des autres architectures pour les marquer périmés ou à recompiler.
ja: changelog の変更が必要かどうかに関わらず、これらは binary-only NMU と呼ばれます — この場合には、他の全アーキテクチャで古すぎるかどうかや再コンパイルが必要かなどを考える必要はありません。

source: Such recompilations require special ``magic'' version numbering, so that the archive maintenance tools recognize that, even though there is a new Debian version, there is no corresponding source update. If you get this wrong, the archive maintainers will reject your upload (due to lack of corresponding source code).
de: Solche Neu-Compilierungen benötigen eine spezielle »magische« Versionsnummerierung, so dass die Archiv-Verwaltungswerkzeuge dies erkennen, selbst wenn es eine neue Debian-Version ist, gibt es dort keine zugehörige Aktualisierung der Quelle. Falls Sie dabei einen Fehler machen, werden die Archivbetreuer Ihre Aktualisierung ablehnen (aus Mangel an entsprechendem Quellcode).
fr: Ces recompilations nécessitent des numéros de version « magiques » pour que le système de maintenance de l'archive comprenne que, bien qu'il y ait une nouvelle version, il n'y a pas eu de modification des sources. Si vous ne faites pas cela correctement, les administrateurs de l'archive rejetteront votre mise à jour (car il n'y aura pas de code source associé).
ja: このような再コンパイルは、特別な「magic」バージョン番号を付けるのを必要とするので、アーカイブのメンテナンスツールは、これを理解してくれます。新しい Debian バージョンで、対応するソースアップデートが無くても、です。これを間違えた場合、アーカイブメンテナは (対応するソースコードが欠落しているので) アップロードを拒否します。

source: In the past, such NMUs used the third-level number on the Debian part of the revision to denote their recompilation-only status; however, this syntax was ambiguous with native packages and did not allow proper ordering of recompile-only NMUs, source NMUs, and security NMUs on the same package, and has therefore been abandoned in favor of this new syntax.
de: In der Vergangenheit benutzten solche NMUs die dritte Stufe im Debian-Teil der Revisionsnummer, um ihren Status als reine Neu-Compilierung anzuzeigen. Diese Syntax war jedoch bei nativen Paketen mehrdeutig und erlaubte keine ordnungsgemäße Einordnung von reinen Neu-Compilierungs-NMUs, Quell-NMUs und Sicherheits-NMUs im gleichen Paket. Daher wurden sie verworfen und diese neue Syntax bevorzugt.
fr: Par le passé, ces NMU utilisaient le numéro de troisième niveau de la partie Debian de la révision pour indiquer l'état de seule recompilation ; cependant, cette syntaxe était ambiguë pour les paquets natifs et ne permettait pas d'ordonner correct les NMU par seule recompilation, les NMU source et les NMU de sécurité sur le même paquet, elle a donc été abandonnée en faveur de cette nouvelle syntaxe.
ja: 過去においては、再コンパイルのみの状態を意味するために、このような NMU はリビジョンの Debian 部分の三つ目の番号を使っていました。しかし、この記法はネイティブパッケージの場合に曖昧で、同一パッケージでの再コンパイルのみの NMU と、ソース NMU と、セキュリティ NMU の正しい順序が付けられなかったため、この新しい記法で置き換えられました。

source: The ``magic'' for a recompilation-only NMU is triggered by using a suffix appended to the package version number, following the form <literal>b<replaceable>number</replaceable></literal>. For instance, if the latest version you are recompiling against was version <literal>2.9-3</literal>, your binary-only NMU should carry a version of <literal>2.9-3+b1</literal>. If the latest version was <literal>3.4+b1</literal> (i.e, a native package with a previous recompilation NMU), your binary-only NMU should have a version number of <literal>3.4+b2</literal>.<placeholder type="footnote" id="0"/>
de: Die »Magie« für ein reines Neu-Compilierungs-NMU wird durch eine Endung ausgelöst, die an die Paketversionsnummer angehängt wird und die Form <literal>b<replaceable>Zahl</replaceable></literal> hat. Wenn etwa die letzte Version, die Sie compilierten <literal>2.9-3</literal> war, sollte Ihr rein binärer NMU die Versionsnummer <literal>2.9-3+b1</literal> tragen. Falls die letzte Version <literal>3.4+b1</literal> war (d.h. ein natives Paket mit einem vorhergehenden Neu-Compilierungs-NMU), sollte Ihr rein binärer NMU die Versionsnummer <literal>3.4+b2</literal>.<placeholder type="footnote" id="0"/> haben.
fr: La « magie » d'une NMU par seule recompilation est déclenchée par l'utilisation d'un suffixe ajouté au numéro de version du paquet de la forme <literal>b<replaceable>numéro</replaceable></literal>. Par exemple, si la dernière version recompilée était la version <literal>2.9-3</literal>, la binNMU aura le pour version <literal>2.9-3+b1</literal>. Si la dernière version était <literal>3.4+b1</literal> (c'est-à-dire un paquet natif avec une précédente NMU par recompilation), la binNMU aura le numéro de version <literal>3.4+b2</literal>.<placeholder type="footnote" id="0"/>
ja: 再コンパイルのみの NMU への「magic」は、<literal>b<replaceable>番号</replaceable></literal> という形式に従った、パッケージのバージョン番号に対するサフィックスを追加することで引き起こされます。例えば、再コンパイル対象の最新バージョンが <literal>2.9-3</literal> の場合、バイナリのみの NMU は <literal>2.9-3+b1</literal> というバージョンになる必要があります。最新のバージョンが <literal>3.4+b1</literal> (つまり、ネイティブパッケージで、前回が再コンパイルの NMU) の場合、バイナリのみの NMU は <literal>3.4+b2</literal> というバージョン番号にならねばいけません。<placeholder type="footnote" id="0"/>

source: Similar to initial porter uploads, the correct way of invoking <command>dpkg-buildpackage</command> is <literal>dpkg-buildpackage -B</literal> to only build the architecture-dependent parts of the package.
de: Ähnlich wie bei ersten Portierungs-Uploads ist der korrekte Weg <command>dpkg-buildpackage</command> aufzurufen <literal>dpkg-buildpackage -B</literal>, um nur die architekturabhängigen Teile des Pakets zu erstellen.
fr: De manière similaire aux envois du porteur initial, la façon correcte d'invoquer <command>dpkg-buildpackage</command> est <literal>dpkg-buildpackage -B</literal> pour ne construire que les parties dépendant de l'architecture du paquet.
ja: 最初の移植作業者のアップロード (porter upload) と同様に、パッケージのアーキテクチャ依存部分をビルドするための <command>dpkg-buildpackage</command> の正しい実行の仕方は <literal>dpkg-buildpackage -B</literal> です。

source: When to do a source NMU if you are a porter
de: Wann ein Quell-NMU als Portierer gemacht werden sollte
fr: NMU source pour un portage
ja: あなたが移植作業者の場合、source NMU を行う時は何時か

source: Porters doing a source NMU generally follow the guidelines found in <xref linkend="nmu"/>, just like non-porters. However, it is expected that the wait cycle for a porter's source NMU is smaller than for a non-porter, since porters have to cope with a large quantity of packages. Again, the situation varies depending on the distribution they are uploading to. It also varies whether the architecture is a candidate for inclusion into the next stable release; the release managers decide and announce which architectures are candidates.
de: Portierer, die einen Quell-NMU durchführen, folgen generell den Richtlinien, die unter <xref linkend="nmu"/> gefunden werden, genau wie nicht-Portierer. Es wird jedoch erwartet, dass der Wartezyklus für den Quell-NMU eines Portierers kleiner ist, als der von nicht Portierern, da Portierer mit einer großen Zahl von Paketen zurechtkommen müssen. Die Situation variiert wiederum abhängig von der Distribution, in die hochgeladen wird. Sie variiert außerdem in Abhängigkeit davon, ob die Architektur ein Kandidat für für die Einbindung in das nächste stabile Release ist. Die Veröffentlichungsverwalter entscheiden welche Architekturen Kandidaten sind und kündigen dies an.
fr: Les porteurs faisant des NMU source suivent normalement les instructions de <xref linkend="nmu"/> tout comme les non-porteurs. Les délais d'attente sont cependant réduits car les porteurs doivent manipuler un grand nombre de paquets. À nouveau, la situation diffère selon la distribution visée. Elle varie également si l'architecture est candidate pour la prochaine version stable ; les responsables de publication décident et annoncent quelles sont les architectures candidates.
ja: 移植作業者は、通常は非移植作業者同様に <xref linkend="nmu"/> にあるガイドラインに沿ってソース NMU を行います。しかし、移植作業者のソース NMU に対する待ち時間は非移植作業者より小さくなります。これは、移植作業は大量のパッケージに対応する必要があるからです。さらに、状況はパッケージがアップロードされるディストリビューションに依って変わります。これは、アーキテクチャが次の安定版リリースに含められるかどうかによっても変わります。リリースマネージャはどのアーキテクチャが候補なのかを決定してアナウンスします。

source: If you are a porter doing an NMU for <literal>unstable</literal>, the above guidelines for porting should be followed, with two variations. Firstly, the acceptable waiting period — the time between when the bug is submitted to the BTS and when it is OK to do an NMU — is seven days for porters working on the <literal>unstable</literal> distribution. This period can be shortened if the problem is critical and imposes hardship on the porting effort, at the discretion of the porter group. (Remember, none of this is Policy, just mutually agreed upon guidelines.) For uploads to <literal>stable</literal> or <literal>testing</literal>, please coordinate with the appropriate release team first.
de: Falls Sie als Portierer einen NMU für <literal>unstable</literal> durchführen, sollten die vorher genannten Richtlinien der Portierung mit zwei Abwandlungen befolgt werden. Erstens ist die akzeptable Wartezeit – die Zeit zwischen dem Absenden des Fehlerberichts an das BTS und der Zeit, wenn es in Ordnung ist, einen NMU durchzuführen – sieben Tage für Portierer, die an der Distribution <literal>unstable</literal> arbeiten. Diese Zeitspanne kann verkürzt werden, falls das Problem kritisch ist und eine Notlage für die Portierungsanstrengung nach Ermessen der Gruppe der Portierer besteht. (Bedenken Sie, dass nichts davon in der Policy steht, sondern nur über Richtlinien vereinbart wurde.) Für Uploads nach <literal>stable</literal> oder <literal>testing</literal> stimmen Sie sich bitte zuerst mit dem Release-Team ab.
fr: Si vous êtes porteur et faites une NMU pour <literal>unstable</literal>, les instructions précédentes sont applicables à deux différences près. Tout d'abord, le temps d'attente raisonnable — délai entre le moment où vous envoyez un rapport au BTS et le moment où vous pouvez faire une NMU — est de sept jours. Ce délai peut être réduit si le problème est crucial et met l'effort de portage en difficulté : c'est à la discrétion de l'équipe de portage. (Souvenez-vous, il ne s'agit pas d'un règlement, mais de recommandations communément acceptées.) Pour les envois de <literal>stable</literal> ou <literal>testing</literal>, veuillez d'abord vous coordonner avec l'équipe de publication concernée.
ja: あなたが<literal>不安定版 (unstable)</literal> へ NMU を行う移植作業者の場合、移植作業についての上記のガイドライン、そして 2 つの相違点に従う必要があります。まず、適切な待ち時間です — バグが BTS へ投稿されてから NMU を行って OK になるまでの間 — 移植作業者が <literal>不安定版 (unstable)</literal> ディストリビューションに対して行う場合は 7 日間になります。問題が致命的で移植作業に困難を強いるような場合には、この期間は短くできます (注意してください。この何れもがポリシーではなく、単にガイドラインに沿って相互に了解されているだけです)。<literal>安定版 (stable)</literal> や <literal>テスト版 (testing)</literal> へのアップロードについては、まず適切なリリースチームと調整をしてください。

source: Secondly, porters doing source NMUs should make sure that the bug they submit to the BTS should be of severity <literal>serious</literal> or greater. This ensures that a single source package can be used to compile every supported Debian architecture by release time. It is very important that we have one version of the binary and source package for all architectures in order to comply with many licenses.
de: Zweitens sollten Protierer, die ein Quell-MMU durchführen, sicherstellen, dass der Fehler, den Sie an das BTS senden, den Schweregrad <literal>serious</literal> oder höher aufweist. Dies garantiert, dass ein einzelnes Quellpaket benutzt werden kann, um jede unterstützte Debian-Architektur zum Veröffentlichungszeitpunkt zu compilieren. Es ist sehr wichtig, dass es eine Version des Quell- und Binärpakets für alle Architekturen gibt, um vielen Lizenzen zu entsprechen.
fr: Deuxième différence, les porteurs faisant des NMU source doivent choisir une gravité <literal>serious</literal> (sérieuse) ou supérieure quand ils envoient leur rapport au BTS. Ceci assure qu'un paquet source unique permet de produire un paquet binaire pour chaque architecture maintenue au moment de la sortie de la distribution. Il est très important d'avoir un paquet source et un paquet binaire pour toutes les architectures pour être conforme à plusieurs licences.
ja: 次に、ソース NMU を行う移植作業者は BTS へ登録したバグの重要度が <literal>serious</literal> かそれ以上であることを確認してください。これは単一のソースパッケージが、すべての Debian でサポートされているアーキテクチャでコンパイルされたことをリリース時に保証します。数多くのライセンスに従うため、すべてのアーキテクチャについて、単一のバージョンのバイナリパッケージとソースパッケージを持つことがとても重要です。

source: Porters should try to avoid patches which simply kludge around bugs in the current version of the compile environment, kernel, or libc. Sometimes such kludges can't be helped. If you have to kludge around compiler bugs and the like, make sure you <literal>#ifdef</literal> your work properly; also, document your kludge so that people know to remove it once the external problems have been fixed.
de: Portierer sollten versuchen Patchs zu vermeiden, die einfache Bastellösungen für Fehler in der aktuellen Version der Compiler-Umgebung, des Kernels oder der Libc bieten. Bisweilen sind solche Bastellösungen nicht hilfreich. Falls Sie an Compiler-Fehlern und dergleichen herumbasteln müssen, stellen Sie sicher, dass Sie Ihre Arbeit ordnungsgemäß in <literal>#ifdef</literal> einschließen. Dokumentieren Sie außerdem Ihren Murks, damit die Leute wissen, dass er entfernt werden muss, sobald die externen Probleme behoben wurden.
fr: Les porteurs doivent éviter d'implémenter des contournements pour des bogues de l'environnement de compilation, du noyau ou de la <literal>libc</literal>. Parfois, ces contournements sont inévitables. Si vous devez faire quelque chose de ce genre, marquez proprement vos modifications avec des <literal>#ifdef</literal> et documentez votre contournement pour pouvoir le retirer une fois le problème disparu.
ja: 移植作業者は、現在のバージョンのコンパイル環境やカーネル、libc にあるバグのために作られた単なる力業のパッチを極力回避すべきです。この様なでっち上げの代物があるのは、仕方がないことが時折あります。コンパイラのバグやその他の為にでっち上げを行う必要がある場合には、<literal>#ifdef</literal> で作業したものが動作することを確認してください。また、力業についてドキュメントに載せてください。一旦外部の問題が修正されたら、それを削除するのを皆が知ることができます。

source: Porters may also have an unofficial location where they can put the results of their work during the waiting period. This helps others running the port have the benefit of the porter's work, even during the waiting period. Of course, such locations have no official blessing or status, so buyer beware.
de: Portierer könnten außerdem einen inoffiziellen Ort haben, an dem sie die Ergebnisse Ihrer Arbeit während der Wartezeit ablegen. Dies hilft anderen, die aufder Portierung arbeiten, sogar während der Wartezeit aus der Arbeit des Portierers Nutzen zu ziehen. Natürlich haben solche Orte keinen offiziellen Segen oder Status, daher nehme sich der Käufer in Acht.
fr: Les porteurs peuvent aussi avoir un dépôt non officiel pour publier le résultat de leur travail pendant le délai d'attente. Ainsi, d'autres personnes peuvent bénéficier du travail du porteur même pendant ce délai. Bien sûr, ces dépôts n'ont rien d'officiel, donc soyez sur vos gardes si vous les utilisez.
ja: 移植作業者は、待ち期間の間、作業結果を置いておける非公式の置き場所を持つこともあります。移植版を動作させている人が、待ち期間の間であっても、これによって移植作業者による作業の恩恵を受けられるようになります。もちろん、この様な場所は、公式な恩恵や状況の確認を受けることはできませんので、利用者は注意してください。

source: Porting infrastructure and automation
de: Portierungs-Infrastruktur und -Automatisierung
fr: Infrastructure de portage et automatisation
ja: 移植用のインフラと自動化

source: There is infrastructure and several tools to help automate package porting. This section contains a brief overview of this automation and porting to these tools; see the package documentation or references for full information.
de: Es gibt eine Infrastruktur und mehrere Werkzeuge, die das Portieren von Paketen automatisieren. Dieser Abschnitt enthält einen kurzen Überblick dieser Automatisierung und Portierung mit diesen Werkzeugen. Lesen Sie die Paketdokumentation oder die Referenzen, um umfassende Informationen zu erhalten.
fr: Une infrastructure et plusieurs outils sont disponibles pour faciliter l'automatisation du portage des paquets. Cette section contient un bref aperçu de cette automatisation et de ces outils ; veuillez vous reporter à la documentation des paquets ou les références pour des informations complètes.
ja: パッケージの自動移植に役立つインフラストラクチャと複数のツールがあります。この章には、この自動化とこれらのツールへの移植の概要が含まれています。全体の情報に付いてはパッケージのドキュメントかリファレンスを参照してください。

source: Mailing lists and web pages
de: Mailinglisten und Web-Seiten
fr: Listes de diffusion et pages web
ja: メーリングリストとウェブページ

source: Web pages containing the status of each port can be found at <ulink url="&url-debian-ports;"></ulink>.
de: Web-Seiten, die den Status jeder Portierung enthalten, können unter <ulink url="&url-debian-ports;"></ulink> gefunden werden.
fr: Les pages web contenant l'état de chaque portage peuvent être trouvées à <ulink url="&url-debian-ports;"></ulink>.
ja: 各移植版についての状況を含んだウェブページは <ulink url="&url-debian-ports;"></ulink> から参照できます。

source: Each port of Debian has a mailing list. The list of porting mailing lists can be found at <ulink url="&url-debian-port-lists;"></ulink>. These lists are used to coordinate porters, and to connect the users of a given port with the porters.
de: Jede Portierung von Debian hat eine Mailingliste. Die Liste der Portierungs-Mailinglisten kann unter <ulink url="&url-debian-port-lists;"></ulink> gefunden werden. Diese Listen werden benutzt, um die Arbeit der Portierer zu koordinieren und um eine Verbindung der Anwender der Portierung zu den Portierer herzustellen.
fr: Chaque portage de Debian possède sa propre liste de diffusion. La liste des listes de diffusion de portage peut être trouvée à <ulink url="&url-debian-port-lists;"></ulink>. Ces listes sont utilisées pour coordonner les porteurs et pour mettre en relation les utilisateurs d'un portage donné avec les porteurs.
ja: Debian の各移植版はメーリングリストを持っています。移植作業のメーリングリストは <ulink url="&url-debian-port-lists;"></ulink> で見ることができます。これらのリストは移植作業者の作業の調整や移植版のユーザと移植作業者をつなぐために使われています。

source: Porter tools
de: Werkzeuge der Portierers
fr: Outils pour les porteurs
ja: 移植用ツール

source: Descriptions of several porting tools can be found in <xref linkend="tools-porting"/>.
de: Beschreibungen von vielen Werkzeugen für die Portierung können unter <xref linkend="tools-porting"/> gefunden werden.
fr: Les descriptions de plusieurs outils de portage peuvent être trouvées en <xref linkend="tools-porting"/>.
ja: 移植用のツールの説明をいくつか <xref linkend="tools-porting"/> で見ることができます。

source: The <systemitem role="package">wanna-build</systemitem> system is used as a distributed, client-server build distribution system. It is usually used in conjunction with build daemons running the <systemitem role="package">buildd</systemitem> program. <literal>Build daemons</literal> are ``slave'' hosts which contact the central <systemitem role="package">wanna-build</systemitem> system to receive a list of packages that need to be built.
de: Das System <systemitem role="package">wanna-build</systemitem> wird als ein verteiltes Client-/Server-Build-Verteilungssystem benutzt. Es wird üblicherweise zusammen mit Build-Daemons benutzt, die das Programm <systemitem role="package">buildd</systemitem> ausführen. <literal>Build daemons</literal> sind »Slave«-Rechner, die das zentrale <systemitem role="package">wanna-build</systemitem>-System kontaktieren, um eine Liste der Pakete zu beziehen, die erstellt werden müssen.
fr: Le système <systemitem role="package">wanna-build</systemitem> est un système distribué pour la compilation d'une distribution. Il est habituellement utilisé en conjonction avec des automates de compilation faisant fonctionner le programme <systemitem role="package">buildd</systemitem>. Les automates de compilation (« <literal>build daemons</literal> ») sont des machines « esclaves » qui récupèrent la liste des paquets à compiler du système principal <systemitem role="package">wanna-build</systemitem>.
ja: <systemitem role="package">wanna-build</systemitem> システムは、分散型の、クライアント・サーバでの構築配布システムとして利用されています。通常、これは <systemitem role="package">buildd</systemitem> プログラムが動作しているビルドデーモンと連携して使われます。<literal>ビルドデーモン</literal>は、ビルドが必要なパッケージの一覧を受け取るために中央の <systemitem role="package">wanna-build</systemitem> システムと通信する「slave」ホストです。

source: <systemitem role="package">wanna-build</systemitem> is not yet available as a package; however, all Debian porting efforts are using it for automated package building. The tool used to do the actual package builds, <systemitem role="package">sbuild</systemitem> is available as a package, see its description in <xref linkend="sbuild"/>. Please note that the packaged version is not the same as the one used on build daemons, but it is close enough to reproduce problems.
de: <systemitem role="package">wanna-build</systemitem> ist noch nicht als Paket verfügbar. Alle Debian-Portierungsbestrebungen benutzen es jedoch zur automatisierten Paketerstellung. Das Werkzeug, das für die tatsächlichen Paket-Builds benutzt wird, <systemitem role="package">sbuild</systemitem>, ist als Paket verfügbar. Lesen Sie dessen Beschreibung unter <xref linkend="sbuild"/>. Bitte beachten Sie, dass die Paketversion nicht der des Build-Daemons entspricht, aber liegt ist nah genug bei dieser, um Probleme nachvollziehen zu können.
fr: <systemitem role="package">wanna-build</systemitem> n'est pas encore disponible sous forme de paquet ; pourtant, tous les efforts de portage l'utilisent pour automatiser la compilation de paquets. L'outil de compilation vraiment utilisé est dans le paquet <systemitem role="package">sbuild</systemitem>, voir la description en <xref linkend="sbuild"/>. La version empaquetée n'est pas la même que celle utilisée sur les automates de compilation, mais suffisamment proche pour reproduire les problèmes.
ja: <systemitem role="package">wanna-build</systemitem> は、まだパッケージとしては入手可能になっていません。ですが、すべての Debian の移植作業ではパッケージ構築作業の自動化にこれが使われています。実際のパッケージ構築に使われるツール、<systemitem role="package">sbuild</systemitem> はパッケージとして利用可能です。<xref linkend="sbuild"/> で説明を参照してください。パッケージ化されたバージョンは、ビルドデーモンで使われているものとは同じではありませんが、問題を再現するには十分なものである点に注意ください。

source: Most of the data produced by <systemitem role="package">wanna-build</systemitem> which is generally useful to porters is available on the web at <ulink url="&url-buildd;"></ulink>. This data includes nightly updated statistics, queueing information and logs for build attempts.
de: <systemitem role="package">wanna-build</systemitem> ist generell für Portierer nützlich. Die meisten davon erzeugten Daten sind im Web unter <ulink url="&url-buildd;"></ulink> verfügbar. Diese Daten enthalten nächtlich aktualisierte Statistiken, Warteschlangeninformationen und Protokolle von Build-Versuchen.
fr: La plupart des informations produites par <systemitem role="package">wanna-build</systemitem>, souvent utiles pour les porteurs, sont disponibles sur la toile à l'adresse <ulink url="&url-buildd;"></ulink>. Les données disponibles sont entre autres les statistiques mises à jour chaque nuit, les informations de file d'attente et les journaux de tentatives de compilation.
ja: <systemitem role="package">wanna-build</systemitem> によって生成される移植作業者にとって大抵有用であるデータの多くは、ウェブ上の <ulink url="&url-buildd;"></ulink> で入手可能です。このデータには、毎晩更新される統計情報や、queue 情報、ビルド失敗のログが含まれています。
