Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: Sometimes, a package is removed to allow another package in: This happens only to allow <emphasis>another</emphasis> package to go in if it's ready in every other sense. Suppose e.g. that <literal>a</literal> cannot be installed with the new version of <literal>b</literal>; then <literal>a</literal> may be removed to allow <literal>b</literal> in.
de: Manchmal wird ein Paket entfernt, um einem anderen Paket die Aufnahme zu gewähren: Dies geschieht nur, um einem <emphasis>anderen</emphasis> Paket die Aufnahme zu gewähren, falls es in jedem anderen Sinn in Ordnung ist. Angenommen, <literal>a</literal> könnte z.B. nicht mit der neuen Version von <literal>b</literal> installiert werden, dann könnte <literal>a</literal> entfernt werden, um <literal>b</literal> die Aufnahme zu ermöglichen.
fr: Parfois, un paquet est supprimé pour permettre l'inclusion d'un autre paquet : ceci ne se produit que pour permettre à un <emphasis>autre</emphasis> paquet d'entrer, ce dernier doit être prêt pour tous les autres critères. Par exemple, si un paquet <literal>a</literal> ne peut pas être installé avec la nouvelle version de <literal>b</literal>, alors <literal>a</literal> peut être supprimé pour permettre l'entrée de <literal>b</literal>.
ja: 時折、パッケージは他のパッケージがテスト版へ入るために削除されます: これは、<emphasis>他の</emphasis>パッケージが他のすべての面で準備ができている場合にテスト版に入るようにする場合のみ発生します。例えば、<literal>a</literal> が新しいバージョンの <literal>b</literal> とはインストールできない場合を考えてみましょう。その場合、<literal>a</literal> は <literal>b</literal> が入るために削除されるかもしれません。

source: Of course, there is another reason to remove a package from <literal>testing</literal>: It's just too buggy (and having a single RC-bug is enough to be in this state).
de: Natürlich gibt es einen anderen Grund, ein Paket aus <literal>testing</literal> zu entfernen: Es ist einfach zu fehlerhaft (und ein einfacher release-kritischer Fehler reicht nicht aus, um diesen Status zu bekommen).
fr: Bien sûr, il existe une autre raison pour supprimer un paquet de <literal>testing</literal> : le paquet est trop bogué (et avoir un seul bogue critique pour la publication est suffisant pour être dans cet état).
ja: もちろん、他にも <literal>テスト版 (testing)</literal> からパッケージが削除される理由があります: バグが多すぎる場合です (そして RC バグが1個だけあるのもこの状態とみなすのには十分です)。

source: Furthermore, if a package has been removed from <literal>unstable</literal>, and no package in <literal>testing</literal> depends on it any more, then it will automatically be removed.
de: Wenn ein Paket außerdem aus <literal>unstable</literal> entfernt wurde und kein Paket in <literal>testing</literal> mehr davon abhängt, dann wird es automatisch entfernt.
fr: De plus, si un paquet a été supprimé d'<literal>unstable</literal> et que plus un seul paquet de <literal>testing</literal> n'en dépend, il sera alors automatiquement supprimé.
ja: さらに、パッケージが <literal>不安定版 (unstable)</literal> から削除され、<literal>テスト版 (testing)</literal> にはこれに依存するパッケージがもうなくなった場合、パッケージは自動的に削除されます。

source: Circular dependencies
de: Wechselseitige Abhängigkeiten
fr: Dépendances circulaires
ja: 循環依存

source: A situation which is not handled very well by britney is if package <literal>a</literal> depends on the new version of package <literal>b</literal>, and vice versa.
de: Eine Situation, die nicht sehr gut von Britney gehandhabt wird, ist, wenn Paket <literal>a</literal> von einer neuen Version des Pakets <literal>b</literal> abhängt und umgekehrt.
fr: Une situation mal gérée par <literal>britney</literal> est si un paquet <literal>a</literal> dépend de la nouvelle version d'un paquet <literal>b</literal> et vice versa.
ja: britney によってうまく取扱われない状況は、パッケージ <literal>a</literal> がパッケージ <literal>b</literal> の新しいバージョンに依存していて、そしてその逆も、というものです。

source: An example of this is:
de: Ein Beispiel hierfür:
fr: Voici un exemple :
ja: この場合の例:

source: Neither package <literal>a</literal> nor package <literal>b</literal> is considered for update.
de: Weder Paket <literal>a</literal> noch Paket <literal>b</literal> wird für die Aktualisierung berücksichtigt.
fr: Aucun des paquets <literal>a</literal> et <literal>b</literal> ne sera considéré pour mise à jour.
ja: パッケージ <literal>a</literal> あるいはパッケージ <literal>b</literal> が更新対象と見做されない。

source: Currently, this requires some manual hinting from the release team. Please contact them by sending mail to &email-debian-release; if this happens to one of your packages.
de: Aktuell erfordert dies einige manuelle Eingriffe des Release-Teams. Bitte kontaktieren Sie es per E-Mail an &email-debian-release;, falls dies bei einem Ihrer Pakete auftritt.
fr: Actuellement, ceci nécessite un coup de pouce manuel de l'équipe de publication. Veuillez les contacter à l'adresse &email-debian-release; si cela se produit pour l'un de vos paquets.
ja: 現状、このような場合はリリースチームによる手動でのヒントが必要になります。あなたのパッケージのどれかにこのような状況が起きた場合は、&email-debian-release; にメールを送って連絡を取ってください。

source: Influence of package in testing
de: Beeinflussen eines Pakets in Testing
fr: Influence d'un paquet dans <literal>testing</literal>
ja: テスト版 (testing) にあるパッケージへの影響

source: Generally, there is nothing that the status of a package in <literal>testing</literal> means for transition of the next version from <literal>unstable</literal> to <literal>testing</literal>, with two exceptions: If the RC-bugginess of the package goes down, it may go in even if it is still RC-buggy. The second exception is if the version of the package in <literal>testing</literal> is out of sync on the different arches: Then any arch might just upgrade to the version of the source package; however, this can happen only if the package was previously forced through, the arch is in fuckedarches, or there was no binary package of that arch present in <literal>unstable</literal> at all during the <literal>testing</literal> migration.
de: Generell gibt es keine Bedeutung des Status eines Pakets in <literal>testing</literal>, der das Hinüberwechseln der nächsten Version eines Pakets von <literal>unstable</literal> nach <literal>testing</literal> erfordert, mit zwei Ausnahmen: Falls ein Paket release-unkritischer wird, könnte es sogar aufgenommen werden, wenn es immer noch release-kritisch ist. Die zweite Ausnahme ist, wenn die Version des Pakets in <literal>testing</literal> auf den verschiedenene Architekturen nicht mehr synchron ist: Dann könnte für jede Architektur nur ein Upgrade auf die Version des Quellpakets durchgeführt werden; dies kann jedoch nur auftreten, wenn das Paket vorher dorthin durchgedrängt wurde, die Architektur in Fuckedarches ist oder kein binäres Paket dieser Architektur in <literal>unstable</literal> bei der Migration nach <literal>testing</literal> vorhanden war.
fr: Généralement, l'état d'un paquet dans <literal>testing</literal> ne change rien pour la transition de la prochaine version d'<literal>unstable</literal> vers <literal>testing</literal>, avec deux exceptions : si le nombre de bogues critiques pour la publication du paquet diminue, le paquet peut migrer même s'il a encore des bogues critiques pour la publication. La seconde exception est que si la version du paquet dans <literal>testing</literal> est désynchronisée entre les différentes architectures, alors toute architecture peut être mise à jour vers la version du paquet source ; cependant, cela ne peut se produire que si le paquet a été précédemment forcé, si l'architecture est dans <literal>fuckedarches</literal> ou s'il n'y avait pas du tout de paquet binaire de cette architecture présent dans <literal>unstable</literal> lors de la migration dans <literal>testing</literal>.
ja: 一般的に言って、<literal>不安定版 (unstable)</literal> にあるパッケージのステータスが意味するのは、<literal>不安定版 (unstable)</literal> から <literal>テスト版 (testing)</literal> へ移行する次のバージョン2 つの例外があります: パッケージの RC バグ数が減っている場合、RC バグが残っていてもテスト版に入る可能性があります。2 つ目の例外は、<literal>テスト版 (testing)</literal> のパッケージのバージョンが異なったアーキテクチャで同期していない場合です: その場合、すべてのアーキテクチャがソースパッケージのバージョンへとアップグレードされることがあります。ですが、これはパッケージが以前にアーキテクチャが、<literal>テスト版 (testing)</literal> への移行の際、<literal>不安定版 (unstable)</literal> にそのアーキテクチャのバイナリパッケージが全くないという場合だけです

source: In summary this means: The only influence that a package being in <literal>testing</literal> has on a new version of the same package is that the new version might go in easier.
de: Zusammengefasst heißt das: Der einzige Einfluss eines Pakets, das sich in <literal>testing</literal> befindet, auf eine neue Version des gleichen Pakets besteht darin, dass die neue Version leichter aufgenommen werden kann.
fr: En résumé, cela signifie : la seule influence qu'un paquet de <literal>testing</literal> a sur la nouvelle version du même paquet est que la nouvelle version peut entrer plus facilement.
ja: この要旨: 影響は、<literal>テスト版 (testing)</literal> にあるパッケージが、同じパッケージの新しいバージョンになるのは、新しいバージョンの方が楽にできそうだから、ということです。

source: Details
de: Eintelheiten
fr: Détails
ja: 詳細について

source: If you are interested in details, this is how britney works:
de: Falls Sie die Einzelheiten interessieren, erklärt dies, wie Britney funktioniert:
fr: Suivent quelques informations sur le fonctionnement de <literal>britney</literal>.
ja: 詳細について知りたい場合ですが、britney の動作は以下のようになります:

source: The packages are looked at to determine whether they are valid candidates. This gives the update excuses. The most common reasons why a package is not considered are too young, RC-bugginess, and out of date on some arches. For this part of britney, the release managers have hammers of various sizes, called hints (see below), to force britney to consider a package.
de: Die Pakete werden betrachtet, um festzulegen, ob Sie gültige Kandidaten sind. Dies ergibt die Aktualisierungs-Ausreden. Die häufigsten Gründe, warum ein Paket nicht berücksichtigt wird lauten: zu neu, zu viele release-kritische Fehler und auf einigen Architekturen veraltet. Für diesen Teil von Britney verfügen die Veröffentlichungsverwalter über Druckmittel verschiedener Stärke (Hinweise genannt, siehe unten), um eine Berücksichtigung des Pakets durch Britney zu erzwingen.
fr: Les paquets sont examinés pour savoir si ce sont des candidats valides. Cela génère les dispenses de mise à jour (« <literal>update excuses</literal> »). Les raisons habituelles pour lesquelles un paquet n'est pas considéré sont la jeunesse du paquet, le nombre de bogues critiques pour la publication et la désynchronisation pour certaines architectures. Pour cette partie de <literal>britney</literal>, les responsables de publication ont des marteaux de toute taille, appelés coups de pouce (« hints », voir ci-dessous) pour forcer <literal>britney</literal> à examiner un paquet.
ja: パッケージが、適切な候補であるかどうかを決めるために確認が行われます。これによって、更新が実行されます。パッケージが候補とみなされない理由でもっともよくあるのは、まだ日数が経過していない (too young)、RC バグがある、いくつかのアーキテクチャで古くなりすぎている、というものです。britney のこの部分では、リリースマネージャーが britney がパッケージを検討できるように、hints と呼ばれる様々なサイズのハンマーを使います (下記を参照してください)。

source: Now, the more complex part happens: Britney tries to update <literal>testing</literal> with the valid candidates. For that, britney tries to add each valid candidate to the testing distribution. If the number of uninstallable packages in <literal>testing</literal> doesn't increase, the package is accepted. From that point on, the accepted package is considered to be part of <literal>testing</literal>, such that all subsequent installability tests include this package. Hints from the release team are processed before or after this main run, depending on the exact type.
de: Nun kommt der komplexere Teil: Britney versucht <literal>testing</literal> mit den gültigen Kandidaten zu aktualisieren. Dazu versucht Britney, jeden gültigen Kandidaten zur Distribution <literal>testing</literal> hinzuzufügen. Falls die Zahl nicht installierbarer Pakete in <literal>testing</literal> sich nicht erhöht, wird das Paket akzeptiert. Ab diesem Zeitpunkt wird das Paket als Teil von <literal>testing</literal> betrachtet, so dass alle anschließenden Installierbarkeitstests dieses Paket einbeziehen. Hinweise des Release-Teams werden, abhängig vom genauen Typ, vor diesem Hauptdurchlauf verarbeitet.
fr: Maintenant, la partie la plus complexe se produit : <literal>britney</literal> tente de mettre à jour <literal>testing</literal> avec des candidats valides. Pour ce faire, <literal>britney</literal> essaye d'ajouter chaque candidat valide à la distribution <literal>testing</literal>. Si le nombre de paquets non installables dans <literal>testing</literal> n'augmente pas, le paquet est accepté. À partir de là, le paquet accepté est considéré comme partie de <literal>testing</literal>, de tel sorte qu'il sera considéré dans les tests suivants d'installabilité. Avant et après cette partie, certains coups de pouce (« hints ») de l'équipe de publication sont traités.
ja: さて、より複雑な部分に差し掛かります: Britney が適正候補を使って<literal>テスト版 (testing)</literal> を更新しようとします。このため、britney はテスト版ディストリビューションに個々の適正な候補を追加しようとします。<literal>テスト版 (testing)</literal> でインストール不可能なパッケージの数が増えないのであれば、パッケージは受け入れられます。その時から、受け入れられたパッケージは<literal>テスト版 (testing)</literal> の一部として取り扱われ、このパッケージを含めるためのインストールチェックテストが引き続き行われます。リリースチームからの hints は、実際の内容に応じて、このメインの処理の前後に処理されます。

source: If you want to see more details, you can look it up on <ulink url="http://&ftp-master-host;/testing/update_output/"></ulink>.
de: Falls Sie weitere Einzelheiten suchen, können Sie unter <ulink url="http://&ftp-master-host;/testing/update_output/"></ulink> nachsehen.
fr: Pour obtenir plus de précisions, vous pouvez y jetez un œil en <ulink url="http://&ftp-master-host;/testing/update_output/"></ulink>.
ja: より詳細を見たい場合は、<ulink url="http://&ftp-master-host;/testing/update_output/"></ulink> で探すことができます。

source: The hints are available via <ulink url="http://&ftp-master-host;/testing/hints/"></ulink>, where you can find the <ulink url="http://&ftp-master-host;/testing/hints/README">description</ulink> as well. With the hints, the Debian Release team can block or unblock packages, ease or force packages into <literal>testing</literal>, remove packages from <literal>testing</literal>, approve uploads to <link linkend="t-p-u">testing-proposed-updates</link> or override the urgency.
de: Die Hinweise sind unter <ulink url="http://&ftp-master-host;/testing/hints/"></ulink> verfügbar, wo Sie auch die <ulink url="http://&ftp-master-host;/testing/hints/README">Beschreibung</ulink> finden können. Mit den Hinweisen kann das Debian-Release-Team Pakete blockieren oder Blockaden aufheben, Pakete den Übergang nach <literal>testing</literal> erleichtern oder erzwingen, Pakete aus <literal>testing</literal> entfernen, das Hochladen nach <link linkend="t-p-u">testing-proposed-updates</link> genehmigen oder die Dringlichkeit außer Kraft setzen.
fr: Les coups de pouce (« hints ») sont disponibles sur <ulink url="http://&ftp-master-host;/testing/hints/"></ulink>, qui contient aussi une <ulink url="http://&ftp-master-host;/testing/hints/README">description</ulink>. Avec les coups de pouce, l'équipe en charge de la publication de Debian peut bloquer ou débloquer des paquets, faciliter ou forcer le passage de paquets dans <literal>testing</literal>, enlever des paquets de <literal>testing</literal>, approuver des envois vers <link linkend="t-p-u">testing-proposed-updates</link> ou remplacer l'urgence.
ja: hints は、<ulink url="http://&ftp-master-host;/testing/hints/README">説明</ulink>からも探せますが、<ulink url="http://&ftp-master-host;/testing/hints/"></ulink> にあります。hints によって、Debian リリースチームはパッケージを block あるいは unblock することや、パッケージを<literal>テスト版 (testing)</literal> へ移動する手間を減らしたり強制的に移動させたり、あるいは<literal>テスト版 (testing)</literal> からパッケージを削除したり、<link linkend="t-p-u">testing-proposed-updates</link> へアップロードを許可したり、urgency を上書きすることが可能になります。

source: Direct updates to testing
de: Direkte Aktualisierungen für Testing
fr: Mises à jour directes dans <literal>testing</literal>
ja: 直接テスト版を更新する

source: The <literal>testing</literal> distribution is fed with packages from <literal>unstable</literal> according to the rules explained above. However, in some cases, it is necessary to upload packages built only for <literal>testing</literal>. For that, you may want to upload to <literal>testing-proposed-updates</literal>.
de: Die Distribution <literal>testing</literal> wird, den genannten Regeln folgend, mit Paketen aus <literal>unstable</literal> gespeist. In einigen Fällen ist es jedoch nötig, Pakete hochzuladen, die nur für <literal>testing</literal> erstellt wurden. Dafür empfiehlt es sich, nach <literal>testing-proposed-updates</literal> hochzuladen.
fr: La distribution <literal>testing</literal> est remplie de paquets en provenance d'<literal>unstable</literal> selon des règles expliquées ci-dessus. Cependant, dans certains cas, il est nécessaire d'envoyer des paquets construits seulement pour <literal>testing</literal>. Pour cela, vous pouvez envoyer vos paquets vers <literal>testing-proposed-updates</literal>.
ja: <literal>テスト版 (testing)</literal> ディストリビューションは、上記で説明したルールに従って <literal>不安定版 (unstable)</literal> からのパッケージで作られています。しかし、時折、<literal>テスト版 (testing)</literal> の為だけに構築したパッケージをアップロードする必要があるという場合があります。そのためには、<literal>testing-proposed-updates</literal> にアップロードするのが良いでしょう。

source: Keep in mind that packages uploaded there are not automatically processed, they have to go through the hands of the release manager. So you'd better have a good reason to upload there. In order to know what a good reason is in the release managers' eyes, you should read the instructions that they regularly give on &email-debian-devel-announce;.
de: Merken Sie sich, dass dorthin hochgeladene Pakete nicht automatisch verarbeitet werden, sie müssen erst durch die Hand des Veröffentlichungsverwalters gehen. Daher sollten sie besser über einen triftigen Grund verfügen, dorthin hochzuladen. Um zu erfahren, was in den Augen der Veröffentlichungsverwalter ein triftiger Grund ist, sollten sie die Anweisungen lesen, die sie reglemäßig auf &email-debian-devel-announce; erteilen.
fr: Souvenez-vous que les paquets envoyés là ne sont pas traités automatiquement, ils doivent passer entre les mains des responsables de distribution. Vous devez donc avoir une bonne raison pour les y envoyer. Pour savoir ce que représente une bonne raison aux yeux des responsables de publication, vous devriez lire les instructions données qu'ils envoient régulièrement sur &email-debian-devel-announce;.
ja: アップロードされたパッケージは自動的に処理されず、リリースマネージャの手によって処理される必要があることに注意してください。ですので、アップロードするのに十分な理由があるのが望ましいでしょう。何が十分な理由かを知るには、リリースマネージャの視点で、彼らが定期的に &email-debian-devel-announce; に流している指示を読む必要があります。

source: You should not upload to <literal>testing-proposed-updates</literal> when you can update your packages through <literal>unstable</literal>. If you can't (for example because you have a newer development version in <literal>unstable</literal>), you may use this facility, but it is recommended that you ask for authorization from the release manager first. Even if a package is frozen, updates through <literal>unstable</literal> are possible, if the upload via <literal>unstable</literal> does not pull in any new dependencies.
de: Sie sollten nicht nach <literal>testing-proposed-updates</literal> hochladen, wenn Sie Ihre Pakete über <literal>unstable</literal> aktualisieren können. Falls Sie dies nicht können (zum Beispiel, weil Sie eine neuere Entwicklerversion in <literal>unstable</literal> haben), könnten Sie diese Einrichtung nutzen, aber es ist empfohlen, dass Sie zuerst die Veröffentlichungsverwalter um Erlaubnis fragen. Aktualisierungen über <literal>unstable</literal> sind sogar möglich, wenn ein Paket eingefroren ist, falls der Upload über <literal>unstable</literal> keine neuen Abhängigkeiten mit sich bringt.
fr: Vous ne devriez pas envoyer de paquet à <literal>testing-proposed-updates</literal> quand vous pouvez le mettre à jour via <literal>unstable</literal>. Si vous ne pouvez faire autrement (par exemple, parce que vous avez une nouvelle version de développement dans <literal>unstable</literal>), vous pouvez utiliser cette facilité, mais il est recommandé de demander l'autorisation des responsables de publication auparavant. Même si un paquet est gelé, des mises à jour par <literal>unstable</literal> sont possibles si l'envoi dans <literal>unstable</literal> ne tire pas de nouvelles dépendances.
ja: <literal>不安定版 (unstable)</literal> でパッケージを更新できるのであれば、<literal>testing-proposed-updates</literal> にアップロードすべきではありません。更新できない場合 (例えば、<literal>不安定版 (unstable)</literal> に新しい開発版がある場合)、この機能を使うことができますが、まずはリリースマネージャから許可を得るのが良いでしょう。パッケージがフリーズされていても、<literal>不安定版 (unstable)</literal> 経由のアップロードが新たな依存関係を何も引き起こさない場合、<literal>不安定版 (unstable)</literal> での更新は可能です。

source: Version numbers are usually selected by adding the codename of the <literal>testing</literal> distribution and a running number, like <literal>1.2squeeze1</literal> for the first upload through <literal>testing-proposed-updates</literal> of package version <literal>1.2</literal>.
de: Versionsnummern werden normalerweise durch Hinzufügen einer fortlaufenden Nummer zum Codenamen der <literal>testing</literal>-Distribution gebildet, wie <literal>1.2squeeze1</literal> für den ersten Upload über <literal>testing-proposed-updates</literal> der Paketversion <literal>1.2</literal>.
fr: Les numéros de version sont habituellement choisis en ajoutant le nom de code de la distribution <literal>testing</literal> et un numéro incrémenté, comme <literal>1.2squeeze1</literal> pour le premier envoi dans <literal>testing-proposed-updates</literal> du paquet en version <literal>1.2</literal>.
ja: バージョン番号は、通常<literal>テスト版 (testing)</literal> ディストリビューションのコードネームと動作している番号を追加するなどして決定されます。例えば、<literal>1.2squeeze1</literal> はパッケージバージョン <literal>1.2</literal> の <literal>testing-proposed-updates</literal> への最初のアップロードです。

source: Please make sure you didn't miss any of these items in your upload:
de: Bitte stellen Sie sicher, dass keines dieser Elemente in Ihrem Upload fehlt:
fr: Veuillez vous assurer n'avoir oublié aucun des éléments suivants lors de votre envoi :
ja: アップロードで、以下の項目のいずれも見落とさないように必ずしてください:

source: Make sure that your package really needs to go through <literal>testing-proposed-updates</literal>, and can't go through <literal>unstable</literal>;
de: Vergewissern Sie sich, dass Ihr Paket wirklich <literal>testing-proposed-updates</literal> durchlaufen muss und nicht über <literal>unstable</literal> gehen kann.
fr: vérifiez que le paquet doit vraiment aller dans <literal>testing-proposed-updates</literal>, et ne peut pas passer par <literal>unstable</literal> ;
ja: 本当に <literal>testing-proposed-updates</literal> を通す必要があり、<literal>unstable</literal> ではダメなことを確認する;

source: Make sure that you included only the minimal amount of changes;
de: Achten Sie darauf, dass Sie nur die kleinstmögliche Anzahl von Änderungen eingefügt haben.
fr: vérifiez n'avoir intégré qu'un minimum de changements ;
ja: 必ず、最小限な量だけの変更を含めるようにする;

source: Make sure that you included an appropriate explanation in the changelog;
de: Sorgen Sie dafür, dass das Änderungsprotokoll eine entsprechende Erklärung enthält.
fr: vérifiez avoir ajouté une explication appropriée dans le journal de modification (<filename>changelog</filename>) ;
ja: 必ず changelog 中に適切な説明を含める;

source: Make sure that you've written <literal>testing</literal> or <literal>testing-proposed-updates</literal> into your target distribution;
de: Überzeugen Sie sich, dass in Ihre Zieldistribution <literal>testing</literal> oder <literal>testing-proposed-updates</literal> geschrieben haben.
fr: vérifiez avoir bien indiqué <literal>testing</literal> ou <literal>testing-proposed-updates</literal> comme distribution cible ;
ja: 必ず、対象とするディストリビューションとして <literal>testing</literal> か <literal>testing-proposed-updates</literal> を記述している;
