Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: The email notification from <command>katie</command> when an uploaded binary package is accepted. In other words, whenever a build daemon or a porter uploads your package for another architecture, you can get an email to track how your package gets recompiled for all architectures.
de: die E-Mail-Benachrichtigung von <command>katie</command>, wenn ein hochgeladenes Binärpaket akzeptiert wurde. Mit anderen Worten – Sie können immer, wenn ein Paketerstellungs-Daemon oder jemand, der Ihr Paket portiert und für eine andere Architektur hochlädt, eine E-Mail erhalten, um zu verfolgen, wie Ihr Paket für alle Architekturen neu kompiliert wird.
fr: les courriers d'information de <command>katie</command> quand un paquet binaire est accepté. En d'autres termes, à chaque fois qu'un démon de compilation ou un porteur envoie le paquet pour une architecture, un courrier est envoyé ce qui permet de suivre comment le paquet est recompilé pour toutes les architectures ;
ja: バイナリパッケージが受け入れられた際に <command>katie</command> から送られる通知メールです。言い換えると、あなたのパッケージがビルドデーモンや他のアーキテクチャについて移植者によってアップロードされた場合は、どの様に全アーキテクチャに対してリコンパイルされているかを追跡するためのメールを受け取れるということです。

source: VCS commit notifications, if the package has a VCS repository and the maintainer has set up forwarding of commit notifications to the PTS. The "cvs" name is historic, in most cases commit notifications will come from some other VCS like subversion or git.
de: »commit«-Benachrichtigungen des VCS, falls das Paket ein VCS-Depot hat und der Betreuer im PTS eine Weiterleitung von »commit«-Benachrichtigungen eingerichtet hat. Der Name »cvs« ist historisch bedingt, in den meisten Fällen werden »commit«-Benachrichtigungen von anderen VCS, wie Subversion oder Git kommen.
fr: les annonces de nouvelle révision dans le système de gestion de versions (« <literal>VCS commit</literal> »), si le paquet est maintenu avec un tel système et que le responsable a mis en place un suivi de révisions vers le PTS. Le nom <literal>cvs</literal> est historique, la plupart du temps les notifications de révision proviendront d'autres logiciels de gestion de versions comme <literal>Subversion</literal> ou <literal>Git</literal> ;
ja: パッケージが VCS リポジトリを持っていて、メンテナがコミット通知を PTS に転送するように設定している場合の VCS コミット通知です。歴史的な経緯から "cvs" という名前が使われていますが、大抵の場合は subversion や git のような他の VCS からの通知です。

source: Translations of descriptions or debconf templates submitted to the Debian Description Translation Project.
de: Übersetzungen und Beschreibungen von Debconf-Schablonen, die an das »Debian Description Translation Project« gesandt wurden.
fr: les traductions de descriptions ou de questionnaires debconf soumis au projet de traduction des descriptions de paquets (« <literal>Debian Description Translation Project</literal> » ou <literal>DDTP</literal> ;
ja: Debian Description 翻訳プロジェクトに投稿された descriptions の翻訳や debconf テンプレート。

source: Information about changes made to the package in derivative distributions (for example Ubuntu).
de: Informationen über Änderungen am Paket, die in abgeleiteten Distributionen (zum Beispiel Ubuntu) vorgenommen wurden.
fr: des informations sur les changements effectués sur le paquet dans les distributions dérivées (<literal>Ubuntu</literal> par exemple).
ja: 派生ディストリビューションでのパッケージに加えられた変更の情報 (例 Ubuntu)。

source: Bugs reports and comments from derivative distributions (for example Ubuntu).
de: Fehlerberichte und Kommentare von abgeleiteten Distributionen (zum Beispiel Ubuntu)
fr: les rapports de bogue et leurs commentaires dans les distributions dérivées (<literal>Ubuntu</literal> par exemple).
ja: 派生ディストリビューションでのバグレポートやコメント (例 Ubuntu)。

source: The PTS email interface
de: Die E-Mail-Schnittstelle des PTS
fr: Interface de courrier du PTS
ja: PTS メールインターフェイス

source: You can control your subscription(s) to the PTS by sending various commands to <email>pts@qa.debian.org</email>.
de: Sie können Ihr(e) Abonnement(s) zum PTS steuern, indem Sie verschiedene Befehle an <email>pts@qa.debian.org</email> senden.
fr: Les inscriptions au PTS peuvent être administrées en envoyant différentes commandes à <email>pts@qa.debian.org</email>.
ja: PTS の購読管理は <email>pts@qa.debian.org</email> へ様々なコマンドを送信することで可能です。

source: <literal>subscribe &lt;sourcepackage&gt; [&lt;email&gt;]</literal>
fr: <literal>subscribe &lt;paquet-source&gt; [&lt;adresse&gt;]</literal>

source: Subscribes <replaceable>email</replaceable> to communications related to the source package <replaceable>sourcepackage</replaceable>. Sender address is used if the second argument is not present. If <replaceable>sourcepackage</replaceable> is not a valid source package, you'll get a warning. However if it's a valid binary package, the PTS will subscribe you to the corresponding source package.
de: abonniert <replaceable>E-Mails</replaceable> zu Kommunikationen, die sich auf das Quellpaket <replaceable>Quellpaket</replaceable> beziehen. Falls das zweite Argument fehlt, wird die Absenderadresse benutzt. Wenn <replaceable>Quellpaket</replaceable> kein gültiges Quellpaket ist, werden Sie eine Warnung erhalten. Falls es jedoch um ein gültiges Binärpaket handelt, wird das PTS Ihnen das entsprechende Quellpaket abonnieren.
fr: Inscrit l'<replaceable>adresse</replaceable> aux communications liées au paquet source <replaceable>paquet-source</replaceable>. L'adresse de l'expéditeur est utilisée si le second paramètre n'est pas présent. Si <replaceable>paquet-source</replaceable> n'est pas un paquet source valable, vous recevrez un avertissement. Cependant, s'il s'agit d'un paquet binaire valable, le PTS vous inscrira pour le paquet source correspondant.
ja: <replaceable>email</replaceable> を対応するソースパッケージ <replaceable>sourcepackage</replaceable> への連絡先として登録します。二番目の引数が存在しない場合には送信者アドレスが使われます。<replaceable>sourcepackage</replaceable> が正しくないソースパッケージである場合は、警告メールが送付されます。正しいバイナリパッケージである場合には、PTS は対応するソースパッケージの購読者として登録します。

source: <literal>unsubscribe &lt;sourcepackage&gt; [&lt;email&gt;]</literal>
fr: <literal>unsubscribe &lt;paquet-source&gt; [&lt;adresse&gt;]</literal>

source: Removes a previous subscription to the source package <replaceable>sourcepackage</replaceable> using the specified email address or the sender address if the second argument is left out.
de: entfernt ein vorheriges Abonnement des Quellpakets <replaceable>Quellpaket</replaceable> unter Benutzung der angegebenen E-Mail-Adresse oder der Absenderadresse, falls das zweite Argument ausgelassen wird.
fr: Supprime une inscription au paquet source <replaceable>paquet-source</replaceable> en utilisant l'adresse spécifiée ou l'adresse de l'expéditeur si le second paramètre n'est pas rempli.
ja: 指定されたメールアドレス、あるいは二番目の引数が空の場合は送信者のアドレスを利用して、ソースパッケージ <replaceable>sourcepackage</replaceable> に対するそれまでの購読を取り消します。

source: <literal>unsubscribeall [&lt;email&gt;]</literal>
fr: <literal>unsubscribeall [&lt;adresse&gt;]</literal>

source: Removes all subscriptions of the specified email address or the sender address if the second argument is left out.
de: entfernt alle Abonnements der angegebenen E-Mail-Adresse oder der Absenderadresse, falls das zweite Argument ausgelassen wurde.
fr: Supprime toutes les inscriptions de l'adresse spécifiée ou de l'adresse de l'expéditeur si le second paramètre n'est pas rempli.
ja: 指定されたメールアドレス、あるいは二つ目の引数が空白の場合は送信者アドレスのすべての購読を停止します。

source: <literal>which [&lt;email&gt;]</literal>
fr: <literal>which [&lt;adresse&gt;]</literal>

source: Lists all subscriptions for the sender or the email address optionally specified.
de: listet alle Abonnements des Absenders oder der optional angegebenen E-Mail-Adresse auf.
fr: Liste les inscriptions pour l'expéditeur ou pour l'adresse indiquée si elle est spécifiée.
ja: 送信者あるいは追加で指定したメールアドレスに対する全購読リストを確認する。

source: <literal>keyword [&lt;email&gt;]</literal>
fr: <literal>keyword [&lt;adresse&gt;]</literal>

source: Tells you the keywords that you are accepting. For an explanation of keywords, <link linkend="pkg-tracking-system">see above</link>. Here's a quick summary:
de: zählt die Schlüsselwörter auf, die Sie akzeptieren. Eine Erklärung der Schlüsselwörter finden Sie<link linkend="pkg-tracking-system">oberhalb</link>. Hier ist eine kurze Zusammenfassung:
fr: Donne les mots-clés acceptés. Pour une explication de ces mots-clés, <link linkend="pkg-tracking-system">voir ci-dessus</link>. Voici un rapide résumé :
ja: キーワードは利用したいものを入れてください。キーワードの説明は、<link linkend="pkg-tracking-system">上記を確認してください</link>。以下が簡単なサマリです:

source: <literal>bts</literal>: mails coming from the Debian Bug Tracking System
de: <literal>bts</literal>: E-Mails von der Debian-Fehlerdatenbank
fr: <literal>bts</literal> : courriers venant du système de gestion de bogues (BTS) Debian ;
ja: <literal>bts</literal>: Debian バグ追跡システムからのメール

source: <literal>bts-control</literal>: reply to mails sent to &email-bts-control;
de: <literal>bts-control</literal>: Antworten auf E-Mails, die an &email-bts-control; gesandt wurden
fr: <literal>bts-control</literal> : réponses aux courriers envoyés à &email-bts-control; ;
ja: <literal>bts-control</literal>: &email-bts-control; へ送信される返信メール

source: <literal>summary</literal>: automatic summary mails about the state of a package
de: <literal>summary</literal>: automatische Zusammenfassungs-E-Mails über den Status eines Pakets
fr: <literal>summary</literal> ; courriers de résumé automatique sur l'état d'un paquet ;
ja: <literal>summary</literal>: パッケージ状態の自動サマリメール

source: <literal>contact</literal>: mails sent to the maintainer through the *@packages.debian.org aliases
de: <literal>contact</literal>: E-Mails, die dem Betreuer durch die *@packages.debian.org-Aliase gesandt werden
fr: <literal>contact</literal> ; courriers envoyés au responsable via l'alias <literal>*@packages.debian.org</literal> ;
ja: <literal>contact</literal>: *@packages.debian.org エイリアスアドレスを通じてメンテナに送られるメール

source: <literal>cvs</literal>: notification of VCS commits
de: <literal>cvs</literal>: Benachrichtigungen über VCS-Commits
fr: <literal>cvs</literal> : annonces de nouvelle révision (« <literal>VCS commit</literal> ») ;
ja: <literal>cvs</literal>: VCS へのコミット通知

source: <literal>ddtp</literal>: translations of descriptions and debconf templates
de: <literal>ddtp</literal>: Übersetzungen von Beschreibungen und Debconf-Schablonen
fr: <literal>ddtp</literal> : traductions des descriptions et questionnaires debconf ;
ja: <literal>ddtp</literal>: description や debconf テンプレートの翻訳

source: <literal>derivatives</literal>: changes made on the package by derivative distributions
de: <literal>derivatives</literal>: Änderungen am Paket durch abgeleitete Distributionen
fr: <literal>derivatives</literal> : changements effectués dans des distributions dérivées ;
ja: <literal>derivatives</literal>: 派生ディストリビューションによるパッケージ変更

source: <literal>derivatives-bugs</literal>: bugs reports and comments from derivative distributions
de: <literal>derivatives-bugs</literal>: Fehlerberichte und Kommentare von abgeleiteten Distributionen
fr: <literal>derivatives-bugs</literal> : rapports de bogue et leurs commentaires dans les distributions dérivées ;
ja: <literal>derivatives-bugs</literal>: 派生ディストリビューションからのバグレポートやコメント

source: <literal>upload-source</literal>: announce of a new source upload that has been accepted
de: <literal>upload-source</literal>: Ankündigung, dass eine neu hochgeladene Quelle akzeptiert wurde
fr: <literal>upload-source</literal> : annonce lorsqu'un nouveau paquet source a été accepté ;
ja: <literal>upload-source</literal>: 新たなソースパッケージが受け付けられたアナウンス

source: <literal>upload-binary</literal>: announce of a new binary-only upload (porting)
de: <literal>upload-binary</literal>: Ankündigung eines neuen, rein binären Hochladens (Poertierung)
fr: <literal>upload-binary</literal> : annonce lorsqu'un nouveau paquet binaire a été accepté ;
ja: <literal>upload-binary</literal>: 新たなバイナリのみのアップロード (binary-only upload) のアナウンス (porting)

source: <literal>katie-other</literal>: other mails from ftpmasters (override disparity, etc.)
de: <literal>katie-other</literal>: andere E-Mails von FTP-Mastern (Ungleichheit beim Überschreiben etc.)
fr: <literal>katie-other</literal> : autres courriers des responsables de l'archive (incohérence de modification des champs, etc.) ;
ja: <literal>katie-other</literal>: ftpmaster からの他のメール (override disparity など。)

source: <literal>buildd</literal>: build failures notifications from build daemons
de: <literal>buildd</literal>: Benachrichtigungen über das Fehlschlagen der Paketerstellung, gesandt durch Paketerstellungs-Daemons
fr: <literal>buildd</literal>: notifications d'erreur des démons de compilation ;
ja: <literal>buildd</literal>: ビルドデーモンからのビルド失敗の通知

source: <literal>default</literal>: all the other mails (those which aren't automatic)
de: <literal>default</literal>: all die anderen E-Mails (die nicht automatisch erstellt wurden)
fr: <literal>default</literal> : tout autre courrier (non automatique).
ja: <literal>default</literal>: 他のすべてのメール (自動ではないもの)

source: <literal>keyword &lt;sourcepackage&gt; [&lt;email&gt;]</literal>
fr: <literal>keyword &lt;paquet-source&gt; [&lt;adresse&gt;]</literal>

source: Same as the previous item but for the given source package, since you may select a different set of keywords for each source package.
de: entspricht dem vorherigen Element, aber für das angegebene Quellpaket, da Sie eine andere Zusammenstellung von Schlüsselwörtern für jedes Quellpaket wählen könnten.
fr: Identique à l'élément précédent, mais pour un paquet source donné car il est possible de sélectionner un ensemble de mots-clés différent pour chaque paquet source.
ja: 前の項目同様ですが、指定したソースパッケージについて、それぞれのソースパッケージに異なったキーワードをしたい場合に利用します。

source: <literal>keyword [&lt;email&gt;] {+|-|=} &lt;list of keywords&gt;</literal>
fr: <literal>keyword [&lt;adresse&gt;] {+|-|=} &lt;liste de mots-clés&gt;</literal>

source: Accept (+) or refuse (-) mails classified under the given keyword(s). Define the list (=) of accepted keywords. This changes the default set of keywords accepted by a user.
de: E-Mails akzeptieren (+) oder ablehnen (-), die unter dem/den angegebenen Schlüsselwort/Schlüsselwörtern klassifiziert wurden. Definiert die Liste (=) akzeptierter Schlüsselwörter. Dies ändert die Standardzusammenstellung der durch einen Anwender akzeptierten Schlüsselwörter.
fr: Accepte (+) ou refuse (-) les courriers classés dans la liste de mots-clés. Définit la liste (=) des mots-clés acceptés. Ceci change l'ensemble par défaut des mots-clés acceptés par un utilisateur.
ja: 指定したキーワードで、メールが許可 (+) あるいは拒否 (-) に分類されます。許可するキーワードのリストを定義 (=) してください。これはユーザが許可したデフォルトのキーワードリストを変更します。

source: <literal>keywordall [&lt;email&gt;] {+|-|=} &lt;list of keywords&gt;</literal>
fr: <literal>keywordall [&lt;adresse&gt;] {+|-|=} &lt;liste de mots-clés&gt;</literal>

source: Accept (+) or refuse (-) mails classified under the given keyword(s). Define the list (=) of accepted keywords. This changes the set of accepted keywords of all the currently active subscriptions of a user.
de: E-Mails akzeptieren (+) oder ablehnen (-), die unter dem/den angegebenen Schlüsselwort/Schlüsselwörtern klassifiziert wurden. Definiert die Liste (=) akzeptierter Schlüsselwörter. Dies ändert die Zusammenstellung der durch einen Anwender akzeptierten Schlüsselwörter aller derzeit aktiven Abonnements.
fr: Accepte (+) ou refuse (-) les courriers classés dans la liste de mots-clés. Définit la liste (=) des mots-clés acceptés. Ceci change les mots-clés de toutes les inscriptions en cours d'un utilisateur.
ja: 指定したキーワードで、メールが許可 (+) あるいは拒否 (-) に分類されます。許可するキーワードのリストを定義 (=) してください。これは現在購読しているユーザによって許可されているデフォルトのキーワードリストを変更します。

source: <literal>keyword &lt;sourcepackage&gt; [&lt;email&gt;] {+|-|=} &lt;list of keywords&gt;</literal>
fr: <literal>keyword &lt;sourcepackage&gt; [&lt;adresse&gt;] {+|-|=} &lt;liste de mots-clés&gt;</literal>

source: Same as previous item but overrides the keywords list for the indicated source package.
de: entspricht dem vorherigen Element, überschreibt aber die Liste der Schlüsselwörter für das angegebene Quellpaket
fr: Identique à l'élément précédent, mais remplace la liste des mots-clés pour le paquet source indiqué.
ja: 上の項目と同じですが、指定したソースパッケージのキーワードリストを上書きします。

source: Stops processing commands. All following lines are ignored by the bot.
de: stoppt die Verarbeitung von Befehlen. Alle folgenden Zeilen werden vom Roboter ignoriert.
fr: Arrête le traitement des commandes. Toutes les lignes suivantes sont ignorées par le robot.
ja: コマンド処理を終了します。これ以下の全ての行は bot からは無視されます。

source: The <command>pts-subscribe</command> command-line utility (from the <systemitem role="package">devscripts</systemitem> package) can be handy to temporarily subscribe to some packages, for example after having made an non-maintainer upload.
de: Das Befehlszeilen-Hilfswerkzeug <command>pts-subscribe</command> (aus dem Paket <systemitem role="package">devscripts</systemitem>) kann praktisch sein, um temporär einige Paket zu abonnieren, zum Beispiel nach einem NMU (Hochladen durch jemanden, der nicht Betreuer des Pakets ist).
fr: L'utilitaire en ligne de commande <command>pts-subscribe</command> (du paquet <systemitem role="package">devscripts</systemitem>) peut être pratique pour s'inscrire temporairement à certains paquets, par exemple après avoir fait une mise à jour indépendante (NMU).
ja: <command>pts-subscribe</command> コマンドラインユーティリティ (<systemitem role="package">devscripts</systemitem> パッケージに含まれています) は、例えば non-maintainer アップロードが行われた後など、手動でパッケージの一時的な購読が行えます。

source: Filtering PTS mails
de: PTS-E-Mails filtern
fr: Filtrer les courriers du PTS
ja: PTS からのメールを振り分ける

source: Once you are subscribed to a package, you will get the mails sent to <literal><replaceable>sourcepackage</replaceable>@&pts-host;</literal>. Those mails have special headers appended to let you filter them in a special mailbox (e.g. with <command>procmail</command>). The added headers are <literal>X-Loop</literal>, <literal>X-PTS-Package</literal>, <literal>X-PTS-Keyword</literal> and <literal>X-Unsubscribe</literal>.
de: Sobald Sie ein Paket abonniert haben, werden Sie die E-Mails bekommen, die an das <literal><replaceable>Quellpaket</replaceable>@&pts-host;</literal> geschickt werden. An diese E-Mails sind besondere Kopfzeilen angehängt, die Ihnen ermöglichen, sie per Filter in ein besonderes Postfach abzulegen (z.B. mit <command>procmail</command>). Die hinzugefügten Kopfzeilen sind <literal>X-Loop</literal>, <literal>X-PTS-Package</literal>, <literal>X-PTS-Keyword</literal> und <literal>X-Unsubscribe</literal>.
fr: Une fois inscrit à un paquet, vous recevrez les courriers envoyés à <literal><replaceable>paquet-source</replaceable>@&pts-host;</literal>. Ces courriers ont des en-têtes spéciaux ajoutés pour vous permettre de les filtrer dans des boîtes aux lettres (avec <command>procmail</command> par exemple). Les en-têtes ajoutés sont <literal>X-Loop</literal>, <literal>X-PTS-Package</literal>, <literal>X-PTS-Keyword</literal> et <literal>X-Unsubscribe</literal>.
ja: パッケージの購読を行うと、<literal><replaceable>sourcepackage</replaceable>@&pts-host;</literal> へ送られるメールを受けとるようになります。このメールは (例えば <command>procmail</command> を使って) 別のメールボックスへとフィルタできるように特別なヘッダがされています。追加されるヘッダは <literal>X-Loop</literal>、<literal>X-PTS-Package</literal>、<literal>X-PTS-Keyword</literal>、<literal>X-Unsubscribe</literal> です。

source: Here is an example of added headers for a source upload notification on the <systemitem role="package">dpkg</systemitem> package:
de: Hier folgt ein Beispiel hinzugefügter Kopfzeilen für die Benachrichtigung, dass die Quelle des Pakets <systemitem role="package">dpkg</systemitem> hochgeladen wurde:
fr: Voici un exemple d'en-têtes ajoutés pour une notification d'envoi de source sur le paquet <systemitem role="package">dpkg</systemitem> :
ja: 以下は <systemitem role="package">dpkg</systemitem> パッケージに対するソースアップロードについて付加されるヘッダの例です:

source: Forwarding VCS commits in the PTS
de: VCS-Commits in das PTS weiterleiten
fr: Faire suivre les annonces de révision vers le PTS
ja: PTS での VCS コミットを転送する

source: If you use a publicly accessible VCS repository for maintaining your Debian package, you may want to forward the commit notification to the PTS so that the subscribers (and possible co-maintainers) can closely follow the package's evolution.
de: Falls Sie zur Verwaltung eines Debian-Pakets ein VCS-Depot mit öffentlichem Zugriff verwenden, möchten Sie vielleicht die Commit-Benachrichtigungen an das PTS weiterleiten, damit die Abonnenten (und möglicherweise Mitbetreuer) die Entwicklung des Pakets genau verfolgen können.
fr: Si vous utilisez un système de gestion de versions accessible publiquement pour maintenir votre paquet Debian, vous pouvez faire suivre les notifications de modifications vers le PTS pour que les inscrits (ainsi que de possibles co-responsables) puissent suivre de près l'évolution du paquet.
ja: Debian パッケージのメンテナンスに公開 VCS リポジトリを使っている場合、PTS にコミット通知を転送することで、購読者 (や共同メンテナら) がパッケージの変更をすぐに知ることができます。

source: Once you set up the VCS repository to generate commit notifications, you just have to make sure it sends a copy of those mails to <literal><replaceable>sourcepackage</replaceable>_cvs@&pts-host;</literal>. Only the people who accept the <literal>cvs</literal> keyword will receive these notifications. Note that the mail needs to be sent from a <literal>debian.org</literal> machine, otherwise you'll have to add the <literal>X-PTS-Approved: 1</literal> header.
de: Sobald Sie das VCS-Depot eingerichtet haben, um Commit-Benachrichtigungen zu erzeugen, müssen Sie nur sicherstellen, dass es eine Kopie dieser E-Mails an <literal><replaceable>Quellpaket</replaceable>_cvs@&pts-host;</literal> sendet. Nur die Leute, die das Schlüsselwort <literal>cvs</literal> akzeptieren werden diese Benachrichtigungen erhalten. Beachten Sie, dass die E-Mail von einer <literal>debian.org</literal>-Maschine versandt werden muss. Andernfalls müssen Sie die Kopfzeile <literal>X-PTS-Approved: 1</literal> hinzufügen.
fr: Une fois le système de gestion de versions configuré pour générer des notifications de modifications, il suffit d'en envoyer une copie à <literal><replaceable>paquet-source</replaceable>_cvs@&pts-host;</literal>. Seules les personnes ayant accepté le mot-clé <literal>cvs</literal> recevront les notifications. Si le message n'est pas envoyé depuis une machine du domaine <literal>debian.org</literal>, il faut ajouter l'en-tête <literal>X-PTS-Approved: 1</literal>.
ja: VCS リポジトリを設定してコミット通知を行うようにするのであれば、<literal><replaceable>sourcepackage</replaceable>_cvs@&pts-host;</literal> にメールのコピーが送れるようにしなければいけません。<literal>cvs</literal> キーワードを許可した人だけがこれらの通知を受け取ります。メールは <literal>debian.org</literal> のマシンから送られる必要があり、それ以外の場合は <literal>X-PTS-Approved: 1</literal> ヘッダを付け加える必要があるのに注意してください。

source: For Subversion repositories, the usage of svnmailer is recommended. See <ulink url="&url-alioth-pkg;" /> for an example on how to do it.
de: Für Subversion-Depots wird die Benutzung von Svnmailer empfohlen. Ein Beispiel, wie das funktioniert, finden Sie unter <ulink url="&url-alioth-pkg;" />
fr: Pour les dépôts <literal>Subversion</literal>, il est conseillé d'utiliser <systemitem role="package">svnmailer</systemitem>. Voir <ulink url="&url-alioth-pkg;" /> pour un exemple de mise en place.
ja: Subversion のリポジトリは、svnmailer の利用が推奨されています。どの様に行うかは <ulink url="&url-alioth-pkg;" /> を参照してください。

source: The PTS web interface
de: Die PTS-Web-Schnittstelle
fr: Interface web du PTS
ja: PTS ウェブインターフェイス
