Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: If, on the other hand, you need to change the <literal>subsection</literal> of one of your packages (e.g., ``devel'', ``admin''), the procedure is slightly different. Correct the subsection as found in the control file of the package, and re-upload that. Also, you'll need to get the override file updated, as described in <xref linkend="override-file"/>.
de: Falls Sie andererseits die <literal>subsection</literal> eines Ihrer Pakete ändern müssen (z.B. »devel«, »admin«), ist die Prozedur etwas anders. Korrigieren Sie den in der Steuerungsdatei gefundenen Unterbereich des Pakets und laden Sie es erneut hoch. Außerdem müssen Sie die Datei »override« aktualisieren, wie es in <xref linkend="override-file"/> beschrieben wird.
fr: Pour changer la sous-section d'un paquet (<literal>devel</literal> ou <literal>admin</literal> par exemple), la procédure est légèrement différente. Modifiez la sous-section dans le fichier de contrôle du paquet et renvoyez-le. Il vous faudra ensuite demander la modification du fichier <literal>override</literal> comme décrit en <xref linkend="override-file"/>.
ja: 一方で、もしパッケージの一つの<literal>サブセクション</literal> (例:「devel」「admin」) を変更する必要がある、という場合には、手順は全く異なります。パッケージの control ファイルにあるサブセクションを修正して、再アップロードします。また、<xref linkend="override-file"/> に記述してあるように override ファイルを更新する必要が出てくるでしょう。

source: Removing packages
de: Pakete entfernen
fr: Suppression de paquet
ja: パッケージの削除

source: If for some reason you want to completely remove a package (say, if it is an old compatibility library which is no longer required), you need to file a bug against <systemitem role="package">&ftp-debian-org;</systemitem> asking that the package be removed; as all bugs, this bug should normally have normal severity. The bug title should be in the form <literal>RM: <replaceable>package</replaceable> <replaceable>[architecture list]</replaceable> -- <replaceable>reason</replaceable></literal>, where <replaceable>package</replaceable> is the package to be removed and <replaceable>reason</replaceable> is a short summary of the reason for the removal request. <replaceable>[architecture list]</replaceable> is optional and only needed if the removal request only applies to some architectures, not all. Note that the <command>reportbug</command> will create a title conforming to these rules when you use it to report a bug against the <systemitem role="package">&ftp-debian-org;</systemitem> pseudo-package.
de: Falls Sie aus irgendeinem Grund das Paket vollständig entfernen möchten (etwa, weil es eine alte Kompatibilitätsbibliothek ist, die nicht länger erforderlich ist), müssen sie einen Fehler gegen <systemitem role="package">&ftp-debian-org;</systemitem> einreichen, in dem Sie darum bitten, das Paket zu entfernen. Wie alle Fehler sollte auch dieser normalerweise den Schweregrad »normal« haben. Der Fehlertitel sollte die Form <literal>RM: <replaceable>Paket</replaceable> <replaceable>[Architekturenliste]</replaceable> -- <replaceable>Grund</replaceable></literal> haben, wobei <replaceable>Paket</replaceable> der Name des zu entfernenden Pakets und <replaceable>Grund</replaceable> eine kurze Zusammenfassung sein sollte, aus welchem Grund um Entfernen gebeten wird. <replaceable>[Architekturenliste]</replaceable> ist optional und wird nur benötigt, wenn das Entfernen lediglich einige Architekturen betrifft, aber nicht alle. Beachten Sie, dass <command>reportbug</command> einen Titel erstellt, der diesen Regeln entspricht, wenn Sie es benutzen, um einen Fehler des Pseudo-Pakets <systemitem role="package">&ftp-debian-org;</systemitem> melden.
fr: Pour supprimer complètement un paquet de l'archive (une vieille bibliothèque de compatibilité devenue inutile par exemple), il faudra envoyer un rapport de bogue sur le pseudopaquet <systemitem role="package">&ftp-debian-org;</systemitem> et demander la suppression du paquet ; comme chaque bogue, il devrait être de gravité normale. Le titre du rapport devrait être de la forme <literal>RM: <replaceable>paquet</replaceable> <replaceable>[liste d'architectures]</replaceable> -- <replaceable>raison</replaceable></literal>, où <replaceable>paquet</replaceable> est le paquet à supprimer et <replaceable>raison</replaceable> un court résumé de la raison de la demande. <replaceable>[liste d'architectures]</replaceable> est facultatif, il n'est requis que si la demande ne concerne pas toutes les architectures. Remarquez que <command>reportbug</command> préparera un titre conforme à ces règles lors de la création d'un bogue sur le pseudopaquet <systemitem role="package">&ftp-debian-org;</systemitem>.
ja: 何らかの理由でパッケージを完全に削除したくなった場合 (もう必要がなくなった古い互換用ライブラリの場合、など)、パッケージを削除するよう <systemitem role="package">&ftp-debian-org;</systemitem> に対してバグ登録をする必要があります; すべてのバグ同様、通常このバグは重要度 normal です。バグの題名は <literal>RM: <replaceable>パッケージ名</replaceable> <replaceable>[アーキテクチャ一覧]</replaceable> -- <replaceable>理由</replaceable></literal> という形式である必要があります。<replaceable>パッケージ名</replaceable>は削除されるパッケージ、<replaceable>理由</replaceable>は削除を依頼する理由の短い要約です。<replaceable>[アーキテクチャ一覧]</replaceable>はオプションで、削除依頼が全アーキテクチャではなく一部のアーキテクチャのみに適用される場合にのみ、必要となります。<command>reportbug</command> は <systemitem role="package">&ftp-debian-org;</systemitem> 擬似パッケージに対してバグを報告しようとした場合に、これらのルールに則ってバグの題名を作成しようとすることに注意してください。

source: If you want to remove a package you maintain, you should note this in the bug title by prepending <literal>ROM</literal> (Request Of Maintainer). There are several other standard acronyms used in the reasoning for a package removal, see <ulink url="http://&ftp-master-host;/removals.html"></ulink> for a complete list. That page also provides a convenient overview of pending removal requests.
de: Falls Sie ein Paket entfernen wollen, das Sie betreuen, sollten Sie dies im Fehlertitel durch Voranstellen von <literal>ROM</literal> (Request Of Maintainer) anmerken. Es gibt mehrere andere Standardabkürzungen, die als Grund für das Entfernen von Paketen benutzt werden. Eine komplette Liste finden Sie unter <ulink url="http://&ftp-master-host;/removals.html"></ulink>. Diese Seite stellt außerdem einen praktischen Überblick über ausstehende Anfragen zum Entfernen bereit.
fr: Si vous êtes responsable du paquet à supprimer, il faudrait le préciser dans le titre du rapport en commençant celui-ci par la mention <literal>ROM</literal> (« <literal>Request Of Maintainer</literal> », demande du responsable). De nombreux autres acronymes sont utilisés pour justifier la suppression d'un paquet, voir la liste complète sur <ulink url="http://&ftp-master-host;/removals.html"></ulink>. Cette page fournit également une vue d'ensemble des requêtes en cours.
ja: あなたがメンテナンスしているパッケージを削除したくなった場合は、題名の先頭に <literal>ROM</literal> (Request Of Maintainer) という文字を付けたバグにこれを記述する必要があります。パッケージの削除理由に使われる他の一般的な略語が幾つかありますので、完全な一覧については <ulink url="http://&ftp-master-host;/removals.html"></ulink> を参照してください。このページでは、まだ作業されていない削除依頼の便利な一覧も見ることができます。

source: Note that removals can only be done for the <literal>unstable</literal>, <literal>experimental</literal> and <literal>stable</literal> distribution. Packages are not removed from <literal>testing</literal> directly. Rather, they will be removed automatically after the package has been removed from <literal>unstable</literal> and no package in <literal>testing</literal> depends on it. (Removals from <literal>testing</literal> are possible though by filing a removal bug report against the <systemitem role="package">&release-debian-org;</systemitem> pseudo-package. See the section <xref linkend="removals"/>.)
de: Beachten Sie, dass Pakete nur aus den Distributionen <literal>unstable</literal>, <literal>experimental</literal> und <literal>stable</literal> entfernt werden können. Pakete werden nicht direkt aus <literal>testing</literal> entfernt. Sie werden vielmehr automatisch entfernt, nachdem das Paket aus <literal>unstable</literal> entfernt wurde und in <literal>testing</literal> kein Paket davon abhängt. (Etwas aus <literal>testing</literal> zu entfernen ist durch Einreichen eines Fehlerberichts an das Pseudopaket <systemitem role="package">&release-debian-org;</systemitem> möglich. Siehe den Abschnitt <xref linkend="removals"/>.)
fr: Seuls les paquets d'<literal>unstable</literal>, <literal>experimental</literal> ou <literal>stable</literal> peuvent être supprimés. Les paquets de <literal>testing</literal> ne sont pas supprimés directement. Ils sont plutôt enlevés automatiquement après suppression d'<literal>unstable</literal> et si aucun paquet de <literal>testing</literal> n'en dépend. (Les suppressions de <literal>testing</literal> sont possibles aussi en soumettant un bogues de suppression sur le pseudopaquet <systemitem role="package">&release-debian-org;</systemitem>. Consultez la section <xref linkend="removals"/>.)
ja: 削除は<literal>不安定版 (unstable)</literal>、<literal>実験版 (experimental)</literal>、<literal>安定版 (stable)</literal> ディストリビューションに対してのみ実施が可能であることに注意してください。パッケージは <literal>テスト版 (testing)</literal> から直接は削除されません。代わりに<literal>不安定版 (unstable)</literal> から削除された後で自動的に削除され、<literal>テスト版 (testing)</literal> にあるパッケージは削除されたパッケージに依存しなくなります (<systemitem role="package">&release-debian-org;</systemitem> 擬似パッケージへ削除依頼のバグレポートを登録することで、<literal>テスト版 (testing)</literal>からの削除は可能ではあります。<xref linkend="removals"/>の項目を参照して下さい)。

source: There is one exception when an explicit removal request is not necessary: If a (source or binary) package is no longer built from source, it will be removed semi-automatically. For a binary-package, this means if there is no longer any source package producing this binary package; if the binary package is just no longer produced on some architectures, a removal request is still necessary. For a source-package, this means that all binary packages it refers to have been taken over by another source package.
de: Es gibt eine Ausnahme, bei der eine explizite Anfrage zum Entfernen nicht nötig ist: Falls ein (Quell- oder Binär-) Paket nicht länger aus der Quelle erstellt wird, wird es halbautomatisch entfernt. Bei einem Binärpaket ist dies der Fall, wenn kein Quellpaket dieses Binärpaket weiterhin erzeugt. Falls das Binärpaket nur auf einigen Architekturen nicht länger erstellt wird, ist eine Anfrage zum Entfernen weiterhin nötig. Für ein Quell-Paket bedeutet dies, dass alle Binärpakete, die sich darauf beziehen, von einem anderen Quellpaket übernommen werden müssen.
fr: Il existe une exception pour laquelle il n'est pas nécessaire de faire une demande explicite de suppression : si un paquet (source ou binaire) ne se construit plus depuis le source, il sera supprimé de façon semi-automatique. Pour un paquet binaire, cela veut dire qu'il n'y a plus de paquet source produisant ce paquet binaire ; si le paquet binaire n'est simplement plus produit pour certaines architectures, une demande de suppression est toujours nécessaire. Pour un paquet source, cela veut dire que tous les paquets binaires auxquels il se réfère ont été récupérés par un autre paquet source.
ja: 例外として、明示的な削除依頼が必要ない場合が一つあります: (ソース、あるいはバイナリ) パッケージがソースからビルドされなくなった場合、半自動的に削除されます。バイナリパッケージの場合、これはこのバイナリパッケージを生成するソースパッケージがもはや存在しないということを意味します。バイナリパッケージがいくつかのアーキテクチャで生成されなくなったという場合には、削除依頼は必要です。ソースパッケージの場合は、関連の全バイナリパッケージが別のソースパッケージによって上書きされるのを意味しています。

source: In your removal request, you have to detail the reasons justifying the request. This is to avoid unwanted removals and to keep a trace of why a package has been removed. For example, you can provide the name of the package that supersedes the one to be removed.
de: In Ihrer Bitte um Entfernung müssen Sie detaillierte Gründe angeben, die das Entfernen rechtfertigen. Dies muss so sein, um unerwünschtes Entfernen zu vermeiden und um eine Chronik aufzubewahren, weshalb das Paket entfernt wurde. Sie können zum Beispiel den Namen des Pakets bereitstellen, das das entfernte ersetzt.
fr: Il faut détailler dans la demande de suppression les raisons de cette demande. Ceci a pour but d'éviter les suppressions indésirables et de garder une trace de la raison pour laquelle un paquet a été supprimé. Par exemple, vous pouvez fournir le nom du paquet qui remplace celui à supprimer.
ja: 削除依頼では、依頼を判断する理由を詳細に書く必要があります。これは不必要な削除を避け、何故パッケージが削除されたのかを追跡できるようにするためです。例えば、削除されるパッケージにとって代わるパッケージの名前を記述します。

source: Usually you only ask for the removal of a package maintained by yourself. If you want to remove another package, you have to get the approval of its maintainer. Should the package be orphaned and thus have no maintainer, you should first discuss the removal request on &email-debian-qa;. If there is a consensus that the package should be removed, you should reassign and retitle the <literal>O:</literal> bug filed against the <literal>wnpp</literal> package instead of filing a new bug as removal request.
de: Üblicherweise bitten Sie nur ein Paket zu entfernen, das Sie selbst betreuen. Falls Sie ein anderes Paket entfernen möchten, müssen Sie die Genehmigung seines Betreuers einholen. Sollte das Paket verwaist sein und daher keinen Betreuer haben, sollten Sie die Bitte um Entfernung zuerst auf &email-debian-qa; diskutieren. Falls es dort eine Übereinkunft gibt, dass das Paket entfernt werden soll, sollten Sie den <literal>O:</literal>-Fehler mit einem neuen Titel dem <literal>wnpp</literal>-Paket neu zuweisen, anstatt einen neuen Fehlerbericht als Bitte um Entfernen einzureichen.
fr: Normalement, vous ne devriez demander la suppression d'un paquet que si vous en êtes le responsable. Si vous voulez supprimer un autre paquet, vous devez obtenir l'accord de son responsable. Dans le cas d'un paquet orphelin, qui n'a donc pas de responsable, vous devriez discuter la demande de suppression sur &email-debian-qa;. S'il existe un consensus sur la surpression du paquet, vous devriez changer le titre et réassigner le bogue <literal>O:</literal> au paquet <literal>wnpp</literal> plutôt que d'en ouvrir un autre.
ja: 通常は自分がメンテナンスしているパッケージの削除のみを依頼します。その他のパッケージを削除したい場合は、メンテナの許可を取る必要があります。パッケージがみなしご化されたのでメンテナがいない場合は、まず &email-debian-qa; で削除依頼について議論をしてください。パッケージの削除についての合意ができたら、削除依頼の新規バグを登録するのではなく、<literal>wnpp</literal> パッケージに対して登録されているバグを reassign して <literal>O:</literal> に題名を変更するべきです。

source: Further information relating to these and other package removal related topics may be found at <ulink url="http://wiki.debian.org/ftpmaster_Removals"></ulink> and <ulink url="&url-debian-qa;howto-remove.html"></ulink>.
de: Weitere Informationen über diese oder andere Themen, die sich auf das Entfernen von Paketen beziehen, können unter <ulink url="http://wiki.debian.org/ftpmaster_Removals"></ulink> und <ulink url="&url-debian-qa;howto-remove.html"></ulink> gefunden werden.
fr: Plus d'informations sur ce sujet et autres sujets connexes sont disponibles sur <ulink url="http://wiki.debian.org/ftpmaster_Removals"></ulink> et <ulink url="&url-debian-qa;howto-remove.html"></ulink>.
ja: この件、あるいはパッケージ削除に関するその他のトピックについて、さらなる情報を <ulink url="http://wiki.debian.org/ftpmaster_Removals"></ulink> や <ulink url="&url-debian-qa;howto-remove.html"></ulink> で参照できます。

source: If in doubt concerning whether a package is disposable, email &email-debian-devel; asking for opinions. Also of interest is the <command>apt-cache</command> program from the <systemitem role="package">apt</systemitem> package. When invoked as <literal>apt-cache showpkg <replaceable>package</replaceable></literal>, the program will show details for <replaceable>package</replaceable>, including reverse depends. Other useful programs include <command>apt-cache rdepends</command>, <command>apt-rdepends</command>, <command>build-rdeps</command> (in the <systemitem role="package">devscripts</systemitem> package) and <command>grep-dctrl</command>. Removal of orphaned packages is discussed on &email-debian-qa;.
de: Wenn Zweifel bestehen, ob ein Paket weggeworfen werden kann, fragen Sie per E-Mail an &email-debian-devel; nach Meinungen. Außerdem ist das Programm <command>apt-cache</command> aus dem Paket <systemitem role="package">apt</systemitem> von Interesse. Wenn es mit <literal>apt-cache showpkg <replaceable>Paket</replaceable></literal> aufgerufen wird, zeigt es Einzelheiten über das <replaceable>Paket</replaceable>, einschließlich umgekehrter Abhängigkeiten. Andere nützlich Programme umfassen <command>apt-cache rdepends</command>, <command>apt-rdepends</command>, <command>build-rdeps</command> (im Paket <systemitem role="package">devscripts</systemitem>) und <command>grep-dctrl</command>. Das Entfernen von verwaisten Paketen wird auf &email-debian-qa; diskutiert.
fr: Si vous ne savez pas bien si un paquet peut être supprimé, demandez l'avis des autres développeurs sur la liste &email-debian-devel;. Le programme <command>apt-cache</command> du paquet <systemitem role="package">apt</systemitem> pourra aussi vous être utile. La commande <literal>apt-cache showpkg <replaceable>paquet</replaceable></literal> vous indiquera, entre autres, les paquets qui dépendent de <replaceable>paquet</replaceable>. Parmi les programmes utiles, citons <command>apt-cache rdepends</command>, <command>apt-rdepends</command>, <command>build-rdeps</command> (du paquet <systemitem role="package">devscripts</systemitem>) et <command>grep-dctrl</command>. La suppression de paquets orphelins est discutée sur &email-debian-qa;.
ja: パッケージを破棄しても構わないか迷う場合には、意見を聞きに &email-debian-devel; へメールしてください。<systemitem role="package">apt</systemitem> の <command>apt-cache</command> プログラムも重要です。<literal>apt-cache showpkg <replaceable>パッケージ名</replaceable></literal> として起動した際、プログラムは<replaceable>パッケージ名</replaceable>の非依存関係を含む詳細を表示します。他にも <command>apt-cache rdepends</command>、<command>apt-rdepends</command>、<command>build-rdeps</command> (<systemitem role="package">devscripts</systemitem> パッケージに含まれる)、<command>grep-dctrl</command> などの有用なプログラムが非依存関係を含む情報を表示します。みなしご化されたパッケージの削除は、&email-debian-qa; で話し合われます。

source: Once the package has been removed, the package's bugs should be handled. They should either be reassigned to another package in the case where the actual code has evolved into another package (e.g. <literal>libfoo12</literal> was removed because <literal>libfoo13</literal> supersedes it) or closed if the software is simply no longer part of Debian. When closing the bugs, to avoid marking the bugs as fixed in versions of the packages in previous Debian releases, they should be marked as fixed in the version <literal>&lt;most-recent-version-ever-in-Debian&gt;+rm</literal>.
de: Sobald das Paket entfernt wurde, sollten die Fehler des Pakets behandelt werden. Sie sollten entweder im Fall, dass der tatsächliche Code in einem anderen Paket entwickelt wurde, neu zugewiesen werden (z.B. <literal>libfoo12</literal> wurde entfernt, weil <literal>libfoo13</literal> es ersetzt) oder geschlossen werden, falls die Software einfach nicht länger Teil von Debian ist. Wenn die Fehler geschlossen werden, sollten sie in der Version <literal>&lt;most-recent-version-ever-in-Debian&gt;+rm</literal> als behoben gekennzeichnet werden, um zu verhindern, dass sie in vorherigen Debian-Releases als behoben gekennzeichnet werden.
fr: Une fois le paquet supprimé, les bogues du paquet doivent être gérés. Soit ils sont réassignés dans le cas où le code a évolué vers un autre paquet (par exemple, <literal>libfoo12</literal> a été supprimé parce que <literal>libfoo13</literal> le remplace), soit ils sont fermés si le logiciel ne fait simplement plus partie de Debian. Lors de la fermeture des bogues, pour éviter d'être marqués corrigés dans des versions du paquet disponibles dans des distributions précédentes de Debian, ils devraient être marqués corrigés dans la version <literal>&lt;dernière-version-existant-dans-Debian&gt;+rm</literal>.
ja: 一旦パッケージが削除されたら、パッケージのバグを処理する必要があります。実際のコードが別のパッケージに含まれるようになったので、別のパッケージへバグを付け替える (例えば、<literal>libfoo13</literal> が上書きするので、<literal>libfoo12</literal> が削除される) か、あるいはソフトウェアがもう Debian の一部では無くなった場合にはバグを閉じるかする必要があります。バグを閉じる場合、過去の Debian のリリースにあるパッケージバージョンで修正されたとマークするのを避けてください。バージョン <literal>&lt;most-recent-version-ever-in-Debian&gt;+rm</literal> で修正されたとマークしなければなりません。

source: Removing packages from <filename>Incoming</filename>
de: Entfernen von Paketen aus <filename>Incoming</filename>
fr: Suppression de paquet d'<filename>Incoming</filename>
ja: <filename>Incoming</filename> からパッケージを削除する

source: In the past, it was possible to remove packages from <filename>incoming</filename>. However, with the introduction of the new incoming system, this is no longer possible. Instead, you have to upload a new revision of your package with a higher version than the package you want to replace. Both versions will be installed in the archive but only the higher version will actually be available in <literal>unstable</literal> since the previous version will immediately be replaced by the higher. However, if you do proper testing of your packages, the need to replace a package should not occur too often anyway.
de: Früher war es möglich, Pakete aus <filename>incoming</filename> zu entfernen. Mit der Einführung des neuen Incoming-Systems ist dies jedoch nicht länger möglich. Stattdessen müssen Sie eine neue Überarbeitung Ihres Pakets mit einer höheren Versionsnummer als der des zu ersetzenden Pakets hochladen. Beide Versionen werden im Archiv installiert, aber nur die höhere Version wird tatsächlich in <literal>unstable</literal> verfügbar sein, da die vorherige sofort durch die höhere ersetzt wird. Falls Sie jedoch Ihr Paket ordnungsgemäß testen, sollte es ohnehin nicht allzu oft vorkommen, dass Sie ein Paket ersetzen.
fr: Par le passé, il était possible de supprimer un paquet d'<filename>incoming</filename>. Cependant, ce n'est plus possible depuis la mise en place du nouveau système. À la place, il faut envoyer une nouvelle version du paquet avec un numéro de version plus élevé que celui à remplacer. Les deux versions seront installées dans l'archive mais seule la plus récente sera disponible dans <literal>unstable</literal> car la précédente sera immédiatement remplacée par la nouvelle. Toutefois, si vous testez correctement vos paquets, vous ne devriez pas avoir besoin de les remplacer trop souvent.
ja: 以前は、<filename>incoming</filename> からパッケージを削除することが可能でした。しかし、新しい incoming システムが導入されたことにより、これはもはや不可能となっています。その代わりに、置き換えたいパッケージよりも高いバージョンのリビジョンの新しいパッケージをアップロードする必要があります。両方のバージョンのパッケージがアーカイブにインストールされますが、一つ前のバージョンはすぐに高いバージョンで置き換えられるため、実際にはバージョンが高い方だけが <literal>不安定版 (unstable)</literal> で利用可能になります。しかし、もしあなたがパッケージをきちんとテストしていれば、パッケージを置き換える必要はそんなに頻繁には無いはずです。

source: Replacing or renaming packages
de: Umbenennen oder Ersetzen von Paketen
fr: Remplacement et changement de nom de paquet
ja: パッケージをリプレースあるいはリネームする
