Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: The PTS has a web interface at <ulink url="http://&pts-host;/"></ulink> that puts together a lot of information about each source package. It features many useful links (BTS, QA stats, contact information, DDTP translation status, buildd logs) and gathers much more information from various places (30 latest changelog entries, testing status, etc.). It's a very useful tool if you want to know what's going on with a specific source package. Furthermore there's a form that allows easy subscription to the PTS via email.
de: Das PTS hat eine Web-Schnittstelle unter <ulink url="http://&pts-host;/"></ulink>, die eine große Menge Informationen über jedes Quellpaket zusammenträgt. Sie zeichnet sich durch viele nützliche Links aus (BTS, QA-Statistiken, Kontaktinformationen, DDTP-Übersetzungsstatus, Paketerstellungsprotokolle) und sammelt viel mehr Informationen von verschiedenen Stellen (30 letzte Einträge des Änderungsprotokolls, Teststatus etc.) Es ist ein sehr nützliches Werkzeug, falls Sie wissen möchten, was bei einem speziellen Quellpaket vorgeht. Außerdem gibt es dort ein Formular, das Ihnen erlaubt einfach Abonnements des PTS mittels E-Mail einzurichten.
fr: Le PTS possède une interface web sur <ulink url="http://&pts-host;/"></ulink> qui réunit beaucoup d'informations pour chaque paquet source. Plusieurs liens utiles sont proposés (BTS, statistiques QA, informations de contact, état de traduction DDTP, journaux de compilation automatique) et beaucoup d'autres informations provenant de différents endroits sont regroupés (les 30 dernières entrées de changelog, l'état dans <literal>testing</literal>, etc.). C'est un outil très pratique pour connaître ce qu'il en est d'un paquet source spécifique. De plus, un formulaire permet de s'inscrire facilement au PTS par courrier.
ja: PTS は各ソースパッケージについての大量の情報をまとめたウェブインターフェイスを <ulink url="http://&pts-host;/"></ulink> に持っています。その機能はたくさんの有用なリンク (BTS、QA の状態、連絡先情報、DDTS の翻訳状態、buildd のログ) や様々な所からの情報 (最近の changelog エントリ30個、testing の状態など…)を集めたものです。特定のソースパッケージについて知りたい場合に非常に有用なツールです。さらに PTS をメールを使って購読する簡単なフォームもあります。

source: You can jump directly to the web page concerning a specific source package with a URL like <literal>http://&pts-host;/<replaceable>sourcepackage</replaceable></literal>.
de: Sie können mit einer URL wie <literal>http://&pts-host;/<replaceable>Quellpaket</replaceable></literal> direkt zur Web-Seite springen, die eine spezielles Quellpaket betrifft.
fr: Il est possible d'aller directement à la page web concernant un paquet source avec une URL comme <literal>http://&pts-host;/<replaceable>paquet-source</replaceable></literal>.
ja: 特定のソースパッケージに関しては <literal>http://&pts-host;/<replaceable>sourcepackage</replaceable></literal> のような URL で直接ウェブページに飛べます。

source: This web interface has been designed like a portal for the development of packages: you can add custom content on your packages' pages. You can add static information (news items that are meant to stay available indefinitely) and news items in the latest news section.
de: Diese Web-Schnittstelle wurde gestaltet wie ein Portal für die Entwicklung von Paketen: Sie können Ihren Paketseiten benutzerdefinierten Inhalt hinzufügen (Nachrichtenelemente, die auf unbestimmte Zeit verfügbar bleiben sollen) sowie Nachrichtenelemente im letzten Nachrichtenabschnitt.
fr: Cette interface a été conçue comme un portail pour le développement des paquets : vous pouvez ajouter du contenu personnalisé aux pages de vos paquets. Vous pouvez ajouter des informations statiques (« <literal>static information</literal> » : annonces destinées à rester disponibles indéfiniment) et des nouvelles récentes (« <literal>latest news</literal> »).
ja: このウェブインターフェイスは、パッケージ開発のポータルとなるようにデザインされました: 自分のパッケージのページ上にカスタムしたコンテンツを付け加えられます。固定情報 (無期限に提示され続けるニュース項目) や通常のニュースを latest news section に追加できます。

source: Static news items can be used to indicate:
de: Statische Nachrichtenelemente können folgendes anzeigen:
fr: Les annonces statiques peuvent être utilisées pour indiquer :
ja: 固定ニュースは以下を表示するのに利用できます:

source: the availability of a project hosted on <link linkend="alioth">Alioth</link> for co-maintaining the package
de: die Verfügbarkeit eines auf <link linkend="alioth">Alioth</link> gehosteten Projekts für die Mitbetreuung des Pakets
fr: la disponibilité d'un projet hébergé sur <link linkend="alioth">Alioth</link> pour la co-maintenance du paquet ;
ja: 複数人でのパッケージメンテナンスのため、<link linkend="alioth">Alioth</link> でホストされている利用可能なプロジェクト

source: a link to the upstream web site
de: einen Link zu der Ursprungs-Website
fr: un lien vers le site web amont ;
ja: upstream のウェブサイトへのリンク

source: a link to the upstream bug tracker
de: einen Link zur Fehlerverfolgung der Originalautoren
fr: un lien vers le suivi de bogues amont ;
ja: upstream のバグ追跡システムへのリンク

source: the existence of an IRC channel dedicated to the software
de: die Existenz eines IRC-Kanals, der sich dieser Software widmet
fr: l'existence d'un canal IRC dédié au logiciel ;
ja: ソフトウェア専用 IRC チャンネルの存在

source: any other available resource that could be useful in the maintenance of the package
de: jede andere verfügbare Ressource, die nützlich zur Verwaltung des Pakets sein könnte
fr: toute autre ressource disponible éventuellement utile à la maintenance du paquet.
ja: パッケージのメンテナンスについて、他の利用可能な有用なリソース

source: Usual news items may be used to announce that:
de: Üblicherweise können Nachrichtenelemente benutzt werden, um Folgendes anzukündigen:
fr: Les nouvelles usuelles peuvent être utilisées pour annoncer que :
ja: 通常のニュースは以下のアナウンスに使われます:

source: beta packages are available for testing
de: Beta-Pakete sind zum Testen verfügbar.
fr: des paquets bêta sont disponibles pour tester ;
ja: テスト用にベータ版パッケージが準備できたこと

source: final packages are expected for next week
de: Fertige Pakete werden nächsten Woche erwartet.
fr: des paquets finaux sont attendus pour la semaine prochaine ;
ja: 来週に最終的なパッケージが期待されている

source: the packaging is about to be redone from scratch
de: Das Paketieren wird gerade von Grund auf neu gemacht.
fr: l'empaquetage est sur le point d'être intégralement refait ;
ja: パッケージをスクラッチから再構築中

source: backports are available
de: Es sind Backports verfügbar
fr: des rétroportages sont disponibles ;
ja: バックポート版が利用可能

source: the maintainer is on vacation (if they wish to publish this information)
de: Der Paketbetreuer ist in Urlaub (falls es gewünscht ist, diese Information zu veröffentlichen).
fr: le responsable est en vacances (s'il désire publier cette information) ;
ja: メンテナが休暇中 (この情報を公開したい場合に表示)

source: a NMU is being worked on
de: Es wird an einem NMU gearbeitet.
fr: une mise à jour indépendante (<literal>NMU</literal>) est en cours de réalisation ;
ja: NMU 進行中

source: something important will affect the package
de: Etwas wichtiges wird das Paket beeinflussen.
fr: quelque chose d'important va affecter le paquet.
ja: 何かパッケージに重要な影響を与える事柄

source: Both kinds of news are generated in a similar manner: you just have to send an email either to <email>pts-static-news@qa.debian.org</email> or to <email>pts-news@qa.debian.org</email>. The mail should indicate which package is concerned by having the name of the source package in a <literal>X-PTS-Package</literal> mail header or in a <literal>Package</literal> pseudo-header (like the BTS reports). If a URL is available in the <literal>X-PTS-Url</literal> mail header or in the <literal>Url</literal> pseudo-header, then the result is a link to that URL instead of a complete news item.
de: Beide Arten von Nachrichten werden auf ähnliche Weise erzeugt: Sie müssen lediglich eine E-Mail an <email>pts-static-news@qa.debian.org</email> oder an <email>pts-news@qa.debian.org</email> senden. Die E-Mail sollte angeben, welches Paket sie betrifft, indem der Name des Quellpakets in einer <literal>X-PTS-Package</literal>-E-Mail-Kopfzeile oder in einer <literal>Package</literal>-Pseudo-Kopfzeile (wie in einem Fehlerbericht) angegeben wird. Falls eine URL in der E-Mail-Kopfzeile <literal>X-PTS-Url</literal> oder der Pseudo-Kopfzeile <literal>Url</literal> verfügbar ist, dann ist das Ergebnis ein Link auf diese URL, anstatt eines vollständigen Nachrichtenelements.
fr: Les deux types d'informations sont fabriqués de façon similaire : il suffit d'envoyer un courrier à <email>pts-static-news@qa.debian.org</email> (pour les annonces statiques) ou <email>pts-news@qa.debian.org</email> (pour les nouvelles usuelles). Le courrier devrait indiquer quel paquet est concerné par la nouvelle en donnant le nom du paquet source dans un en-tête de courrier <literal>X-PTS-Package</literal> ou un pseudo-en-tête <literal>Package</literal> (comme pour les rapports de bogue du BTS). Si une URL est disponible dans l'en-tête de courrier <literal>X-PTS-Url</literal> ou dans un pseudo-en-tête <literal>Url</literal>, le résultat est un lien vers cette URL au lieu d'une nouvelle complète.
ja: 両方共、ニュースは同様のやり方で生成します: <email>pts-static-news@qa.debian.org</email> や <email>pts-news@qa.debian.org</email> へとメールを送るだけです。メールは <literal>X-PTS-Package</literal> メールヘッダや (BTS への報告のように) <literal>Package</literal> 擬似ヘッダで、度のパッケージに関連するのかをソースパッケージの名前で示す必要があります。<literal>X-PTS-Url</literal> メールヘッダや <literal>Url</literal> 擬似ヘッダ中に URL がある場合は、完全なニュースの代わりにその URL へのリンクとなります。

source: Here are a few examples of valid mails used to generate news items in the PTS. The first one adds a link to the viewsvn interface of debian-cd in the Static information section:
de: Hier folgen ein paar Beispiele gültiger E-Mails, die benutzt werden, um Nachrichtenelemente im PTS zu generieren. Das Erste fügt der Viewsvn-Schnittstelle der Debian-CD im Abschnitt »statische Information« einen Link hinzu:
fr: Voici quelques exemples de courriers valables utilisés pour générer des nouvelles dans le PTS. Le premier ajoute un lien vers l'interface <literal>viewsvn</literal> de <literal>debian-cd</literal> dans la section des informations statiques :
ja: PTS 中のニュース項目の生成に使われる正しいメールの例を幾つか挙げます。最初の1つ目は Static information section 中の debian-cd の viewsvn インターフェイスへのリンクを付け加えるものです:

source: The second one is an announcement sent to a mailing list which is also sent to the PTS so that it is published on the PTS web page of the package. Note the use of the BCC field to avoid answers sent to the PTS by mistake.
de: Das Zweite ist eine Ankündigung, die an eine Mailingliste gesandt wird, die außerdem an das PTS geschickt wird, so dass sie auf der PTS-Web-Seite des Pakets veröffentlicht wird. Beachten Sie die Benutzung des BCC-Feldes, um zu vermeiden, dass Antworten fälschlicherweise an das PTS gesandt werden.
fr: Le second est une annonce envoyée à une liste de diffusion et également envoyée au PTS pour qu'elle soit publiée sur la page web du PTS du paquet. Notez l'utilisation du champ <literal>BCC</literal> pour éviter que des réponses ne soient envoyées par erreur au PTS.
ja: 二つ目のはメーリングリストへアナウンスを送るもので、PTS にも送られるのでパッケージの PTS ウェブページで公開されます。誤って PTS に返信が送られるのを避けるために BCC 欄を利用していることに注意してください。

source: Think twice before adding a news item to the PTS because you won't be able to remove it later and you won't be able to edit it either. The only thing that you can do is send a second news item that will deprecate the information contained in the previous one.
de: Überlegen Sie es sich gut, bevor Sie dem PTS ein Nachrichtenelement hinzufügen, da Sie es später weder löschen noch bearbeiten können. Das einzige, was Sie tun können, ist, ein zweites Nachrichtenelement zu senden, das die Information des vorherigen missbilligt.
fr: Réfléchissez-y à deux fois avant d'ajouter une nouvelle au PTS car vous ne pourrez pas l'enlever par la suite et vous ne pourrez pas non plus la modifier. La seule chose que vous puissiez faire est d'envoyer une deuxième nouvelle qui va rendre la première obsolète.
ja: PTS へニュースを付け加える前に、もう一度考え直して見てください。何故なら、後でこれを削除したり編集したりできないからです。可能なのは、以前のニュースを含んだ情報を廃止する新たなニュースを送信することだけです。

source: Developer's packages overview
de: Paketübersicht des Entwicklers
fr: Vue d'ensemble des paquets d'un développeur

source: A QA (quality assurance) web portal is available at <ulink url="&url-ddpo;"></ulink> which displays a table listing all the packages of a single developer (including those where the party is listed as a co-maintainer). The table gives a good summary about the developer's packages: number of bugs by severity, list of available versions in each distribution, testing status and much more including links to any other useful information.
de: Ein Webportal der QS (Qualitätssicherung) ist unter <ulink url="&url-ddpo;"></ulink> verfügbar. Es zeigt eine tabellarische Auflistung aller Pakete eines einzelnen Entwicklers an (einschließlich derer, bei denen eine Gemeinschaft als Mitbetreuer aufgelistet ist). Die Tabelle gibt einen guten Überblick über die Pakete des Betreuers: Anzahl der Fehler nach Schweregrad, Liste der verfügbaren Versionen in jeder Distribution, Test-Status und vieles mehr, einschließlich Links zu irgendwelchen anderen nützlichen Informationen.
fr: Un portail web pour l'assurance qualité (« <literal>quality assurance</literal> » ou <literal>QA</literal>) sur <ulink url="&url-ddpo;"></ulink> affiche un tableau de tous les paquets d'un développeur (y compris ceux pour lesquels il est co-responsable). Le tableau donne un bon résumé sur les paquets d'un développeur : nombre de bogues par gravité, liste des versions disponibles, état des tests et des liens vers d'autres informations utiles.
ja: QA (quality assurance、品質保証) ウェブポータルが <ulink url="&url-ddpo;"></ulink> から利用できます。これは、一人の開発者のすべてのパッケージの一覧表を表示します (集団で行っている場合は、共同メンテナとしてとして表示されます) 。この表は開発者のパッケージについてうまく要約された情報を与えてくれます: 重要度に応じたバグの数やそれぞれのディストリビューションで利用可能なバージョン番号、testing の状態やその他有用な情報源へのリンクなどを含んでいます。

source: It is a good idea to look up your own data regularly so that you don't forget any open bugs, and so that you don't forget which packages are your responsibility.
de: Es ist ein guter Tipp, regelmäßig auf seine eigenen Daten zu schauen, um keine offenen Fehler oder Zuständigkeiten für Pakete zu vergessen.
fr: C'est une bonne idée de vérifier régulièrement vos données pour ne pas oublier de bogues ouverts et quels paquets sont sous votre responsabilité.
ja: open な状態のバグやどのパッケージに対して責任を持っているのかを忘れないため、定期的に自身のデータを見直すのは良い考えです。

source: Debian's FusionForge installation: Alioth
fr: <literal>FusionForge</literal> pour Debian : <literal>Alioth</literal>
ja: Debian での FusionForge の導入例: Alioth

source: Alioth is a Debian service based on a slightly modified version of the FusionForge software (which evolved from SourceForge and GForge). This software offers developers access to easy-to-use tools such as bug trackers, patch manager, project/task managers, file hosting services, mailing lists, VCS repositories etc. All these tools are managed via a web interface.
de: Alioth ist ein Debian-Dienst, der auf einer geringfügig veränderten Version der FusionForge-Software beruht (die sich aus SourceForge und GForge entwickelt hat). Diese Software bietet Entwicklern Zugriff auf einfach benutzbare Werkzeuge, wie Paketverfolgung, Patch-Verwaltung, Projekt-/Aufgabenverwaltung, Speicherplatzbereitstellung, Mailinglisten, VCS-Depots etc. All diese Werkzeuge werden über eine Web-Schnittstelle verwaltet.
fr: Alioth est un service de Debian basé sur une version légèrement modifiée du logiciel <literal>FusionForge</literal> (qui a évolué à partir de <literal>SourceForge</literal> et <literal>GForge</literal>). Ce logiciel offre aux développeurs l'accès à des outils faciles d'utilisation comme un gestionnaire de suivi de bogues, un gestionnaire de correctifs, un gestionnaire de tâches et de projets, un service d'hébergement de fichiers, des listes de diffusion, des systèmes de gestion de versions, etc. Tous ces outils sont gérés à l'aide d'une interface web.
ja: Alioth は FusionForge (SourceForge と GForge から派生したソフトウェア) に多少変更を加えたものを基にした Debian のサービスです。このソフトは開発者が容易に使えるバグトラッキングシステム、パッチ管理、プロジェクト／タスク管理、ファイルのアップロード、メーリングリスト、VCS リポジトリなどのツールを提供します。これらの機能全てはウェブインターフェイスから管理します。

source: It is intended to provide facilities to free software projects backed or led by Debian, facilitate contributions from external developers to projects started by Debian, and help projects whose goals are the promotion of Debian or its derivatives. It's heavily used by many Debian teams and provides hosting for all sorts of VCS repositories.
de: Es ist dazu gedacht, Hilfmittel für freie Softwareprojekte bereitzustellen, die von Debian unterstützt oder geleitet werden, Beiträge externer Entwickler zu Projekten, die von Debian begonnen wurden zu fördern und bei Projekten zu helfen, deren Ziele von Debian oder dessen Ableitungen gefördert werden. Es wird durch viele Debian-Teams stark frequentiert und stellt Speicherplatz für alle Arten von VCS-Depots bereits.
fr: Alioth a pour but de fournir une infrastructure pour des projets de logiciels libres soutenus ou dirigés par Debian, de faciliter les contributions de développeurs externes aux projets initiés par Debian et d'aider des projets dont les buts sont de promouvoir Debian ou ses dérivés. Il est largement utilisé par de nombreuses équipes et fournit l'hébergement pour toutes sortes de systèmes de gestion de versions.
ja: Debian がバックアップする、あるいは Debian が中心となっているフリーソフトウェアプロジェクトに対して支援を提供、外部の開発者からの支援協力を Debian によって始められたプロジェクトを与えたり、Debian やその派生ディストリビューションのプロモーションが目的であるプロジェクトを支援する機能を提供するためにあります。多くの Debian チームに非常によく利用されており、あらゆる種類の VCS リポジトリを提供しています。

source: All Debian developers automatically have an account on Alioth. They can activate it by using the recover password facility. External developers can request guest accounts on Alioth.
de: Alle Debian-Entwickler haben automatisch ein Konto auf Alioth. Sie können es über die Passwort-Wiederherstellungseinrichtung aktivieren. Externe Entwickler können um Gastkonten bitten.
fr: Tous les développeurs Debian ont automatiquement un compte sur Alioth. Ils peuvent l'activer en utilisant la fonctionnalité de récupération des mots de passe. Les développeurs externes peuvent demander un compte invité sur Alioth.
ja: 全ての Debian 開発者は自動的に Alioth のアカウントを持ちます。Debian 開発者は、パスワード復旧機能を使ってアカウントを有効にすることができます。他の開発者は Alioth 上でゲストアカウントを発行してもらえます。

source: For more information please visit the following links:
de: Um weitere Informationen zu erhalten, besuchen Sie die folgenden Links:
fr: Des informations supplémentaires sont disponibles sur les liens suivants :
ja: 詳細な情報については、以下のリンクを参照下さい：

source: Goodies for Developers
de: Annehmlichkeiten für Entwickler
fr: Avantages pour les développeurs
ja: 開発者への特典

source: LWN Subscriptions
de: LWN-Abonnements
fr: Abonnements à <literal>LWN</literal>
ja: LWN の購読

source: Since October of 2002, HP has sponsored a subscription to LWN for all interested Debian developers. Details on how to get access to this benefit are in <ulink url="http://&lists-host;/debian-devel-announce/2002/10/msg00018.html"></ulink>.
de: Seit Oktober 2002 hat HP für alle interessierten Debian-Entwickler ein LWN-Abonnement gesponsort. Einzelheiten, wie man Zugriff auf diesen Vorteil erhält, finden Sie unter <ulink url="http://&lists-host;/debian-devel-announce/2002/10/msg00018.html"></ulink>.
fr: Depuis octobre 2002, <literal>HP</literal> parraine l'abonnement à <literal>LWN</literal> pour tous les développeurs Debian intéressés. Des détails sur les moyens d'accéder à cet avantage sont expliqués dans le message <ulink url="http://&lists-host;/debian-devel-announce/2002/10/msg00018.html"></ulink>.
ja: 2002 年 10 月から、HP は LWN の購読権を興味のあるすべての Debian Developer に提供しています。この権利の利用方法については、<ulink url="http://&lists-host;/debian-devel-announce/2002/10/msg00018.html"></ulink> を確認してください。

source: Gandi.net Hosting Discount
de: Gandi.net-Rabatt für Speicherplatzbereitstellung
fr: Remise sur l'hébergement <literal>Gandi.net</literal>
ja: Gandi.net ホスティング割引

source: As of November 2008, Gandi.net offers a discount rate on their VPS hosting for Debian Developers. See <ulink url="http://&lists-host;/debian-devel-announce/2008/11/msg00004.html"></ulink>.
de: Seit November 2008 bietet Gandi.net Debian-Entwicklern einen Rabatt für seine VPS-Speicherplatzbereitstellung. Siehe <ulink url="http://&lists-host;/debian-devel-announce/2008/11/msg00004.html"></ulink>.
fr: Depuis Novembre 2008, <literal>Gandi.net</literal> offre une remise sur leurs serveur dédié virtuel pour les développeurs Debian : <ulink url="http://&lists-host;/debian-devel-announce/2008/11/msg00004.html"></ulink>.
ja: 2008年11月現在、Gandi.net は Debian 開発者に対して VPS ホスティングを割引価格で提供しています。<ulink url="http://&lists-host;/debian-devel-announce/2008/11/msg00004.html"></ulink>を参照してください。

source: Scope of This Document
de: Geltungsbereich dieses Dokuments
fr: Portée de ce document
ja: この文書が扱う範囲について

source: The purpose of this document is to provide an overview of the recommended procedures and the available resources for Debian developers.
de: Dieses Dokument soll Debian-Entwicklern einen Überblick über die empfohlenen Prozeduren und die verfügbaren Ressourcen geben.
fr: Le but de ce document est de donner une vue d'ensemble des procédures à suivre et des ressources mises à la disposition des développeurs Debian.
ja: この文書の目的は、Debian 開発者に推奨される手続きと利用可能なリソースに関する概要を提供することにあります。

source: The procedures discussed within include how to become a maintainer (<xref linkend="new-maintainer"/>); how to create new packages (<xref linkend="newpackage"/>) and how to upload packages (<xref linkend="upload"/>); how to handle bug reports (<xref linkend="bug-handling"/>); how to move, remove, or orphan packages (<xref linkend="archive-manip"/>); how to port packages (<xref linkend="porting"/>); and how and when to do interim releases of other maintainers' packages (<xref linkend="nmu"/>).
de: Die hier besprochenen Prozeduren umfassen die Bewerbung als Paketbetreuer (<xref linkend="new-maintainer"/>), die Erstellung neuer Pakete (<xref linkend="newpackage"/>), das Hochladen von Paketen (<xref linkend="upload"/>), die Handhabung von Fehlerberichten (<xref linkend="bug-handling"/>), das Verschieben, Entfernen oder Verwaisen von Paketen (<xref linkend="archive-manip"/>), das Portieren von Paketen (<xref linkend="porting"/>) und wie und wann Pakete anderer Paketbetreuer vorläufig veröffentlicht werden (<xref linkend="nmu"/>).
fr: Les procédures décrites ci-après expliquent comment devenir responsable Debian (<xref linkend="new-maintainer"/>), comment créer de nouveaux paquets (<xref linkend="newpackage"/>), comment envoyer des paquets dans l'archive (<xref linkend="upload"/>), comment gérer les rapports de bogues (<xref linkend="bug-handling"/>), comment déplacer, effacer ou abandonner un paquet (<xref linkend="archive-manip"/>), comment faire le portage d'un paquet (<xref linkend="porting"/>), quand et comment faire la mise à jour du paquet d'un autre responsable (<xref linkend="nmu"/>).
ja: ここで取り上げる手続きには、開発者になる方法 (<xref linkend="new-maintainer"/>) 、新しいパッケージの作り方 (<xref linkend="newpackage"/>) とパッケージをアップロードする方法 (<xref linkend="upload"/>)、バグ報告の取扱い方 (<xref linkend="bug-handling"/>)、パッケージを移動、削除、みなしご化 (orphan) する方法 (<xref linkend="archive-manip"/>)、パッケージ移植のやり方 (<xref linkend="porting"/>)他のメンテナのパッケージを暫定的にリリースするのは、いつどの様にしたらよいのか (<xref linkend="nmu"/>) が含まれます。
