Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: When the upstream maintainers for one of your packages chose to rename their software (or you made a mistake naming your package), you should follow a two-step process to rename it. In the first step, change the <filename>debian/control</filename> file to reflect the new name and to replace, provide and conflict with the obsolete package name (see the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> for details). Please note that you should only add a <literal>Provides</literal> relation if all packages depending on the obsolete package name continue to work after the renaming. Once you've uploaded the package and the package has moved into the archive, file a bug against <systemitem role="package">&ftp-debian-org;</systemitem> asking to remove the package with the obsolete name (see <xref linkend="removing-pkgs"/>). Do not forget to properly reassign the package's bugs at the same time.
de: Wenn sich die Originalautoren eines Ihrer Pakete entscheiden, ihre Software umzubenennen (oder Ihnen beim Benennen Ihres Pakets ein Fehler unterlaufen ist), sollten Sie einen zweistufigen Prozess durchlaufen, um es umzubenennen. Im ersten Schritt ändern Sie die Datei <filename>debian/control</filename>, damit Sie den neuen Namen wiederspiegelt, ersetzt, bereitzustellt und zu dem veralteten Paketnamen in Konflikt tritt (Einzelheiten finden Sie im <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>). Bitte beachten Sie, dass Sie nur dann eine <literal>Provides</literal>-Beziehung hinzufügen sollten, wenn alle Pakete, die von dem veralteten Paketnamen abhängen, nach dem Umbenennen weiter funktionieren. Sobald Sie das Paket hochgeladen haben und das Paket in das Archiv verschoben wurde, reichen Sie einen Fehler gegen <systemitem role="package">&ftp-debian-org;</systemitem> ein, in dem Sie um das Entfernen des veralteten Namens ersuchen (siehe <xref linkend="removing-pkgs"/>). Vergessen Sie nicht, gleichzeitig die Fehler ordnungsgemäß neu zuzuweisen.
fr: Quand les responsables amont d'un de vos paquet décident de renommer leur logiciel (ou si vous vous trompez en nommant un paquet), vous devrez intervenir en deux étapes pour changer son nom. D'abord, modifiez le fichier <filename>debian/control</filename> pour que le nouveau paquet remplace (<literal>Replaces</literal>), fournisse (<literal>Provides</literal>) et entre en conflit avec (<literal>Conflicts</literal>) le paquet mal nommé (reportez-vous à la <ulink url="&url-debian-policy;">Charte Debian</ulink> pour les détails). Vous ne devriez ajouter une relation <literal>Provides</literal> que si tous les paquets dépendants du paquet mal nommé continuent de fonctionner après le changement de nom. Une fois le paquet installé dans l'archive, faites un rapport de bogue concernant le pseudopaquet <systemitem role="package">&ftp-debian-org;</systemitem> et demandez la suppression du paquet mal nommé (voir <xref linkend="removing-pkgs"/>). N'oubliez pas de réassigner correctement les bogues du paquet en même temps.
ja: あなたのパッケージのどれかの開発元のメンテナらが、ソフトウェアをリネームするのを決めた時 (あるいはパッケージを間違えて名前を付けた時)、以下の二段階のリネーム手続きに従う必要があります。最初の段階では、<filename>debian/control</filename> ファイルに新しい名前を反映し、利用しなくなるパッケージ名に対して Replace、Provides、Conflicts を設定する変更をします (詳細に関しては <ulink url="&url-debian-policy;">Debian ポリシーマニュアルl</ulink> を参照)。注意してほしいのは、利用しなくなるパッケージ名がリネーム後も動作する場合のみ、<literal>Provides</literal> を付け加えるべきだということです。一旦パッケージをアップロードがアップロードされてアーカイブに移動したら、<systemitem role="package">&ftp-debian-org;</systemitem> に対してバグを報告してください (<xref linkend="removing-pkgs"/> 参照)。同時にパッケージのバグを正しく付け替えするのを忘れないでください。

source: At other times, you may make a mistake in constructing your package and wish to replace it. The only way to do this is to increase the version number and upload a new version. The old version will be expired in the usual manner. Note that this applies to each part of your package, including the sources: if you wish to replace the upstream source tarball of your package, you will need to upload it with a different version. An easy possibility is to replace <filename>foo_1.00.orig.tar.gz</filename> with <filename>foo_1.00+0.orig.tar.gz</filename> or <filename>foo_1.00.orig.tar.bz2</filename>. This restriction gives each file on the ftp site a unique name, which helps to ensure consistency across the mirror network.
de: Sonst könnten Sie einen Fehler beim Konstruieren Ihres Pakets begehen und wünschen, es zu ersetzen. Die einzige Möglichkeit, dies zu tun besteht im Erhöhen der Versionsnummer und dem Hochladen der neuen Version. Die alte Version verliert wie üblich ihre Gültigkeit. Beachten Sie, dass dies auf jeden Teil Ihres Pakets zutrifft, einschließlich der Quellen: Falls Sie den Originalquell-Tarball Ihres Pakets ersetzen möchten, müssen Sie ihn mit einer verschiedenen Version hochladen. Eine einfache Möglichkeit ist es, <filename>foo_1.00.orig.tar.gz</filename> durch <filename>foo_1.00+0.orig.tar.gz</filename> oder <filename>foo_1.00.orig.tar.bz2</filename> zu ersetzen. Diese Einschränkung gibt jeder Datei auf der FTP-Site einen einzigartigen Namen, der dabei hilft, die Einheitlichkeit über ein Netzwerk von Spiegelservern sicherzustellen.
fr: Vous pourriez aussi commettre une erreur en construisant le paquet et désirer le remplacer. La seule façon de faire est d'incrémenter le numéro de version et d'envoyer une nouvelle version. L'ancienne version expirera de la façon habituelle. Notez que ceci s'applique à chaque partie de votre paquet, y compris les sources : pour remplacer l'archive source amont de votre paquet, envoyez-la avec un numéro de version différent. Une possibilité simple est de remplacer <filename>foo_1.00.orig.tar.gz</filename> par <filename>foo_1.00+0.orig.tar.gz</filename> ou <filename>foo_1.00.orig.tar.bz2</filename>. Cette restriction permet à chaque fichier de l'archive d'avoir un nom unique, ce qui aide à garantir la cohérence dans le réseau des miroirs.
ja: 他に、パッケージの作成でミスを犯したので置き換えたいという場合があるかもしれません。これを行う方法は唯一つ、バージョン番号を上げて新しいバージョンをアップロードすることです。通常、古いバージョンは無効になります。これはソースを含めた各パッケージ部分に適用されることに注意してください: パッケージの開発元のソース tarball を入れ替えたい場合には、別のバージョンをつけてアップロードする必要があります。よくある例は <filename>foo_1.00.orig.tar.gz</filename> を <filename>foo_1.00+0.orig.tar.gz</filename>、あるいは <filename>foo_1.00.orig.tar.bz2</filename> で置き換えるというものです。この制約によって、ftp サイト上で各ファイルが一意の名前を持つことになり、ミラーネットワークをまたがった一貫性を保障するのに役立ちます。

source: Orphaning a package
de: Verwaisen von Paketen
fr: Abandon de paquet
ja: パッケージをみなしご化する

source: If you can no longer maintain a package, you need to inform others, and see that the package is marked as orphaned. You should set the package maintainer to <literal>Debian QA Group &orphan-address;</literal> and submit a bug report against the pseudo package <systemitem role="package">wnpp</systemitem>. The bug report should be titled <literal>O: <replaceable>package</replaceable> -- <replaceable>short description</replaceable></literal> indicating that the package is now orphaned. The severity of the bug should be set to <literal>normal</literal>; if the package has a priority of standard or higher, it should be set to important. If you feel it's necessary, send a copy to &email-debian-devel; by putting the address in the X-Debbugs-CC: header of the message (no, don't use CC:, because that way the message's subject won't indicate the bug number).
de: Falls Sie ein Paket nicht länger betreuen können, müssen Sie andere informieren und dafür sorgen, dass das Paket als verwaist gekennzeichnet wird. Sie sollten den Paketbetreuer auf <literal>Debian QA Group &orphan-address;</literal> setzen und einen Fehlerbericht gegen das Pseudopaket <systemitem role="package">wnpp</systemitem> senden. Der Fehlerbericht sollte mit dem Titel <literal>O: <replaceable>Paket</replaceable> -- <replaceable>kurze Beschreibung</replaceable></literal> angeben, dass das Paket nun verwaist ist. Der Schweregrad des Fehlers sollte auf <literal>normal</literal> gesetzt werden; falls das Paket die Priotität »standard« oder höher hat, sollte er auf »important« gesetzt werden. Wenn Sie es für nötig halten, senden Sie eine Kopie an &email-debian-devel;, indem Sie die Adresse in die Kopfzeile X-Debbugs-CC: der Nachricht einfügen (nein, benutzen Sie nicht CC:, da auf diese Art der Betreff der Nachricht die Fehlernummer nicht angibt).
fr: Si vous ne pouvez plus maintenir un paquet, il faut en informer les autres et faire le nécessaire pour le marquer <literal>orphaned</literal> (orphelin). Vous devriez remplacer votre nom par <literal>Debian QA Group &orphan-address;</literal> dans le champ <literal>Maintainer</literal> du paquet et faire un rapport de bogue sur le pseudopaquet <systemitem role="package">wnpp</systemitem>. Le titre de votre rapport de bogue devrait être « <literal>O: <replaceable>paquet</replaceable> -- <replaceable>description courte</replaceable></literal> » pour indiquer que le paquet est orphelin (<literal>O</literal> signifie « <literal>Orphaned</literal> » : orphelin). La gravité du bogue sera <literal>normal</literal> ; si le paquet a une priorité standard ou supérieure, elle devrait être <literal>important</literal>. Si vous le jugez nécessaire, envoyez une copie à &email-debian-devel; en mettant cette adresse dans le champ <literal>X-Debbugs-CC</literal> de l'en-tête du message. N'utilisez pas le champ <literal>CC</literal> sinon le sujet du message ne contiendra pas le numéro du bogue.
ja: パッケージをもうメンテナンスできなくなってしまった場合、ほかの人に知らせて、パッケージがみなしご化 (orphaned) とマークされたのが分かるようにする必要があります。パッケージメンテナを <literal>Debian QA Group &orphan-address;</literal> に設定し、疑似パッケージ<systemitem role="package">wnpp</systemitem> に対してバグ報告を送信しなければなりません。バグ報告は、パッケージが今みなしご化されていることを示すように <literal>O: <replaceable>パッケージ名</replaceable> -- <replaceable>短い要約</replaceable></literal> というタイトルにする必要があります。バグの重要度は <literal>通常 (normal)</literal> に設定しなければなりません; パッケージの重要 (priority) が standard より高い場合には重要 (important) に設定する必要があります。必要だと思うのならば、メッセージの X-Debbugs-CC: ヘッダのアドレスに &email-debian-devel; を入れてコピーを送ってください (そう、CC: を使わないでください。その理由は、CC: を使うと、メッセージの題名がバグ番号を含まないからです)。

source: If you just intend to give the package away, but you can keep maintainership for the moment, then you should instead submit a bug against <systemitem role="package">wnpp</systemitem> and title it <literal>RFA: <replaceable>package</replaceable> -- <replaceable>short description</replaceable></literal>. <literal>RFA</literal> stands for <literal>Request For Adoption</literal>.
de: Falls Sie nur die Absicht haben, das Paket abzugeben, aber im Moment noch Betreuer bleiben können, dann sollten Sie stattdessen einen Fehlerbericht gegen <systemitem role="package">wnpp</systemitem> mit dem Titel <literal>RFA: <replaceable>Paket</replaceable> -- <replaceable>kurze Beschreibung</replaceable></literal> senden. <literal>RFA</literal> steht für <literal>Request For Adoption</literal> (Bitte um Adoption).
fr: Si vous avez simplement l'intention de donner le paquet, mais que vous pouvez conserver sa maintenance pour le moment, vous devriez plutôt soumettre un rapport de bogue sur <systemitem role="package">wnpp</systemitem> intitulé <literal>RFA: <replaceable>package</replaceable> -- <replaceable>description courte</replaceable></literal>. <literal>RFA</literal> signifie « <literal>Request For Adoption</literal> » (demande d'adoption).
ja: パッケージを手放したいが、しばらくの間はメンテナンスを継続できる場合には、代わりに <systemitem role="package">wnpp</systemitem> へ <literal>RFA: <replaceable>パッケージ名</replaceable> -- <replaceable>短い要約</replaceable></literal> という題名でバグ報告を送信する必要があります。<literal>RFA</literal> は <literal>Request For Adoption (引き取り依頼)</literal> を意味しています。

source: More information is on the <ulink url="&url-wnpp;">WNPP web pages</ulink>.
de: Weitere Informationen finden Sie auf den <ulink url="&url-wnpp;">WNPP-Web-Seiten</ulink>.
fr: Vous pouvez trouver plus d'informations sur les <ulink url="&url-wnpp;">pages web <literal>WNPP</literal></ulink> (« <literal>Work-Needing and Prospective Packages</literal> » : paquets en souffrance et paquets souhaités).
ja: より詳細な情報は <ulink url="&url-wnpp;">WNPP ウェブページ</ulink>にあります。

source: Adopting a package
de: Adoption eines Pakets
fr: Adoption de paquet
ja: パッケージに変更を加える

source: A list of packages in need of a new maintainer is available in the <ulink url="&url-wnpp;">Work-Needing and Prospective Packages list (WNPP)</ulink>. If you wish to take over maintenance of any of the packages listed in the WNPP, please take a look at the aforementioned page for information and procedures.
de: Eine Liste von Paketen, die einen neuen Betreuer suchen, ist unter <ulink url="&url-wnpp;">Arbeit-bedürfende und voraussichtliche Pakete (WNPP)</ulink> verfügbar. Falls Sie die Verwaltung von einigen Paketen übernehmen möchten, die auf WNPP aufgeführt sind, lesen Sie bitte besagte Seite, um Informationen zu erhalten und etwas über die Prozeduren zu erfahren.
fr: Une liste des paquets en attente de nouveau responsable est disponible dans la <ulink url="&url-wnpp;">liste des paquets en souffrance et paquets souhaités (<literal>WNPP</literal>)</ulink>. Afin de prendre en charge un paquet de cette liste, reportez-vous à la page mentionnée précédemment pour plus d'informations et les procédures à suivre.
ja: 新たなメンテナが必要なパッケージの一覧は <ulink url="&url-wnpp;">作業が望まれるパッケージ (WNPP、Work-Needing and Prospective Packages list)</ulink> で入手できます。WNPP でリストに挙がっているパッケージのどれかに対するメンテナンスを引き継ぎたい場合には、情報と手続きについては前述のページを確認してください。

source: It is not OK to simply take over a package that you feel is neglected — that would be package hijacking. You can, of course, contact the current maintainer and ask them if you may take over the package. If you have reason to believe a maintainer has gone AWOL (absent without leave), see <xref linkend="mia-qa"/>.
de: Es ist nicht in Ordnung einfach ein Paket zu übernehmen, das vernachlässigt ist – das wäre Paketentführung. Sie können natürlich den aktuellen Betreuer kontaktieren und ihn fragen, ob Sie das Paket übernehmen dürfen. Falls Sie aus irgend einem Grund annehmen, der Betreuer sei AWOL (absent without leave/abwesend ohne etwas zu hinterlassen), dann lesen Sie <xref linkend="mia-qa"/>.
fr: Prendre un paquet parce qu'il vous semble négligé n'est pas correct — ce serait un détournement de paquet. Vous pouvez prendre contact avec le responsable actuel et lui demander si vous pouvez prendre en charge ce paquet. Si vous avez le sentiment qu'un responsable est parti sans prévenir (« <literal>absent without leave</literal> » ou <literal>AWOL</literal>), veuillez vous reporter à <xref linkend="mia-qa"/>.
ja: メンテナンスされていないと思うパッケージを単純に持っていっても構いませんか? —それはパッケージの乗っ取り (hijacking) です。できますが、もちろんのこと、現在のメンテナに確認をとってパッケージを持って行って良いか尋ねましょう。メンテナが AWOL (absent without leave、無届け欠席状態) であると信ずる理由があれば、<xref linkend="mia-qa"/> を参照してください。

source: Generally, you may not take over the package without the assent of the current maintainer. Even if they ignore you, that is still not grounds to take over a package. Complaints about maintainers should be brought up on the developers' mailing list. If the discussion doesn't end with a positive conclusion, and the issue is of a technical nature, consider bringing it to the attention of the technical committee (see the <ulink url="&url-tech-ctte;">technical committee web page</ulink> for more information).
de: Generell sollten Sie das Paket nicht ohne die Zustimmung des aktuellen Betreuers übernehmen. Sogar, wenn er Sie ignoriert, ist das immer noch kein Grund das Paket zu übernehmen. Beschwerden über Betreuer sollten auf der Entwickler-Mailingliste vorgebracht werden. Falls die Diskussion mit keinem positiven Fazit endet und das Thema technischer Natur ist, erwägen Sie, die Aufmerksamkeit des Technischen Ausschusses darauf zu lenken (weitere Informationen finden Sie unter <ulink url="&url-tech-ctte;">Debians Technischer Ausschuss</ulink>).
fr: Normalement, vous ne pouvez pas adopter un paquet sans l'accord de son responsable. Même s'il vous ignore, ce n'est pas une raison pour le faire. Les plaintes à propos des responsables devraient être portées sur la liste de diffusion des développeurs. Si la discussion ne se termine pas par une conclusion positive et que le problème est de nature technique, envisagez de porter le cas à l'attention du comité technique (voir la <ulink url="&url-tech-ctte;">page web du comité technique</ulink> pour plus d'informations).
ja: 一般的に、現在のメンテナの同意なしでパッケージを引き取るべきではありません。彼らがあなたのことを無視したのだとしても、それはパッケージを引き取る理由とはなりません。メンテナへの不満は開発者のメーリングリストへ送られるべきです。議論が良い結論に至らない、かつ問題が技術的なものなのであれば、技術委員会に相談することを検討してください (より詳細については、<ulink url="&url-tech-ctte;">Debian 技術委員会のページ</ulink> を参照してください)。

source: If you take over an old package, you probably want to be listed as the package's official maintainer in the bug system. This will happen automatically once you upload a new version with an updated <literal>Maintainer</literal> field, although it can take a few hours after the upload is done. If you do not expect to upload a new version for a while, you can use <xref linkend="pkg-tracking-system"/> to get the bug reports. However, make sure that the old maintainer has no problem with the fact that they will continue to receive the bugs during that time.
de: Wenn Sie ein altes Paket übernehmen, möchten Sie wahrscheinlich als offizieller Betreuer in der Fehlerdatenbank aufgeführt werden. Dies geschieht automatisch, sobald Sie eine neue Version mit einem aktualisierten <literal>Maintainer</literal>-Feld hochladen, obwohl dies nach dem Upload ein paar Tage dauern kann. Falls Sie für eine Weile nicht planen eine neue Version hochzuladen, können Sie das <xref linkend="pkg-tracking-system"/> benutzen, um Fehlerberichte zu erhalten. Stellen Sie jedoch sicher, dass der alte Betreuer kein Problem damit hat, dass Sie ab diesem Zeitpunkt die Fehlerberichte erhalten.
fr: Si vous reprenez un vieux paquet, vous voudrez sûrement que le système de suivi des bogues indique que vous êtes le responsable du paquet. Cela se produira automatiquement une fois installé une nouvelle version du paquet dans l'archive avec le champ <literal>Maintainer</literal> à jour. Cela peut prendre quelques heures après l'envoi. Si vous ne pensez pas faire de mise à jour avant un moment, vous pouvez utiliser le <xref linkend="pkg-tracking-system"/> pour recevoir les rapports de bogue. Cependant, assurez-vous que l'ancien responsable n'est pas embêté de recevoir les rapports de bogues en attendant.
ja: 古いパッケージを引き継いだ場合は、おそらくバグ追跡システムでパッケージの公式メンテナとして表示されるようにしたいことでしょう。これは、一旦 <literal>Maintainer</literal> 欄を更新した新しいバージョンをアップロードすれば自動的に行われますが、アップロードが完了してから数時間はかかります。しばらくは新しいバージョンをアップロードする予定が無い場合は、<xref linkend="pkg-tracking-system"/> を使ってバグ報告を受け取ることができます。しかし、以前のメンテナにしばらくの間はバグ報告が届き続けても問題無いことを確認してください。

source: Porting and being ported
de: Portieren und portiert werden
fr: Portage
ja: 移植作業、そして移植できるようにすること

source: Debian supports an ever-increasing number of architectures. Even if you are not a porter, and you don't use any architecture but one, it is part of your duty as a maintainer to be aware of issues of portability. Therefore, even if you are not a porter, you should read most of this chapter.
de: Debian unterstützt eine immer größer werdende Anzahl von Architekturen. Sogar wenn Sie kein Portierer sind und nur eine einzige Architektur nutzen, gehört es zu Ihren Pflichten als Betreuer die Fragen der Portierbarkeit zu kennen. Daher sollten Sie sogar wenn Sie kein Portierer sind, das meiste in diesem Kapitel lesen.
fr: Debian gère un nombre croissant d'architectures. Même si vous n'êtes pas un porteur et que vous utilisez une seule architecture, il est de votre responsabilité de développeur d'être attentif aux questions de portabilité. C'est pourquoi il est important de lire ce chapitre même si vous n'êtes pas un porteur.
ja: Debian がサポートするアーキテクチャの数は増え続けています。あなたが移植作業者ではない、あるいは別のアーキテクチャを使うことが無いという場合であっても、移植性の問題に注意を払うことはメンテナとしてのあなたの義務です。従って、あなたが移植作業者でなくても、この章の大半を読む必要があります。

source: Porting is the act of building Debian packages for architectures that are different from the original architecture of the package maintainer's binary package. It is a unique and essential activity. In fact, porters do most of the actual compiling of Debian packages. For instance, when a maintainer uploads a (portable) source packages with binaries for the <literal>i386</literal> architecture, it will be built for each of the other architectures, amounting to &number-of-arches; more builds.
de: Portieren ist das Erstellen von Debian-Paketen für Architekturen, die sich von der Originalarchitektur des Binärpakets des Paketbetreuers unterscheiden. Es ist eine einzigartige und notwendige Aktivität. Tatsächlich sind Portierer diejenigen, die meisten Debian-Pakete compilieren. Wenn zum Beispiel ein Paketbetreuer ein (portierbares) Quellpaket mit Binärdateien für die Architektur <literal>i386</literal> hochlädt, wird es für jede andere Architektur erstellt, was auf &number-of-arches; weitere Builds hinausläuft.
fr: Porter un paquet consiste à compiler un paquet binaire pour des architectures différentes de celle du paquet binaire du responsable du paquet. C'est une activité remarquable et essentielle. En fait, les porteurs sont à l'origine de la plupart des compilations de paquets Debian. Par exemple, quand un paquet source (portable) est envoyé avec les paquets binaires <literal>i386</literal>, il faut compter une compilation pour chaque autre architecture, soit un total de &number-of-arches; compilations.
ja: 移植作業 (Porting) とは、パッケージメンテナが生成したバイナリパッケージの元々のアーキテクチャとは違うアーキテクチャの Debian パッケージをビルドする作業です。これは非常にユニークかつ極めて重要な活動です。事実、移植作業者は実際の Debian パッケージのコンパイルの大半を行っています。例えば、メンテナが (移植可能な) ソースパッケージと <literal>i386</literal> のバイナリをアップロードすると、他の各アーキテクチャ、&number-of-arches; 以上の数のビルドが生成されます。

source: Being kind to porters
de: Seien Sie freundlich zu Portierern
fr: Courtoisie avec les porteurs
ja: 移植作業者に対して協力的になる

source: Porters have a difficult and unique task, since they are required to deal with a large volume of packages. Ideally, every source package should build right out of the box. Unfortunately, this is often not the case. This section contains a checklist of ``gotchas'' often committed by Debian maintainers — common problems which often stymie porters, and make their jobs unnecessarily difficult.
de: Portierer haben schwere und ungewöhnliche Aufgaben, da sie mit einer großen Zahl von Paketen umgehen müssen. Idealerweise sollte jedes Quellpaket richtig aus dem Stand erstellt werden. Unglücklicherweise ist das oft nicht der Fall. Dieser Abschnitt enthält eine Prüfliste von »Patzern«, die öfters von Debian-Betreuern begangen werden – übliche Probleme, die Portierer oft in die Klemme geraten lassen und ihre Arbeit unnötig erschweren.
fr: Les porteurs ont une tâche remarquable et difficile car ils doivent gérer un grand nombre de paquets. Idéalement, tout paquet source devrait compiler sans modification. Malheureusement, c'est rarement le cas. Cette section contient une liste d'erreurs régulièrement commises par les responsables Debian — problèmes courants qui bloquent souvent les porteurs et compliquent inutilement leur travail.
ja: 移植作業者は、難解かつ他には無いタスクを抱えています。それは、彼らは膨大な量のパッケージに対処する必要があるからです。理想を言えば、すべてのソースパッケージは変更を加えないできちんとビルドできるべきです。残念なことに、その様な場合はほとんどありません。この章は Debian メンテナによってよくコミットされる「潜在的な問題」のチェックリストを含んでいます — よく移植作業者を困らせ、彼らの作業を不必要に難解にする共通の問題です。
