Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: See also <xref linkend="bpp-debian-changelog"/>.
de: Siehe auch <xref linkend="bpp-debian-changelog"/>.
fr: Voir aussi <xref linkend="bpp-debian-changelog"/>.
ja: <xref linkend="bpp-debian-changelog"/> も参照してください。

source: Testing the package
de: Das Paket testen
fr: Tests du paquet
ja: パッケージをテストする

source: Before you upload your package, you should do basic testing on it. At a minimum, you should try the following activities (you'll need to have an older version of the same Debian package around):
de: Bevor Sie Ihr Paket hochladen, sollten Sie es grundlegenden Tests unterziehen. Zumindest sollten Sie die folgenden Dinge ausprobieren (Sie sollten eine ältere Version des gleichen Debian-Pakets zur Hand haben):
fr: Avant d'envoyer un paquet, il faut effectuer quelques tests essentiels. Les opérations suivantes (une ancienne version du paquet est parfois nécessaire) devraient au moins être éprouvées :
ja: パッケージをアップロードする前に、基本的なテストをする必要があります。最低限、以下の作業が必要です (同じ Debian パッケージの古いバージョンなどが必要になるでしょう):

source: Install the package and make sure the software works, or upgrade the package from an older version to your new version if a Debian package for it already exists.
de: Installieren Sie das Paket und stellen Sie sicher, dass die Software funktioniert oder führen Sie ein Upgrade von der älteren Version auf Ihre neue Version durch, falls bereits ein Debian-Paket existiert.
fr: installer le paquet et vérifier que le logiciel fonctionne. Si le paquet existait déjà dans une version plus ancienne, faire une mise à niveau ;
ja: パッケージをインストールしてソフトウェアが動作するのを確認する、あるいは既にそのソフトの Debian パッケージが存在している場合、パッケージを以前のバージョンから新しいバージョンにアップグレードする。

source: Run <command>lintian</command> over the package. You can run <command>lintian</command> as follows: <literal>lintian -v <replaceable>package-version</replaceable>.changes</literal>. This will check the source package as well as the binary package. If you don't understand the output that <command>lintian</command> generates, try adding the <literal>-i</literal> switch, which will cause <command>lintian</command> to output a very verbose description of the problem.
de: Führen Sie für das Paket <command>lintian</command> aus. Sie können <command>lintian</command> wie folgt ausführen: <literal>lintian -v <replaceable>Paket-Version</replaceable>.changes</literal>. Falls Sie die von <command>lintian</command> erzeugte Ausgabe nicht verstehen, versuchen Sie den Schalter <command>-i</command> hinzuzufügen. Er veranlasst <command>lintian</command> eine viel detailliertere Beschreibung des Problems auszugeben.
fr: exécuter <command>lintian</command> sur le paquet. Il est possible d'exécuter <command>lintian</command> comme suit : <literal>lintian -v <replaceable>paquet-version</replaceable>.changes</literal>. Cette commande provoquera une vérification des paquets source et binaire. En cas de difficultés pour comprendre les messages de retour, utiliser l'option <literal>-i</literal> de <command>lintian</command>. Cette option rendra <command>lintian</command> beaucoup plus explicite dans la description des problèmes.
ja: パッケージに対して <command>lintian</command> を実行する。以下のようにして <command>lintian</command> を実行できます: <literal>lintian -v <replaceable>package-version</replaceable>.changes</literal> これによって、バイナリパッケージ同様にソースパッケージを確認できます。<command>lintian</command> が生成した出力を理解していない場合は、<command>lintian</command> が問題の説明を非常に冗長に出力するようにする <literal>-i</literal> オプションを付けて実行してみてください。

source: Normally, a package should <emphasis>not</emphasis> be uploaded if it causes <command>lintian</command> to emit errors (they will start with <literal>E</literal>).
de: Normalerweise sollte ein Paket <emphasis>nicht</emphasis> hochgeladen werden, wenn es <command>lintian</command>-Fehler verursacht (sie beginnen mit <literal>E</literal>).
fr: En principe, un paquet pour lequel <command>lintian</command> renvoie des erreurs (elles commencent par <literal>E</literal>) ne devrait <emphasis>jamais</emphasis> être envoyé.
ja: 通常、<command>lintian</command> がエラーを出力するようであれば、パッケージをアップロードしては<emphasis>いけません</emphasis> (エラーは <literal>E</literal> で始まります)。

source: For more information on <command>lintian</command>, see <xref linkend="lintian"/>.
de: Weitere Informationen über <command>lintian</command> finden Sie unter <xref linkend="lintian"/>.
fr: Pour en savoir plus sur <command>lintian</command>, voir <xref linkend="lintian"/> ;
ja: <command>lintian</command> についての詳細は、<xref linkend="lintian"/> を参照してください。

source: Optionally run <command>debdiff</command> (see <xref linkend="debdiff"/>) to analyze changes from an older version, if one exists.
de: Führen Sie wahlweise <command>debdiff</command> (siehe <xref linkend="debdiff"/>) aus, um Änderungen von einer älteren Version zu analysieren, falls es solche gibt.
fr: facultativement exécuter <command>debdiff</command> (voir <xref linkend="debdiff"/>) pour analyser les modifications depuis une ancienne version si celle-ci existe ;
ja: もし古いバージョンがあれば、それからの変更点を分析するために追加で <command>debdiff</command> を実行する (<xref linkend="debdiff"/> を参照) 。

source: Downgrade the package to the previous version (if one exists) — this tests the <filename>postrm</filename> and <filename>prerm</filename> scripts.
de: Downgraden Sie das Paket auf die vorherige Version (falls es eine gibt) – dies testet die Skripte <filename>postrm</filename> und <filename>prerm</filename>.
fr: revenir à la version précédente du paquet (si elle existe) — cela permet de tester les scripts <filename>postrm</filename> et <filename>prerm</filename> ;
ja: (もしあれば) 以前のバージョンにダウングレードする — これは <filename>postrm</filename> スクリプトと <filename>prerm</filename> スクリプトをテストします。

source: Remove the package, then reinstall it.
de: Entfernen Sie das Paket und installieren Sie es erneut.
fr: retirer le paquet et le réinstaller à nouveau ;
ja: パッケージを削除して、再インストールする。

source: Copy the source package in a different directory and try unpacking it and rebuilding it. This tests if the package relies on existing files outside of it, or if it relies on permissions being preserved on the files shipped inside the <filename>.diff.gz</filename> file.
de: Kopieren Sie das Quellpaket in ein anderes Verzeichnis und versuchen Sie es zu entpacken und neu zu erstellen. Dies testet, ob das Paket auf bestehenden Dateien von außen beruht oder ob es auf Benutzerrechten beruht, die in den Dateien konserviert wurden, die innerhalb der <filename>.diff.gz</filename>-Datei mitgeliefert wurden.
fr: copier le paquet source dans un répertoire différent puis tenter de le décompresser et de le reconstruire. Le but est de vérifier que la construction n'utilise pas de fichiers en dehors de ceux du paquet ou des permissions non préservées sur les fichiers contenues dans le fichier <filename>.diff.gz</filename>.
ja: ソースパッケージを違うディレクトリにコピーして展開し、再構築する。これは、パッケージが外部の既存ファイルに依っているか、<filename>.diff.gz</filename> ファイル内に含まれているファイルで保存されている権限に依るかどうかをテストします。

source: Layout of the source package
de: Layout des Quellpakets
fr: Agencement du paquet source
ja: ソースパッケージの概要

source: There are two types of Debian source packages:
de: Es gibt zwei Typen von Debian-Quellpaketen:
fr: Il existe deux types de paquets source Debian :
ja: Debian のソースパッケージには 2 種類あります：

source: the so-called <literal>native</literal> packages, where there is no distinction between the original sources and the patches applied for Debian
de: die sogenannten <literal>native</literal>-Pakete, bei denen es keine Unterschiede zwischen den Originalquellen und den auf Debian angewandten Patchs gibt
fr: les paquets natifs (« <literal>native</literal> ») pour lesquels il n'y a pas de distinction entre les sources d'origine et les correctifs appliqués pour Debian ;
ja: いわゆる <literal>ネイティブ (native)</literal> パッケージ。元のソースと Debian で当てられたパッチの間に差が無いもの

source: the (more common) packages where there's an original source tarball file accompanied by another file that contains the changes made by Debian
de: die (häufigeren) Pakete, bei denen die Original-Quellcode-Tarball-Datei mit einer anderen Datei mitgeliefert wird, die die von Debian vorgenommenen Änderungen enthält
fr: les paquets (plus courants) avec au moins une archive, contenant les sources d'origine, accompagnée d'un fichier, contenant les modifications pour Debian.
ja: オリジナルのソースコードの tarball ファイルに、Debian によって作成された変更点を含む別のファイルが付随している (より一般的な) パッケージ

source: For the native packages, the source package includes a Debian source control file (<filename>.dsc</filename>) and the source tarball (<filename>.tar.{gz,bz2,xz}</filename>). A source package of a non-native package includes a Debian source control file, the original source tarball (<filename>.orig.tar.{gz,bz2,xz}</filename>) and the Debian changes (<filename>.diff.gz</filename> for the source format “1.0” or <filename>.debian.tar.{gz,bz2,xz}</filename> for the source format “3.0 (quilt)”).
de: Bei nativen Paketen enthält der Quell-Tarball eine Steuerungsdatei für Debian-Quellen (<filename>.dsc</filename>) und einen Quell-Tarball (<filename>.tar.{gz,bz2,xz}</filename>). Ein Quellpaket eines nicht nativen Paketes enthält eine Steuerungsdatei für Debian-Quellen, den Original-Quellcode-Tarball (<filename>.orig.tar.{gz,bz2,xz}</filename>) und die Debian-Änderungen (<filename>.diff.gz</filename> für das Quellformat »1.0« oder <filename>.debian.tar.{gz,bz2,xz}</filename> für das Quellformat »3.0 (quilt)«).
fr: Pour les paquets natifs, le paquet source comprend un fichier de contrôle source Debian (<filename>.dsc</filename>) et l'archive source (<filename>.tar.{gz,bz2,xz}</filename>). Un paquet source d'un paquet non natif comprend un fichier de contrôle source Debian, l'archive source d'origine (<filename>.orig.tar.{gz,bz2,xz}</filename>) et les modifications Debian (<filename>.diff.gz</filename> pour le format source « 1.0 » ou <filename>.debian.tar.{gz,bz2,xz}</filename> pour le format source « 3.0 (quilt) »).
ja: ネイティブパッケージの場合、ソースパッケージは Debian のソース control ファイル (<filename>.dsc</filename>) とソースコードの tarball (<filename>.tar.{gz,bz2,xz}</filename>) を含んでいます。ネイティブではないパッケージのソースパッケージは Debian のソース control ファイルと、オリジナルのソースコードの tarball (<filename>.orig.tar.{gz,bz2,xz}</filename>)、そして Debian での変更点 (ソース形式“1.0”は <filename>.diff.gz</filename>、ソース形式“3.0 (quilt)”は <filename>.debian.tar.{gz,bz2,xz}</filename>) を含んでいます。

source: With source format “1.0”, whether a package is native or not was determined by <command>dpkg-source</command> at build time. Nowadays it is recommended to be explicit about the desired source format by putting either “3.0 (quilt)” or “3.0 (native)” in <filename>debian/source/format</filename>. The rest of this section relates only to non-native packages.
de: Mit dem Quellformat »1.0« wurde zur Zeit des Erstellens durch <command>dpkg-source</command> festgelegt, ob ein Paket nativ ist oder nicht. Heutzutage wird empfohlen, das gewünschte Quellformat explizit durch Angabe von »3.0 (quilt)« oder »3.0 (native)« in <filename>debian/source/format</filename> festzulegen. Der Rest dieses Abschnitts bezieht sich auf nicht native Pakete.
fr: Avec le format « 1.0 », le paquet est soit natif, soit non déterminé par <command>dpkg-source</command> au moment de la construction. Il est dorénavant recommandé de déterminer explicitement le format source en écrivant « 3.0 (quilt) » ou « 3.0 (native) » dans <filename>debian/source/format</filename>. La suite de cette partie ne traite que les paquets non natifs.
ja: ソース形式“1.0”では、パッケージが native かどうかはビルド時に <command>dpkg-source</command> によって決められていました。最近では望むソース形式を <filename>debian/source/format</filename> に“3.0 (quilt)”または“3.0 (native)”と記述することによって明示することが推奨されています。この章の残りの部分は native ではないパッケージについてのみ記しています。

source: The first time a version is uploaded which corresponds to a particular upstream version, the original source tar file should be uploaded and included in the <filename>.changes</filename> file. Subsequently, this very same tar file should be used to build the new diffs and <filename>.dsc</filename> files, and will not need to be re-uploaded.
de: Anfangs, wenn eine Version hochgeladen wird, die einer bestimmten Version der Ursprungsquelle entspricht, könnte die Original-Tar-Quelldatei hochgeladen und in die <filename>.changes</filename>-Datei eingefügt werden. Nachfolgend sollte eben diese Tar-Datei benutzt werden, um neue .diff- und <filename>.dsc</filename>-Dateien zu erstellen ohne der Notwendigkeit sie erneut hochzuladen.
fr: La première fois qu'un paquet est installé dans l'archive pour une version amont donnée, le fichier <filename>tar</filename> de cette version amont doit être envoyé et mentionné dans le fichier <filename>.changes</filename>. Par la suite, ce même fichier <filename>tar</filename> sera utilisé pour générer les fichiers <filename>diff</filename> et <filename>.dsc</filename>, et il ne sera pas nécessaire de l'envoyer à nouveau.
ja: 初回には、特定の開発元のバージョン (upstream version) に該当するバージョンがアップロードされます。元のソース tar ファイルは、アップロードされて <filename>.changes</filename> ファイルに含まれている必要があります。その後、新しい diff ファイルや <filename>.dsc</filename> ファイルの生成には全く同じ tar ファイルを使わなければならず、これを再アップロードする必要はありません。

source: By default, <command>dpkg-genchanges</command> and <command>dpkg-buildpackage</command> will include the original source tar file if and only if the current changelog entry has a different upstream version from the preceding entry. This behavior may be modified by using <literal>-sa</literal> to always include it or <literal>-sd</literal> to always leave it out.
de: Standardmäßig werden <command>dpkg-genchanges</command> und <command>dpkg-buildpackage</command> die Original-Tar-Quelldatei nur dann einbeziehen, falls der aktuelle Änderungsprotokolleintrag eine andere Originalversion des vorhergehenden Eintrags hat. Diese Verhalten könnte durch die Benutzung von <literal>-sa</literal> geändert werden, um es immer einzubeziehen oder <literal>-sd</literal>, um es immer wegzulassen.
fr: Par défaut, <command>dpkg-genchanges</command> et <command>dpkg-buildpackage</command> incluront le fichier <filename>tar</filename> amont si et seulement si la précédente modification de <filename>changelog</filename> mentionne une version amont différente de la précédente. Ce comportement peut être modifié en utilisant <literal>-sa</literal> pour l'inclure systématiquement ou <literal>-sd</literal> pour ne jamais l'inclure.
ja: デフォルトでは、<command>dpkg-genchanges</command> および <command>dpkg-buildpackage</command> は前述されている changelog エントリと現在のエントリが異なった upstream バージョンを持つ場合にのみ、オリジナルのソース tar ファイルを含めようとします。この挙動は、<literal>-sa</literal> を使って常に含めたり、<literal>-sd</literal> を使うことで常に含めないようにするように変更できます。

source: If no original source is included in the upload, the original source tar-file used by <command>dpkg-source</command> when constructing the <filename>.dsc</filename> file and diff to be uploaded <emphasis>must</emphasis> be byte-for-byte identical with the one already in the archive.
de: Falls im Upload keine Originalquelle enthalten ist, wird die Original-Tar-Quelldatei von <command>dpkg-source</command> benutzt, wenn die <filename>.dsc</filename>-Datei erzeugt wird und die Diff-Datei, die hochgeladen werden soll, <emphasis>muss</emphasis> Byte für Byte identisch mit der sein, die bereits im Archiv ist.
fr: Si la mise à jour ne contient pas le fichier <filename>tar</filename> des sources d'origine, <command>dpkg-source</command> <emphasis>doit</emphasis> utiliser le même fichier <filename>tar</filename> que celui déjà présent dans l'archive pour construire les fichiers <filename>.dsc</filename> et <filename>diff</filename> envoyés.
ja: アップロード時にオリジナルのソースが含まれていない場合、アップロードされる <filename>.dsc</filename> と diff ファイルを構築する際に <command>dpkg-source</command> が使用するオリジナルの tar ファイルは、<emphasis>必ず</emphasis>既にアーカイブにあるものと 1 バイトも違わぬものでなくてはなりません。

source: Please notice that, in non-native packages, permissions on files that are not present in the <filename>*.orig.tar.{gz,bz2,xz}</filename> will not be preserved, as diff does not store file permissions in the patch. However when using source format “3.0 (quilt)”, permissions of files inside the <filename>debian</filename> directory are preserved since they are stored in a tar archive.
de: Bitte beachten Sie, dass in nicht nativen Paketen Zugriffsrechte von Dateien, die nicht in den <filename>*.orig.tar.{gz,bz2,xz}</filename>-Dateien enthalten sind, nicht aufbewahrt werden, da das Diff die Dateizugriffsrechte nicht im Patch speichert. Wenn Sie jedoch das Format «3.0 (quilt)« benutzen, werden Zugriffsrechte von Dateien innerhalb des <filename>debian</filename>-Verzeichnisses aufbewahrt, da sie in einem Tar-Archiv gespeichert werden.
fr: Dans des paquets non natifs, les permissions des fichiers non présents dans l'archive <filename>*.orig.tar.{gz,bz2,xz}</filename> ne seront pas préservées car <command>diff</command> ne stocke pas les permissions dans le correctif. Néanmoins, en utilisant le format « 3.0 (quilt) », les permissions des fichiers du répertoire <filename>debian</filename> seront préservées puisqu'ils seront contenus dans une archive <filename>tar</filename>.
ja: 注意していただきたいのですが、native ではないパッケージでは、diff はパッチ内のファイルパーミッションを保存しないので、<filename>*.orig.tar.{gz,bz2,xz}</filename> 内に存在しないファイルのパーミッションは保持されません。しかし、ソース形式“3.0 (quilt)”を使っている場合、<filename>debian</filename> ディレクトリ内にあるファイルのパーミッションは tar アーカイブで保存されるのでそのままになります。

source: Picking a distribution
de: Eine Distribution herausgreifen
fr: Choix de distribution
ja: ディストリビューションを選ぶ

source: Each upload needs to specify which distribution the package is intended for. The package build process extracts this information from the first line of the <filename>debian/changelog</filename> file and places it in the <literal>Distribution</literal> field of the <filename>.changes</filename> file.
de: Bei jedem Upload muss angegeben werden, für welche Distribution das Paket gedacht ist. Der Prozess der Paketerstellung extrahiert diese Information aus der ersten Zeile der Datei <filename>debian/changelog</filename> und platziert sie im Feld <literal>Distribution</literal> der <filename>.changes</filename>-Datei.
fr: Chaque envoi doit indiquer à quelle distribution le paquet est destiné. Le processus de construction de paquet extrait cette information à partir de la première ligne du fichier <filename>debian/changelog</filename> et la place dans le champ <literal>Distribution</literal> du fichier <filename>.changes</filename>.
ja: アップロードでは、パッケージがどのディストリビューション向けになっているかを指定してあることが必要です。パッケージの構築プロセスでは、<filename>debian/changelog</filename> ファイルの最初の行からこの情報を展開し、<filename>.changes</filename> ファイルの <literal>Distribution</literal> 欄に配置します。

source: There are several possible values for this field: <literal>stable</literal>, <literal>unstable</literal>, <literal>testing-proposed-updates</literal> and <literal>experimental</literal>. Normally, packages are uploaded into <literal>unstable</literal>.
de: Es gibt mehrere mögliche Werte für dieses Feld: <literal>stable</literal>, <literal>unstable</literal>, <literal>testing-proposed-updates</literal> und <literal>experimental</literal>. Normalerweise werden Pakete nach <literal>unstable</literal> hochgeladen.
fr: Il existe plusieurs valeurs possibles pour ce champ : <literal>stable</literal>, <literal>unstable</literal>, <literal>testing-proposed-updates</literal> et <literal>experimental</literal>. En principe, les paquets sont destinés à <literal>unstable</literal>.
ja: この欄にはいくつか指定可能な値があります: <literal>stable</literal>、<literal>unstable</literal>、<literal>testing-proposed-updates</literal>、そして <literal>experimental</literal> です。通常、パッケージは <literal>unstable</literal> にアップロードされます。

source: Actually, there are two other possible distributions: <literal>stable-security</literal> and <literal>testing-security</literal>, but read <xref linkend="bug-security"/> for more information on those.
fr: En fait, il y a deux autres possibilités : <literal>stable-security</literal> et <literal>testing-security</literal>, voir <xref linkend="bug-security"/> pour plus d'informations sur celles-ci.
ja: 実際には、他に二つ指定可能なディストリビューションがあります: <literal>stable-security</literal> と <literal>testing-security</literal> ですが、これらについての詳細は <xref linkend="bug-security"/> を読んでください。

source: It is not possible to upload a package into several distributions at the same time.
de: Es ist nicht möglich ein Paket gleichzeitig in mehrere Distributionen hochzuladen.
fr: Il n'est pas possible d'envoyer un paquet dans plusieurs distributions en même temps.
ja: 同時に複数のディストリビューションへ、パッケージをアップロードすることはできません。

source: Special case: uploads to the <literal>stable</literal> and <literal>oldstable</literal> distributions
de: Ein Sonderfall sind Uploads in die Distributionen <literal>stable</literal> und <literal>oldstable</literal>.
fr: Cas particulier : distributions <literal>stable</literal> et <literal>oldstable</literal>
ja: 特別な例: <literal>安定版 (stable)</literal> と <literal>旧安定版 (oldstable)</literal> ディストリビューションへアップロードする

source: Uploading to <literal>stable</literal> means that the package will transferred to the <literal>proposed-updates-new</literal> queue for review by the stable release managers, and if approved will be installed in <filename>stable-proposed-updates</filename> directory of the Debian archive. From there, it will be included in <literal>stable</literal> with the next point release.
de: Hochladen nach <literal>stable</literal> bedeutet, dass das Paket in die Warteschlange <literal>proposed-updates-new</literal> übertragen wird, damit es von den Veröffentlichungsverwaltern von Stable überprüft wird. Falls es zugelassen wird, wird es im Verzeichnis <filename>stable-proposed-updates</filename> des Debian-Archivs installiert. Von dort wird es zum nächsten Veröffentlichungszeitpunkt in <literal>stable</literal> eingefügt.
fr: Envoyer un paquet pour la distribution <literal>stable</literal> signifie que le paquet sera dirigé vers la file d'attente <literal>proposed-updates-new</literal> pour être revu par les responsables de la publication <literal>stable</literal>. Une fois accepté, le paquet sera installé dans le répertoire <filename>stable-proposed-updates</filename> de l'archive Debian. Il sera ensuite ajouté à <literal>stable</literal> lors de la prochaine mise à jour de la distribution.
ja: <literal>安定版 (stable)</literal> へのアップロードは、安定版リリースマネージャによるレビューのため、パッケージは <literal>proposed-updates-new</literal> キューに転送され、許可された場合は Debian アーカイブの <filename>stable-proposed-updates</filename> ディレクトリにインストールされます。ここから、ここから、<literal>安定版 (stable)</literal> の次期ポイントリリースに含まれることになります。
