Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: As you can see, the top-level directory contains two directories, <filename>dists/</filename> and <filename>pool/</filename>. The latter is a “pool” in which the packages actually are, and which is handled by the archive maintenance database and the accompanying programs. The former contains the distributions, <literal>stable</literal>, <literal>testing</literal> and <literal>unstable</literal>. The <filename>Packages</filename> and <filename>Sources</filename> files in the distribution subdirectories can reference files in the <filename>pool/</filename> directory. The directory tree below each of the distributions is arranged in an identical manner. What we describe below for <literal>stable</literal> is equally applicable to the <literal>unstable</literal> and <literal>testing</literal> distributions.
de: Wie Sie sehen können, enthält das Verzeichnis auf der obersten Ebene die beiden Verzeichnisse <filename>dists/</filename> und <filename>pool/</filename>. Letzteres ist ein »Pool«, in dem sich die Pakete derzeit befinden. Er wird von der Archiv-Verwaltungsdatenbank und den beiliegenden Programmen gehandhabt. Ersteres enthält die Distributionen <literal>stable</literal>, <literal>testing</literal> und <literal>unstable</literal>. Die Dateien <filename>Packages</filename> und <filename>Sources</filename> in den Distributions-Unterverzeichnissen können auf Dateien im Verzeichnis <filename>pool/</filename> verweisen. Der Verzeichnisbaum unterhalb jeder Distribution ist auf die gleiche Art angeordnet. Was im Folgenden für <literal>stable</literal> beschrieben wird, ist gleichermaßen auf die Distributionen <literal>unstable</literal> und <literal>testing</literal> anwendbar.
fr: Le répertoire racine contient deux répertoires : <filename>dists/</filename> et <filename>pool/</filename>. Le second contient un ensemble de répertoires où sont stockés les paquets. Ceux-ci sont gérés dans la base de données de l'archive et les logiciels qui l'accompagnent. Le premier répertoire contient les distributions <literal>stable</literal>, <literal>testing</literal> et <literal>unstable</literal>. Les fichiers <filename>Packages</filename> et <filename>Sources</filename> des sous-répertoires de distribution font référence aux fichiers du répertoire <filename>pool/</filename>. Le découpage en sous-répertoires est identique d'un répertoire de distribution à l'autre. Ce qui est exposé ci-dessous pour la distribution <literal>stable</literal> est également valable pour les distributions <literal>unstable</literal> et <literal>testing</literal>.
ja: 見て分かるように、一番上のディレクトリは <filename>dists/</filename> と <filename>pool/</filename> という 2 つのディレクトリを含んでいます。後者の “pool” はパッケージが実際に置かれており、アーカイブのメンテナンスデータベースと関連するプログラムによって利用されます。前者には<literal>stable</literal>、<literal>testing</literal>、そして <literal>unstable</literal> というディストリビューションが含まれます。ディストリビューションサブディレクトリ中の <filename>Packages</filename> および <filename>Sources</filename> ファイルは <filename>pool/</filename> ディレクトリ中のファイルを参照しています。以下の各ディストリビューションのディレクトリツリーは全く同じ形式になっています。以下で <literal>stable</literal> について述べていることは <literal>unstable</literal> や <literal>testing</literal> ディストリビューションにも同様に当てはまります。

source: <filename>dists/stable</filename> contains three directories, namely <filename>main</filename>, <filename>contrib</filename>, and <filename>non-free</filename>.
de: <filename>dists/stable</filename> enthält drei Verzeichnisse, nämlich <filename>main</filename>, <filename>contrib</filename> und <filename>non-free</filename>.
fr: Le répertoire <filename>dists/stable</filename> contient trois répertoires nommés <filename>main</filename>, <filename>contrib</filename>, et <filename>non-free</filename>.
ja: <filename>dists/stable</filename> は、<filename>main</filename>、<filename>contrib</filename>、<filename>non-free</filename> という名前の 3 つのディレクトリを含んでいます。

source: In each of the areas, there is a directory for the source packages (<filename>source</filename>) and a directory for each supported architecture (<filename>binary-i386</filename>, <filename>binary-amd64</filename>, etc.).
de: In jedem Bereich gibt es ein Verzeichnis für Quellpakete (<filename>source</filename>) und ein Verzeichnis für jede unterstützte Architektur (<filename>binary-i386</filename>, <filename>binary-amd64</filename>, etc.).
fr: Dans chacune de ces sections, se trouve un répertoire contenant les paquets source (<filename>source/</filename>) et un répertoire pour chaque architecture gérée (<filename>binary-i386</filename>, <filename>binary-amd64</filename>, etc.).
ja: それぞれ、source パッケージ (<filename>source</filename>) のディレクトリとサポートしている各アーキテクチャ (<filename>binary-i386</filename>、<filename>binary-amd64</filename> など) のディレクトリがあります。

source: The <filename>main</filename> area contains additional directories which hold the disk images and some essential pieces of documentation required for installing the Debian distribution on a specific architecture (<filename>disks-i386</filename>, <filename>disks-amd64</filename>, etc.).
de: Der Bereich <filename>main</filename> enthält zusätzliche Verzeichnisse, die die Medien-Images und einige notwendige Teile der Dokumentation, die zum Installieren der Debian-Distribution auf einer speziellen Architektur (<filename>disks-i386</filename>, <filename>disks-amd64</filename>, etc.) benötigt werden.
fr: La section <filename>main</filename> contient d'autres répertoires destinés aux images de disque et à plusieurs documents essentiels pour installer la distribution Debian sur chaque architecture (<filename>disks-i386</filename>, <filename>disks-amd64</filename>, etc.).
ja: <filename>main</filename> は特定のアーキテクチャ (<filename>disks-i386</filename>、<filename>disks-amd64</filename> など)上で Debian ディストリビューションをインストールする際に必要となるディスクイメージと主要なドキュメントの基本部分が入っている追加ディレクトリを含んでいます。

source: The <literal>main</literal> section of the Debian archive is what makes up the <emphasis role="strong">official &debian-formal; distribution</emphasis>. The <literal>main</literal> section is official because it fully complies with all our guidelines. The other two sections do not, to different degrees; as such, they are <emphasis role="strong">not</emphasis> officially part of &debian-formal;.
de: Der Abschnitt <literal>main</literal> des Debian-Archivs ist das, was die <emphasis role="strong">offizielle &debian-formal; Distribution</emphasis> ausmacht. Der Abschnitt <literal>main</literal> ist offiziell, da er alle Richtlinien vollständig erfüllt. Bei den beiden anderen Abschnitten ist dies zu einem unterschiedlichen Grad nicht der Fall . Von daher sind sie <emphasis role="strong">nicht</emphasis> offizieller Teil von &debian-formal;.
fr: La section <literal>main</literal> de l'archive constitue la <emphasis role="strong">distribution &debian-formal; officielle</emphasis>. La section <literal>main</literal> est officielle parce qu'elle est entièrement conforme à toutes nos recommandations. Les deux autres sections divergent de ces recommandations à différents degrés, elles ne font donc <emphasis role="strong">pas</emphasis> officiellement partie de &debian-formal;.
ja: Debian アーカイブの <literal>main</literal> セクションは<emphasis role="strong">公式な &debian-formal; ディストリビューション</emphasis>を構成するものです。<literal>main</literal> セクションが公式なのは、我々のガイドライン全てに合致するものであるからです。他の 2 つのセクションはそうではなく、合致は異なる程度となっています…つまり、&debian-formal; の公式な一部では<emphasis role="strong">ありません</emphasis>。

source: Every package in the main section must fully comply with the <ulink url="&url-dfsg;">Debian Free Software Guidelines</ulink> (DFSG) and with all other policy requirements as described in the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>. The DFSG is our definition of “free software.” Check out the Debian Policy Manual for details.
de: Jedes Paket im Abschnitt »main« muss vollständig die <ulink url="&url-debian-policy;">Debian-Richtlinien für Freie Software</ulink> (DFSG) erfüllen sowie alle anderen Anforderungen des Regelwerks, das im <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> beschrieben wurde. Die DFSG sind Debians Definition von »freier Software«. Prüfen Sie das Debian Policy Manual für Details.
fr: Chaque paquet de la section <literal>main</literal> doit être conforme aux <ulink url="&url-dfsg;">directives Debian pour le logiciel libre (« <literal>Debian Free Software Guidelines</literal> » ou <literal>DFSG</literal>)</ulink> et à toutes les autres recommandations décrites dans <ulink url="&url-debian-policy;">la Charte Debian (« <literal>Debian Policy Manual</literal> »)</ulink>. Les DFSG constituent la définition de « logiciel libre » selon Debian. Reportez-vous à la charte Debian pour en savoir plus.
ja: main セクションにある全てのパッケージは、<ulink url="&url-dfsg;">Debian フリーソフトウェアガイドライン</ulink> (DFSG) 及び <ulink url="&url-debian-policy;">Debian ポリシーマニュアル</ulink>に記載されている他のポリシーの要求事項に完全に適合していなければなりません。DFSG は我々の定義する「フリーソフトウェア」です。詳細は Debian ポリシーマニュアルを確認してください。

source: Packages in the <literal>contrib</literal> section have to comply with the DFSG, but may fail other requirements. For instance, they may depend on non-free packages.
de: Pakete im Abschnitt <literal>contrib</literal> müssen den DFSG entsprechen, könnten aber an anderen Anforderungen scheitern. Zum Beispiel könnten sie von unfreien Paketen abhängen.
fr: Les paquets de la section <literal>contrib</literal> doivent être conformes aux DFSG, mais ne respectent pas d'autres contraintes. Ils peuvent, par exemple, dépendre de paquets de la section <literal>non-free</literal>.
ja: <literal>contrib</literal> セクションにあるパッケージは DFSG に適合している必要がありますが、他の要求事項を満たせてはいないことでしょう。例えば、non-free パッケージに依存している、などです。

source: Packages which do not conform to the DFSG are placed in the <literal>non-free</literal> section. These packages are not considered as part of the Debian distribution, though we enable their use, and we provide infrastructure (such as our bug-tracking system and mailing lists) for non-free software packages.
de: Pakete die nicht die DFSG erfüllen werden in den Abschnitt <literal>non-free</literal> platziert. Diese Pakete werden nicht als Teil der Debian-Distribution betrachtet, obwohl ihre Benutzung ermöglicht und die Infrastuktur (wie die Fehlerdatenbank und die Mailinglisten) für unfreie Pakete bereitgestellt wird.
fr: Les paquets qui ne sont pas conformes aux DFSG sont classés dans la section <literal>non-free</literal>. Bien qu'ils soient prêts à être utilisés sur un système Debian, et qu'ils bénéficient des infrastructures de Debian (système de suivi de bogues, listes de diffusion, etc.), ces paquets non libres ne font pas partie de la distribution Debian.
ja: DFSG を満たさないパッケージは <literal>non-free</literal> セクションに配置されます。これらのパッケージは Debian ディストリビューションの一部としては考えられてはいませんが、我々はこれらを利用できるようにしており、non-free ソフトウェアのパッケージについて (バグ追跡システムやメーリングリストなどの) インフラストラクチャを提供しています。

source: The <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> contains a more exact definition of the three sections. The above discussion is just an introduction.
de: Das <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> enthält eine genauere Definition dieser drei Abschnitte. Die verhergehende Erläuterung ist nur eine Einführung.
fr: La <ulink url="&url-debian-policy;">Charte Debian (« <literal>Debian Policy Manual</literal> »)</ulink> donne des définitions plus précises de ces trois sections. Les paragraphes précédents ne constituent qu'une introduction.
ja: <ulink url="&url-debian-policy;">Debian ポリシーマニュアル</ulink> は 3 つのセクションについてより正確な定義を含んでいます。上記の説明はほんの触りに過ぎません。

source: The separation of the three sections at the top-level of the archive is important for all people who want to distribute Debian, either via FTP servers on the Internet or on CD-ROMs: by distributing only the <literal>main</literal> and <literal>contrib</literal> sections, one can avoid any legal risks. Some packages in the <literal>non-free</literal> section do not allow commercial distribution, for example.
de: Die Unterteilung in drei Abschnitte auf der obersten Ebene des Archivs ist für all die Leute wichtig, die Debian weitergeben möchten, entweder über FTP-Server im Internet oder auf CD-ROMs: Rechtliche Risiken können vermieden werden, wenn nur die Abschnitte <literal>main</literal> und <literal>contrib</literal> weitergegeben werden. Einige Pakete im Abschnitt <literal>non-free</literal> erlauben zum Beispiel keine kommerzielle Weitergabe.
fr: La séparation de l'archive en trois sections est importante pour toute personne qui désire distribuer Debian, que ce soit par Internet ou sur CD-ROM : il suffit de distribuer les sections <literal>main</literal> et <literal>contrib</literal> pour éviter tout problème légal. Certains paquets de la section <literal>non-free</literal> interdisent leur distribution à titre commercial par exemple.
ja: アーカイブの最上位階層で 3 つのセクションに別れていることは、インターネット上の FTP サーバ経由であれ、CD-ROM であれ、Debian を配布したいと考える人にとって大事なことです…その様な人は <literal>main</literal> セクションと <literal>contrib</literal> セクションのみを配布することで、法的なリスクを回避できます。例えば、<literal>non-free</literal> セクションにあるパッケージのいくつかは商的な配布を許可していません。

source: On the other hand, a CD-ROM vendor could easily check the individual package licenses of the packages in <literal>non-free</literal> and include as many on the CD-ROMs as it's allowed to. (Since this varies greatly from vendor to vendor, this job can't be done by the Debian developers.)
de: Andererseits könnte ein CD-ROM-Verkäufer die einzelnen Paketlizenzen der Pakete in <literal>non-free</literal> leicht prüfen und seinen CD-ROMs so viele wie erlaubt hinzufügen. (Da dies von Verkäufer zu Verkäufer stark variiert, können Debian-Entwickler diese Arbeit nicht erledigen.)
fr: D'un autre côté, un distributeur de CD-ROM pourra facilement vérifier la licence de chacun des paquets de la section <literal>non-free</literal> et les intégrer si cela lui est autorisé (dans la mesure où cela varie énormément d'un distributeur à l'autre, ce travail ne peut être fait par les développeurs Debian).
ja: その一方で、CD-ROMベンダは <literal>non-free</literal> 内のパッケージ群の個々のパッケージライセンスを簡単に確認でき、問題が無ければその多くを CD-ROM に含めることが出来ます。(これはベンダによって大いに異なるので、この作業は Debian 開発者にはできません)。

source: Note that the term section is also used to refer to categories which simplify the organization and browsing of available packages, e.g. <literal>admin</literal>, <literal>net</literal>, <literal>utils</literal> etc. Once upon a time, these sections (subsections, rather) existed in the form of subdirectories within the Debian archive. Nowadays, these exist only in the Section header fields of packages.
de: Beachten Sie, dass der Begriff Abschnitt auch im Bezug auf Kategorien benutzt wird, um die Organisation und das Durchstöbern verfügbarer Pakete zu vereinfachen, z.B. <literal>admin</literal>, <literal>net</literal>, <literal>utils</literal> etc. Diese Abschnitte (eher Unterabschnitte) existierten irgendwann einmal in der Form von Unterverzeichnissen innerhalb des Debian-Archivs. Heutzutage existieren sie nur noch in den »Section«-Kopfzeilenfeldern der Pakete.
fr: Le terme « section » est également utilisé pour faire référence aux catégories (par exemple <literal>admin</literal>, <literal>net</literal>, <literal>utils</literal> etc.), ce qui simplifie l'organisation des paquets disponibles et leur recherche. Il fut un temps où ces sections (ou plutôt sous-sections) existaient sous forme de sous-répertoires dans l'archive Debian. Maintenant, elles n'existent plus que dans le champ en-tête <literal>Section</literal> des paquets.
ja: セクションという用語は、利用可能なパッケージの構成や参照を簡単にしているカテゴリを指すことにも使われている点に注意ください。例えば、<literal>admin</literal>、<literal>net</literal>、<literal>utils</literal> などです。昔々、これらのセクション (むしろサブセクション) はDebian アーカイブ内のサブディレクトリとして存在していました。最近では、これらはパッケージのセクションヘッダにのみ存在しています。

source: In the first days, the Linux kernel was only available for Intel i386 (or greater) platforms, and so was Debian. But as Linux became more and more popular, the kernel was ported to other architectures and Debian started to support them. And as if supporting so much hardware was not enough, Debian decided to build some ports based on other Unix kernels, like <literal>hurd</literal> and <literal>kfreebsd</literal>.
de: In den Anfangstagen war der Linux-Kernel und somit Debian nur für die Intel-i386-Plattformen (oder höher) verfügbar. Aber als Linux zunehmend populärer wurde, wurde der Kernel auf andere Architekturen portiert und Debian begann diese zu unterstützen. Und als ob die Unterstüzung so vieler Hardware noch nicht genug wäre, entschied Debian, einige Portierungen zu erstellen, die auf anderen Unix-Kerneln beruhten, wie <literal>hurd</literal> und <literal>kfreebsd</literal>.
fr: À ses débuts, le noyau Linux existait seulement pour les architectures Intel i386 (et compatible) ; il en était de même pour Debian. Linux devenant de plus en plus populaire, le noyau a été porté vers d'autres architectures et Debian a commencé à les gérer. Comme si la gestion de nombreuses nouvelles architectures ne suffisait pas, Debian a décidé de construire des portages sur d'autres noyaux de type <literal>Unix</literal>, comme <literal>hurd</literal> et <literal>kfreebsd</literal>.
ja: はじめのうちは、Linux カーネルは Intel i386 (またはそれより新しい) プラットフォーム用のみが利用可能で、Debian も同様でした。しかし、Linux は日に日に広まり、カーネルも他のアーキテクチャへと移植され、そして Debian はそれらのサポートを始めました。そして、沢山のハードウェアをサポートするだけでは飽き足らず、Debian は <literal>hurd</literal> や <literal>kfreebsd</literal> のような他の Unix カーネルをベースにした移植版を作成することを決めました。

source: &debian-formal; 1.3 was only available as <literal>i386</literal>. Debian 2.0 shipped for <literal>i386</literal> and <literal>m68k</literal> architectures. Debian 2.1 shipped for the <literal>i386</literal>, <literal>m68k</literal>, <literal>alpha</literal>, and <literal>sparc</literal> architectures. Since then Debian has grown hugely. Debian 6 supports a total of nine Linux architectures (<literal>amd64</literal>, <literal>armel</literal>, <literal>i386</literal>, <literal>ia64</literal>, <literal>mips</literal>, <literal>mipsel</literal>, <literal>powerpc</literal>, <literal>s390</literal>, <literal>sparc</literal>) and two kFreeBSD architectures (<literal>kfreebsd-i386</literal> and <literal>kfreebsd-amd64</literal>).
de: &debian-formal; 1.3 war nur für <literal>i386</literal> verfügbar. Debian 2.0 wurde für die Architekturen <literal>i386</literal> und <literal>m68k</literal> ausgegeben. Debian 2.1 kam für die Architekturen <literal>i386</literal>, <literal>m68k</literal>, <literal>alpha</literal> und <literal>sparc</literal> daher. Seither ist Debian enorm gewachsen. Debian 6 unterstützt im Ganzen neun Architekturen: <literal>amd64</literal>, <literal>armel</literal>, <literal>i386</literal>, <literal>ia64</literal>, <literal>mips</literal>, <literal>mipsel</literal>, <literal>powerpc</literal>, <literal>s390</literal> und <literal>sparc</literal>) und zwei kFreeBSD-Architekturen (<literal>kfreebsd-i386</literal> und <literal>kfreebsd-amd64</literal>).
fr: &debian-formal; 1.3 était disponible uniquement pour <literal>i386</literal>. Debian 2.0 gérait les architectures <literal>i386</literal> and <literal>m68k</literal>. Debian 2.1 gérait les architectures <literal>i386</literal>, <literal>m68k</literal>, <literal>alpha</literal>, et <literal>sparc</literal>. Depuis, Debian a considérablement évolué. Debian 6 gère un total de neuf architectures Linux (<literal>amd64</literal>, <literal>armel</literal>, <literal>i386</literal>, <literal>ia64</literal>, <literal>mips</literal>, <literal>mipsel</literal>, <literal>powerpc</literal>, <literal>s390</literal> et <literal>sparc</literal>) et deux architectures kFreeBSD (<literal>kfreebsd-i386</literal> et <literal>kfreebsd-amd64</literal>).
ja: &debian-formal; 1.3 では <literal>i386</literal> のみが利用可能でした。Debian 2.0 では、<literal>i386</literal> と <literal>m68k</literal> アーキテクチャがリリースされました。Debian 2.1 では、<literal>i386</literal>、<literal>m68k</literal>、<literal>alpha</literal>、そして <literal>sparc</literal> アーキテクチャがリリースされました。そして、Debian は巨大に成長しました。Debian 6 は、合計 9 個の Linux アーキテクチャ (<literal>amd64</literal>, <literal>armel</literal>, <literal>i386</literal>, <literal>ia64</literal>, <literal>mips</literal>, <literal>mipsel</literal>, <literal>powerpc</literal>, <literal>s390</literal>, <literal>sparc</literal>、そして 2 つの kFreeBSD アーキテクチャ (<literal>kfreebsd-i386</literal> および <literal>kfreebsd-amd64</literal>) をサポートしています。

source: Information for developers and users about the specific ports are available at the <ulink url="&url-debian-ports;">Debian Ports web pages</ulink>.
de: Informationen für Entwickler und Anwender über die spezifischen Portierung sind auf der Debian Website <ulink url="&url-debian-ports;">Portierungen</ulink> verfügbar.
fr: Pour chaque portage, des informations destinées aux développeurs et utilisateurs sont disponibles sur les <ulink url="&url-debian-ports;">pages de portages Debian</ulink>.
ja: 特定の移植版についての開発者／ユーザへの情報は <ulink url="&url-debian-ports;">Debian 移植版のウェブページ</ulink>で入手可能です。

source: Packages
de: Pakete
fr: Paquets
ja: パッケージ

source: There are two types of Debian packages, namely <literal>source</literal> and <literal>binary</literal> packages.
de: Es gibt zwei Typen von Debian-Paketen, nämlich <literal>source</literal>- und <literal>binary</literal>-Pakete.
fr: Il existe deux types de paquets Debian : les paquets <literal>sources</literal> et les paquets <literal>binaires</literal>.
ja: Debian パッケージには２種類あります。<literal>ソース</literal>パッケージと<literal>バイナリ</literal>パッケージです。

source: Depending on the format of the source package, it will consist of one or more files in addition to the mandatory <filename>.dsc</filename> file:
de: Abhängig vom Format des Quellpakets wird es aus einem oder mehreren Dateien zusätzlich zur zwingend notwendigen <filename>.dsc</filename>-Datei bestehen:
fr: Suivant son format, le paquet source peut être constitué d'un ou plusieurs fichiers en plus du fichier obligatoire <filename>.dsc</filename> :
ja: フォーマットに応じて、ソースパッケージは必須の <filename>.dsc</filename> ファイルに加え、一つあるいはそれ以上のファイルから成り立ちます:

source: with format “1.0”, it has either a <filename>.tar.gz</filename> file or both an <filename>.orig.tar.gz</filename> and a <filename>.diff.gz</filename> file;
de: mit Format »1.0« hat es entweder eine <filename>.tar.gz</filename>-Datei oder sowohl eine <filename>.orig.tar.gz</filename>- als auch eine <filename>.diff.gz</filename>-Datei;
fr: soit un fichier <filename>.tar.gz</filename>, soit un fichier <filename>.orig.tar.gz</filename> et un fichier <filename>.diff.gz</filename> pour le format « 1.0 » ;
ja: フォーマット ”1.0”では、<filename>.tar.gz</filename> ファイルか、<filename>.orig.tar.gz</filename> ファイルと <filename>.diff.gz</filename> ファイルの二つを持っています。

source: with format “3.0 (quilt)”, it has a mandatory <filename>.orig.tar.{gz,bz2,xz}</filename> upstream tarball, multiple optional <filename>.orig-<replaceable>component</replaceable>.tar.{gz,bz2,xz}</filename> additional upstream tarballs and a mandatory <filename>debian.tar.{gz,bz2,xz}</filename> debian tarball;
de: mit Format »3.0« (quilt), hat es zwingend einen ursrünglichen Tarball mit der Endung <filename>.orig.tar.{gz,bz2,xz}</filename>, optional mehrere <filename>.orig-<replaceable>Komponente</replaceable>.tar.{gz,bz2,xz}</filename>-Debian-Tarbälle;
fr: obligatoirement l'archive amont <filename>.orig.tar.{gz,bz2,xz}</filename>, éventuellement plusieurs archives amont supplémentaires <filename>.orig-<replaceable>composant</replaceable>.tar.{gz,bz2,xz}</filename> et l'archive debian obligatoire <filename>debian.tar.{gz,bz2,xz}</filename> pour le format « 3.0 (quilt) » ;
ja: フォーマット“3.0 (quilt)”では、必須となる開発元の tarball である <filename>.orig.tar.{gz,bz2,xz}</filename>、それからオプションで、開発元の追加 tarball である <filename>.orig-<replaceable>component</replaceable>.tar.{gz,bz2,xz}</filename> をいくつか、そして必須の debian tarball、<filename>debian.tar.{gz,bz2,xz}</filename> です。
