Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: If you are interested in working in the MIA team, please have a look at the <filename>README</filename> file in <filename>/org/qa.debian.org/mia</filename> on <literal>qa.debian.org</literal> where the technical details and the MIA procedures are documented and contact &email-mia;.
de: Falls Sie Interesse an der Arbeit im MIA-Team haben, werfen Sie bitte einen Blick in die <filename>README</filename>-Datei in <filename>/org/qa.debian.org/mia</filename> auf <literal>qa.debian.org</literal>, wo die technischen Einzelheiten und MIA-Prozeduren dokumentiert sind und kontaktieren Sie &email-mia;.
fr: Si vous êtes intéressé pour travailler dans l'équipe MIA, veuillez étudier le fichier <filename>README</filename> dans <filename>/org/qa.debian.org/mia</filename> sur <literal>qa.debian.org</literal> où les détails techniques et les procédures MIA sont documentés et contactez &email-mia;.
ja: MIA チームで働くのに興味を持った場合は、技術上の詳細と MIA の手順が記載されている <literal>qa.debian.org</literal> 上の <filename>/org/qa.debian.org/mia</filename> 内の <filename>README</filename> ファイルを参照して、&email-mia; に連絡を取ってください。

source: Interacting with prospective Debian developers
de: Zusammenwirken mit zukünftigen Debian-Entwicklern
fr: Interaction avec de futurs développeurs Debian
ja: Debian 開発者候補に対応する

source: Debian's success depends on its ability to attract and retain new and talented volunteers. If you are an experienced developer, we recommend that you get involved with the process of bringing in new developers. This section describes how to help new prospective developers.
de: Debians Erfolg hängt von der Fähigkeit ab, neue und talentierte Entwickler für sich zu gewinnen und zu halten. Wenn Sie ein erfahrener Entwickler sind, wird Ihnen empfohlen, sich am Prozess, neue Entwickler heranzuziehen, zu beteiligen.
fr: Le succès de Debian dépend de sa faculté à attirer et conserver de nouveaux et talentueux volontaires. Si vous êtes un développeur expérimenté, nous vous recommandons de vous impliquer dans le processus pour devenir un nouveau responsable. Cette section décrit comment aider les futurs développeurs.
ja: Debian の成功は新たな才能あるボランティアをどう魅了し確保するかにかかっています。あなたが経験豊かな開発者なら、新たな開発者を呼び込むプロセスに関与するべきです。このセクションでは新たな開発者候補者をどうやって手助けするのかについて記述します。

source: Sponsoring packages
de: Pakete sponsoren
fr: Parrainage de paquets
ja: パッケージのスポンサーを行う

source: Sponsoring a package means uploading a package for a maintainer who is not able to do it on their own. It's not a trivial matter, the sponsor must verify the packaging and ensure that it is of the high level of quality that Debian strives to have.
de: Sponsoring eines Pakets bedeutet, ein Paket für einen Betreuer hochzuladen, der nicht in der Lage ist, dies selbst zu tun. Es ist keine belanglose Angelegenheit, der Sponsor muss die Paketierung überprüfen und dafür sorgen, dass sie auf der hohen Qualitätsstufe ist, die Debian anstrebt.
fr: Parrainer un paquet signifie envoyer un paquet pour un responsable qui n'est pas encore autorisé à le faire lui-même. Ce n'est pas une mince affaire, le parrain doit vérifier l'empaquetage et s'assurer qu'il respecte le haut niveau d'exigence qualité que Debian s'efforce de conserver.
ja: パッケージのスポンサーになるというのは、自分の権限ではパッケージをアップロードできないメンテナのためにパッケージをアップロードする、ということです。これは些細な問題ではなく、スポンサーはパッケージを精査して Debian が求めるような高いレベルの品質であることを保証する必要があります。

source: Debian Developers can sponsor packages. Debian Maintainers can't.
de: Debian-Entwickler können Pakete sponsoren. Debian-Betreuer können dies nicht.
fr: Les développeurs Debian peuvent parrainer des paquets, mais pas les mainteneurs Debian.
ja: Debian 開発者はパッケージをスポンサーできます。Debian メンテナはできません。

source: The maintainer prepares a source package (<filename>.dsc</filename>) and puts it online somewhere (like on <ulink url="http://mentors.debian.net/cgi-bin/welcome">mentors.debian.net</ulink>) or even better, provides a link to a public VCS repository (see <xref linkend="servers-vcs"/>) where the package is maintained.
de: Der Betreuer bereitet ein Quellpaket (<filename>.dsc</filename>) vor und legt es irgendwo online ab (wie auf <ulink url="http://mentors.debian.net/cgi-bin/welcome">mentors.debian.net</ulink>) oder stellt, was noch besser ist, einen Link zu einem öffentlichen VCS-Depot (siehe <xref linkend="servers-vcs"/>) bereit, wo das Paket verwaltet wird.
fr: le responsable prépare un paquet source (<filename>.dsc</filename>) et le met en ligne quelque part (sur <ulink url="http://mentors.debian.net/cgi-bin/welcome">mentors.debian.net</ulink> par exemple) ou, mieux encore, fournit un lien vers un dépôt de gestion de versions (consultez <xref linkend="servers-vcs"/>) où le paquet est maintenu ;
ja: メンテナはソースパッケージ (<filename>.dsc</filename>) を用意してオンライン上の何処か (例えば <ulink url="http://mentors.debian.net/cgi-bin/welcome">mentors.debian.net</ulink>) に置く、あるいはもっと良いのは、パッケージがメンテナンスされている公開 VCS リポジトリへのリンクを提供することです (<xref linkend="servers-vcs"/> 参照)。

source: The sponsor downloads (or checkouts) the source package.
de: Der Sponsor lädt das Paket herunter (oder checkt es aus).
fr: le parrain télécharge (ou extrait du dépôt) le paquet source ;
ja: スポンサーはソースパッケージをダウンロード (あるいはチェックアウト) します。

source: The sponsor reviews the source package. If they find issues, they inform the maintainer and ask them to provide a fixed version (the process starts over at step 1).
de: Der Sponsor prüft das Quellpaket. Falls er Probleme entdeckt, informiert er den Betreuer und bittet ihn, eine korrigierte Version bereitzustellen (der Prozess beginnt von vorn mit dem ersten Schritt).
fr: le parrain vérifie le paquet source. En cas de problème, il informe le responsable et lui demande de fournir une version corrigée (le processus reprend à la première étape) ;
ja: スポンサーはソースパッケージをレビューします。問題を見つけたら、メンテナに知らせて修正版をくれるように尋ねます (作業は step 1 へやり直しされます)。

source: The sponsor could not find any remaining problem. They build the package, sign it, and upload it to Debian.
de: Der Sponsor konnte kein verbliebenes Problem finden. Er erstellt das Paket, signiert es und lädt es zu Debian hoch.
fr: le parrain ne trouve plus aucun problème. Il construit le paquet, le signe, et l'envoie dans Debian.
ja: スポンサーは、何も問題が残っているのを見つけられませんでした。パッケージをビルドし、署名し、Debian へアップロードします。

source: The process of sponsoring a package is: <placeholder type="orderedlist" id="0"/>
de: Der Prozess, ein Paket zu sponsoren ist: <placeholder type="orderedlist" id="0"/>
fr: Le processus de parrainage d'un paquet est : <placeholder type="orderedlist" id="0"/>
ja: パッケージのスポンサー作業の流れは以下の通りです: <placeholder type="orderedlist" id="0"/>

source: Before delving in the details of how to sponsor a package, you should ask yourself whether adding the proposed package is beneficial to Debian.
de: Bevor Sie die Einzelheiten erforschen, wie ein Paket gesponsort wird, sollten Sie sich selbst fragen, ob das Hinzufügen des angebotenen Pakets einen Gewinn für Debian bedeuted.
fr: Avant de se plonger dans les détails du parrainage de paquet, vous devriez vous demander si l'ajout du paquet proposé est profitable à Debian.
ja: パッケージのスポンサーのやり方について詳細を詰める前に、提案されたパッケージを追加することが Debian にとって有益であるかどうか、自分自身に問いかける必要があります。

source: There's no simple rule to answer this question, it can depend on many factors: is the upstream codebase mature and not full of security holes? Are there pre-existing packages that can do the same task and how do they compare to this new package? Has the new package been requested by users and how large is the user base? How active are the upstream developers?
de: Es gibt keine einfache Regel, um diese Frage zu beantworten, sie kann von vielen Faktoren abhängen: Ist die Code-Basis der Originalautoren ausgereift und nicht voller Sicherheitslücken? Gibt es vorher existierende Pakete, die die gleiche Aufgabe erledigen können und wie sind diese im Vergleich zu diesem neuen Paket? Gab es für dieses neue Paket eine Nachfrage durch Anwender und wie groß ist die Benutzerbasis? Wie aktiv sind die Entwickler des Originals?
fr: Il n'y a pas de règle simple pour répondre à cette question, cela peut dépendre de plusieurs facteurs : le code source amont est-il suffisamment achevé et pas miné de trous de sécurité ? Existe-t-il déjà des paquets qui font la même chose et que donne la comparaison avec ce nouveau paquet ? Le paquet a-t-il été demandé par des utilisateurs et le nombre d'utilisateurs est-il significatif ? Les développeurs amont sont-ils actifs ?
ja: この質問に答えるのは単純ではなく、多くの要因に依っています: 開発元のコードは成熟していて、セキュリティホールの山ではないですか? 同じことができる既存パッケージがありませんか? そしてこの新しいパッケージと比べてどうですか? 新しいパッケージはユーザから要求されたものですか? そしてユーザ数はどの程度の大きさですか? 大本の開発者らはアクティブですか?

source: You should also ensure that the prospective maintainer is going to be a good maintainer. Do they already have some experience with other packages? If yes, are they doing a good job with them (check out some bugs)? Are they familiar with the package and its programming language? Do they have the skills needed for this package? If not, are they able to learn them?
de: Sie sollten außerdem sicherstellen, dass der zukünftige Betreuer ein guter Betreuer sein wird. Hat er bereits etwas Erfahrung mit anderen Paketen? Falls ja, leistet er bei ihnen gute Arbeit (überprüfen Sie einige Fehler)? Ist er vertraut mit dem Paket und dessen Programmiersprache? Verfügt er über die für dieses Paket nötigen Fähigkeiten? Falls nicht, ist er in der Lage sie zu erlernen?
fr: Vous devriez également vérifier que le futur responsable sera un bon responsable. A-t-il déjà de l'expérience avec d'autres paquets ? Si oui, réalise-t-il du bon travail avec ceux-ci (contrôlez quelques bogues) ? Est-il familier avec le paquet et son langage de programmation ? A-t-il les compétences nécessaires pour ce paquet ? Si non, est-il capable de les apprendre ?
ja: それから、メンテナ候補者が良いメンテナになるであろうことを保証する必要があります。他のパッケージでの経験がありますか? そうであれば、良い仕事をしていますか (バグを確認している)? パッケージと使われているプログラミング言語について詳しいですか? そのパッケージに必要なスキルを持っていますか? そうでなければ、学ぶことが可能でしょうか?

source: It's also a good idea to know where they stand with respect to Debian: do they agree with Debian's philosophy and do they intend to join Debian? Given how easy it is to become a Debian Maintainer, you might want to only sponsor people who plan to join. That way you know from the start that you won't have to act as a sponsor indefinitely.
de: Es ist außerdem eine gute Idee zu wissen, wie er Debian gegenübersteht: Stimmt er der Debian-Philosophie zu und beabsichtigt er Debian beizutreten? Angesichts dessen, wie einfach es ist, ein Debian-Betreuer zu werden, möchten Sie vielleicht nur Leute sponsoren, die planen beizutreten. Auf diese Art wissen Sie von Beginn an, dass Sie nicht auf unbestimmte Zeit als Sponsor agieren müssen.
fr: Il est aussi recommandé de connaître sa position par rapport à Debian : approuve-t-il la philosophie Debian et désire-t-il rejoindre Debian ? Vu comme il est facile de devenir mainteneur Debian, vous pourriez ne parrainer que des personnes ayant l'intention de rejoindre le projet. De cette façon, vous savez au départ que vous n'aurez pas a parrainer indéfiniment.
ja: 候補者が、Debian に対してどの様な態度を取っているかを知るのも良い考えです: Debian の哲学に賛同していて、Debian に参加したいと思っていますか? Debian メンテナになるのがどれくらい簡単なのかを考えて、参加を検討している人たちだけをスポンサーするのが良いでしょう。こうすれば、最初からずっとスポンサーとして行動しなくて良いと思っておけます。

source: Sponsoring a new package
de: Ein neues Paket sponsoren
fr: Parrainage d'un nouveau paquet
ja: 新しいパッケージのスポンサーを行う

source: New maintainers usually have certain difficulties creating Debian packages — this is quite understandable. They will do mistakes. That's why sponsoring a brand new package into Debian requires a thorough review of the Debian packaging. Sometimes several iterations will be needed until the package is good enough to be uploaded to Debian. Thus being a sponsor implies being a mentor.
de: Neue Betreuer haben gewöhnlich bestimmte Schwierigkeiten bei der Erstellung von Debian-Paketen — dies ist ziemlich verständlich. Das ist der Grund, weshalb das Sponsoring eines brandneuen Pakets in Debian, eine sorgfältige Überprüfung notwendig macht. Manchmal sind mehrere Wiederholungen nötig, bis das Paket gut genug ist, um zu Debian hochgeladen zu werden. Daher impliziert ein Sponsor zu sein, dass man ein Mentor ist.
fr: Les nouveaux responsables ont souvent quelques difficultés à créer des paquets Debian — ceci est bien compréhensible. Ils feront des erreurs. C'est pourquoi le parrainage d'un tout nouveau paquet dans Debian demande une inspection minutieuse de l'empaquetage. Parfois plusieurs itérations seront nécessaires avant que le paquet ne soit assez bon pour être envoyé dans Debian. Ainsi, être un parrain signifie être un mentor.
ja: 新たなメンテナは、Debian パッケージの作成する際に大抵何らかの困難に会いますーこれは非常に理解できることです。彼らは間違いを犯します。これは、全く新しいパッケージを Debian でスポンサーするのに、Debian パッケージングの徹底的なレビューを受ける必要がある根拠です。時折、パッケージが Debian へアップロードされるのに十分な状態になるまで、複数回のやり取りが必要になることがあります。それゆえ、スポンサーになることは、メンターになることを伴います。

source: Don't ever sponsor a new package without reviewing it. The review of new packages done by ftpmasters mainly ensures that the software is really free. Of course, it happens that they stumble on packaging problems but they really should not. It's your task to ensure that the uploaded package complies with the Debian Free Software Guidelines and is of good quality.
de: Sponsoren Sie ein Paket nie, ohne es zu überprüfen. Die Überprüfung eines neuen Pakets, die von den Ftpmasters vorgenommen wird, stellt nur sicher, dass die Software wirklich frei ist. Natürlich kommt es vor, dass sie über Paketierungsprobleme stolpern, aber sie sollten es wirklich nicht. Es ist Ihre Aufgabe dafür zu sorgen, dass das hochgeladene Paket mit den Richtlinien Debians für freie Software übereinstimmt und von guter Qualität ist.
fr: Ne parrainez jamais de paquet sans l'avoir vérifié. La vérification de nouveau paquet réalisée par les responsables de l'archive veille principalement à ce que le logiciel soit vraiment libre. Bien sûr, ils tombent parfois sur des problèmes d'empaquetage, mais ça ne devrait vraiment pas arriver. Il est de votre responsabilité de vérifier que le paquet envoyé est compatible avec les principes du logiciel libre selon Debian et qu'il est de bonne qualité.
ja: レビューをせずに新しいパッケージのスポンサーをしないでください。ftpmaster による新しいパッケージのレビューは、主にソフトウェアが本当にフリーなものであるかを確認するためです。もちろん、パッケージ化に関する問題に偶然気づくことはありますが、それを期待すべきではありません。アップロードされたパッケージが、Debian フリーソフトウェアガイドラインに適合し、良い品質であるのを保証するのは、あなたの仕事です。

source: You can find more checks in the wiki where several developers share their own <ulink url="http://wiki.debian.org/SponsorChecklist">sponsorship checklists</ulink>.
de: Sie können weitere Überprüfungen im Wiki finden, wo mehrere Entwickler ihre eigenen <ulink url="http://wiki.debian.org/SponsorChecklist">Sponsorschaft-Prüflisten</ulink> miteinander teilen.
fr: D'autres vérifications sont disponibles dans le wiki où plusieurs développeurs partagent leurs propres <ulink url="http://wiki.debian.org/SponsorChecklist">listes de contrôle</ulink>.
ja: もっと多くのチェック項目について、複数の開発者が持ち寄っている<ulink url="http://wiki.debian.org/SponsorChecklist">sponsorship checklists</ulink> で見ることができます。

source: Building the package and testing the software is part of the review, but it's also not enough. The rest of this section contains a non-exhaustive list of points to check in your review. <placeholder type="footnote" id="0"/>
de: Das Erstellen des Pakets und Prüfen der Software ist Teil der Überprüfung, aber es reicht nicht aus. Der Rest dieses Abschnitts enthält eine unvollständige Liste von Punkten, die Sie in Ihrer Überprüfung testen sollten. <placeholder type="footnote" id="0"/>
fr: La construction du paquet et l'essai du logiciel fait partie de la vérification, mais ça ne suffit pas. La suite de cette section est une liste non exhaustive de points à vérifier lors de votre contrôle. <placeholder type="footnote" id="0"/>
ja: パッケージをビルドし、ソフトウェアのテストを行うのはレビューの一部ではありますが、それだけでは十分ではありません。この章の残りの部分では、レビューでチェックするポイントの一覧を述べます (徹底的なものではありません)。<placeholder type="footnote" id="0"/>

source: Verify that the upstream tarball provided is the same that has been distributed by the upstream author (when the sources are repackaged for Debian, generate the modified tarball yourself).
de: Prüfen Sie, ob der bereitgestellte Original-Tarball derselbe ist, wie der, den der Originalautor verteilt (wenn die Quellen neu für Debian gepackt wurden, erstellen Sie selbst den geänderten Tarball).
fr: Vérifiez que l'archive source fournie est la même que celle distribuée par l'auteur amont (quand les sources ont été réempaquetées pour Debian, créez vous-même l'archive modifiée).
ja: upstream の tarball として提供されているものが、upstream の作者が配布しているものと同じかどうかを確認する (ソースが Debian 用に再パッケージされている場合、修正した tarball を自分自身で生成する)。

source: Run <command>lintian</command> (see <xref linkend="lintian"/>). It will catch many common problems. Be sure to verify that any <command>lintian</command> overrides setup by the maintainer is fully justified.
de: Führen Sie <command>lintian</command> aus (siehe <xref linkend="lintian"/>). Es wird viele häufige Probleme erwischen. Achten Sie darauf zu überprüfen, dass jegliche Einstellung, durch die der Betreuer <command>lintian</command> außer Kraft setzt, vollständig gerechtfertigt ist.
fr: Exécutez <command>lintian</command>. De nombreux problèmes usuels seront découverts. Prenez soin de vérifier que tous les contrôles de <command>lintian</command> ignorés par le responsable sont pleinement justifiés.
ja: <command>lintian</command> を実行する (<xref linkend="lintian"/> 参照)。多くの一般的な問題を見つけてくれます。<command>lintian</command> の overrides 設定がメンテナによって設定されている場合、完全に問題がないことを確認してください。

source: Run <command>licensecheck</command> (part of <xref linkend="devscripts"/>) and verify that <filename>debian/copyright</filename> seems correct and complete. Look for license problems (like files with “All rights reserved” headers, or with a non-DFSG compliant license). <command>grep -ri</command> is your friend for this task.
de: Führen Sie <command>licensecheck</command> aus (Teil von <xref linkend="devscripts"/>) und überprüfen Sie, ob <filename>debian/copyright</filename> korrekt und komplett zu sein scheint. Suchen Sie nach Lizenzproblemen (wie Dateien mit »All rights reserved«-Kopfzeilen oder nicht DFSG-konformen Lizenzen). Bei dieser Aufgabe ist <command>grep -ri</command> Ihr Freund.
fr: Exécutez <command>licensecheck</command> (qui fait partie de <xref linkend="devscripts"/>) et vérifiez que <filename>debian/copyright</filename> a l'air correct et exhaustif. Recherchez des problèmes de licence (comme des fichiers avec « All rights reserved », tous droits réservés, en en-tête, ou ayant une licence non compatible avec les principes du logiciel libre selon Debian). <command>grep -ri</command> peut vous aider ici.
ja: <command>licensecheck</command>(<xref linkend="devscripts"/> の一部) を実行し、<filename>debian/copyright</filename> が正しく、そして完全な事を確認する。ライセンス問題を探してください (頭に“All rights reserved”とあるファイルや、DFSG に適合しないライセンスがあるなど)。この作業には、<command>grep -ri</command> が助けとなることでしょう。

source: Build the package with <command>pbuilder</command> (or any similar tool, see <xref linkend="pbuilder"/>) to ensure that the build-dependencies are complete.
de: Erstellen Sie das Paket mit <command>pbuilder</command> (oder einem ähnlichen Werkzeug, siehe <xref linkend="pbuilder"/>), um sicherzustellen, dass die Build-Abhängigkeiten vollständig sind.
fr: Construisez le paquet avec <command>pbuilder</command> (ou n'importe quel outil du même genre, consultez <xref linkend="pbuilder"/>) pour vérifier que les dépendances de constructions sont exhaustives.
ja: ビルドの依存関係が完全であるのを保証するため、パッケージを <command>pbuilder</command> (やその他類似のツール) でビルドする (<xref linkend="pbuilder"/> 参照)。

source: Proofread <filename>debian/control</filename>: does it follow the best practices (see <xref linkend="bpp-debian-control"/>)? Are the dependencies complete?
de: Lesen Sie <filename>debian/control</filename> Korrektur: Folgt es den optimalen Vorgehensweisen (siehe <xref linkend="bpp-debian-control"/>)? Sind die Abhängigkeiten vollständig?
fr: Relisez <filename>debian/control</filename> : est-il conforme aux meilleures pratiques (consultez <xref linkend="bpp-debian-control"/>) ? Les dépendances sont elles exhaustives ?
ja: <filename>debian/control</filename> を査読する: ベストプラクティスに従っている? (<xref linkend="bpp-debian-control"/> 参照) 依存関係は完璧ですか?

source: Proofread <filename>debian/rules</filename>: does it follow the best practices (see <xref linkend="bpp-debian-rules"/>)? Do you see some possible improvements?
de: Lesen Sie <filename>debian/rules</filename> Korrektur: Folgt es den optimalen Vorgehensweisen (siehe <xref linkend="bpp-debian-rules"/>)? Können Sie mögliche Verbesserungen sehen?
fr: Relisez <filename>debian/rules</filename> : est-il conforme aux meilleures pratiques (consultez <xref linkend="bpp-debian-rules"/>) ? Pouvez-vous apporter quelques améliorations ?
ja: <filename>debian/rules</filename> を査読する: ベストプラクティスに従っている? 改善可能な点がある?

source: Proofread the maintainer scripts (<filename>preinst</filename>, <filename>postinst</filename>, <filename>prerm</filename>, <filename>postrm</filename>, <filename>config</filename>): will the <filename>preinst</filename>/<filename>postrm</filename> work when the dependencies are not installed? Are all the scripts idempotent (i.e. can you run them multiple times without consequences)?
de: Lesen Sie die Betreuerskripte (<filename>preinst</filename>, <filename>postinst</filename>, <filename>prerm</filename>, <filename>postrm</filename>, <filename>config</filename>) Korrektur: Werden <filename>preinst</filename>/<filename>postrm</filename> funktionieren, wenn die Abhängigkeiten nicht installiert sind? Sind alle Skripte idempotent (d.h. können Sie sie mehrmals ohne Konsequenzen ausführen)?
fr: Relisez les scripts du responsable (<filename>preinst</filename>, <filename>postinst</filename>, <filename>prerm</filename>, <filename>postrm</filename>, <filename>config</filename>) : est-ce que <filename>preinst</filename> et <filename>postrm</filename> fonctionneront quand les dépendances ne sont pas installées ? Est-que tous les scripts sont idempotents (c'est-à-dire peuvent-ils être exécutés plusieurs fois sans conséquences) ?
ja: メンテナスクリプト (<filename>preinst</filename>, <filename>postinst</filename>, <filename>prerm</filename>, <filename>postrm</filename>, <filename>config</filename>) を査読する: 依存関係がインストールされていない時でも動作する? 全てのスクリプトが等羃 (idempotent、すなわち、問題無しに複数回実行できる)?

source: Review any change to upstream files (either in <filename>.diff.gz</filename>, or in <filename>debian/patches/</filename> or directly embedded in the <filename>debian</filename> tarball for binary files). Are they justified? Are they properly documented (with <ulink url="&url-dep3;">DEP-3</ulink> for patches)?
de: Überprüfen Sie jede Änderung an Originaldateien (entweder in <filename>.diff.gz</filename>, in <filename>debian/patches/</filename> oder direkt in den Tarball <filename>debian</filename> für Binärdateien eingebettet). Sind sie gerechtfertigt? Sind sie ordentlich dokumentiert (mit <ulink url="&url-dep3;">DEP-3</ulink> für Patchs)?
fr: Vérifiez toutes les modifications des fichiers amont (dans <filename>.diff.gz</filename>, <filename>debian/patches/</filename> ou directement dans l'archive <filename>debian</filename> pour les fichiers binaires). Sont-elles justifiées ? Sont-elles correctement documentées (conformément à <ulink url="&url-dep3;">DEP-3</ulink> pour les correctifs) ?
ja: 開発元のファイルに対する変更 (<filename>.diff.gz</filename>、<filename>debian/patches/</filename>、あるいは直接 <filename>debian</filename> tarball に埋め込まれているバイナリファイル) をレビューする。十分な根拠がありますか? (パッチに対し、<ulink url="&url-dep3;">DEP-3</ulink> に沿って) 正しくドキュメント化されている?
