Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: According to <ulink url="&url-i18n-intro;">Introduction to i18n</ulink> from Tomohiro KUBOTA, I18N (internationalization) means modification of a software or related technologies so that a software can potentially handle multiple languages, customs, and so on in the world, while L10N (localization) means implementation of a specific language for an already internationalized software.
de: Gemäß der <ulink url="&url-i18n-intro;">Einführung in I18n</ulink> von Tomohiro KUBOTA bedeutet I18n (Internationalisierung) eine Veränderung von Software oder damit verbundenen Technologien, so dass eine Software potentiell mehrere Sprachen, Gewohnheiten und so weiter in der Welt handhaben kann, während L10n (Lokalisierung) die Implementierung einer speziellen Sprache für eine bereits internationalisierte Software bedeutet.
fr: Selon l'<ulink url="&url-i18n-intro;">introduction à l'i18n</ulink> de Tomohiro KUBOTA, « I18N (internationalisation) signifie la modification d'un logiciel ou des technologies liées pour qu'un logiciel puisse potentiellement gérer des langues multiples, des conventions multiples et ainsi de suite dans le monde entier » alors que « L10N (localisation) signifie l'implémentation dans une langue spécifique pour un logiciel déjà internationalisé ».
ja: 久保田智広さんによる <ulink url="&url-i18n-intro;">Introduction to i18n</ulink> によると、I18N (internationalization) はソフトウェアや関連する技術を調整し、ソフトウェアが複数の言語、習慣、その他世界の物事などを扱えるようにしておくことで、対して L10N (localization) は既に国際化されているソフトウェアに対して特定の言語を実装することを意味します。

source: l10n and i18n are interconnected, but the difficulties related to each of them are very different. It's not really difficult to allow a program to change the language in which texts are displayed based on user settings, but it is very time consuming to actually translate these messages. On the other hand, setting the character encoding is trivial, but adapting the code to use several character encodings is a really hard problem.
de: L10n und I18n sind miteinander verbunden, aber die Schwierigkeiten bezogen auf jeweils eines davon sind sehr unterschiedlich. Es ist nicht wirklich schwer, einem Programm das Wechseln der Sprache zu erlauben, in dem Texte basierend auf den Benutzereinstellungen angezeigt werden, aber es verschlingt viel Zeit, diese Nachrichten tatsächlich zu übersetzen. Andererseits ist es trivial, die Zeichencodierung einzustellen, aber den Code so anzupassen, dass mehrere Zeichencodierungen benutzt werden können, ist ein wirklich großes Problem.
fr: La l10n et l'i18n sont interconnectées, mais les difficultés liées à chacune sont très différentes. Il n'est pas vraiment difficile de permettre à un programme de changer la langue dans laquelle sont affichés les textes selon les paramètres de l'utilisateur, mais il est très coûteux en temps de traduire réellement ces messages. D'un autre côté, définir le codage des caractères est trivial, mais adapter le code pour utiliser des codages de caractères différents est un problème vraiment difficile.
ja: l10n と i18n は関連していますが、それぞれ関連する難しさについては違います。プログラムをユーザの設定に応じて表示されるテキストの言語を変更するようにするのはあまり難しくはありませんが、実際にメッセージを翻訳するのはとても時間がかかります。一方、文字のエンコード設定は些細な事ですが、複数の文字エンコードを扱えるようなコードにするのはとても難しい問題です。

source: Setting aside the i18n problems, where no general guideline can be given, there is actually no central infrastructure for l10n within Debian which could be compared to the buildd mechanism for porting. So most of the work has to be done manually.
de: Abgesehen von den I18n-Problemen, für die keine allgemeine Anleitung gegeben werden kann, gibt es tatsächlich keine Infrastruktur für L10n innerhalb Debian, die mit der Buildd-Mechanisus für die Portierung vergleichbar ist. Daher muss die meiste Arbeit manuell erledigt werden.
fr: En laissant de côté les problèmes d'i18n pour lesquels il n'existe pas de règle générale, il n'y a pas actuellement d'infrastructure centralisée pour la l10n dans Debian qui puisse être comparée au mécanisme <literal>buildd</literal> pour le portage. Le plus gros du travail doit donc être réalisé manuellement.
ja: i18n の問題を横においたとしても、一般的なガイドラインは与えられておらず、移植作業用の buildd のメカニズムと比較できるような、Debian での l10n 用の中心となるインフラは実際のところ存在していません。そのため、多くの作業は手動で行わねばなりません。

source: How translations are handled within Debian
de: Wie Übersetzungen in Debian gehandhabt werden
fr: Gestion des traductions au sein de Debian
ja: どの様にして Debian では翻訳が取り扱われているか

source: Handling translation of the texts contained in a package is still a manual task, and the process depends on the kind of text you want to see translated.
de: Die Handhabung der Übersetzung von Texten, die in Paketen enthalten sind, ist immer noch eine manuelle Aufgabe und der Prozess hängt von der Art des Textes ab, den Sie übersetzt sehen wollen.
fr: La gestion des traductions des textes contenus dans un paquet est encore une tâche manuelle et le processus dépend du type de texte que vous désirez voir traduit.
ja: パッケージに含まれている文章の翻訳の取り扱いは未だ手動であり、作業のやり方は翻訳を表示させたい文の種類に因ります。

source: For program messages, the gettext infrastructure is used most of the time. Most of the time, the translation is handled upstream within projects like the <ulink url="&url-l10n-tp;">Free Translation Project</ulink>, the <ulink url="&url-l10n-gnome;">Gnome translation Project</ulink> or the <ulink url="&url-l10n-kde;">KDE one</ulink>. The only centralized resource within Debian is the <ulink url="&url-l10n;">Central Debian translation statistics</ulink>, where you can find some statistics about the translation files found in the actual packages, but no real infrastructure to ease the translation process.
de: Für Programmausgaben wird meistens die Gettext-Infrastruktur benutzt. Meistens wird die Übersetzung außerhalb von Debian in Projekten wie dem <ulink url="&url-l10n-tp;">Free Translation Project</ulink>, dem <ulink url="&url-l10n-gnome;">Gnome translation Project</ulink> oder der <ulink url="&url-l10n-kde;">KDE Localization</ulink> behandelt. Die einzige zentrale Ressource innerhalb Debian ist die <ulink url="&url-l10n;">Zentrale Übersetzungsstatistik von Debian</ulink>, wo Sie einige Statistiken über die Übersetzungsdateien finden können, die in den tatsächlichen Paketen gefunden wurden, aber keine echte Infrastruktur, um den Übersetzungsprozess zu erleichtern.
fr: Pour les messages des programmes, l'infrastructure gettext est utilisée pour la plupart d'entre eux. La plupart du temps, la traduction est gérée en amont dans des projets comme le <ulink url="&url-l10n-tp;">projet de traduction libre</ulink>, le <ulink url="&url-l10n-gnome;">projet de traduction de Gnome</ulink> ou <ulink url="&url-l10n-kde;">celui de KDE</ulink>. La seule ressource centralisée dans Debian est le <ulink url="&url-l10n;">centre de traduction de Debian</ulink> où vous pouvez trouver des statistiques sur les fichiers de traduction trouvés dans les paquets, mais il n'y a aucune infrastructure pour faciliter le processus de traduction.
ja: プログラムのメッセージについては、ほとんどの場合 gettext という仕組みが使われています。多くの場合、翻訳は <ulink url="&url-l10n-tp;">Free Translation Project</ulink> や <ulink url="&url-l10n-gnome;">Gnome 翻訳プロジェクト</ulink>、<ulink url="&url-l10n-kde;/">KDE one</ulink> などの開発元 (upstream) のプロジェクトで取り扱われています。Debian で唯一の集約化された情報は <ulink url="&url-l10n;">Debian の翻訳に関する統計</ulink>で、実際のパッケージ内での翻訳ファイルの状況について確認できますが、翻訳作業を実際に容易にする仕組みではありません。

source: An effort to translate the package descriptions started long ago, even if very little support is offered by the tools to actually use them (i.e., only APT can use them, when configured correctly). Maintainers don't need to do anything special to support translated package descriptions; translators should use the <ulink url="&url-ddtp;">Debian Description Translation Project (DDTP)</ulink>.
de: Es wurde vor langer Zeit ein Versuch gestartet, die Paketbeschreibungen zu übersetzen, auch wenn sehr wenig Unterstützung von Werkzeugen angeboten wird, um sie zu benutzen (d.h. nur APT kann sie nutzen, wenn es korrekt konfiguriert ist). Betreuer müssen nichts besonderes tun, um übersetzte Paketbeschreibungen zu unterstützen. Übersetzer sollten das <ulink url="&url-ddtp;">Debian Description Translation Project (DDTP)</ulink> benutzen.
fr: Un effort pour traduire les descriptions de paquet a démarré il y a longtemps, même si les outils fournissent très peu de prise en charge pour les utiliser vraiment (seul APT peut les utiliser une fois configuré convenablement). Les responsables n'ont rien à faire de particulier pour gérer les traductions des descriptions de paquets ; les traducteurs devraient utiliser le <ulink url="&url-ddtp;">projet de traduction de descriptions de Debian (<literal>DDTP</literal>)</ulink>.
ja: パッケージ説明文の翻訳作業はかなり昔に始まりました―実際にそれを使うツールがほんの少ししか機能を提供していなかったとしても (つまり、APT だけが設定を正確に行ったときのみ利用できたのです)。メンテナはパッケージの説明文をサポートするのに何も特別なことをする必要はありません。翻訳者は <ulink url="&url-ddtp;">Debian Description Translation Project (DDTP)</ulink> を使う必要があります。

source: For <systemitem role="package">debconf</systemitem> templates, maintainers should use the <systemitem role="package">po-debconf</systemitem> package to ease the work of translators, who could use the DDTP to do their work (but the French and Brazilian teams don't). Some statistics can be found both on the <ulink url="&url-ddtp;">DDTP site</ulink> (about what is actually translated), and on the <ulink url="&url-l10n;">Central Debian translation statistics</ulink> site (about what is integrated in the packages).
de: Für <systemitem role="package">debconf</systemitem>-Schablonen sollten Paketbetreuer das Paket <systemitem role="package">po-debconf</systemitem> benutzen, um die Arbeit der Übersetzer zu erleichtern, die das DDTP für ihre Arbeit benutzen könnten. (Das französische und das brasilianische Team nutzen dies nicht.). Einige Statistiken können sowohl auf der <ulink url="&url-ddtp;">DDTP-Site</ulink> (über das, was tatsächlich übersetzt ist) als auch in der <ulink url="&url-l10n;">Zentralen Übersetzungsstatistik von Debian</ulink> (über das, was in die Pakete eingegliedert ist) gefunden werden.
fr: Pour les questionnaires <systemitem role="package">debconf</systemitem>, les responsables devraient utiliser le paquet <systemitem role="package">po-debconf</systemitem> pour faciliter le travail des traducteurs, qui peuvent utiliser le DDTP pour faire leur travail (mais les équipes française et brésilienne ne le font pas). Certaines statistiques sont disponibles à la fois sur le <ulink url="&url-ddtp;">site du DDTP</ulink> (à propos de ce qui est vraiment traduit) et sur le <ulink url="&url-l10n;">centre de traduction de Debian</ulink> (à propos de ce qui est intégré dans les paquets).
ja: <systemitem role="package">debconf</systemitem> テンプレートについては、メンテナは翻訳者の作業を容易にするため <systemitem role="package">po-debconf</systemitem> パッケージを使う必要があります。翻訳者は作業に DDTP を使うことが出来ます (フランスチームとブラジルチームは使っていませんが)。<ulink url="&url-ddtp;">DDTP のサイト</ulink> (実際に何が翻訳されているか) と <ulink url="&url-l10n;">Debian の翻訳に関する統計</ulink> サイト (パッケージに何が含まれているか) の双方で統計情報を得ることが出来ます。

source: For web pages, each l10n team has access to the relevant VCS, and the statistics are available from the Central Debian translation statistics site.
de: Für Webseiten hat jedes L10n-Team Zugriff auf das passende VCS und die Statistiken sind auf der Site bei der zentralen Übersetzungsstatistik von Debian verfügbar.
fr: Pour les pages web, chaque équipe l10n a accès au système de gestion de version correspondant et les statistiques sont disponibles sur le site des statistiques de traduction Debian centralisées.
ja: ウェブページについては、それぞれの l10n チームが対応する VCS にアクセスし、Debian の翻訳に関する統計サイトから統計情報が取得できます。

source: For general documentation about Debian, the process is more or less the same as for the web pages (the translators have access to the VCS), but there are no statistics pages.
de: Für allgemeine Dokumentation über Debian entspricht der Prozess mehr oder weniger dem der Webseiten (für Übersetzer, die Zugriff auf das VCS haben), aber es gibt dort keine Statistikseiten.
fr: Pour la documentation globale à propos de Debian, le processus est plus ou moins le même que pour les pages web (les traducteurs ont accès au système de gestion de version), mais il n'y a pas de page de statistiques.
ja: Debian についての一般的なドキュメントは、作業は多少の差はあれウェブページと同じです (翻訳者は VCS にアクセスします)。ですが、統計情報のページはありません。

source: For package-specific documentation (man pages, info documents, other formats), almost everything remains to be done.
de: Für paketspezifische Dokumentation (Handbuchseiten, Info-Dokumente, andere Formate) bleibt beinahe alles zu erledigen.
fr: Pour la documentation spécifique aux paquets (pages de manuel, documents info, autres formats), presque tout est encore à faire.
ja: パッケージ固有のドキュメント (man ページ、info ドキュメントその他) は、ほとんどすべてが手付かずです。

source: Most notably, the KDE project handles translation of its documentation in the same way as its program messages.
de: Insbesondere das KDE-Projekt handhabt die Übersetzung seiner Dokumentation auf die gleiche Art, wie die der Programmausgaben.
fr: En particulier, le projet KDE gère la traduction de ses documentations de la même façon que ses messages de programme.
ja: 特記しておくこととして、KDE プロジェクトはドキュメントの翻訳をプログラムのメッセージと同じやり方で取り扱っています。

source: There is an effort to handle Debian-specific man pages within a <ulink url="&url-cvsweb;manpages/?cvsroot=debian-doc">specific VCS repository</ulink>.
de: Es gibt einen Versuch, Debian-spezifische Handbuchseiten innerhalb eines <ulink url="&url-cvsweb;manpages/?cvsroot=debian-doc"> speziellen VCS-Depots</ulink> zu handhaben.
fr: Il existe un effort pour gérer les pages de manuel spécifiques à Debian au sein d'un <ulink url="&url-cvsweb;manpages/?cvsroot=debian-doc">système de gestion de version spécifique</ulink>.
ja: Debian 固有の man ページを <ulink url="&url-cvsweb;manpages/?cvsroot=debian-doc">特定の VCS リポジトリ</ulink> で取り扱おうという動きもあります。

source: I18N &amp; L10N FAQ for maintainers
de: I18N &amp; L10N FAQ für Paketbetreuer
fr: FAQ I18N et L10N pour les responsables
ja: メンテナへの I18N &amp; L10N FAQ

source: This is a list of problems that maintainers may face concerning i18n and l10n. While reading this, keep in mind that there is no real consensus on these points within Debian, and that this is only advice. If you have a better idea for a given problem, or if you disagree on some points, feel free to provide your feedback, so that this document can be enhanced.
de: Dies ist eine Liste von Problemen, denen Betreuer betreffend I18n und L10n gegenüberstehen. Behalten Sie während Sie dies lesen im Hinterkopf, dass es über diese Punkte innerhalb Debian keine Einigkeit gibt und dies nur ein Ratschlag ist. Falls Sie für die vorliegenden Probleme bessere Ideen haben oder mit einigen Punkten nicht einverstanden sind, tun Sie sich keinen Zwang an und geben Sie Ihre Rückmeldung, so dass dieses Dokument verbessert werden kann.
fr: Voici une liste des problèmes que les responsables peuvent rencontrer concernant l'i18n et la l10n. Lorsque vous lirez cela, gardez à l'esprit qu'il n'y a pas de consensus sur ces points au sein de Debian et que ce ne sont que des conseils. Si vous avez une meilleure idée pour un problème donné ou si vous êtes en désaccord avec certains points, vous êtes libre de fournir vos impressions pour que ce document puisse être amélioré.
ja: これはメンテナが i18n や l10n を考えるのにあたって直面するであろう問題の一覧です。読み進める間、Debian でこれらの点について実際のコンセンサスは得られていないことを念頭においてください。これは単にアドバイスです。出てきた問題についてもっと良い考えがある、あるいはいくかの点で賛同できないという場合は、連絡をして頂いて構いません。そのことによって、この文章の質をさらに高めることができます。

source: How to get a given text translated
de: Wie ein vorliegender Text übersetzt wird
fr: Comment faire en sorte qu'un texte soit traduit
ja: 翻訳された文章を得るには

source: To translate package descriptions or <systemitem role="package">debconf</systemitem> templates, you have nothing to do; the DDTP infrastructure will dispatch the material to translate to volunteers with no need for interaction from your part.
de: Um Paketbeschreibungen oder <systemitem role="package">debconf</systemitem>-Schablonen zu übersetzen, müssen Sie nichts tun. Die DDTP-Infrastruktur wird das zu übersetzende Material zu den Freiwilligen befördern ohne dass Sie eingreifen müssen.
fr: Pour traduire des descriptions de paquet ou des questionnaires <systemitem role="package">debconf</systemitem>, vous n'avez rien à faire, l'infrastructure du DDTP répartira le matériel à traduire aux volontaires sans besoin d'interaction de votre part.
ja: パッケージの説明文や <systemitem role="package">debconf</systemitem> テンプレートを翻訳してもらうには、あなたは何もする必要はありません。DDTP のインフラが作業者に翻訳してもらう素材を割り当てるのに、あなた側から働きかける必要はありません。

source: For all other material (gettext files, man pages, or other documentation), the best solution is to put your text somewhere on the Internet, and ask on debian-i18n for a translation in different languages. Some translation team members are subscribed to this list, and they will take care of the translation and of the reviewing process. Once they are done, you will get your translated document from them in your mailbox.
de: Für jegliches andere Material (Gettext-Dateien, Handbuchseiten oder andere Dokumentation) ist die beste Lösung, den Text irgendwo ins Internet zu stellen und auf Debian-I18n um eine Übersetzung in verschiedene Sprachen zu ersuchen. Die Mitglieder einiger Übersetzer-Teams haben diese Liste abonniert und werden für die Übersetzung und den Korrekturprozess sorgen. Sobald Sie das getan haben, können Sie Ihr übersetztes Dokument der Mailbox entnehmen.
fr: Pour tous les autres matériels (fichiers gettext, pages de manuel ou autre documentation), la meilleure solution est de placer votre texte quelque part sur l'Internet et de demander sur debian-i18n la traduction dans différentes langues. Certains membres des équipes de traduction sont abonnés à cette liste et ils prendront soin de la traduction et du processus de relecture. Quand ils auront fini, ils vous enverront le document traduit.
ja: 他の素材 (gettext ファイル、man ページ、その他のドキュメント) については、最も良い解決策は文章をインターネットのどこかに置いて、debian-i18n で他の言語へ翻訳を頼むことです。翻訳チームのメンバーの何名かはこのメーリングリストに登録しており、翻訳とレビュー作業を担当します。一旦作業が完了すれば、翻訳された文章があなたのメールボックスへと届くでしょう。

source: How to get a given translation reviewed
de: Wie eine vorliegende Übersetzung überprüft wird
fr: Comment faire en sorte qu'une traduction donnée soit relue
ja: どの様にして提供された翻訳をレビューするか

source: From time to time, individuals translate some texts in your package and will ask you for inclusion of the translation in the package. This can become problematic if you are not fluent in the given language. It is a good idea to send the document to the corresponding l10n mailing list, asking for a review. Once it has been done, you should feel more confident in the quality of the translation, and feel safe to include it in your package.
de: Von Zeit zu Zeit übersetzen Einzelpersonen einige Texte in Ihrem Paket und bitten Sie, die Übersetzung in das Paket aufzunehmen. Dies kann problematisch werden, falls Sie die vorliegende Sprache nicht fließend sprechen. Es ist eine gute Idee, das Dokument an die entsprechende L10n-Mailingliste zu senden und um eine Überprüfung zu bitten. Sobald dies erledigt ist, sollten Sie von der Qualität der Übersetzug überzeugt sein und sich sicherer fühlen sie in Ihr Paket einzubinden.
fr: De temps en temps, des personnes indépendantes traduiront certains textes inclus dans votre paquet et vous demanderont d'inclure la traduction dans le paquet. Cela peut devenir problématique si vous n'êtes pas familier avec la langue donnée. C'est une bonne idée d'envoyer le document à la liste de diffusion l10n correspondante en demandant une relecture. Une fois celle-ci faite, vous pourrez avoir une meilleure confiance en la qualité de la traduction et l'inclure sans crainte dans votre paquet.
ja: 時折、あなたのパッケージ内の文章を訳して翻訳をパッケージに含めるように依頼する人が出てきます。これはあなたがその言語に詳しくない場合、問題となり得ます。その文章を対応する l10n メーリングリストに投稿し、レビューを依頼するのが良い考えです。一旦レビューが終われば、翻訳の質に自信を持つでしょうし、パッケージに含めるのにも安心を覚えるでしょう。

source: How to get a given translation updated
de: Wie eine vorliegende Übersetzung aktualisiert wird
fr: Comment faire en sorte qu'une traduction donnée soit mise à jour
ja: どの様にして翻訳してもらった文章を更新するか

source: If you have some translations of a given text lying around, each time you update the original, you should ask the previous translator to update the translation with your new changes. Keep in mind that this task takes time; at least one week to get the update reviewed and all.
de: Falls Sie einige Übersetzungen eines vorliegendens Textes herumliegen haben, sollten Sie jedesmal, wenn Sie das Original aktualisieren, den letzten Übersetzer bitten die Übersetzung mit Ihren neuen Änderungen zu aktualisieren. Behalten Sie im Hinterkopf, dass diese Aufgabe Zeit beansprucht; mindestens eine Woche um die Aktualisierung zu überprufen und so.
fr: Si vous avez certaines traductions d'un texte donné qui traînent, chaque fois que vous mettez à jour l'original, vous devriez demander au précédent traducteur de mettre à jour sa traduction avec vos nouveaux changements. Gardez à l'esprit que cette tâche demande du temps ; au moins une semaine pour obtenir une mise à jour relue.
ja: 古いままになっていた文章に対して翻訳文がある場合、元の文章を更新する度に、以前翻訳した人に新たに変更した点に合わせて翻訳を更新してもらうように依頼する必要があります。この作業には時間がかかることを覚えておいてください―更新をレビューしてもらったりするには少なくとも1週間はかかります。

source: If the translator is unresponsive, you may ask for help on the corresponding l10n mailing list. If everything fails, don't forget to put a warning in the translated document, stating that the translation is somehow outdated, and that the reader should refer to the original document if possible.
de: Falls der Übersetzer nicht reagiert, könnten Sie auf der entsprechenden L10n-Mailingliste um Hilfe ersuchen. Falls alles scheitert, vergessen Sie nicht, eine Warnung im übersetzten Dokument zu hinterlassen, die angibt, dass die Übersetzung veraltet ist und der Leser sich, wenn möglich, auf das Originaldokument beziehen sollte.
fr: Si le traducteur ne répond pas, vous pouvez demander de l'aide sur la liste de diffusion correspondante. Si tout échoue, n'oubliez pas de mettre un avertissement dans le document traduit, indiquant que la traduction est un peu obsolète et que le lecteur devrait se référer au document d'origine si possible.
ja: 翻訳者が応答してこない場合、対応する l10n メーリングリストに助力を願い出ましょう。すべてうまくいかなかった場合は、翻訳した文中に翻訳がとにかく古い事の警告を入れておくの忘れないようにして、できれば読者がオリジナルの文章を参照するようにしましょう。

source: Avoid removing a translation completely because it is outdated. Old documentation is often better than no documentation at all for non-English speakers.
de: Vermeiden Sie es, eine Übersetzung vollständig zu entfernen, weil sie veraltet ist. Alte Dokumentation ist für Leute, die kein Englisch reden, oft besser als gar keine Dokumentation
fr: Évitez de supprimer complètement une traduction à cause de son obsolescence. Un vieux document est souvent mieux que pas de documentation du tout pour les personnes non anglophones.
ja: 古くなっているからといって翻訳を全て削除するのは避けてください。非英語圏のユーザにとって何もドキュメントが無いよりは古いドキュメントがある方が有益であることが往々にしてあります。

source: How to handle a bug report concerning a translation
de: Wie Fehlerberichte gehandhabt werden, die eine Übersetzung betreffen
fr: Comment gérer un rapport de bogue concernant une traduction
ja: どの様にして翻訳関連のバグ報告を取り扱うか

source: The best solution may be to mark the bug as forwarded to upstream, and forward it to both the previous translator and their team (using the corresponding debian-l10n-XXX mailing list).
de: Möglicherweise ist die beste Lösung, den Fehler als zu den Originalautoren weitergeleitet zu kennzeichnen und ihn sowohl an den letzten Übersetzer als auch an sein Team zu senden (unter Benutzung der entsprechenden debian-l10n-XXX-Mailingliste).
fr: La meilleure solution peut être de marquer le bogue comme transmis au développeur amont (« <literal>forwarded</literal> ») et de faire suivre le bogue à la fois au précédent traducteur et à son équipe (en utilisant la liste de diffusion debian-l10n-XXX correspondante).
ja: 最も良い解決策は開発元のバグという印を付けておいて (forward)、以前の翻訳者と関連するチーム (対応する debian-l10n-XXX メーリングリスト) に転送することです。
