Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: This special field allow translators to put the most appropriate choice according to their own language. It will become the default choice when their language is used while your own mentioned Default Choice will be used when using English.
de: Dieses Spezialfeld ermöglicht Übersetzern, die am Besten zu ihrer Sprache passende Auswahl zu nehmen. Es wird die vorgegebene Auswahl sein, wenn ihre Sprache benutzt wird, während Ihre eigene erwähnte »Default Choice« benutzt wird, wenn Sie Englisch benutzen.
fr: Ce champ spécial permet aux traducteurs de mettre le choix le plus adapté à leur langue, qui deviendra le choix par défaut quand cette langue est utilisée, alors que le choix par défaut que vous avez mentionné sera utilisé en anglais.
ja: この特別なフィールドによって、翻訳作業者は言語に応じたもっとも適切な選択肢を挿入することができるようになります。彼らの言語が選択された場合にデフォルトの選択になりますが、英語を使うときには最初に提示された Default Choice が使われます。

source: Example, taken from the geneweb package templates:
de: Ein Beispiel aus den Schablonen des Pakets Geneweb:
fr: Exemple, pris dans le paquet geneweb :
ja: geneweb パッケージのテンプレートを例にとってみましょう:

source: Note the use of brackets which allow internal comments in debconf fields. Also note the use of comments which will show up in files the translators will work with.
de: Beachten Sie, dass die Benutzung von Klammern Kommentare in Debconf-Feldern erlaubt. Beachten Sie außerdem, dass die Benutzung von Kommentaren in Dateien zu sehen sein wird, mit denen Übersetzer arbeiten.
fr: Veuillez noter l'utilisation de crochets pour autoriser des commentaires internes dans les champs de <systemitem role="package">debconf</systemitem>. Notez également l'utilisation de commentaires qui apparaîtront dans les fichiers de travail des traducteurs.
ja: ブラケットを使うと、debconf のフィールド中に内部コメントができることに注意してください。コメントの利用は、翻訳作業者が作業するファイルに表示されるのにも注意ください。

source: The comments are needed as the _Default trick is a bit confusing: the translators may put their own choice
de: Die Kommentare werden benötigt, da der _Default-Trick etwas verwirrendes ist: Die Übersetzer könnten ihre eigene Auswahl nehmen.
fr: Les commentaires sont très utiles car l'astuce « <literal>_Default</literal> » est parfois déroutante pour les traducteurs qui doivent y mettre leur propre choix et non une simple traduction.
ja: _Default を使うやり方は、若干混乱するのでコメントが必要です: 翻訳者は自身の選択肢を書きます。

source: Do NOT use empty default field. If you don't want to use default values, do not use Default at all.
de: Benutzen Sie KEIN leeres »Default«-Feld. Falls Sie keine Vorgabewerte benutzen möchten, benutzen Sie Default überhaupt nicht.
fr: N'utilisez <emphasis role="strong">pas</emphasis> de champ <literal>Default</literal> vide. Si vous ne souhaitez pas avoir de valeur par défaut, n'utilisez pas du tout ce champ.
ja: 空のデフォルトフィールドを使っては「いけません」。デフォルト値を設定したくないのであれば、Default は使うべきではありません。

source: If you use po-debconf (and you <emphasis role="strong">should</emphasis>, see <xref linkend="s6.5.2.2"/>), consider making this field translatable, if you think it may be translated.
de: Falls Sie Po-debconf benutzen (und das <emphasis role="strong">sollten </emphasis> Sie, lesen Sie <xref linkend="s6.5.2.2"/>), erwägen Sie, dieses Feld übersetzbar zu machen, wenn Sie der Meinung sind, es könnte übersetzt werden.
fr: Quand vous utilisez <systemitem role="package">po-debconf</systemitem>, (et vous <emphasis role="strong">devriez</emphasis>, voir <xref linkend="s6.5.2.2"/>), veuillez rendre ce champ traduisible si vous pensez qu'il peut l'être.
ja: po-debconf を使うのであれば (そして <emphasis role="strong">使うべき</emphasis> です、<xref linkend="s6.5.2.2"/> 参照)、このフィールドが翻訳できるのであれば、翻訳可能な状態にするのを検討しましょう。

source: If the default value may vary depending on language/country (for instance the default value for a language choice), consider using the special _Default type documented in <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>.
de: Falls der Vorgabewert von Sprache oder Land abhängen könnte (zum Beispiel, weil es sich bei der Auswahl um eine Sprachauswahl handelt), ziehen Sie in Betracht, den Typ _Default zu benutzen, der in <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> dokumentiert wird.
fr: Si la valeur par défaut peut dépendre de la langue ou du pays (par exemple une langue par défaut dans un programme), pensez à utiliser le type « <literal>_Default</literal> » documenté dans la page de manuel <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>.
ja: (例えば言語選択のデフォルト値など) デフォルト値が言語／地域に応じて変化するようであれば 、<citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> に記載されている特別な _Default 型を使うことを考えましょう。

source: Internationalization
de: Internationalisierung
fr: Internationalisation
ja: 国際化

source: This section contains global information for developers to make translators' life easier. More information for translators and developers interested in internationalization are available in the <ulink url="&url-i18n-l10n;">Internationalisation and localisation in Debian</ulink> documentation.
de: Der zweite Abschnitt enthält globale Informationen für Entwickler, um Übersetzern das Leben leichter zu machen. Weitere Informationen für Übersetzer und Entwickler, die sich für Internationalisierung interessieren, sind in der Dokumentation <ulink url="&url-i18n-l10n;">Internationalisierung und Lokalisierung</ulink> verfügbar.
fr: Cette section fournit des informations générales à destination des développeurs pour simplifier la vie des traducteurs. Vous trouverez plus d'informations à destination des traducteurs et développeurs intéressés par l'internationalisation dans la documentation sur l'<ulink url="&url-i18n-l10n;">internationalisation et la localisation dans Debian</ulink>.
ja: この章では、開発者に対して、翻訳作業者の作業がより楽になるようにするための大まかな情報を含めています。国際化について興味を持っている翻訳作業者と開発者への詳細な情報は、<ulink url="&url-i18n-l10n;">Internationalisation and localisation in Debian</ulink> で入手できます。

source: Handling debconf translations
de: Handhabung von Debconf-Übersetzungen
fr: Gestion des traductions <systemitem role="package">debconf</systemitem>
ja: debconf の翻訳を取り扱う

source: Like porters, translators have a difficult task. They work on many packages and must collaborate with many different maintainers. Moreover, most of the time, they are not native English speakers, so you may need to be particularly patient with them.
de: Wie Portierende haben auch Übersetzer noch andere Aufgaben. Sie arbeiten an vielen Paketen und müssen mit vielen verschiedenen Paketbetreuern zusammenwirken. Außerdem ist Englisch meist nicht ihre Muttersprache. Sie sollten ihnen daher besondere Geduld entgegenbringen.
fr: Comme les porteurs, les traducteurs ont une tâche difficile. Ils travaillent sur de nombreux paquets et doivent collaborer avec de nombreux responsables. De plus, ils n'ont généralement pas la langue anglaise comme langue maternelle et vous devez donc faire preuve d'une patience particulière avec eux.
ja: 移植作業者同様に、翻訳作業者は難しい課題を抱えています。多くのパッケージについて作業を行い、多くの異なったメンテナと共同作業をする必要があります。さらには、ほとんどの場合、彼らはネイティブな英語話者ではないので、あなたは特に忍耐強くあらねばいけないでしょう。

source: The goal of <systemitem role="package">debconf</systemitem> was to make packages configuration easier for maintainers and for users. Originally, translation of debconf templates was handled with <command>debconf-mergetemplate</command>. However, that technique is now deprecated; the best way to accomplish <systemitem role="package">debconf</systemitem> internationalization is by using the <systemitem role="package">po-debconf</systemitem> package. This method is easier both for maintainer and translators; transition scripts are provided.
de: Das Ziel von <systemitem role="package">debconf</systemitem> war die Vereinfachung der Paketkonfiguration für Betreuer und Anwender. Ursprünglich wurde die Übersetzung von Debconf-Schablonen mit <command>debconf-mergetemplate</command> gehandhabt. Nun wird diese Technik jedoch missbilligt. Die Internationalisierung von <systemitem role="package">debconf</systemitem> ist am besten mit dem Paket <systemitem role="package">po-debconf</systemitem> zu erreichen. Diese Methode ist sowohl für Betreuer als auch für Übersetzer einfacher. Es werden Umwandlungsskripte bereitgestellt.
fr: L'objectif de <systemitem role="package">debconf</systemitem> est de rendre la configuration des paquets plus facile pour les responsables de paquets et pour les utilisateurs. Initialement, la traduction des écrans de debconf était gérée avec <command>debconf-mergetemplate</command>. Cependant, cette technique est désormais obsolète et la meilleure façon d'internationaliser <systemitem role="package">debconf</systemitem> est d'utiliser le paquet <systemitem role="package">po-debconf</systemitem>. Cette méthode simplifie le travail des traducteurs et des responsables et des scripts de transition sont fournis.
ja: <systemitem role="package">debconf</systemitem> のゴールはメンテナとユーザにとってパッケージ設定を簡単にすることでした。元々、debconf テンプレートの翻訳は<command>debconf-mergetemplate</command> で行われていました。しかし、このやり方は現在は非推奨 (deprecated) です; <systemitem role="package">debconf</systemitem> の国際化を成し遂げる最も良いやり方は、<systemitem role="package">po-debconf</systemitem> パッケージを使うことです。このやり方はメンテナと翻訳者の双方にとって、より楽なやり方です; 移行スクリプトが提供されています。

source: Using <systemitem role="package">po-debconf</systemitem>, the translation is stored in <filename>.po</filename> files (drawing from <command>gettext</command> translation techniques). Special template files contain the original messages and mark which fields are translatable. When you change the value of a translatable field, by calling <command>debconf-updatepo</command>, the translation is marked as needing attention from the translators. Then, at build time, the <command>dh_installdebconf</command> program takes care of all the needed magic to add the template along with the up-to-date translations into the binary packages. Refer to the <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> manual page for details.
de: Wenn <systemitem role="package">po-debconf</systemitem> benutzt wird, werden sie Übersetzungen in <filename>.po</filename>-Dateien gespeichert (mit <command>gettext</command>-Übersetzungstechniken herausgezogen). Spezielle Schablonendateien enthalten die Originalnachrichten und markieren, welche Felder übersetzbar sind. Wenn Sie den Wert eines übersetzbaren Feldes durch Aufruf von <command>debconf-updatepo</command> ändern, wird die Übersetzung für Übersetzerals aufmerksamkeitsbedürfend gekennzeichnet. Dann, zur Build-Zeit, wird das Programm <command>dh_installdebconf</command> wie von Zauberhand dafür sorgen, dass alle Schablonen zusammen mit den aktuellen Übersetzungen in die Binärpakete einfließen. Weitere Einzelheiten können Sie der Handbuchseite <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> entnehmen.
fr: Avec <systemitem role="package">po-debconf</systemitem>, les traductions sont gérées dans des fichiers <filename>.po</filename> (hérités des techniques de traduction utilisées avec <command>gettext</command>). Des fichiers modèles contiennent les messages d'origine et les champs à traduire y sont marqués spécifiquement. Lorsque le contenu d'un champ traduisible est modifié, l'emploi de la commande <command>debconf-updatepo</command> permet d'indiquer que la traduction a besoin d'une mise à jour par les traducteurs. Ensuite, au moment de la construction du paquet, le programme <command>dh_installdebconf</command> s'occupe des opérations nécessaires pour ajouter le modèle avec les traductions à jour dans les paquets binaires. Vous pouvez consulter la page de manuel de <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> pour plus d'informations.
ja: <systemitem role="package">po-debconf</systemitem> を使うと、翻訳は <filename>.po</filename> ファイルに収められます (<command>gettext</command> による翻訳技術からの引き出しです)。特別なテンプレートファイルには、元の文章と、どのフィールドが翻訳可能かがマークされています。翻訳可能なフィールドの値を変更すると、<command>debconf-updatepo</command> を呼び出すことで、翻訳作業者の注意が必要なように翻訳にマークがされます。そして、生成時には <command>dh_installdebconf</command> プログラムが、テンプレートに加え、最新の翻訳をバイナリパッケージに追加するのに必要となる魔法について、すべての面倒を見ます。詳細は <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> マニュアルページを参照してください。

source: Internationalized documentation
de: Internationalisierte Dokumentation
fr: Documentation internationalisée
ja: ドキュメントの国際化

source: Internationalizing documentation is crucial for users, but a lot of labor. There's no way to eliminate all that work, but you can make things easier for translators.
de: Internationalisierte Dokumentation für Anwender ist wichtig, bereitet aber viel Mühe. Es gibt keine Möglichkeit, all diese Arbeit zu beseitigen, aber Sie können den Übersetzern einige Dinge erleichtern.
fr: L'internationalisation de la documentation est primordiale pour les utilisateurs mais représente un travail très important. Même s'il n'est pas possible de supprimer tout le travail nécessaire, il est possible de faciliter la tâche des traducteurs.
ja: ドキュメントの国際化はユーザにとって極めて重要ですが、多くの労力がかかります。この作業をすべて除去する方法はありませんが、翻訳作業者を気楽にはできます。

source: If you maintain documentation of any size, it is easier for translators if they have access to a source control system. That lets translators see the differences between two versions of the documentation, so, for instance, they can see what needs to be retranslated. It is recommended that the translated documentation maintain a note about what source control revision the translation is based on. An interesting system is provided by <ulink url="&url-i18n-doc-check;">doc-check</ulink> in the <systemitem role="package">debian-installer</systemitem> package, which shows an overview of the translation status for any given language, using structured comments for the current revision of the file to be translated and, for a translated file, the revision of the original file the translation is based on. You might wish to adapt and provide that in your VCS area.
de: Falls Sie Dokumentationen in irgendwelchem Umfang betreuen, ist es für Übersetzer einfacher, wenn Sie Zugriff auf das Versionsverwaltungssystem haben. Dadurch können Übersetzer die Unterschiede zwischen zwei Versionen der Dokumentation anschauen, so dass sie beispielsweise sehen können, was neu übersetzt werden muss. Es wird empfohlen, dass die übersetzte Dokumentation eine Notiz darüber bereithält, auf welcher Revision der Quellenverwaltung die Übersetzung basiert. Ein interessantes System wird von <ulink url="&url-i18n-doc-check;">doc-check</ulink> aus dem <systemitem role="package">debian-installer</systemitem>-Paket bereitgestellt, das eine Übersicht über den Übersetzungsstatus für eine angegebene Sprache anzeigt. Dazu werden strukturierte Kommentare für die aktuelle Revision der zu übersetzenden Datei und für eine übersetzte Datei die Revision des Originals auf der die Übersetzung basiert, angezeigt. Möglicherweise möchten Sie dies anpassen und in Ihrem VCS-Bereich bereitstellen.
fr: Si vous maintenez une documentation de quelque taille que ce soit, il sera plus pratique pour les traducteurs d'avoir accès au système de suivi des versions source. Cela leur permet de voir les différences entre deux versions de la documentation et, par conséquent, de mieux voir où les traductions doivent être modifiées. Il est recommandé que la documentation traduite contienne l'indication du système de suivi des versions source qui est utilisé. Un système pratique est fourni par <ulink url="&url-i18n-doc-check;">doc-check</ulink> du paquet <systemitem role="package">debian-installer</systemitem>, qui permet un survol de l'état de la traduction pour toute langue, par l'utilisation de commentaires structurés dans la version du fichier à traduire et, pour le fichier traduit, la version du fichier sur laquelle est basée la traduction. Il est possible d'adapter ce système dans votre propre dépôt de gestion de version.
ja: どのようなサイズであれドキュメントをメンテナンスしている場合、翻訳作業者がソースコントロールシステムにアクセスできるのであれば、彼らの作業が楽になるでしょう。翻訳作業者が、ドキュメントの 2 つのバージョン間の違いを見ることができるので、例えば、何を再翻訳すればいいのかがわかるようになります。翻訳されたドキュメントは、翻訳作業がどのソースコントロールリビジョンをベースにしているのかという記録を保持しておくことをお勧めします。<systemitem role="package">debian-installer</systemitem> パッケージ中の <ulink url="&url-i18n-doc-check;">doc-check</ulink> では興味深いシステムが提供されています。これは、翻訳すべき現在のリビジョンのファイルに対する構造化されているコメントを使って、指定されたあらゆる言語の翻訳状況の概要を表示し、翻訳されたファイルについては、翻訳がベースにしているオリジナルのファイルのリビジョンを表示します。自分の VCS 領域でこれを導入して利用した方が良いでしょう。

source: If you maintain XML or SGML documentation, we suggest that you isolate any language-independent information and define those as entities in a separate file which is included by all the different translations. This makes it much easier, for instance, to keep URLs up to date across multiple files.
de: Falls Sie XML- oder SGML-Dokumentationen betreuen, wird geraten, dass Sie jegliche sprachabhängigen Informationen isolieren und diese als Instanzen in einer separaten Datei definieren, die in allen verschiedenen Übersetzungen enthalten ist. Dies macht es beispielsweise viel einfacher, URLs über mehrere Dateien hinweg aktuell zu halten.
fr: Si vous maintenez de la documentation en format XML ou SGML, il est conseillé d'isoler l'information indépendante de la langue et de la définir sous forme d'entités dans un fichier à part qui sera inclus par toutes les traductions. Cela rend par exemple plus simple la maintenance d'URL dans de nombreux fichiers.
ja: XML あるいは SGML のドキュメントをメンテナンスしているのであれば、言語非依存の情報を分離し、それらをすべての異なった翻訳に含まれる分割されたファイルにエンティティとして定義した方が良いでしょう。これは、URL を複数のファイル間で最新に保つなど、作業をより楽にしてくれます。

source: Some tools (e.g. <systemitem role="package">po4a</systemitem>, <systemitem role="package">poxml</systemitem>, or the <systemitem role="package">translate-toolkit</systemitem>) are specialized in extracting the translatable material from different formats. They produce PO files, a format quite common to translators, which permits to see what needs to be retranslated when the translated document is updated.
de: Einige Werkzeuge (z.B. <systemitem role="package">po4a</systemitem>, <systemitem role="package">poxml</systemitem> oder <systemitem role="package">translate-toolkit</systemitem>) sind darauf spezialisiert, übersetzbares Material aus verschiedenen Formaten zu extrahieren. Sie erstellen PO-Dateien, ein für Übersetzer ziemlich häufiges Format, das eine Übersicht darüber gibt, was übersetzt werden muss, wenn das übersetzte Dokument aktualisiert wurde.
fr: Certains outils (par exemple <systemitem role="package">po4a</systemitem>, <systemitem role="package">poxml</systemitem>, ou <systemitem role="package">translate-toolkit</systemitem>) sont spécialisés dans l'extraction des composants traduisibles depuis différents formats. Ils fabriquent des fichiers PO (un format plutôt habituel pour les traducteurs), qui permettent de voir les traductions à mettre à jour quand le document a été modifié.
ja: いくつかのツール (例: <systemitem role="package">po4a</systemitem>、<systemitem role="package">poxml</systemitem>、<systemitem role="package">translate-toolkit</systemitem>) は異なった形式から翻訳可能な素材を展開するのに特化しています。これらは、翻訳作業者には極めて馴染み深い形式である PO ファイルを生成します。これによって、翻訳したドキュメントが更新された際に何を再翻訳すればよいのかを見ることを可能にしてくれます。

source: Common packaging situations
de: Übliche Paketierungssituationen
fr: Situations courantes de gestion de paquets
ja: パッケージ化に於ける一般的なシチュエーション

source: Packages using <command>autoconf</command>/<command>automake</command>
de: Pakete benutzen <command>autoconf</command>/<command>automake</command>
fr: Paquets utilisant <command>autoconf</command> ou <command>automake</command>
ja: <command>autoconf</command>/<command>automake</command> を使っているパッケージ

source: Keeping <command>autoconf</command>'s <filename>config.sub</filename> and <filename>config.guess</filename> files up to date is critical for porters, especially on more volatile architectures. Some very good packaging practices for any package using <command>autoconf</command> and/or <command>automake</command> have been synthesized in &file-bpp-autotools; from the <systemitem role="package">autotools-dev</systemitem> package. You're strongly encouraged to read this file and to follow the given recommendations.
de: Die Dateien <filename>config.sub</filename> und <filename>config.guess</filename> von <command>autoconf</command> aktuell zu halten ist für Portierende kritisch, insbesondere auf eher unbeständigen Architekturen. Einige sehr gute Paketierungsvorgehensweisen für irgendwelche Pakete, die <command>autoconf</command> und/oder <command>automake</command> benutzen, wurden in &file-bpp-autotools; aus dem Paket <systemitem role="package">autotools-dev</systemitem> zusammengefasst. Es wird eindringlich geraten, diese Datei und die folgenden Empfehlungen zu lesen.
fr: Pouvoir disposer de fichiers <filename>config.sub</filename> et <filename>config.guess</filename> à jour est un point critique pour les porteurs, particulièrement pour les architectures assez volatiles. De très bonnes pratiques applicables à tout paquet qui utilise <command>autoconf</command> ou <command>automake</command> ont été résumées dans &file-bpp-autotools; du paquet <systemitem role="package">autotools-dev</systemitem>. Il est fortement recommandé de lire ce fichier et d'en suivre les recommandations.
ja: <command>autoconf</command> の <filename>config.sub</filename> および <filename>config.guess</filename> を最新に保ちつづけるのは、移植作業者、特により移行中の状況であるアーキテクチャの移植作業者にとって非常に重要です。<command>autoconf</command> や <command>automake</command> を使うあらゆるパッケージについてのとても素晴らしいパッケージ化における教訓が <systemitem role="package">autotools-dev</systemitem> パッケージの &file-bpp-autotools; にまとめられています。このファイルを読んで書かれている推奨に従うことを強くお勧めします。

source: Libraries
de: Bibliotheken
fr: Bibliothèques
ja: ライブラリ

source: Libraries are always difficult to package for various reasons. The policy imposes many constraints to ease their maintenance and to make sure upgrades are as simple as possible when a new upstream version comes out. Breakage in a library can result in dozens of dependent packages breaking.
de: Bibliotheken unterscheiden sich immer von Paketen aus unterschiedlichen Gründen. Die Richtlinien verhängen mehrere Beschränkungen, um ihre Verwaltung zu erleichtern und sicherzustellen, dass Upgrades so einfach wie möglich sind, wenn eine neue Originalversion herauskommt. Eine kaputte Bibliothek kann dazu führen, dass Dutzende davon abhängige Pakete kaputtgehen.
fr: Les paquets fournissant des bibliothèques sont plus difficiles à maintenir pour plusieurs raisons. La Charte impose de nombreuses contraintes pour en faciliter la maintenance et garantir que les mises à niveau sont aussi simples que possible quand une nouvelle version amont est disponible. Des erreurs dans une bibliothèque sont susceptibles de rendre inutilisables de très nombreux paquets.
ja: ライブラリは様々な理由から常にパッケージにするのが難しいです。ポリシーは、メンテナンスに楽にし、新しいバージョンが開発元から出た際にアップグレードを可能な限りシンプルであることを確保するため、多くの制約を課しています。ライブラリでの破損は、依存している何十ものパッケージの破損を招き得ます。

source: Good practices for library packaging have been grouped in <ulink url="&url-libpkg-guide;">the library packaging guide</ulink>.
de: Gute Vorgehensweisen für das Paketieren von Bibliotheken wurden in der <ulink url="&url-libpkg-guide;">Anleitung zum Paketieren von Bibliotheken</ulink> zusammengefasst.
fr: Les bonnes pratiques pour la maintenance de paquets fournissant des bibliothèques ont été rassemblées dans <ulink url="&url-libpkg-guide;">le guide de gestion des paquets de bibliothèques</ulink>.
ja: ライブラリのパッケージ化の良い作法が <ulink url="&url-libpkg-guide;">the library packaging guide</ulink> にまとめられています。
