Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: Best Packaging Practices
de: Optimale Vorgehensweise beim Paketieren
fr: Meilleures pratiques d'empaquetage
ja: パッケージ化のベストプラクティス

source: Debian's quality is largely due to the <ulink url="&url-debian-policy;">Debian Policy</ulink>, which defines explicit baseline requirements which all Debian packages must fulfill. Yet there is also a shared history of experience which goes beyond the Debian Policy, an accumulation of years of experience in packaging. Many very talented people have created great tools, tools which help you, the Debian maintainer, create and maintain excellent packages.
de: Debians Qualität ist größtenteils den <ulink url="&url-debian-policy;">Debian-Richtlinien</ulink> zu verdanken, die explizit grundlegende Anforderungen definieren, die alle Debian-Pakete erfüllen müssen. Bisher gibt es außerdem eine gemeinsame Geschichte der Erfahrung, die hinter den Debian-Richtlinien steckt, einer Ansammlung jahrelanger Erfahrung im Paketieren. Viele sehr talentierte Leute haben großartige Werkzeuge geschaffen, Werkzeuge, die Ihnen als Debian-Betreuer helfen, ausgezeichnete Pakete zu erstellen und zu pflegen.
fr: La qualité de Debian est largement due à la <ulink url="&url-debian-policy;">Charte Debian</ulink> qui définit explicitement les exigences de base que tous les paquets Debian doivent satisfaire. Cependant, il existe également une expérience générale partagée qui va bien au delà de la Charte Debian et constitue une somme d'années d'expérience dans l'empaquetage. De nombreux contributeurs talentueux ont créé d'excellents outils qui peuvent vous aider, en tant que mainteneur Debian, à créer et maintenir des paquets d'excellente qualité.
ja: Debian の品質は、全ての Debian パッケージが満たす必要がある基本的要求を明示的に規定する<ulink url="&url-debian-policy;">Debian ポリシー</ulink>に大きく依存しています。そして、パッケージングでの長年の経験で溜め込まれた財産である、Debian ポリシーを越えて共有してきた経験の積み重ねというものもあります。多くの非常に優秀な人々が素晴らしいツールを作っており、このツールがあなた、つまり Debian のメンテナが素晴らしいパッケージを作り、維持していくのを手助けしてくれます。

source: This chapter provides some best practices for Debian developers. All recommendations are merely that, and are not requirements or policy. These are just some subjective hints, advice and pointers collected from Debian developers. Feel free to pick and choose whatever works best for you.
de: Dieses Kapitel stellt einige optimale Vorgehensweisen für Debian-Entwickler vor. Das alles sind lediglich Empfehlungen und keine Anforderungen oder Richtlinien. Dies sind nur einige subjektive Hinweise, Ratschläge und Fingerzeige, die von Debian-Entwicklern gesammelt wurden. Suchen Sie sich einfach das heraus, was Ihnen am meisten zusagt.
fr: Ce chapitre rassemble les meilleures pratiques pour les responsables Debian. La majorité de son contenu est constitué de recommandations plus que d'obligations. Il s'agit essentiellement d'informations subjectives, d'avis et de pointeurs, rassemblés par les développeurs Debian. Il est conseillé d'y choisir ce qui vous convient le mieux.
ja: この章では、Debian 開発者へのベストプラクティスをいくつか提供します。すべての勧めは単に勧めであり、要求事項やポリシーではありません。Debian 開発者らからの主観的なヒント、アドバイス、ポインタです。あなたにとって一番うまくいくやり方を、どうぞご自由に選んでください。

source: Best practices for <filename>debian/rules</filename>
de: Optimale Vorgehensweisen für <filename>debian/rules</filename>
fr: Meilleures pratiques pour <filename>debian/rules</filename>
ja: <filename>debian/rules</filename> についてのベストプラクティス

source: The following recommendations apply to the <filename>debian/rules</filename> file. Since <filename>debian/rules</filename> controls the build process and selects the files which go into the package (directly or indirectly), it's usually the file maintainers spend the most time on.
de: Die folgenden Empfehlungen gelten für die Datei <filename>debian/rules</filename>. Da <filename>debian/rules</filename> den Build-Prozess steuert und die Dateien auswählt, die in das Paket gelangen (direkt oder indirekt), ist es normerweise die Datei, der die Betreuer die meiste Zeit widmen.
fr: Les recommandations qui suivent s'appliquent au fichier <filename>debian/rules</filename>. Comme ce fichier contrôle le processus de construction des paquets et fait le choix des fichiers qui entreront dans ce paquet (directement ou indirectement), il s'agit du fichier dont les responsables s'occupent généralement le plus.
ja: 以下の推奨事項は、<filename>debian/rules</filename> ファイルに適用されます。<filename>debian/rules</filename> は、ビルド作業を管理し、(直接にせよ、そうでないにせよ) パッケージにどのファイルが入るかを選択します。大抵の場合、メンテナが最も時間を費やすファイルです。

source: Helper scripts
de: Helfer-Skripte
fr: Scripts d'assistance
ja: ヘルパースクリプト

source: The rationale for using helper scripts in <filename>debian/rules</filename> is that they let maintainers use and share common logic among many packages. Take for instance the question of installing menu entries: you need to put the file into <filename>/usr/share/menu</filename> (or <filename>/usr/lib/menu</filename> for executable binary menufiles, if this is needed), and add commands to the maintainer scripts to register and unregister the menu entries. Since this is a very common thing for packages to do, why should each maintainer rewrite all this on their own, sometimes with bugs? Also, supposing the menu directory changed, every package would have to be changed.
de: Der Grund für die Benutzung von Helfer-Skripten in <filename>debian/rules</filename> ist, dass sie den Betreuern eine geteilte gemeinsame Logik inmitten vieler Pakete einräumen. Nehmen Sie zum Beispiel die Frage, wie Menü-Einträge installiert werden: Sie müssen die Datei in <filename>/usr/share/menu</filename> (oder <filename>/usr/lib/menu</filename> für ausführbare binäre Menü-Dateien, wenn nötig) ablegen und den Betreuerskripten Befehle hinzufügen, um Menü-Einträge zu registrieren bzw. ihre Registrierung zu entfernen. Dies ist eine sehr häufige Tätigkeit für Pakete. Warum sollte daher jeder Betreuer all dies für sich selbst neu schreiben und dabei möglicherweise Fehler verursachen? Außerdem, den Fall gesetzt, das Menü-Verzeichnis würde sich ändern, dann müsste jedes Paket geändert werden.
fr: La motivation pour utiliser des scripts d'assistance dans <filename>debian/rules</filename> est de permettre aux mainteneurs de définir puis utiliser une logique commune pour de nombreux paquets. Si on prend par exemple l'installation d'entrées de menu, il est nécessaire de placer le fichier dans <filename>/usr/share/menu</filename> (ou <filename>/usr/lib/menu</filename> pour les fichiers de menu exécutables, si besoin), puis d'ajouter des commandes aux scripts des responsables pour ajouter ou enlever les entrées de menu. Comme cette action est commune à de très nombreux paquets, pourquoi faudrait-il que chaque responsable doivent réécrire ses propres méthodes, bogues compris ? De plus, si jamais le répertoire des menus venait à changer, chaque paquet devrait être modifié.
ja: <filename>debian/rules</filename> でヘルパースクリプトを使う根拠は、多くのパッケージ間でメンテナらに共通のロジックを利用・共有させるようになるからです。メニューエントリのインストールについての問いを例にとってみましょう: ファイルを <filename>/usr/share/menu</filename> (必要であれば、実行形式のバイナリのメニューファイルの場合 <filename>/usr/lib/menu</filename>) に置き、メンテナスクリプトにメニューエントリを登録・解除するためのコマンドを追加する必要があります。これはパッケージが行う、非常に一般的なことです。なぜ個々のメンテナがこれらのすべてを自分で書き直し、時にはバグを埋め込む必要があるでしょう? また、メニューディレクトリが変更された場合、すべてのパッケージを変更する必要があります。

source: Helper scripts take care of these issues. Assuming you comply with the conventions expected by the helper script, the helper takes care of all the details. Changes in policy can be made in the helper script; then packages just need to be rebuilt with the new version of the helper and no other changes.
de: Helfer-Skripte kümmern sich um diese Probleme. Angenommen, Sie erfüllen alle Gepflogenheiten, die das Helfer-Skript erwartet, dann kümmert sich das Helfer-Skript um alle Einzelheiten. Änderungen an den Richtlinien können im Helfer-Skript erledigt werden. Dann müssen Pakete nur mit der neuen Version des Helfer-Skripts erstellt und sonst nicht geändert werden.
fr: Les scripts d'assistance s'occupent de ce type de tâche. À condition de suivre les conventions utilisées par le script d'assistance, celui-ci s'occupe de tous les détails. Les modifications dans la Charte peuvent alors être implémentées dans le script d'assistance et les paquets n'ont plus qu'à être reconstruits sans autre modification.
ja: ヘルパースクリプトがこれらの問題を引き受けてくれます。ヘルパースクリプトの期待するやり方に従っているならば、ヘルパースクリプトはすべての詳細について考慮をします。ポリシーの変更はヘルパースクリプト中で行えます; そして、パッケージを新しいバージョンのヘルパースクリプトでリビルドする必要があるだけです。他に何の変更も必要ありません。

source: <xref linkend="tools"/> contains a couple of different helpers. The most common and best (in our opinion) helper system is <systemitem role="package">debhelper</systemitem>. Previous helper systems, such as <systemitem role="package">debmake</systemitem>, were monolithic: you couldn't pick and choose which part of the helper you found useful, but had to use the helper to do everything. <systemitem role="package">debhelper</systemitem>, however, is a number of separate little <command>dh_*</command> programs. For instance, <command>dh_installman</command> installs and compresses man pages, <command>dh_installmenu</command> installs menu files, and so on. Thus, it offers enough flexibility to be able to use the little helper scripts, where useful, in conjunction with hand-crafted commands in <filename>debian/rules</filename>.
de: <xref linkend="tools"/> enthält ein paar verschiedene Helfer-Skripte. Das gängigste und beste (nach Meinung von Debian) Helfersystem ist <systemitem role="package">debhelper</systemitem>. Verhergehende Helfersysteme, wie <systemitem role="package">debmake</systemitem> waren monolithisch. Sie konnten nicht den Teil des Helfers herausgreifen und auswählen, den Sie nützlich fanden, mussten aber den Helfer für alles benutzen. <systemitem role="package">debhelper</systemitem> besteht jedoch aus mehreren getrennten kleinen <command>dh_*</command>-Programmen. <command>dh_installman</command> installiert und komprimiert zum Beispiel Handbuchseiten, <command>dh_installmenu</command> installiert Menü-Dateien und so weiter. Daher bietet es eine ausreichende Flexibilität, die kleinen Helfer-Skripte dort zu benutzen, wo sie nützlich sind in Verbindung mit handgemachten Befehlen in <filename>debian/rules</filename>.
fr: <xref linkend="tools"/> contient un certain nombre d'assistants variés. Le système le plus répandu et (de l'avis général) le plus adapté est <systemitem role="package">debhelper</systemitem>. Des systèmes antérieurs, tels que <systemitem role="package">debmake</systemitem>, étaient monolithiques : ils ne permettaient pas de choisir quelle partie de l'assistant serait utile, et obligeaient à se servir de l'ensemble de l'assistant. A contrario, <systemitem role="package">debhelper</systemitem> est constitué d'un grand nombre de petits programmes <command>dh_*</command> différents. Par exemple, <command>dh_installman</command> installe et compresse les pages de manuel, <command>dh_installmenu</command> installe les fichiers de menu, et ainsi de suite. En conséquence, il offre la possibilité d'utiliser certains des scripts d'assistance tout en conservant des commandes manuelles dans <filename>debian/rules</filename>.
ja: <xref linkend="tools"/> には、複数の異なったヘルパーが含まれています。もっとも一般的で (我々の意見では) ベストなヘルパーシステムは <systemitem role="package">debhelper</systemitem> です。<systemitem role="package">debmake</systemitem> のような、以前のヘルパーシステムはモノリシックでした: 使えそうなヘルパーの一部を取り出して選ぶことはできず、何を行うにもヘルパーを使う必要がありました。ですが、<systemitem role="package">debhelper</systemitem> は、いくつもの分割された小さな <command>dh_*</command> プログラムです。たとえば、<command>dh_installman</command> は man ページをインストールして圧縮し、<command>dh_installmenu</command> は menu ファイルをインストールするなどします。つまり、<filename>debian/rules</filename> 内で使える部分では小さなヘルパースクリプトを使い、手製のコマンドを使うといった十分な柔軟性を与えてくれます。

source: You can get started with <systemitem role="package">debhelper</systemitem> by reading <citerefentry> <refentrytitle>debhelper</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, and looking at the examples that come with the package. <command>dh_make</command>, from the <systemitem role="package">dh-make</systemitem> package (see <xref linkend="dh-make"/>), can be used to convert a vanilla source package to a <systemitem role="package">debhelper</systemitem>ized package. This shortcut, though, should not convince you that you do not need to bother understanding the individual <command>dh_*</command> helpers. If you are going to use a helper, you do need to take the time to learn to use that helper, to learn its expectations and behavior.
de: Sie können mit <systemitem role="package">debhelper</systemitem> anfangen, indem Sie <citerefentry> <refentrytitle>debhelper</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> lesen und sich die Beispiele ansehen, die dem Paket beigefügt sind. <command>dh_make</command> aus dem Paket <systemitem role="package">dh-make</systemitem> (siehe <xref linkend="dh-make"/>) kann benutzt werden, um ein einfaches Quellpaket in ein mit <systemitem role="package">debhelper</systemitem> bearbeitetes Paket umzuwandeln. Gleichwohl sollte diese Kurzform Sie jedoch nicht davon überzeugen, dass Sie sich nicht plagen müssen, um die einzelnen <command>dh_*</command>-Helfer zu verstehen. Falls Sie einen Helfer benutzen möchten, müssen Sie sich die Zeit nehmen zu lernen, wie dieser Helfer benutzt wird, um zu verstehen was er erwartet und wie er sich verhält.
fr: Pour démarrer avec <systemitem role="package">debhelper</systemitem>, il est conseillé de lire <citerefentry> <refentrytitle>debhelper</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> et de consulter les exemples fournis avec le paquet. <command>dh_make</command>, fourni avec le paquet <systemitem role="package">dh-make</systemitem> (voir <xref linkend="dh-make"/>) peut être utilisé pour convertir un paquet source originel en paquet géré par <systemitem role="package">debhelper</systemitem>. Cette méthode rapide ne doit cependant pas se substituer à une compréhension individuelle des commandes <command>dh_*</command>. Si vous utilisez un assistant, vous devez prendre le temps de le connaître, pour comprendre ses besoins et son comportement.
ja: <citerefentry> <refentrytitle>debhelper</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> を読んで、パッケージに付属している例を参照すれば、<systemitem role="package">debhelper</systemitem> を使い始めることができます。 <systemitem role="package">dh-make</systemitem> パッケージ (<xref linkend="dh-make"/> 参照) の <command>dh_make</command> は、素のソースパッケージを <systemitem role="package">debhelper</systemitem>化されたパッケージに変換するのに利用できます。ですが、この近道では個々の <command>dh_*</command> ヘルパーをわざわざ理解する必要がないので、満足できないでしょう。ヘルパースクリプトを使おうとするのであれば、そのヘルパーを使うこと、つまり前提と動作を学ぶのに時間を割く必要があります。

source: Separating your patches into multiple files
de: Unterteilen Sie Ihre Patchs in mehrere Dateien
fr: Séparation des correctifs (« <literal>patches</literal> ») en plusieurs fichiers
ja: パッチを複数のファイルに分離する

source: Big, complex packages may have many bugs that you need to deal with. If you correct a number of bugs directly in the source, and you're not careful, it can get hard to differentiate the various patches that you applied. It can get quite messy when you have to update the package to a new upstream version which integrates some of the fixes (but not all). You can't take the total set of diffs (e.g., from <filename>.diff.gz</filename>) and work out which patch sets to back out as a unit as bugs are fixed upstream.
de: Große, komplexe Pakete könnten mehrere Fehler haben, die Sie bewältigen müssen. Falls Sie mehrere Fehler direkt in der Quelle beheben und nicht sorgfältig vorgehen, kann es schwierig werden, die verschiedenen Patchs, die Sie bereitgestellt haben, zu unterscheiden. Es kann ziemlich chaotisch werden, wenn Sie das Paket auf eine neue Originalversion aktualisieren müssen, die einige (aber nicht alle) Reparaturen enthält. Sie können nicht die komplette Zusammenstellung der Diffs nehmen (z.B. aus <filename>.diff.gz</filename>) und austüfteln, welches Patch es als Einheit zurücksetzt, da Fehler im Original repariert wurden.
fr: Les paquets complexes ont souvent de nombreux bogues qui doivent être gérés par le responsable. Si certains de ces bogues sont corrigés par des modifications effectuées directement dans le code source, sans discernement, il peut devenir difficile de retrouver l'origine et la motivation de ces correctifs. Cela peut également rendre bien plus complexe l'intégration d'une nouvelle version amont qui pourrait inclure certains de ces correctifs (mais pas tous). Il est en effet alors quasiment impossible de reprendre le jeu initial de changements (par exemple dans le fichier <filename>.diff.gz</filename>) et supprimer ceux qui correspondent à des correctifs appliqués par le responsable amont.
ja: 巨大で複雑なパッケージには、対処が必要なたくさんのバグが含まれているかもしれません。直接ソース中で大量のバグを修正し、あまり注意を払っていなかった場合、適用した様々なパッチを識別するのは難しいことになるでしょう。(全てではなく) 幾つか修正を取り入れた新しい開発元のバージョンへパッケージを更新する必要が出た場合、とても悲惨なことになります。(例えば、<filename>.diff.gz</filename> から) diff をすべて適用することもできませんし、開発元で修正されたバグごとにどのパッチをバックアウトするようにすればよいのか分かりません。

source: Fortunately, with the source format “3.0 (quilt)” it is now possible to keep patches separate without having to modify <filename>debian/rules</filename> to setup a patch system. Patches are stored in <filename>debian/patches/</filename> and when the source package is unpacked patches listed in <filename>debian/patches/series</filename> are automatically applied. As the name implies, patches can be managed with <command>quilt</command>.
de: Glücklicherweise ist es nun mit dem Quellformat »3.0 (quilt)« möglich, die Patchs getrennt zu halten ohne <filename>debian/rules</filename> zur Einrichtung eines Patch-Systems ändern zu müssen. Patchs werden in <filename>debian/patches/</filename> gespeichert und wenn das Quellpaket entpackt wird, werden automatisch die Patchs angewandt, die in <filename>debian/patches/series</filename> aufgeführt sind. Wie der Name schon sagt, können Patchs mit <command>quilt</command> verwaltet werden.
fr: Heureusement, avec le format source « 3.0 (quilt) », il est dorénavant possible de séparer des correctifs (« <literal>patches</literal> ») sans avoir à modifier <filename>debian/rules</filename> pour configurer un système de correctif. Les correctifs sont conservés dans <filename>debian/patches/</filename> et, lorsque le paquet source est dépaqueté (« <literal>unpacked</literal> »), les correctifs énumérés dans <filename>debian/patches/series</filename> sont automatiquement appliqués. Comme le nom le suggère, les correctifs peuvent être gérés avec <command>quilt</command>.
ja: 幸いなことに、ソースフォーマット“3.0 (quilt)”では、パッチシステムを設定するために <filename>debian/rules</filename> を変更することなく、パッチを分割して保持できるようになっています。パッチは <filename>debian/patches/</filename> に保持され、ソースパッケージが展開されるときに <filename>debian/patches/series</filename> に記載されているパッチが自動的に適用されます。名前が指すように、パッチは <command>quilt</command> で管理することができます。

source: When using the older source “1.0”, it's also possible to separate patches but a dedicated patch system must be used: the patch files are shipped within the Debian patch file (<filename>.diff.gz</filename>), usually within the <filename>debian/</filename> directory. The only difference is that they aren't applied immediately by <command>dpkg-source</command>, but by the <literal>build</literal> rule of <filename>debian/rules</filename>, through a dependency on the <literal>patch</literal> rule. Conversely, they are reverted in the <literal>clean</literal> rule, through a dependency on the <literal>unpatch</literal> rule.
de: Wenn Sie die ältere Quelle »1.0« verwenden, ist es auch möglich, Patchs zu trennen, aber es muss ein zugehöriges Patch-System verwandt werden: Die Patch-Dateien werden innerhalb der Debian-Patch-Datei (<filename>.diff.gz</filename>) mitgeliefert, normalerweise im Verzeichnis <filename>debian/</filename>. Der einzige Unterschied ist, dass sie nicht unmittelbar von <command>dpkg-source</command> angewandt werden, sondern von der <literal>build</literal>-Regel der Datei <filename>debian/rules</filename> durch eine Abhängigkeit in der <literal>patch</literal>-Regel. Im Gegenzug werden sie von der Regel <literal>clean</literal> durch eine Abhängigkeit zur Regel <literal>unpatch</literal> umgekehrt.
fr: Avec l'ancien format source « 1.0 », il est aussi possible de séparer les correctifs mais un système de correctif dédié doit être utilisé : les correctifs individualisés sont embarqués dans le fichier général de correctifs Debian (<filename>.diff.gz</filename>), en général à l'intérieur du répertoire <filename>debian/</filename>. La seule différence est que ces correctifs ne sont pas appliqués directement par <command>dpkg-source</command> mais par la règle <literal>build</literal> de <filename>debian/rules</filename>, via une dépendance à la règle <literal>patch</literal>. À l'inverse, les correctifs sont retirés par la règle <literal>clean</literal>, via une dépendance à la règle <literal>unpatch</literal>.
ja: より古いソースフォーマット“1.0”を使っている場合でも、パッチを分割することは可能ですが、専用のパッチシステムを使う必要があります: パッチファイルは Debian パッチファイル (<filename>.diff.gz</filename>) 内に組み込まれ、通常 <filename>debian/</filename> ディレクトリ内にあります。違いは、すぐに <command>dpkg-source</command> では適用されないが、<filename>debian/rules</filename> の <literal>build</literal> ルールで <literal>patch</literal> ルールへの依存を通じて適用されることだけです。逆に言うと、これらのパッチは <literal>unpatch</literal> ルールへの依存を通じて <literal>clean</literal> ルールで外されます。

source: <command>quilt</command> is the recommended tool for this. It does all of the above, and also allows to manage patch series. See the <systemitem role="package">quilt</systemitem> package for more information.
de: <command>quilt</command> ist das dafür empfohlene Werkzeug. Es erledigt alles oben beschriebene und ermöglicht außerdem die Verwaltung von Patch-Serien. Weitere Informationen finden Sie im Paket <systemitem role="package">quilt</systemitem>.
fr: <command>quilt</command> est l'outil recommandé pour ce besoin. Il effectue l'ensemble des actions mentionnées précédemment et offre la possibilité de gérer des ensembles de correctifs. Veuillez regarder le paquet <systemitem role="package">quilt</systemitem> pour plus d'informations.
ja: <command>quilt</command> はこの作業にお勧めのツールです。上記の全てを行う上、パッチ一覧の管理も可能です。詳細な情報は <systemitem role="package">quilt</systemitem> パッケージを参照してください。

source: There are other tools to manage patches, like <command>dpatch</command>, and the patch system integrated with <systemitem role="package">cdbs</systemitem>.
de: Es gibt noch andere Werkzeuge, um Patchs zu verwalten, wie <command>dpatch</command> und das in <systemitem role="package">cdbs</systemitem> eingebaute Patch-System.
fr: D'autres outils existent pour gérer les correctifs, comme <command>dpatch</command>, et le système de correctif intégré à <systemitem role="package">cdbs</systemitem>.
ja: 他にもパッチを管理するツールはあります。<command>dpatch</command> や、パッチシステムが統合されている <systemitem role="package">cdbs</systemitem> などです。

source: Multiple binary packages
de: Pakete mit mehreren Binärdateien
fr: Paquets binaires multiples
ja: 複数のバイナリパッケージ
