Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: Once you've dealt with a bug report (e.g. fixed it), mark it as <literal>done</literal> (close it) by sending an explanation message to <email><replaceable>123</replaceable>-done@&bugs-host;</email>. If you're fixing a bug by changing and uploading the package, you can automate bug closing as described in <xref linkend="upload-bugfix"/>.
de: Sobald Sie einen Fehlerbericht erledigt haben (z.B. den Fehler beheben), markieren Sie ihn als <literal>done</literal> (dies schließt ihn), indem Sie eine Erklärung an <email><replaceable>123</replaceable>-done@&bugs-host;</email> senden. Falls Sie einen Fehler durch Ändern und Hochladen des Pakets schließen, können Sie das Schließen von Fehlern, wie in <xref linkend="upload-bugfix"/> beschrieben, automatisieren.
fr: Une fois un bogue traité (c'est-à-dire qu'il est corrigé), marquez-le comme <literal>done</literal> (il sera fermé) en envoyant un message d'explication à <email><replaceable>123</replaceable>-done@&bugs-host;</email>. Si vous corrigez un bogue en changeant et en envoyant une nouvelle version du paquet, vous pouvez fermer le bogue automatiquement comme décrit en <xref linkend="upload-bugfix"/>.
ja: 既にバグに対処していた場合 (例えば修正済みの時)、説明のメッセージを <email><replaceable>123</replaceable>-done@&bugs-host;</email> に送ることで <literal>done</literal> とマークしておいて (閉じて) ください。パッケージを変更してアップロードすることでバグを修正する場合は、<xref linkend="upload-bugfix"/> に記載されているように自動的にバグを閉じることができます。

source: You should <emphasis>never</emphasis> close bugs via the bug server <literal>close</literal> command sent to &email-bts-control;. If you do so, the original submitter will not receive any information about why the bug was closed.
de: Sie sollten Fehler <emphasis>niemals</emphasis> durch Senden des Befehls <literal>close</literal> an &email-bts-control; schließen. Falls Sie dies tun, wird der ursprüngliche Absender keine Informationen darüber erhalten, warum der Fehler geschlossen wurde.
fr: Vous ne devez <emphasis>jamais</emphasis> fermer un rapport de bogue en envoyant la commande <literal>close</literal> à l'adresse &email-bts-control;. Si vous le faites, le rapporteur n'aura aucune information sur la clôture de son rapport.
ja: <literal>close</literal> コマンドを &email-bts-control; に送って、バグサーバ経由でバグを閉じるのは<emphasis>決して</emphasis>してはいけません。そのようにした場合、元々の報告者は何故バグが閉じられたのかという情報を得られません。

source: Bug housekeeping
de: Fehlerorganisation
fr: Gestion des bogues
ja: バグを掃除する

source: As a package maintainer, you will often find bugs in other packages or have bugs reported against your packages which are actually bugs in other packages. The bug tracking system's features are described in the <ulink url="&url-bts-devel;">BTS documentation for Debian developers</ulink>. Operations such as reassigning, merging, and tagging bug reports are described in the <ulink url="&url-bts-control;">BTS control server documentation</ulink>. This section contains some guidelines for managing your own bugs, based on the collective Debian developer experience.
de: Als Paketbetreuer werden Sie öfters Fehler in anderen Paketen finden oder Fehlerberichte gegen Ihre Pakete erhalten, die tatsächlich Fehler in anderen Paketen sind. Die Funktionen der Fehlerdatenbank werden in den <ulink url="&url-bts-devel;">Informationen über das Fehlerverwaltungssystem für Paket-Betreuer</ulink> beschrieben. Operationen wie erneutes Zuweisen, Zusammenführen und Markieren von Fehlerberichten werden in der <ulink url="&url-bts-control;">Einführung in den E-Mail-Server für die Kontrolle und Manipulation</ulink> beschrieben. Dieser Abschnitt enthält einige Richtlinien für die Verwaltung Ihrer eigenen Fehler, die auf der gesammelten Erfahrung der Debian-Entwickler basieren.
fr: En tant que responsable de paquet, vous trouverez fréquemment des bogues dans d'autres paquets et recevrez des rapports de bogue sur vos paquets qui sont en fait relatifs à d'autres paquets. Les fonctions intéressantes du système de suivi des bogues sont décrites dans la <ulink url="&url-bts-devel;">documentation du BTS pour les développeurs Debian</ulink>. Les <ulink url="&url-bts-control;">instructions du serveur de contrôle du BTS</ulink> documentent les opérations techniques du BTS, telles que comment remplir, réassigner, regrouper et marquer des bogues. Cette section contient des lignes directrices pour gérer vos propres bogues, définies à partir de l'expérience collective des développeurs Debian.
ja: パッケージメンテナになると、他のパッケージにバグを見つけたり、自分のパッケージに対して報告されたバグが実際には他のパッケージにあるバグであったりということが頻繁にあるでしょう。バグ追跡システムの機能は <ulink url="&url-bts-devel;">Debian 開発者向けの BTS ドキュメント</ulink> に記載されています。バグ報告の再指定 (reassign) やマージ (merge)、そしてタグ付けなどの作業は <ulink url="&url-bts-control;">BTS 制御サーバのドキュメント</ulink> に記述されています。この章では、Debian 開発者から集められた経験を元にしたバグの扱い方のガイドラインを含んでいます。

source: Filing bugs for problems that you find in other packages is one of the civic obligations of maintainership, see <xref linkend="submit-bug"/> for details. However, handling the bugs in your own packages is even more important.
de: Fehler für Probleme einreichen, die Sie in anderen Paketen finden, ist eine der bürgerlichen Pflichten des Betreuerdaseins. Einzelheiten finden Sie unter <xref linkend="submit-bug"/>. Es ist jedoch wichtiger die Fehler in Ihren eigenen Paketen zu behandeln.
fr: Remplir des rapports de bogue pour des problèmes que vous trouvez dans d'autres paquets est l'une des « obligations civiques » du responsable, voir <xref linkend="submit-bug"/> pour les détails. Cependant, gérer les bogues de vos propres paquets est encore plus important.
ja: 他のパッケージで見つけた問題についてバグを登録するのは、メンテナとしての責務の一つです。詳細については <xref linkend="submit-bug"/> を参照してください。しかし、自分のパッケージのバグを管理するのはさらに重要です。

source: Here's a list of steps that you may follow to handle a bug report:
de: Hier ist eine kurze Liste der Schritte, denen Sie zu Handhabung eines Fehlerberichts folgen können:
fr: Voici une liste des étapes que vous pouvez suivre pour traiter un rapport de bogue :
ja: 以下がバグ報告を取り扱う手順です:

source: Decide whether the report corresponds to a real bug or not. Sometimes users are just calling a program in the wrong way because they haven't read the documentation. If you diagnose this, just close the bug with enough information to let the user correct their problem (give pointers to the good documentation and so on). If the same report comes up again and again you may ask yourself if the documentation is good enough or if the program shouldn't detect its misuse in order to give an informative error message. This is an issue that may need to be brought up with the upstream author.
de: Entscheiden Sie, ob der Bericht einem echten Fehler entspricht oder nicht. Manchmal rufen Anwender ein Programm nur auf die falsche Art auf, da Sie die Dokumentation nicht gelesen haben. Falls Sie dies diagnostizieren, schließen Sie den Fehler nur und stellen Sie informationen bereits, damit der Anwender sein Problem lösen kann (verweisen Sie auf die gute Dokumentation und so weiter). Falls der gleiche Bericht immer wieder kommt, sollten Sie sich fragen, ob die Dokumentation ausreicht oder ob das Programm den falschen Gebrauch feststellen kann, um eine aussgagekräftige Fehlermeldung auszugeben. Dies ist ein Thema, das Sie mit dem Originalautor angehen sollten.
fr: décider si le rapport correspond à un bogue réel ou non. Parfois, les utilisateurs utilisent simplement un programme d'une mauvaise façon car ils n'ont pas lu la documentation. Si c'est votre diagnostic, fermez simplement le bogue avec assez d'informations pour laisser l'utilisateur corriger son problème (donnez des indications vers la bonne documentation et ainsi de suite). Si le rapport de bogue revient régulièrement, vous devriez vous demander si la documentation est assez bonne ou si le programme ne devrait pas détecter une mauvaise utilisation pour donner un message d'erreur informatif. Il s'agit d'un problème qui peut être discuté avec l'auteur amont.
ja: 報告が実際にバグに関連するものか否かを決めてください。ユーザはドキュメントを読んでいないため、誤ったプログラムの使い方をしているだけのことが時々あります。このように判断した場合は、ユーザに問題を修正するのに十分な情報を与えて (良いドキュメントへのポインタを教えるなどして) バグを閉じます。同じ報告が何度も繰り返し来る場合には、ドキュメントが十分なものかどうか、あるいは有益なエラーメッセージを与えるよう、誤った使い方を検知していないのでは、と自身に問い直してください。これは開発元の作者に伝える必要がある問題かもしれません。

source: If the bug submitter disagrees with your decision to close the bug, they may reopen it until you find an agreement on how to handle it. If you don't find any, you may want to tag the bug <literal>wontfix</literal> to let people know that the bug exists but that it won't be corrected. If this situation is unacceptable, you (or the submitter) may want to require a decision of the technical committee by reassigning the bug to <systemitem role="package">tech-ctte</systemitem> (you may use the clone command of the BTS if you wish to keep it reported against your package). Before doing so, please read the <ulink url="&url-tech-ctte;">recommended procedure</ulink>.
de: Falls der Absender des Fehler nicht mit Ihrer Entscheidung, den Fehler zu schließen, einverstanden ist, können Sie den Fehler neu öffnen, bis Sie eine Vereinbarung gefunden haben, wie er gehandhabt werden soll. Falls Sie keine finden, können Sie den Fehler mit <literal>wontfix</literal> markieren, damit die Leute wissen, dass der Fehler existiert, Sie ihn aber nicht beheben möchten. Falls diese Situation nicht akzeptabel ist, können Sie (oder der Absender) eine Entscheidung des technischen Ausschusses anfordern, indem Sie den Fehler neu an <systemitem role="package">tech-ctte</systemitem> zuweisen (Sie könnten den Befehl »clone« des BTS verwenden, falls Sie wünschen, dass der Fehlerbericht gegen Ihr Paket weiterbesteht). Lesen Sie, bevor Sie dies tun, die <ulink url="&url-tech-ctte;">empfohlene Prozedur</ulink>.
fr: Si le rapporteur de bogue n'est pas d'accord avec votre décision de fermeture du bogue, il peut le rouvrir jusqu'à ce que vous trouviez un accord sur la façon de le gérer. Si vous n'en trouvez pas, vous pouvez marquer le bogue <literal>wontfix</literal> pour indiquer aux personnes que le bogue existe, mais ne sera pas corrigé. Si cette situation n'est pas acceptable, vous (ou le rapporteur) pouvez vouloir demander une décision par le comité technique en réassignant le bogue à <systemitem role="package">tech-ctte</systemitem> (vous pouvez utiliser la commande <literal>clone</literal> du BTS si vous désirez garder le bogue comme rapporté sur votre paquet). Avant de faire cela, veuillez lire la <ulink url="&url-tech-ctte;">procédure recommandée</ulink> ;
ja: バグを閉じるという貴方の判断にバグ報告者らが同意しない場合には、それをどう取り扱うかについての同意が見つかるまで、彼らは再度オープンな状態 (reopen) にするでしょう。そのバグについてもう議論することが無いという場合は、バグは存在するが修正することはないと知らせるため、バグに対して <literal>wontfix</literal> タグを付けることになります。この決定が受け入れがたい時には、あなた (あるいは報告者) はバグを <systemitem role="package">tech-ctte</systemitem> に再指定 (reassign) して技術委員会 (technical committee) の判断を仰いでください (パッケージへ報告されたものをそのままにしておきたい場合は、BTS の clone コマンドを使ってください)。これを行う前には<ulink url="&url-tech-ctte;">推奨手順</ulink>を読んでおいてください。

source: If the bug is real but it's caused by another package, just reassign the bug to the right package. If you don't know which package it should be reassigned to, you should ask for help on <link linkend="irc-channels">IRC</link> or on &email-debian-devel;. Please inform the maintainer(s) of the package you reassign the bug to, for example by Cc:ing the message that does the reassign to <email><replaceable>packagename</replaceable>@packages.debian.org</email> and explaining your reasons in that mail. Please note that a simple reassignment is <emphasis>not</emphasis> e-mailed to the maintainers of the package being reassigned to, so they won't know about it until they look at a bug overview for their packages.
de: Falls der Fehler zwar echt ist, jedoch ein anderes Paket betrifft, weisen Sie ihn nur dem richtigen Paket neu zu. Falls Sie nicht wissen, an welches Paket er zugewiesen werden soll, sollten Sie im <link linkend="irc-channels">IRC</link> oder auf &email-debian-devel; nach Hilfe fragen. Bitte informieren Sie den/die Paketbetreuer des Pakets, dem Sie den Fehler zuweisen, zum Beispiel indem Sie eine Kopie der E-Mail senden, die das erneute Zuweisen an <email><replaceable>Paketname</replaceable>@packages.debian.org</email> vornimmt und Ihre Beweggründe für diese E-Mail erklären. Bitte beachten Sie, dass ein einfaches erneutes Zuweisen <emphasis>nicht</emphasis> an den Betreuer des Pakets versandt wird, an das zugewiesen wird, so dass er nichts davon erfährt, bis er in die Fehlerübersicht seiner Pakete schaut.
fr: si le bogue est réel, mais causé par un autre paquet, réassignez simplement le bogue à l'autre paquet. Si vous ne savez pas à quel paquet il doit être réassigné, vous pouvez demander de l'aide sur <link linkend="irc-channels">IRC</link> ou sur &email-debian-devel;. Veuillez informer le ou les responsables du paquet sur lequel est réassigné le paquet, par exemple en envoyant une copie du message de réassignation à <email><replaceable>nomdupaquet</replaceable>@packages.debian.org</email>, en expliquant vos raisons. Attention, une simple réassignation n'envoie <emphasis>pas</emphasis> de courrier aux mainteneurs du paquet auquel le bogue est réassigné, de ce fait ils n'apprendraient l'existence du bogue qu'en regardant la vue d'ensemble des bogues relatifs à leurs paquets.
ja: バグが実際にあるが、他のパッケージによって引き起こされている場合は、バグを正しいパッケージに再指定 (reassign) します。どのパッケージに再指定するべきかが分からない場合は、<link linkend="irc-channels">IRC</link> か &email-debian-devel; で聞いてください。再指定するパッケージのメンテナに通知をしてください。例えば <email><replaceable>packagename</replaceable>@packages.debian.org</email> 宛にメッセージを Cc: してメール中に理由を説明するなどします。単に再指定しただけでは再指定された先のメンテナにはメールは<emphasis>送信されません</emphasis>ので、彼らがパッケージのバグ一覧を見るまでそれを知ることはありません。

source: If the bug affects the operation of your package, please consider cloning the bug and reassigning the clone to the package that really causes the behavior. Otherwise, the bug will not be shown in your package's bug list, possibly causing users to report the same bug over and over again. You should block "your" bug with the reassigned, cloned bug to document the relationship.
de: Falls der Fehler die Arbeit Ihres Pakets beeinflusst, denken Sie bitte daran, den Fehler zu klonen und den Klon dem Paket neu zuzuweisen, das das Verhalten tatsächlich verursacht. Andernfalls wird der Fehler nicht in Ihrer Liste der Paketfehler aufgeführt, was Anwender dazu veranlasst, den gleichen Fehler immer wieder zu melden. Sie sollten »Ihren« Fehler mit dem neu zugewiesenen, geklonten Fehler blockieren, um die Beziehung zu dokumentieren.
fr: Si le bogue affecte le fonctionnement de votre paquet, veuillez envisager de cloner le bogue avant de le réassigner au paquet qui provoque vraiment le comportement. Si vous procédez autrement, le bogue ne sera pas vu dans la liste des bogues sur votre paquet, au risque que d'autres utilisateurs signalent le même bogue de nouveau. Vous devriez marquer « votre » bogue bloqué par le clone réassigné afin de documenter la relation entre les deux bogue ;
ja: バグがあなたのパッケージの動作に影響する場合は、バグを複製し (clone)、複製したバグをその挙動を実際に起こしているパッケージに再指定することを検討してください。さもなければ、あなたのパッケージのバグ一覧にバグが見つからないので、多分ユーザに同じバグを何度も繰り返し報告される羽目になる可能性があります。あなたは、再指定 (reassign) によって「自分の」バグということを防ぎ、バグの複製 (clone) によって関係があることを記載しておく必要があります。

source: Sometimes you also have to adjust the severity of the bug so that it matches our definition of the severity. That's because people tend to inflate the severity of bugs to make sure their bugs are fixed quickly. Some bugs may even be dropped to wishlist severity when the requested change is just cosmetic.
de: Manchmal müssen Sie außerdem den Schweregrad des Fehlers anpassen, so dass er der Debian-Definition entspricht. Dies geschieht deshalb, weil Leute die Schwere der Fehler aufblähen, um sicherzustellen, dass ihre Fehler rasch behoben werden. Einige Fehler können sogar auf den Schweregrad »wishlist« abgesenkt werden, wenn die angefragte Änderung nur kosmetischer Natur ist.
fr: parfois, vous devez également ajuster la gravité du bogue pour qu'elle corresponde à la définition de gravité des bogues. C'est dû au fait que les gens tendent à augmenter la gravité des bogues pour s'assurer que leurs bogues seront corrigés rapidement. La gravité de certains bogues peut même être rétrogradée en <literal>wishlist</literal> (souhait) quand le changement demandé est seulement superficiel ;
ja: 時々、重要度の定義に合うようにバグの重要度を調整する必要もあります。これは、人々はバグ修正を確実に早くしてもらうために重要度を極端に上げようとするからです。要望された変更点が単に体裁的なものな時には、バグは要望 (wishlist) に格下げされるでしょう。

source: If the bug is real but the same problem has already been reported by someone else, then the two relevant bug reports should be merged into one using the merge command of the BTS. In this way, when the bug is fixed, all of the submitters will be informed of this. (Note, however, that emails sent to one bug report's submitter won't automatically be sent to the other report's submitter.) For more details on the technicalities of the merge command and its relative, the unmerge command, see the BTS control server documentation.
de: Falls der Fehler echt ist, das gleiche Problem aber bereits von jemand anderem gemeldet wurde, dann sollten die beiden relevanten Fehler mit dem Befehl »merge» des BTS zu einem zusammengefügt werden.Auf diese Art werden alle Absender des Fehlers informiert, wenn er behoben wurde. (Beachten Sie jedoch, dass E-Mails, die an den Absender eines Fehlerberichts gesandt werden, nicht automatisch an alle anderen Absender von Berichten gesandt werden.) Weitere Details über die Form des »merge«-Befehls und dem verwandten Befehl »unmerge« finden Sie in der Dokumentation des BTS-Steuerungs-Servers.
fr: si le bogue est réel, mais que le problème a déjà été rapporté auparavant, alors les deux rapports devraient être rassemblés en un seul à l'aide de la commande <literal>merge</literal> du BTS. De cette façon, quand un bogue sera corrigé, tous les rapporteurs en seront informés (veuillez notez, néanmoins, qu'un courrier envoyé au rapporteur d'un des bogues ne sera pas automatiquement envoyé aux autres rapporteurs) ;
ja: バグが確かにあるが既に他の誰かによって同じ問題が報告されている場合は、2 つの関連したバグを BTS の merge コマンドを使って 1 つにマージします。このようにすると、バグが修正された時に全ての投稿者に通知がいきます (ですが、そのバグ報告の投稿者へのメールは報告の他の投稿者には自動的には通知されないことに注意してください)。merge コマンドや類似の unmerge コマンドの技術詳細については、BTS 制御サーバドキュメントを参照してください。

source: The bug submitter may have forgotten to provide some information, in which case you have to ask them for the required information. You may use the <literal>moreinfo</literal> tag to mark the bug as such. Moreover if you can't reproduce the bug, you tag it <literal>unreproducible</literal>. Anyone who can reproduce the bug is then invited to provide more information on how to reproduce it. After a few months, if this information has not been sent by someone, the bug may be closed.
de: Der Absender des Fehlerberichts könnte vergessen haben, einige Informationen bereitzustellen. In diesem Fall müssen Sie die benötigten Informationen bei ihm erfragen. Sie könnten die Kennzeichnung <literal>moreinfo</literal> benutzen, um den Fehler so zu markieren. Außerdem können Sie den Fehler, falls sie ihn nicht reproduzieren können, als <literal>unreproducible</literal> kennzeichnen. Jeder, der den Fehler reproduzieren kann, ist dann eingeladen, weitere Informationen bereitzustellen, wie er reproduziert werden kann. Nach ein paar Monaten kann der Fehler geschlossen werden, falls diese Information von niemandem gesandt wird.
fr: le rapporteur de bogue peut avoir oublié de fournir certaines informations. Dans ce cas, vous devez lui demander les informations nécessaires. Vous pouvez utiliser la marque <literal>moreinfo</literal> (plus d'information) sur le bogue. De plus, si vous ne pouvez pas reproduire le bogue, vous pouvez le marquer comme <literal>unreproducible</literal> (non reproductible). Une personne qui arriverait à reproduire le bogue est alors invitée à fournir plus d'informations sur la façon de le reproduire. Après quelques mois, si cette information n'a été envoyée par personne, le bogue peut être fermé ;
ja: バグ報告者は情報を書き漏らしている場合、必要な情報を尋ねる必要があります。その様なバグに印をつけるには <literal>moreinfo</literal> タグを使います。さらに、そのバグを再現できない場合には、<literal>unreproducible</literal> タグを付けます。誰もそのバグを再現できない場合、どうやって再現するのか、さらに情報を何ヶ月経っても、この情報が誰からも送られてこない場合はバグは閉じても構いません。

source: If the bug is related to the packaging, you just fix it. If you are not able to fix it yourself, then tag the bug as <literal>help</literal>. You can also ask for help on &email-debian-devel; or &email-debian-qa;. If it's an upstream problem, you have to forward it to the upstream author. Forwarding a bug is not enough, you have to check at each release if the bug has been fixed or not. If it has, you just close it, otherwise you have to remind the author about it. If you have the required skills you can prepare a patch that fixes the bug and send it to the author at the same time. Make sure to send the patch to the BTS and to tag the bug as <literal>patch</literal>.
de: Falls sich der Fehler auf die Paketierung bezieht, beheben Sie ihn nur. Falls Sie ihn nicht selbst beheben können, kennzeichnen Sie den Fehler mit <literal>help</literal>. Sie können außerdem auf &email-debian-devel; oder &email-debian-qa; um Hilfe ersuchen. Falls es ein Problem der Originalautoren ist, müssen Sie es an die Originalautoren weiterleiten. Es reicht nicht aus, den Fehler nur weiterzuleiten, Sie müssen bei jeder Veröffentlichung prüfen, ob der Fehler behoben wurde oder nicht. Falls dies der Fall ist, schließen Sie ihn, andernfalls müssen Sie den Autor später daran erinnern. Falls Sie über die erforderlichen Fähigkeiten verfügen, können Sie ein Patch vorbereiten, der den Fehler behebt und ihn dem Autor mitschicken. Stellen Sie sicher, dass Sie das Patch an das BTS senden und mit <literal>patch</literal> kennzeichnen.
fr: si le bogue est lié à l'empaquetage, vous devez simplement le corriger. Si vous ne pouvez pas le corriger vous-même, marquez alors le bogue avec <literal>help</literal> (aide). Vous pouvez également demander de l'aide sur &email-debian-devel; ou &email-debian-qa;. S'il s'agit d'un problème amont, vous devez faire suivre le rapport à l'auteur amont. Faire suivre un bogue n'est pas suffisant, vous devez vérifier à chaque version si le bogue a été corrigé ou non. S'il a été corrigé, il vous suffit de le clôturer, sinon vous devez le rappeler à l'auteur. Si vous avez les compétences nécessaires, vous pouvez préparer un correctif pour le bogue et l'envoyer en même temps à l'auteur. Assurez-vous d'envoyer le correctif au BTS et marquez le bogue avec <literal>patch</literal> (correctif) ;
ja: バグがパッケージに起因する場合、さっさと直します。自分では直せない場合は、バグに <literal>help</literal> タグを付けます。&email-debian-devel; や &email-debian-qa; で助けを求めることも出来ます。開発元 (upstream) の問題であれば、作者に転送する必要があります。バグを転送するだけでは十分ではありません。リリースごとにバグが修正されているかどうかを確認しなければいけません。もし修正されていれば、それを閉じ、そうでなければ作者に確認を取る必要があります。必要な技能を持っていてバグを修正するパッチが用意できる場合は、同時に作者に送りましょう。パッチを BTS に送付してバグに <literal>patch</literal> タグを付けるのを忘れないでください。
