Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: The Debian archive maintainers are responsible for handling package uploads. For the most part, uploads are automatically handled on a daily basis by the archive maintenance tools, <command>dak process-upload</command>. Specifically, updates to existing packages to the <literal>unstable</literal> distribution are handled automatically. In other cases, notably new packages, placing the uploaded package into the distribution is handled manually. When uploads are handled manually, the change to the archive may take some time to occur. Please be patient.
de: Die Debian-Archivbetreuer sind für die Behandlung der Paket-Uploads verantwortlich. Zum größten Teil werden Uploads automatisch täglich durch das Archiv-Verwaltungswerkzeug <command>dak process-upload</command> gehandhabt. Im Besonderen werden Aktualisierungen zu existierenden Paketen in der Distribution <literal>unstable</literal> automatisch eingepfelgt. In anderen Fällen, insbesondere bei neuen Paketen, wird das hochgeladene Paket manuell in die Distribution platziert. Wenn Uploads manuell behandelt werden, kann es einige Zeit dauern bis die Änderung im Archiv erscheint. Bitte haben Sie Geduld.
fr: Les administrateurs de l'archive Debian sont responsables de l'installation des mises à jour. La plupart des mises à jour sont gérées quotidiennement par le logiciel de gestion de l'archive <command>dak process-upload</command>. Les mises à jour de paquets sur la distribution <literal>unstable</literal> sont ainsi installées automatiquement. Dans les autres cas et notamment dans le cas d'un nouveau paquet, celui-ci sera installé manuellement. Il peut s'écouler un peu de temps entre l'envoi d'un paquet vers un serveur et son installation effective. Veuillez être patient.
ja: Debian アーカイブメンテナはパッケージのアップロードに関して責任を持っています。多くの部分は、アップロードはアーカイブ用のメンテナンスツール <command>dak process-upload</command> によって日々自動的に行われています。特に、<literal>不安定版 (unstable)</literal> に存在しているパッケージの更新は自動的に処理されます。それ以外の場合、特に新規パッケージの場合は、アップロードされたパッケージをディストリビューションに含めるのは手動で行われます。アップロードが手動で処理される場合は、アーカイブへの変更は実施されるまでに一ヶ月ほどかかります。お待ちください。

source: In any case, you will receive an email notification indicating that the package has been added to the archive, which also indicates which bugs will be closed by the upload. Please examine this notification carefully, checking if any bugs you meant to close didn't get triggered.
de: Auf jeden Fall werden Sie eine E-Mail-Benachrichtigung erhalten, die anzeigt, dass das Paket dem Archiv hinzugefügt wurde und welche Fehler durch den Upload geschlossen werden. Bitte lesen Sie diese Benachrichtigung sorgfältig und prüfen Sie, ob irgendwelche Fehler, die Sie schließen wollten, nicht berücksichtigt wurden.
fr: Dans tous les cas, vous recevrez un accusé de réception par courrier électronique indiquant que votre paquet a été installé et quels rapports de bogue ont été clos. Veuillez lire attentivement ce courrier et vérifier que tous les rapports de bogue que vous vouliez clore sont bien dans cette liste.
ja: どの場合であっても、パッケージがアーカイブに追加されたことや、バグがアップロードで閉じられたことを告げるメールでの通知を受け取ることになります。あなたが閉じようとしたバグが処理されてない場合は、この通知を注意深く確認してください。

source: The installation notification also includes information on what section the package was inserted into. If there is a disparity, you will receive a separate email notifying you of that. Read on below.
de: Die Installationsbenachrichtigung enthält außerdem die Information, in welchen Bereich das Paket eingefügt wird. Falls es dort einen Unterschied gibt, werden Sie eine separate E-Mail-Benachrichtigung darüber erhalten. Lesen Sie das Folgende.
fr: L'accusé de réception indique aussi la section dans laquelle le paquet a été installé. S'il ne s'agit pas de votre choix, vous recevrez un second courrier qui vous informera de cette différence (voir ci-dessous).
ja: インストール通知は、パッケージがどのセクションに入ったかを示す情報を含んでいます。不一致がある場合は、それを示す別のメール通知を受け取ります。以下も参照ください。

source: Note that if you upload via queues, the queue daemon software will also send you a notification by email.
de: Beachten Sie, dass, falls Sie mittels Warteschlangen hochladen, die Warteschlangen-Daemon-Sortware Ihnen auch per E-Mail Benachrichtigungen sendet.
fr: Notez que si vous envoyez via les files d'attente, le démon vous enverra également une notification par courrier électronique.
ja: キュー経由でアップロードした場合は、キューデーモンソフトウェアもメールで通知を行うことに留意してください。

source: Specifying the package section, subsection and priority
de: Angabe des Paketbereichs, des Unterbereichs und der Priorität
fr: Section, sous-section et priorité de paquet
ja: パッケージのセクション、サブセクション、優先度を指定する

source: The <filename>debian/control</filename> file's <literal>Section</literal> and <literal>Priority</literal> fields do not actually specify where the file will be placed in the archive, nor its priority. In order to retain the overall integrity of the archive, it is the archive maintainers who have control over these fields. The values in the <filename>debian/control</filename> file are actually just hints.
de: Die Felder <literal>Section</literal> und <literal>Priority</literal> der Datei <filename>debian/control</filename> geben weder an, wo die Datei im Archiv tatsächlich platziert wird noch deren Priorität. Um die gesamte Integrität des Archivs zu wahren, haben die Archivbetreuer die Kontrolle über diese Felder. Die Werte in der Datei <filename>debian/control</filename> sind tatsächlich nur Hinweise.
fr: Les champs <literal>Section</literal> et <literal>Priority</literal> du fichier <filename>debian/control</filename> ne précisent pas vraiment l'endroit où le fichier sera placé dans l'archive, ni sa priorité. Afin de conserver l'intégrité globale de l'archive, ce sont les administrateurs de l'archive qui contrôlent ces champs. Les valeurs dans le fichier <filename>debian/control</filename> sont seulement indicatives.
ja: <filename>debian/control</filename> ファイルの <literal>セクション (Section)</literal> フィールドと <literal>優先度 (Priority)</literal> フィールドは実際にアーカイブ内でどこに配置されるか、あるいはプライオリティが何かという指定ではありません。<filename>debian/control</filename> ファイル中の値は、実際のところは単なるヒントです。

source: The archive maintainers keep track of the canonical sections and priorities for packages in the <literal>override file</literal>. If there is a disparity between the <literal>override file</literal> and the package's fields as indicated in <filename>debian/control</filename>, then you will receive an email noting the divergence when the package is installed into the archive. You can either correct your <filename>debian/control</filename> file for your next upload, or else you may wish to make a change in the <literal>override file</literal>.
de: Die Archivbetreuer behalten den Überblick über die vorschriftsmäßigen Bereiche und Prioritäten für Pakete im <literal>override file</literal>. Falls es dort einen Unterschied zwischen dem <literal>override file</literal> und den Paketfeldern, die in <filename>debian/control</filename> angezeigt werden, gibt, werden Sie eine E-Mail-Benachrichtigung über die Abweichung erhalten, wenn das Paket in das Archiv installiert wird. Sie können entweder Ihre <filename>debian/control</filename>-Datei für Ihren nächsten Upload ändern oder eine Änderung am <literal>override file</literal> wünschen.
fr: Les administrateurs de l'archive indiquent les sections et priorités des paquets dans le fichier <literal>override</literal>. Si ce fichier <literal>override</literal> et le fichier <filename>debian/control</filename> du paquet diffèrent, vous en serez informé par courrier électronique quand le paquet sera installé dans l'archive. Vous pourrez corriger votre fichier <filename>debian/control</filename> avant votre prochain envoi ou alors vous pourrez vouloir modifier le fichier <literal>override</literal>.
ja: アーカイブメンテナは、<literal>override ファイル</literal>内でパッケージについて定められたセクションと優先度を常に確認しています。<literal>override ファイル</literal>と <filename>debian/control</filename> で指定されたパッケージのフィールドに不一致がある場合、パッケージがアーカイブにインストールされる際に相違について記述されたメールを受け取ります。<filename>debian/control</filename> ファイルを次回のアップロード時に修正することもできますし、<literal>override ファイル</literal>に変更を加えるように依頼するのもよいでしょう。

source: To alter the actual section that a package is put in, you need to first make sure that the <filename>debian/control</filename> file in your package is accurate. Next, submit a bug against <systemitem role="package">ftp.debian.org</systemitem> requesting that the section or priority for your package be changed from the old section or priority to the new one. Use a Subject like <literal>override: PACKAGE1:section/priority, [...], PACKAGEX:section/priority</literal>, and include the justification for the change in the body of the bug report.
de: Um den tatsächlichen Bereich abzuändern, in den Ihr Paket abgelegt wird, müssen Sie zuerst sicherstellen, dass die Datei <filename>debian/control</filename> in Ihrem Paket fehlerfrei ist. Als nächstes versenden Sie einen Fehlerbericht gegen <systemitem role="package">ftp.debian.org</systemitem> mit der Bitte, den Bereich oder die Priorität für Ihr Paket von dem alten auf den neuen Bereich oder die neue Priorität zu ändern. Benutzen Sie einen Betreff wie <literal>override: PACKAGE1:section/priority, [...], PACKAGEX:section/priority</literal> und fügen Sie die Begründung der Änderung in den Nachrichtentext des Fehlerberichts ein.
fr: Pour modifier la section dans laquelle un paquet est archivé, vous devez d'abord vérifier que le fichier <filename>debian/control</filename> est correct. Ensuite, envoyez un rapport de bogue sur le pseudo-paquet <systemitem role="package">ftp.debian.org</systemitem> demandant la modification de la section ou de la priorité de votre paquet. Utilisez un sujet comme <literal>override: PACKAGE1:section/priorité, [...], PACKAGEX: section/priorité</literal>, et exposez bien les raisons qui vous amènent à demander ces changements dans le corps de texte.
ja: パッケージが現状で置かれているセクションを変更するには、まずパッケージの <filename>debian/control</filename> ファイルが正しいことを確認する必要があります。次に、<systemitem role="package">ftp.debian.org</systemitem> に対し、あなたのパッケージに対するセクションあるいは優先度について古いものから新しいものへ変更する依頼のバグ登録をします。<literal>override: PACKAGE1:section/priority, [...], PACKAGEX:section/priority</literal> のようなサブジェクトを使い、バグ報告の本文に変更に関する根拠を記述してください。

source: For more information about <literal>override files</literal>, see <citerefentry> <refentrytitle>dpkg-scanpackages</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> and <ulink url="&url-bts-devel;#maintincorrect"></ulink>.
de: Weitere Informationen über <literal>override files</literal> finden Sie unter <citerefentry> <refentrytitle>dpkg-scanpackages</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> und <ulink url="&url-bts-devel;#maintincorrect"></ulink>.
fr: Pour en savoir plus sur les fichiers <literal>override</literal>, reportez-vous à <citerefentry> <refentrytitle>dpkg-scanpackages</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> et <ulink url="&url-bts-devel;#maintincorrect"></ulink>.
ja: <literal>override ファイル</literal> についての詳細は、<citerefentry> <refentrytitle>dpkg-scanpackages</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> と <ulink url="&url-bts-devel;#maintincorrect"></ulink> を参照してください。

source: Note that the <literal>Section</literal> field describes both the section as well as the subsection, which are described in <xref linkend="archive-sections"/>. If the section is main, it should be omitted. The list of allowable subsections can be found in <ulink url="&url-debian-policy;ch-archive.html#s-subsections"></ulink>.
de: Beachten Sie, dass das Feld <literal>Section</literal> sowohl den Bereich als auch den Unterbereich beschreibt, die in <xref linkend="archive-sections"/> erläutert werden. Falls der Bereich »main« ist, sollte er weggelassen werden. Die Liste der erlaubten Unterbereiche kann unter <ulink url="&url-debian-policy;ch-archive.html#s-subsections"></ulink> gefunden werden.
fr: Notez que le champ <literal>Section</literal> décrit à la fois la section et la sous-section, comme décrit en <xref linkend="archive-sections"/>. Si la section est <literal>main</literal>, elle devrait être omise. La liste des sous-sections autorisées peut être trouvée en <ulink url="&url-debian-policy;ch-archive.html#s-subsections"></ulink>.
ja: <xref linkend="archive-sections"/> で書かれているように、<literal>セクション (Section)</literal>フィールドにはセクション同様にサブセクションも記述するのに注意ください。セクションが main の場合は、それは書かないようにしてください。利用可能なサブセクションは <ulink url="&url-debian-policy;ch-archive.html#s-subsections"></ulink> で検索できます。

source: Handling bugs
de: Fehlerbehandlung
fr: Manipulation des bogues
ja: バグの取扱い

source: Every developer has to be able to work with the Debian <ulink url="&url-bts;">bug tracking system</ulink>. This includes knowing how to file bug reports properly (see <xref linkend="submit-bug"/>), how to update them and reorder them, and how to process and close them.
de: Jeder Entwickler muss in der Lage sein, mit der Debian-<ulink url="&url-bts;">Fehlerdatenbank</ulink> zu arbeiten. Dies umfasst das Wissen, wie Fehlerberichte richtig eingeordnet werden (siehe <xref linkend="submit-bug"/>), wie sie aktualisiert und neu geordnet werden und wie sie verarbeitet und geschlossen werden.
fr: Chaque développeur doit être capable de travailler avec le <ulink url="&url-bts;">système de suivi des bogues (« <literal>bug tracking system</literal> » ou BTS)</ulink> Debian. Il faut savoir comment remplir des rapports de bogue correctement (voir <xref linkend="submit-bug"/>), comment les mettre à jour, les réordonner, les traiter et les fermer.
ja: すべての開発者は Debian <ulink url="&url-bts;">バグ追跡システム</ulink>を取り扱えるようでなければいけません。これは、どの様にしてバグ報告を正しく登録するか (<xref linkend="submit-bug"/> 参照)、どの様に更新及び整理するか、そしてどの様にして処理をして完了するかを知っていることを含みます。

source: The bug tracking system's features are described in the <ulink url="&url-bts-devel;">BTS documentation for developers</ulink>. This includes closing bugs, sending followup messages, assigning severities and tags, marking bugs as forwarded, and other issues.
de: Die Funktionen des Fehlerverfolgungssystems sind in unter <ulink url="&url-bts-devel;">Fehlerverwaltungssystem für Paket-Betreuer</ulink> beschrieben. Dies umfasst das Schließen von Fehlern, Followup-Nachrichten, Zuweisen von Schweregraden, Markieren von Fehlern als weitergeleitet und andere Themen.
fr: Les fonctionnalités du système de suivi des bogues sont décrites dans la <ulink url="&url-bts-devel;">documentation du BTS pour les développeurs</ulink> : fermeture de bogues, envoi de messages de suivi, assignation de niveaux de gravité et de marques, indication que les bogues ont été transmis aux développeurs amonts, etc.
ja: バグ追跡システムの機能は、<ulink url="&url-bts-devel;">Debian BTS 開発者向け情報</ulink>に記載されています。これには、バグの完了処理・追加メッセージの送信・重要度とタグを割り当てる・バグを転送済み (Forwarded) にする・その他が含まれています。

source: Operations such as reassigning bugs to other packages, merging separate bug reports about the same issue, or reopening bugs when they are prematurely closed, are handled using the so-called control mail server. All of the commands available on this server are described in the <ulink url="&url-bts-control;">BTS control server documentation</ulink>.
de: Operationen, wie das erneute Zuweisen von Fehlern an andere Pakete, das Zusammenführen separater Fehlerberichte zum gleichen Thema oder das Wiedereröffnen von Fehlern, wenn diese voreilig geschlossen wurden, werden vom sogenannten Steuermailserver gehandhabt. All die Befehle, die auf diesem Server verfügbar sind, werden in der <ulink url="&url-bts-control;">Einführung in den E-Mail-Server für die Kontrolle und Manipulation</ulink> beschrieben.
fr: Des opérations comme réassigner des bogues à d'autres paquets, réunir des rapports de bogues séparés traitant du même problème ou rouvrir des bogues quand ils ont été prématurément fermés, sont gérées en utilisant le serveur de contrôle par courrier. Toutes les commandes disponibles pour ce serveur sont décrites dans la <ulink url="&url-bts-control;">documentation du serveur de contrôle du BTS</ulink>.
ja: バグを他のパッケージに割り当てし直す、同じ問題についての別々のバグ報告をマージする、早まってクローズされたバグの再オープンなどの作業は、いわゆる制御メールサーバと呼ばれるものを使って処理されています。このサーバで利用可能なすべてのコマンドは、<ulink url="&url-bts-control;">BTS 制御サーバドキュメント</ulink>に記載されています。

source: Monitoring bugs
de: Fehlerüberwachung
fr: Supervision des bogues
ja: バグの監視

source: If you want to be a good maintainer, you should periodically check the <ulink url="&url-bts;">Debian bug tracking system (BTS)</ulink> for your packages. The BTS contains all the open bugs against your packages. You can check them by browsing this page: <literal>http://&bugs-host;/<replaceable>yourlogin</replaceable>@debian.org</literal>.
de: Falls Sie ein guter Paketbetreuer sein möchten, sollten Sie regelmäßig die <ulink url="&url-bts;">Debian-Fehlerdatenbank (BTS)</ulink> für Ihre Pakete überprüfen. Das BTS enthält alle offenen Fehler Ihrer Pakete. Sie können sie prüfen, indem Sie diese Seite durchstöbern: <literal>http://&bugs-host;/<replaceable>Ihre_Anmeldung</replaceable>@debian.org</literal>.
fr: Être un bon responsable implique de consulter régulièrement la page du <ulink url="&url-bts;">système de suivi des bogues (BTS)</ulink> de vos paquets. Le système de suivi des bogues contient tous les rapports de bogue qui concernent vos paquets. Vous pouvez les vérifier en consultant cette page : <literal>http://&bugs-host;/<replaceable>votrecompte</replaceable>@debian.org</literal>.
ja: 良いメンテナになりたい場合は、あなたのパッケージに関する <ulink url="&url-bts;">Debian バグ追跡システム (BTS)</ulink> のページを定期的にチェックする必要があります。BTS には、あなたのパッケージに対して登録されている全てのバグが含まれています。登録されているバグについては、以下のページを参照することで確認できます: <literal>http://&bugs-host;/<replaceable>yourlogin</replaceable>@debian.org</literal>

source: Maintainers interact with the BTS via email addresses at <literal>&bugs-host;</literal>. Documentation on available commands can be found at <ulink url="&url-bts;"></ulink>, or, if you have installed the <systemitem role="package">doc-debian</systemitem> package, you can look at the local files &file-bts-docs;.
de: Paketbetreuer interagieren mit dem BTS über E-Mail-Adressen auf <literal>&bugs-host;</literal>. Dokumentationen über verfügbare Befehle können Sie unter <ulink url="&url-bts;"></ulink> finden oder, falls Sie das Paket <systemitem role="package">doc-debian</systemitem> installiert haben, können Sie in die lokalen Dateien &file-bts-docs; sehen.
fr: Les responsables interagissent avec le système de suivi des bogues en utilisant l'adresse électronique <literal>&bugs-host;</literal>. Vous trouverez une documentation sur les commandes disponibles à l'adresse <ulink url="&url-bts;"></ulink> ou, si vous avez installé le paquet <systemitem role="package">doc-debian</systemitem>, dans les fichiers locaux &file-bts-docs;.
ja: メンテナは、<literal>&bugs-host;</literal> のメールアドレス経由で BTS に対応します。利用可能なコマンドについてのドキュメントは <ulink url="&url-bts;"></ulink> で参照可能ですし、もし <systemitem role="package">doc-debian</systemitem> パッケージをインストールしてあれば、ローカルファイル &file-bts-docs; で見ることも可能です。

source: Some find it useful to get periodic reports on open bugs. You can add a cron job such as the following if you want to get a weekly email outlining all the open bugs against your packages:
de: Einige finden es nützlich regelmäßig Berichte über offene Fehler zu erhalten. Sie können einen Cron-Job wie den folgenden hinzufügen, falls Sie wöchentlich eine E-Mail erhalten möchten, die alle Fehler Ihrer Pakete umreißt:
fr: Certains trouvent utile de recevoir régulièrement une synthèse des rapports de bogue ouverts. Si vous voulez recevoir une synthèse hebdomadaire relevant tous les rapports de bogue ouverts pour vos paquets, vous pouvez configurer <command>cron</command> comme suit :
ja: 定期的にオープンになっているバグについてのレポートを受け取るのも良いでしょう。あなたのパッケージでオープンになっているバグの全一覧を毎週受け取りたい場合、以下のような cron ジョブを追加します:

source: # ask for weekly reports of bugs in my packages &cron-bug-report;
de: # Anfrage wöchentlicher Berichte über Fehler in eigenen Paketen &cron-bug-report;
fr: # Synthèse hebdomadaire des rapports de bogue qui me concernent &cron-bug-report;
ja: # 自分のパッケージにあるバグのレポートを毎週取得する &cron-bug-report;

source: Replace <replaceable>address</replaceable> with your official Debian maintainer address.
de: Ersetzen Sie <replaceable>Adresse</replaceable> durch Ihre offizielle Debian-Betreueradresse.
fr: Remplacez <replaceable>address</replaceable> par votre adresse officielle de responsable Debian.
ja: <replaceable>address</replaceable> は、あなたの公式な Debian パッケージメンテナとしてのメールアドレスに置き換えてください。

source: Responding to bugs
de: Auf Fehler antworten
fr: Réponses aux bogues
ja: バグへの対応

source: When responding to bugs, make sure that any discussion you have about bugs is sent both to the original submitter of the bug, and to the bug itself (e.g., <email><replaceable>123</replaceable>@&bugs-host;</email>). If you're writing a new mail and you don't remember the submitter email address, you can use the <email><replaceable>123</replaceable>-submitter@&bugs-host;</email> email to contact the submitter <emphasis>and</emphasis> to record your mail within the bug log (that means you don't need to send a copy of the mail to <email><replaceable>123</replaceable>@&bugs-host;</email>).
de: Wenn Sie auf Fehler antworten, stellen Sie sicher, dass jegliche Diskussion, die Sie über Fehler führen, sowohl an den Originalabsender, als auch an den Fehler selbst geschickt wird (z.B. <email><replaceable>123</replaceable>@&bugs-host;</email>). Falls Sie eine neue E-Mail schreiben und sich nicht an die Absender-E-Mail-Adresse erinnern, können Sie die E-Mail-Adresse <email><replaceable>123</replaceable>-submitter@&bugs-host;</email> benutzen, um den Absender zu kontaktieren <emphasis>und</emphasis> Ihre E-Mail innerhalb des Fehlerprotokolls aufzuzeichnen (das bedeuted, dass Sie keine Kopie dieser E-Mail an <email><replaceable>123</replaceable>@&bugs-host;</email> senden müssen.
fr: Lorsque vous répondez à des rapports de bogue, assurez-vous que toutes vos discussions concernant les bogues sont envoyées au rapporteur du bogue et au bogue lui-même (<email><replaceable>123</replaceable>@&bugs-host;</email> par exemple). Si vous rédigez un nouveau courrier et si vous ne vous souvenez plus de l'adresse du rapporteur de bogue, vous pouvez utiliser l'adresse <email><replaceable>123</replaceable>-submitter@&bugs-host;</email> pour contacter le rapporteur <emphasis>et</emphasis> enregistrer votre courrier dans le journal du bogue (ce qui signifie que vous n'avez pas besoin d'envoyer une copie du courrier à <email><replaceable>123</replaceable>@&bugs-host;</email>).
ja: バグに対応する際は、バグについて行った議論がバグの元々の報告者とバグ自身 (例えば <email><replaceable>123</replaceable>@&bugs-host;</email>) の両方に送られているのを確認してください。新しくメールを書いていて元々の報告者のメールアドレスを思い出せない場合は、<email><replaceable>123</replaceable>-submitter@&bugs-host;</email> というメールアドレスが報告者へ連絡するのと、<emphasis>さらに</emphasis>バグのログへあなたがメールしたのを記録するのにも使えます (これは <email><replaceable>123</replaceable>@&bugs-host;</email> へメールのコピーを送らなくても済むことを意味しています)。

source: If you get a bug which mentions FTBFS, this means Fails to build from source. Porters frequently use this acronym.
de: Falls Sie einen Fehlerbericht erhalten, der FTBFS erwähnt, so bedeutet dies »Fails to build from source« (Kann nicht aus der Quelle erstellt werden). Portierer benutzen diese Abkürzung öfters.
fr: Si vous recevez un rapport de bogue mentionnant « FTBFS », cela signifie une erreur de construction à partir du paquet source (« <literal>Fails To Build From Source</literal> »). Les porteurs emploient fréquemment cet acronyme.
ja: FTBFS である旨のバグを受け取った場合、これはソースからビルドできないこと (Fails to build from source) を意味します。移植作業をしている人たちはこの略語をよく使います。
