Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: While preparing the patch, you should better be aware of any package-specific practices that the maintainer might be using. Taking them into account reduces the burden of integrating your changes into the normal package workflow and thus increases the chances that integration will happen. A good place where to look for for possible package-specific practices is <ulink url="&url-debian-policy;ch-source.html#s-readmesource"><filename>debian/README.source</filename></ulink>.
de: Während Sie das Patch vorbereiten, sollten Sie besser einige paketspezifischen Verfahren kennen, die der Betreuer möglicherweise benutzt. Ihn einzubeziehen verringert die Belastung, die Änderungen zurück in den normalen Arbeitsablauf des Pakets zu integrieren und vergrößert daher die Möglichkeit, dass das geschieht. Ein guter Ort, um etwas über die paketspezifischen Methoden zu erfahren, ist <ulink url="&url-debian-policy;ch-source.html#s-readmesource"><filename>debian/README.source</filename></ulink>.
fr: Lors de la préparation du correctif, vous devriez connaître les pratiques spécifiques au paquet potentiellement utilisées par le responsable. Les prendre en compte réduit le fardeau d'intégrer les modifications dans les tâches quotidiennes (« <literal>workflow</literal> ») du paquet et augmente ainsi les chances d'intégration. Un bon endroit pour chercher d'éventuelles pratiques spécifiques est <ulink url="&url-debian-policy;ch-source.html#s-readmesource"><filename>debian/README.source</filename></ulink>.
ja: パッチを準備している間、メンテナが利用しているであろうパッケージ固有の慣例に注意を向けた方がいいでしょう。これを考慮に入れることは、通常のパッケージの作業工程に対してあなたの変更が入る負担を減らし、それに従って変更が入る可能性を高めます。パッケージ固有の慣例がある可能性があるので探すと良い場所は、<ulink url="&url-debian-policy;ch-source.html#s-readmesource"><filename>debian/README.source</filename></ulink> です。

source: Unless you have an excellent reason not to do so, you must then give some time to the maintainer to react (for example, by uploading to the <literal>DELAYED</literal> queue). Here are some recommended values to use for delays:
de: Sofern Sie keinen ausgezeichneten Grund haben, dies nicht zu tun, müssen Sie dem Paketbetreuer Zeit zum Reagieren geben (zum Beispiel durch Hochladen in die <literal>DELAYED</literal>-Warteschlange). Hier sind einige empfohlene Werte, die für Verzögerungen benutzt werden:
fr: À moins d'avoir une excellente raison de ne pas le faire, vous devez laisser du temps au responsable pour réagir (par exemple en envoyant le paquet dans la file <literal>DELAYED</literal>). Voici quelques valeurs recommandées pour les délais :
ja: そうするべき十二分な理由が無い限り、メンテナに対応する時間を与えるべきです (例えば <literal>DELAYED</literal> キューにアップロードすることによってこれを行います)。以下が delayed キューを使う際のお勧めの値です:

source: Upload fixing only release-critical bugs older than 7 days, with no maintainer activity on the bug for 7 days and no indication that a fix is in progress: 0 days
de: Der Upload behebt nur release-kritische Fehler, die älter als sieben Tage sind, ohne Betreueraktivität beim Fehler für sieben Tage und ohne Hinweis, dass eine Fehlerbehebung im Gang ist: 0 Tage
fr: envoi corrigeant seulement un bogue critique pour la publication ouvert il y a plus de sept jours, sans réaction du responsable sur le bogue pendant sept jours, et sans indication qu'un correctif est en cours : zéro jour ;
ja: 7 日以上経っているリリースクリティカルバグのみを修正するアップロードで、バグに対するメンテナの活動が 7 日間見られなく、修正が行われている形跡が無い: 0 日

source: Upload fixing only release-critical bugs older than 7 days: 2 days
de: Upload, der nur release-kritische Fehler behebt, die älter als sieben Tage sind: zwei Tage
fr: envoi corrigeant seulement un bogue critique pour la publication ouvert il y a plus de sept jours : deux jours ;
ja: 7 日以上経っているリリースクリティカルバグのみを修正するアップロード: 2 日

source: Upload fixing only release-critical and important bugs: 5 days
de: Upload, der nur release-kritische Fehler und Fehler mit Schweregrad »important« behebt: fünf Tage
fr: envoi corrigeant seulement un bogue critique pour la publication ou important : cinq jours ;
ja: リリースクリティカルバグや重要なバグの修正のみのアップロード: 5 日

source: Other NMUs: 10 days
de: Andere NMUs: zehn Tage
fr: autres NMU : dix jours.
ja: 他の NMU: 10 日

source: Those delays are only examples. In some cases, such as uploads fixing security issues, or fixes for trivial bugs that blocking a transition, it is desirable that the fixed package reaches <literal>unstable</literal> sooner.
de: Diese Verzögerungen sind nur Beispiele. In manchen Fällen, wie bei Uploads, die Sicherheitsprobleme beheben oder der Behebung belangloser Fehler, die einen Übergang blockieren, ist es wünschenswert, dass ein repariertes Paket <literal>unstable</literal> eher erreicht.
fr: Ces délais sont simplement donnés à titre indicatifs. Dans certains cas, de tels envois corrigeant des problèmes de sécurité, ou corrigeant des bogues insignifiants qui bloquent une transition, il est préférable que le paquet atteigne <literal>unstable</literal> au plus tôt.
ja: この値は例に過ぎません。セキュリティ問題を修正するアップロードや、移行を阻む些細なバグを修正するなど、いくつかのケースでは修正されたパッケージが <literal>不安定版 (unstable)</literal> にすぐ入るようになるのは望ましいことです。

source: Sometimes, release managers decide to allow NMUs with shorter delays for a subset of bugs (e.g release-critical bugs older than 7 days). Also, some maintainers list themselves in the <ulink url="&url-low-threshold-nmu;">Low Threshold NMU list</ulink>, and accept that NMUs are uploaded without delay. But even in those cases, it's still a good idea to give the maintainer a few days to react before you upload, especially if the patch wasn't available in the BTS before, or if you know that the maintainer is generally active.
de: Manchmal entscheiden Veröffentlichungsverwalter NMUs mit kürzeren Verzögerungen für eine Untermenge von Fehlern zu erlauben (z.B. release-kritische Fehler, die älter als sieben Tage sind). Außerdem führen manche Paketbetreuer sie selbst in der Liste <ulink url="&url-low-threshold-nmu;">LowThresholdNmu</ulink> (niedrige Schwelle für NMUs) auf und akzeptieren, dass NMUs ohne Verzögerung hochgeladen werden. Aber sogar in diesen Fällen ist es immer noch ratsam, dem Betreuer ein paar Tage Zeit zum Reagieren zu geben bevor Sie etwas hochladen, insbesondere, wenn das Patch vorher nicht im BTS verfügbar war oder falls Sie wissen, dass der Paketgetreuer allgemein aktiv ist.
fr: Parfois, les responsables de publication peuvent décider d'accepter des délais plus courts pour les NMU corrigeant un sous-ensemble de bogues (par exemple les bogues critiques pour la publication ouverts il y a plus de sept jours). Certains responsables s'inscrivent d'eux-mêmes à la <ulink url="&url-low-threshold-nmu;">liste permissive de NMU (« <literal>Low Threshold NMU list</literal> »)</ulink>, et acceptent que les NMU soient effectuées sans délai. Mais même dans ce cas, il est toujours préférable de laisser quelques jours au responsable pour réagir avant votre envoi, d'autant plus si le correctif n'était pas disponible auparavant dans le BTS, ou si vous savez que le responsable est habituellement actif.
ja: 時々、リリースマネージャが特定のバグに対して短い delay 日数の NMU を許可を認めることがあります (7 日より古いリリースクリティカルバグなど)。また、一部のメンテナは <ulink url="&url-low-threshold-nmu;">Low Threshold NMU list</ulink> に自身を挙げており、遅延なしの NMU アップロードを許可しています。しかしどのような場合であっても、特にパッチが BTS で以前手に入らなかったり、メンテナが大抵アクティブであるのを知っている場合など、アップロードの前にメンテナに対して数日与えるのは良い考えです。

source: After you upload an NMU, you are responsible for the possible problems that you might have introduced. You must keep an eye on the package (subscribing to the package on the PTS is a good way to achieve this).
de: Nachdem Sie einen NMU hochgeladen haben, sind Sie für mögliche Probleme verantwortlich, die Sie möglicherweise eingeleitet haben. Sie müssen das Paket im Auge behalten (ein gute Möglichkeit dies zu erreichen, ist es, das Paket im PTS zu abonnieren ).
fr: Après une NMU, vous êtes responsable d'éventuels problèmes introduits. Vous devez garder un œil sur le paquet (s'inscrire au paquet via le PTS est un bon moyen).
ja: NMU アップロード後、あなたは自分が導入したであろう問題に責任を持つことになります。パッケージを見張らなければなりません (これを行うには PTS 上のパッケージを購読するのが良い方法です)。

source: This is not a license to perform NMUs thoughtlessly. If you NMU when it is clear that the maintainers are active and would have acknowledged a patch in a timely manner, or if you ignore the recommendations of this document, your upload might be a cause of conflict with the maintainer. You should always be prepared to defend the wisdom of any NMU you perform on its own merits.
de: Dies ist keine Lizenz, rücksichtslos NMUs durchzuführen. Falls Sie einen NMU auf den Weg bringen, wenn es klar ist, dass die Betreuer aktiv sind und ein Patch zeitnah anerkennen würden oder falls Sie die Empfehlungen dieses Dokuments ignorieren, könnte Ihr Upload zu einem Konflikt mit dem Betreuer führen. Sie sollten immer darauf vorbereitet sein, im Nachhinein für den von Ihnen durchgeführten NMU aus eigener Kraft einstehen zu können.
fr: Il ne s'agit pas d'un permis pour faire des NMU irréfléchies. Si vous procédez à une NMU alors que le responsable est clairement actif et aurait pris en considération un correctif de façon opportune, ou si vous passez outre les recommendations de ce document, votre envoi risque d'être une cause de conflit avec le responsable. Vous devriez toujours être prêt à défendre le bien-fondé de toute NMU effectuée.
ja: これは、軽率な NMU を行うための許可証ではありません。明らかにメンテナがアクティブで時期を逃さずパッチについて対応している場合や、このドキュメントに書かれている推奨を無視している場合など、あなたによるアップロードはメンテナと衝突を起こすでしょう。NMU のメリットについて、自分が行ったことの賢明さを常に弁護できるようにしておく必要があります。

source: NMUs and <filename>debian/changelog</filename>
de: NMUs und <filename>debian/changelog</filename>
fr: NMU et <filename>debian/changelog</filename>
ja: NMU と <filename>debian/changelog</filename>

source: Just like any other (source) upload, NMUs must add an entry to <filename>debian/changelog</filename>, telling what has changed with this upload. The first line of this entry must explicitely mention that this upload is an NMU, e.g.:
de: Genauso wie jeder andere (Quell-) Upload, müssen NMUs einen Eintrag in <filename>debian/changelog</filename> hinzufügen, der mitteilt, was mit diesem Upload geändert wurde. Die erste Zeile muss explizit erwähnen, dass dieser Upload ein NMU ist, z.B:
fr: Comme tout autre envoi (de paquet source), les NMU doivent comporter une nouvelle entrée dans le fichier <filename>debian/changelog</filename>, expliquant les modifications effectuées dans cet envoi. La première ligne de cette entrée doit signaler explicitement qu'il s'agit d'une NMU, par exemple :
ja: 他の (ソース) アップロード同様、NMU は <filename>debian/changelog</filename> にそのアップロードで何を変更したのかを示すエントリを追加せねばなりません。エントリの最初の行は、このアップロードが NMU であることを明白に示す必要があります。例えばこうです:

source: The way to version NMUs differs for native and non-native packages.
de: Die Möglichkeiten der Versionsvergabe für NMUs unterscheidet sich bei nativen und nicht nativen Paketen.
fr: La façon de numéroter les versions lors d'une NMU est différente s'il s'agit d'un paquet natif ou non.
ja: NMU のバージョンのつけ方は、ネイティブなパッケージとネイティブではないパッケージでは異なります。

source: If the package is a native package (without a Debian revision in the version number), the version must be the version of the last maintainer upload, plus <literal>+nmu<replaceable>X</replaceable></literal>, where <replaceable>X</replaceable> is a counter starting at <literal>1</literal>. If the last upload was also an NMU, the counter should be increased. For example, if the current version is <literal>1.5</literal>, then an NMU would get version <literal>1.5+nmu1</literal>.
de: Falls es sich um ein natives Paket (ohne Debian-Revision in der Versionsnummer) handelt, muss die Versionsnummer die des letzten Betreuer-Uploads plus <literal>+nmu<replaceable>X</replaceable></literal> sein, wobei <replaceable>X</replaceable> ein Zähler ist, der bei <literal>1</literal> beginnt. Falls der letzte Upload auch ein NMU war, wird der Zähler erhöht. Wenn beispielsweise die aktuelle Version <literal>1.5</literal> ist, dann würde der NMU die Version <literal>1.5+nmu1</literal> werden.
fr: Si le paquet est natif (sans partie révision Debian dans le numéro de version du paquet), la version doit être celle du dernier envoi du responsable, suivi de <literal>+nmu<replaceable>X</replaceable></literal>, où <replaceable>X</replaceable> est un compteur commençant à <literal>1</literal>. Si le dernier envoi était également une NMU, le compteur devrait être augmenté. Par exemple, si la version actuelle est <literal>1.5</literal>, alors une NMU devrait prendre la version <literal>1.5+nmu1</literal>.
ja: パッケージがネイティブパッケージの場合 (バージョン番号に Debian リビジョンが付かない)、バージョンはメンテナの最後のアップロードのバージョン + <literal>+nmu<replaceable>X</replaceable></literal> となり、<replaceable>X</replaceable> は <literal>1</literal> から始まる数字になります。最後のアップロードが同様に NMU の場合は、数字を増やします。例えば、現在のバージョンが <literal>1.5</literal> だとすると、NMU はバージョンが <literal>1.5+nmu1</literal> になります。

source: If the package is not a native package, you should add a minor version number to the Debian revision part of the version number (the portion after the last hyphen). This extra number must start at <literal>1</literal>. For example, if the current version is <literal>1.5-2</literal>, then an NMU would get version <literal>1.5-2.1</literal>. If a new upstream version is packaged in the NMU, the Debian revision is set to <literal>0</literal>, for example <literal>1.6-0.1</literal>.
de: Falls es sich um kein natives Paket handelt, sollten Sie eine untergeordnete Versionsnummer zum Debian-Revisionsteil der Versionsnummer hinzufügen (der Teil nach dem letzten Bindestrich). Diese zusätzliche Zahl muss bei <literal>1</literal> anfangen. Wenn zum Beispiel die aktuelle Version <literal>1.5-2</literal> ist, dann würde ein NMU die Version <literal>1.5-2.1</literal> erhalten. Falls eine neue Originalversion im NMU paketiert wird, wird die Debian-Revision auf <literal>0</literal> gesetzt, zum Beispiel <literal>1.6-0.1</literal>.
fr: Si le paquet n'est pas natif, vous devriez ajouter un numéro de version mineure à la partie révision Debian du numéro de version (la partie après le dernier tiret). Ce numéro supplémentaire devrait commencer à <literal>1</literal>. Par exemple si la version actuelle est <literal>1.5-2</literal>, alors une NMU devrait prendre la version <literal>1.5-2.1</literal>. Si une nouvelle version amont est empaquetée lors de la NMU, la révision Debian est configurée à <literal>0</literal>, par exemple <literal>1.6-0.1</literal>.
ja: パッケージがネイティブパッケージではない場合は、バージョン番号の Debian リビジョン部分 (最後のハイフン以下の部分) にマイナーバージョン番号を追加します。例えば、現在のバージョンが <literal>1.5-2</literal> であれば、NMU は <literal>1.5-2.1</literal> というバージョンになります。開発元のバージョンが新しくなったものが NMU でパッケージになった場合は、Debian リビジョンは <literal>0</literal> に設定されます。例えば <literal>1.6-0.1</literal> です。

source: In both cases, if the last upload was also an NMU, the counter should be increased. For example, if the current version is <literal>1.5+nmu3</literal> (a native package which has already been NMUed), the NMU would get version <literal>1.5+nmu4</literal>.
de: In beiden Fällen sollte der Zähler erhöht werden, falls der letzte Upload auch ein NMU war. Wenn zum Beispiel die letzte Version <literal>1.5+nmu3</literal> war (ein natives Paket, für das bereits ein NMU durchgeführt wurde), würde der NMU die Version <literal>1.5+nmu4</literal> erhalten.
fr: Dans les deux cas, si le dernier envoi était également une NMU, le compteur devrait être augmenté. Par exemple, si la version actuelle est <literal>1.5+nmu3</literal> (un paquet natif déjà mis à jour indépendamment), la NMU devrait prendre la version <literal>1.5+nmu4</literal>.
ja: どちらの場合でも、最後のアップロードも NMU だった場合には数字が増えます。例えば、現在のバージョンが <literal>1.5+nmu3</literal> (既に NMU されたネイティブパッケージ) の場合、NMU は <literal>1.5+nmu4</literal> というバージョンになります。

source: A special versioning scheme is needed to avoid disrupting the maintainer's work, since using an integer for the Debian revision will potentially conflict with a maintainer upload already in preparation at the time of an NMU, or even one sitting in the ftp NEW queue. It also has the benefit of making it visually clear that a package in the archive was not made by the official maintainer.
de: Es wird ein spezielles Schema der Versionsvergabe benötigt, um zu verhindern dass die Arbeit des Maintainers unterbrochen wird, da die Benutzung einer Ganzzahl für die Debian-Revision einen potentiellen Konflikt mit einem Betreuer-Upload hervorruft, der bereits zur Zeit des NMUs vorbereitet wird oder sogar in der Ftp-Warteschlange NEW ist. Es hat außerdem den Vorteil, dass es optisch klar zeigt, dass ein Paket im Archiv nicht vom offiziellen Betreuer stammt.
fr: Une numérotation de version spécifique est nécessaire pour éviter de perturber le travail du responsable, car l'utilisation d'un entier dans la révision Debian risque d'entrer en conflit avec un envoi déjà en préparation lors de la NMU, ou même déjà dans la file d'attente de nouveaux paquets (<literal>NEW</literal>), Cela présente également l'avantage d'indiquer clairement que le paquet dans l'archive n'a pas été préparé par le responsable officiel.
ja: 特別なバージョン付け方法が必要とされるのは、メンテナの作業を混乱させるのを避けるためです。何故ならば、Debian リビジョンのために整数を使っていると、NMU の際に既に準備されていたメンテナによるアップロードや、さらには ftp NEW queue にあるパッケージともぶつかる可能性があります。これには、アーカイブのパッケージが公式メンテナによるものではない、と視覚的に明らかにする利点もあります。

source: Using the <literal>DELAYED/</literal> queue
de: Benutzung der Warteschlange <literal>DELAYED/</literal>
fr: Utilisation de la file d'attente <literal>DELAYED/</literal>
ja: <literal>DELAYED/</literal> キューを使う

source: Having to wait for a response after you request permission to NMU is inefficient, because it costs the NMUer a context switch to come back to the issue. The <literal>DELAYED</literal> queue (see <xref linkend="delayed-incoming"/>) allows the developer doing the NMU to perform all the necessary tasks at the same time. For instance, instead of telling the maintainer that you will upload the updated package in 7 days, you should upload the package to <literal>DELAYED/7</literal> and tell the maintainer that they have 7 days to react. During this time, the maintainer can ask you to delay the upload some more, or cancel your upload.
de: Nachdem Sie um Erlaubnis ersucht haben, einen NMU durchzuführen, ist es ineffizient, auf eine Antwort zu warten, da es für denjenigen, der den NMU durchführt, einen Kontextwechsel zurück zu diesem Thema erfordert. Die Warteschlange <literal>DELAYED</literal> (siehe <xref linkend="delayed-incoming"/>) ermöglicht es einem Entwickler einen NMU und alle nötigen Aufgaben gleichzeitig durchzuführen. Sie sollten zum Beispiel anstatt dem Betreuer mitzuteilen, dass Sie das aktualisierte Paket in sieben Tagen hochladen werden, das Paket nach <literal>DELAYED/7</literal> hochladen und dem Betreuer mitteilen, dass er sieben Tage zum reagieren hat. Während dieser Zeit kann der Betreuer Sie bitten, den Upload etwas länger aufzuschieben oder Ihren Upload abzubrechen.
fr: Attendre une réponse après avoir demandé la permission de procéder à une NMU est inefficace, car cela coûte au demandeur une commutation de contexte (« <literal>context switch</literal> ») pour revenir sur le problème. La file d'attente <literal>DELAYED/</literal> (voir <xref linkend="delayed-incoming"/>) permet au développeur préparant une NMU d'accomplir toutes les tâches nécessaire en même temps. Par exemple, plutôt que dire au responsable que vous allez envoyer le nouveau paquet dans sept jours, vous devriez envoyer le paquet vers <literal>DELAYED/7</literal> et dire au responsable qu'il a sept jours pour réagir. Pendant ce temps, le responsable peut vous demander de retarder un peu plus votre envoi, ou l'annuler.
ja: NMU の許可を求めた後で待っているのは効率的ではありません。NMU した人が作業にもどるために頭を切り替えるのに手間がかかるからです。<literal>DELAYED</literal> キュー (<xref linkend="delayed-incoming"/> 参照) は、開発者が NMU をするのに必要な作業を同時にできるようになります。例えば、メンテナに対して更新したパッケージを 7 日後にアップロードするのを伝えるのではなく、パッケージを <literal>DELAYED/7</literal> にアップロードしてメンテナに対して対応するのに 7 日間あることを伝えるべきです。この間、メンテナはもっとアップロードを遅らせるかアップロードをキャンセルするかを尋ねることができます。

source: The <literal>DELAYED</literal> queue should not be used to put additional pressure on the maintainer. In particular, it's important that you are available to cancel or delay the upload before the delay expires since the maintainer cannot cancel the upload themselves.
de: Die Warteschlange <literal>DELAYED</literal> sollte nicht benutzt werden, um zusätzlichen Druck auf den Paketbetreuer auszuüben. Es ist besonders wichtig, dass Sie erreichbar sind, um die Verzögerung des Uploads abzubrechen, bevor die Zeit abläuft, da der Betreuer den Upload nicht selbst abbrechen kann.
fr: La file d'attente <literal>DELAYED</literal> ne devrait pas être utilisée pour augmenter la pression sur le responsable. Notamment, il est important d'être disponible pour annuler ou retarder l'envoi avant la fin du délai car le responsable ne peut pas le faire lui-même.
ja: <literal>DELAYED</literal> キューは、無用のプレッシャーをメンテナに与えるために使われるべきではありません。特に、メンテナはアップロードを自身ではキャンセルできないので、delay が完了する前にアップロードをキャンセルあるいは遅らせることができるのはあなただ、という点が重要です。

source: If you make an NMU to <literal>DELAYED</literal> and the maintainer updates the package before the delay expires, your upload will be rejected because a newer version is already available in the archive. Ideally, the maintainer will take care to include your proposed changes (or at least a solution for the problems they address) in that upload.
de: Falls Sie einen NMU nach <literal>DELAYED</literal> durchführen und der Betreuer das Paket vor Ablauf der Verzögerung aktualisiert, wird Ihr Upload abgelehnt, da bereits eine neuere Version im Archiv verfügbar ist. Idealerweise achtet der Betreuer darauf, dass er die von Ihnen vorgeschlagenen Änderungen (oder zumindest eine Lösung für die Probleme, die sie behandeln) in diesen Upload einfließen lässt.
fr: Si vous procédez à une NMU vers <literal>DELAYED</literal> et que le responsable envoie son paquet avant la fin du délai, votre envoi sera rejeté car une nouvelle version sera alors disponible dans l'archive. Dans l'idéal, le responsable se chargera d'intégrer votre proposition (ou du moins une solution pour le problème en question) dans son envoi.
ja: <literal>DELAYED</literal> を使った NMU を行って delay が完了する前にメンテナがパッケージを更新した場合には、アーカイブに既により新しいバージョンがあるので、あなたのアップロードは拒否されます。理想的なのは、メンテナがそのアップロードであなたが提案した変更 (あるいは少なくとも対応した問題の解決方法) を含めるのを取り仕切ることです。

source: NMUs from the maintainer's point of view
de: NMUs aus Sicht des Paketbetreuers
fr: NMU d'un point de vue du responsable
ja: メンテナの視点から見た NMU

source: When someone NMUs your package, this means they want to help you to keep it in good shape. This gives users fixed packages faster. You can consider asking the NMUer to become a co-maintainer of the package. Receiving an NMU on a package is not a bad thing; it just means that the package is interesting enough for other people to work on it.
de: Wenn jemand einen NMU Ihres Pakets dürchführt, bedeutet dies, dass er Ihnen helfen möchte, es in einem guten Zustand zu halten. Dies beschert den Anwendern schneller reparierte Pakete. Sie könnten überlegen, ob Sie denjenigen, der das NMU durchführte, fragen möchten, ob er Mitbetreuer des Pakets werden will. Der Erhalt eines NMUs für ein Paket ist keine schlechte Sache; es bedeutet nur, dass das Paket interessant genug ist, dass andere Leute daran arbeiten.
fr: Quand quelqu'un réalise une NMU sur votre paquet, c'est pour vous aider à le garder en bon état. Cela permet aux utilisateurs d'obtenir un paquet corrigé au plus vite. Vous pouvez envisager de proposer à l'auteur de la NMU de devenir co-responsable du paquet. Recevoir une NMU sur un paquet n'est pas une mauvaise chose : cela signifie simplement que le paquet est suffisamment intéressant pour que d'autres personnes veuillent travailler dessus.
ja: 誰かがあなたのパッケージを NMU した場合、これは彼らがパッケージを良い形に保つのを助けたいと思っているということです。これによって、ユーザへ修正したパッケージをより早く届けます。NMU した人に、パッケージの副メンテナになることを尋ねるのを考えてみるのも良いでしょう。パッケージに対して NMU を受け取るのは悪いことではありません。それは、単にそのパッケージが他の人が作業する価値があるという意味です。
