Repository: lurdan/trans-ddp
Catalog: developers-reference/po4a/po/*.po
Languages: de, fr, ja

source: The rules for non-maintainer uploads differ during the parties because the announcement of the party is considered prior notice for NMU. If you have packages that may be affected by the party (because they have release critical bugs for example), you should send an update to each of the corresponding bug to explain their current status and what you expect from the party. If you don't want an NMU, or if you're only interested in a patch, or if you will deal yourself with the bug, please explain that in the BTS.
de: Die Regeln für Non-Maintainer-Uploads unterscheiden sich während der Parties, da die Ankündigung der Party als vorausgehende Ankündigung für den NMU angesehen wird. Falls Sie Pakete haben, die von der Party betroffen sind (da sie zum Beispiel release-kritische Fehler enthalten), sollten Sie eine Aktualisierung zu jedem zugehörigen Fehler senden, um seinen aktuellen Status zu erklären und und was Sie von der Party erwarten. Falls Sie keinen NMU möchten, nicht an einem Patch interessiert sind oder den Fehler selbst bewältigen möchten, erklären Sie dies bitte im BTS.
fr: Les règles pour les mises à jour indépendantes (<literal>NMU</literal>) sont différentes au cours de la chasse parce que l'annonce de la chasse est considérée comme une annonce préalable pour les NMU. Si vous avez des paquets qui peuvent être affectés par la chasse (parce qu'ils ont des bogues critiques par exemple), vous devriez envoyer une mise à jour pour chaque bogue correspondant pour expliquer leur état actuel et ce que vous attendez de la chasse. Si vous ne voulez pas de NMU, si vous n'êtes intéressé que par un correctif, ou si vous voulez gérer vous-même le bogue, veuillez l'expliquer dans le BTS.
ja: メンテナ以外によるアップロード (non-maintainer upload) のルールはパーティの開催中とそれ以外で違います。これは、パーティのアナウンスは NMU の予告であると考えられているためです。パーティによって影響を受けるパッケージを持っている場合 (例えばリリースクリティカルバグを持っている場合) は、それぞれ対応するバグについて現状説明とこのパーティでどの様なことを期待しているのかを説明しないといけません。NMU を望まない、パッチでの対応にのみ興味がある、あるいは自分自身で対処をする予定の場合は、BTS で説明をしてください。

source: People participating in the party have special rules for NMU, they can NMU without prior notice if they upload their NMU to DELAYED/3-day at least. All other NMU rules apply as usually; they should send the patch of the NMU to the BTS (to one of the open bugs fixed by the NMU, or to a new bug, tagged fixed). They should also respect any particular wishes of the maintainer.
de: Teilnehmer der Party haben besondere Regeln für NMUs. Sie können NMUs ohne vorherige Ankündigung durchführen, falls sie mindestens nach DELAYED/3-day hochladen. Alle anderen NMU-Regeln gelten wie üblich; sie sollten das Patch des NMUs an das BTS senden (an einen der offenen Fehler, der durch den NMU behoben wird oder an einen neuen Fehler, der als »fixed« gekennzeichnet wird). Sie sollten außerdem die besonderen Wünsche des Betreuers respektieren.
fr: Les personnes qui participent à la chasse ont des règles spécifiques pour les NMU, elles peuvent en faire une sans avertissement préalable si elles envoient leur paquet avec un délai d'au moins trois jours dans <literal>DELAYED/3-day</literal>. Toutes les autres règles de NMU s'appliquent comme d'habitude ; le correctif de la NMU devrait être envoyé dans le BTS (pour l'un des bogues ouverts corrigé par la NMU ou pour un nouveau bogue marqué corrigé). Les participants devraient également respecter tout souhait du responsable s'il en a exprimé.
ja: パーティに参加している人には NMU についての特別ルールが割り当てられます。NMU について、少なくとも 3 日遅延してアップロードを行う場合 (DELAYED/3-day キューなどへのアップロードの場合) は予告無しで NMU できるのです。他の NMU ルールは全て通常通りに適用されます - NMU のパッチを BTS に送付する必要があります (修正されていないバグのいずれかを NMU で修正する、あるいは新たなバグにパッチを送り、fixed とタグを付けるなど)。それから、作業者は各メンテナの要望に沿う必要があります。

source: If you don't feel confident about doing an NMU, just send a patch to the BTS. It's far better than a broken NMU.
de: Falls Sie sich nicht sicher fühlen, einen NMU durchzuführen, senden Sie nur ein Patch an das BTS. Das ist weit besser als ein kaputter NMU.
fr: Si vous ne vous sentez pas à l'aise avec une NMU, envoyez simplement un correctif au BTS. C'est de loin meilleur qu'une NMU défectueuse.
ja: NMU をする自信が無い場合は、BTS へパッチを投げるだけにしてください。NMU でパッケージを壊してしまうより、遥かに良いことです。

source: Contacting other maintainers
de: Andere Paketbetreuer kontaktieren
fr: Contact avec d'autres responsables
ja: 他のメンテナに連絡を取る

source: During your lifetime within Debian, you will have to contact other maintainers for various reasons. You may want to discuss a new way of cooperating between a set of related packages, or you may simply remind someone that a new upstream version is available and that you need it.
de: Während Ihres Lebens innerhalb Debian werden Sie aus verschiedenen Gründen Kontakt zu anderen Betreuern haben. Sie möchten vielleicht neue Wege der Kooperation zwischen einer Zusammenstellung verwandter Pakete diskutieren oder einfach jemanden daran erinnern, dass eine neue Originalversion verfügbar ist, die Sie benötigen.
fr: Pendant vos activités dans Debian, vous contacterez d'autres responsables pour différentes raisons. Vous pourrez vouloir discuter d'une nouvelle façon de coopérer au sein d'un ensemble de paquets liés, ou vous pouvez simplement rappeler à quelqu'un qu'une nouvelle version est disponible et que vous en avez besoin.
ja: Debian と共に過ごす間、様々な理由で他のメンテナに連絡を取りたくなることでしょう。関連パッケージ間での共同作業の新たなやり方について協議したい場合や、開発元で自分が使いたい新しいバージョンが利用可能になっていることを単に知らせたい場合などです。

source: Looking up the email address of the maintainer for the package can be distracting. Fortunately, there is a simple email alias, <literal><replaceable>package</replaceable>@&packages-host;</literal>, which provides a way to email the maintainer, whatever their individual email address (or addresses) may be. Replace <replaceable>package</replaceable> with the name of a source or a binary package.
de: Die E-Mail-Adresse des Paketbetreuers herauszusuchen, kann störend sein. Glücklicherweise gibt es einen einfachen E-Mail-Alias, <literal><replaceable>Paket</replaceable>@&packages-host;</literal>, der eine Möglichkeit bietet, dem Betreuer zu mailen, ganz gleich wie seine E-Mail-Adresse (oder Adressen) auch sein mag. Ersetzen Sie <replaceable>Paket</replaceable> durch den Namen eines Quell- oder Binärpakets.
fr: Chercher l'adresse d'un responsable d'un paquet peut être fastidieux. Heureusement, il existe un alias de courrier simple, <literal><replaceable>paquet</replaceable>@&packages-host;</literal>, qui fournit un moyen d'envoyer un courrier à un responsable, quelle que soit son adresse (ou ses adresses). Remplacez <replaceable>paquet</replaceable> par le nom du paquet source ou binaire.
ja: パッケージメンテナのメールアドレスを探しだすのは骨が折れます。幸いな事に、<literal><replaceable>パッケージ名</replaceable>@&packages-host;</literal> というシンプルなメールのエイリアスがあり、メンテナらの個人アドレスが何であれメンテナへメールを届ける手段となっています。<replaceable>パッケージ名</replaceable> はパッケージのソース名かバイナリパッケージ名に置き換えてください。

source: You may also be interested in contacting the persons who are subscribed to a given source package via <xref linkend="pkg-tracking-system"/>. You can do so by using the <literal><replaceable>package</replaceable>@&pts-host;</literal> email address.
de: Möglicherweise sind Sie außerdem daran interessiert, Personen zu kontaktieren, die ein bestimmtes Quellpaket mittels <xref linkend="pkg-tracking-system"/> abonniert haben. Sie können dazu die E-Mail-Adresse <literal><replaceable>Paket</replaceable>@&pts-host;</literal> benutzen.
fr: Vous pouvez également vouloir contacter les personnes inscrites à un paquet source donné, cf. <xref linkend="pkg-tracking-system"/>. Vous pouvez le faire en utilisant l'adresse <literal><replaceable>paquet</replaceable>@&pts-host;</literal>.
ja: <xref linkend="pkg-tracking-system"/> 経由でソースパッケージの購読を行っている人に連絡を取りたくなるかもしれません。その場合は <literal><replaceable>パッケージ名</replaceable>@&pts-host;</literal> メールアドレスが使えます。

source: Dealing with inactive and/or unreachable maintainers
de: Sich mit inaktiven und/oder nicht erreichbaren Paketbetreuern beschäftigen
fr: Gestion des responsables non joignables
ja: 活動的でない、あるいは連絡が取れないメンテナに対応する

source: If you notice that a package is lacking maintenance, you should make sure that the maintainer is active and will continue to work on their packages. It is possible that they are not active any more, but haven't registered out of the system, so to speak. On the other hand, it is also possible that they just need a reminder.
de: Falls Sie bemerken, dass es einem Paket an Betreuung mangelt, sollten Sie sicherstellen, dass der Betreuer aktiv ist und weiter an seinen Paketen arbeitet. Es ist möglich, dass er nicht mehr aktiv ist, sich aber nicht aus dem System abgemeldet hat. Andererseits ist es auch möglich, dass er nur eine Erinnerung braucht.
fr: Si vous remarquez qu'un paquet manque de maintenance, vous devriez vous assurer que le responsable est toujours actif et qu'il continue à travailler sur ses paquets. Il est possible qu'il ne soit plus actif, mais qu'il n'ait pas démissionné du système. D'un autre côté, il est possible qu'il ait simplement besoin d'un rappel.
ja: パッケージがメンテナンスされていないと気づいた場合、メンテナが活動的でパッケージの作業を続けるかどうかを確認する必要があります。もはや活動的な状態ではない可能性もありますが、言わばシステムに登録していなかったという可能性もあります。あるいは、単に確認が必要なだけという可能性もあります。

source: There is a simple system (the MIA database) in which information about maintainers who are deemed Missing In Action is recorded. When a member of the QA group contacts an inactive maintainer or finds more information about one, this is recorded in the MIA database. This system is available in <filename>/org/qa.debian.org/mia</filename> on the host <literal>qa.debian.org</literal>, and can be queried with the <command>mia-query</command> tool. Use <command>mia-query --help</command> to see how to query the database. If you find that no information has been recorded about an inactive maintainer yet, or that you can add more information, you should generally proceed as follows.
de: Es gibt ein einfaches System (die MIA-Datenbank), in der Informationen über Paketbetreuer aufgezeichnet werden, die als »Missing In Action« (vermisst) gelten. Wenn ein Mitglied der QS-Gruppe einen inaktiven Betreuer kontaktiert oder weitere Informationen über ihn findet, wird dies in der MIA-Datenbank aufgezeichnet. Das System ist unter <filename>/org/qa.debian.org/mia</filename> auf dem Rechner <literal>qa.debian.org</literal> verfügbar und kann mit dem Werkzeug <command>mia-query</command> abgefragt werden. Benutzen Sie <command>mia-query --help</command>, um zu erfahren, wie Sie Abfragen an die Datenbank richten. Falls Sie der Meinung sind, dass noch keine Informationen über einen inaktiven Betreuer aufgezeichnet wurde oder dass Sie weitere Informationen hinzufügen können, sollten Sie im Allgemeinen wie folgt verfahren.
fr: Il y a un système simple (la base de données <literal>MIA</literal>) dans laquelle les informations sur les responsables supposés manquant à l'appel (« <literal>Missing In Action</literal> ») sont enregistrées. Quand un membre du groupe <literal>QA</literal> contacte un responsable inactif ou trouve plus d'informations sur celui-ci, un enregistrement dans la base de données MIA a lieu. Ce système est disponible dans <filename>/org/qa.debian.org/mia</filename> sur l'hôte <literal>qa.debian.org</literal> et peut être interrogé avec <command>mia-query</command>. Utilisez <command>mia-query --help</command> pour voir comment interroger la base de données. Si aucune information n'a encore été enregistrée pour un responsable inactif ou si vous pouvez ajouter plus d'informations, vous devriez utiliser la procédure suivante.
ja: Missing In Action (行方不明) だと考えられているメンテナについての情報が記録されるシンプルなシステム (MIA データベース) があります。品質保証グループ (QA グループ) のメンバーが活動的ではないメンテナに連絡を取った場合や、そのメンテナについて新たな情報がもたらされた場合、その記録が MIA データベースに残されます。このシステムは <literal>qa.debian.org</literal> ホスト上の <filename>/org/qa.debian.org/mia</filename> で利用可能になっており、<command>mia-query</command> ツールで検索ができます。どうやってデータベースを検索するのかについては <command>mia-query --help</command> と入力してください。活動的ではないメンテナについての情報がまだ記録されていない、あるいはそのメンテナについての情報を追加できる場合は、おおよそ以下の手続きを行う必要があります。

source: The first step is to politely contact the maintainer, and wait a reasonable time for a response. It is quite hard to define reasonable time, but it is important to take into account that real life is sometimes very hectic. One way to handle this would be to send a reminder after two weeks.
de: Im ersten Schritt kontaktieren Sie den Betreuer höflich und warten eine angemessene Zeit auf eine Antwort. Es ist ziemlich schwer zu definieren, was eine angemessene Zeit ist, aber es ist wichtig zu berücksichtigen, dass das wahre Leben manchmal sehr hektisch ist. Eine Möglichkeit damit umzugehen wäre es, nach zwei Wochen eine Erinnerung zu senden.
fr: La première étape est de contacter poliment le responsable et d'attendre une réponse pendant un temps raisonnable. Il est assez difficile de définir le « temps raisonnable », mais il est important de prendre en compte que la vraie vie est parfois assez mouvementée. Une façon de gérer cela pourrait être d'envoyer un rappel après deux semaines.
ja: 最初の一歩はメンテナに丁寧にコンタクトを取り、応答するのに充分な時間待つことです。充分な時間というのを定義するのは非常に困難ですが、実生活では時折非常に多忙になるのを考慮に入れると重要なことです。一つのやり方としては、リマインダーを二週間後に送るという方法があります。

source: If the maintainer doesn't reply within four weeks (a month), one can assume that a response will probably not happen. If that happens, you should investigate further, and try to gather as much useful information about the maintainer in question as possible. This includes:
de: Falls der Betreuer nicht innerhalb von vier Wochen (einem Monat) antwortet, kann davon ausgegangen werden, dass wahrscheinlich keine Antwort mehr kommt. Falls dies geschieht, sollten Sie weiter nachforschen und versuchen so viele nützliche Informationen wie möglich über den betreffenden Betreuer zu sammeln. Dies beinhaltet:
fr: Si le responsable ne répond pas après quatre semaines (un mois), on peut supposer qu'il n'y aura probablement pas de réponse. Si ceci se produit, vous devriez poursuivre vos investigations et essayer de réunir toutes les informations utiles sur ce responsable. Ceci inclut :
ja: メンテナが４週間 (１ヶ月）応答をしない場合、おそらく反応がないと判断できます。この様な場合はより詳細に確認し、可能な限り問題となっているメンテナに関する有用な情報をかき集める必要があります。これには以下のようなものが含まれています。

source: The <literal>echelon</literal> information available through the <ulink url="&url-debian-db;">developers' LDAP database</ulink>, which indicates when the developer last posted to a Debian mailing list. (This includes mails about uploads distributed via the &email-debian-devel-changes; list.) Also, remember to check whether the maintainer is marked as on vacation in the database.
de: die <literal>echelon</literal>-Informationen, die über die <ulink url="&url-debian-db;">debian.org Developers LDAP Search</ulink> verfügbar sind. Sie geben an, wann der Entwickler zum letzten Mal an eine Debian-Mailingliste geschrieben hat. (Dies umfasst Mails über Uploads, die über die Liste &email-debian-devel-changes; verteilt wurden.) Denken Sie außerdem daran zu prüfen, ob der Betreuer in der Datenbank als im Urlaub befindlich markiert ist.
fr: les informations « <literal>echelon</literal> » disponibles dans la <ulink url="&url-debian-db;">base de données LDAP des développeurs</ulink>, qui indiquent quand le développeur a envoyé un message pour la dernière fois sur une liste de diffusion Debian (cela inclut les envois via les listes &email-debian-devel-changes;). Pensez aussi à vérifier si le responsable est indiqué comme en vacances dans la base de données ;
ja: <ulink url="&url-debian-db;">開発者 LDAP データベース</ulink> を通じて得られる <literal>echelon</literal> 情報は、開発者が最後に Debian メーリングリストに投稿したはいつなのかを示します (これには &email-debian-devel-changes; での配布物のアップロードのメールも含まれます)。また、データベースでメンテナが休暇中かどうかも確認してください

source: The number of packages this maintainer is responsible for, and the condition of those packages. In particular, are there any RC bugs that have been open for ages? Furthermore, how many bugs are there in general? Another important piece of information is whether the packages have been NMUed, and if so, by whom.
de: die Zahl der Pakete, für die dieser Betreuer verantwortlich ist und den Zustand dieser Pakete. Hauptsächlich, ob es release-kritische Fehler gibt, die seit Jahren offen sind. Ferner wie viele Fehler es im Allgemeinen sind. Ein weiteres wichtiges Teil der Informationen ist, ob für die Pakete NMUs durchgeführt werden und wenn, von wem.
fr: le nombre de paquets de ce responsable et l'état de ces paquets. En particulier, reste-t-il des bogues empêchant l'intégration des paquets dans la distribution qui sont ouverts depuis des lustres ? De plus, combien de bogues y a-t-il en général ? Un autre renseignement important est si les paquets ont subi des NMU, et si oui, par qui ;
ja: このメンテナが対応しているパッケージ数やパッケージの状態。特に、長期間放置され続けている RC バグがあるかどうか? さらに通常どの程度の数のバグがあるか? もう一つの重要な情報はパッケージが NMU されているかどうか、されているとしたら誰によって行われているか、です。

source: Is there any activity of the maintainer outside of Debian? For example, they might have posted something recently to non-Debian mailing lists or news groups.
de: Gibt es irgendeine Aktivität des Betreuers außerhalb von Debian? Er könnte zum Beispiel aktuell etwas an eine Nicht-Debian-Mailingliste oder an Newsgroups geschrieben haben.
fr: est-ce que le responsable est actif en dehors de Debian ? Par exemple, il peut avoir envoyé des messages récemment à des listes de diffusion non-Debian ou des groupes de discussion ;
ja: Debian 以外でメンテナの活動があるかどうか? 例えば、近頃 Debian 以外のメーリングリストや news グループへの投稿をしているなど。

source: A bit of a problem are packages which were sponsored — the maintainer is not an official Debian developer. The <literal>echelon</literal> information is not available for sponsored people, for example, so you need to find and contact the Debian developer who has actually uploaded the package. Given that they signed the package, they're responsible for the upload anyhow, and are likely to know what happened to the person they sponsored.
de: Ein ziemliches Problem sind Pakete, die gesponsort wurden — der Betreuer ist kein offizieller Debian-Entwickler. Die <literal>echelon</literal>-Informationen sind nicht für gesponsorte Leute verfügbar, so dass Sie beispielsweise den Debian-Entwickler finden und kontaktieren müssen, der das Paket tatsächlich hochgeladen hat. Angenommen, das Paket wurde signiert, dann ist er dennoch für das Paket verantwortlich und weiß wahrscheinlich, was mit der Person geschah, die er sponsorte.
fr: Un problème particulier est représenté par les paquets parrainés — le responsable n'est pas un développeur Debian officiel. Les informations « <literal>echelon</literal> » ne sont pas disponibles pour les personnes parrainées, par exemple ; vous devez donc trouver et contacter le responsable Debian qui a réellement envoyé le paquet. Étant donné qu'il a signé le paquet, il est responsable de l'envoi de toute façon et il sait probablement ce qui s'est passé avec la personne qu'il parraine.
ja: パッケージがスポンサーされている、つまりメンテナが公式の Debian 開発者ではない場合はちょっとした問題となります。例えば <literal>echelon</literal> の情報は、スポンサーされている人は利用できません。そのため実際にパッケージをアップロードした Debian 開発者を探して確認を取る必要があります。彼らがパッケージにサインしたということは、アップロードについて何であれ責任を持ち、スポンサーした人に何が起こっているかを知っていそうだということです。

source: It is also allowed to post a query to &email-debian-devel;, asking if anyone is aware of the whereabouts of the missing maintainer. Please Cc: the person in question.
de: Es ist außerdem erlaubt, eine Anfrage an &email-debian-devel; zu senden und zu fragen, ob jemand etwas über den Verbleib des vermissten Betreuers weiß. Bitte senden Sie der Person, um die es geht, per Cc: eine Kopie.
fr: Il est également permis d'envoyer une demande à &email-debian-devel; demandant si quelqu'un a des informations sur le responsable manquant. Veuillez mettre en <literal>CC</literal> la personne en question.
ja: &email-debian-devel; に、活動が見えないメンテナの居所に誰か気づいているかという質問を投稿するのもありです。問題の人を Cc: に入れてください。

source: Once you have gathered all of this, you can contact &email-mia;. People on this alias will use the information you provide in order to decide how to proceed. For example, they might orphan one or all of the packages of the maintainer. If a package has been NMUed, they might prefer to contact the NMUer before orphaning the package — perhaps the person who has done the NMU is interested in the package.
de: Sobald Sie als dies gesammelt haben, können Sie &email-mia; kontaktieren. Leute mit diesem Alias werden die von Ihnen bereitgestellten Informationen nutzen, um zu entscheiden, wie verfahren wird. Beispielsweise könnten Sie eines oder alle Pakete des Betreuers verwaisen. Falls für ein Paket ein NMU durchgeführt wurde, könnten sie es vorziehen vor dem Verwaisen des Pakets denjenigen zu kontaktieren, von dem der NMU durchgeführt wurde — vielleicht ist diese Person daran interessiert das Paket zu übernehmen.
fr: Une fois réunies toutes ces informations, vous pouvez contacter &email-mia;. Les personnes de cet alias utiliseront les informations que vous aurez fournies pour décider comment procéder. Par exemple, elles peuvent abandonner tout ou partie des paquets du responsable. Si un paquet a subi une NMU, elles peuvent préférer contacter le responsable ayant fait cette NMU — il pourrait être intéressé par le paquet.
ja: ここに書かれた全てを収集したなら、&email-mia;に連絡しましょう。この名前の宛先を担当している人は、あなたが供給した情報を使ってどう進めるかを判断します。例えば、そのメンテナのパッケージの一部または全てをみなしご化 (Orphan) するかも知れません。パッケージがNMUされていた場合は、パッケージをみなしご化 (Orphan) する前にNMUをした人に連絡する事を選ぶかもしれません — NMUをした人はきっとパッケージに関心があるでしょうから。

source: One last word: please remember to be polite. We are all volunteers and cannot dedicate all of our time to Debian. Also, you are not aware of the circumstances of the person who is involved. Perhaps they might be seriously ill or might even have died — you do not know who may be on the receiving side. Imagine how a relative will feel if they read the e-mail of the deceased and find a very impolite, angry and accusing message!
de: Eine abschließende Bemerkung: Bitte denken Sie daran, höflich zu bleiben. Alle hier sind Freiwillige und können nicht sämtliche Zeit Debian widmen. Außerdem wissen Sie nichts über die Situation der beteiligten Person. Vielleicht ist sie ernsthaft erkrankt oder sogar verstorben — Sie wissen nicht, wer auf der Empfängerseite ist. Stellen Sie sich vor, wie sich ein Verwandter fühlt, wenn er die E-Mail des Verstorbenen liest und eine sehr unhöfliche, böse oder vorwurfsvolle Nachricht findet!
fr: Un dernier mot : veuillez rester poli. Tout le monde est volontaire et ne peut dédier l'intégralité de son temps à Debian. Vous n'êtes pas non plus au courant des conditions de la personne impliquée. Elle est peut-être sérieusement malade ou pourrait même nous avoir définitivement quitté — vous ne savez pas qui recevra vos courriers. Imaginez le sentiment d'un proche qui lit un courrier pour la personne décédée, et trouve un message très impoli, de colère et accusateur !
ja: 最後に一言: 礼儀正しく振る舞いましょう。我々は所詮ボランティアで、全ての時間を Debian に捧げられるわけではありません。また、関わっている人の状況がわかるわけでもありません。重い病気にかかっているかかもしれないし、あるいは死んでしまっているかもしれません - メッセージを受け取る側にどんな人がいるかは分かりません。亡くなった方のご親戚の方がメールを読んだ場合に、非常に無礼で怒った叱責調のメッセージを見つけてどうお感じになるかを想像してください。

source: On the other hand, although we are volunteers, we do have a responsibility. So you can stress the importance of the greater good — if a maintainer does not have the time or interest anymore, they should let go and give the package to someone with more time.
de: Andererseits besteht trotz Freiwilligkeit auch eine Verantwortung. So können Sie die Wichtigkeit eines übergeordneten Wohls betonen — falls ein Betreuer keine Zeit oder kein Interesse mehr hat, sollte er gehen und das Paket jemandem mit mehr Zeit geben.
fr: D'un autre côté, bien que tout le monde soit volontaire, tout le monde est responsable. Vous pouvez donc insister sur l'importance du plus grand intérêt — si un responsable n'a plus le temps ou l'envie, il devrait « laisser filer » et donner le paquet à quelqu'un ayant plus de temps.
ja: 一方で、我々はボランティアではありますが責任を持っています。全体の幸せの重要性をよく考える必要があります — もしメンテナが時間が足りなかったり、もう興味を無くしてしまった場合は、パッケージを誰か他のより時間がある人間に与えるべきです。
